{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt1533818",
      "video": false,
      "title": "The Big Picture",
      "recommendations": [
         1553,
         68944,
         33095,
         47856,
         14949,
         1826,
         35164,
         31325,
         50848,
         1555,
         15702,
         11957,
         43616,
         40419,
         216457,
         93188,
         274483,
         12169,
         199549,
         33302
      ],
      "backdrop_path": "/3G6usr2OUrFkJTWWpAYRTRdJZ0K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Exben",
               "gender": 2,
               "credit_id": "52fe47dfc3a36847f814cfad",
               "name": "Romain Duris",
               "profile_path": "/2pFMVxyKbVkULNWqXbqFb3TV7zK.jpg",
               "id": 17497,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe47dfc3a36847f814cfb1",
               "name": "Marina Foïs",
               "profile_path": "/zANSXp01BRk5hdPDrea11FJloh2.jpg",
               "id": 76820,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe47dfc3a36847f814cfb5",
               "name": "Catherine Deneuve",
               "profile_path": "/6w0mcMkjLPSIj9iXMKNinxIHRyH.jpg",
               "id": 50,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bartholomé",
               "gender": 2,
               "credit_id": "52fe47dfc3a36847f814cfbf",
               "name": "Niels Arestrup",
               "profile_path": "/nmY1YLZN2rZ4JeLmzA3thQLaMUt.jpg",
               "id": 17498,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Ivana",
               "gender": 0,
               "credit_id": "52fe47dfc3a36847f814cfd3",
               "name": "Branka Katić",
               "profile_path": "/6dtxxJyeGL5kHpUEeshDfe3T4wB.jpg",
               "id": 15268,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Grégoire Kremer",
               "gender": 2,
               "credit_id": "52fe47dfc3a36847f814cfd7",
               "name": "Eric Ruf",
               "profile_path": "/4nCXtWINsCpLrM6j63B6YH6h92Y.jpg",
               "id": 229968,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hugo Exben",
               "gender": 0,
               "credit_id": "52fe47e0c3a36847f814cfdb",
               "name": "Enzo Caçote",
               "profile_path": null,
               "id": 1097962,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Baptiste",
               "gender": 0,
               "credit_id": "52fe47e0c3a36847f814cfdf",
               "name": "Luka Antic",
               "profile_path": null,
               "id": 1097961,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Fiona Exben",
               "gender": 0,
               "credit_id": "52fe47e0c3a36847f814cfe3",
               "name": "Rachel Berger",
               "profile_path": null,
               "id": 217427,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Valéry Grey",
               "gender": 0,
               "credit_id": "577c6759c3a3683f8f000c4d",
               "name": "Esteban Carvajal-Alegria",
               "profile_path": "/ibSnOtURXmIzQ3NNfPCJMmn83Fz.jpg",
               "id": 76907,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47dfc3a36847f814cfbb",
               "name": "Eric Lartigau",
               "profile_path": "/7tMUb274bl7JqTzguhWnovKx4Pw.jpg",
               "id": 85340,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47dfc3a36847f814cfc9",
               "name": "Douglas Kennedy",
               "profile_path": null,
               "id": 51669,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47dfc3a36847f814cfcf",
               "name": "Stéphane Cabel",
               "profile_path": null,
               "id": 51322,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 3.693567,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 51071,
      "vote_count": 52,
      "budget": 0,
      "overview": "Paul Exben is a success story – partner in one of Paris's most exclusive law firms, big salary, big house, glamorous wife and two sons straight out of a Gap catalog. But when he finds out that Sarah, his wife, is cheating on him with Greg Kremer, a local photographer, a rush of blood provokes Paul into a fatal error.",
      "similar": [],
      "original_title": "L'homme qui voulait vivre sa vie",
      "runtime": 114,
      "poster_path": "/arTlK4dyXKTbBI7AFiQgUd9lM60.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "EuropaCorp",
         "id": 6896,
         "origin_country": ""
      }],
      "release_date": "2010-11-03",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Getting the Life You Want Means Losing the Life You Have.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Lartigau"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Eric Lartigau",
         "Laurent de Bartillat"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1533818/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODU4NDM1NDEyNl5BMl5BanBnXkFtZTcwMjk0Mzk1OA@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Romain Duris, Marina Foïs, Niels Arestrup | See full cast and crew »"],
      "reviews": [
         "I saw this film at the 2010 edition of the Toronto International Film Festival, and it was a pleasant surprise. Great performances, tightly directed, and a very compelling storyline, in addition to a being beautifully shot and using some great Magnum Photos in the film as part of the main character's unexpected shift into a new world and a new life. Based on the American writer Douglas Kennedy's acclaimed book of the same name, but changed to a Euro setting, director Eric Lartigau easily shows how European filmmakers can take the themes of murder, obsession and identity to new artistic heights, while also giving us one of the best thrillers of 2010. It's a thriller as cinematic art as only the Europeans can do. The film might not have gotten as much attention as other films at TIFF 2010, but it definitely should. I truly hope it gets a wider release here in Canada and elsewhere. Seek it out. Decidedly worthwhile.",
         "I really have to write a review about this great French thriller. Firstly, although not a French Language expert, the original title which means roughly - THE MAN WHO WANTED TO CHANGE HIS LIFE - is much more appropriate than THE BIG PICTURE. Although the circumstances that lead the main character to change his life for something that he should have done years ago were quite shocking, it resonated with me and I am sure so many others. How many of us have not pursued what we were really good at and traded ourselves in to the banal life of the office, security of the pension and benefits etc. etc. The list goes on. If you can watch this film twice then do as you will appreciate it even more. The acting is very good. The ending may confuse some and I have not ticked the spoiler box so will not give anything away. After leaving the auditorium you will piece it together though. Overall an excellent film. The main actor was great in Heartbreaker and the same here with THE BIG PICTURE.",
         "Eric Lartigau's thriller is a cunning film. The tension remains right up to the end, although it's also rather disappointing that it has gone nowhere. Romain Duris' Paul has either got some sort of deep-hidden secret (popped into relief by the suggestion that he had an exciting creative career ahead of him that he abandoned) that is to be revealed or we are to discover some moral to his pursuit of 'the life he wants to live' (to borrow the French title). Instead the film is actually in each of the episodes along the way that Lartigau concocts; how Paul builds something from a situation that seems simple and moves on from it when it becomes complicated. It's fluid, liberating but strangely unedifying. I liked the editing and the location shooting of both Paris and South East Europe. Niels Arestrup puts in a small turn later on which is as good as anything else in the film, including Catherine Deneuve's professional appearance. Slick but slippery 5/10",
         "I ask this because if a film has no end is it still a good film?. I found it a complete and utter bail out, and will not agree with any excuses such as 'it didn't need an end' or 'we all understood what happens next'. This was all the more frustrating as the movie was really good, when it ended I thought I had sat on the remote control, but it ended I was astonished and felt cheated. Another thing that is absurd, is why did he take the dead mans identity? it was so obvious that it would lead to the issues he faced, anyone could have foreseen that, and for a Lawyer (or a chimpanzee) not to have had this foresight was simply inconceivable. Anyway apart from these huge issues it was entertaining for 2 thirds of the movie namely the beginning and the middle the last 3rd the ending just didn't exist. Still worth watching though.",
         "Eric Lartigau's film, 'The Big Picture', begins as a thriller, but ends more as an existential meditation on life (the literal translation of its French title, 'The Man Who Wanted to Live his Life', is much more apt than its dull replacement). A man ends up living, first in the shoes of another man, and ultimately as an anonymous nobody: he initial decision to give up his identity is a choice, albeit in straightened circumstances, but its consequences have to be experienced to be understood. The initial portion of the film has the feel of a thriller and does not seem especially well-acted; the latter half is more interesting, but overall, an abbreviated feel permeates the movie. Whereas Antonioni's 'The Passenger', which I also saw recently and which follows a similar course, is all about mood (only hinting at plot), here the balance is different, and the more interesting, introspective aspects are occasionally rushed. There's a lot of interest here, and some ambition on the part of the director; but some of its ideas could, I think, have been allowed a bit more space to breathe.",
         "The failure of a professional photographer to use the latest equipment is a good metaphor for this movie, whose English title makes no sense. It seems like it was shot from the original script submission before any grownups had a chance to edit the story. Terrific performances by all the actors, but a story line so sloppy that I re-animated my disbelief about half-way through. For me the most enjoyable aspect was the glimpse to life in various venues around (and near) Europe. I would love to have seen this in the hands of Alfred Hitchcock. He would have lent credibility to the desperation, which I felt was contrived and forced on me. I'll bet they ran out of money while filming and couldn't afford the ending they'd originally planned.",
         "The Big Picture (2010) Terrific vibes here, and a euphoric basic idea of a man getting out of a troubled situation and going for broke, for happiness. Literally, and spiritually. First there is the set-up: a happy, charming, positive Paul Exben (played by the cheerful French actor Romain Duris). He's got an unhappy, negative wife and a kid who loves him and an infant who doesn't know what he wants (except to cry a lot). He's a photographer in the new manner, using high tech computers and high end printers. He loves being who he is, and is very successful financially. But the wife is bitter and unyielding. Things are going to go wrong and they do. Exactly how (involving another photographer, a man who is very old school with a darkroom and enlarger) is partly what the movie is about, and the surprise is one of its peaks. Then the movie takes some amazing turns. I say amazing but really there is a lot of incredulity built in. Would Paul Exben really go so far? Wasn't there a simpler solution (many of them)? If the end goal really was to \"start over\" in a manner of speaking, wouldn't there be ways of doing that and not sabotaging everything else? Maybe not, but then we should have been set up better for all the implications. The movie's original title is \"L'homme Qui Voulait Vivre Sa Vie,\" or \"The Man Who Wanted to Live His Life.\" That's sooooo much better and more compelling. And that's what the movie is about. But the English title reminds us that photography, and this photographer, are central to it all, and I'm a photographer. I've been that old school type (by necessity) for decades and still have an enlarger (and a university darkroom) at my fingertips. But I have also moved almost completely into new school photography with inkjet printing and such. I have to say, this movie made me want to get back in the darkroom. Not that there are scenes that romanticize that. More that there are lots of flaws and mistakes in pointing out the differences. Our man Exben ends up ditching his fancy Canon gear and getting an old Nikon film camera and a couple of lenses. Then he starts to print, rediscovering his roots. And then on his darkroom wall are some color prints--absolutely impossible with some trays as shown. And pretty much not possible period these days. Yet his new direction in color is what takes his career new places. I found the photography stuff annoying and enchanting, both. If you're not into the field, you'll probably just like the enchantment part. Never mind the far too easy gallery luck near the end. But the movie is about what the French title suggests--and here it falters, too. Is this a man who is really living his life? In some obvious ways yes. But the existential drama could have (and should have?) taken this far deeper. By the final scenes where our man is photographing a horrifying event from a distance (and then sells some illogically close-up photos of the event to a publisher) we get a sense that he is truly dedicated. But also a bit lost. An opportunist. A man who accepts being trapped by circumstance. In a way, this is a movie waiting to be remade. It wouldn't take much to make it a classic look at the human condition, with some attractive hooks along the way. What we have isn't so bad, but it offers more than it delivers.",
         "At the beginning of the story in this film the hero seems to be at the peak of his life. He has it all - a comfortable life, a wife and two kids, he lives in a villa in the province and works in Paris as a successful lawyer on the brink of becoming lead of a lawyer office (inherited from a terminally sick woman played by Catherine Deneuve who has only three short scenes, but so great to see her still beautiful and in good acting form). At the end he has nothing, is a fugitive with no identity. And yet, the story is the one of fulfillment as the hero while losing his status and family will find himself, a new profession and passion. It's a very well written story and script (based on a novel by Douglas Kennedy). It also is a more than satisfying crime story (albeit it's about an accidental murder) which as some point in time plays with the theme of the first book in the Bounty Identity series, with the murderer taking over the identity of the victim, and finding refuge in the least policed place in Europe (at least according to the script). It so happens that the victim was a photographer, and while trying to mimic his way of life the hero develops a passion and discovers a talent in the profession, actually a stronger talent than of the one of the true owner of the name. Succeeding means however acquiring fame, and this puts under risk his second identity. I will stop here in order to not disclose too much of the rest of the story, but I will just say that the mixture of crime story, stolen identity, and self-discovery works quite well in 'L'homme qui voulait vivre sa vie' (the English title is 'The Big Picture'). Much of the film rests on the shoulders of Romain Duris and he is doing a fine job. I do not know too much about director Eric Lartigau, but he is telling the story and leading his team with a good professional hand. 'L'homme qui voulait vivre sa vie' is a god thriller and a compelling drama about a man who breaks twice the frames of his life, finding himself when he seems to have lost everything.",
         "Let's start by saying that this is quite an unique thriller. For one thing, once the film passes the triggering factor that is the murder of Kremer, there's barely any dialogue. It not only shows the psychological effects the main character goes through once he flees France, but also brings the soundtrack forward. That is one other strong point of the movie, as the soundtrack that was composed for it is absolutely splendid, the music actually does wonders about sticking us in front of the film until the very end, as it is a perfect match for what's happening before our very eyes. It can also be said that the way the actors play their characters is convincing to say the less. Romain Duris, even without talking much, actually says a lot just by the way he plays his character. The movie nearly missed a perfect note because of two elements. First, it starts too fast, we barely know the characters, what they do, and what are the relationships between them when Kremer gets killed. A more developed introduction could have helped. The second thing is the way the movie ends. The film still feels incomplete by the end, and while that lets room for your imagination to fill, it would have been nice if they ended the movie in a more decisive way than by just letting Exben go walking the streets of yet another country. Nonetheless, The Big Picture, or, if we use its most appropriate title (translated from French) « The Men That Wanted To Live His Life » is definitely a film any thriller and/or drama fan will want (and have) to see someday.",
         "To live one's life? The title may seem a bit too grand, in between an 18th, or 19th century moral tale crossed with french existentialist uneasiness, but the film lives up to it, turning it obliquely into a canvas of political contemporary matters. To give away what happens is to betray its mood, a mood that spills over into matters that retain and resume their urgency, and are crisply clarified in the last sequences, but I will give away a plot-line: Romain Duris lives an uneasy life, has a chillingly distant wife (she is superb), loves his kids, and arguably does not know, despite his professional panache (guaranteed by the way his home looks like and some dialogue with visitors in his office), what adult life means and how it is signaled about. He then gathers his failing marriage has an antagonist, who, in perfect french manner, does not want to be an antagonist at all, it is just the way life goes, outside how you want to live it, if you are adult and manly enough. An ugly accident happens. He has to change his life. And he does: long, ominous takes that succumb into atmospheric lakes, leaks into the artistry he wanted to pursue and he now does, but with no guarantee. It is only in its aftermath - of his amorous new situation, and how the past reappears - that he meets his destiny. What recapitulates the trajectory is the last sense of political complicity in the perilous open, a new social, humane if fragile contract. This is a film in the best way of European political films that even pave the way to a new leftist sensibility; Romain Duris is a No-man, rather than an Everyman, that has a knack, though this may seem gratuitous, to appear most elegant in his shoes. It is some time an actor had that elegance, and also some sense of contrasted foregrounding with what takes its trail on screen."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "EuropaCorp",
         "TF1 Films Production",
         "CiBy 2000"
      ],
      "summaries": ["Paul Exben is a success story - partner in one of Paris's most exclusive law firms, big salary, big house, glamorous wife and two sons straight out of a Gap catalog. But when he finds out that Sarah, his wife, is cheating on him with Greg Kremer, a local photographer, a rush of blood provokes Paul into a fatal error. Standing over the corpse of his wife's lover, Paul knows that his perfect life has gone for good. But by assuming the dead man's identity and fleeing for an isolated part of former Yugoslavia on the beautiful Adriatic coast, Paul gets another shot at being himself and, at last, seeing the big picture."],
      "budget": 0
   },
   "movielensId": 100238,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2010-11-03",
      "dvdReleaseDate": "2013-03-19",
      "directors": ["Eric Lartigau"],
      "runtime": 114,
      "movieId": 100238,
      "title": "The Big Picture",
      "mpaa": null,
      "actors": [
         "Romain Duris",
         "Marina Foïs",
         "Catherine Deneuve",
         "Niels Arestrup",
         "Branka Katić",
         "Eric Ruf",
         "Enzo Caçote",
         "Luka Antic",
         "Rachel Berger",
         "Esteban Carvajal-Alegria"
      ],
      "imdbMovieId": "1533818",
      "originalTitle": "L'homme qui voulait vivre sa vie",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["izIQcj5KnU8"],
      "plotSummary": "Paul Exben is a success story – partner in one of Paris's most exclusive law firms, big salary, big house, glamorous wife and two sons straight out of a Gap catalog. But when he finds out that Sarah, his wife, is cheating on him with Greg Kremer, a local photographer, a rush of blood provokes Paul into a fatal error.",
      "tmdbMovieId": 51071,
      "avgRating": 3.34615,
      "releaseYear": "2010",
      "numRatings": 26,
      "posterPath": "/arTlK4dyXKTbBI7AFiQgUd9lM60.jpg"
   }
}