{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1975158",
      "video": false,
      "title": "Finding Joy",
      "recommendations": [],
      "backdrop_path": "/6p8Fx9F7wHvTbrXGlIzRz5VcakS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kyle",
               "gender": 2,
               "credit_id": "52fe4ae79251416c750f1f23",
               "name": "Josh Cooke",
               "profile_path": "/1C9AwAnSRKj8tX3EWc39n3BpT2z.jpg",
               "id": 84815,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Joy",
               "gender": 1,
               "credit_id": "52fe4ae79251416c750f1f27",
               "name": "Liane Balaban",
               "profile_path": "/q7rVb0X3kEtNOixAIExVu0vgBnl.jpg",
               "id": 54817,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Alan",
               "gender": 2,
               "credit_id": "52fe4ae79251416c750f1f2b",
               "name": "Barry Bostwick",
               "profile_path": "/z2jlL5g5PMxelSHMXFF03fTSsLl.jpg",
               "id": 13473,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe4ae79251416c750f1f2f",
               "name": "Lainie Kazan",
               "profile_path": "/qI20obSkCyWbo13xh20rWeUuMXp.jpg",
               "id": 53647,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ae79251416c750f1f1f",
               "name": "Carlo De Rosa",
               "profile_path": null,
               "id": 1117745,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ae79251416c750f1f35",
               "name": "Shona Tuckman",
               "profile_path": null,
               "id": 1181478,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.759401,
      "production_countries": [],
      "id": 142650,
      "vote_count": 5,
      "budget": 0,
      "overview": "Pompous and self-absorbed Kyle, is unhappily stuck in his life, longing to relive the success of his first novel. His not-so-desirable life rapidly unravels forcing him to return home to his wildly eccentric family with his tail between his legs.  Life at home begins to show signs of improvement when Kyle meets the spunky, vivacious girl across the street who recruits Kyle to help her make the world a better place, making him feel alive for the first time in ages and inspiring his writing. But its short-lived. Joys been told shes going to die soon and wants Kyle to write her obituary.",
      "similar": [],
      "original_title": "Finding Joy",
      "runtime": 96,
      "poster_path": "/qiSVjY6cg5Jw9kj3rafvzW2mOwV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-06-07",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.findingjoythemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Carlo De Rosa"],
      "runtime": 96,
      "synopsis": "Pompous and self-absorbed KYLE LIVINGSTON, mid-30s, (Josh Cooke), is unhappily stuck in his life, longing to relive the success of his first novel. His not-so-desirable life rapidly unravels forcing him to return home to his wildly eccentric family with his tail between his legs, only to discover his estranged father, ALAN, 60s, (Barry Bostwick), a handsome agoraphobic curmudgeon, has converted his old bedroom into a tacky bathroom, fueling Kyles rage against his family his older brother MARSHALL, 40s, (Tyler Bunch) a goofball telemarketer with a secret, his sister-in-law PATSY, late 30s, (Kiki Harris), a highly strung former cheerleader in the middle of a meltdown, MEL , 14, (Arielle Hoffman) their wise, sensitive, largely ignored daughter, and GLORIA, 60s, (LAINIE KAZAN) Alans exuberant, nurturing live-in lady friend. Life at home begins to show signs of improvement when Kyle meets the spunky, vivacious girl across the street JOY BAILEY, late 20s, (LIANE BALABAN), a delightfully offbeat bohemian beauty who recruits Kyle to help her make the world a better place, making him feel alive for the first time in ages and inspiring his writing. But its short-lived. Joys been told shes going to die soon and wants Kyle to write her obituary. As Kyle spends more and more time getting to know Joy, he accidentally falls in love and grows increasingly skeptical of her claim shes dying. With the help of his wacky family, Kyle hopes to convince Joy she has many good years left and should spend them with him. But does fate have other plans?",
      "writers": ["Shona Tuckman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1975158/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNTU5MjYxMF5BMl5BanBnXkFtZTcwMDMwMDE5OA@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Josh Cooke, Liane Balaban, Barry Bostwick | See full cast and crew »"],
      "reviews": [
         "A quaint little tale about a writer and a dysfunctional family. I really enjoyed this, it was funny, witty and had a good little message about life hidden between the absurdity of the characters. If you liked 'little miss sunshine' and/or 'meet the fockers' or that sort of movie you would prob enjoy this too. I was not sure what to expect from this as there was no review written for it yet, nor did I know much about the actors as I do not tend to watch a lot of TV series. Overall, however, I thought it was quite well acted. I noted that most of the directors previous works were all shorts so if this is his first attempt at a full length feature it is very impressive and I am sure we will be seeing more brilliance from him in the future. The story is well written too and the storyline is clever without trying to be overly clever, nor is the comedy element overly bearing. It is the type of movie that always leaves you wanting a little bit more and hopefully in time perhaps they could build on this little gem. I was a little bit down and bored this evening and this was just what I needed.",
         "Not a bad film that capitalizes on the most overused plot device of the entire rom com genre. Pretty girls don't approach awkward losers. It just doesn't happen, ever. If you can suspend disbelief over that fantasy, the film is entertaining and features very fine performances, hilarity, a little farce, and some of the poignancy that marks a good rom com. Who doesn't get a kick out of family dysfunction and loser gets the girl stories? Watch it with someone ;-p ."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Kreate Films"],
      "summaries": ["A self-absorbed writer, stuck in more ways than one, rediscovers himself, his offbeat family, and what it means to be happy when he meets Joy, a spirited young woman who asks him to write her obituary."],
      "budget": 0
   },
   "movielensId": 100347,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-06-07",
      "dvdReleaseDate": null,
      "directors": ["Carlo De Rosa"],
      "runtime": 96,
      "movieId": 100347,
      "title": "Finding Joy",
      "mpaa": "NR",
      "actors": [
         "Josh Cooke",
         "Liane Balaban",
         "Barry Bostwick",
         "Lainie Kazan"
      ],
      "imdbMovieId": "1975158",
      "originalTitle": "Finding Joy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["mU5Dhcjmkaw"],
      "plotSummary": "Pompous and self-absorbed Kyle, is unhappily stuck in his life, longing to relive the success of his first novel. His not-so-desirable life rapidly unravels forcing him to return home to his wildly eccentric family with his tail between his legs.  Life at home begins to show signs of improvement when Kyle meets the spunky, vivacious girl across the street who recruits Kyle to help her make the world a better place, making him feel alive for the first time in ages and inspiring his writing. But its short-lived. Joys been told shes going to die soon and wants Kyle to write her obituary.",
      "tmdbMovieId": 142650,
      "avgRating": 2.875,
      "releaseYear": "2013",
      "numRatings": 4,
      "posterPath": "/qiSVjY6cg5Jw9kj3rafvzW2mOwV.jpg"
   }
}