{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "marital separation",
            "id": 171848
         }
      ],
      "imdb_id": "tt1313139",
      "video": false,
      "title": "The Oranges",
      "recommendations": [
         34494,
         84174,
         87567,
         41413,
         38303,
         13159,
         13067,
         4379,
         13596,
         15019,
         15648,
         10188,
         70868,
         16899,
         13401,
         9779,
         4599,
         7303,
         9007,
         41174
      ],
      "backdrop_path": "/xfg7Q5Q5BBNlp0YOSzFk5dLE2Ba.jpg",
      "revenue": 1941667,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Nina Ostroff",
               "gender": 1,
               "credit_id": "52fe4a0b9251416c910c15fd",
               "name": "Leighton Meester",
               "profile_path": "/t4wEyg0f1hZbS38419RY7iNoOt7.jpg",
               "id": 85825,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "David Walling",
               "gender": 2,
               "credit_id": "52fe4a0b9251416c910c1601",
               "name": "Hugh Laurie",
               "profile_path": "/3qCmEHtq5fBW8dbzsYDSy16Zqb0.jpg",
               "id": 41419,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Vanessa Walling",
               "gender": 1,
               "credit_id": "52fe4a0b9251416c910c1605",
               "name": "Alia Shawkat",
               "profile_path": "/5BCMGRSGGVnxP9KhJxnIdtVQltZ.jpg",
               "id": 61178,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Carol Ostroff",
               "gender": 1,
               "credit_id": "52fe4a0b9251416c910c1609",
               "name": "Allison Janney",
               "profile_path": "/cDcB8mKP1GiIeoM3Qe7GIucs0iv.jpg",
               "id": 19,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Paige Walling",
               "gender": 1,
               "credit_id": "52fe4a0b9251416c910c160d",
               "name": "Catherine Keener",
               "profile_path": "/tEBdqBUduF3dBcJcBeY5ffZ9MMu.jpg",
               "id": 2229,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Toby Walling",
               "gender": 2,
               "credit_id": "52fe4a0b9251416c910c1611",
               "name": "Adam Brody",
               "profile_path": "/jeMhuu9Q81XJLIef1OU7NlcxRW0.jpg",
               "id": 11702,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Terry Ostroff",
               "gender": 2,
               "credit_id": "52fe4a0b9251416c910c1615",
               "name": "Oliver Platt",
               "profile_path": "/an9n3aUKFAN50GDsbqwIkvWlcus.jpg",
               "id": 17485,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Christmas Caroler",
               "gender": 0,
               "credit_id": "563fcd04c3a3681b5202f49f",
               "name": "Ian Helfer",
               "profile_path": "/j1L3j1SdhnvWiKtHRFn6wCzYugj.jpg",
               "id": 1105485,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Maya",
               "gender": 1,
               "credit_id": "563fcd32925141781900cde0",
               "name": "Aya Cash",
               "profile_path": "/xoZn7H0to2NwBtNj2knjUVtgsFW.jpg",
               "id": 133451,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a0b9251416c910c15f9",
               "name": "Julian Farino",
               "profile_path": null,
               "id": 173667,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a0b9251416c910c161b",
               "name": "Ian Helfer",
               "profile_path": "/j1L3j1SdhnvWiKtHRFn6wCzYugj.jpg",
               "id": 1105485,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a0b9251416c910c1621",
               "name": "Jay Reiss",
               "profile_path": null,
               "id": 1105486,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "56491f199251413ae1008b7c",
               "name": "Stefanie Azpiazu",
               "profile_path": null,
               "id": 230690,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56491f55c3a36826200092fa",
               "name": "Anthony Bregman",
               "profile_path": null,
               "id": 321,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56491f7fc3a368260c00914f",
               "name": "Ian Helfer",
               "profile_path": "/j1L3j1SdhnvWiKtHRFn6wCzYugj.jpg",
               "id": 1105485,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56491fa9c3a368260c00915d",
               "name": "Sam Hoffman",
               "profile_path": null,
               "id": 52991,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56491fec9251413acf00918d",
               "name": "Geoff Linville",
               "profile_path": null,
               "id": 1102579,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "564920159251413acf00919a",
               "name": "Jay Reiss",
               "profile_path": null,
               "id": 1105486,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56492040c3a3682605008bfa",
               "name": "Daniel Revers",
               "profile_path": null,
               "id": 1102580,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "56492070c3a368261400920e",
               "name": "Leslie Urdang",
               "profile_path": null,
               "id": 64179,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5649209f9251413ae1008bf5",
               "name": "Dean Vanech",
               "profile_path": null,
               "id": 236604,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "564920b19251413ade008d88",
               "name": "Steven Fierberg",
               "profile_path": null,
               "id": 63924,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 9.28659,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 89008,
      "vote_count": 210,
      "budget": 7000000,
      "overview": "A man's (Hugh Laurie) affair with his friend's much-younger daughter (Leighton Meester) throws two neighboring families into turmoil.",
      "similar": [
         13,
         112160,
         11007,
         333348,
         11816,
         12920,
         232175,
         100271,
         40807,
         8967,
         1547,
         858,
         866,
         334,
         141,
         185,
         634,
         11631,
         2675,
         14
      ],
      "original_title": "The Oranges",
      "runtime": 90,
      "poster_path": "/9Fid6G5aMB3lRmzZrDXb14Xepap.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "ATO Pictures",
            "id": 1962,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Likely Story",
            "id": 1785,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Olympus Pictures",
            "id": 7400,
            "origin_country": ""
         }
      ],
      "release_date": "2011-09-09",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "It's about to get juicy.",
      "adult": false,
      "homepage": "http://www.orangesthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julian Farino"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Ian Helfer",
         "Jay Reiss"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1313139/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzOTAzODM3Nl5BMl5BanBnXkFtZTcwMjMzOTUzOA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leighton Meester, Hugh Laurie, Catherine Keener | See full cast and crew »"],
      "reviews": [
         "So a guy whose marriage is on the rocks gets together with a girl who has just broken up with her fiancée after she catches him cheating. Yawn? Oh, wait, did I forget to mention that the guy David (Hugh Laurie) is twice as old as the girl Nina (Leighton Meester), who happens to be the daughter of David's best friend Terry (Oliver Platt), and that the two families live across the street from each other? And it gets better: David's daughter Vanessa (Alia Shawkat ) used to be best friends with Nina, and his son Toby (Adam Brodie) is romantically interested in Nina. Now you have the premise of \"The Oranges\". But is this just another movie about naughty May-December relationships (of which the best-in-class is undoubtedly \"The Graduate\")? Not really. The relationship itself is basically a given. It happens quickly at the beginning of the movie, and is almost immediately discovered by Nina's meddling mother (Allison Janney). But rather than ending with this discovery, the film really begins here, exploring the conflicted views of society (or at least of American society) toward such relationships through the lens of the tragicomic reactions of the two families and a few friends. These reactions, which range from awkward to furious, form the heart of the warm, funny, and occasionally touching screenplay by Ian Helfer and Jay Reiss. Some viewers may be dismayed by the moral neutrality of the film. But since when did an intimate relationship between consenting adults, one of whom happens to be unhappily married, require the Hollywood plot line to issue a strong moral condemnation? In general, not since the 1950's, but should there be an exception in this case? What about the May- December thing? And the other lives that were changed -- were they changed for better or worse? Whatever you think about all the questions it raises, I hope you appreciate the spot-on performances by the entire cast, and that you find The Oranges to be as enjoyable and thought-provoking as I did.",
         "¨I'm your ex girlfriend's boyfriend's wife.¨ I'd rather sit through an hour long episode of Dr. House, The OC, or Gossip Girl rather than watch this film starring some of the actors from the above mentioned series. The Oranges was directed by Julian Farino, who I had never heard of before this film. I actually went to see this film because I thought it had an interesting cast. The biggest flaw of The Oranges was its screenplay; written by Ian Helfer and Jay Reiss. The dramedy never quite manages to feel authentic and everything felt like a complete farce. The dialogue in this film felt very light considering the subject matter and the comedic moments weren't effective. The relationships didn't feel real either, although I must admit that the friendship between Laurie's character and Platt's was probably the strongest thing about this movie. Beside the three TV stars: Hugh Laurie, Leighton Meester, and Adam Brody, the film also stars Allison Janney and Catherine Keener whom I always thought looked very much alike. These are all very likable actors, but they were given some really underdeveloped characters and the film never really rang true to me. Other films have tackled this subject matter in much better ways. Examples that come to mind for me are The Graduate and American Beauty, but this movie doesn't even come close to what those films achieved. Despite how much I wanted to like this movie because of the actors, I had a hard time watching this. I would pick any of their television series over this film anytime. The film focuses on the relationship between two Jersey families. On the one hand, we have David (Hugh Laurie) and Paige Walling (Catherine Keener) who have two children: Vanessa (Alia Shawkat) and Toby (Adam Brody), and then we are introduced to their neighbors, the Ostroff's, consisting of Terry (Oliver Platt) and Carol (Allison Janney). Terry and David have been best friends for a long time, and their families get together often. The Ostroff's have a daughter named Nina (Leighton Meester) who decides to return home after five years for the Holidays. Her presence will change things when she falls in love with David. The two begin seeing each other and it has a tremendous effect on both families. Nina convinces David that there are no rules to happiness, but at the same time his decision affects everyone around him. When Paige finds out about this relationship she confronts David and soon everyone's life is affected by this relationship. The film doesn't seem to take sides on the moral issue, but it doesn't ever feel like it takes things seriously either. The entire film felt like a complete waste of time. The relationship between David and Nina never felt authentic and there was no chemistry whatsoever between them. The film really suffers from a poor script and the likable actors aren't enough to save this film. The narration of the film didn't work for me either and I felt like it was simply used to simplify things. The question the film seems to be raising is whether it is really worth doing whatever makes you happy without measuring the consequences and how it can affect the rest of the people around you. At first it seems as if it agrees with this premise, but later their consequences catch up with them. Some characters seem to be better off, but things never remain the same. I think I am getting a little too philosophical for a film that really didn't take itself too seriously, but I definitely felt that something was completely off with The Oranges. It is an awkward film and one I wouldn't recommend. http://estebueno10.blogspot.com/",
         "I saw this movie with zero previous knowledge and it really impressed me. Two neighbouring families in New Jersey (in an area known as The Oranges because the cities there all have the term Orange in their names -- hence the title of the movie) live harmonically next to each other. The children have grown up together, the men go jogging together, they celebrate the holidays together. They have normal problems -- one daughter doesn't seem to get on with her life, the other plans to marry a deadbeat, then breaks up with him because she caught him cheating on her. Her meddling mother wants to hook her up with their neighbour's A-student son, but the wayward daughter opts for his dad (played by Hugh Laurie) instead. Actually, a plausible choice at that point. She's fed up with college boys, needs stability, and they do care for each other. Her new manfriend feels rejuvenated since his marriage has been in the doldrums for some time. After the unlikely lovebirds have kissed, and even before their first date in a no-tell-motel, their budding affair is exposed. And a lot of hell breaks loose. The movie plays out a conundrum scenario. On the one hand, there's nothing wrong with an loving relationship between two consenting adults, right? Nina, the girl hooking up with her family guy neighbour, says it herself in one scene: \"But what if there was no wrong? ... There is no wrong.\" On the other hand, the very proximity between all persons involved turns against the love affair between Nina and David (family guy). David's daughter feels this most acutely: she doesn't want to become a nagging moralizer for family values. On the other hand, she doesn't want her former schoolmate Nina to become her new stepmom either. I find this a great movie about an interesting moral dilemma.",
         "In the conservative West Orange, New Jersey, the Ostroff and Walling families are very close to each other. David Walling (Hugh Laurie) and Terry Ostroff (Oliver Platt) are inseparable best friends and they use to run together everyday. David has problems with his wife Paige (Catherine Keener) and he frequently sleeps alone in the office. Their daughter Vanessa (Alia Shawkat) is a frustrated young woman since she was not well succeeded in her career of designer and their son Toby (Adam Brody) is moving to China in a temporary assignment. Terry's wife Cathy (Allison Janney) ignores him and their daughter Nina (Leighton Meester) moved to San Francisco five years ago. Near the Thanksgiving, Nina's boyfriend Ethan (Sam Rosen) betrays her in her birthday party and Nina returns to the house of her parents. Nina has frictions with her mother and she stays close to David. Soon they have an affair and fall in love with each other, turning the lives of people close to them upside-down. \"The Oranges\" is an original movie about rules, happiness and selfishness. The story shows how selfish people are in an unusual situation that does not follow the establishment. Paige is estranged from David and they are living in separate beds, keeping up appearances. But when David finds a young woman that brings happiness to his life, she has very selfish attitudes instead of divorcing him. Vanessa is a frustrated woman and when she sees the happiness of her father, she never tries to understand and supports him. Ethan is a complete douchebag and Leighton Meester is an adorable young woman. The reaction of Nina's parents is what the viewer would expect from the parents. The conclusion is decent and well resolved. My vote is seven. Title (Brazil): \"A Filha do Meu Melhor Amigo\" (\"The Daughter of My Best Friend\")",
         "Although this film does not have a complicated plot or much depth, I thought it was fun and found myself smiling all the way through. If you are looking for a simple and amusing film this is the one for you. The story observes many real life feelings and situations even if it does cross over into the surreal sometimes. It doesn't have the scripted feeling that so many comedies seem to fall into and keeps a jovial feeling without leaving you cringing. I thought Hugh Laurie was brilliant as House and I have wanted to see him in other things but was put off by the rating on this film. It is never going to be an epic but it is fantastic for what it is. A true feel good movie if you are in the mood for a dose of reality and can put aside some scepticism.",
         "\"The Oranges\" centers on two families, each with mom and dad and former teenage daughter (now a twenty-something daughter), living across the street from each other in West Orange, New Jersey. It's kind of like a dysfunctional family dramedy except the families really do function normal enough and well enough prior to the beginning of the plot. And also it's a comedy. It poses some fairly serious questions but presents them all in a light-hearted, humorous fashion. Paige Walling (Catherine Keener) and David Walling (Hugh Laurie) still have their adult daughter Vanessa (Alia Shawkat) living at home, unable to let go of some hostilities from her teenage years. Carol Ostroff (Allison Janney) and Terry Ostroff (Oliver Platt) are trying to control their daughter Nina (Leighton Meester) but she's off on the other side of the country still acting like a teenager. But after a perceived personal tragedy, Nina comes home. And then comes home Paige and David's successful son Toby (Adam Brody) who's in love with Nina. Two individuals choose to commit, or almost commit, a morally repugnant act. The good thing is, everything is still funny. In the aftermath though, they decide that they're adults, and choose to question the line of morality. Not only is the audience not expecting that, and thus we're forced to start questioning, or stop judging, but the other characters definitely weren't prepared for it, and they start questioning the directions of their own lives. While of course keeping it funny. Another interesting choice the film made was to make Vanessa (Shawkat) the narrator. She is not directly involved in the action, she's only involved in the repercussions, but she's also the type of character that we normally don't think about how she would be affected, but now we're forced to. The character that we would normally associate with in the aftermath is Paige (Keener) but here she puts herself on the sidelines. The highlight of the film, of course, is the incredible cast. The reading of the credits goes something like this: Alia Shawkat � oh, yeah, the girl from Arrested Development, she has some decent comedy skills; Leighton Meester � a new Hollywood \"it\" girl, let's she what she's got; Hugh Laurie � he's always fun and straight from a string of well-deserved Emmy nominations; Allison Janney � awesome (!); Catherine Keener � awesome (!); Oliver Platt � really?! He's a comic genius, this is doubly awesome (!!); and Adam Brody � well, now we've just topped off a dream come true. The best news is that the cast completely delivers. Meester and Laurie are expected to carry the majority of the film, and both do it by playing characters that they've never really played before. Laurie pulls of sympathetic so well and Meester goes a little more subtle to be able to show us what her character is thinking and show us what her character wants people to see. Janney is her usual funny self, so is Brody, while Platt is again at top form delivering some hilariously subtle facial reactions and some comic gold physical comedy. The least famous actor of all of them, Sam Rosen, threatens to steal the whole show as Ethan, Nina's hilariously sympathetic fiancé turned ex-fiancé turned super-apologetic-ex-fiancé. He's relegated to a pretty small role, otherwise the movie would have been about Ethan. And it's not supposed to be. Now that the highlights are all uncovered, it's time for some warnings. The plot is exceedingly simple and we have to wait for each character to catch up to it before the next turn can proceed. For those that are completely invested in each character, this won't be a problem. For those that like fewer characters, this will be a problem. Also depending on where your moral center lies, you could have a conflict with the film's decidedly ambiguous morality. For all the lines the film attempted to cross they went for a much simpler, more dramatic ending, never crossing into the dark comedy territory. That might stop it from reaching more brilliant heights, but it also keeps \"The Oranges\" more consistently enjoyable. Who Might Like This: People who like dysfunctional family dramedies; anybody looking for a comedy that questions some of society's morals; fans of anybody in the main cast.",
         "The Oranges gives the viewer a light hearted look at what is traditionally considered very taboo. A middle aged man whose daughter still lives at home falls in love with his best friends daughter, who happens to be the same age as his daughter. Factor in that he is still married, and she as of last week was engaged, and all the makings of a dark depressing midlife crisis come to a head in tragic and heartbreaking ways in what could only be an indie drama... Except that it isn't a drama, it is a lighthearted family comedy. Such taboo subjects, under a different light with different music, could easily have found itself in contention for being quite the drama, but alas, the whole film is flipped upside down with a plot that feels so unauthentic and ridiculous that I often had to stop myself and say \"no way his friend would be feeling okay with this.\" It felt like these families were alien, living in a different soda-pop world than the one I have seen of the suburbs. If this didn't make me cringe enough, the music would pop in and make me feel like for some reason I'm supposed to be okay with throwing your wife away for a newer model. However, oddly enough, at the end of the day the complete and total disregard for all things righteous actually won me over. I won't by any means label this as anything worthwhile to filmmaking, which it wasn't, but the absurdness of all of this (especially the music) piling up somehow worked, and the film mainly works because the acting really makes the ridiculous believable. Catherine Keener gives an awesome performance, as well as Oliver Platt, who sells the most unrealistic character ever devised like he is more real than Shakespeare (yes Shakespeare is real.) This film at several moments felt like by all means it should fail miserably, but thanks to the talent involved, it manages to be saved. One can tell that the screenplay just wasn't very good, but at the end of the day, somehow this film works. It is far from a great film, by any means, but it works. 7 out of 10.",
         "This movie isn't about adultery or male fantasies. To think that is to completely miss out on what the film is trying to say (and I feel it's dodging the questions that are silently asked throughout the movie: \"What is happiness and what is it worth?\") While a previous review mentions the movie being about consequences, and there certainly is plenty of that showcased throughout the film, it's really about a group of people, family and close friends, who realize that they are all still searching for happiness after the imaginary suburbia happy fairy gets metaphorically hit by a truck. By the end of the film, one may wonder whether various moment were that of selflessly sacrificing personal happiness in order for others, whom you also love, to have more of their own. The casting simply could not have been any better for this film and, ironically, this picture marks the second time that Leighton Meester has played a character who has a thing for Hugh Laurie (House, MD).",
         "I thoroughly enjoyed this film. From early on, you get a feel for the mood, but you're very unsure of how it will end. The dynamic between all of the characters is quite realistic for people in such a peculiar situation. You learn to care about them in all their wrong doing. At times, you want to bash all of them over the head, but by the end of the film it comes around full circle. It was fun to see Hugh Laurie as a sad sack, and Catherine Keener with the tough exterior. To me, this role isn't much different from any other of Leighton's films, but she was fine nonetheless. If you go into the film expecting a cute romantic comedy with some drama, think deeper. It has wit, and drama, but not as much one on one romance. It's more about the relationships people have with everyone in their lives and how delicate each one truly is for its own reasons.",
         "Some people might find this movie tasteless. Probably because the tag line is \"SEX. BETRAYAL. SCANDAL\" which was kinda misleading people to see the movie through that glasses. only to find that they felt uncomfortable watching the romance between a 24 years old girl and a man which was her father's best friend. the movie is more than that, it's actually about two family dealing with this kind of conflict and finding happiness. it's about what you really wanted in life that will makes you happy. only they put it in a more complex situation. and i don't like the jokes (on/from?) Ethan's part. it felt kinda dry. he shouldn't even bother to come."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "ATO Pictures",
         "Olympus Pictures",
         "Likely Story"
      ],
      "summaries": [
         "In conservative West Orange, New Jersey, the Ostroff and Walling families are very close. David Walling and Terry Ostroff are inseparable best friends and run together everyday. David has problems with his wife, Paige. He frequently sleeps alone in his office. Their daughter, Vanessa, is frustrated because she has not succeeded in her career as a designer. Their son, Toby, is moving to China on a temporary assignment. Terry's wife, Cathy, ignores him. Their daughter Nina moved to San Francisco five years ago. Near Thanksgiving, Nina's boyfriend Ethan betrays her at his birthday party and Nina returns to her parents house. Nina argues with her mother and draws closer to David. Soon they have an affair and fall in love, turning the lives of the people close to them upside-down.",
         "The enduring friendship between the Walling and Ostroff families is tested when Nina, the prodigal Ostroff daughter, returns home for the holidays after a five-year absence and enters into an affair with David, head of the Walling family."
      ],
      "budget": 0
   },
   "movielensId": 100717,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-09-09",
      "dvdReleaseDate": null,
      "directors": ["Julian Farino"],
      "runtime": 90,
      "movieId": 100717,
      "title": "The Oranges",
      "mpaa": "R",
      "actors": [
         "Leighton Meester",
         "Hugh Laurie",
         "Alia Shawkat",
         "Allison Janney",
         "Catherine Keener",
         "Adam Brody",
         "Oliver Platt",
         "Ian Helfer",
         "Aya Cash"
      ],
      "imdbMovieId": "1313139",
      "originalTitle": "The Oranges",
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["Rk83dEZi29E"],
      "plotSummary": "A man's (Hugh Laurie) affair with his friend's much-younger daughter (Leighton Meester) throws two neighboring families into turmoil.",
      "tmdbMovieId": 89008,
      "avgRating": 3.19167,
      "releaseYear": "2011",
      "numRatings": 60,
      "posterPath": "/9Fid6G5aMB3lRmzZrDXb14Xepap.jpg"
   }
}