{
   "tmdb": {
      "original_language": "hi",
      "keywords": [],
      "imdb_id": "tt1949548",
      "video": false,
      "title": "Heroine",
      "recommendations": [
         309074,
         146003,
         117784,
         19418,
         20364,
         85053,
         244237,
         108368,
         25510,
         217446,
         79990,
         60124,
         44566,
         84533,
         85050,
         254418,
         33146,
         53569,
         74458,
         21906
      ],
      "backdrop_path": "/tbj7T6yTdFxQ4rkG3F2ItnRx93C.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mahi Arora",
               "gender": 1,
               "credit_id": "52fe4bc7c3a368484e198e93",
               "name": "Kareena Kapoor",
               "profile_path": "/kSDkGSPWTxvOYmnnNphB2eQcuv1.jpg",
               "id": 37233,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Aryan Khanna",
               "gender": 2,
               "credit_id": "52fe4bc7c3a368484e198e97",
               "name": "Arjun Rampal",
               "profile_path": "/zLsX3bCA0WDcctq76A97Ccp2Zoj.jpg",
               "id": 52263,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4bc7c3a368484e198e9b",
               "name": "Randeep Hooda",
               "profile_path": "/6Pik7WeFHdDUCkLJptMZBqdWonN.jpg",
               "id": 6519,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4bc7c3a368484e198e9f",
               "name": "Lillete Dubey",
               "profile_path": "/pO6sx2eb6SREAOGNGtva0J7b6NB.jpg",
               "id": 6498,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4bc7c3a368484e198ea3",
               "name": "Shahana Goswami",
               "profile_path": "/7os7YiTuPjGplvcH3xmOaMqipLK.jpg",
               "id": 85577,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4bc7c3a368484e198ea7",
               "name": "Divya Dutta",
               "profile_path": "/n3yWF0XMtt5uiiZyThGFQVaMzDk.jpg",
               "id": 35778,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bc7c3a368484e198eab",
               "name": "Pallavi Sharda",
               "profile_path": null,
               "id": 979599,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4bc7c3a368484e198eaf",
               "name": "Helen",
               "profile_path": "/i71XRME3MCKrboV5drbty69SKfI.jpg",
               "id": 110102,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bc7c3a368484e198eb3",
               "name": "Ranvir Shorey",
               "profile_path": "/wDrxULlfbkVfhMOaUcooxs4g6n1.jpg",
               "id": 85451,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4bc7c3a368484e198eb7",
               "name": "Mugdha Godse",
               "profile_path": "/xtVnTjpp4R8oeFUkhSqszFjfkV3.jpg",
               "id": 85471,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bc7c3a368484e198ebb",
               "name": "Meenakshi Thapa",
               "profile_path": null,
               "id": 1112966,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4bc7c3a368484e198ebf",
               "name": "Sanjay Suri",
               "profile_path": "/6gbMj3PMWO5SfaPzG2Rw1lDzrC6.jpg",
               "id": 86074,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bc7c3a368484e198ec3",
               "name": "Raqesh Vashisth",
               "profile_path": null,
               "id": 1112967,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bc7c3a368484e198e83",
               "name": "Madhur Bhandarkar",
               "profile_path": "/okNkdIul270FfreWd8iyNvrRZH.jpg",
               "id": 92693,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bc7c3a368484e198e89",
               "name": "Madhur Bhandarkar",
               "profile_path": "/okNkdIul270FfreWd8iyNvrRZH.jpg",
               "id": 92693,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bc7c3a368484e198e8f",
               "name": "Niranjan Iyengar",
               "profile_path": null,
               "id": 94564,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.063075,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 134215,
      "vote_count": 20,
      "budget": 0,
      "overview": "A female superstar struggles through the trials and tribulations of being a Bollywood actress.",
      "similar": [],
      "original_title": "Heroine",
      "runtime": 140,
      "poster_path": "/rnHAQbOEPbfav3BqrELuJ9jf1l6.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [],
      "release_date": "2012-09-21",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Unlock Your Mind This summer",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Madhur Bhandarkar"],
      "runtime": 149,
      "synopsis": null,
      "writers": [
         "Madhur Bhandarkar",
         "Niranjan Iyengar"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt1949548/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5MzA4MjQxOF5BMl5BanBnXkFtZTgwNTg3MTE0MjE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Kareena Kapoor, Arjun Rampal, Randeep Hooda | See full cast and crew »"],
      "reviews": [
         "Madhur Bhandarkar who directed this movie must have lost his mind cause I can't find any reason why anyone can come with an idea of such a pathetic movie..... 2 and half hours of crying Kareena ..... on top of it the story was completely flawed.... twist after twist never lets the story to make any sense of some kind.......... Only positive thing that I can say is that if you can watch this movie and come out with your brain intact then you my friend can do anything in your life. WATCHING HEROINE IS A TEST FOR MAN's WILL TO SURVIVE.",
         "I watched Heroine in cinema hall today and I was looking into my watch more than looking into the screen because I desperately wanted the movie to come to an end. This is one of the biggest disappointment of the year after such a hype for this movie. There was no story at all and I was confused what was going on in the movie. There was nothing in it and Kareena was crying all from starting to end. Arjun Rampal was not at all matching to kareena and Randeep Hooda was totally wasted in this movie. The director plotted many emotional scenes in the movie which according to him was supposed to make the audience also emotional, but I was more emotional of wasting my money and time for this movie. My rating is 1/10.",
         "Heroine... the movie by Madhur Bhandarkar of so many good movies (the last one being Fashion). It has been in the news since the day they were hunting for their cast. The whole Aishwarya Rai Bachchan episode, Her opting out of the movie, the media hyping up the whole issue because of her pregnancy. Ironically, this movie shows exactly what kind of 'waves' need to be made in order for a movie to work. It makes me think whether all that buzz prior to shooting this movie was fabricated. Any how, I was looking forward to this. As a regular cine-goer I refrained myself from watching the promos because I always want to be completely surprised by a movie I look forward to. When I was at the screening and the first half was about to end, I cursed myself for not looking at the promos, it was so hard to sit through it. I am a very patient person (especially when it comes to cinema, I am in the field myself). It felt like someone was torturing me, like I was captured in a cell, I wanted to leave because of the unbearable screenplay and Kareena Kapoor, who can act when given the right movie, but this... this NO... this was only Kareena Kapoor crying from start to end in a very not natural and annoying way. The story - Absolutely sorry to say that there was nothing spectacular, special or new in this movie. It is Fashion, but only this time it is about the movie world. Very simple, a successful actress, blinded and stubborn natured goes through tough situations and screws up more and more in stead of progressing. Characters - All the characters have been written so badly. I am going to start off with our 'Heroine'- Kareena Kapoor. A character can be very interesting if it is described as stubborn, hotheaded and impulsive. In this case it was definitely not interesting, it was annoying to look at such a character the whole 2,5 hrs. There is no progression in the character, she learns but doesn't use her experience in future problematic situations. The viewer may wonder, why am I watching this... oh well there might be a lesson to this at the end of the movie. Yes, there is, be sane when you get famous. I feel it all could have been told differently and that the character could have been written in such a way that makes us feel pity for Mahi Arora (Kareena). Aryan Khanna (Arjun Rampal)- This character was written a little better and also cast well. Arjun Rampal suits the role of a very successful superstar, he plays the part with conviction and confidence. In his character there is progression, which is nice to see. He understands his mistakes and genuinely tries to change. This pleases the viewers. Angad Paul (Randeep Hooda) - Angad was a fine character to get to know. He was someone who was trying to help Mahi but lost his patience because of her stupidity, Randeep did an excellent job and is surely making it to the list of top actors slowly. The rest - What was the need for all the gay characters in the movie? Not every costume designer is homo-sexual, this is such a stereotype setting. All the celebrities in the movie portrayed to be bitchy, selfish and political in order to gain personal success. Really? What was the need, it is not exactly like that. Humility exists, also in the world of films. Divya Dutta as Pallavi portrayed a stereo type media person who 'supposedly' knows how to get things done. Such an annoying character. Shahana Goswami as Promita was awesome....until the lesbian part of the movie. Seriously what did it add to the story? Nothing it all. I face palmed during the scene Kareena and Shahana were feeling sexy for each other. Ranveer Shorey as Tapanda was great, he portrayed the Bengali passionate filmmaker so well that I was looking forward to his scenes constantly, kudos! Sanjay Suri as Abbas Khas - He tried to portray SRK in my opinion, well no it did not work. Sanjay Suri knows how to ooze charm, where was it in this film? SRK has charm? DoP - some scenes were shot well, but overall I thought it was a mess the way some scenes were captured. Music - Heroine could have used a chart buster, Halkat Jawani being the most hummed song from the album didn't really work for me in the movie. Poorly shot and disappointing choreography by Remo D'Souza. Screenplay - was there one at all? On the whole, stay away from this movie, it is going to ruin 2.5 hrs of your life and you are going to regret it. The 3 stars I am giving are only for Randeep Hooda, Arjun Rampal and Ranveer Shorey. Madhur Bhandarkar has turned me into someone who will now not look forward to his films anymore. I am angry for the way he portrayed the film industry, it is not a shitty place! Disappointed :(",
         "\"Oh my god\" That was my reaction when I came out of theater watching latest Madhur Bhandarkar film \"Heroine\". I kept wondering, \"Is this the same director who has given movies like Satta, Chandani Bar, Page 3, Corporate and Fashion?\". So at the outset let me say this, \"Please don't watch this movie\". And now the reasons. Story: There is no story at all. The film is like a pendulum which swings from one direction to other, But at least pendulum helps to move the arms of watch. This story does not do any good to the movie. So I must say very badly written. And if the story itself is bad then it is just 2-3 hrs of cloths, foreign shoots and glamorous parties nothing else. Screenplay: I am no expert but I can definitely tell the difference between good and bad. And it was bad. Music: At one point I actually closed my ears. I found it too loud. It has just added to the sorrows of film. Cast: One of the main reasons behind successful Madhur Bhandarkar films is the cast. And not just the central characters but the ensemble of characters gave the required impact to all of his previous films. This is not the case with Heroine. Apart from Kareena, Divya Dutta, Randeep Hooda and Ranveer Shauri no one leaves any impression. Kareena has done a \"great job\" in her portrayal of impulsive, moody yet emotional Mahi Arora who passes through turmoils of personal and professional hurdles. But how? By drinking, shrieking, smoking and crying in entire film nothing else. Additionally the character itself is so confused that at one point you wonder \"Is there no such thing as self respect or learning from one's mistakes? I mean how can someone be so naive?\". Somehow one cannot imagine Arjun Rampal and Sanjay Suri as Superstars. Arjun Rampal, in particular, has same expression in entire film. Helenji does reasonably good job apart from 1-2 pronunciations like \"Heroin\" for \"Heroine\" (which I might have heard incorrectly as I was half asleep). Ranveer Shauri dazzles and makes his presence felt (probably best portrayal in the movie). To summarize, A Classic Example of \"All Hype No Substance\". Don't waste your money for this terrible experience, except if you want to sleep in AC for 2.5 hrs.",
         "\"What a stupid movie\", my wife exploded, as we left the theatre, \"in the first half, we were at least watching her dresses, her jewellery, her looks. Second half didn't even have that\", she fumed. Allow me to elaborate further. This is one bad-ass, regressive, depressive, narcissistic, over- indulgent, formulaic and overall, pathetic film. There are at least three occasions when you feel its ended, your spirits soar, only to have them cruelly dashed as it finds another useless story thread to explore. You feel absolutely nothing for any character, least of all the central character, who is shown to be rude, ill-mannered, insecure, manipulative, vacillating constantly between career and love, needy, dependent, unprofessional and about emotionally as stable as a suicide bomber at a security checkpost. Am not quite sure what the film was about. Kareena, obviously, plays the title role, constantly seeks what she doesn't have and disregards what she does. Her central motive or motives remain unknown through the film as she runs through commercial films, edgier topics and off- beat films as part of her career. She runs through different men, Arjun Rampal and Randeep Hooda, being the primary. She changes staff and endorsement deals with rapid regularity. Her known temperamentalness obviously causes producers and even her heroes to shy away from her. Her end-goal, right till the end, remains as mysterious as her rise to stardom. If we are supposed to feel sad at all this, any sympathy for her, then the loud music, constant shrieking, rivers of tears and some extremely hammy acting by some of the character actors (especially the gay designer, journalist) help nip that in the bud admirably. Normally, the central character performance is what usually redeems such a film, but despite being a huge fan of Kareena's acting abilities and looks, she is saddled with such a hopeless, flawed character that nothing can be salvaged from it. The only saving grace, if at all, is her constantly careening cleavage, which provided a few moments of solace. There are so many beautiful things in the industry to explore. I've known artistes to work amazing hours, to be ready on time for shots, work round the clock on triple shifts, to be patient, firm, never lose their cool. Like Kareena in real life, they explore different roles, experiment with different looks. But unfortunately, in the eyes of the writer-director, this wouldn't have made an interesting enough film and so he gives us a caricature of a human being instead, who is deeply troubled psychologically and inflicts mental agony upon the hapless audience as well. More at apurvbollywood.blogspot.com",
         "The movie is all about Kareena kapoor AKA Mahi's life .. Story is same as Dirty Picture but more boring!! Amazingly world's whole tragedy happens in Mahi's life. :P There are only some good points in the movie which are:- Superb acting by Kareena 10 on 10 You will feel the glamor of bollywood.. Good support by Arjun Rampal and Randeep Hudda... Despite above qualities there are many flaws in the movie like:- It is very depressing and sad. Story is nothing new.You can say this is glamorous version of Dirty pictures.. You can not feel reality anywhere unlike Madhur's other movies. Whole movie is predictable!! To conclude Heroine is a average movie with old and depressing storyline..",
         "The film is a depiction of Kareena's own struggle to sustain her presence in Bollywood. After an interesting start, the film loses its grip and compels the user to find logic in the script. The second half is worse than the worst half where the logic and appeal seems to lose viewer-ship. Post interval era is a big drag while the viewers get more eager to reach to the end. Overall, the film is flawed. It has virtually no sensible logic and the plot is very weak. The film does have its good moments, but those are highly succeeded by the negative factors of the film. Apart from good costumes and the ooziness displayed by Kareena and her counter-part(s), the film fails in every aspect.",
         "As the title indicates, this is the story of a Bollywood heroine (in fact a collection of some episodes from her life and career). People keep on coming in and going out of her life and she finally ends up running away from the arc-lights and the sounds like Light, Camera, Action, Cut etc., i.e., instead of being a crowd-puller, feels better being a part of the crowd. She is indecisive or confused as to what she actually wants from her life - a successful career or a love-filled life with the man of her choice. And as a Hindi maxim tells - Duvidha Mein Dono Gaye, Maaya Milee Na Raam (in the condition of being in a fix, the person may get neither God nor wealth), she finally gets none of them. The way every coin has two sides, the same way every world or field has two altogether different sides � one bright one and one dark one. And the so-called realistic filmmaker � Madhur Bhandarkar has typed himself as a filmmaker concentrating on the dark side only of the field he is dealing with in his movie. The problem is that he always takes his audience for granted and wants it to believe whatever he shows as true. Madhur Bhandarkar has not shown any strugglers or acting lessons or a sincerity towards the profession. Instead he has chosen to show only the successful heroes and heroines and their activities involving mud-slinging, leg-pulling, scores-settling and dirty politics. And just like Fashion, he has shown smoking, drinking, drug-consumption, unsocial behaviour in the parties and casual sex (both heterosexual and homosexual). Is this all the film industry contains ? Is this the only scenario of a heroine's life ? After spending more than a decade in the film industry, do Madhur Bhandarkar and Kareena Kapoor want to tell the world that this is what they experience in this line ? Madhur Bhandarkar has shown that hype is everything and bad publicity is also considered as commercially beneficial. Well, this applies to this over-hyped film itself. In the beginning sequence of Subhash Ghai's Pardes (1997), Amrish Puri says to a Westerner, 'In your country, love means Len-Den, i.e., give and take whereas in India love means Dena Dena Dena, i.e., give give give. However Madhur Bhandarkar has shown that in this industry (which he himself is a part of), there is only give and take. Every talk, every gesture, every emotion, every relationship is artificial and motivated by self-interest. Well, he and Kareena Kapoor know better. Chums and dress-designers hovering around heroines are shown as speaking and behaving quite theatrically. Every female smokes. Every heroine is addressed by the talking person as 'babes' or 'baby'. Partisan media persons believe in settling their scores with the stars. Awards are negotiated. Heroes' possessive wives decide the heroines of their movies. Heroes do editing themselves, cutting the roles of those who do not come to their terms. Heroines devote more time to backbiting (or bitching) their contemporaries. Well, at least this is one fact which is confirmed through Kareena Kapoor's own life because she used to do it with her rival heroines till a few years back. For the rest, I am not sure to be fully true. All the same, how can I challenge the perception of Madhur and Kareena of their own line of work ? The hard-hitting dialogs serve Madhur's purpose best. In one dialog, the ruthless PRO (Divya Dutta) of the heroine says that in the film-line, if you utter a lie with confidence, people consider it as truth. And in another scene, one party-woman says to her talking companion that who is not a fraud in this film industry. Well Madhur, do you say the same about yourself too ? The movie leaves such an impression only. Technically, the movie is good. Music is in line with the mood of the movie. Though engrossing, the movie appears to be too long and the director seems to have attempted to cover as many facets of the cine-world, as possible which has, after a point, made the movie as burdensome. It has got reduced to a collection of some good and some bad sentences instead of being developed into a well-written impressive article. Performances are all good. Even those who have been forced by the director to go over the top, have not disappointed. Kareena Kapoor has taken her heart out to invest in this movie and this movie seems to be a take on the real life and career of this aging actress (completed 32 years). All others have done well. Special praise is deserved by Divya Dutta as the PRO and Helen as the heroine of the yesteryears. In addition to the entertainment value, it's the performances and the track of Helen which can be considered as the pluses of this movie. Madhur Bhandarkar's realism seems to be a different name for tried and tested entertainment only. The biggest thing that the movie subtly conveys is the dictum which I learnt quite late in my life � 'When you chase things, they run away'. When the 'heroine' in the movie chases love, love runs away from her and when she chases success in career, success runs away from her and all of her efforts prove to be counter-productive only in the end. Hence the great lesson rendered by default is never to run after anything. Let it go after a point. Finally, I conclude my review with a dialog of the PRO to the heroine in a scene � 'Either you manipulate others to your benefit or get ready to be manipulated yourself'. Madhur Bhandarkar seems to have grasped the essence of this dialog and this time he has manipulated.",
         "I admired Madhur Bhandarkar's work in Fashion, that movie had the flair right from the beginning till the end. Everything was just right on place, with high hopes and confidence that i will witness something fashion like cinema i bought the ticket for Heroine ! ! 15 minutes into the movie i felt cheated. The beginning of the movie itself was confusing, i am sure Madhur wanted to try something new this time. Rather than repeating his same old formula of showing his character's life right from the beginning. When you are telling a story there has to be a beginning and there has to be an End, and what an end it was. He just rushed through the ending, in fact he just rushed through the entire movie. He kept his mandatory elements in the movie ... Smoking , Booze , Gays , Lesbians , Bisexuals and this time \"Spoiler Alert\" even cursing (which did not help the movie in any way). I was unable to understand what madhur tried to portray in this movie ? that Movie stars are desperate and can go to any level for fame ? or they are way too emotional and lonely among thousands of people ? or they are horny all the time ? Sad thing is , he showed all the actors in the movie who played \"Actors\" just the same. Does that mean that there are no inspiring actors in this movie Industry ?? Like Amir Khan , Salman Khan .. The whole kareena kapoor's character was confusing in the movie. I understood Priyanka chopra's character in fashion but i was unable to relate with Kareena's character as to what is that she is. I only felt sad for kareena as to why she did this movie ? I went to this movie hoping i will be witnessing kareena playing a legendary actress role just a modernistic version. All hopes shattered, film had no strength, a very UN catchy music, and the Hoard of his usual caste. The 2 stars for the movie goes to ' Ranveer Shorey ' for his spot on screen presence. Apart from that movie is a mess. I never crib this so much after a movie but, next time i will do my research and buy a movie ticket.",
         "So much for all the hype and anticipation surrounding \"heroine\". The movie is basically a collection of some of the most discussed and hyped \"kisse\" from our bollywood. in Bhandarkar's pitch to combine all these incidents (which supposedly aim to shock the audience, however fail miserably!), he has completely lost the plot. There is no specific story line which is the biggest drawback. Some of the incidents, like the one about mahi tries adopting a kid, just feels absolutely disconnected from the movie, it actually made me think wat a waste of such a good actress. Also the film lacks any major/good actors, actors like sanjay suri, mugdha godse and some other newbies just aren't convincing and fail to make any impact. I longed for some good actors to match up with the amazing kareena but disappointment again. Randeep Hooda plays his part perfectly however he doesn't have a very important role in the movie. Arjun Rampal! I don't know why does he still get movies, he seems expressionless as usual. Kareena is great as always with her perfect portrayal of a beautiful, insecure, short tempered actress. But there is an awful lot of crying to her share and after a point it loses its impact. the item song is a treat to the eye, the number is catchy too. All in all the movie doesn't do justice to the amazing acting prowess of kareena and pathetically fails to unfold any story behind stardom. Watch if you are a kareena fan or if you have a free ticket! anyways, we would see it on the TV soon ;)"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Bhandarkar Entertainment",
         "UTV Motion Pictures"
      ],
      "summaries": [
         "After his incredible run of women-centric films from Chandni Bar, Page 3, Satta and Corporate to the blockbuster Fashion, Madhur Bhandarkar now turns his lens inwards and presents his most ambitious work yet - Heroine. The film is based on the life and times of a superstar heroine from the dream factory we call 'Bollywood'. The film is a daring, shocking, glamorous, scandalous behind the scenes account of the reality behind the world of glitz and glamour that our film stars inhabit. For a country obsessed with films and film stars, Heroine will take audiences on a voyeuristic journey to see what really goes on behind the closed doors of make up rooms and vanity vans. It will give them a chance to go beyond the gorgeous smiles and politically correct quotes, to see what really happens in the lives of India's sweethearts. The bitching and the politics, the secrets and the lies, the incredible highs of fame and the lonely depths of failure.",
         "A female superstar struggles through the trials and tribulations of being a Bollywood actress."
      ],
      "budget": 0
   },
   "movielensId": 100727,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2012-09-21",
      "dvdReleaseDate": null,
      "directors": ["Madhur Bhandarkar"],
      "runtime": 140,
      "movieId": 100727,
      "title": "Heroine",
      "mpaa": null,
      "actors": [
         "Kareena Kapoor",
         "Arjun Rampal",
         "Randeep Hooda",
         "Lillete Dubey",
         "Shahana Goswami",
         "Divya Dutta",
         "Pallavi Sharda",
         "Helen",
         "Ranvir Shorey",
         "Mugdha Godse",
         "Meenakshi Thapa",
         "Sanjay Suri",
         "Raqesh Vashisth"
      ],
      "imdbMovieId": "1949548",
      "originalTitle": "Heroine",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A female superstar struggles through the trials and tribulations of being a Bollywood actress.",
      "tmdbMovieId": 134215,
      "avgRating": 1.8,
      "releaseYear": "2012",
      "numRatings": 5,
      "posterPath": "/rnHAQbOEPbfav3BqrELuJ9jf1l6.jpg"
   }
}