{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "attempt to escape",
         "id": 5034
      }],
      "imdb_id": "tt0072951",
      "video": false,
      "title": "Escape to Witch Mountain",
      "recommendations": [
         14822,
         19378,
         29228,
         16084,
         50717,
         112170,
         86233,
         23438,
         42218,
         38147,
         27085,
         14612,
         42245,
         18444,
         21970,
         4199,
         18446,
         24816,
         18966,
         31654
      ],
      "backdrop_path": "/5pE0qyILO2JOa9tUen8tNS36olO.jpg",
      "revenue": 20000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Tia Malone",
               "gender": 1,
               "credit_id": "52fe461d9251416c7506d981",
               "name": "Kim Richards",
               "profile_path": "/jTO90DPcHXesL7cSudasucD9xGW.jpg",
               "id": 53261,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Aristotle Bolt",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d985",
               "name": "Ray Milland",
               "profile_path": "/zB7jGIBc6dc3fMqCpXlCDZxQrll.jpg",
               "id": 7124,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lucas Deranian",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d989",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jason O'Day",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d98d",
               "name": "Eddie Albert",
               "profile_path": "/tScju2xZ42MpXqx5WSYKFtwzH8r.jpg",
               "id": 11998,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tony Malone",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d991",
               "name": "Ike Eisenmann",
               "profile_path": "/w37MJao2bS0EgGRpryckVlkjd90.jpg",
               "id": 87066,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mrs. Grindley",
               "gender": 1,
               "credit_id": "5485346b9251416a72001e67",
               "name": "Reta Shaw",
               "profile_path": "/vEiRl8Mj51VCykLT3TQox05CGKt.jpg",
               "id": 5828,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Uncle Bene",
               "gender": 2,
               "credit_id": "5485348bc3a3680b36002264",
               "name": "Denver Pyle",
               "profile_path": "/cnO648FW7r1NQqHZsPkJBACfXal.jpg",
               "id": 6462,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Grocer",
               "gender": 2,
               "credit_id": "5485349dc3a3680b48001ad5",
               "name": "George Chandler",
               "profile_path": "/txFaIyol1OmqgMyJS3N50GHn5q2.jpg",
               "id": 33178,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d97d",
               "name": "John Hough",
               "profile_path": null,
               "id": 19032,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d997",
               "name": "Robert M. Young",
               "profile_path": null,
               "id": 1052231,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53bcb650c3a3684cdb000891",
               "name": "Jerome Courtland",
               "profile_path": "/6DN7AT5wDEo41qVr1tEYiWcunwQ.jpg",
               "id": 68133,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.246326,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14821,
      "vote_count": 75,
      "budget": 0,
      "overview": "Tia and Tony are two orphaned youngsters with extraordinary powers. Lucas Deranian poses as their uncle in order to get the kids into the clutches of Deranian's megalomaniacal boss, evil millionaire Aristotle Bolt, who wants to exploit them. Jason, a cynical widower, helps Tia and Tony escape to witch mountain, while at the same time Tia and Tony help Jason escape the pain of the loss of his wife.",
      "similar": [
         10061,
         8329,
         5925,
         1368,
         1103,
         11893,
         9417,
         11327,
         10987,
         11229,
         5001,
         11776,
         1868
      ],
      "original_title": "Escape to Witch Mountain",
      "runtime": 97,
      "poster_path": "/cXicoCiCfO6FDfv6ozwcfQCnhVW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1975-03-21",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/aXZ0LmSgLT1ZiNWnJ5qKaQHqBiC.jpg",
         "name": "Witch Mountain Collection",
         "id": 90348,
         "poster_path": "/3IggdwQeJvkkfMTKRv9iEpInGnV.jpg"
      },
      "tagline": "Caught in a world where they don't belong... they have one chance to escape!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Hough"],
      "runtime": 97,
      "synopsis": "We meet Tia and Tony as they are arriving at another orphanage. They do not remember who their families were or where they came from but know they have special telekinetic powers which make getting along with the rest of the kids difficult. During a movie trip, Tia gets a strong feeling about a man getting into a car across the street. She runs over to him and tells him that he should not get into the car. The man listens and decides to walk and get picked later by the chauffeur-driven car. Just then an out-of-control pick-up truck crashes into the door where the man would have been seated. This man, Lucas Deranian, (played by Donald Pleasence) happens to work for an eccentric rich man looking for clairvoyant kids that he can use to expand his fortune. Fake papers are drawn showing Mr. Deranian as the children's long lost uncle. The children arrive at the mansion of Aristotle Bolt (played by Ray Milland) to find everything they had ever wanted. Horseback riding, beautiful rooms, ice cream abound. They do not know there are cameras in their rooms watching them play using their special powers. Mr. Bolt tells them over dinner that they can name what they want to have and he will get it for them if they will teach him how they perform their magic. No deal. Tony and Tia want out because they overhear how they will be isolated on an island if they do not cooperate. They escape the mansion and meet up with an elderly man played by Eddie Albert. He agrees to help them find a place on a map that they have discovered on Tia's star case (pocket book). There are many close calls along the way as townspeople believe the children to be witches and from witch mountain. The three finally make it to the place on the map and are summoned toward a lake alongside the mountains. With Mr. Bolt in a helicopter, Mr. Duranian following in a car, and the townspeople coming up the rear, the final chase is on. This time Tony and Tia are met by their uncle and a flying saucer. Jason (Eddie Albert) is thanked for showing so much compassion getting the children back home. He is charged with finding others that survived from the spacecraft crash the night Tia and Tony were lost. Tia and Tony fly away with their uncle in the saucer. Jason is sad at parting but happy that they found their home. Mr. Winky, the children's cat, is left to keep him company.",
      "writers": [
         "Robert M. Young",
         "Alexander Key"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0072951/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzOTQ4NTk2OV5BMl5BanBnXkFtZTcwMjMwNDAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Albert, Ray Milland, Donald Pleasence | See full cast and crew »"],
      "reviews": [
         "In 1975, I was 11 years old. \"Escape To Witch Mountain\" played to a packed house at a now-defunct old theatre called, Miracle. People were sitting on the floor because they sold more tickets than they had seats. I'd never seen anything like that before. My dad and step mom took me to the movie and we got the last of the few remaining seats. They probably only took me because it was a Disney flick. Had to be harmless, right? Hardly. Afterward, they were puzzled by the seemingly surprising UFO angle. I remember being absolutely transfixed. I'm still fascinated with mysterious stuff like UFOs and ghosts. I wasn't supposed to like that stuff but this film made it impossible for me not to. And I identified with the kid heroes on a deeper level as well. I, myself, was kind of a ragamuffin misfit kid from a broken home who spent weekends with my dad's new blended family. I felt the siblings' pain at being torn from their home. Tia broke my heart. She was as fragile as me, but far stronger when it really counted. Tony was just hot! Older and very cute at 13. And those powers they had? How cool was that? By the time the credits rolled, I knew I'd seen the best movie ever! I was lucky enough to have an older cousin who loved movies and hanging out with me and she bought the Disney movie record for me. I don't know if any of you remember these; Disney used to release LPs of the audio track of some of their movies, usually truncated and featuring narration. In the case of \"Escape\", it was narrated by Eddie Albert. This thing enabled me to memorize every line of Tony and Tia's dialog and much of that of the other characters, too. I still have it, though the sleeve is long lost. It's tough for me to watch the movie without speaking along with the characters (especially Tia), at least in my head. My cousin also bought me Alexander Key's book. Boy, Disney sure took liberties, didn't they? Key's book is far more serious and developed and meaningful. I tried to take the best parts from the book and the movie and incorporate them together into the Tony and Tia of my imagination. It deepened them. Too bad there was no fanatic outlet back in those days! It was pretty egolesss of Alexander Key for coming together with Disney on the eventual novelization of \"Return\". Without Key's kind participation, it would of been an empty exercise. I was especially impressed with how he incorporated the issue of Tia needing to learn to speak. Through the years, I never \"Escape\" and I saw it as often as I could. For instance, when \"Return\" was released, Disney sent the movies out as a double feature. I loved \"Return\", silly as it was, even though there were things in it that really bugged me. Like the sibs being split apart for most of the movie. I loved them together! I think most of the fans of the first film were most affected by their chemistry. I think we wanted to see more of that. Even so, I really liked the Earthquakes, all of them. And it was fun to see Kim and Ike a bit older and even cuter than before. I also remember seeing \"Escape\" on an odd revival double-bill with \"Bambi\" at some point in my teen years. I think I would've followed Kim and Ike anywhere. Heck, I even followed them to \"Devil Dog, The Hound Of Hell\". You have to see the comments page here at IMDb if you haven't already. I would've seen \"Tuff Turf\" even if Kim wasn't in it, but that's a convoluted story for another thread. Suffice to say I have seen TT far too many times and many of them were for Kim. Also, I can honestly say I enjoy the TV edit of \"Star Trek II\" far more than the theatrical cut because it has more Ike. I even had a good time watching \"Blair Witch Mountain...\" when it hit the web. I have to agree that it might be fun to revisit Tony and Tia with the original actors today. Hey, last year, the new \"Twilight Zone\" brought Anthony (Billy Mumy) back and introduced us to his similarly gifted, but far less scary (real life) daughter (Liliana Mumy). And all those people came back from the cornfield. Why not Tony & Tia? I could rhapsodize for paragraphs about both \"With Mountain\" films, and I may still do so when I get my special edition DVDs. In the meantime, here's hoping that a whole new generation of kids will discover \"Witch Mountain\" for themselves.",
         "I was thrilled to see one of my favourite films, as a child, released on to DVD. I can now share some of my childhood with my own kids. No big surprise, but my older daughter (7) loves it. My younger daughter (2) thought some parts were \"scary daddy\"; the broom/jail scene was well done! Highly recommend it as a family film for folks that want a nice movie to watch with their kids.",
         "A long time ago, I was into books. This isn't a light phrase, I took out multitudes of them from the library. Alexander Key wrote a neat novel called \"Escape to Witch Mountain\" about a priest named Father O'Day who helps two siblings return to their people. It was a very good book, and I knew when I bought the book from the Book Fair that it was a reprint to endorse the movie. However, at that time, my movie-experiences were minimal. It took several years for me to actually be able to see the movie (when Disney first brought out the Disney Channel, iirc) and I was a bit surprised at the liberties that were taken with Key's book. The priest became the widower, and the beat up car became the RV. Bolt was not in the book, but he was an interesting main-villian, and I enjoyed the movie. My son, who is now 6 (Tues this week) enjoys watching it on VHS as much as I do! Return was not as good--it was a \"let's make money by doing a sequel\" but it was cool too. As that 5th grader, I knew what it was to be outside the norm, and I wanted to have the same powers that Tia did, so I guess that's saying something! I too place this movie with Parent Trap, Candleshoe, and Freaky Friday. Good movies that I don't have to worry about my child \"catching\" wrong words from! **** out of 5.",
         "Alexander Key's popular pre-teen novel concerns two orphaned siblings with supernatural powers taken in by a nefarious millionaire (named Aristotle Bolt!) who wants to exploit their magical abilities for personal gain. Top-notch Walt Disney adventure for families has natural, non-precocious performances from young Ike Eisenmann and Kim Richards as the gifted kids, and their friendship with good-hearted traveler Eddie Albert is sweet but not sticky. The eerie flashbacks to the youngsters' early beginnings are well-captured by director John Hough, who is otherwise forced (perhaps for budgetary reasons) to skimp on genuine atmosphere in place of an elongated chase. Too bad the finale replaces emotion with effects, as these characters are quite remarkable. Followed by a fairly wan sequel, 1978's \"Return From Witch Mountain\", in which the special effects became the whole show. **1/2 from ****",
         "The 1970's was not a good time for the Disney Studios. Much of the stuff that came from Disney at this time were corny and fluff. This movie however is a rare exception, esp. for it's time. This film is about a bother and sister, Tony & Tia (Ike Eisenmann and Kim Richards)who have powers(ESP, Levitation and the like)but they don't know how or where these powers come from. Tia is being bothered by memories of an accident that she can't piece together. However, as the film progresses-the pieces come together like a puzzle and they figure out the answer to the question: \"Where are we from?\" I must say that the chemistry between Eisenmann & Richards worked so well, people actually believe that they are brother & sister. It's really remarkable how well they worked together-no wonder it looked so real. This is remarkable acting talent on the part of these two and no one could have done it better. This is why I think these two actors are underrated. I'm not going to go into detail of the rest of the film. Read the other reviews for that. One thing I need to mention is that the special effects were great for it's time. Maybe They were a little Cheesy, but the essence of the story is not the powers these kids have, but they are searching for their home and looking for answers about where they come from. To me, this is the real story-not the special effects. I just got my DVD copies of both films This and \"Return From witch mountain\" They done a good job remastering the soundtrack in THX, 5.1 Dolby surround sound. It sounds as good as it does in the theater if you have a home theater system.",
         "Well, I'm from Spain so excuse my English. I'm not really an expert, but i have seen this film between 10 - 20 times when I was less than a teenager. I think if I could watch it now, I got sleep before second act starts. But, a kid can find so much interesting dreams to have in the future. YOU'RE SPECIAL!! That was exactly I thought each time i watch it. A Kid always want to be heard & considered by his parents & society. The power of the imagination, the \"can do what i want\" & the \"not possible identification\" with other powered heroes (too old, too far, too big or too dangerous) makes this film indispensable for kids. Maybe this film was a FIASCO for Disney, but in Spain (and in other countries, i guess), many people considered it like a Bible of entertainment and easy cinema. Only in Hollywood! And with the inducement to see one of the later monkees component doing the levitation that never obtain with his music. A classic.",
         "One of the Magic Kingdom's most charming fantasies occurs as a two children from outer space try to return home in Escape To Witch Mountain. The place mentioned in the title is a rendezvous point where they have to reach. Ike Eisenman and Kim Richards are two lower grade school kids who've been placed in an orphanage because their foster parents have died. Those parents are the only ones they've ever known. Richards has memories of being rescued from a body of water though. These two have remarkable powers that they have to be careful about showing off. But some precognition has them warning Donald Pleasance about not getting in a car that shortly has an accident. Pleasance works for tycoon Ray Milland who wants those children and will stop at nothing to see he gets possession of them. The kids get wise to Milland and Pleasance and run off, but Milland gets the law on his side and in pursuit of them. Their biggest stroke of luck is gaining the trust and confidence of Eddie Albert. He's a lonely and crusty old man, but those kids are charming and weave some magic that has nothing to do with their being aliens. Escape To Witch Mountain provides Eddie Albert with one of his best later career roles. Albert works well with Eisenman and Richards and doesn't let the kids steal any scenes from him. Some plot elements that would find themselves in the later and more acclaimed Cocoon are found in Escape To Witch Mountain. The special effects are before computer graphics took over, yet they are quite good. Two other performances to look out for are Walter Barnes as a greedy sheriff and Reta Shaw who runs the orphanage where the kids are first taken. Escape To Witch Mountain is one of Disney Studios best products post the death of the founder Walt Disney. It should be seen in conjunction with the sequel Return From Witch Mountain.",
         "It always puzzles me how adults can review movies that were meant for a young audience and review it negatively (through adult eyes), completely forgetting about a child's unique and innocent perspective on the film. Shame on them all!! As a young kid in the 70's, Disney, cartoons and sports were all weekly staples- so many good memories!! Escape to Witch Mountain was one of the first movies I saw in the theater, and was both entertaining and fun. A good adult cast; Donald Pleasence, Ray Milland and the underrated Eddie Albert, all provide good support for our two hero kids who use their powers to not only try to find home again but thwart the evil intentions of those trying to use their powers for their own benefit. The movie is well paced and has the usual hi jinks one expects in a \"chase\" film. I enjoyed it then and liked it just as much after a recent viewing on cable. This movie also illustrates how one doesn't need bad language or crude behavior/jokes to appeal to kids. What some people regard as \"corny\" others find a refreshing change from today's standards of \"acceptable\" programming.",
         "1995 saw a remake of \"Escape to Witch Mountain\" as a \"Disney Sunday Night Movie.\" It was horrible. Its biggest mistake was to try to bring \"New Age Mysticism\" to the table and it should never have been ordered. 1975's \"Escape to Witch Mountain\" is a really cool movie. It's has a lot of neat ideas in it. I loved it at age 5 and still loved it upon a repeat viewing at at 36. Hollywood clearly has lost originality and a source of genuine \"new ideas\" and has been remaking a lot of films lately. I think they should pick this one and use the male version of the Olsen Twins, Cole and Dylan Sprouse. Yes, I know, Tia would have to become \"Tim,\" but it's a different spin on the story and if Starbuck can become a woman in Sci-Fi's \"Battlestar Galactica,\" why not make Tia a boy? Just don't make it a comedy! And this time bring it to the big screen, not the TV. At any rate, 1975's \"Escape to Witch Mountain\" was in my opinion way ahead of its time, both in story and special effects. Alexandar Key (the author) outdid himself. In the right hands today, it could be a huge success. *EDIT* Asked and delivered! Remake coming in 2009 (\"Race to Witch Mountain.\") OK OK, maybe the Cole and Dylan Sprouse idea wasn't the best -- but at least they are remaking it! :)",
         "Having seen the new version of this film recently (\"Race to Witch Mountain\"), I cannot tell you how much of a pleasant surprise \"Escape to Witch Mountain\" was to me. The new version, in my opinion, lacks any kind of character development and is full of annoying characters that do nothing to help the movie. Essentially, the new version basically did away with the first 45 minutes or so of this film, which helped set up the story, develop the characters, and give us a better sense of why the kids are running away. Also, Dwayne Johnson is incredibly lacking in emotion and character compared to Eddie Albert in this movie. While I admit that most of the special effects in this film may seem cheesy by today's standards, they actually make the film even more fun to laugh at. This film came out of a couple of decades when Disney was at its height of live action movies, when even film of this type they turned out was at least worthwhile. This is an enjoyable movie, with good jobs of acting done by basically all of the characters. Appropriate for anyone in the family, exciting, funny, and likable. ***1/2 out of ****"
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Tia and Tony are two orphaned youngsters with extraordinary powers. Lucas Deranian poses as their uncle in order to get the kids into the clutches of Deranian's megalomanical boss, evil millionaire Aristotle Bolt, who wants to exploit them. Jason, a cynical widower, helps Tia and Tony \"escape to witch mountain,\" while at the same time Tia and Tony help Jason escape the pain of the loss of his wife.",
         "Two mysterious orphan children have extraordinary powers and are chased by a scheming millionaire. But where do these kids really call home?"
      ],
      "budget": 0
   },
   "movielensId": 1009,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-03-21",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["John Hough"],
      "runtime": 97,
      "movieId": 1009,
      "title": "Escape to Witch Mountain",
      "mpaa": "G",
      "actors": [
         "Kim Richards",
         "Ray Milland",
         "Donald Pleasence",
         "Eddie Albert",
         "Ike Eisenmann",
         "Reta Shaw",
         "Denver Pyle",
         "George Chandler"
      ],
      "imdbMovieId": "0072951",
      "originalTitle": "Escape to Witch Mountain",
      "genres": [
         "Adventure",
         "Fantasy",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["lhxWtjTFRxs"],
      "plotSummary": "Tia and Tony are two orphaned youngsters with extraordinary powers. Lucas Deranian poses as their uncle in order to get the kids into the clutches of Deranian's megalomaniacal boss, evil millionaire Aristotle Bolt, who wants to exploit them. Jason, a cynical widower, helps Tia and Tony escape to witch mountain, while at the same time Tia and Tony help Jason escape the pain of the loss of his wife.",
      "tmdbMovieId": 14821,
      "avgRating": 3.14147,
      "releaseYear": "1975",
      "numRatings": 2785,
      "posterPath": "/kUC0erNkn2MaeGS4cYU0jMn7ktZ.jpg"
   }
}