{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "yacht",
            "id": 3342
         },
         {
            "name": "wife",
            "id": 4183
         },
         {
            "name": "jewelry",
            "id": 6099
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "film noir",
            "id": 195402
         },
         {
            "name": "complications",
            "id": 200343
         }
      ],
      "imdb_id": "tt0368343",
      "video": false,
      "title": "Three Way",
      "recommendations": [
         55336,
         219674,
         19952,
         121822,
         150065,
         273610,
         44862,
         50590,
         72031,
         25451,
         30669,
         272602,
         32007,
         35004,
         8199,
         21106,
         240881,
         256467,
         43954,
         49341
      ],
      "backdrop_path": "/z9VeKkFSaIYT52z2A6XrFtSkVn2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lewis 'Lew' Brookbank",
               "gender": 2,
               "credit_id": "52fe456e9251416c9103227d",
               "name": "Dominic Purcell",
               "profile_path": "/dyFc8VuAtLQFjL0rKWZuztdBEoT.jpg",
               "id": 10862,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rita Caswell",
               "gender": 1,
               "credit_id": "52fe456e9251416c91032281",
               "name": "Joy Bryant",
               "profile_path": "/yAGwmf3OAE2Cd7keUpVCACfhm5A.jpg",
               "id": 52847,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Isobel Delano",
               "gender": 1,
               "credit_id": "52fe456e9251416c91032285",
               "name": "Ali Larter",
               "profile_path": "/bREO6OEipl4y077K0mdBUXVuE3i.jpg",
               "id": 17303,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ralph Hagen",
               "gender": 2,
               "credit_id": "52fe456e9251416c91032289",
               "name": "Desmond Harrington",
               "profile_path": "/z9EoAcqWjPD5vPtNCRT7p8Kj6o6.jpg",
               "id": 6365,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Herbert Claremont / Clarkson",
               "gender": 2,
               "credit_id": "52fe456e9251416c9103228d",
               "name": "Dwight Yoakam",
               "profile_path": "/pyqKTjGy0m4aBKDqbH4ne8hUwLi.jpg",
               "id": 20309,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Florence DeCroix Hagen",
               "gender": 1,
               "credit_id": "52fe456e9251416c91032291",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Janice Brookbank",
               "gender": 1,
               "credit_id": "52fe456e9251416c91032295",
               "name": "Roxana Zal",
               "profile_path": "/1vyPjvwNR9al6c8PzcisFWhJSj.jpg",
               "id": 112693,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Patrolman",
               "gender": 2,
               "credit_id": "52fe456e9251416c91032299",
               "name": "Dan Martin",
               "profile_path": "/u24mFuqwEE7kguXK32SS1UzIQzJ.jpg",
               "id": 95796,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Bruce Hildred",
               "gender": 2,
               "credit_id": "52fe456e9251416c9103229d",
               "name": "Christian Mills",
               "profile_path": null,
               "id": 12215,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Cop",
               "gender": 0,
               "credit_id": "52fe456e9251416c910322a1",
               "name": "Jason Sutliff",
               "profile_path": null,
               "id": 112694,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe456e9251416c910322a7",
               "name": "Scott Ziehl",
               "profile_path": null,
               "id": 43439,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe456e9251416c910322ad",
               "name": "Gil Brewer",
               "profile_path": null,
               "id": 120681,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe456f9251416c910322b3",
               "name": "Russell P. Marleau",
               "profile_path": null,
               "id": 94261,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.946036,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34601,
      "vote_count": 10,
      "budget": 0,
      "overview": "Lew is a small time loser with a troubled past and a very big secret. Overhearing a couple plan a kidnapping, Lew is tempted to come up with a scheme of his own. He decides to get to the victim first and then blackmail the real criminals. His plan soon spins out of control.",
      "similar": [
         4771,
         37645,
         8067,
         562,
         180863,
         281957,
         133805,
         521,
         14615,
         1259,
         8999,
         769,
         979,
         320,
         49524,
         238636,
         27576,
         3597,
         11121,
         168098
      ],
      "original_title": "Three Way",
      "runtime": 88,
      "poster_path": "/kauZyCldjgd3eJ02xxu2iYr4Llm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hyperion Pictures",
            "id": 7339,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Brainstorm Media",
            "id": 11658,
            "origin_country": ""
         }
      ],
      "release_date": "2004-06-29",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "A sinfully tasty brew of sex, extortion and murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Ziehl"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Russell P. Marleau",
         "Gil Brewer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0368343/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NjI0MzAwMF5BMl5BanBnXkFtZTcwMDgzODUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Dominic Purcell, Joy Bryant, Ali Larter | See full cast and crew »"],
      "reviews": [
         "Well, I should have known the underlying rule in soft porn flics. The girl you want to see with her shirt off never takes it off. Where is the justice? Ali Larter with two sex scenes and nothing more than a naval. I can't believe she stooped to this movie, same with Gina Gershon. This movie was garbage. The \"unexpected plot twists were expected, predictable, and worthless. What crap! Trust me on this one, this is 88 minutes of your life that you'll NEVER SEE AGAIN! Ali Larter and Gina Gershon both keep their clothes on the entire movie, and the plot sucks. Your lead guy plays such a moron that you hope something bad happens to him. The lead girl is annoying and the ending doesn't fool anyone, it's still crap. Avoid at all costs.",
         "Some truly stupid behavior (excused, in part, by every criminal in this movie being a rank amateur) hampers an otherwise passable crime movie about sloppy blackmailing, sloppy kidnapping, and not-always-sloppy plots within plots. Despite the foolish actions, the dialogue and performances are good, especially those of Dominic Purcell and Gina Gershon. Ali Larter looks fantastic, and the locations are nice even if the time-lapse scenery jumps get a little tiresome by movie's end. Worth a look for fans of the genre, but by no means the soft-core porn flick some posts here (and the title - I wish!) suggest. Well, one scene, and no, it features neither Gershon nor Larter.",
         "Three way is not a menage-a-trois film even though the cover makes it look like so. It actually has a good story, a good plot and really good acting. The movie was marketed the wrong way and that's why a lot of people are upset because they are expecting a soft porn film when in fact they got the real deal which is a feature length film with a couple of love scenes. The story is like this, A struggling man named Lewis Brookbank(Dominic Purcell) has a bad past but now wants a good future. He sees the opportunity and is eager to grasp it and live it with his present love or second love named Rita Caswell(Joy Bryant) of his life. This opportunity though seems to have become more of a nightmare when the plan does not go as planned. This movie has all the right elements for a good movie which is a good storyline with a good plot to carry it out plus a director with actors who know what they are doing. Don't expect for a soft porn flick but a good story on screen.",
         "I had never heard of Three Way, but when I was at Hollywood Video, I noticed the film and saw that Gina Gershon was in it. I like her, so I decided to go ahead and pick up the film; so I watched it last night and I was really disappointed. First off, Gina was in the movie for barely 5 minutes, the plot had potential, but most of the actors ruined the movie for me, I mean, absolutely none of the characters were at all likable. The main character, Lew, wasn't even a cool anti-hero, he just seemed to complain too much. The film wasn't very well shot and it just seemed like it was more of a chore and a movie that most of the cast and crew just wanted to get through. I also do not mind sex in a movie, but some of the sex scenes were just plain unnecessary and didn't add anything to the supposed story. Lew is a guy who just complains so much of how badly life is treating him, his wife has been murdered and he got rid of her body with her lover's as well, instead of going to the police. But he's moved on, has a new girlfriend, and they are both in debt. One night he over hears a couple plotting to kidnap a woman who has a rich family. The couple has been having an affair, and it turns out that the guy is kidnapping his wife and is expecting a million dollars, but Lew wants that money and has other plans in mind for them. Three Way isn't the worst film I saw, the beginning of the film wasn't so bad, it had enough potential, but there were things that were left unexplained. Like we see Lew go onto the boat where his wife and her lover were killed, he has a gun, was he intending to kill them or scare them or what? The scene between Lew and Florence where she was trying to seduce him didn't make much sense, I know what it was, I got the scene, but the whole story of that wasn't needed. I just think that the film could've been made better, or at least had a better cast, Gina's talent was very much wasted on this stupid film. 3/10",
         "Lew (Dominic Purcell) is a carpenter with a past, who accidentally hears the conversation of two lovers in a car in an isolated spot about a kidnapping of a woman of a wealthy local family. He architects a plan with his girlfriend Rita (Joy Bryant) to steal the ransom from the couple, but things do not work how planned. \"3-Way\" is a erotic and sexy film-noir, with a very reasonable story and very beautiful actresses. There are many plot points and double-crosses, and I found it interesting. However, the commercial conclusion spoils the film. The director and the writer should have seen the masterpiece \"Body Heat\" and offer an end more suitable for such amoral story. The participation of Gina Gershon is minimum, basically to give her name to the credits. My vote is six. Title (Brazil): \"Seqüestro, Chantagem e Morte\" (\"Kidnapping, Blackmail and Death\")",
         "This really didn't seem to be a \"soft porn parody\" to me. In fact I didn't think the movie was bad at all. It had many twists, and I doubt anyone could have foreseen the ending. Not only was Dwight Yokam his \"creepy self\" (he also give a good performance in the \"The Three Burials of Melquiades Estrada\" starring Tommy Lee Jones) but was a real plus to the movie. He gets better with every role. Even though Gina Gershon is only in the movie for a few moments the plot does revolve around her. And really how much screen time should a hostage get? The real flaw is that the ending really isn't fully explained, I had to back the DVR up and listen to the dialog closely. Although it could be due to the fact I watched it at 2:00 a.m.",
         "1st watched 5/29/2006 - 4 out of 10(Dir-Scott Ziehl): So-so straight to video story about blackmailers being blackmailed by a man who overhears their plot to kill the man's current wife and receive the inheritance. The man who overhears the plot is played by Dominic Purcell as Lew, who just happens to have a checkered past himself and is looking for a way to disappear and thinks he's found it. Other characters enter the story including the brother of someone that the main character supposedly killed and is played by Dwight Youkim and the wife who is supposed to be ofted, played by Gina Gershon. These two more well known names have smaller parts but the DVD box tries to sell them as stars in the movie. Joy Bryant has a bigger role as Lew's girlfriend and partner in his scheme and does a good job in her character. The problem with the movie is that the story doesn't keep your interest and Purcell doesn't do a very good job of carrying the movie. He plays his part half-heartedly and the movie moves along at the same speed making for a very, as I said before, so-so movie.",
         "\"3-Way\" is not as good as the cover makes it look. The director's \"hip\" visual style is only obtrusive. For example, in the beginning we can't be sure if the action is taking place in a motel room or on a boat! But even when the pieces start falling together, the story only gets stupider. The dialogue is often idiotic and the plot is contrived (\"I was in the right place at the right time\") and convoluted; for a \"plan\" movie to work, you have to believe that the plan has at least some chance to succeed - the plan in this film seems doomed from the beginning. Dominic Purcell is a charisma-free lead, all the girls are pretty (especially Joy Bryant), but the best acting job by far is done by a really creepy Dwight Yoakam. (**)",
         "THREE WAY is a modern-day attempt to update the classic 1940s film noir genre to a modern setting, featuring a protagonist up to his neck in murky dealings as he attempts to turn a planned kidnapping to his own advantage. The title and the inclusion of some extraneous sex scenes make this look like an attempt to plough the same furrow as WILD THINGS, but this is nowhere near as good. Dominic Purcell's protagonist is one of the worst things about this: he's ineffective and weak throughout, and you just wish he'd man up and throw a punch here and there. None of the other cast members are particularly good, with Gina Gerson's role a limited one - she seems to be included for name value alone. Although the convoluted plotting could have been interesting in better hands, often the writing feels lazy here and many sequences which should be suspenseful just aren't - they're boring instead. After I finished watching, I couldn't help but consider this a waste of time.",
         "OK, I admit that the only thing that led me to this movie was seeing the words \"Dominic Purcell\". Knowing how phwoar! he looks I thought I'd give it a whirl. You see a lot of him in the movie (well most of him actually in the early scenes) so in that respect it was a very satisfying experience. However the continuity must have been checked by an underpaid short-sighted person with short term memory loss and a paper bag over his head. When the gun-toting murderous brother kidnaps the 'hero' what is that random sticking plaster on Lew's arm all about? Not to mention the visible/invisible shirt. The continuity diverted my attention from the unlikeliness of some of the plot twists, or was that the whole idea? Anyway I kinda liked the end. Throughout the movie people are constantly physically assaulting Lew, (even the girlfriend) but he never offers violence back, and at one point he apologises for raising his voice to her. Frankly I'd have given her a slap for some of the things she does, and I'm a woman. I guess the lack of violence on his part is a deliberate movie plot issue. So hip hooray for him getting a break and us getting another topless moment from Mr Purcell at the end, although up till the credits I was expecting her to screw him over on the money front. And another cheer for both genders getting their kit off, and not just the females."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Hyperion Pictures",
         "Brainstorm Media"
      ],
      "summaries": [
         "Attractive, hard-working Lewis 'Lew' Brookbank's love - and professional life came crumbling down after he found his adulterous wife Janice and her lover Dick murdered on a yacht. He moved to a derelict gas station in Carpenteria, where he paints commercial signs. Lew accidentally overhears a couple making love in their car and planning the kidnapping and murder of the man's wife. Lew manages to track them down: jewelry manager Ralph Hagen and antiques shop clerk Isobel Delano. Lew confides in present lover Rita Caswell, needing help with the sinister Herbert Claremont while he plans to blackmail the kidnappers. More complications follow.",
         "A sexy noir-thriller based on Gil Brewer's 1963 pulp novel Wild to Possess."
      ],
      "budget": 0
   },
   "movielensId": 101662,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-06-29",
      "dvdReleaseDate": "2004-06-24",
      "directors": ["Scott Ziehl"],
      "runtime": 88,
      "movieId": 101662,
      "title": "Three Way",
      "mpaa": "R",
      "actors": [
         "Dominic Purcell",
         "Joy Bryant",
         "Ali Larter",
         "Desmond Harrington",
         "Dwight Yoakam",
         "Gina Gershon",
         "Roxana Zal",
         "Dan Martin",
         "Christian Mills",
         "Jason Sutliff"
      ],
      "imdbMovieId": "0368343",
      "originalTitle": "Three Way",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["h-ZlnPwSemM"],
      "plotSummary": "Lew is a small time loser with a troubled past and a very big secret. Overhearing a couple plan a kidnapping, Lew is tempted to come up with a scheme of his own. He decides to get to the victim first and then blackmail the real criminals. His plan soon spins out of control.",
      "tmdbMovieId": 34601,
      "avgRating": 2.25,
      "releaseYear": "2004",
      "numRatings": 6,
      "posterPath": "/kauZyCldjgd3eJ02xxu2iYr4Llm.jpg"
   }
}