{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1171226",
      "video": false,
      "title": "A Bunch of Amateurs",
      "recommendations": [
         44071,
         22688,
         59589,
         20802,
         75363,
         42744
      ],
      "backdrop_path": "/7Q7vHWLt4OXlk7PRgSJafsjFBAD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jefferson Steel",
               "gender": 2,
               "credit_id": "52fe475b9251416c75096715",
               "name": "Burt Reynolds",
               "profile_path": "/g5AyPAhdr5OtHVRGLD3i8Gw4oas.jpg",
               "id": 16475,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nigel Dewberry",
               "gender": 2,
               "credit_id": "52fe475b9251416c75096719",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dorothy Nettle",
               "gender": 1,
               "credit_id": "52fe475b9251416c7509671d",
               "name": "Samantha Bond",
               "profile_path": "/vBPkMGAHIoOP2ni9yYKoxCbw4Z0.jpg",
               "id": 10699,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe475b9251416c75096721",
               "name": "Imelda Staunton",
               "profile_path": "/mKlkh0AuYPD5HjmnlrW0uPm5QvJ.jpg",
               "id": 11356,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Girl on Motorbike",
               "gender": 1,
               "credit_id": "57da231492514179ac000166",
               "name": "Alexandra Weaver",
               "profile_path": "/xcZPL94j67ImY4pmZrmkbbVbrLZ.jpg",
               "id": 1361875,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Darcy",
               "gender": 0,
               "credit_id": "57da232ac3a36830dd00015f",
               "name": "Michael Wildman",
               "profile_path": "/lMD5D5luP2n70SZJI97FYNxLFdi.jpg",
               "id": 30085,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Charlie Rosenberg",
               "gender": 2,
               "credit_id": "57da2358c3a36830e3000159",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Stewardess",
               "gender": 1,
               "credit_id": "57da23a592514179a70001bb",
               "name": "Lucy Akhurst",
               "profile_path": "/nspbFmslDstBFTWhco5BeQOpS6b.jpg",
               "id": 130391,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "London Journalist",
               "gender": 0,
               "credit_id": "57da23c8c3a36830e3000175",
               "name": "Terence Maynard",
               "profile_path": "/pFxcJnlfp1lAnDbgumYynzlkfQE.jpg",
               "id": 67205,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Jane Jarvis",
               "gender": 1,
               "credit_id": "57da23e192514179970001bc",
               "name": "Lorraine Ashbourne",
               "profile_path": "/1CLCZ0Pr4ZZVwAg9UyKZdCDNuBs.jpg",
               "id": 78329,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Frank Dobbins",
               "gender": 2,
               "credit_id": "57da23fac3a36830d10001a4",
               "name": "Peter Gunn",
               "profile_path": null,
               "id": 83548,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Rupert Twist",
               "gender": 2,
               "credit_id": "57da2410c3a36830ed0001ce",
               "name": "Alistair Petrie",
               "profile_path": "/tC5CHVPnxAMqF0W0csTqcDAawwj.jpg",
               "id": 56100,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Mike Bell",
               "gender": 2,
               "credit_id": "57da2425c3a36830d10001b8",
               "name": "Peter Wight",
               "profile_path": "/cjERr21Oo197GJGhPC9HHHhxqdd.jpg",
               "id": 17476,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe475b9251416c75096727",
            "name": "Andy Cadiff",
            "profile_path": "/iQrb6bvjpRbVEPVZwzChl4HtXI5.jpg",
            "id": 80307,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.119342,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 18034,
      "vote_count": 6,
      "budget": 0,
      "overview": "Burt Reynolds stars as Jefferson Steel, a washed-up Hollywood action star desperate to revive his flagging career. When his sleazy agent signs him up for what he believes is a high-profile Royal Shakespeare Company production of King Lear at Stratford upon Avon, Steel thinks he has finally landed the plum role he has been waiting for. However, he soon discovers that he has been tricked into joining an amateur dramatics group for a charity production.",
      "similar": [],
      "original_title": "A Bunch of Amateurs",
      "runtime": 96,
      "poster_path": "/uj3Mz9XGvC17mJKuUatsh4NWUML.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Limelight",
            "id": 57801,
            "origin_country": ""
         },
         {
            "logo_path": "/wgDks2qYgwN6u1OkW1bBre0rf4F.png",
            "name": "Isle of Man Film",
            "id": 2268,
            "origin_country": ""
         }
      ],
      "release_date": "2008-11-17",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "They wished for a star, then wished they hadn't.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andy Cadiff"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Jonathan Gershfield",
         "John Ross"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1171226/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5ODM4MjAzMl5BMl5BanBnXkFtZTcwNzMzNTEyMg@@._V1_SY282_CR81,0,214,282_AL_.jpg",
      "actors": ["Stars: Burt Reynolds, Alexandra Weaver, Elesia Marie | See full cast and crew »"],
      "reviews": [
         "After reading some of the other reviews I wonder what you expect from a nice little English movie. Burt Reynolds was great, but Imelda Staunton was exceptional. She was hilarious in all her scenes and we laughed out loud. It's very British set in a very British setting. If you liked Calendar Girls you'll like this. It's not great art, just great entertainment with a really good British cast, and an ageing but nevertheless very entertaining Burt Reynolds. Burt Reynolds who I must admit I did not think could act was quite good throughout and delivered his Shakespeare well. If there was one criticism it would be the scenes in the US were not brilliantly shot",
         "I'm a Burt Reynolds fan - there i have admitted it! Anyway, to see a film of his get a theatrical release made this a must see film for me...and i wasn't disappointed. No need to go over the plot but all the performances in the film are excellent and Burt is the best he has been for years..in fact since Boogie Nights in my opinion. Like the other comments, there were no really laugh out loud moments but just a nice stream of funny,well acted and moving moments. The scene at the start were Jefferson Steele was watching an old home movie of his daughter was moving,well acted by Burt. He obviously was quite happy to send himself as the has-been star (so appropriate) but still with a lot to prove. Despite all the bad plastic surgery he has had, he didn't look too bad in this film..and that in itself made me pleased. So overall, this is charming,warm hearted film with some great performances. As for Burt, his best film in years, without any doubt. He is obviously still a great actor, with tremendous screen prescence and is rightly hailed as Hollywood legend. I just hope we see more of Burt in films of this quality.",
         "I saw this twice today on DVD and loved it. Of course, it's pure fantasy and I wish it had really been shot in one of Suffolk's Stratfords, though the Isle of Man serves well enough. Burt Reynolds does grumpy very well and, as ever, isn't afraid to send himself up - and nor is the great Derek Jacobi as his bitchy rival. I thought Imelda Staunton's turn as his adoring, then disillusioned fan overdone, but Samantha Bond is a tour de force as his less enchanted director. The build-up to the storm scene is ingenious and when he gets out of his vehicle Reynolds shows that he can cut the mustard as Lear. Of course, the other members of the Stratford Theatre Company are improbably good actors, but I shan't complain. The final twist is an extra treat. What a shame only Her Majesty seems to have seen the film in the cinema",
         "First off, i'm a big fan of Burt Reynolds (and his movies) and i was amazed to see (that after what seems like an eternity of DTV movies) he's finally back on the big screen (were he belongs) Reynolds plays a has-been action movie star, who simply can't get any decent roles. Upon threatening his shrewd agent (Charles Durning) that either he be found a good acting project, or be fired...Reynolds is given a dream chance of playing 'King Lear' in England. Reynolds hops on a plane to the UK, expecting to be pampered and working with the likes of Dame Judi Dench....only to find that, he's not in Stratford upon Avon....just plain Stratford (in Suffolk) with an amateur group of would-be thespians. What then follows is the usual 'fish out of water' gags, of a 'Yank in the UK'....and slowly but surely, Reynolds forms a bond with the group (who had once been skeptical about) As a fan of Reynolds, i could watch him in anything, but i will admit, that the movie could have been funnier (although i did howl with laughter at a few of Burt's foul-mouthed retorts to the earnest thespians) There's no real huge 'laugh-out' moments in the movie, but it does leave you with a big smile afterwards. The rest of the cast are good too (with a special nod to Derek Jacobi, sending himself up, just a little) Charles Durning (Burt's usual sidekick) has a small role as his bankrupt agent/manager (He does look very frail throughout the movie though, but still occasionally has that 'twinkle' in his eye) All in all, A BUNCH OF AMETUERS won't win any awards for originality (but it did receive a 'royal premier' in the UK last month) but it IS a warm feel-good movie, that should hopefully put Reynolds in good favour with projects more worthy of his talents....I hope?",
         "I don't go to the movies very often - in fact I can't remember the last time - but this was on offer and I'm very glad that I took it up. I have always liked Burt Reynolds, particularly Evening Shade, and I adore Charles Durning, so I squeaked a bit when the names came up at the start. It's a gentle mickey-take of English village life, English country types and the ageing movie start grasping at straws to redeem himself before it's too late. Beautifully shot - I don't care where - in British Countryside with cottages to die for, clear complexions and charming pigs, it is funny, engaging (by the yardstick I judge any film or programme - do I care if they all live or die; the answer in this case, is obviously \"yes\"). The characters are all wonderfully drawn and the story bowls along at a comfortable pace, witty, pretty and a damn good night's entertainment. I enjoyed an ice cream at the interval, but I shall buy it on DVD.",
         "A Bunch Of Amateurs is an understated little gem. I do not suppose it will gain a wide release, but it deserves wider circulation than it will achieve. Burt Reynolds is Jefferson Steel, a fading star of big-budget but increasingly awful action movies. When the offers dry up he presses his agent (an ill-looking Charles Durning) to find him work. And when the offer comes to play King Lear on stage at Stratford, Steel is on the first trans-Atlantic flight. However, due to imperfect communication, he is appalled to discover that the production in question is taking place in a converted barn in the little village of Stratford (not -on-Avon) to save the local amateur theatre group from going under. Steel tries to escape but can't, and the initial culture clash between privileged, pampered Hollywood superstar on the one hand, and low key, frugal, rural England on the other, slowly begins to have its effect. Reynolds is fine, if a little unemotional, but the fun in this film comes from the rest of the cast, particularly from Imelda Staunton who is note-perfect playing the besotted landlady of the B&B where Steel stays. The story is slight, but the situation is inherently funny and the script ticks all the right boxes. There is an interesting plot development just past the halfway mark which runs in a slightly unexpected direction before the movie finishes up on course at the end. Thankfully it avoids moving into the romance which is threatened from time to time, although this can be read into what happens after the closing credits if you so wish. If I have one criticism - and it is a very mild one - it is that a village drama society featuring Derek Jacobi and Samantha Bond is hardly A Bunch Of Amateurs!",
         "Don't let anyone tell you what to enjoy and what not. I've read some reviews that weren't very kind to this film, and decided to have an opinion of my own and watch it. Fallen star Jeff Steel (Reynolds at his best) watches his career and personal relationship with his daughter fade away as the years go by and people forget very easily the old icons. As fate would have it, he ends up in a small village in Britain to lead a bunch of amateurs as King Lear in an event that will raise money for charity. This doesn't seat well with Steel, but, this being a romantic comedy, you know that he will go through a great changing, not only as an actor but also as an individual, coming out a better artist and man. A Bunch of Amateurs is a small, simple movie, but the kind of picture you can tell that it was done with the heart. What a cast Burt had in this one. Sir Derek Jacobi steals the film and runs away at every opportunity, the man is just unbelievable, great!His name belongs to the same page as the names of other Britain's favorites, like Anthony Hopkins or John Gielgud. He gave the movie's outstanding performance and stood out among the others. The picture really belongs to Jacobi. Charles Durning couldn't be left out, this being a Burt film, and adds immensely with his presence as Steel's agent, a small role, sure, but it was wonderful to see him back on screen. Samantha Bond represented the moral balance, the soul of the theater actors and the community, she brought so much to it. Imelda Staunton lent her talent to the landlady, the comic relief who brought the funniest moments to this otherwise really nostalgic film that is a homage to the theater and the lives of people who give it all for this dream. Specially moving was when SPOILERS AHEAD Burt is saying good-bye to the folks after the winning theater performance for charity, and suddenly his daughter appears on the doorsteps, a surprise orchestrated by his British friends, and both reunite and all is finally well, father and daughter at peace. Very moving and brought tears to my eyes SPOILERS END. So,don't be fooled. Just don't expect something mind-bending, but if what you're looking for is some ninety something minutes of an entertaining and sweet story, with some laughs and tears, A Bunch of Amateurs if your movie. It reminded me greatly of another British jewel, Bigger than the Sky, another gem that is a must-see!",
         "After a pointed opening, first showing an almost empty theater complete with someyoungchick euuuuing \"Gross! He could be her grandfather!\" at the end scene (Reynald's actor character kissing someotheryoungchick) of Steele's last film, then going to a brokendown slummy playhouse to show Steele's daughter dressed in modern clothing sucking a cigarette while delivering woodenly lifeless lines from Austin's Pride and Prejudice before removing her shirt in order to show her breasts to an actor of another race (note the male audience member clearly there just to see that), the film moves into an understatedly amusing exploration of what it means to be an older actor in a realm that attempts to deny aging exists. Along the way we get some brilliantly funny moments (as when a passerby mistakes Steele for Sean Connery) and a nice sprinkling of other thematic analyses on a light hearted note (eg class, pretension, the changes wrought in character by fame and/or fortune, eccentricity and acceptance of it). As mentioned in other reviews, this is not a gutbuster laffaminit production; it's far too realistic for that. I personally dislike most of the comedy genre because, as a friend put it, (most of) what is considered funny involves a total lack of reality and/or utter stupidity. Those enjoying that sort of humor will probably like this for its comedic value, but we laughed aloud several times. On the whole, a very good movie, and much better than the majority of modern fare in its ability to tell a story without relying on utterly gratuitous sexual/gore splattering/vicious-and-malicious/physical violence scenes.",
         "Last DVD on the comedy shelf, it was either this or \"18-year old virgin\" or many things that weren't quite American Pie with Eugene Levy. This won, by default, and was actually a pretty decent laugh. Burt was a little unintelligible but the British cast all hit the spot and the scenery played its part. A little bit Local Hero meets Shakespeare in Love, sit back on a slow evening and let the film entertain you. It's all fairly predictable in pace but the writing is good and delivery effective. What's more important is something like this got made and provides an alternative to all those Eugene Levy movies! No offence, Mr. Levy",
         "What great fun this is. We laughed a great deal. I shall be buying it for sure. I'm mystified by someone's comment that \"villages like this don't exist any more in England. Has that person ever been to England? Or if English, have they never been outside a city? Come on, live where we live and you'll see that village is pretty normal. We have plenty of villages where the village shop hasn't been closed down yet. Even supermarkets aren't perfect. I'd never seen Burt Reynolds in anything before that I can recall and I'd no idea he could be so entertaining - I had visualised him as a typical Hollywood beefcake in tough movies. Well now I'll look out for his movies, or at least any that aren't Hollywood formula thugs and car chases and the like. Nice to see Derek Jacobi, a fav. actor of mine, and how well he played petulance! Everyone else is the typical \"characters\" of any imaginary village - that doesn't make the real village behind the actors any less real! The guesthouse, oh dear, that bedroom is ghastly. I howled at the scene that got the American actor slung out of the guest house for fornication. It didn't need to be totally original, it was predictable, but it was so well acted that it was completely fresh. Nice to see pieces of Lear too, the Bard needs more \"exposure\" these days! How I laughed when the American complains that the \"script\" needs drastic cutting!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Isle of Man Film",
         "CinemaNX",
         "Limelight"
      ],
      "summaries": ["A sleazy Hollywood agent tricks one of his clients, a faded action star, into playing King Lear in an amateur charity production in England."],
      "budget": 0
   },
   "movielensId": 101642,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-11-17",
      "dvdReleaseDate": null,
      "directors": ["Andy Cadiff"],
      "runtime": 96,
      "movieId": 101642,
      "title": "A Bunch of Amateurs",
      "mpaa": "",
      "actors": [
         "Burt Reynolds",
         "Derek Jacobi",
         "Samantha Bond",
         "Imelda Staunton",
         "Alexandra Weaver",
         "Michael Wildman",
         "Charles Durning",
         "Lucy Akhurst",
         "Terence Maynard",
         "Lorraine Ashbourne",
         "Peter Gunn",
         "Alistair Petrie",
         "Peter Wight"
      ],
      "imdbMovieId": "1171226",
      "originalTitle": "A Bunch of Amateurs",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Burt Reynolds stars as Jefferson Steel, a washed-up Hollywood action star desperate to revive his flagging career. When his sleazy agent signs him up for what he believes is a high-profile Royal Shakespeare Company production of King Lear at Stratford upon Avon, Steel thinks he has finally landed the plum role he has been waiting for. However, he soon discovers that he has been tricked into joining an amateur dramatics group for a charity production.",
      "tmdbMovieId": 18034,
      "avgRating": 2.66667,
      "releaseYear": "2008",
      "numRatings": 3,
      "posterPath": "/uj3Mz9XGvC17mJKuUatsh4NWUML.jpg"
   }
}