{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz musician",
            "id": 3017
         },
         {
            "name": "musician",
            "id": 4048
         },
         {
            "name": "bebop",
            "id": 164882
         }
      ],
      "imdb_id": "tt0107464",
      "video": false,
      "title": "Lush Life",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Al gorky",
               "gender": 2,
               "credit_id": "52fe48bdc3a36847f8176f27",
               "name": "Jeff Goldblum",
               "profile_path": "/t812WlNdP6F2ksRj21JF68DUiwz.jpg",
               "id": 4785,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Buddy Chester",
               "gender": 2,
               "credit_id": "52fe48bdc3a36847f8176f2b",
               "name": "Forest Whitaker",
               "profile_path": "/4pMQkelS5lK661m9Kz3oIxLYiyS.jpg",
               "id": 2178,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Janis Oliver",
               "gender": 1,
               "credit_id": "52fe48bdc3a36847f8176f2f",
               "name": "Kathy Baker",
               "profile_path": "/y9Sw1QsJQvcqDPvG4vYVy1lfR5P.jpg",
               "id": 1907,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Singer",
               "gender": 0,
               "credit_id": "52fe48bdc3a36847f8176f33",
               "name": "Valerie Bickford",
               "profile_path": "/ipMs4d6trwAReFp1QKbsZgAYDmv.jpg",
               "id": 157938,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe48bdc3a36847f8176f37",
               "name": "Don Cheadle",
               "profile_path": "/b1EVJWdFn7a75qVYJgwO87W2TJU.jpg",
               "id": 1896,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe48bdc3a36847f8176f3b",
               "name": "Lois Chiles",
               "profile_path": "/wJ6qXkZjqJybgVz83RluAx6Fzn7.jpg",
               "id": 10475,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lester",
               "gender": 0,
               "credit_id": "52fe48bdc3a36847f8176f3f",
               "name": "Alex Désert",
               "profile_path": "/bGkIL5tS0J8W2pmzizGRQ05n14G.jpg",
               "id": 110141,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48bdc3a36847f8176f23",
               "name": "Michael Elias",
               "profile_path": null,
               "id": 163244,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "545412a50e0a2648c80022f9",
               "name": "Michael Elias",
               "profile_path": null,
               "id": 163244,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.368293,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 55144,
      "vote_count": 2,
      "budget": 500000,
      "overview": "Jeff Goldblum and Forest Whitaker star as New York jazz musicians, forced to confront a life beyond their hedonistic existence when a personal crisis strikes.",
      "similar": [
         873,
         2148,
         244786,
         279,
         594,
         313369,
         695,
         239,
         114150,
         254470,
         354912,
         525,
         152603,
         31900,
         333667,
         638,
         341012,
         9684,
         271714,
         2266
      ],
      "original_title": "Lush Life",
      "runtime": 101,
      "poster_path": "/2DzeRMompTtyxoeUVlQTC4WEBrd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Showtime Pictures Inc.",
            "id": 37014,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Chanticleer Films",
            "id": 3400,
            "origin_country": ""
         }
      ],
      "release_date": "1993-10-01",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Elias"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Michael Elias"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107464/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NDg5MjgwMF5BMl5BanBnXkFtZTcwNzU4NjUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ernie Andrews, Jeff Goldblum, Buddy Arnold | See full cast and crew »"],
      "reviews": [
         "This is a real modern jazz movie; there are precious few of those, notwithstanding the efforts of those who have gone before or since. The \"buddy\" aspect, ala \"Brian's Song\" is well done, but for me, the energy is in the music, which is given as much rein as a drama from Hollywood permits.This music is mainstream hard bop, superbly performed by Chuck Findlay (trumpet) among others.I believed in the musicians' love of the music for its own sake. I think it very strange that in the entire history of \"modern\" jazz, which for most musicologists occupies the period 1942-present, only \"Round Midnight\" and \"Bird\" and (maybe)\"Giant Steps\" address the music in a meaningful way on a par with this film, documentaries and concert films excluded. One sees clearly that \"Lush Life\" is a labor born of love, destined to be a largely overlooked made for TV film.",
         "I really enjoyed this movie. You could call this a \"slice-of-life\" movie, the kind of movie that I usually hate, so why did this one work? Reason one: Great stars. The three leads, Jeff Goldblum, Forest Whitaker, and Kathy Baker are three of my favorites. I've seen Jeff and Forest mis-cast in some bad movies, so it does my heart good to see them in roles where they seem to slip into their characters so easily. Forest's earlier experience in Clint Eastwood's Bird (a movie I did not enjoy) may have been useful here. The shots of Goldblum playing the sax made it look like he was really playing it. Kathy Baker can do it all. Her natural sweetness comes through in every performance. The script was probably written with younger actors in mind, and would have worked better, but Goldblum here at 41 and Baker at 43, manage to convince us they are a thirty-something Bohemian couple still working out their life plan. Reason two: Great supporting cast. Don Cheadle and Lois Chiles head a supporting cast where all the performances are spot-on. Reason three: Great music. Reason four: good dialog. This is a low-key, warm and fuzzy movie you don't have to think too hard about.",
         "\"Lush Life\" is a film that shows the world of jazz musicians with accuracy, something other films have tried, but failed to do. Thanks to director Michael Elias we are presented a realistic film with some of the best music heard in this type of movies. Mr. Elias must know this milieu well, judging what one sees in the picture. The three principals, Jeff Goldblum, Kathy Baker and Forest Whitaker do good work together. Best of all, the characters they are playing appear to be real. We watch as these musicians struggle to make a living going from gig to gig in order to make ends meet. Their world is all about music and the pleasure they get from playing together. The surprise was Kathy Baker singing a jazz standard with great style and voice. The story of Buddy's illness is not exploited to make the viewer feel sorry for the man. In fact, Buddy doesn't want anyone's pity as he faces a horrible end. The supporting cast is excellent in conveying the atmosphere of the world of jazz in New York.",
         "My brother turned me on to this movie and I've about worn out my VHS copy of it. A lot of jazz movies suffer from \"short attention span camera syndrome\"... i.e., once the music starts, after a bit, the camera wanders away and busies itself with some irrelevant bit of drama or dialog. \"Lush Life\" suffers from this problem only slightly, I'm happy to say. I was particularly impressed with how believable the actors look when they're playing their instruments. I do have one criticism of this movie, however, and it's a doze as far as I'm concerned: why, why, why, didn't they release a soundtrack album? I would have bought it in a heartbeat and I'll bet most of the other people who saw this movie would have, too. In an age when the soundtrack album is all but ubiquitous, to have a movie that does not have one -- when the movie is ABOUT MUSIC -- is beyond understanding.",
         "Here is another movie that will never turn a profit. The reason is quite apparent. There are no sex scenes, no nude scenes, no foul language to speak of, no explosions or idiotic car chases. Also, there really isn't much of a story line. But on the other hand,,,,,,,for those of us who have lived through that era of small sleazy night clubs (and big ones too), supper clubs, piano bars, and many other neighborhood \"show\" bars, and thrived on the music and excitement of small jazz groups, this modest little movie was an epiphany. It was a throw back to the times when, if you had the right contacts, you were invited to stay in an \"after hours\" joint and listen to some great talent \"jam' until dawn for no other reason than the thrill of the music that those musicians loved to play. We know the plot of the movie because we lived it, if only vicariously. I call it a \"bomb\" because that is what it takes to keep me awake throughout a movie, without looking at my watch. It was in fact, a serendipity. I give it an unqualified \"10.\" Thank goodness some movie producers send us a crumb, now and then, that we can much on,,,without getting indigestion.",
         "Lush Life is a fairly standard buddy movie (with Forest Whitaker and Jeff Goldblum), but this time the buddies are interesting people and have talent. There's also a slight \"cherchez la femme\" subplot, but it adds to the story instead of distracting from it. Kathy Baker does a wonderful job of proving her character's importance to the story without taking (too much) away from the interactions between Goldblum and Whitaker, two jazz musicians each facing their share of turning points in each of their lives. The music is what kept me interested. Each of the principals has a big-name jazz stand-in, and the voice and virtuoso playing of the stand-ins practically steal the movie. I love classic jazz; if you do, too, see -- and, more important, listen to -- Lush Life. P.S. If anyone knows whether a soundtrack album exists, or even a few CDs where I can find the tunes, please let me know.",
         "I remember seeing this years ago and besides Forest Whitaker and Jeff Goldblum having the major roles in this movie the thing I was impressed with was the music. So much so that I wondered all this time if there is a soundtrack available. This is the second time in several years that I've searched for this movie for the same reason, only I forgot the name of it but always recall the two major actors so I knew I could find it again. I didn't realize that this was a made for TV movie, I don't recall what the plot was but I do recall FW and JG and foremost was the Big Band sound that blew my mind. I gave it an eight mainly because I don't really remember it but that it was a mishmash of what I can recall of it and that I would very much like to get the music. I'm a Blues and Rock and Roll lover and the only place I've seen Big Band stuff is on TV and the only mike was just for the singer. I imagine the whole venue grooving to it's natural vibe.",
         "I'd say the strongest point is the music by Lennie Niehaus. He also did the music for all of Clint Eastwood's movies. The acting is really terrific, and the story is an accurate portrayal of the Bohemian life style of New York jazz musicians. One error in some of the reviews: Kathy Baker did NOT sing the songs, Sue Raney did. This was apparently a lip-sync by Raney, who is a well-known and respected vocalist here in southern California. The producer was generous in letting real musicians have some of the acting roles. For example, Jack Sheldon had a cameo role as one of the musicians, and the obnoxious booking agent was played by Buddy Arnold, a long-time jazz reed player on the west coast.",
         "I found this movie to be esoteric and not available to the human condition of love and relationships. It is involved with ego, only. Tell this writer to get a grip on reality and relationships. a dying musician is all the heart this movie has. I feel nothing. The cast can be stellar, but not in this movie. I think that don cheadle is fantastic as are the other stars. They did the best they could under the circumstances. The producer was great, the writing less than agreeable. Was something missing? Perhaps the heart and soul of the writer? Really great producing and acting, but the story leaves a lot to be desired. a bomb."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Chanticleer Films",
         "Showtime Pictures Inc."
      ],
      "summaries": ["Superb drama about two best friends who play jazz in night clubs."],
      "budget": 0
   },
   "movielensId": 101706,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-10-01",
      "dvdReleaseDate": null,
      "directors": ["Michael Elias"],
      "runtime": 101,
      "movieId": 101706,
      "title": "Lush Life",
      "mpaa": "",
      "actors": [
         "Jeff Goldblum",
         "Forest Whitaker",
         "Kathy Baker",
         "Valerie Bickford",
         "Don Cheadle",
         "Lois Chiles",
         "Alex Désert"
      ],
      "imdbMovieId": "0107464",
      "originalTitle": "Lush Life",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["smIcDoNkFhU"],
      "plotSummary": "Jeff Goldblum and Forest Whitaker star as New York jazz musicians, forced to confront a life beyond their hedonistic existence when a personal crisis strikes.",
      "tmdbMovieId": 55144,
      "avgRating": 4.25,
      "releaseYear": "1993",
      "numRatings": 2,
      "posterPath": "/2DzeRMompTtyxoeUVlQTC4WEBrd.jpg"
   }
}