{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0272440",
      "video": false,
      "title": "According to Spencer",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Spencer",
               "gender": 2,
               "credit_id": "52fe47e4c3a36847f814de0b",
               "name": "Jesse Bradford",
               "profile_path": "/irD0iVNTmR0kEkVTZmKTuZejbGH.jpg",
               "id": 17772,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Melora",
               "gender": 1,
               "credit_id": "52fe47e4c3a36847f814de0f",
               "name": "Mia Kirshner",
               "profile_path": "/n8XXrUi2PEdY6MiEaTQD0fgavsW.jpg",
               "id": 18658,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ezra",
               "gender": 2,
               "credit_id": "52fe47e4c3a36847f814de13",
               "name": "David Krumholtz",
               "profile_path": "/5171elOp1qFxf9c8DkpeyhHBB6d.jpg",
               "id": 38582,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Feldy",
               "gender": 2,
               "credit_id": "52fe47e4c3a36847f814de17",
               "name": "Adam Goldberg",
               "profile_path": "/utlFTzTDP5VDQYXmzdHBbfloYhb.jpg",
               "id": 6163,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Craig",
               "gender": 2,
               "credit_id": "59f975da9251414c3500db9e",
               "name": "Brad Rowe",
               "profile_path": "/htYBmmA2qtBNwt5zCG2WCH1TWWM.jpg",
               "id": 65475,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Wendy",
               "gender": 1,
               "credit_id": "59f975e6c3a3682dd700da85",
               "name": "Marissa Ribisi",
               "profile_path": "/cKbSKPlaPIFbp5v32rekgENjYi2.jpg",
               "id": 27727,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "59f975f29251414c2300dc00",
               "name": "Precious Chong",
               "profile_path": "/4dXvC5Ghod77ya40j3rBXLwdDJx.jpg",
               "id": 1585650,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Grandma",
               "gender": 1,
               "credit_id": "59f975fec3a3682dd700daa0",
               "name": "Florence Stanley",
               "profile_path": "/vAmeCmnBkihYH2xhZ6mIpIMdJLm.jpg",
               "id": 84323,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Louis",
               "gender": 2,
               "credit_id": "59f976069251414bd500d6a3",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Jason",
               "gender": 2,
               "credit_id": "59f97610c3a3682d5000d249",
               "name": "Shane Edelman",
               "profile_path": "/dZlUEZMzoh4kXVvZE3lWdRxLSfI.jpg",
               "id": 61854,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Rona",
               "gender": 0,
               "credit_id": "59f9761ec3a3682d5000d25e",
               "name": "Meredith Morton",
               "profile_path": null,
               "id": 127539,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Nick",
               "gender": 2,
               "credit_id": "59f97626c3a3682d6a00d073",
               "name": "Rib Hillis",
               "profile_path": "/cn9CTVqeYCiPakOUKcYD2ZMe6df.jpg",
               "id": 158223,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "59f9762ec3a3682d7b00ecb6",
               "name": "Adam Brody",
               "profile_path": "/jeMhuu9Q81XJLIef1OU7NlcxRW0.jpg",
               "id": 11702,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "59f976369251414c1600d903",
               "name": "Amelia Marshall",
               "profile_path": null,
               "id": 1216010,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Young Spencer",
               "gender": 2,
               "credit_id": "5a08569bc3a368337f017045",
               "name": "Sean Flynn",
               "profile_path": "/pq6BwfLHCredsEkOLWEuWmsiVXe.jpg",
               "id": 22474,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5884623fc3a368065001839e",
               "name": "Shane Edelman",
               "profile_path": "/dZlUEZMzoh4kXVvZE3lWdRxLSfI.jpg",
               "id": 61854,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58846262c3a3684ec6015be6",
               "name": "Shane Edelman",
               "profile_path": "/dZlUEZMzoh4kXVvZE3lWdRxLSfI.jpg",
               "id": 61854,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58846284c3a368063c016ee8",
               "name": "Meredith Morton",
               "profile_path": null,
               "id": 127539,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5884629f925141045d017744",
               "name": "Marissa Ribisi",
               "profile_path": "/cKbSKPlaPIFbp5v32rekgENjYi2.jpg",
               "id": 27727,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.566964,
      "production_countries": [],
      "id": 51167,
      "vote_count": 2,
      "budget": 0,
      "overview": "According to Spencer, She's the one... Everyone else thinks so too!",
      "similar": [
         3134,
         298312,
         8810,
         281,
         948,
         4638,
         10212,
         11564,
         43923,
         133805,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483,
         101,
         205
      ],
      "original_title": "According to Spencer",
      "runtime": 94,
      "poster_path": "/jiY1F7XeKkeABxXOGNrVBO5Ebnz.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2001-08-15",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shane Edelman"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Marissa Ribisi",
         "Meredith Morton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0272440/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MjcxMzcxN15BMl5BanBnXkFtZTcwNDAxMDYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jesse Bradford, Mia Kirshner, David Krumholtz | See full cast and crew »"],
      "reviews": [
         "I saw this movie on cable on rainy day when there was nothing else on TV, not knowing what to expect but my curiosity was peaked by the talent (Mia Kirshner, Giovanni Ribisi, Jesse Bradeford...script by Melissa Ribisi). I was surprisingly thoroughly entertained and laughed myself silly. It was funny! It's one of those films that if you live of have lived in Los Angeles, you can appreciate the humor. Kind of like Swingers (I saw Swingers when I lived in NY, and I didn't get the hype, then I saw it a few years later after moving to LA and I couldn't stop laughing). Not a masterpiece but if you're ever home on a rainy day and should happen to stumble across this one on cable, it's the worth the time.",
         "Not the greatest or most original story of all time, but curiously sweet and engaging story about a long lost first crush and surprise reunion. I have said previously that I thought Jesse Bradford was a bad actor, but while I still don't think he's spectacular, I think he is very cute and did a great job in this film. (The film I was so harsh about was the awful SWIMFAN. It was just a horrendous film all around, and probably not Bradford's fault at all, since the film had quite a few good actors that I normally enjoy.) The rest of the cast is even better, including Mia Kirshner, Brad Rowe, Adam Goldberg, David Krumholtz, Shane Edelman (who also directed I believe), Marissa Ribisi, Precious Chong and in a smallish role, Giovanni Ribisi. I had wanted to see the film for several years due to my admiration for Marissa Ribisi and her films. She co-wrote this film, which began life with the title THE MAILROOM. I also really loved her first co-written project, SOME GIRL. I miss these small, low-profile indie comedies and I hope she will give us more of her talent soon.",
         "This movie was sub-par at all attempts at comedy,romance,and wit.Most of the movie is spent emphasizing the wounds we all suffer after a relationship is broken or lost.The leading woman was SO boring,she could hardly hold my attention or interest and she just came off as annoying.The best part of the film was Spencer's room-mates.They made me laugh a little,hardly enough to recommend this movie to my friends.The truth is,if this movie made more of an attempt to be a romance or comedy,not both,the characters would be more defined and we could see their point of view and understand why they have certain tendencies towards relationships.So if you want to kill an hour and thirty four minutes,but don't want to get caught up in a movie's plot,see \"According To Spencer\". P.S. if your seeing this movie for Giovanni Ribisi,don't turn your head or you'll miss his MINUTE AND A HALF cameo!!",
         "What should have been a light-hearted, witty comedy has few laughs and becomes dull, stodgy, lame and predictable. Despite an appealing cast (Jesse Bradford is good to watch) the film is let down by a script that starts off promisingly and then fades out, becoming infantile, unfocused and rather boringly under- and undeveloped. I hate not watching films to their completion. And I watched this till the end, where the film became limply predictable. Even the end credits feature jokes and situations which raise eyebrows rather than laughs. One of the film's dreary subplots involves the (poor) making of a (poor) \"art\" or pornographic film. Like *that* film, *this* film feels an experimental, in-house drag. It should never have been made.",
         "Spencer (Jesse Bradford) moves to Los Angeles to start anew. Unexpectly, he runs into (literally!) a car driven by a girl, Melora (Mia Kershner), from his home town who he has admired for years. Voila! She also works at the same advertising firm where Spencer has just signed on as a mail clerk. However, there are complications. To begin, Melora has an on again, off again relationship with a big ad man from the same company. Also, Spencer has a room in an old mansion owned by a gay male couple, who may need him to star in their film project. It is X-rated! Does Spencer have a chance with the lady of his dreams? For those who love old fashioned love stories, this one is a good one! The two stars are wonderfully attractive and funny and the bizarre stream of characters that inhabit the film hit the funny bone, too. The costumes are a bit dismal but the local scenery is very nice. However, a word of caution is advised. There is some racy dialogue pertaining to the gay couple and their pornographic film. While the number of minutes devoted to them is small, those who like good clean fun may be offended. Nonetheless, this film shoots an almost-straight arrow at the heart of those who cherish the timeless tale of love.",
         "Okay, I admit it, I only rented this movie out because Jesse Bradford is in it (which if you ask me is good enough reason alone!) What I got was basically a predictable romance...There are a few amusing scenes in this film (mainly those with Spencer's room-mates) But thats it. The movie relies too heavily on gay jokes and basic plot elements. Best watched for either a Jesse perve, (which is worth it by the way!) Or for an easy-to-watch pretty much brain-less film.",
         "There are elements of this film that surpass the \"typical chick-flick\" genre. What shines in this picture are the smaller roles and the writing. Marissa Ribisi and Precious Chong give amazing performances in the \"film-within-a-film,\" and Florence Stanley is, as usual, brilliant. Yes, it is a treat for the \"I could watch Jesse brush his teeth\" set, but nothing beats David Krumholtz in his underwear. Even when he's not singing.",
         "There was a couple things that stood out when I watched this film. 1. Nearly 1/3 of the movie was out of focus. This is a crew position that producers must hire experienced people in. 2. It was very obvious that the Director of Photography was no camera operator. ***Spoilers below*** The story was very flat, and the \"roommates\" attempt at making a \"porn\" was so pathetic, it was actually tough to watch. This movie takes place in modern times, yet the \"camera\" they were using was from what the early 70's? The woman that showed some skin was in her 40's. Couldn't they of found a hot young actress to play that part. Giovanni's sister Marissa was nice, but they were shooting a \"porn\" with their clothes on....lame. There was obviously sexual tension and attraction between Spencer and Melora, but nothing develops except they kiss at the end. To make the story at least interesting, they should have gotten it on at some point. Mia's breasts were practically hanging out in a couple scenes, and the practically see through shirts she had on a couple times teased the viewers, but we would have preferred a taste, it would of at least supported the whole sexual theme that was present in the whole movie. And lastly, what was up with the MULLET on the Ezra character. I grimaced each time I looked at that. Too bad all of his shots were in focus, and most of Mia's were out. If it were the other way around, I wouldn't of minded so much.",
         "The stale premise - an innocent youth comes to the big city and against all odds wins the career and girl of his dreams - is not made fresher by such devices as a deceased grandma who keeps showing up to offer sage advice. (The only point of marginal interest is the script's limp switcheroo on \"The Apartment\": Here, it's the junior executive (Kirshner) who's involved with the boss, while the torch-carrying schnook is working class.) In \"King of the Hill\" Jesse Bradford had enough charisma to carry a film, a quality that appears to have receded as puberty set in. Or maybe he just gets poor career advice. Certainly he is ill served by drek like \"SwimFan,\" \"Speedway Junky,\" and this one. . . In a subplot tied with the thinnest of threads to the main story, Spencer's roommates (David Krumholtz and Adam Goldberg) are holed up in a mansion they evidently and unaccountably own, attempting to make an amateur porn film. Watching their mirthless antics I was reminded of the efforts of supporting players Abbott and Costello to shine as a team in \"One Night in the Tropics,\" except neither Krumholtz nor Goldberg would qualify as \"the funny one.\" Even the title is off - Spencer is a clueless naif who never expresses any view of life that would qualify as \"according to.\" The picture seems intended as a lighthearted romp among friends, but the results are just heavy, predictable, and dull.",
         "I go to college, and I have to say I didn't mind sitting down and watching this movie. Granted it was at 2 AM on a Monday night, when I was in a weird mood to begin with, but still worth your time :) If you think you aren't going to like chick flicks, I would say don't discount it. Especially if you are in one of those weird moods, like the ones where you are up at 2 am on a Monday night. Mia Kirchner does a great job, and so does the the main actor, Spencer, (forget his real name). The script was pretty good, and i liked the ending a ton. Like I said if you are a guy don't automatically discount it, watch it with the wife, or the girlfriend, or something."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cinerenta Medienbeteiligungs KG",
         "Cinerock KG",
         "Dream Entertainment"
      ],
      "summaries": ["A young man moves to Los Angeles to make something of himself -- but finds that such a task might take a little more work than he thought -- in this hilarious romantic comedy."],
      "budget": 0
   },
   "movielensId": 101835,
   "movielens": {
      "languages": [""],
      "releaseDate": "2001-08-15",
      "dvdReleaseDate": null,
      "directors": ["Shane Edelman"],
      "runtime": 94,
      "movieId": 101835,
      "title": "According to Spencer",
      "mpaa": "R",
      "actors": [
         "Jesse Bradford",
         "Mia Kirshner",
         "David Krumholtz",
         "Adam Goldberg",
         "Brad Rowe",
         "Marissa Ribisi",
         "Precious Chong",
         "Florence Stanley",
         "Giovanni Ribisi",
         "Shane Edelman",
         "Meredith Morton",
         "Rib Hillis",
         "Adam Brody",
         "Amelia Marshall",
         "Sean Flynn"
      ],
      "imdbMovieId": "0272440",
      "originalTitle": "According to Spencer",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "According to Spencer, She's the one... Everyone else thinks so too!",
      "tmdbMovieId": 51167,
      "avgRating": 2.83333,
      "releaseYear": "2001",
      "numRatings": 3,
      "posterPath": "/jiY1F7XeKkeABxXOGNrVBO5Ebnz.jpg"
   }
}