{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "hollywood",
         "id": 12396
      }],
      "imdb_id": "tt0065380",
      "video": false,
      "title": "Alex in Wonderland",
      "recommendations": [3688],
      "backdrop_path": "/ywW2DWssN1vE6Ap233J6P2fXAVE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alex Morrison",
               "gender": 2,
               "credit_id": "52fe44dc9251416c9101f585",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Beth Morrison",
               "gender": 1,
               "credit_id": "52fe44dc9251416c9101f589",
               "name": "Ellen Burstyn",
               "profile_path": "/kxWFljG3JjJMbOMCLm0SkrPQjhf.jpg",
               "id": 9560,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Amy",
               "gender": 0,
               "credit_id": "52fe44dc9251416c9101f58d",
               "name": "Meg Mazursky",
               "profile_path": null,
               "id": 1185836,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nancy",
               "gender": 0,
               "credit_id": "52fe44dc9251416c9101f591",
               "name": "Glenna Sargent",
               "profile_path": null,
               "id": 1185837,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mother",
               "gender": 0,
               "credit_id": "52fe44dc9251416c9101f595",
               "name": "Viola Spolin",
               "profile_path": null,
               "id": 1185838,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jane",
               "gender": 1,
               "credit_id": "5865b2f19251412b8a024a22",
               "name": "Joan Delaney",
               "profile_path": "/gWrHBKNA9WzqsukZ2o8BzDsTWJ6.jpg",
               "id": 165603,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dc9251416c9101f581",
               "name": "Paul Mazursky",
               "profile_path": "/2ooiA3X9Y0cpyBIAHTpU5Q3Q7em.jpg",
               "id": 47773,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dc9251416c9101f59b",
               "name": "Paul Mazursky",
               "profile_path": "/2ooiA3X9Y0cpyBIAHTpU5Q3Q7em.jpg",
               "id": 47773,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dc9251416c9101f5a1",
               "name": "Larry Tucker",
               "profile_path": null,
               "id": 95605,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.096015,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32599,
      "vote_count": 5,
      "budget": 0,
      "overview": "Bohemian Alex Morrison has just finished directing his first feature length movie. In its previews, the movie is considered a critical, artistic and surefire commercial success. As such, Alex seemingly has his choice of what his next project will be.  Alex has a few thoughts in mind, such as a biopic of Lenny Bruce, or a movie about a black uprising in Los Angeles. As he makes the rounds both in the Hollywood community and European movie centers for ideas, he fantasizes about movie scenarios of those everyday situations he is in. These fantasies are influenced by his movie idols, some who he meets such as Italian director Federico Fellini and French actress Jeanne Moreau.  Concurrently, he is considering what to do about his personal life.  He is wondering if he and his middle-class family should \"move up\". The need for commercial success may ultimately take artistic control out of his hands.",
      "similar": [
         188222,
         10218,
         599,
         74643,
         294016,
         8012,
         11176,
         157851,
         7446,
         856,
         509,
         2118,
         59436,
         371638,
         313369,
         277547,
         270487,
         17057,
         427900,
         1826
      ],
      "original_title": "Alex in Wonderland",
      "runtime": 110,
      "poster_path": "/3kH8QnQL4T9ApYCaBYCaLX9YOBK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Coriander",
            "id": 15151,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1970-01-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Mazursky"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Paul Mazursky",
         "Larry Tucker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0065380/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIyNTcwMzYyNV5BMl5BanBnXkFtZTgwNDYxODk1MDE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Donald Sutherland, Ellen Burstyn, Meg Mazursky | See full cast and crew »"],
      "reviews": [
         "Alex in Wonderland is a great movie. As usual there are users on IMDb who are dissing this movie, telling: ooh, this is the worst D. Sutherland movie, it's so boring, this is not actually a movie (sic!)more short scenes bla bla bla...that's normal. They have a different taste, they've expected something else, who knows....some familiar people were dissing lot of other great directors, you know the ones which were categorized as unconventional, as if movies should been made conventional and well structured including dramaturgish suspense romance and being thrilling also and having \"well written screenplayed executived characters\"...or: they're knowledge in movies could fill a regular bean halfway.... Alex in Wonderland is a near to life movie. I've found myself in some scenes or better, my thoughts. D. Sutherland is bombing in his role playing really deep. He is a long-haired, bearded, free -soul director, who's trying to find a subject for his next movie...and then a lot of funny & strange things are taking place...(what a plot description) It's a movie for your brain & eyes, it's colorful and chilling and warm and intimate and surreal and sad...and it also leaves room for your own thoughts. For all you cine-dudes and D. Sutherland fans give this gem a try. (You can also catch it on TCM) And don't give this dumb user any importance who was saying \"And what's with the \"pedofile\" scene at the beginning of the movie\"...What a jerking doh-doh! In this particularly scene Alex Morrison takes a bath with his child. Which loving father or mother on this holy earth wouldn't take a bath with their own beloved child...If you call that a \"pedofile\" scene, then there is no hope for you fella, you're just sick & rotten....you're head is empty.",
         "Made in the aftermath of the sixties - and not without a hint of LSD - this view on the life, times and troubles of a young movie director, is also a must-see commentary on the relations between art and industry, independent film-makers and big-time producers, American cinema and European cinema. Glorious appearances by Federico Fellini (a hard-working man, whom Alex disturbs in Cinecittá while he's editing a TV special) and Jeanne Moreau serve as extra features that will attract every real movie-buff. At the same time, the movie owes much of its intensity (and/or intimacy) to a close-knit cast, where even the director and his wife are listed. And for very good reasons. If you still think at cinema as an adventure in the making, you won't be disappointed by this one.",
         "It is so blatantly obvious that Mazursky is gently parodying the self righteousness of the hippie movement. When discussing the black uprising movie, it's the black dude who tells him it's a rotten idea. In a more stern observation, his wife is clearly upset and his family life is clearly hitting the skids and he goes on about an acid trip he and his friend took. His wife makes the incredibly accurate observation that he wants her to do what he wants her to do not what she wants to do. Look I fly a little to the left of the left wing but to blather on about Hollywood being left wing when they want nothing more than to do movies where \"things blow up real good\" is kind of ridiculous. The movie is good. It's not great. But it is a keen and well observed characterization of a creative man who is trying to keep his personal and creative life together and vibrant but falls prey to his own self doubts.",
         "I really liked this slice of California in the 70's (late 60's?) Donald Sutherland rules. plain and simple.. his charisma would carry a film even if it were not so well put together as this one... his character is likable but realistic, faults included.. whatever.. I just wanted to recommend the film.. I like a film to set a mood and take you there.. and this does just that, i feel like I know what it would be like to be a director on the verge of having it all in the early 70's, and for an hour and a half I lived it with the cast.. I felt like the mood was similar to that of \"Close Encounters of the Third Kind\", at the beginning, just watching Richard Drefuss's character with his family.. just like a glimpse of what that life would be.. with the good times, and the arguments etc etc.. no explosions, no car chases, just a slice of life.",
         ".....because I have fond memories around it. Yes...it is so very dated. But I remember the tender relationship Sutherland's character had with his family, his wife and two daughters, in this movie. I also remember how entranced I was with Donald Sutherland - the actor. He was so charming. This was the first movie I ever saw with him and the first movie I ever saw in the theater without my parents. It was the first time I was able to go to the movies with friends only, and what a time we had. All five of us silly, giggly, girls....and we couldn't take our eyes off of \"THE Donald\". So when you watch this movie now on cable or DVD, see NOT a movie of no value, but of a wonderful fantasy vehicle that five little girls took one Saturday afternoon in 1970. What a memory!",
         "Contemporary audiences who wonder how loony, \"What were they thinking?\" early 70s Hollywood studio disasters like \"Myra Breckinridge\" were ever made would do well to take a look at \"Alex in Wonderland\": a near anthropologic look at the confused atmosphere that was Hollywood in the 70s. Donald Sutherland (looking alarmingly like \"Myra Breckinridge\"s latter-day hippie director, Michael Sarne) plays a young, hot, filmmaker of the sort Hollywood was blindly courting in the years following \"Easy Rider.\" With the entire industry opening up their doors to him to do whatever he wants, Sutherland is hamstrung by his inability to latch onto what his next film project should be. Torn between a desire to do something meaningful and yet still operate within the \"system\" of Hollywood success, Sutherland, through a series of fantasies and vignette encounters, grapples with the very real possibility that he really hasn't any more depth in him than the Hollywood hacks he derides, and that his half-hearted hippie-era beliefs bring him no closer to happiness or self awareness than anyone else. There is much to dislike about the structure of \"Alex in Wonderland\" (riffing on Fellini's \"8 1/2\", the film is mired in too many 70s era movie clichés), but I enjoyed how it shined a refreshingly candid light on that point in time when Hollywood was so unsure of itself that it was handing over millions to any and everyone calling themselves a \"director\" so long as they were young and espoused a \"now\" and \"with it\" philosophy. It implodes the romanticism that shrouds Hollywood's most recent \"Golden Age\" and provides a well-observed character study to boot. If there is a problem with Hollywood films about Hollywood, it's that those involved (understandably) take the business of making movies so very seriously, but most of us average folks find it hard to identify meaningfully with individuals who agonize and fret in palatial homes and near-perfect weather, while producing for the most part, escapist (sometimes willfully mindless) entertainment motivated principally by the desire to make enough money to buy even bigger palatial homes.",
         "i saw this for the first time last night and thought it was fantastic - the best Mazursky movie i've seen (by far). i come here and find it has a 5.0 and most people hate it... strange. must have hit me at the right moment. i've been interested in seeing it for 20 years - glad i didn't until now. yes, portions are derivative and pretentious, but Sutherland's incredibly likable and the film has a free and easy feel reminding me of a kind of urban easy rider. it's more of a long poem than a standard movie. the sequence at Mazursky's office is amazing.",
         "\"Alex in Wonderland\" is an absolutely different kind of film.It is one of those American films which talks about film making albeit in a very superficial manner.This is one of the few weak spots in the film as its narrative shifts quickly from one philosophical or ideological stance to another.This film can also be termed as Alex's adventures in wonderland as its eponymous protagonist film director Alex tries really hard to strike a fine balance between his professional and personal lives.Director Paul Mazursky is able to make his film appear a serious experience for a débutant film director by ensuring that there is absolutely no coherent link between two phases of a director's lives : personal life and professional life.Although Alex's journey in wonderland begins with a truly shocking scene which might be construed as somewhat scandalous by certain prudes,overall story gathers momentum once more pertinent characters are introduced.Paul Mazursky also plays a brief yet important role in this film to make us aware of the fact that not all filmmakers live in wonderland.His film suggests that most film directors live in ordinary surroundings where they try to deal with their strengths and weaknesses in equal measure in order to invigorate their artistic lives.It does not matter if not all viewers would be able to associate themselves with \"Alex in Wonderland\" and its hidden motives.One thing which can be said is that some serious fans will not be disappointed as they get to see great master of cinema Italian cinema maverick Fellini and French cinema diva Jeanne Moreau.",
         "This is definately not for everybody. I found this really interesting and since I started combining forces of cable TV with IMDB I discover really nice films. After all THERE ARE nice, different & interesting american films, even in the seventies! Anyway, this movie is not for people who like one-dimentional films. This is both serious and funny, both tragic and amusing. Even if its not too slow, it won't appeal to those who like it fast. Basicly it's about an intelligent director who is starting to lose it a bit. This is depicted in a most realistic way. I dont know what it has in common with Fellini's 8-IN-1, as I havent seen it. Anyway ALEX IN WONDERLAND implies a straight effect of 8-IN-1 on it. The dialog is the strongest about this one and people on stupid action films or those who dont like a dialog based flick wont find anything in this one.",
         "Paul Mazursky's second feature is a not entirely successful patchwork of a film. A director (Donald Sutherland) struggles to come up with an idea for a second film. He has flights of fancy, daydreams, and some pretty interesting fantasies. It doesn't really come together, but it's never dull and Mazursky takes some pointed jabs at Hollywood (note the director's own cameo as a far too mellow studio head). Sutherland is fine and Ellen Burstyn plays his wife. Michael Lerner and Mazursky's own daughter Meg have supporting roles. There's a curious cameo by Federico Fellini and Jeanne Moreau appears, singing a song. Written by Mazursky and then writing partner Larry Tucker. The great cinematography is by László Kovács. A noble failure."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Coriander"],
      "summaries": [
         "Bohemian Alex Morrison has just finished directing his first feature length movie. In its previews, the movie is considered a critical, artistic and surefire commercial success. As such, Alex seemingly has his choice of what his next project will be. Alex has a few thoughts in his mind, such as a biopic of Lenny Bruce, or a movie about a black uprising in Los Angeles. As he makes the rounds both in the Hollywood community and European movie centers for ideas, he fantasizes about movie scenarios of those everyday situations he is in. These fantasies are influenced by his movie idols, some who he meets such as Italian director Federico Fellini and French actress Jeanne Moreau. Concurrently, he is considering what to do about his personal life. He, his wife Beth and their two daughters live a middle class lifestyle. He is wondering whether it makes sense to \"move up\", which means that movie making not only has to achieve his main purpose of saying something meaningful, but also has to be commercially successful. That need for commercial success may ultimately take artistic control out of his hands.",
         "After his first film is a hit, a young director is caught in the classic bind between art and commerce--he wants to make a film that challenges the audience and makes them think, and the studio wants something simple that will make them a ton of money."
      ],
      "budget": 0
   },
   "movielensId": 101954,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1970-01-01",
      "dvdReleaseDate": null,
      "directors": ["Paul Mazursky"],
      "runtime": 110,
      "movieId": 101954,
      "title": "Alex in Wonderland",
      "mpaa": "R",
      "actors": [
         "Donald Sutherland",
         "Ellen Burstyn",
         "Meg Mazursky",
         "Glenna Sargent",
         "Viola Spolin",
         "Joan Delaney"
      ],
      "imdbMovieId": "0065380",
      "originalTitle": "Alex in Wonderland",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["iDQO2TyQ31c"],
      "plotSummary": "Bohemian Alex Morrison has just finished directing his first feature length movie. In its previews, the movie is considered a critical, artistic and surefire commercial success. As such, Alex seemingly has his choice of what his next project will be.  Alex has a few thoughts in mind, such as a biopic of Lenny Bruce, or a movie about a black uprising in Los Angeles. As he makes the rounds both in the Hollywood community and European movie centers for ideas, he fantasizes about movie scenarios of those everyday situations he is in. These fantasies are influenced by his movie idols, some who he meets such as Italian director Federico Fellini and French actress Jeanne Moreau.  Concurrently, he is considering what to do about his personal life.  He is wondering if he and his middle-class family should \"move up\". The need for commercial success may ultimately take artistic control out of his hands.",
      "tmdbMovieId": 32599,
      "avgRating": 2.5,
      "releaseYear": "1970",
      "numRatings": 3,
      "posterPath": "/3kH8QnQL4T9ApYCaBYCaLX9YOBK.jpg"
   }
}