{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117102",
      "video": false,
      "title": "Mr. Wrong",
      "recommendations": [
         15170,
         41779,
         25723,
         12257,
         7269,
         39472,
         79783,
         91445,
         44373,
         65137,
         23570,
         39128,
         48288,
         51321,
         20551,
         40562,
         25796,
         47329,
         5734,
         10879
      ],
      "backdrop_path": "/erx8f0naEnBc4J9DqtkNtRK1bfI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martha Alston",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f81291ad",
               "name": "Ellen DeGeneres",
               "profile_path": "/wBB6C4IGsYlHzIEMW6Q3JIvNAfz.jpg",
               "id": 14,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Whitman Crawford",
               "gender": 2,
               "credit_id": "52fe4735c3a36847f81291b1",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Inga Gunther",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f81291b5",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jack Tramonte",
               "gender": 2,
               "credit_id": "54f4f48a9251416abf0006b2",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Crawford",
               "gender": 1,
               "credit_id": "54f4f47ac3a3683e2f000653",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Annie",
               "gender": 1,
               "credit_id": "52fe4735c3a36847f81291b9",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jane",
               "gender": 0,
               "credit_id": "56b68665c3a3680700009a2b",
               "name": "Ellen Cleghorne",
               "profile_path": "/xRVZuXRHuYitl7QS5ky3d61W9Ij.jpg",
               "id": 1232807,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Nancy Culpepper",
               "gender": 1,
               "credit_id": "56b686cac3a36806ee00a93a",
               "name": "Christine Cattell",
               "profile_path": "/Vc98PXsRVmQxMzeGA6OcTpRj2L.jpg",
               "id": 170162,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dick Braxton",
               "gender": 2,
               "credit_id": "56b686e3c3a36806fc009eec",
               "name": "Robert Goulet",
               "profile_path": "/2otsVjndiCN3RtHr0oUWZlAHY9N.jpg",
               "id": 128621,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4735c3a36847f81291bf",
            "name": "Nick Castle",
            "profile_path": "/ecUHW93fTzJLCEZcpfvfjgNMi1o.jpg",
            "id": 14692,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.931284,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47475,
      "vote_count": 23,
      "budget": 0,
      "overview": "A single and lonely woman finds the seemingly perfect man to date, but soon regrets it when his deranged and possessive other personality emerges and worst still, she cannot convince anyone else of his Jekyll/Hyde true nature.",
      "similar": [],
      "original_title": "Mr. Wrong",
      "runtime": 96,
      "poster_path": "/8oZW1loLEczN1BU60YobsJJFdSR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1996-02-16",
      "vote_average": 3.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Castle"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Chris Matheson",
         "Kerry Ehrin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117102/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0MTAxMjcyMl5BMl5BanBnXkFtZTcwMTIzMTEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ellen DeGeneres, Bill Pullman, Joan Cusack | See full cast and crew »"],
      "reviews": [
         "I just saw \"Mr. Wrong\" on cable TV, and it surpassed all my expectations. The movie boasts a pitch-perfect cast, great gags, and genuine heart. I defy anyone not to at least smile when the children's chorus launches into \"I Want to Know What Love Is\" in Spanish. Please note: I'm not some shill for whoever sells the home video of \"Mr. Wrong.\" Nor am I hopelessly devoid of taste: I know why movies like \"Planes, Trains and Automobiles\" are funny, and why movies like \"North\" suck. \"Mr. Wrong\" has been unjustly placed in the latter category. If you're willing to take a chance on an \"ugly duckling\" movie, make this the one.",
         "Mr.Wrong has been unfairly reviewed. Designed as a vehicle for the considerable comic talents of Ellen Degeneres, this perhaps wasn't what many people were expected. Okay so its got a glossy sheen and typical 'madcap' comedy music but its tone is much darker than your average comedy. Ellen plays Martha, a single women who thinks shes found the man of her dreams in Whitman, played with creepy assurance, by Bill Pullman. After making the mistake of telling him to act like himself, it becomes clear that he is completely insane. He makes her shoplift, sends her endlessly random gifts, steals mexican kids for her and in the most uncomfortable scene of all, in an effort to show her how much he loves her, he breaks his finger for her. For some people this may sound more like the plot of a thriller and some critics did find the film a little distasteful but for black comedy fans, this is great fun. Degeneres is fantastic as the goofy heroine, providing most of the films laughs. The random humour of the film is what makes it really funny. Disgruntled ex Joan Cusack's attempts to strike back at Degeneres are great. 'Do you want gum in your hair?', 'Prepare to be consumed by ants!', 'Don't be nice to her! Pull her hair!' It may not be to everyone's tastes but this is a real comedy gem.",
         "I would have to disagree with the overall rating of this movie- personally I loved it! It's so funny! I would definitely tell anyone that's interested in seeing it to do it and ignore the bad reviews of it- hey who know's you may end up loving it!!!",
         "I wish Ellen made more movies. The talk show is cool but I think that she's wasting her talent. \"Mr. Wrong\" is a good case in point. Ellen is totally convincing in her role of a woman disappointed by, and still searching for, love. The casting was brilliant. Hope Davis, Bill Pullman, Joan Plowright, Dean Stockwell and Joan Cusack are an awesome ensemble. The premise of the movie is simple and straightforward enough to be believable but broad enough to allow for any number of crazy things to happen. Her character's job as a talk show producer is brilliant because it allows for cameos of all of Ellen's comic colleagues. It is also an old-fashion comedy in the tradition of It's A Mad, Mad, Mad World, and all of the other 60's comedies showcasing stand-up acts like Martin & Lewis, Bob Hope, etc. This movie was a lot of fun and I've seen it quite a few times.",
         "This is possibly the worst movie ever made. It is at least the worst movie I've ever seen. Not only were most of the scenes unfunny, but they hurt me to watch them. \"Dark Comedy\" or not, this film belongs in the genre of \"Bad Comedy.\"",
         "Martha (Ellen DeGeneres) is a single, thirty-something television producer who has had very bad luck in her relationships with men. Therefore, when she meets Whitman at the jukebox (Bill Pullman), a self-proclaimed investor-poet, she is smitten with his intelligence and his good looks. However, after a couple of dreamy days and nights, Whitman decides to reveal his \"true self\". He tells Martha he's going to take her on a fun date...they are going to go shoplifting. This is the just the beginning of the swell times ahead! Poor Martha! Will she never find true love? DeGeneres and Pullman display full-octane comedy in this film. The viewer can not help but laugh at their antics. And the supporting cast is such a dream, with Joan Cusack, Dean Stockwell, Joan Plowright and others! The script is humorous, the costumes are a pleasure, the San Diego setting is very nice, what more could one ask for? Please give this film a try, you'll like it!",
         "Poor Ellen. She's finally getting some respect in Hollywood with excellent performances in such films as edTV, The Love Letter, etc, yet has to deal with having starred in this flop. Talent such as herself, Bill Pullman, Joan Cusack, Dean Stockwell, Ellen Cleghorne, and the sensational Joan Plowright is wasted in this turkey. I must admit however that it did start off promising - the typical single woman living in the shadow of recently married sister, meets nice guy, blah blah blah.. but went totally downhill soon afterwards. What caused Whitman (Pullman) to be such a hyperactive fool? And Joan Cusack and her feeb slave Bob? I love Joan, she's had some great roles (hence the 2 oscar noms) but not even her charismatic prowess can save this hairball. She has to deal with a brainless character who cuts couches and puts gum in Ellen's hair! Sheesh - and the Mexican kids?? Well, I laughed at that scene.. I found it to be quite racist also mind you. Unfunny, unoriginal and uninspired right up to the end wedding where Ellen is in rollerblades or something and Joan is sporting a rifle. Spare me the hyperbole and give me my ninety minutes back. 2.5/10",
         "SPOILERS THROUGH: I watched this movie never having heard anything about it so I was able to decide for myself, without knowing anything about what it was going to be about. I'm not going to say there wasn't any comedy in this movie because there was. There were moments of total hilarity due to an hysterical Bill Pullman who was really in top comedic form. The problem is, when those moments were NOT happening the movie just wasn't very good. It was a great premise but there were a lot of things about the movie overall, that I did not enjoy. This movie was strongest in the beginning, where I thought it was going to be a movie similar to \"Bridget Jones Diary\". But I felt the movie went downhill fairly quickly. I guess this is what one would call a \"black comedy\" but as with many of this genre, I felt the movie was to focused on the meanness and not so much on the comedy. When Pullman's character first starts unraveling it's OK but after awhile it becomes a bit of overkill. The movie just becomes way to cruel, as more and more bad things happen to Ellen's character. That's the focus of the movie really, not the comedy. It's almost like the movie's seeing how many awful things can happen to Ellen'c character, and how much of her life can be destroyed etc etc. It didn't make me laugh, it made me a bit dazed and frankly I just wanted the movie to end. Throwing ants and gum on someone, and that person losing their job etc etc is not what I consider to be funny. The truly funny moments existed when Pullman was on screen because, as utterly annoying as his character came to be, he was hilarious. So yes there were a few moments where I laughed out loud. But those moments did not make the movie, for me, a great one. Another thing I didn't like was that the movie became way to over the top, a Virtual cornucopia of melodrama. Inga & Bob,rather then being funny, were a bit obnoxious. The whole wedding storyline was way to much. And the movie felt so LONG. I mean I know it wasn't but it FELT like it was. Ellen was very good as the lead though and Pullman, as mentioned was REALLY good and should probably have his own comedy television show. In a way I think I would have liked this better as a straight on comedy without the mean element or as a romance where Pullman's character did NOT change but stayed Normal. Or maybe even as a thriller or a film Noir. Basically I just felt this movie didn't work as a black comedy. I wouldn't consider this one of the worst movies ever made however. I would not recommend it either.",
         "OK, everybody HATED this film, and I would've hated it too, if it wasn't for my last love affair... A similar stuff happened to me as well, and in some very funny parts of the film I saw myself, trying to break up but not being heard... Awful situation, believe me! So, this film made me laugh at my life, actually... it's weird when you watch it, but oh well. If you're in a relationship like that, or have been in one, you'll probably enjoy it.",
         "I guess you have to have lived through this kind of stuff to get the outrageous humor! Terrifically done - Bill Pullman is hilarious as is Degeneres...Joan Cusack and her sidekick were FUNNY and Walter a perfect fit. If you have pretty normal relationships forget it but if you have had to deal with some pretty weird partnerships - give it a try. I bought it because I enjoy watching it once in a while. My kids 11 and 13 loved it, too."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Mandeville Films",
         "Marty Katz Productions",
         "Touchstone Pictures"
      ],
      "summaries": [
         "Martha is a single woman working at a television talk show. When her younger sister gets married, everyone's wondering when Martha is going to meet Mr. Right and tie the knot. When by chance, Martha meets a handsome stranger named Whitman, the two fall madly in love with each other. But soon Martha discovers little quirks in Whitman... little quirks that become horrifying nightmares. But by the time Martha realizes that she must break up with him, it'll take more than subtle hints to make him go away -- she'll have to get into the most outrageous predicaments to rid herself of Mr. Wrong.",
         "A single and lonely woman finds the seemingly perfect man to date, but soon regrets it when his deranged and possessive other personality emerges and worst still, she cannot convince anyone else of his Jekyll/Hyde true nature."
      ],
      "budget": 0
   },
   "movielensId": 102,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-02-16",
      "dvdReleaseDate": "2002-06-04",
      "directors": ["Nick Castle"],
      "runtime": 96,
      "movieId": 102,
      "title": "Mr. Wrong",
      "mpaa": "PG-13",
      "actors": [
         "Ellen DeGeneres",
         "Bill Pullman",
         "Joan Cusack",
         "Dean Stockwell",
         "Joan Plowright",
         "Hope Davis",
         "Ellen Cleghorne",
         "Christine Cattell",
         "Robert Goulet"
      ],
      "imdbMovieId": "0117102",
      "originalTitle": "Mr. Wrong",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["vUn8MuKaOxQ"],
      "plotSummary": "A single and lonely woman finds the seemingly perfect man to date, but soon regrets it when his deranged and possessive other personality emerges and worst still, she cannot convince anyone else of his Jekyll/Hyde true nature.",
      "tmdbMovieId": 47475,
      "avgRating": 2.43647,
      "releaseYear": "1996",
      "numRatings": 2117,
      "posterPath": "/2mLYVmBnfo741Wc1uXjUCLT0Itu.jpg"
   }
}