{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sword",
            "id": 1938
         },
         {
            "name": "cave",
            "id": 1964
         },
         {
            "name": "castle",
            "id": 3098
         },
         {
            "name": "viking",
            "id": 5895
         },
         {
            "name": "combat",
            "id": 18543
         }
      ],
      "imdb_id": "tt1667903",
      "video": false,
      "title": "Thor: Tales of Asgard",
      "recommendations": [
         230896,
         103269,
         56590,
         65291,
         17445,
         394355,
         14611,
         14609,
         166076,
         30675,
         257346,
         21683,
         30061,
         43641,
         14830,
         14613,
         17074,
         101907,
         284274,
         19323
      ],
      "backdrop_path": "/sYtby8VBJnEBG6X9dH3CVIgzQO2.jpg",
      "revenue": 3100000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Odin (voice)",
               "gender": 2,
               "credit_id": "54f03b66c3a3686d5800775e",
               "name": "Christopher Britton",
               "profile_path": "/bEVBGYJVTqPQYt3K00GB5na3xyV.jpg",
               "id": 37981,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Frost Giant (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fbef",
               "name": "Clancy Brown",
               "profile_path": "/xBVifBW0riMSbedEQ27hObjPqVw.jpg",
               "id": 6574,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Sif (voice)",
               "gender": 1,
               "credit_id": "52fe46b6c3a368484e09fbf3",
               "name": "Grey DeLisle",
               "profile_path": "/b2Viqswr0mAULRfPqeA0J40icyy.jpg",
               "id": 15761,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Hogun (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fbf7",
               "name": "Paul Dobson",
               "profile_path": null,
               "id": 52283,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Fenris (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fbfb",
               "name": "Brian Drummond",
               "profile_path": null,
               "id": 74364,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Loki (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fbff",
               "name": "Rick Gomez",
               "profile_path": "/fqxDQWzG4OHZVqgnOqhS2HRSXPt.jpg",
               "id": 123532,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Thor (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fc03",
               "name": "Matthew Wolf",
               "profile_path": "/6ZhmizT6lQnGAr7ayNHTSG9CoU3.jpg",
               "id": 94022,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Volstagg (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fc07",
               "name": "Jay Brazeau",
               "profile_path": "/oSFswqMxjLCAwVpEG2yK6NzLUiP.jpg",
               "id": 63791,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Fandral (voice)",
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fc0b",
               "name": "Alistair Abell",
               "profile_path": "/8NpOt0Tqszhg23oLPNZ1PTWV9zg.jpg",
               "id": 63797,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46b6c3a368484e09fbcf",
               "name": "Sam Liu",
               "profile_path": "/6YLCBYqgILXZNpHql8xxadZldXq.jpg",
               "id": 90367,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fbe1",
               "name": "Jack Kirby",
               "profile_path": "/xLVSa7mX1BCyVoKD2wyRGEQXj8M.jpg",
               "id": 18866,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b6c3a368484e09fbe7",
               "name": "Stan Lee",
               "profile_path": "/dTr2gJPL7jELKVkcjtoNx80uVKR.jpg",
               "id": 7624,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "57a39eb592514160e50004e9",
               "name": "Greg Johnson",
               "profile_path": null,
               "id": 1215939,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57a39ec2c3a36854c20006c8",
               "name": "Greg Johnson",
               "profile_path": null,
               "id": 1215939,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 2,
               "credit_id": "59028bfb9251413e15000d09",
               "name": "Kevin Feige",
               "profile_path": "/AewbqQQT0FbcE358rcbopZ3zgDV.jpg",
               "id": 10850,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 2.084529,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63686,
      "vote_count": 58,
      "budget": 0,
      "overview": "Hungry for adventure, Thor secretly embarks on the journey of a lifetime, joined by his loyal brother Loki, whose budding sorcery equips him with just enough magic to conjure up trouble, along with the Warriors Three - a band of boastful travelers reluctant to set sail on any adventure that might actually be dangerous. But what starts out as a harmless treasure hunt quickly turns deadly, and Thor must now prove himself worthy of the destiny he covets by saving Asgard itself.",
      "similar": [
         10191,
         1911,
         879,
         2310,
         616,
         82702,
         8009,
         308504,
         766,
         9342,
         4935,
         9255,
         1735,
         120,
         808,
         10882,
         27022,
         34851,
         37430,
         9313
      ],
      "original_title": "Thor: Tales of Asgard",
      "runtime": 77,
      "poster_path": "/jmszqWpP6JehbetACrTwo0GdGcT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Marvel Animation",
         "id": 13252,
         "origin_country": ""
      }],
      "release_date": "2011-05-16",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Before the hammer ... came the sword",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sam Liu"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Greg Johnson",
         "Craig Kyle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1667903/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxOTU4NzIxMV5BMl5BanBnXkFtZTcwNzE3NjAxNQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Wolf, Rick Gomez, Tara Strong | See full cast and crew »"],
      "reviews": [
         "This film was much better than I expected. True, it does have some anime influence (like slim bodies and expressive eyes) but most contemporary cartoons have that anyway. In short, this movie is about a teenage Thor embarking on a quest to prove his manhood to his father, who still considers him immature. With the aid of his brother Loki and the Warriors Three he travels through different realms to complete his quest. What I liked in this film was that it showed a different, refreshing perspective on Thor and Loki's relationship. In this film we actually see Loki as a caring brother who is a loyal Asgardian. He and Thor share a special bond, trust each other and, when times get tough, provide each other with support. Seeing this just makes it even more heartbreaking as the viewers know that in the future these two would become mortal enemies. Some dialogues were actually funny without relying on simple humor - even giving room to a bit adult humor when it came to Fandral. There is romance (concerning both brothers), and there are notable number of dark scenes and dialogues which concentrate on the topics of genocide (yes, genocide!) and character death. Unlike most children's cartoons nowadays, it has quite a few mature themes which adults may like. All in all, it was a pleasant surprise and more mature than I expected. I warmly recommend this film. PS - the music was epic!",
         "I got this film purely by accident, thinking it was going to be the another Thor movie that has just been released. Ever since childhood, I have been repeatedly surprised by how many books/movies/songs that I never wanted in the first place turned out to be good when I reluctantly decided to give them a try. My first impression was that this was going to be just another silly story for kids, because we see Thor as a brash youth. I was tempted to turn it off after only a few minutes, but I'm glad I stuck with it. I suspected, of course, that the story was going to show how Thor grew up and became the hero we know him to be today, but I didn't know exactly how that transition would take place. Presumably, after taking a few blows on his chin, he was simply going to pick up his hammer and crush evil into submission, convincingly proving once again that 'might makes right'. And, if that were all there is to this story, I wouldn't be recommending that you watch it yourself or show it to your kids. Like most youths, Thor has a sense of ambition and adventure that ultimately gets him into trouble. But Thor is not an ordinary youth, being the son of Odin, his rash actions place the entire kingdom of Asgard in grave danger. It is at this point, when he accepts responsibility for his own actions, that we see his remarkable transition from boy to man. In fact, we are impressed when he proves to have the wisdom of a man many years his senior. So, as it turns out, the moral is the same as in other superhero stories, that is, having great power isn't what counts the most, but rather knowing how to use it wisely is. I have read more than my fair share of comics, even as an adult, so this theme isn't really news to me. This time, however, I saw it from a different perspective, through the eyes of an adolescent who had to learn the lesson the hard way. And, then I saw something I had been missing all these years. I knew the part about the hero forgiving the bad guys, but I realize now that what is more important is that Thor forgave himself. This sense of compassion is perhaps the main reason why Thor goes on to be a great hero, while his brother Lochi eventually becomes a villain.",
         "This movie is great at what it is and the people giving it the negative reviews need to get out of the box once in a while. What it is; is a look at Thor and Loki on their first real adventure, the trouble they get into (good and bad) and the consequences of their actions. It is also a brief look at Thor's relationship with Sif and the Valkyrie. Animation is good, not great, but the story and fresh perspective of the young Thor make up for it. I rated the movie high because I enjoyed the risk they took to make it; PLUS, anytime I can watch a movie like this and not guess just about every plot twist AND still enjoy the movie and the story---I am happy. Fun watch, and if your a Thor fan, you will like it all the more.",
         "Before their fateful destinies could be realized, Thor and Loki were best of bros, one craving adventure and the other content with a good book and magic lessons. Here was to be the coming of age tale of Asgard's greatest legends; a tale of hope, brotherly love and of innocence lost in the fog of war. Was to be. Instead, Thor Tales of Asgard comes across as typical kid friendly fantasy fare which, aside from the emotionally charged finale, would sit well as a Disney channel afternoon special. Think Disney's \"Young Hercules\" or \"Tarzan II\" or perhaps \"Little Mermaid: Ariel's Beginning\". Unsophisticated, child friendly prequels intended for a cheap laugh and netting a little extra cash. Delayed for almost a year in order to coincide with the release of the blockbuster live action THOR film, Thor Tales of Asgard, originally named \"Son of Asgard\" is neither a prequel to that film nor is it an adaptation of the stylish \"Tales of Asgard\" stories by Stan Lee and Jack Kirby. Instead of chronicling a pivotal event in the life of Thor, like his quest to prove himself worthy of wielding his enchanted hammer, or some important bit of unseen Asgardian history, Tales of Asgard feels like \"just another day of adventure\"; almost like a premiere episode of a TV cartoon. Eager to prove himself to his (girl)friend Sif, Thor drags the unwitting Loki to stow away on a vessel belonging to Fandral, Hogun and Volstagg, better known as the Warriors Three. Thor intends to follow the Warriors Three to the frost giants realm of Jottenheim and find the legendary Sword of Surtur. Soon they discover that tales of the Warriors' adventures have been greatly exaggerated and after a laughable turn of events, convince the three bozos to to join Thor's quest. But Frost Giants do not take kindly to trespassers and a brash act by Thor threatens to plunge the realms into war once more. The only hope for this motley crew of males to return to Asgard is to seek help from the men hating Valkyries. Meanwhile, Odin and his dark Elf court official try to delay the war through diplomacy and deal with a hidden threat from within their own ranks. Any one who has even the slightest knowledge of the fantasy genre would tell you that something called a \"Dark Elf\" is never good news. As if the elf's extremely helpful attitude, \"smooth talking\" British accent and overly humble demeanor did not already scream \"I am hiding something and trying my best to look like a good guy\". It is so obvious at first glance that it fails to be any sort of spoiler. The same goes for the rest of the plot. If you have seen a typical fantasy themed Disney movie, you can spell out the plot here with no problem. At least the writer, Greg Johnson, manages to pepper the otherwise boring narrative with sharp well written dialog. Particular mention goes to the way the brotherly dynamic between Thor and Loki is written, accentuated by the professional voice acting. Only Loki goes through significant character development however which climaxes at the finale and believably leads the boy down his dark future. The development is written as gradual and nuanced, a bright spot of maturity in the otherwise juvenile story. Thor Tales of Asgard further enhances its \"weekend afternoon Disney show\" feel through its visuals. The Japanese \"AnswerStudio\" is the company behind the animation work and although their stuff is not as stellar as GONZO or Madhouse, their past work on direct to DVD animation like Doctor Strange and The Invincible Iron Man maintained a better that normal standard for a direct to DVD animation. This movie however showcases animation that is no better than an episode of Ben 10 crossed with a cheap imitation of 2002's He-Man animated series artwork. Backgrounds lack detail, sometimes looking no better than a Kindergarten picture book. THe level of detail on characters is no more intricate than TV animation like Teen Titans and the colors are bright, shiny but at times flat. Even more shocking is the number of obvious animation errors. For example, At some points, the background moves out of sync with the characters feet giving the impression that they are sliding and not walking. After awesome action in shows like \"Hulk Vs\" and \"Planet Hulk\", this movie is possibly Director Sam Liu's most insipid piece of work. With the success of the live action blockbuster THOR, no doubt Thor Tales of Asgard would net in some cash, preying on uninformed kids and their parents who would not know better. It might be worth a download just out of curiosity though. Lacking the thunder of a blockbuster, the quality of a direct to DVD animation and the epic spectacle of the comic books, Thor Tales of Asgard is a tale best left untold.",
         "Really enjoyable movie covering the early years of Thor and Loki. This enhances the theatrical movie, without kissing it's ass. For example, it still takes many designs from the original source material, even if it conflicts with the more popular movie. Seeing the realms of Asgard in animation is wonderful, as there is less of a restraint. The character arcs of Thor and Loki are also very impressive. Their relationship is shown as one of true love, but we see their reactions to taking life. This isn't Thor Jr. and though the animation is kind of childish, there are many great themes here that would be welcome in The Avengers or any Thor sequels.",
         "Teenaged Thor is the headstrong older son of Odin, King of the Norse gods. Determined to do something to prove himself to his father, and accompanied by his brother Loki, he stows away with the Warriors Three and off they go on a quest which develops into something quite problematic. This feature from Marvel Animation can be taken as a direct prequel to the first live action Thor film. It is a decent story, well told, with all the main characters nicely realised, both visually and vocally. Character design tends towards manga style, but fits quite well with how the story is delivered. There is a lot of action and mild violence, but nothing particularly graphic: it is exciting but not frightening, and will suit viewers from about age 6 to adult.",
         "It's titled Thor but it's really not the Thor we know. It's the young Thor before he had his mighty hammer Mjölnir. So Thor doesn't behave the typical way you like him to behave, here he is more of a spoiled teenager. And he doesn't drink any beer or mead. The plot is lame in my opinion, quite stereotypical for a fantasy movie but with a worse plot structure. The dialogs were childish, same for the characters behaviors. And because its set when Thor was young there is nothing happening on earth so it just feels like any kind of fantasy-animation. I liked the real Thor Movie with Chris Hemsworth way better than this one. And I also liked Thor and the depiction of Asgard in Hulk VS. Thor much better. It's just so much about action that it bored me... it is really nothing special but you can watch it if you don't have any better plans for your evening. The character development was also quite lame I think this movie could be much better if they did character introductions so that you know who is who and they could have used a smaller amount of characters. A friend of mine who saw this as well was quite confused about all those characters, for someone who doesn't know the relations between the people of Asgard and those Frost Giants and the hirarchy system in Asgard it's just all too much. And because of this each character loses it's individuality and also it's importance, in this storyline, which also leads to a loss of tension... And that's why this movie is just mediocre in my opinion."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Lionsgate",
         "Marvel Animation",
         "MLG Productions 7"
      ],
      "summaries": [
         "Long before he was worthy to wield the war hammer, Mjolnir, Thor, son of Odin, was an impetuous young prince of Asgard hungry to prove himself a worth warrior. To that end, he and his half-brother, Loki, stow away with the the Warriors Three to find the Sword of Surtur in Yodenheim. However, that quest would prove more challenging than the prince anticipated as grave perils and agonizing moral choices arise. Now, Thor must call upon far more than his strength to save his people from the consequences of both of his and his father's mistakes in an adventure that would help shape him as the great Avenger of a later time and world.",
         "The young Norse god Thor embarks on a quest with his brother Loki to find and recover a legendary sword."
      ],
      "budget": 0
   },
   "movielensId": 102009,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-05-16",
      "dvdReleaseDate": "2011-05-17",
      "directors": ["Sam Liu"],
      "runtime": 77,
      "movieId": 102009,
      "title": "Thor: Tales of Asgard",
      "mpaa": "PG",
      "actors": [
         "Christopher Britton",
         "Clancy Brown",
         "Grey DeLisle",
         "Paul Dobson",
         "Brian Drummond",
         "Rick Gomez",
         "Matthew Wolf",
         "Jay Brazeau",
         "Alistair Abell"
      ],
      "imdbMovieId": "1667903",
      "originalTitle": "Thor: Tales of Asgard",
      "genres": [
         "Adventure",
         "Animation",
         "Action"
      ],
      "youtubeTrailerIds": ["bT6XvIPAN04"],
      "plotSummary": "Hungry for adventure, Thor secretly embarks on the journey of a lifetime, joined by his loyal brother Loki, whose budding sorcery equips him with just enough magic to conjure up trouble, along with the Warriors Three - a band of boastful travelers reluctant to set sail on any adventure that might actually be dangerous. But what starts out as a harmless treasure hunt quickly turns deadly, and Thor must now prove himself worthy of the destiny he covets by saving Asgard itself.",
      "tmdbMovieId": 63686,
      "avgRating": 2.71212,
      "releaseYear": "2011",
      "numRatings": 33,
      "posterPath": "/jmszqWpP6JehbetACrTwo0GdGcT.jpg"
   }
}