{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "journalism",
            "id": 917
         },
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "training",
            "id": 4613
         },
         {
            "name": "relationship problems",
            "id": 5625
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "fighter",
            "id": 6211
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "jail",
            "id": 9890
         },
         {
            "name": "dojo",
            "id": 9992
         },
         {
            "name": "kickboxing",
            "id": 18111
         },
         {
            "name": "courtroom",
            "id": 33519
         },
         {
            "name": "gym",
            "id": 33610
         },
         {
            "name": "montage",
            "id": 33896
         },
         {
            "name": "teaching",
            "id": 161266
         },
         {
            "name": "loose cannon",
            "id": 167114
         },
         {
            "name": "emotional vulnerability",
            "id": 169333
         },
         {
            "name": "arrogance",
            "id": 171070
         },
         {
            "name": "musclemen",
            "id": 186379
         },
         {
            "name": "fear of losing",
            "id": 196704
         },
         {
            "name": "pressure from the press",
            "id": 196711
         },
         {
            "name": "egotism",
            "id": 196712
         }
      ],
      "imdb_id": "tt0101325",
      "video": false,
      "title": "American Kickboxer",
      "recommendations": [40661],
      "backdrop_path": "/jIfqk1yV4j4CpzWH600PunKY5Xh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1007,
               "character": "BJ Quinn",
               "gender": 2,
               "credit_id": "52fe4ae6c3a36847f81e79ed",
               "name": "John Barrett",
               "profile_path": null,
               "id": 182095,
               "order": 0
            },
            {
               "cast_id": 1008,
               "character": "Chad Hunter",
               "gender": 2,
               "credit_id": "52fe4ae6c3a36847f81e79f1",
               "name": "Keith Vitali",
               "profile_path": "/4lFZsvCvUnuJVugg5tycdARSpUi.jpg",
               "id": 583562,
               "order": 1
            },
            {
               "cast_id": 1009,
               "character": "Carol",
               "gender": 1,
               "credit_id": "52fe4ae6c3a36847f81e79f5",
               "name": "Terry Norton",
               "profile_path": "/vykKC0DUCm7mkhVNJ0kDnRQ5Vwe.jpg",
               "id": 137684,
               "order": 2
            },
            {
               "cast_id": 1010,
               "character": "Jacques Denard",
               "gender": 0,
               "credit_id": "52fe4ae6c3a36847f81e79f9",
               "name": "Brad Morris",
               "profile_path": null,
               "id": 85273,
               "order": 3
            },
            {
               "cast_id": 1011,
               "character": "Willard",
               "gender": 0,
               "credit_id": "52fe4ae6c3a36847f81e79fd",
               "name": "Ted Le Plat",
               "profile_path": null,
               "id": 107461,
               "order": 4
            },
            {
               "cast_id": 1013,
               "character": "Robert Bentley",
               "gender": 0,
               "credit_id": "59bd1a44c3a3681bae00f58d",
               "name": "Michael Huff",
               "profile_path": null,
               "id": 1888942,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ae6c3a36847f81e79c5",
               "name": "Frans Nel",
               "profile_path": null,
               "id": 1050711,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ae6c3a36847f81e79cb",
               "name": "Emil Kolbe",
               "profile_path": null,
               "id": 1050712,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ae6c3a36847f81e79d1",
               "name": "John Barrett",
               "profile_path": null,
               "id": 182095,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ae6c3a36847f81e79d7",
               "name": "Sudhir Pragjee",
               "profile_path": null,
               "id": 1050713,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ae6c3a36847f81e79dd",
               "name": "Anant Singh",
               "profile_path": null,
               "id": 23824,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ae6c3a36847f81e79e3",
               "name": "Sanjeev Singh",
               "profile_path": null,
               "id": 1050715,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ae6c3a36847f81e79e9",
               "name": "Helena Spring",
               "profile_path": null,
               "id": 23825,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 0.856591,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 110830,
      "vote_count": 7,
      "budget": 0,
      "overview": "Kickboxing champion B.J. is jailed for an accidental murder thanks to the testimony of his arch-nemesis Denard. A year later, B.J. is released and then challenged by Denard for $100,000. Will B.J. accept and get even with Denard?",
      "similar": [
         8456,
         9053,
         7549,
         391757,
         605,
         604,
         24,
         140300,
         55292,
         43959,
         14756,
         9472,
         1374,
         9502,
         70,
         1367,
         86130,
         17108,
         9461,
         44865
      ],
      "original_title": "American Kickboxer",
      "runtime": 92,
      "poster_path": "/s22Wz0QoLhFMDdnsmWRwMXitLDZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Distant Horizons",
            "id": 1066,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Global Pictures",
            "id": 1978,
            "origin_country": ""
         }
      ],
      "release_date": "1991-07-24",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Frans Nel"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Emil Kolbe",
         "John Barrett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0101325/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzExMDE2MV5BMl5BanBnXkFtZTcwNzQ0MTEzMQ@@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: John Barrett, Keith Vitali, Terry Norton | See full cast and crew »"],
      "reviews": [
         "American KICKBOXER stars 3 terrific martial artists: John Barrett (Tang Soo Do black belt and star of TO THE DEATH), Keith Vitali (ranked by Black Belt Magazine as one of the 10 best Karate fighters of all time, and star of NO RETREAT, NO SURRENDER 3), and Brad Morris (former bouncer, boxer, and professional kick boxer). All 3 do an excellent job in this fine martial arts action drama. The story is your basic Rocky 3 type of film (a mean bad guy, a comeback hero, training scenes, and great fights). Simple as it sounds, it's a formula that works. This one has John Barrett playing a kick boxing champ named BJ Quinn, who accidentally kills a guy while drunk at a party. He is sent to prison for 12 months, and banned from fighting in a championship match for 5 years. (This is based on a real life standard. If a person knows martial arts and injures or kills someone who does not have prior training, the judges may rule it as excessive force.) When BJ returns from prison, the new champ (Brad Morris) taunts him into a non-sanctioned fight. John Barrett (who also came up with the idea for this story) is completely competent, both dramatically and physically, as the kick boxer hero. His character is an anti-hero with flaws. He is a cocky win-by-any-means fighter at the beginning. He drinks, is jealous and quick to start a fight, and has severe anger management problems. He doesn't like who he is, and is mad at the world, for no real reason other than he isn't happy and doesn't know how to change that. Keith Vitali is a natural, as the nice guy who plays by the rules. His character is a great fighter, but doesn't understand that you can't play fair if the other guy doesn't. Vitali's squeaky clean looks and voice fit the part to a tee. The highlight performance comes from Brad Morris. He is absolutely brilliant as the obnoxious, mentally immature villain of the piece. Cocky, arrogant, stupid, loud, and one hell of a fighter, his character will no doubt remind you of more than one real life jerk you have seen or met, which makes his hidden mockery of those types all the more fun. Looking at the negative reviews posted about this movie on IMDb, I felt the urge to post a positive one, as this truly is a film worth seeing for those who enjoy martial arts movies. I saw quite unhelpful comments being posted about spandex, poor fight choreography, bad acting, unintentional comedy, the age of John Barrett, and corny music. The only one of those that I can slightly agree with is the music. There are indeed a couple of cheesy rock ballads unnecessarily put in to emphasize moments of drama, which do make you roll your eyes, because this movie \"ain't no Shakespeare\", and never intended to be. The other comments though are ridiculous. The fighters wear spandex. Big deal! That was what they wore back then. Even today, many wrestlers, kick boxers, and UFC fighters wear it. (All of the guys are in shape, too, which may even motivate guys who watch the movie to hit the gym, while also providing reverse eye candy for girls who are actually nice enough to sit through this type of genre flick with their boyfriends!) Poor fight choreography? Ever watched a real kick boxing or UFC match? The guys in this movie are razor sharp and technically perfect in their kicking and punching. By comparison, most real matches look like garbage. The last match in American KICKBOXER is an absolute must-see! Bad acting? Not at all. The acting is BIG, but that's perfectly in tune with the characters being portrayed. (Ever see some of the idiots in the world of professional fighting today, especially mixed martial arts? Some of those guys act like apes!) Brad Morris does a perfect job playing a musclebound moron of a villain (his character is one you just love to hate!), and the comedy, again provided mostly by Morris as the dumb jock, is a laugh riot, and intentional as such, based on his pitch perfect psycho sports athlete personification. John Barrett is too old? He was only 37-38 when this movie was filmed(!), and is in great shape! His kicks are absolutely flawless. I have never understood why there is such a prejudice against people in movies and sports who are over 30. I know that kids today must think that 30 is ancient, (I remember thinking 25 was old when I was 21), but there have been tons of great fighters over the age of 30. This movie is not off base in that respect. Here are some champs and their ages when fighting: Archie Moore (47), Sonny Liston (32), Jersey Joe Walcott (39), George Foreman (45), Evander Holyfield (38), James Toney (38), Don \"The Dragon\" Wilson (45), Chuck Norris (34), Branco Cicatik (38), Ernesto Hoost (37), Ken Shamrock (41), etc. I highly recommend American KICKBOXER for fans of martial arts movies. It's on my top 100 American martial arts films list. It's not one of those goofy so-bad-it's-funny kind of movies (although ANY movie can be turned into one of those if desired). It's a solid action drama with great (and motivational) training and fight scenes, and touches of pathos and comedy that work very well as they are driven by character. Everybody in the cast does an above average job, and Brad Morris delivers a break-through performance. If you like American KICKBOXER, I also recommend TO THE DEATH (John Barrett), SUPERFIGHTERS (Keith Vitali), and American KICKBOXER 2 (Dale \"Apollo\" Cook). American KICKBOXER 2 bears no relation to this one other than the title, but is extremely entertaining in its own right, thanks to a fast pace and an enthusiastically over-the-top performance by Dale Cook (truly, one of the best performers in the genre).",
         "I wouldn't say that this movie is bad as such, but it's certainly a quite forgettable entry into the vast amount of 80's or 90's martial arts movies. I wonder if they tried to cash in on the popularity of the more well-known Kickboxer franchise. With totally unknown actors who are certainly not among the best, fight scenes which was nothing special and nothing especially interesting in any way, you just don't get there. I guess the total result is OK and acceptable, but when there are so many other movies just like this it's really no reason to watch this at all. Try Kickboxer with van Damme, and even the sequel Kickboxer 2 before even thinking about this one.",
         "BJ Quinn is a champion kickboxer, one night him and his wife are at BJ's boxing promotor's party, then he meets a nasty guy named \"Dernard\" BJ and thinks Dernard is hassling BJ's wife so BJ and Dernard start to push each other around, so BJ accidently punches a guy out and kills him, in court Dernard puts BJ right in it and BJ spends ten months in jail and is suspended from taking part in any kickboxing tornament for three or so years, after BJ's release he and Chad Hunter start training together so that Chad could beat Dernard in the ring. I give this movie 7 out of 10",
         "John Barrett stars as B.J Quinn a prize-fighter who fights his way back to the top when he serves prison time for killing an innocent by-stander in this moronic and dull waste of time. One of the biggest flaws in this moronic chop socky fest is that of the hero in question essayed by Barrett. The character of B.J Quinn is not at all that likable. For one he killed an innocent man (Who was really stupid to try and get in the middle of two professional fighters) and how can we root for someone who thinks he should escape prison because \"It was an accident!\" Indeed as much of a jerk as the main bad guy is (And boy is he ever) I always rooting for him over the protagonist. That isn't the only problem, the fight sequences are all hyped up like Rocky but there is no credibility to be found and really what can be said about a fighter who wears spandex in the ring. Some have argued that this is indeed a laugh riot,I disagree I was too bored by its uninspired story and lackluster pace. Indeed it takes the movie almost light years to get the hero to actually admit he is going to fight his opponent. This is a bomb of the worst kind. A brain dead atrocity to mankind. * out of 4-(Bad)",
         "It was just barely good enough to watch :) The protagonist was not really likable. Why make a movie about a protagonist that's not likable? It might make sense in a few contexts, but not this one. Plot was un-original. Dialog was OK I guess, I have heard worse. Acting was average to below average. Music was nothing memorable. I kind of liked crazy antagonist. The newspaper reporter's character made little sense to me. The girlfriend or wife whatever she was, of the protagonist certainly put up with a lot of crap for a guy not worthy of her - kind of annoying to see. I mean he should have started out, at least, as someone likable, then maybe we could buy into her still caring about his sorry self. Fight scenes were not very smooth. Wooden I might say. Final fight was straight out of a Rocky movie - somehow a guy in the ring getting totally beat up turns it around and wins. I have seen this only rarely in UFC...which means it's possible, but I would prefer a fight where the eventual winner shows something early on, besides just being a punching bag for his opponent. Watchable, but it would have been better if we could have actually cared about the protagonists eventual triumph ( I doubt I am giving anything anyway by saying that, for this formulaic movie.)",
         "The first thing you'll notice about \"American Kickboxer 1\" is THE 1. How did they know when they made it, it would have a sequel...two years later? Talk about jumping the gun on a franchise! Maybe they were hoping to reach eight (to date) sequels like the \"Bloodfist\" series and wanted to show the world they were ahead of the curve. Anyway... World kickboxing champ BJ Quinn (Barrett) accidentally kills Ken Harrigan outside the ring in a freak accident and is sold down the river in court by his conceited, evil rival Jacques Denard (Morris, in a career-defining performance). After getting out of jail after 10 months, he is banned from kickboxing in championship bouts. However, he does train his buddy Chad (Vitali) to take on Denard. All of this drama is being monitored by sassy journalist Willard (Le Plat). Will a grudge match ensue between Quinn and Denard? Who will be victorious? The character of Jacques Denard is an all-time classic. He is French, flamboyant, and flamingly arrogant. He wears a tutu of tassels (!) in the ring. That alone is enough to knock your opponent over! At one of his many press conferences, he wears a bow-tie and no shirt. He has lines shaven in his head and rides a motorcycle. He's the ultimate \"Love to Hate Him\" baddie. He actually eclipses previous jerk from American Shaolin: King of the Kickboxers II, Trevor Gottitall. Interestingly, just as the movie High Risk (1995) has a character not-so-subtly mocking Jackie Chan, \"American Kickboxer 1\" presumably does the same to Jean-Claude Van Damme. We believe Denard is a direct slam on Van Damme. He is a Van Damme lookalike and soundalike, and another character says (the term) \"Bloodsport has a negative connotation\". As \"Kickboxer\" 1 is a Cannon film, as was Bloodsport (1988), it seems to be a sly reference. Perhaps someone in the production here worked with Van Damme, and this is their revenge. A film highlight is the courtroom scene. Quinn's lawyer appears to be about ten years old (no wonder he lost the case). Actually, he resembles Peter Billingsley of Beverly Hills Brats (1989) fame. Denard takes the stand wearing sunglasses and playing with his brass knuckles. Is that allowed? The play-by-play announcers at the kickboxing matches are funny. Is anyone listening to kickboxing on the radio? \"There's a punch! Now a kick! Now a punch!\"...etc... Barrett, a former associate of Chuck Norris, plays, by today's standards an older punchfighter. He was born in 1952, and was a spry 40 when he took on Denard. Like Night of the Kickfighters' 1988) Andy Bauman and Busted Up's (1986) Paul Coufos before him, he shows you don't have to be young to beat people up. Barrett's theme song \"He's a Man\", used during his training sequences, should have been used more, although I don't think we need convincing. \"American Kickboxer 1\" is a decent entry into the punch/kick/fist/fighting/meathead genre. It delivers all the standard stuff you are looking for and doesn't disappoint. It's worth watching for the Denard character alone. If you must see \"1\" movie about kickboxing this week, see \"American Kickboxer 1\"!",
         "B.J. Quinn (martial artist John Barrett) has just gotten out of a one year stint in prison where he was sent after an accidental murder thanks to testimony by Jacques Denard (Brad Morris). Now he has to train for a martial arts contest against his arch-rival Denard, with a paltry $100,000 on the line put up by a shoe company. It's kind of hard to root for a guy who committed manslaughter at a party and remains unrepentant. It doesn't help that the acting is laughably inept in every possible way. Barret is a better kick-boxer than actor. He;s not that good at kick-boxing in this film either. Hoing into this film, you know it'll be horribly acted, but you still hope that it's hilarious it it's ineptness. It's not. It's boring, dull, and not worthy of anyone's time My Grade: D-",
         "American Kickboxer 1 (yes thats right 1) has to be the most presumptuous martial arts film ever....not happy enough to call it American kickboxer, they were so confident that they would have sequels they called it American kickboxer 1! not a bad film in fairness but I wouldn't say worthy of sequels, another generic kickboxer film from the 80's, fight scenes are pretty slow and there's not really much else to go on...except for a class corvette and equally class 80's hair cuts...4 thumbs up!...out of 10...also watch out for my film coming out this summer with Miramax...starring michael dudikoff... \"King of the American Kickboxer Ninja Kings 1: Battle for a sequel...or sequels\"",
         "Spoiler warning!!! I'll admit, this is not an Oscar winning film, but it's a good martial arts film in general. The gist of the movie is that BJ Quinn a kick boxing champion kills a man at party and is sent to jail. When he gets out Denard (his chief rival) becomes the champ. Since BJ is banned from championship fights for 5 years, he decides to train Chad Hunter, (the man he fights in the beginning of the film) in order to ready him for his tournament fight and his fight against Denard. this movie featured some good martial artist, John Barret (Tang Soo Do, black belt), and Keith Vitali (who my karate instructor trained with during college, and taught him a move that made him one of the best fighters in the country) both do very good roles in the film. This movie does have somethings that most martial arts movies have, one liners, and some cheesy acting. The fight scenes are good, and overall this is a decent movie to watch.",
         "John Barrett stars as B.J Quinn a prize-fighter who trains for a revenge match after getting out of jail for man slaughter. Lackluster movie suffers from a lack of actionscenes and uneven acting that drop kick this one into the turkey pile. John Barrett has to be the oldest prize fighter this side of George Foreman."
      ],
      "genres": [
         "Action",
         "Sport"
      ],
      "productionCompanies": [
         "Distant Horizons",
         "Global Pictures"
      ],
      "summaries": ["Kickboxing champion B.J. is jailed for an accidental murder thanks to the testimony of his arch-nemesis Denard. A year later, B.J. is released and then challenged by Denard for $100,000. Will B.J. accept and get even with Denard?"],
      "budget": 0
   },
   "movielensId": 102101,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-07-24",
      "dvdReleaseDate": "1991-07-24",
      "directors": ["Frans Nel"],
      "runtime": 92,
      "movieId": 102101,
      "title": "American Kickboxer",
      "mpaa": "R",
      "actors": [
         "John Barrett",
         "Keith Vitali",
         "Terry Norton",
         "Brad Morris",
         "Ted Le Plat",
         "Michael Huff"
      ],
      "imdbMovieId": "0101325",
      "originalTitle": "American Kickboxer",
      "genres": ["Action"],
      "youtubeTrailerIds": ["Ckfc16P4LE0"],
      "plotSummary": "Kickboxing champion B.J. is jailed for an accidental murder thanks to the testimony of his arch-nemesis Denard. A year later, B.J. is released and then challenged by Denard for $100,000. Will B.J. accept and get even with Denard?",
      "tmdbMovieId": 110830,
      "avgRating": 2.375,
      "releaseYear": "1991",
      "numRatings": 4,
      "posterPath": "/s22Wz0QoLhFMDdnsmWRwMXitLDZ.jpg"
   }
}