{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "usa",
            "id": 279
         },
         {
            "name": "hunger",
            "id": 1899
         },
         {
            "name": "middle class",
            "id": 6071
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "economics",
            "id": 14737
         },
         {
            "name": "financial crisis",
            "id": 165193
         },
         {
            "name": "social services",
            "id": 170154
         },
         {
            "name": "poor",
            "id": 195889
         }
      ],
      "imdb_id": "tt2239034",
      "video": false,
      "title": "American Winter",
      "recommendations": [],
      "backdrop_path": "/fGdCmN0GVj3hobrLxel27rKuIUZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "538220920e0a26588c0060d7",
               "name": "Harry Gantz",
               "profile_path": null,
               "id": 1157142,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4da3c3a36847f826bfef",
               "name": "Harry Gantz",
               "profile_path": null,
               "id": 1157142,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4da3c3a36847f826bff5",
               "name": "Joe Gantz",
               "profile_path": null,
               "id": 1157141,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5382206c0e0a2624bd00a849",
               "name": "Aaron I. Butler",
               "profile_path": null,
               "id": 1324187,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "538220b30e0a2624b700aa86",
               "name": "Joe Gantz",
               "profile_path": null,
               "id": 1157141,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "538220e70e0a2624c700a882",
               "name": "Sophie Harris",
               "profile_path": null,
               "id": 93482,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5382213a0e0a2624c700a891",
               "name": "Joel Goodman",
               "profile_path": null,
               "id": 938459,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.633637,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 179179,
      "vote_count": 1,
      "budget": 0,
      "overview": "Documentary feature film that follows the personal stories of families struggling in the aftermath of the worst economic crisis since the Great Depression. Filmed over the course of one winter in one American city, the film presents an intimate snapshot of the state of the nation's economy as it is playing out in millions of American families, and highlights the human consequences of the decline of the middle class and the fracturing of the American Dream",
      "similar": [
         44639,
         22074,
         13020,
         105556,
         120893,
         50839,
         45318,
         31869,
         246308,
         84190,
         159008,
         29595,
         333377,
         1779,
         221800,
         11420,
         28227,
         221418,
         22816,
         102752
      ],
      "original_title": "American Winter",
      "runtime": 90,
      "poster_path": "/smMz2TMwBX7QU8BbwSmjgYEtw58.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "HBO/Cinemax Documentary",
         "id": 11489,
         "origin_country": ""
      }],
      "release_date": "2013-03-18",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "In the richest country on earth, millions of families have been left out in the cold.",
      "adult": false,
      "homepage": "http://www.americanwinterfilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Harry Gantz",
         "Joe Gantz"
      ],
      "runtime": 90,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2239034/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzNzI5MTY3Ml5BMl5BanBnXkFtZTcwMzg2NDU4OQ@@._V1_SX214_AL_.jpg",
      "actors": [],
      "reviews": [
         "American Winter (2013) *** 1/2 (out of 4) Another very good documentary from HBO takes a look at eight families living in Portland, OR who are suffering from being unemployed. The documentary crew spends time with the families as we see them struggle to pay their bills and many are forced from their homes and into homeless shelters. We get interviews with the adults as well as their children but also social workers who talk about the desperate times that so many Americans are in right now. As someone who works with people being on their bills, I thought this film did a pretty good job at showing how easy it is for someone to go from living comfortable to being poor in the matter of months. I guess some people can't fully understand how quick it happens unless they've been through it but this film does a good job at showing just how desperate these times can be. All eight families have different stories to tell but they're all basically wrapped around not being able to pay your bills after losing a job. Some of these people have been out of work for over two years and it's easy to see why the savings just don't last very long. Directors Harry and Joe Gantz really do a nice job at giving the viewer an idea of why these situations can turn so bad but they also question why more isn't being done. There's a lot of political talk about how the poor are taxed more and how companies are making record profits yet lower class families aren't seeing any benefits. I must admit that I find it shocking that this country can send so much money to other countries yet so many here are living below poverty. American WINTER is certainly an eye-opener and one just hopes that they're never in this situation.",
         "America currently inhabits a sad, sad state, but it could be worse, right? That's what we tell ourselves, and it very well could be. But the fact of that matter is that, as of now, it's looking pretty damn bad. The 2008 economic crisis in America will likely be compared to the somber days of The Great Depression, and the unemployment numbers and political meltdowns of recent time will likely etch themselves in there no problem. The staggering amount of people on unemployment begs a documentarian analysis, and American Winter provides the best one I've seen yet. High on reality, low on statistics, and often emotional, this is 2013's best documentary thus far. It is the third I've seen detailing the poor's struggle in an increasingly complex world, next to Escape Fire: The Fight to Rescue American Healthcare and this year's limited/VOD release A Place at the Table. Needless to say that American Winter sores past the goodness of both films into gratifying greatness. We focus on eight families living in the Portland, Oregon area. The commonality between all these homes is that they are all in desperate need of financial help, and at least one immediate family member is out of work and actively looking for a substitute. While no story is sadder than the next, viewers may find the story of John's story particularly crushing. He is a father of a young boy with down syndrome, who has been out of work for three years and lives on a five-acre ranch he maintains to the best of his ability in order to provide for his kid. Some may find themselves getting teary-eyed when we see Jeannette's predicament. Her husband died an unexpected death not long ago, and her and her eleven-year-old son have been attempting to coddle the wounds, but to no avail. They must resort to living in a public shelter and getting by on a very limited food supply. There is a heart-wrenching scene when Jeannette and her son arrive to a pay-what-you-can Panera store that just closed about an hour ago. The trip to get there was long and unforgiving, and we watch as Jeannette sobs, worrying for her son, who is lying when he says he doesn't need a hot meal in an attempt to make her feel a bit better and not so overwhelmed. Then there TJ and Tara, a couple with two children who are attempting to keep their head above water when only she works. He was laid off from a well-paying job, and when he finds a new one, faces racial discrimination in attempt to better himself and get by according to plan. When the two sit down on the couch, trying to concoct ways for them to get money, Tara suggests that one of them panhandle. TJ states, \"I'm not holding a frickin' sign - yet.\" American Winter deals poverty to a privileged person better than any documentary I have yet to see. It illustrates so finely and so honestly how life can go from comfort to calamity in no time, and its surrounding moral is its subjects never thought they'd be in a position where they'd need to collect unemployment. If there's another thing I learned, it's that even throwing all your money into a solid education is no longer a guarantee for success. We see a woman who studied medicine in college and can only go on to make minimum as a medical assistant. She must resort to things like donating plasma and \"scrapping\" junky appliances just to keep her head above water. As I look at my average GPA, my current resume, and anticipate upcoming ACT results along with fulfilling a goal of obtaining a college degree, I question where I'll even be if I get all of that. It's a frightening reality when success can't even be determined by educational drive; it's beginning to become a world driven on luck and good fortune. If there's another thing I learned it's that the American Dream is dying a slow and painful death. That was the first note I jotted down within five minutes of seeing this film; I didn't need to see anymore of the picture to know that and foresaw the reality. One couple ominously states that when they consider their own personal dreams, they say, \"forget the dreams, how do we make it to tomorrow? That's the dream.\" There's one other scene I'd love to mention, concerning a family whose electricity and water has been turned off for days, leaving everyone without option, nourishment, and in total misery. When the couple finally get financial aid and a payment program from the electric company, they come home and turn the lights on, which quickly leads to shocking and heartfelt emotion. It's amazing how flicking a switch could cause so much happiness and incandescent joy to a family, but the scene proves that you don't know what you have until it's gone. American Winter is an honest documentary, all too short, but extremely lasting in impact. It has not left my head for five minutes, even hours upon viewing it. It informs that, while there are no doubt people on unemployment who are able-bodied enough to work and exploiting a deeply flawed system, there are a very large number that need the system and need it badly and that's something we simply can't forget. I read an article via Reddit that stated if you have ten dollars in your pocket and no debt at all, you are better off than 75% of Americans. How long before that amount of money lessens and that percentage increases? NOTE: American Winter premiered on HBO in March and will air throughout the remainder of the month and into April on the network in addition. This is your second must-see film event of the year behind Harmony Korine's Spring Breakers. Clear your schedules. Directed by: Joe and Harry Gantz.",
         "I give it 2 stars bc it held my interest but what a load of rubbish. All these people get their power turned off bc the evil power company sends them $1200 bills and nobody had the money to pay it. BUT NEVER did the question come up, \"How many months have gone by since you missed the first Bill?\"I bet bills weren't paid for 4 months. They almost all mentioned having credit cards bills.....the problem is NOT capitalism the problem is poor money management . And going to college to be a nurse assistant is another bad choice. A good choice:become an RN don't have credit cards and you will be very comfortable and financially secure. and to see what those poor children were going through made me sick. Yes bad things sometimes come out of nowhere and we need a safety net but first we must rely on ourselves and BE PREPARED! Term life insurance is about $200 a year for $100k in coverage. That widow could have insisted her husband have some as soon as she got pregnant. But saving money and investing it is so boring, it's way more exciting to have a new car. I'm telling you something was very fishy about these \"real lives\" like the chick who kept saying she would be mortified if anyone knew her situation....DUH! You're in a movie blabbing to the world. Leftism is always about lying and this was pure leftist propaganda.",
         "I notice the other negative review is from a clearly far right poster. I am not, I'm definitely a Dem, support social programs and am fully aware of the pain the recession created. However, that said, this film was still wildly slanted, inaccurate and to be honest, most of these people were never really \"middle class\", even at the best of times. How do I know this? I live in PDX and I was unemployed for an extended period of time during the Great Recession, I went on a million interviews--and I grew up very poor. I had even more difficulty because I was older (mid to late 40's) and had worked in a heavily recession hit industry (hospitality). IN fact I frequent lost jobs to vastly less experienced, much younger and hotter women. And all the subsequent jobs I've both turned down and ultimately wound up at paid significantly less than my previous one (though I now get to work from home and it's less stressful, so there are always advantages)...however...many of the points ARE still faulty: 1) The bulk of these people were never \"middle class\": one family lives in a trailer park; another was a family of 4 previously living on 40K in an apartment (just barely working class, IMHO), one family appeared to be tweakers; the recently widowed mom obviously wasn't middle class, because her husband's insurance policy alone would've saved her from her rapid descent into homelessness; I don't even understand the insurance issue lady because Oregon has SCHIP for uninsured kids,\"terming\" her employment would've made her COBRA-eligible during that period AND violated both federal and Oregon's more generous FMLA laws. The \"college educated\" woman was a CNA and technical college (trade school) educated. Had she bothered to research her job choice, she would've known what a mistake it was. And she never made more, even before the recession. 2) There are plenty of minimum wage, crappy jobs in Oregon. Even at the height of the recession these were available. ACS (a call center) was always hiring and never met their recruitment goals. Awful job? Sure, but it paid $$$, so there were things you could do. 3) Almost every family had other, both short and long term options available to them to avoid the destitution they all seemed to face: a)the mom skipping meals: Ramen is 5 packet for $1, every day at Fred's. Lame meal choice? Sure, but lame beats going hungry. Her husband had the most clear cut case of a civil rights violation I've ever seen, time to file a BOLI complaint. And again, plenty of other minimum wage jobs to be had. b) the actual previously middle class dad with the Down Syndrome kid, had parents maybe 100 miles away. Time to leave your beloved farm (that's already in foreclosure) and go live with them. Really, it might embarrassing, but it beats being homeless. Not to mention, he owed $457K on that house---even while working, how would he have EVER afforded that on $60K? Even lowish mortgage payments would've been at $4K per month----already more than his net pay. c) Princess apartment mommy with her suburban/SAHM fantasy world: Honey, your husband never made all that much money and his unemployment (if he opted not to take taxes out until tax time) would've already been very close to his original take home pay. Had you even cashiered part time at Target, your income would've ran about the same. Not sure why she felt working was worse than taking charity or being evicted. Not to mention, plenty of people (myself and my husband included) experience such setbacks in their 20's. I'm really not sure WHY he took a job that paid substantially less than he brought home on UI to begin with, especially since UI ran for 2 years back then (with extensions). Not to mention, 10 interviews is NOTHING! d) CNA Mommy had chosen her career----and I would've worked a second job in her situation. e) Hospital Mom: talk to the hospital social worker. It's their job to help you with this and work this out. In Oregon we have SCHIP, other catastrophic coverage, etc. Not to mention there are grants, etc to cover just that. Or simply declare bankruptcy. Plenty of options there----and the hospital would've worked with her to find them. f) Former VW finance dude: you're fully qualified to sell cars or even be a finance manager (the best paying job in the dealership). Again, yes they were hiring during this time frame. And again, if it worked out better for you to collect UI (I do get that), why wasn't your wife working? Back when most wives stayed home, they did go work to supplement the family income during periods of the breadwinner's unemployment. Because instead of living a soccer mommy fantasy, they looked to keep their family afloat. Nowadays, most moms DO work, yet this piece picked primarily non-working moms and portrayed them as victims. Very non-feminist. G) Widow mom and son were eligible for survivors' benefits, emergency housing, etc--not to mention, most jobs carry some sort of minimal life insurance for free. I get that she was completely devastated, but again, the well being of my child would be my first priority. BTW, the bulk of this wasn't even shot in PDX, but clearly Clackamas County---which is, ironically, largely Republican. And I bet you most of these people previously voted Republican.",
         "Several heart-wrenching stories... Truly, many people find themselves lost and despairing in these tough economic times. Problems with this \"documentary\" though were due to the frequent excerpts where \"experts\" briefly explained that the problem is capitalism and the wealthy getting richer. They explained how America is a corrupt system where big companies leave to exploit cheap labor in other countries simply for profit. Likewise, it's explained to us that the American Dream is now nothing but a lie and, if you're not already rich, you're screwed. OK. Some of that rings true. The rich are getting richer and the poor are getting poorer. U.S. companies do off-shore their operations. Nevertheless, there are many contributing factors other than greed. A propagandist from the other side could easily bring in \"experts\" who substitute \"government\" and \"regulation\" for \"capitalism\" and \"greed\". A religious individual could emphasize \"moral decay\". The real truth though deserves more honest exploration, and liberal puff pieces like this only polarize and mislead people. Furthermore, one person's wealth has little to do with another person's wealth potential. There's money laying around everywhere. There's also something to be said for thrift, determination, perseverance, not to mention, etiquette on the job and when applying for one. Perhaps the investment in this film would have been more fruitful if the producers had brought in experts that know how to see money, and have them show these folks how to recognize it. Maybe the experts could simply have explained hot to get a job, keep it, and use it to get a better job while providing guidance on how to use the already existing lifelines to stay afloat. Instead, the audience had to suffice with what was served up as tripe for the ignorant and naive.",
         "This show totally distorts the truth, but I've come to expect that of HBO and \"documentaries\" in which they are involved. I knew what this was going to turn into, but I had to wait until just past the 20 minute mark to see a person say that the solution was to regulate capitalism. From there the untruths and out and out lies flowed freely. The truth of the matter is that Jimmy Carter started this economic meltdown with the Affordable Housing Act which turned into the Community Reinvestment Act (CRA) and became the real reason we had the economic crash of 2008. Of course it was aided along the way by Clinton during his reform of the CRA to get rid of down payments, and added incentives in some cases and arm-twisting in others to get banks to lower requirements or make loans without down payments and with many safe-guards to qualifying borrowers removed. Then, during the Bush administration, questions started being asked and answers were not forth coming. Bush requested hearings on the potential of a housing/economic crisis which was totally blocked by the likes of Congressman Barney Franks in the House of Representatives and Senator Chris Dodd who were chairs of the respective committees in the House and Senate which oversaw the housing market. Their alleged wrong doing was never really investigated, but included alleged sweetheart deals on prices and interest rates and several business opportunities which allegedly bordered on possible bribes. If HBO wanted to do something that matter and be honest about it, then they should do a \"documentary\" on the Affordable House Act/Community Reinvestment Act, the changes incorporated by Clinton and how Franks/Dodd blocked our only chance to stop the crisis before we got to where we are now. In short, American Winter (2013) is nothing less than Marxist propaganda laying blame on Capitalism and the rich. Nothing about the massive wrong-doing by leftist extremist giving away America's future. Then along comes Obama who is constantly preaching class warfare and laying the blame on the \"rich.\" The producers and directors of this show have absolutely no concept as to what makes a society and economy successful. ...and it definitely isn't taxing the very corporations and individuals who can pull us out of this downward spiral into oblivion that is going to save us. These leftist, Marxist extremist are going to run out of other people's money in the near future. When that happens welcome to yet another failed experiment in Socialism - exactly like it has failed in every instance socialism has been tried."
      ],
      "genres": [
         "Documentary",
         "Drama",
         "News"
      ],
      "productionCompanies": [],
      "summaries": ["Documentary feature film that follows the personal stories of families struggling in the aftermath of the worst economic crisis since the Great Depression. Filmed over the course of one winter in one American city, the film presents an intimate snapshot of the state of the nation's economy as it is playing out in millions of American families, and highlights the human consequences of the decline of the middle class and the fracturing of the American Dream."],
      "budget": 0
   },
   "movielensId": 102107,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-03-18",
      "dvdReleaseDate": null,
      "directors": [
         "Harry Gantz",
         "Joe Gantz"
      ],
      "runtime": 90,
      "movieId": 102107,
      "title": "American Winter",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "2239034",
      "originalTitle": "American Winter",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "UG9q1L__Knc‎",
         "NbxQpCq21l0"
      ],
      "plotSummary": "Documentary feature film that follows the personal stories of families struggling in the aftermath of the worst economic crisis since the Great Depression. Filmed over the course of one winter in one American city, the film presents an intimate snapshot of the state of the nation's economy as it is playing out in millions of American families, and highlights the human consequences of the decline of the middle class and the fracturing of the American Dream",
      "tmdbMovieId": 179179,
      "avgRating": 4,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/smMz2TMwBX7QU8BbwSmjgYEtw58.jpg"
   }
}