{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "winnie the pooh",
            "id": 193143
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0063819",
      "video": false,
      "title": "Winnie the Pooh and the Blustery Day",
      "recommendations": [
         36540,
         72185,
         163090,
         44325,
         132380,
         189807,
         261339,
         102161,
         39894,
         107258,
         66819,
         24926,
         13246,
         106927,
         67049,
         40046,
         418956,
         144456,
         106808,
         40163
      ],
      "backdrop_path": "/a2jZ3OrlHv2vqoi8EZILlmMBQ7g.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Winnie the Pooh",
               "gender": 2,
               "credit_id": "553996479251414081002bec",
               "name": "Sterling Holloway",
               "profile_path": "/njZObhSQmwSX2U7IrB6Gytuedm8.jpg",
               "id": 34759,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Piglet",
               "gender": 2,
               "credit_id": "5539965cc3a3685cf80023e1",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tigger",
               "gender": 2,
               "credit_id": "5539966d925141687400019c",
               "name": "Paul Winchell",
               "profile_path": "/hAhbU0lCkYA0yCHZb6sVKWluY3Y.jpg",
               "id": 77548,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Owl",
               "gender": 2,
               "credit_id": "553996d0c3a3681be4005a3f",
               "name": "Hal Smith",
               "profile_path": "/67zxG00wgqe1uqR05veeZZnzK7A.jpg",
               "id": 25627,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Chistopher Robin",
               "gender": 0,
               "credit_id": "5539971ec3a3683e5500022a",
               "name": "Jon Walmsley",
               "profile_path": null,
               "id": 1225463,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Eeyore",
               "gender": 2,
               "credit_id": "5539973392514168740001b1",
               "name": "Ralph Wright",
               "profile_path": "/cEXiizAz9vUew2T4Xu0tOz7tbzI.jpg",
               "id": 148822,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "5539977f925141275e002250",
               "name": "Sebastian Cabot",
               "profile_path": "/x4xosGUCYnuUQntxgbcZryWaKH6.jpg",
               "id": 21877,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48079251416c9107dc53",
               "name": "Wolfgang Reitherman",
               "profile_path": "/p9ywBLS3Pvv3BcocjLsPwnll6mc.jpg",
               "id": 57314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5539979792514168740001ba",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "553997d3c3a3685cf800240c",
               "name": "Winston Hibler",
               "profile_path": null,
               "id": 63670,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "553997ecc3a3683e14000226",
               "name": "Larry Clemmons",
               "profile_path": "/A8SsomYXhY8yMju5N0pPj5xzcYK.jpg",
               "id": 57332,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5539980392514168740001d0",
               "name": "Ralph Wright",
               "profile_path": "/cEXiizAz9vUew2T4Xu0tOz7tbzI.jpg",
               "id": 148822,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5539981ec3a368784500764f",
               "name": "Julius Svendsen",
               "profile_path": null,
               "id": 63648,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5539982ec3a3683e14000231",
               "name": "Vance Gerry",
               "profile_path": "/2TqTR3XG2TZISW8HWpjLc2mTRvr.jpg",
               "id": 57335,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5539984992514112560068a6",
               "name": "Ollie Johnston",
               "profile_path": "/76RFwErmaMm7tx8OHFU0eYCvMMr.jpg",
               "id": 143786,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 2,
               "credit_id": "55399861c3a3683e55000249",
               "name": "Frank Thomas",
               "profile_path": "/gfxSwlnGBikBjneXC3lWnENAQgo.jpg",
               "id": 63646,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 0,
               "credit_id": "5539987792514168740001e5",
               "name": "Fred Hellmich",
               "profile_path": null,
               "id": 148809,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "5539988ac3a36831dd008c67",
               "name": "Milt Kahl",
               "profile_path": "/olKWgwkVShdJnRJRZ4Po6uK0iq6.jpg",
               "id": 138170,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5539989d92514168740001f0",
               "name": "Hal King",
               "profile_path": null,
               "id": 143787,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "553998b0c3a36831dd008c6c",
               "name": "John Lounsbery",
               "profile_path": "/5iwFX8llmSfEudddEXO8BGczdTs.jpg",
               "id": 69003,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "553998c2925141651800a28a",
               "name": "Dan MacManus",
               "profile_path": "/3jsIEZIftKV6wpZYIvuTJ5yN0lj.jpg",
               "id": 148244,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "553998d792514138a90034f7",
               "name": "David Michener",
               "profile_path": "/1Sgz4iH3f7KTPAgZw8fubJX8wJA.jpg",
               "id": 61678,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "553998f792514112560068c3",
               "name": "Art Stevens",
               "profile_path": "/5SqkXwKbSFSUW9Ho8dxxAYIp2s4.jpg",
               "id": 67607,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "590a13d09251414f99003230",
               "name": "A. A. Milne",
               "profile_path": null,
               "id": 77545,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 3.271474,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 81310,
      "vote_count": 28,
      "budget": 0,
      "overview": "Winnie the Pooh and his friends experience high winds, heavy rains, and a flood in Hundred Acre Wood.",
      "similar": [
         21385,
         10340,
         10144,
         10193,
         10895,
         10527,
         9479,
         12230,
         812,
         10882,
         10530,
         10555,
         41513,
         37135,
         9016,
         10198,
         12092,
         3933,
         11886,
         14160
      ],
      "original_title": "Winnie the Pooh and the Blustery Day",
      "runtime": 25,
      "poster_path": "/w71AMrpGQbRka6EJmj0jQ4dgMpg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1968-12-20",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wolfgang Reitherman"],
      "runtime": 25,
      "synopsis": null,
      "writers": [
         "Larry Clemmons",
         "Ralph Wright"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063819/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4Nzg4Njk4MV5BMl5BanBnXkFtZTYwNDIxMDY5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sebastian Cabot, Sterling Holloway, John Fiedler | See full cast and crew »"],
      "reviews": [
         "Winnie the Pooh has always been a favorite of mine. The original stories are in the realm of the Mary Poppins stories, i.e., difficult to translate to film. In this instance, Disney has managed to transfer the charm of the Pooh stories intact to the screen. Winnie is simply adorable as an animated character, and Sterling Holloway gives him the perfect voice. All the other characters are voiced with perfection, too, especially Tigger, who makes his debut in this short film. Tigger almost steals the show from Pooh; when he's onscreen, you don't notice anything else. Sebastian Cabot adds just the right touch as the narrator. The entire film has the feel of the pink elephant sequence in Dumbo; inspired, creative and unforgettable. During the storm, pages from the book blow away as the wind rises, rain washes text down the page and away into a stream, etc. Everyone should love this adaptation; Disney soon cranked Pooh out as a series, and it got tedious and sloppy. But this early effort is a real masterpiece.",
         "Winnie the Pooh and the Blustery Day was the second part of the 1977 release of The Many Adventures of Winnie the Pooh. 'Many Adventures' was probably more crucial to me than I'll ever remember since it was the first film I ever saw, over and over, before I could even speak. Looking back on it, as well as on the film, I realized this entry had the biggest effect on me- it had lots of humor (and some of it still funny, if only in the 'cute' sense), everlasting themes, splendid songs, and Tigger too. But more than anything else I think what was most fascinating about this entry (and possibly what the Academy saw in it to give the film an Oscar) was the dream sequence. I can't really be sure of it, yet on a recent viewing I realized much of what goes into that dream of Helfflumps and Woozles is akin to surrealism (another example could be of the Pink Elephant sequence in Dumbo). For young children it is perhaps the most frightening and intense sequence of the film as a whole (a couple of images from it stayed with me through the years), and that gives it the edge to appeal to older audiences. While I would usually recommend The Many Adventures, if one just wants to see part of the film, this is the one to see. A+ (as much for quality as for nostalgia)",
         "Disney's track record when it comes to adapting other source material to the screen is mixed, to say the least. But with their adaptaions of Pooh,they succeed marvelously. This short won the Academy Award for Animated Short and it's easy to see why: everything clicks. The voice casting is great, the design is superb, animation is top-notch and the source material is accorded with the respect and affection it merits. By all means, find this and watch it if you can. As of this writing, it is in-print. Most joyously recommended.",
         "[CONTAINS SPOILERS] One blustery day, Winnie the Pooh travels to his thoughtful spot to think when suddenly Gopher surfaces and says he's \"skedaddlin'\" away because it was Windsday! So Pooh decided to wish all his friends a happy Windsday. He started with Piglet who was having a difficult time sweeping all the leaves that were blowing into his yard. Suddenly he was lifted in an up-draft. Pooh grabbed ahold of his scarf which unraveled. Piglet grabbed on the end of the string so it looked as if Pooh were flying Piglet like a kite. Along the way, they wish a happy Windsday to Eeyore, Kanga and Roo, even Rabbit. They next pay a visit to Owl. The wind picks up viciously and results in blowing down the tree that Owl's house stood atop. Christopher Robin, Eeyore and others rush over. Eeyore takes it upon himself to find another house for Owl. That evening, the wind was still blowing. Pooh Bear heard weird noises coming from outside. He opened the door and in burst a crazy tiger known as Tigger (T-I-Double G-Rr) who is first afraid of his reflection in the mirror, then tries honey which he claims is his favorite but then dislikes it and tells Pooh about Heffalumps and Woozels who steal honey then he bounces away. Pooh falls asleep and has a nightmare about Heffalumps and Woozels trying to steal his honey. Suddenly a heavy rain falls that nearly turns the Hundred Acre Woods into a lake. Pooh inadvertantly rescues Piglet from a waterfall and is proclaimed a hero and is given a hero party. Eeyore arrives then and shows everyone the new house he found for Owl. Unfortunately, it was Piglet's house. Though distraught, Piglet gave Owl his house and he went to live with Pooh. Piglet was a hero so the hero party was turned into a two-hero party. Another good Winnie the Pooh short! It follows Winnie the Pooh and the Honey Tree of 1966. Sterling Holloway is back as Pooh, Junius Matthews is back as Rabbit, Howard Morris is Gopher, Hal Smith is Owl, Barbara Luddy is Kanga, Clint Howard is Roo, Sebastian Cabot is our narrator and John Fielder makes his debut as Piglet! And Paul Winchell debuts as Tigger. Winchell continued to voice Tigger in future Pooh incarnations until 1998. He recently celebrated his 80th birthday in December 2002. Happy birthday, Paul! Anyway, all you Pooh fans out there, I recommend Winnie the Pooh and the Blustery Day. Great music and nice story! It won an Academy Award. Sadly Walt Disney died before this short was made. I'm sure he would've liked it.",
         "I always like Winnie The Pooh movies,but I really like the older Winnie The Pooh movies.I like the background art and the songs are great!I like the way the story goes because one thing leads to another. I would recommend this movie to children ages 5+ and I would recommend it for a family movie.This movie has the original voices of Winnie The Pooh and Tigger.It is a great film and it made me sing along and laugh.If you like Winnie The Pooh I would recommend this one! because it's full of fun adventures for the whole family to enjoy. It may be an older movie but it is a great one! Actually I prefer the older Winnie The Pooh movies,but I like all the Winnie The Pooh movies!",
         "\"Winnie the Pooh and the Blustery Day\", the second of the Winnie the Pooh's shorts, introduces us the characters that were missing in the first one: Piglet (who becomes Pooh's best friend) and the very humorous and super-amusing Tigger. It has all of the qualities already seen in the first one, including cheerful songs such as \"The Wonderful Thing About Tiggers\", \"Hip Hip Pooh-ray!\" and \"The Rain Rain Rain Came Down Down Down\". This one has a funny plot as well. In the first part of the story, Winnie the Pooh wishes a «Happy winds-day» to his friends (because it's a very windy day), starting with Piglet. The second part of the story takes place later, while Pooh's in bed and hears strange noises and decides to open the door anyway (after all, he's not the smartest bear in the world). This visit is... Tigger! Tigger is so funny! I love his remarkable personality, his sense of humor, his singing and his bounces! It's impossible not to like Tigger! During the third part of our story, there's a rain storm and a Hero Party that becomes a Two Hero Party, celebrated by Cristopher Robin and his pals. The Owl is a character that loves to talk. Once he starts, he doesn't stop and he dislikes to be interrupted, although he is always polite. The Gopher appears in this one too, but he's not in the book, you know. My favorite Piglet's line is «Oh, dear! Oh, d-d-d-dear-dear!». My least favorite part is Pooh's dream about \"hefalumps and woozels\" trying to steal his honey. Nevertheless, it's bizarre, original and creative. I can't help but think of the \"Pink Elephants\" sequence from \"Dumbo\", because they're both so odd. Initially I had doubts about the sex of Rabbit and Piglet because their voices sound somewhat feminine. Well, T-T-F-N! Ta-ta for now! :D",
         "This is the second of the four Winnie the Pooh featurettes. Not only this is enjoyable, but it's also memorable and successful. This probably had the most songs in one short film, and all of them are really memorable. What also made me happy about this film is that although I didn't know this little fact until about a few years ago, It won the 1968 Academy Award for Best Cartoon Short! I am very happy for Winnie the Pooh to win this award. The score is also memorable, too. What didn't satisfy me was that it didn't include the Winnie the Pooh theme song. Does anyone know why? Anyway, in conclusion, Walt Disney died during the production of this short and the Academy Award was given posthumous. So see it for him if you haven't already, because I'm very sure he would've liked it.",
         "(CONTAINS SPOILERS!!) This early Disney movie is a real masterpiece. I love it so much, and I'm sure Walt Disney would have also liked it. This movie is one of the best Disney movies ever. In this movie, we are introduced to Piglet, and while he flies up in the air, Pooh holds on, like a kite. Since Piglet is in this one a lot, and I like Piglet, I particularly liked this one. The wind blows them through Rabbit's garden, pulling the carrots out of the ground, until they get to Rabbit's house. Owl's house blows down, and Eeyore helps to find a new one. Next, Pooh meets Tigger, who tells him about threats of thieves who steal honey. Pooh has a dream about Heffalumps and Woozles. When he wakes up, his house is flooded. Piglet's house is flooded, and he writes a message in a bottle. Next, Pooh rescues him accidentally, and has a hero party. Piglet gives up his house for Owl, and Piglet lives with Pooh. They were both heroes. I especially was happy with certain cast members. In this one, Sterling Holloway is perfect as Pooh, John Fiedler is fabulous as Piglet, and all the other voices are great. Junius Matthews adds a nice touch as Rabbit, and Sebastian Cabot is a good narrator. This movie is highly recommended.",
         "By that, I mean that I absolutely love all the Pooh vignettes, with or without Tigger. But Tigger, marvellously voiced by Paul Winchell, absolutely hilarious he was, was so memorable in this vignette that I can't help mention him. The vignette has a great story, the animation is wonderful, and the songs are highly memorable. I loved the songs, every one of them memorable in every way. Especially the Heffalumps and Woozles song, that did scare me as a child, but now it is very entertaining. The voice acting is terrific from all involved, Sebastian Cabot as the narrator shines particularly. Overall, a hugely entertaining gem, flawless from the start, but Tigger's presence elevates it to a greater level. 10/10 Bethany Cox",
         "Oscar-winning Winnie the Pooh cartoon is a wonderful piece of entertainment. The story starts out on a very windy day, where Piglet is blown around like a kite and poor owl has his tree knocked over. From there we meet Tigger, who sings the classic song \"The Wonderful Thing About Tiggers.\" Tigger warns Pooh that Heffalumps and Woozles love to steal honey. This leads to Pooh having a nightmare about them (and another wonderful song). Then it begins to rain, eventually flooding poor Piglet's home and it's up to his friends to save him. They really crammed a lot into this one but it flows together nicely. Great animation, wonderful voicework, and some terrific songs make this a classic. Later made up part of the Many Adventures of Winnie the Pooh movie."
      ],
      "genres": [
         "Animation",
         "Short",
         "Family"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Pooh is back and this time he's gonna blow you away! Almost literally! When Pooh's friend Gopher warns him that it's Winds-Day, Pooh goes off to wish Piglet a Happy Windsday, but Piglet is lifted into the air by the strong winds, Pooh grabs Piglet's sweater string and looks to be flying Piglet like a kite. They arrive at Owl's house, the wind blows it down and Owl inquires as to if Pooh did it. Eeyore agrees to find a new house for Owl, but one night, Pooh get's a visit from an unusual new friend- Tigger, a rambunctious tiger who likes honey but hates it just the same, and warns Pooh of Hefalumps and Woozels that steal honey! But Hefalumps and Woozels are only half of Pooh's worries now, for a huge rain storm has set on the Hundred Acre Wood. Everybody is swimming in their homes. Pooh inadvertently saves Piglet from a waterfall so they have a hero party. Eeyore then barges in and announces he has found a new home for Owl, unfortunately the house he found was Piglet's. But Piglet does a heroic thing and turns over his domicile to Owl, so they have a Two Hero Party and the storm dies down. At least until next Winds-Day.",
         "Winnie the Pooh and his friends experience high winds, heavy rains, and a flood in Hundred Acre Wood."
      ],
      "budget": 0
   },
   "movielensId": 1023,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-12-20",
      "dvdReleaseDate": null,
      "directors": ["Wolfgang Reitherman"],
      "runtime": 25,
      "movieId": 1023,
      "title": "Winnie the Pooh and the Blustery Day",
      "mpaa": "",
      "actors": [
         "Sterling Holloway",
         "John Fiedler",
         "Paul Winchell",
         "Hal Smith",
         "Jon Walmsley",
         "Ralph Wright",
         "Sebastian Cabot"
      ],
      "imdbMovieId": "0063819",
      "originalTitle": "Winnie the Pooh and the Blustery Day",
      "genres": [
         "Animation",
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Winnie the Pooh and his friends experience high winds, heavy rains, and a flood in Hundred Acre Wood.",
      "tmdbMovieId": 81310,
      "avgRating": 3.74412,
      "releaseYear": "1968",
      "numRatings": 3531,
      "posterPath": "/w71AMrpGQbRka6EJmj0jQ4dgMpg.jpg"
   }
}