{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0187995",
      "video": false,
      "title": "The Intruder",
      "recommendations": [32625],
      "backdrop_path": "/a3hGnyZkGsiZKc5HVjqFY5NpQSc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Catherine Girard",
               "gender": 1,
               "credit_id": "52fe496e9251416c910acf91",
               "name": "Charlotte Gainsbourg",
               "profile_path": "/hWUtcljrFsaSf9ZFTgjIoo4FxfQ.jpg",
               "id": 4273,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe496e9251416c910acf95",
               "name": "John Hannah",
               "profile_path": "/jnHc3tC8mzLbVVJD6xWGUsEzC2r.jpg",
               "id": 10727,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Badge Mueller",
               "gender": 1,
               "credit_id": "52fe496e9251416c910acf99",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nick Girard",
               "gender": 0,
               "credit_id": "52fe496e9251416c910acf9d",
               "name": "Charles Powell",
               "profile_path": null,
               "id": 236043,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Daisy",
               "gender": 1,
               "credit_id": "52fe496e9251416c910acfa7",
               "name": "Molly Parker",
               "profile_path": "/iCG1XrXkg09R9eK52PYUEA3HVX5.jpg",
               "id": 27125,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe496e9251416c910acfa3",
            "name": "David Bailey",
            "profile_path": null,
            "id": 1079954,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.062202,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 86023,
      "vote_count": 4,
      "budget": 0,
      "overview": "Catherine meets Nick by accident and, after a whirlwind romance, the two get married and Catherine moves into Nick's apartment only that's the start of problems when an unseen intruder begins playing strange mind games with Catherine in an apparent attempt to drive her insane.",
      "similar": [],
      "original_title": "The Intruder",
      "runtime": 90,
      "poster_path": "/m79Jmv6XZlxAYXRm7taIsnbpNR2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-11-19",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Bailey"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Jamie Brown",
         "Brooke Leimas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0187995/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0OTMzMTMzMl5BMl5BanBnXkFtZTcwODc5NTYzMQ@@._V1_SY317_CR70,0,214,317_AL_.jpg",
      "actors": ["Stars: Charlotte Gainsbourg, Charles Edwin Powell, Nastassja Kinski | See full cast and crew »"],
      "reviews": [
         "Girl(Gainsbourg) marries boy whose first wife has passed away in mysterious circumstances.But did she really die?Her spirit ,her soul,seems to linger here in the luxury flat which the newly -weds share.And everybody's talking about the dear departed,besides the cleaning operative is sinister-looking.Doesn't it sound familiar? \"Gaslight\" (Dickinson,1940;Cukor,1944)is plundered as well,as Gainsbourg begins to feel she's losing her mind.But the screen play has also metaphysical pretensions and even involves quantum physics. David Bailey's direction is self-conscious,and the cinematography \"chic magazine\" style,with a lot of snow all over the place. Charlotte Gainsbourg surely deserved better than this two-bit thriller and Nastassia Kinski is wasted.The ending ,far-fetched to a fault ,includes the de rigueur \"and if...\", maybe in anticipation of \"The intruder 2\" A busker,playing the saxophone comes back from time to time;the connection with the plot escapes me,I fear..",
         "This film is yet another example of the less than adequate sound quality in many imports. This film has dialogue that counts, it deserves theatrical level sound - not the shoddy system that is all too common in Two Left Feet Corp. imports. There is a nice streak of relativistic sci-fi, and as in Event Horizon et al - it's amazing how all arguments about relativistic time can be solved by folding a piece of paper! If Only! The acting is reasonable - except for the worst impression of a lawyer I have ever seen! I think that this guy had the script in his lap! Oh Well - if nothing else on the shelf grabs you - this is worth the rent - but rental ONLY!",
         "'The Intruder' is the second film by London fashion photographer David Bailey (his first: the obscure 'Who Dealt' was made for TV in 1993). Rather ostentatiously, Bailey's still photographs add a calculated touch of class to the somewhat anonymous and cavernous modern interiors in which much of the action takes place. How ironic then, that this silent clutter of his more successful art on walls and furniture makes the weakness of his motion picture even more disappointing! Mostly told in a single long flashback, while a shocked Catherine is questioned by police, this is a low budget scare story which falls short of being really frightening. As Catherine, actress Charlotte Gainsburg proves simply too weak a presence to make a persuasive narrator of events. Her somewhat tremulous voice-over at the beginning lacks any sense of horror or conviction. Part of the blame can be found in the script, which leaves Catherine's character weak and undeveloped as a victim. As Nick's benighted wife, one feels she is merely a cipher for the terror that the director seeks to impel upon the audience, rather the source of any paranoia herself. What suspense there is in the film springs not so much from her dread of the supernatural, but from the much less interesting enigma of her husband's past romantic life, and how it affects the present. Catherine is left adrift, ultimately until the audience's only interest in her springs from deciding whether she will wind up alive or dead. 'The Intruder', despite the quantum mechanics mumbo-jumbo introduced to explain the goings-on, is at heart a ghost story, Nick's huge apartment the 'haunted house'. (At one point Catherine actually uses candles to light her way in a darkened room). Such narratives rely a great deal upon sustained tension wrought through carefully created atmosphere. In his attempt to manipulate mood, right from the opening scenes, Bailey introduces a solo saxophonist who repeatedly plays a lonely vigil, outside of the main plot and characters. His presence is never logically explained and with each repetition of this scene, it seems more and more superfluous. In addition this musician is patently unaffected by the snow, which falls almost continuously outside as events unfold inside. Whenever we are within sight of a window, inevitably there are thick flakes falling. No doubt the snow intends to suggest a sense of coldness and isolation surrounding the characters. Instead, it draws attention to the set-bound nature of much of the action, quickly becoming a symbol of creative laziness. There are odd moments of genuine menace and danger, indicative of the better film that might have been. Catherine vainly searching for Rosebud (her cat)in Nick's vast apartment for instance, or the death of Daisy as Catherine rushes up stairs in answer to her frantic phone call for help. Here Bailey utilises space and motion effectively, creating dread. Even the final confrontation (shot using an unusual optical 'smearing' technique) is reasonably tense. At too many other points however, matters fall down badly. Particularly ineffective is the role to given to a janitor heavy, whose 'menace', filmed with risible over-emphasis by Bailey, appears instead bathetic. 'Somethings in life are beyond our control' he intones, as if fiddling with the lock on Catherine's door makes him the key to all that transpires (he is not). Practically all of the action supposedly occurs inside the same apartment building, where most of the characters live. Yet by the end of the film, we still no real evocation of the building or location, and this poor sense of place is a continuing handicap (perhaps stemming from uncertain location work). Compared to, say, the mise-en-scene demonstrated so successfully by Polanski in 'Rosemary's Baby', a far more successful tale of terror, the difference is revealing.. In Polanski's work, the indentification between tension and living space is absolute. In 'The Intruder' this unifying sense of place is palpably missing. Other plot elements appear, tantalise the audience with their possibilities, and then languish. Nastassje Kinski (the only 'big' name in the cast) who plays Badge, a friend of Nick, gives Catherine a job. In a couple of scenes together, there is a hint of supressed lesbianism. The failure to develop Badge as a predatory female, while it might show admirable restraint by the script writers, leaves her character hanging in mid air. A similar feeling of underdevelopment attends the introduction of twins in the film. Catherine and Jim are introduced to two at the start of the film. Later, Catherine discovers that Nick's first wife Stella was half of a pair of identical twins as well, and visits the surviving sister. And with this intriguing echo, the idea is dropped. But then why introduce it at all? The coda of the film, which takes place at the conclusion of Catherine's flashback, is predictable. There's no point in spoiling what drama the film still possesses at this point, but needless to say that the resolution - or not - of Catherine's ordeal is hardly original. But that is the trouble with this film: it simply can't deliver enough original terror or suspense to prove memorable. In short, an exercise in supernatural terror which should have worked out more.",
         "There is sufficient tension generated in the film to make one want to watch it through its end, even if the explanation is pure science fiction. Nastassja Kinski has a nice role in which she can appear to be glamorous and rich. She plays it straight because there is no other way to play it. The bulk of the picture is told in flashback, right from the beginning with numerous red herrings that seem to have been in season. Now, let's see, how did that blood end up on Catherine's face? That is the key to the movie. Or as Sherlock Holmes would say: when you have eliminated everything else, what is left must be the truth?",
         "A man (Charles Powell) and woman (Charlotte Gainsbourg)meet after the latter is the victim of a purse snatching. They quickly fall in love and decide to marry. Before the marriage, however, the girl shoots a female intruder that has broken into their house. Strangely, the intruder looks just like her new fiancé's former girlfriend who was herself shot and fatally wounded by an intruder in the same house several years earlier. It quickly becomes unclear who the real \"intruder\" is. I have to confess that I would watch the lovely French actress Charlotte Gainsbourg trimming her nose hairs for two hours, and here she demonstrates her usual inability to keep all her clothes on for an entire movie (a trait inherited perhaps from her equally yummy Britsh mummy Jane Birkin, who did the first full-frontal nude scene in a mainstream movie with \"Blow Up\" in 1966). This is actually a pretty interesting and entertaining movie though. It's hard to say too much about it without giving away the major plot points, but suffice it to say that while this movie seems to start out as a typical lame erotic thriller, it takes some interesting metaphysical turns. It's a little too ambitious for its own good perhaps, but that's a lot better than most of these kind of movies which usually don't have an original thought in their head. The acting is also quite good, especially some of the supporting cast like British thesp. John Hannah, cult fave Molly Parker, and even Natassia Kinski in an extended cameo(thus you have the sexy daughters of the two most infamous rakes in Europe, Serg Gainsbourg and Klaus Kinski, together in one movie). I don't want to rave unreservedly about this perhaps, but it certainly is a worthwhile little thriller.",
         "David Bailey, a well known photographer, tried his hand at directing by turning Brooke Leimas' novel, which we read some time ago, into a mystery film. The screen play is by Jamie Brown, and it appears his adaptation is the basic flaw with the finished product. We are given a premise that has been used before with better results. The second wife who comes to live in an unhappy place where the ghost of a dead woman comes back to haunt the new wife and make her life impossible. After all, even from a grave, don't play with a woman's sense of possession, she will come back to haunt whoever dares. Stella, who is only seen by Catherine, a French young woman who has married Nick, a composer of music for the movies. Everything seems to go bad when strange things are happening in the couple's apartment. It doesn't help that most of Catherine's new friends seem to be in some sort of conspiracy of silence and will not tell her anything about the past and what kind of marriage Stella and Nick had together. Charlotte Gainsbourg is an actress that deserves better. Her Catherine shows some good moments, but like everyone else, she is bogged down by a scenario that doesn't make much sense. Natassja Kinski, plays the enigmatic neighbor that seems to know what is behind the things Catherine seems to be experiencing, but doesn't tell her. The rest of the cast don't have much to do.",
         "I saw this film on video, on a cold snowy day. Perfect conditions for this type of dark, mysterious movie. Charlotte Gainsbourg is quite intriguing as the lead. Ditto Nastassja Kinski as the oddly vulpine neighbor and Molly Parker as the eccentric Miss LonelyHearts. I wish I could say nice things about everyone else. Alas, there are some weak actors in some supporting roles who appear to be reading their lines from a teleprompter. And...the plot, though fun and slightly sci-fi, becomes so murky that as a viewer, I simply had to give up on understanding it and busied myself with the suspense factors instead. For me, it finally boiled down to \"will she make it out alive or will she not?\"",
         "After reading one of the other reviews, I opted to give this film a try. Boy was I disappointed. My Dish network guide which only gives ratings up to four stars, gave this one a 2+ star rank. After watching it, I can only shake my head and wonder why. The premise of the movie, a woman coming into the police station and confesses to crime which occurred two years earlier. The hook, she couldn't have done the crime as she claims she just committed the crime the day she walks into the police station. I don't want to disclose the ending, or be a spoiler, so I won't go there. But suffice it to say there are so many red herrings, convoluted twists, and down right silly plot lines, that the films surpasses the point of absurdity. You find yourself not caring any longer about the characters, and only wishing the film would end. This film tries to breach a number of different genre's including mystery, thriller, horror and science fiction. Sadly, the mix rather than becoming an intriguing stew, becomes a weak broth leaving the viewer unfulfilled.",
         "I cannot comprehend how films this bad get made, what with all the time, money and effort that goes into film-making. Didn't anyone (the director, the producer, the editors) WATCH the film??? Couldn't they SEE how bad it was??? It contains some of the WORST acting I have ever seen. Reminded me of one of those \"adult\" films that Showtime broadcasts late at night. Just simply awful. I still can't believe that Nastassja Kinski agreed to be a part of this. Fortunately for us, David Bailey hasn't directed another feature-length film since! Avoid this piece of crap at ALL COSTS. Better yet, BUY every copy you can find, both the VHS and the DVD (I guarantee you this will be in the El Cheapo Clearance Dump Bins all over the world), and destroy them to spare the rest of humanity from this atrocity...",
         "It was a nice movie in the beginning. It was teasing enough to keep watching Although it was a bit too dark; it was as if it was always night and the lights were off all the time. But when the end was approaching there were too many errors in the story to enjoy it any more. The ending was really unsatisfied because of the errors in the story."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "GFT Kingsborough Films",
         "Steve Walsh Productions",
         "Studio Eight Productions"
      ],
      "summaries": ["Catherine meets Nick by accident and, after a whirlwind romance, the two get married and Catherine moves into Nick's apartment only that's the start of problems when an unseen intruder begins playing strange mind games with Catherine in an apparent attempt to drive her insane. Catherine first suspects Nick is behind it, then suspicion moves to his business partner Badge, then to Nick's friends, until Catherine suspects that Nick's first wife Stella, who commited suicide years before, may be behind the occurrences which she may be committing from either beyond the grave, or by a time vortex within the apartment itself which may have let to her suicide in the first place."],
      "budget": 4500000
   },
   "movielensId": 102403,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-11-19",
      "dvdReleaseDate": "2001-09-25",
      "directors": ["David Bailey"],
      "runtime": 90,
      "movieId": 102403,
      "title": "The Intruder",
      "mpaa": null,
      "actors": [
         "Charlotte Gainsbourg",
         "John Hannah",
         "Nastassja Kinski",
         "Charles Powell",
         "Molly Parker"
      ],
      "imdbMovieId": "0187995",
      "originalTitle": "The Intruder",
      "genres": [
         "Thriller",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Catherine meets Nick by accident and, after a whirlwind romance, the two get married and Catherine moves into Nick's apartment only that's the start of problems when an unseen intruder begins playing strange mind games with Catherine in an apparent attempt to drive her insane.",
      "tmdbMovieId": 86023,
      "avgRating": 2.7,
      "releaseYear": "1999",
      "numRatings": 5,
      "posterPath": "/m79Jmv6XZlxAYXRm7taIsnbpNR2.jpg"
   }
}