{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "terrorist",
            "id": 949
         },
         {
            "name": "conspiracy",
            "id": 10410
         },
         {
            "name": "terrorism",
            "id": 13015
         }
      ],
      "imdb_id": "tt1155588",
      "video": false,
      "title": "A Dangerous Place",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Claire Scully",
               "gender": 1,
               "credit_id": "52fe4c36c3a36847f82231b1",
               "name": "Kristen Dalton",
               "profile_path": "/hJE14DbGUWXVQHUxdIClpEcUfFo.jpg",
               "id": 18475,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Greenfield",
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231b5",
               "name": "Sal Rendino",
               "profile_path": null,
               "id": 154579,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ross",
               "gender": 2,
               "credit_id": "52fe4c36c3a36847f82231b9",
               "name": "Kevin Interdonato",
               "profile_path": "/cavKdabmGfvRVMXP85gC8WL6IHe.jpg",
               "id": 112532,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Gracie",
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231bd",
               "name": "Nicole Haddad",
               "profile_path": "/mCvf362MlVooLI0LhX4pZsrUJUU.jpg",
               "id": 1142832,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Flo",
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231c1",
               "name": "Carol Bayruns",
               "profile_path": null,
               "id": 1142833,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Holly",
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231c5",
               "name": "Monica Knight",
               "profile_path": null,
               "id": 995669,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Maria",
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231cd",
               "name": "Rebecca De Ornelas",
               "profile_path": null,
               "id": 1142834,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231a7",
               "name": "Gregory J. Corrado",
               "profile_path": null,
               "id": 1142830,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c36c3a36847f82231ad",
               "name": "Gregory J. Corrado",
               "profile_path": null,
               "id": 1142831,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 0.047656,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 160758,
      "vote_count": 1,
      "budget": 0,
      "overview": "An innocent woman, Claire Scully is drawn into a terrorist plot to kill people through the mail using a deadly strain of TB.",
      "similar": [
         7461,
         201088,
         5125,
         2320,
         137094,
         49026,
         8834,
         3580,
         820,
         109424,
         47964,
         954,
         2503,
         379149,
         97630,
         27576,
         14869,
         26389,
         817,
         4771
      ],
      "original_title": "A Dangerous Place",
      "runtime": 95,
      "poster_path": "/5xDIpTivHs9wu38nUE6mKmNNMci.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Corrado Schoner Productions",
         "id": 12861,
         "origin_country": ""
      }],
      "release_date": "2012-11-30",
      "vote_average": 1,
      "belongs_to_collection": null,
      "tagline": "The world is A Dangerous Place to live not because of the people who are evil, but because of the people who do nothing about it. - Einstein",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gregory J. Corrado"],
      "runtime": 120,
      "synopsis": null,
      "writers": ["Gregory J. Corrado"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1155588/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1OTUzNzcyOV5BMl5BanBnXkFtZTgwMTg3MjIwMDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kristen Dalton, Sal Rendino, Kevin Interdonato | See full cast and crew »"],
      "reviews": [
         "So a movie with a 2.8 rating has 22 reviews, all giving it 8, 9, or 10 out of 10 stars and filled from beginning to end with soapy blind praise for the film and over-the-top fawning for the film makers. Oh and surprisingly all of these rather generic and utterly useless reviews have 100% usefulness ratings. But the really odd part about all this is the fact that all 22 users have only a single review to each of their accounts and no message board posts. So they happen to have no interest or strong feelings about any movies except this one--amazing! Well, this is either the best indie film ever made or a film so bad, by filmmakers so incompetent and with so little professional integrity, that they actually resorted to such a tactless and blatant astroturf job. And it should be no surprise to anyone that it's not the former. This movie is really, _really_ bad (even worse than the trailer). Paying barely literate people to spam positive reviews for their film on IMDb and YouTube is pretty much the only way they can trick anyone into watching this rubbish. But they couldn't even do that right. What they really should have done was use all that money to hire some professional writers and film makers to make an actually decent film for them. P.S. See the message board discussion entitled \"Reviews\" for more anomalies.",
         "I made the effort to register, just to write this review. I have watched many films, some good, some bad,some unwatchable, but this one opens up a whole new category, i can only describe it as unbelievable, this has to be the worst film i have ever seen. As one of the reviewers has said, the only way this could have any positive reviews, is if the cast wrote them, and as there are so few, it would seem they couldn't be bothered either, as it was so bad. If there were any redeeming features, i failed to see them, in so much, that the final four minutes were just laughable. In summery, avoid this like the plague, or like me, you may have to join a review site, just to vent your spleen.",
         "It happens only rarely, very rarely I might add, that a movie turns out to be so utterly boring and uninteresting that I have to give up on it and turn it off. \"A Dangerous Place\", however, turned out to be one such movie. The story, as far as I made it into the movie, is about a woman who apparently lost her husband in the World Trade Center tragedy, but he has come back as a ghost. The woman is not the mother to her child that she should be, and is more devoted to her work than her family. And a deadly outbreak of Tubercolosis runs rampant. To me there was absolutely no coherent red thread in the storyline, and it seemed like it was a heap of mere random clips put together to attempt forming a movie. It just didn't really make much sense most of the time. As for the acting in the movie, well I wouldn't exactly say that the performances were poor or bad, but they just weren't overly impressive either. None of the performances managed to leave a lasting impression on me. But I can't hardly say that any of the performances that I witnessed were helping the movie along in any great way either. I think I made it about halfway into the movie, because I had to give up and find some other movie to watch out of sheer boredom and lack of interest in the storyline portrayed in \"A Dangerous Place\". And I can honestly say that I have no intention of attempting to finishing it either, it was just that devoid of appeal.",
         "The story is simple: 1) company makes TB vaccination, 2) TB outbreak occurs, 3) company has monopoly on TB meds. Throughout the whole movie, the filming was jerky. I think the longest continuous shot was about 5 seconds. I watched this with my brother (15) and even he thought it was a stupid plot and he had a headache from the quick movements. Says the boy who thought Chronicle was a GREAT movie and enjoys fast, jerky, war movies. DO NOT WATCH THIS MOVIE...or if you do, be sure to stock up on motion sickness pills.",
         "I thought I'd counter the suspicious number of single review users who give this a 9 or 10 and say its the bestest movie ever by giving a more neutral review. Whilst not totally appalling, the production standards are good for an independent and the acting, at the start at least, is tolerable enough, this film sinks, somewhat like the Titanic, rapidly and ferociously by the end. It has a bioterror plot combined with two sideplots, one high finance one (sorta), and the other about the emotional effects of death of a loved one during the 9/11 attacks. None of these are particularly convincing although the bioterror one starts off semi-intriguingly. However it all comes across both a bit weak and forced as well obvious, i knew that the perp was one of either two major candidates. There's also a minor storyline about the 'spirit' of the husband, killed in 9/11, who hangs around the house looking either morose or slightly disinterested. As I mentioned, this film largely fails in the end, where it rapidly descends into predictability and cloying sentiment. Any interest in the plot elements rapidly vanishes as they complete in a long-winded and banal final 'fight' scene and then the, aforesaid, excessively simplistic emotional tie up ending. If I was stuck in a motel, late one night and had nothing much to do, Id watch this at least 1/2 way through before probably nodding off, or maybe I'd watch to the end, whereupon I'd then wish I'd nodded off. Or done something else.",
         "The movie should have been a good one. It had several story lines that could have been compelling: the sale of the company, the TB outbreak, the mystery thrillers. But while these stories would have been good paired in several movies, their use in a single movie mad for a disjointed movie whose action was too frenetic. It could have been a decent ghost story about a woman who lost her husband in the 9/11 attacks and who is \"losing\" her son and wants to sell her business from grief and stress. It could have been a story about a company that is going underwater and created a phony crisis in order to capitalize on a drug to which only they had a patent. It could have been a great \"ticking clock\" story that had an a woman infected by a disease created by the research for an unlicensed drug and she's running through the movie to save her distant son and her suspicious mother-in-law. However, with so many story lines in a single movie, the pacing cannot help but be frenetic. Someone on the message boards pointed out that the scenes were short and disjointed, with each scene lasting about five seconds or less. The longest scenes take place when the main character is hiding in the office building cubicles and at the end, when she's under attack. As a result, the dialogue is rushed. Every character speaks at the same tempo and usually with an angry inflection. The dialogue was enough to give me a headache by the end of the movie. Finally, the character development was poor. We were never allowed to develop any empathy for the main character, her mother-in-law, or her son. Even though they had suffered great loss, all we ever saw from them was anger and abusiveness toward each other. We never developed any empathy for the company employees, who were combative over the settlements their work superiors were going to receive. We never developed a clue as to why the person who poisoned everyone did what he did--his was just a typical villain monologue before he was overcome. At the end, it didn't matter to me who got their comeuppance, who lived, who died, or got rich. It's too bad, because the movie had a lot of unrealized potential.",
         "OK, I get that the bar for production quality in an indie film is set lower than for a blockbuster, but please. To me, there were too many things that were too amateurish to take this film seriously-the camera work, the acting, the dialogue, the plot. The film has an ambitious reach, trying to tie together the events of 9/11, Wall St greed, and bio-terrorism, but on a budget like they obviously had, nothing seemed to work well. TV news reportage is overused to advance the plot, too many scenes take place in generic office environments, and a very unconvincing fight scene near the end all combine to make for a rather regrettable viewing experience.",
         "Eight months after September 11, a man in a suit carrying a briefcase shows up at a house, looking shaken up and dirty as if he just came from the Twin Towers on that terrible day. Claire is finally ready to return home to her executive job at Prozan Pharmaceutical in Newark, after spending time in Ohio after she lost her husband Will on September 11. Her son Ryan is still having a hard time; he won't talk, he still dresses up all the time and his play focuses on the firefighters and the towers. Greenfield, a co-worker, has been taking care of the house and bringing in mail; the kitchen looks like it belongs to Britney Spears. Prozan is planning to sell, but Claire is opposed, even though her stock in the company is worth $2.3 million. Co-workers think it is because she will get a huge settlement for her husband's death. Thousands in Africa are dying from a dangerous type of TB. A few in the United States have also died from an even worse strain. And Prozan makes the only drug that can treat it. Stock prices climb, though Prozan has a limited supply. The company can start production quickly, which is strange. Even stranger is the discovery of a hidden supply. And the stock price keeps rising, and more and more people die, mostly important business people and their employees. Journalists make everyone worried. It is believed the disease is spread by mail. Meanwhile, Claire must cope with her grief and plan a funeral. She says with no body there should be no funeral, which is one of several disagreements she has with Will's mother Flo. And there are strange things happening to Claire. Could she be a target? And what is taking place on the abandoned 13th floor of Prozan's building? And the mystery man we met early is now dressed for camping. This is a pretty good movie. Not great, but exciting enough. There are plenty of scary moments, and of course the urgent tone and frenzied editing of the various news outlets. Weird lighting, strange angles and shaky cameras add to the mood in the scary situations. And we are given many different possibilities about the cause of what's going on. But we always suspect there is one main reason. We just don't know the details. But it's not all a tense thriller. There are sweet family moments, and even a role for faith, as the family's priest helps with honoring Will. And there is room for occasional comedy, like that huge pile of what looks like a week's worth of celebrity fan mail, but is really eight months of regular mail. Kristen Dalton does an okay job. Claire has to be strong, but she falls apart occasionally. She's no superwoman, which is fine. She isn't necessarily a person of faith, but she is open to the idea of relying on a higher power. I could have done without all the blood, but I guess that's how you know people are sick. It's worth seeing.",
         "There isn't much to say that is positive about this movie. You've got a young boy traumatized by his father's death from the events of 9/11. You have the owner of a pharmaceutical manufacturer, the above boys mother who is not only trying to sell the company, she is also planning a funeral for her husband, the above boy's father. She is also dealing with a TB out break that just happens to be a drug the company she owns sells that could help the situation. There is also a bunch of \"other\" characters you are supposed to have an interest in, by the way they are thrown at you and you are supposed to care about them. Suddenly we have people all bleeding out at the office and police there yet everyone is able to run in on the dead or dying people. Such as the pregnant secretary who is warned to get tested before she takes the stash of the TB medication they magically just \"found\". Then Five minutes later you see the owner of the company running into a hospital door (an outside glass door labeled with gynecology department) and every one from the office around this pregnant secretary now having just had a still born. OK, now I understand tight budgets but a door with a label and then EVERYONE from the office is in there. OH and the Company owner just happens to know which room this Secretary is in and runs in there w/o anyone stopping her. This company owner also has a daughter, who is at least the 1/2 sister to the boy I first mentioned, why doesn't she take care of her brother instead of the what I presume is the mother in law. Oh did I mention that the Tuberculosis out break is a terrorist plot too. Then you have a \"ghost\" (I think not really sure) that kept switching key rings around for others on the key ring collection case. Also follows the boy around. Now, I am in the business of making productions and I know how to write a script, I also know how to do an establishing shot so things make sense even if your budget can't afford a real hospital. This movie was made in 2011/2012 there is enough computer tech out there to make an outside of a hospital or take a shot of a real building and put a CGI lettering to make it seem like a hospital. Then use a set to make your inside shots. Using a glass door with some lettering on it doesn't work. OH and for a bed you don't use a twin bed that looks like you took the head board out of your child's bedroom. This movie shouldn't have been allowed to be shown. It is just bad all around to watch. If it had been written properly it could have been good, but instead you have a movie that is a jumbled up as a shuffled deck of cards.",
         "I'm no critic... just an average movie viewer. However, after seeing this movie, I had to write this commentary to tell you my thoughts. I'll keep it simple. Acting was below average. Directing/editing is disappointing. I could see where they were going with the story and it had so much potential but it fell short in so many places. In some instances it was confusing and erratic. And the ending... well... that didn't really make a lot of sense but I could see the intention. Audio production is at times woeful and inconsistent throughout the entire movie. Levels and EQ (equalisation) were all over the place. There were a few good moments in the movie that made me think there was some hope for it to get better... but they quickly disappeared. Overall, poorly executed by both production and acting - could have been so much better... shame. I'm sure there are better reviews about this movie but I had to pass on my thoughts... You can find much better ways to spend 95 minutes - sitting through this movie is NOT one of them."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Corrado Schoner Productions",
         "Dangerous Place Films"
      ],
      "summaries": ["An innocent woman, Claire Scully is drawn into a terrorist plot to kill people through the mail using a deadly strain of TB."],
      "budget": 1000000
   },
   "movielensId": 102908,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-11-30",
      "dvdReleaseDate": "2013-01-08",
      "directors": ["Gregory J. Corrado"],
      "runtime": 95,
      "movieId": 102908,
      "title": "A Dangerous Place",
      "mpaa": "PG-13",
      "actors": [
         "Kristen Dalton",
         "Sal Rendino",
         "Kevin Interdonato",
         "Nicole Haddad",
         "Carol Bayruns",
         "Monica Knight",
         "Rebecca De Ornelas"
      ],
      "imdbMovieId": "1155588",
      "originalTitle": "A Dangerous Place",
      "genres": ["Crime"],
      "youtubeTrailerIds": ["XAibJfNaBz8"],
      "plotSummary": "An innocent woman, Claire Scully is drawn into a terrorist plot to kill people through the mail using a deadly strain of TB.",
      "tmdbMovieId": 160758,
      "avgRating": 1.875,
      "releaseYear": "2012",
      "numRatings": 4,
      "posterPath": "/5xDIpTivHs9wu38nUE6mKmNNMci.jpg"
   }
}