{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "farce",
            "id": 10280
         },
         {
            "name": "new york city",
            "id": 14512
         }
      ],
      "imdb_id": "tt0060112",
      "video": false,
      "title": "Any Wednesday",
      "recommendations": [70439],
      "backdrop_path": "/hxsf5D3ateVzCvWWbW9tncJw4MC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ellen Gordon",
               "gender": 1,
               "credit_id": "52fe4614c3a36847f80eb933",
               "name": "Jane Fonda",
               "profile_path": "/y1QtAxHn8XOi4cHzDRJUuvK3aFp.jpg",
               "id": 6352,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Cleves",
               "gender": 2,
               "credit_id": "52fe4614c3a36847f80eb937",
               "name": "Jason Robards",
               "profile_path": "/d5t554TsCjMvI9zwe7M5gNLvZeX.jpg",
               "id": 4765,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cass Henderson",
               "gender": 2,
               "credit_id": "52fe4614c3a36847f80eb93b",
               "name": "Dean Jones",
               "profile_path": "/n9eCdZR2pUylbx53VEoTZ6INuIr.jpg",
               "id": 40393,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dorothy Cleves",
               "gender": 1,
               "credit_id": "52fe4614c3a36847f80eb93f",
               "name": "Rosemary Murphy",
               "profile_path": "/mNrRc207chuOUgNizM0cmTfwDxP.jpg",
               "id": 8492,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Miss Linsley",
               "gender": 1,
               "credit_id": "52fe4614c3a36847f80eb943",
               "name": "Ann Prentiss",
               "profile_path": "/mr0Oqx4sOWnrFNfvyBdUZiDIKOK.jpg",
               "id": 86136,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Felix",
               "gender": 2,
               "credit_id": "567852f1c3a368475300041d",
               "name": "Jack Fletcher",
               "profile_path": null,
               "id": 1196402,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Milkman",
               "gender": 2,
               "credit_id": "567852fdc3a368475700038a",
               "name": "King Moody",
               "profile_path": null,
               "id": 111382,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Girl in Museum",
               "gender": 1,
               "credit_id": "5678530bc3a36847440003c8",
               "name": "Kelly Jean Peters",
               "profile_path": null,
               "id": 157227,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Head Nurse",
               "gender": 0,
               "credit_id": "567853199251411181000392",
               "name": "Monty Margetts",
               "profile_path": null,
               "id": 1552064,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4614c3a36847f80eb92f",
               "name": "Robert Ellis Miller",
               "profile_path": null,
               "id": 88458,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4614c3a36847f80eb949",
               "name": "Muriel Resnik",
               "profile_path": null,
               "id": 1178511,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4614c3a36847f80eb94f",
               "name": "Julius J. Epstein",
               "profile_path": null,
               "id": 2665,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56785344925141118100039f",
               "name": "Julius J. Epstein",
               "profile_path": null,
               "id": 2665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56785352c3a36847440003d8",
               "name": "George Duning",
               "profile_path": null,
               "id": 16748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5678535e92514111810003a1",
               "name": "Harold Lipstein",
               "profile_path": null,
               "id": 40461,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5678536b9251411183000387",
               "name": "Stefan Arnsten",
               "profile_path": null,
               "id": 36968,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5678537a925141118a000399",
               "name": "Alfred Sweeney",
               "profile_path": null,
               "id": 936638,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.463346,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42714,
      "vote_count": 5,
      "budget": 0,
      "overview": "Ellen Gordon, a New York executive's mistress falls for the executive's young business associate when the young man is accidentally sent to use the apartment where the executive and his mistress get together every Wednesday. More complications arise when the executive's wife shows up with plans to redecorate the apartment.",
      "similar": [
         772,
         1429,
         18487,
         1771,
         968,
         769,
         11474,
         10661,
         284,
         594,
         10204,
         98566,
         194662,
         10096,
         59108,
         315635,
         259694,
         342473,
         269795,
         164
      ],
      "original_title": "Any Wednesday",
      "runtime": 109,
      "poster_path": "/jwdxZ02bkjK8KMXfDAg3hDhlgGd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1966-10-13",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "It's got some new ideas about multiple dwelling!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Ellis Miller"],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Muriel Resnik",
         "Julius J. Epstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0060112/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MzEwMDA3OF5BMl5BanBnXkFtZTcwOTUxMTgyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jane Fonda, Jason Robards, Dean Jones | See full cast and crew »"],
      "reviews": [
         "This is a very perky comedy that is highly enjoyable on many levels. The quartet of stars is excellent with great chemistry all around. Those looking for a tribute festival for the recently deceased Jason Robards Jr. should definitely include this dry, brittle, and insightful performance. Rosemary Murphy quietly steals every scene that she's in, and Jane Fonda was a great ingenue \"bimbo\" with all the trimmings in her halcyon days. Dean Jones should be outclassed by these three, but he definitely isn't, exhibiting talent hinted at in a few other roles when he wasn't lining his wallet with Disney pablum. This movie almost has it all: terrific dialogue -- especially for fans of double and triple entendres, marvelous acting & chemistry, swift pacing, social insight, and a true historical time capsule. My only mild criticism is that the cinematography is rather pedestrian even though the director makes the most of his attempts to open it up from being a filmed stage play, the camera work even in these scenes is unimaginitive. The positive side of this is that this is a perfect video movie since it does not need to be seen on the big screen. I give it 9 out of 10.",
         "Any Wednesday's a truly funny out-stage comedy, with an enjoyable '60s taste. Jane Fonda is sexy and adorable, the other characters are well drawn. I'm a bit surprised imdb users have such a low opinion of this film (a bit more than 5/10 as I'm writing), in my opinion it deserves a full 7/10 just for the balloon scene.",
         "THe ensemble cast is wonderful in this somewhat opened-up four-person stage play of the mid-1960s. Jason Robards commands the screen as a CEO who uses his mistress' apartment as a tax write-off and stays with her on Wednesdays when he is supposedly off on business trips. Jane Fonda is the kept woman. Rosemary Murphy is his wife. Dean Jones, in a non- Disney role, is the angry young man with business and personal grievances against CEO Cleeves (Robards). Robards is the most memorable as the winning-obsessed CEO who considers everything in his life a game and people as chess pieces to manipulate. What makes this character a cut above, however, is his wry and sometimes self-effacing sense of humor - especially after he realizes that he is stuck with more than he bargained for. Today's more critical and angry moral standards will be aghast at the premise and today's emphasis on lower-key acting, less verbiage, and more visuals will find the film's acting to be overdone and the story over-told. For people in my age bracket, this remains as free, and breezy and winning today as it was in 1966 - still a joy to watch!",
         "What used to be referred to as a sex comedy which in the more innocent time it was made meant that if included no actual sex only the suggestion of it. The film is dated in its attitudes that's true but because of the lightness with which the material is played by the four leads it remains a breezy comedy. Jane is at her fluttery bubbly early career best and because of her hairstyle it's striking how much she resembles her present day self. All four principals are very winning, Rosemary Murphy in particular is a chic delight as well as wonderfully droll. The film also offers a reminder that there was a time when Dean Jones was quite an expert comic actor. The story is a bit incredible but being a romantic comedy that sort of goes with the territory.",
         "Broadway hit about a married millionaire's mistress befriended by his unsuspecting wife and cooed over by a loyal associate. Lots of slamming doors, comic deception, hissy fits and balloons--okay ingredients for a frothy fracas, and the cast is good. Jane Fonda overacts all over the place, yet she's delicious while dropping dry wisecracks or guzzling champagne (Fonda really keeps this material popping). The picture is so ready-made to be adorable, with little 'shockable' lines dotting the script, that it's easy to see why critics dismissed it. Some of the jokes are about five years out of date (this might have been perfectly pleasant if made in 1960 or '61). The plush production and the tinkly music set a jovial mood, but I bet the film looked awfully archaic coming into the Free Love generation. **1/2 from ****",
         "In the days of dinner theater, many actors made a good living traveling the circuit with shows like \"Any Wednesday,\" a Broadway play made into a film in 1966. These frothy sex comedies were all the rage on stage and in film -- Boeing Boeing, Mary, Mary, The Marriage-Go-Round, and of course, Any Wednesday. Jane Fonda plays Ellen, a young woman who is wooed and ultimately falls for an older married executive, John Cleves (Jason Robards) who makes her apartment an executive one, which is tax-deductible and enables her to live there after her roommates move out. One day, Cleves' unknowing secretary sends over a good-looking young businessman, Cass Henderson (Dean Jones) needing a place to stay for the night. It goes down a predictable path from there. The good cast makes this watchable, as it's a rather dated story. Rosemary Murphy is a delight as Cleves' wife, whom John is away from every Wednesday night on out of town business. Fonda is beautiful and sexy as the confused mistress, and Dean Jones is attractive as the frustrated Cass, who hated Cleves for business reasons but now finds that his reasons are personal as well. It's cute, and the story involves a New York blackout, though not the biggie from the early '60s.",
         "This is upbeat and fun, as sophisticated New Yorkers find amoral happiness with various partners, inside and outside of marriage. One reviewer said it was five years out of date but compare it to the coy Sunday in New York or the rather dark and sad The Apartment and you can see the attitude is totally different. Fonda's character has no hesitation in telling two men about her great baby-making pelvis. While a bit bemused by Murphy's character's attitude she is cool with being friends with the ex. The wife seems to be relieved to become the Wednesday lover, instead of her role as business asset. Fonda and Robards' characters parted very amicably despite his lies. Jones's character has no problem about taking on a woman with what used to be thought of as a scarlet past. Everyone seems to come out of it with what suited them the best. Nobody is punished. Everyone lives happily ever after. It's very Broadway not Middle America but one assumes the fact that it took place in NYC allowed the rest of the country to enjoy it, even while shaking their heads at those immoral city people. I wouldn't imagine it was a movie that parents wanted their teenagers to watch. As for one reviewer's likening of the gay portrayal to the negative stereotypes of blacks in the movies, I would just say that in NYC in the arts there were people who behaved like that. My father had a cousin who was a musician and he acted like that. It's similar to the lesbians in early movies who are dressed in suits and look like men. There were women in sophisticated urban environments who did that at that time. I don't know if there are similar complaints on this site about the portrayals in La Cage aux Folles or The Birdcage, or if there are complaints about TV shows like Will and Grace but those are very similar. That doesn't imply that homosexuals who were, for instance, clerks in small towns would be anything like that. Probably most people in the arts in many major cities are at least a bit over the top, if not totally over the top and halfway down the other side. They don't want to blend in. They want to stand out.",
         "I kept thinking of how the self-actualized Jane Fonda of today must look back on this trifle and blush. She plays Ellen, a ditsy bimbo with no discernible direction in life who allows her affections to be bought by the crass, self-satisfied user of a businessman, John Cleves (Jason Robards). This story is terribly dated and all of the characters overact -- down to an interior designer who is egregiously overplayed so as to seem gay. I suppose this film, which often plays like a sitcom, aspires to be a zany farce. But it drags and cries out for editing. (That extended scene in the car, with all the principals playing a silly clapping game...what drivel! Wasn't there any other way to advance this weak-kneed plot??) Fonda is pretty here but that's all I can say for her characterization of an intellectually challenged blonde. Dean Jones -- conjuring a young Jimmy Stewart -- does OK, despite all odds, as the kind of guy Ellen should have been dating -- a young man who could think beyond his own immediate gratification. \"I'm full of love,\" he tells his inamorata. \"It's all right here -- just waiting for the right person to come along!\" Fonda was still starting out in her career, but one wonders why the by-then respected Robards -- 44 when this was filmed but seeming much older -- accepted a gig like this! I know, someone reading this review will tell me to lighten up -- it's just a frothy comedy! Even when viewed through that tinted lens, this could have been way better.",
         "Wealthy businessman John Cleves (Jason Robards) lies to his wife Dorothy (Rosemary Murphy) to have affairs on any Wednesday. Ellen Gordon (Jane Fonda) is a gallery clerk who inadvertently helps him. He is relentless in his pursuit until she surrenders to his wealth and power. She's getting kicked out of her apartment unless she gets $32K. John proposes his company buy her apartment as a love nest. She surprises herself with her uncontrollable lust for him. One day, John's secretary sends Cass Henderson (Dean Jones) to stay at the company apartment. Cass figures it's a love nest and intends to find out if it's Cleves's. Dorothy drops by and assumes that Cass and Ellen are together. They play along leading to an all out farce. Jason Robards is old and disgusting. He is a horrible character. The affair makes my head hurt and my soul cry. Jane Fonda is playing such a weak minded character. Dean Jones' character is only better by comparison. These are all unlikeable character to one degree or another. I don't care about any of these characters and I don't care what happens to them. The farce is all wacky without being funny.",
         "Jane Fonda (she's Ellen) is the mistress whom executive Jason Robards (he's John) squeezes regularly; they have an ecstatically happy relationship, meeting every Wednesday in the \"executive suite\" he keeps for her. Then, into the New York apartment walks Dean Jones (he's Cass), who claims to need the phone (and a place to stay). When Rosemary Murphy (John's WIFE!) arrives, major high-jinks ensue! \"Any Wednesday\" is another dated 1960s situation sex comedy. The four are okay - with, perhaps Mr. Jones and Ms. Murphy surpassing their more well-known upper tier co-stars. The \"split screen\" telephoning is interesting; and, the script is lively with sexual innuendo. These movies seem like three-times-too-long TV half-hours comedies featuring stuff they couldn't tastefully show on TV. The \"Gay Joke\" comic relief is an \"interior decorator\" whom Murphy enlists to correct Fonda's apartment decor - it is startlingly over-the-top, like a '60s version of the \"Negro Joke\" character. *** Any Wednesday (1966) Robert Ellis Miller ~ Jane Fonda, Jason Robards, Dean Jones"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Ellen Gordon, a New York executive's mistress falls for the executive's young business associate when the young man is accidentally sent to use the apartment where the executive and his mistress get together every Wednesday. More complications arise when the executive's wife shows up with plans to redecorate the apartment.",
         "Wealthy middle-aged businessman John Cleves, who lives in suburban New York City in Short Hills, New Jersey, lies to his wife Dorothy once a week by telling her he is going out of town on business on Wednesday, while in reality he stays in the city to have an extramarital liaison. It is with disgust that twenty-something Ellen Gordon, an art gallery clerk, inadvertently helps him in that lie. But Ellen eventually falls under his constant pursuit of her and his charms to become his exclusive Wednesday liaison in the city. Part of their arrangement has John's company buying her apartment - which is officially listed as the company's executive suite - for her to live in. Complications ensue when John's secretary sends one of the company's out-of-town clients, Cass Henderson, to the suite. Cass quickly comes to the realization that Ellen is John's kept mistress. Quickly following, another visitor to the suite is Dorothy, who assumes Ellen and Cass are a young married couple, a lie which both Cass and Ellen perpetuate to protect Ellen and John's affair. As the four end up spending what is somewhat of an awkward day together, each begins the long process of figuring out what and who they really want in life. The question becomes if each gets what he/she wants."
      ],
      "budget": 0
   },
   "movielensId": 102963,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-10-13",
      "dvdReleaseDate": null,
      "directors": ["Robert Ellis Miller"],
      "runtime": 109,
      "movieId": 102963,
      "title": "Any Wednesday",
      "mpaa": "",
      "actors": [
         "Jane Fonda",
         "Jason Robards",
         "Dean Jones",
         "Rosemary Murphy",
         "Ann Prentiss",
         "Jack Fletcher",
         "King Moody",
         "Kelly Jean Peters",
         "Monty Margetts"
      ],
      "imdbMovieId": "0060112",
      "originalTitle": "Any Wednesday",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ellen Gordon, a New York executive's mistress falls for the executive's young business associate when the young man is accidentally sent to use the apartment where the executive and his mistress get together every Wednesday. More complications arise when the executive's wife shows up with plans to redecorate the apartment.",
      "tmdbMovieId": 42714,
      "avgRating": 3.16667,
      "releaseYear": "1966",
      "numRatings": 3,
      "posterPath": "/jwdxZ02bkjK8KMXfDAg3hDhlgGd.jpg"
   }
}