{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "drug abuse",
            "id": 726
         },
         {
            "name": "unsimulated sex",
            "id": 12420
         }
      ],
      "imdb_id": "tt0062900",
      "video": false,
      "title": "They Call Us Misfits",
      "recommendations": [
         56503,
         56504,
         129467,
         87208,
         22471,
         25283,
         17172,
         45983,
         16026,
         19181,
         24646,
         16076
      ],
      "backdrop_path": "/qaMuAdJr1eipBiZTTAa8G3fijyj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Kenta",
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8184fe7",
               "name": "Kenneth 'Kenta' Gustafsson",
               "profile_path": null,
               "id": 224417,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Stoffe",
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8184feb",
               "name": "Gustav 'Stoffe' Svensson",
               "profile_path": null,
               "id": 224418,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8184ff1",
               "name": "Stefan Jarl",
               "profile_path": "/hUdrRRYVukHkhFTv4LOdFRFW7si.jpg",
               "id": 224419,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8184ff7",
               "name": "Jan Lindkvist",
               "profile_path": null,
               "id": 224420,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8184ffd",
               "name": "Jan Lindkvist",
               "profile_path": null,
               "id": 224421,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8185003",
               "name": "Stefan Jarl",
               "profile_path": "/hUdrRRYVukHkhFTv4LOdFRFW7si.jpg",
               "id": 224419,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.273268,
      "production_countries": [{
         "iso_3166_1": "SE",
         "name": "Sweden"
      }],
      "id": 56500,
      "vote_count": 8,
      "budget": 12000,
      "overview": "A documentary film depicting a group of young boys from Stockholm which live on the outskirts of society. The film is the first part of a trilogy.",
      "similar": [
         180863,
         627,
         376867,
         641,
         3134,
         253,
         4133,
         452,
         979,
         707,
         786,
         394117,
         59967,
         475345,
         7972,
         12143,
         34647,
         692,
         635,
         9453
      ],
      "original_title": "Dom kallar oss mods",
      "runtime": 100,
      "poster_path": "/r2dyKyZBDz4grF6pbbKZAjHZkhb.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [{
         "logo_path": "/fzxheYVOrjErOMDo0kgN6WsOZxg.png",
         "name": "Svenska Filminstitutet",
         "id": 2302,
         "origin_country": "SE"
      }],
      "release_date": "1968-03-25",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Mods Collection",
         "id": 65906,
         "poster_path": "/82Y5YVn1nxRqYm1lIv8Xy8mgXvZ.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Black and White",
      "budgetCurrency": "SEK ",
      "directors": [
         "Stefan Jarl",
         "Jan Lindkvist"
      ],
      "runtime": 100,
      "synopsis": "The film is an uncompromising account of the life of two alienated teenagers, Kenneth \"Kenta\" Gustafsson (1948-2003) and Gustav \"Stoffe\" Svensson (1950-1978). The film takes a close but non-moralizing look at the joys and growing pains of mod and 'junkie' street culture in Stockholm at the time. The film begins with an interview with Tompa, a friend of Kenta and Stoffe. He tells how he grew up in orphanages and juvenile prisons. He says that freedom hardly exists for him. But one thing is he sure of, the time he spent with Kenta and Stoffe and the other mods were the most enjoyable time of his life. The interview cuts to Kenta and Stoffe running through the streets of Stockholm filmed with a fisheye lens. Later we see them walking around at the subway station T-Centralen in Stockholm. They meet friends and go around begging people for food, beer and cigarettes. The workers who are passing by get ridiculed by Kenta and Stoffe. Another friend of the guys, Jojje, talks about how alcohol will destroy them in time. But that he doesn't worry much about it right now. The filmmakers have fixed a small apartment for Kenta and Stoffe which is a big difference for the guys who previously slept outdoors or at others. Kenta and Stoffe talk about their childhood. Stoffe's father drank himself broke and died in hospital. Kenta's father tried to strangle him with a tie. But Stoffe also remembers that he thought it was fun to play at home when he was little. We see the two guys go to \"4:an\", a club for young people. Stoffe likes to be with many girls, but tells Eva, who he has sex with, that he wants her for himself. Kenta and Stoffe make a musical performance, where they play a song by The Zombies. It is now winter and a trip to Hedemora in Dalarna undertaken in the company of Hasse. They plan to visit Stoffe's childhood friend Ingmar. On the train they drink beer, smoke pot and make jokes. The mood is high. But they can't stay in Hedemora, the difference from Stockholm is too big, because Stoffe thinks nothing happens in Hedemora. In Stockholm there is Peter, who earns 400 kronor a day by selling drugs, and Lunkan who got hepatitis from an infected hypodermic syringe. It's summer and Kenta and Stoffe are still not working and have nowhere to live. Their friendship is being worn down. Kenta doesn't think Stoffe is a good friend anymore. Not since he started seeing Eva. One night the guys goes searching for empty stairwells to stay in, but they start arguing and Stoffe leaves. Kenta finds an empty stairwell and lays himself down, opens up a beer and starts reading a cartoon magazine. The same night Stoffe gets taken care of by the police when he gets arrested.",
      "writers": [
         "Stefan Jarl",
         "Jan Lindkvist"
      ],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0062900/",
      "coverLink": null,
      "actors": ["Stars: Kenneth 'Kenta' Gustafsson, Gustav 'Stoffe' Svensson, Stefan Jarl | See full cast and crew »"],
      "reviews": [
         "I was 14 when this movie premiered, in the tumultuous year of 1968. It immediately impressed me as a very accurate portrayal of teens alienated by society's materialism, frustrated by the prospect of one day having to conform. Stefan Jarl, a director of great integrity, follows two teens, Kenta and Stoffe, through their everyday life, which is Bohemian indeed. Nothing much happening, not much of a plot, more like a documentary - I guess that to a large extent it is. Still, it is fascinating. Jarl manages to capture their sentiments, their world view, and how it provokes society. Although the 60's are long gone, my guess is that teens of any decade can relate to this movie. Those who have left their teen years far behind, should use this movie as a revisit. We should never dismiss the thoughts and feelings we had when young, or the world will quickly become a ruin. Jarl made a follow-up movie, A Decent Life, eleven years later, returning to Kenta and Stoffe, and what their lives had become. Again in 1993, in The Social Contract.",
         "Being young and revolt towards parents and society as in \"They call us misfits\" reminds us that there is no difference between youth then and youth now. Its messed up to be in the borderline between childhood and grownup adult. There is a thin line between documentary and fiction in this film but Stefan Jarl has captured the feeling more than actual events i guess. In the movie we meet actual kids who already has given up on life. Kids who know they are going to be alcoholics and drug users, they don't care. Hm.. who to blame? This film was first stopped from distribution because of a sex scene in the movie but was later released without surgery because Olof Palme (working for the Swedish socialist party until he was murdered in 1986) thought the film was important.",
         "This first film in the \"Dom kallar oss mods\"-trilogy (They call us misfits\") is truly great and less depressing than the two following films, which are also great but much more serious and sad. This is because Kenta (Kennet Gustavsson) and Stoffe (Gustav Svensson) are still young and naive, only 18 years old, and have not yet become alcoholics and drug addicts. Stefan Jarl has made a true documentary classic, capturing the zeitgeist of the 60's in Sweden while following these two exceptionally well spoken social misfits and their friends in their lives. You cannot help but liking Kenta and Stoffe,outspoken and friendly, they never really had a chance... Dom kallar oss mods is a unique, warm, generous and open-hearted movie. Don't miss it for the world. Lots of fun too.",
         "I was born in 1979 and didn't see the documentary the first time around. The thoughts and ideas of these teenagers are very much the same as of teenagers of today, and it is striking how little has changed. (Reluctance to becoming a \"Svensson\" :-) among other things) I can't believe how much Stefan Jarl have gotten them to open up in front of the camera. They talk about family situations, their dreams and hopes (or lack thereof). Apparently he lived with them for so long that they didn't mind the cameras anymore. I would recommend this movie to anyone. It is a fascinating display of a decadent lifestyle and the hairstyles are just unbelievable.",
         "Even though I'm born in the eighties and was a teenager in the late nineties and early twenty-first century I can relate to this movie. Why? Because youth is still youth. Every decade has it's rebellion. In every decade there are kids who live like the kids in this movie. The fifties had the rockers, the sixties the mods and hippies, the seventies punk, the eighties metal and goth, nineties grunge and now we have the emos. There will always be youth rebellion. And there will always be drugs, alcohol and those who fall for the fast living and become prisoners of their addiction. What strikes me the most about this movie is the pessimism of the young people. They come from broken homes full of abuse. Physical abuse and substance abuse. And they don't expect to do any better themselves. They live for the day not thinking too much about the future. They party and do drugs to not have to think about what their lives are really like. They are true escapists but in the end reality catches up with them as we see in the sequels. This is a sad movie showing the despair of lost young people hiding behind happy facades of constant partying. Even though it was made forty years ago it's still a very important documentary. I know people like this. Change the scenery to that of Stockholm today and the clothes to clothes of today and this movie could have been shot in 2008. The question I ask myself after watching this movie is how can we make things right for people like this? I don't know and apparently people back then didn't know either because things are still the same."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Svenska Filminstitutet (SFI)"],
      "summaries": ["The first in Stefan Jarl's Mods Trilogy, the film documents the life of two teenagers, Kenta and Stoffe. With interviews from the two boys and their friends about their hedonistic lifestyle, and what their future holds, the film explores the highs and lows of mod life in 1960s Stockholm, Sweden."],
      "budget": 75000
   },
   "movielensId": 103032,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "1968-03-25",
      "dvdReleaseDate": null,
      "directors": [
         "Stefan Jarl",
         "Jan Lindkvist"
      ],
      "runtime": 100,
      "movieId": 103032,
      "title": "They Call Us Misfits",
      "mpaa": null,
      "actors": [
         "Kenneth 'Kenta' Gustafsson",
         "Gustav 'Stoffe' Svensson"
      ],
      "imdbMovieId": "0062900",
      "originalTitle": "Dom kallar oss mods",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "SFCy2xP3Vuw",
         "kV5X6yZy6xU",
         "kAn6HfyJRV4",
         "3-6T7zHrDKQ"
      ],
      "plotSummary": "A documentary film depicting a group of young boys from Stockholm which live on the outskirts of society. The film is the first part of a trilogy.",
      "tmdbMovieId": 56500,
      "avgRating": 3.44444,
      "releaseYear": "1968",
      "numRatings": 9,
      "posterPath": "/r2dyKyZBDz4grF6pbbKZAjHZkhb.jpg"
   }
}