{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "terror",
            "id": 321
         },
         {
            "name": "hostage",
            "id": 1562
         },
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "homeland",
            "id": 2156
         },
         {
            "name": "pakistani",
            "id": 5471
         },
         {
            "name": "wall street",
            "id": 5636
         },
         {
            "name": "crisis",
            "id": 6711
         },
         {
            "name": "conflict",
            "id": 11933
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt2032557",
      "video": false,
      "title": "The Reluctant Fundamentalist",
      "recommendations": [
         80318,
         287322,
         174376,
         121676,
         59111,
         320586,
         100544,
         84191,
         308077,
         60792,
         172469,
         84201,
         237614,
         172792,
         43219,
         69567,
         324245,
         44032,
         168027,
         327651
      ],
      "backdrop_path": "/x2VRLq3LP4B6tXFqhXFiDo6hYo4.jpg",
      "revenue": 519535,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Changez",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e93",
               "name": "Riz Ahmed",
               "profile_path": "/yWjuIP634unLBCB4XjSgmJs5QGC.jpg",
               "id": 53240,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Erica",
               "gender": 1,
               "credit_id": "52fe4a6ac3a368484e151e83",
               "name": "Kate Hudson",
               "profile_path": "/87SBjReNEW8PFiGbPSTS68H39LT.jpg",
               "id": 11661,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jim",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e87",
               "name": "Kiefer Sutherland",
               "profile_path": "/4YvDfOfD4TgyzDkLGoq76g5BZNe.jpg",
               "id": 2628,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e8b",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Wainwright",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e8f",
               "name": "Nelsan Ellis",
               "profile_path": "/uRPoXULZniUyOyInWHiP1b79H0Y.jpg",
               "id": 81697,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ludlow Cooper",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e97",
               "name": "Martin Donovan",
               "profile_path": "/bNS43B8maD5A4UYSWy4UjgHru1a.jpg",
               "id": 42993,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mike Rizzo",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e9b",
               "name": "Christopher Nicholas Smith",
               "profile_path": "/aDwUSHWkDZSUE1kxswfbcsE95YU.jpg",
               "id": 579064,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Abu",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e9f",
               "name": "Om Puri",
               "profile_path": "/xjkp1S0XxDBJrjHL8Kq0JD2uvz5.jpg",
               "id": 11851,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Ammi",
               "gender": 1,
               "credit_id": "52fe4a6ac3a368484e151ea3",
               "name": "Shabana Azmi",
               "profile_path": "/vAoYSYP4DFUMv7fZk9u8Bps9by.jpg",
               "id": 85672,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Nazmi Kemal",
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151ea7",
               "name": "Haluk Bilginer",
               "profile_path": "/gOrSNwrctPP6k23GnP3np7wvjOR.jpg",
               "id": 117640,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Bina",
               "gender": 0,
               "credit_id": "52fe4a6ac3a368484e151eab",
               "name": "Meesah Shafi",
               "profile_path": null,
               "id": 1203994,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4a6ac3a368484e151e79",
               "name": "Mira Nair",
               "profile_path": "/kHsDhH7maEHxmanGh0ZiFCtT5GI.jpg",
               "id": 6495,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a6ac3a368484e151e7f",
               "name": "William Wheeler",
               "profile_path": null,
               "id": 60185,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "553e47f6c3a368784500eb62",
               "name": "Declan Quinn",
               "profile_path": null,
               "id": 6117,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "553e4813c3a36879e7001954",
               "name": "Shimit Amin",
               "profile_path": null,
               "id": 76447,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "553e4821c3a36820ec005796",
               "name": "Michael Andrews",
               "profile_path": null,
               "id": 1589,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "553e483392514138a900a82a",
               "name": "Arjun Bhasin",
               "profile_path": null,
               "id": 6506,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "553e484092514138a900a82f",
               "name": "Michael Carlin",
               "profile_path": null,
               "id": 16364,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 11.286788,
      "production_countries": [
         {
            "iso_3166_1": "QA",
            "name": "Qatar"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 121677,
      "vote_count": 96,
      "budget": 0,
      "overview": "In New York, a Pakistani native finds that his American Dream has collapsed in the wake of the 9/11 terrorist attacks.",
      "similar": [
         1359,
         281,
         340666,
         242224,
         158907,
         858,
         634,
         68,
         693,
         772,
         5176,
         244772,
         93456,
         49519,
         150540,
         437557,
         9603,
         258480,
         427900,
         441701
      ],
      "original_title": "The Reluctant Fundamentalist",
      "runtime": 130,
      "poster_path": "/h8GW6hvvmzrKKZbdB59b6ome5ki.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "اردو",
            "iso_639_1": "ur"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mirabai Films",
            "id": 6235,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cine Mosaic",
            "id": 21864,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Doha Film Institute, The",
            "id": 72917,
            "origin_country": ""
         }
      ],
      "release_date": "2013-03-17",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Terror has two faces.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mira Nair"],
      "runtime": 130,
      "synopsis": "The film opens in Lahore with Anse Rainier (Gary Richardson), an American professor at Lahore University, kidnapped on his way home from seeing a movie. The following day, the kidnappers send a video tape, in which they demand the release of 690 detainees from a Muslim concentration camp in Kot Lakhpat and 700,000 for the children of Waziristan in exchange for Rainier's life. An American journalist and undercover CIA informant in Pakistan, Bobby Lincoln (Liev Schreiber), arranges to interview one of Rainier's colleagues at Lahore University, Changez Khan (Riz Ahmed), who is suspected of being involved in the kidnapping, in a cafe in Lahore. Set back in 2000, Changez, the son of a famous poet (Om Puri) and housewife (Shabana Azmi), lives a privileged life in Lahore. Changez wins a scholarship to Princeton University. From there, he gains a training contract at a top Wall Street valuation firm, Underwood Samson. Before beginning employment, Changez takes a vacation to Greece, where he meets and falls in love with an American photographer, Erica (Kate Hudson), who mourns the death of her boyfriend. Their relationship develops on Changez's return to the USA, where he becomes a high-flying employee under his boss Jim Cross (Kiefer Sutherland). Changez is away in Manila on business when the World Trade Center attacks take place, and on return to the USA finds himself a figure of automatic suspicion, being strip-searched on arrival in New York. Gradually his positive attitude towards America begins to change. Despite sleeping with Erica, their relationship further deteriorates as she fails to move on from her boyfriend's death. During a business visit to Istanbul Changez values a publisher, and finds it worth no money. He discovers that the publisher published translations of his father's poems in Turkish. He cannot bring himself to only look at the money, and resigns from Underwood Samson. He returns to New York and has a last meeting with Erica. Changez returns to Lahore. He begins lecturing at Lahore University, where he voices his dissatisfaction with the US's interference in Pakistan and also meets suspected Al-Qaida members, causing the US to raid his house and threaten members of his family. Fast forward to the present day, both Bobby and Changez are under pressure from the CIA and protestors outside the cafe, leading the CIA to move in. Changez reveals that despite his opposition to the US he refused to join Al-Qaida as his anti-US sentiment does not define him; Bobby in turn admits that Rainier was a CIA officer. As the protests in Lahore grow more violent, Changez suggests a butcher's shop where Rainier may have been taken. Tensions and suspicions escalate as the protesters grow further enraged and Bobby becomes suspicious of Changez, who is sending tense text messages on his cellphone. The CIA inform Bobby that Rainier is, in fact, already dead, leading him to drag Changez out of the cafe at gunpoint. As Changez appeals for calm from the protestors, Bobby accidentally shoots and kills Sameer (Imaad Shah), one of Changez's militant students. As the CIA extract Bobby, they reveal to Bobby both that Rainier had died earlier that day and that Changez had already offered to work with the CIA - the text messages he sent were to his sister, Bina (Meesha Shafi). Changez delivers a eulogy at Sameer's funeral as Bobby recuperates in hospital, recalling Changez's words - \"Looks can be deceiving. I am a lover of America.\" The film ends with the note.",
      "writers": [
         "Javed Akhtar",
         "Ami Boghani"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2032557/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzAzNjg3Mzg1Nl5BMl5BanBnXkFtZTcwOTUzNzExOQ@@._V1._CR25,27.166671752929688,1347,1995.9999542236328_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Riz Ahmed, Liev Schreiber, Kiefer Sutherland | See full cast and crew »"],
      "reviews": [
         "I saw a screening of the film at the BFI film festival in London and Mira Nair's intro really did set the tone for the film. She mentioned how there have been countless accounts of the attacks from the viewpoint of those who died to protect democracy but what of all the innocent lives lost in the process? She wanted to give the viewpoint of the war on terror from the other side, who in one stroke of the brush have been deemed extremists or terrorists. She wanted to use this film as a platform to start a dialogue between the East and West, to tell a story of contemporary Pakistan which is caught between whether its identity should be pro or anti-American without realizing it has to choose neither but develop a \"Pakistani identity\". And a dialogue it was. Quite literally. The journalist Changez talked to had perhaps become a reluctant fundamentalist in his own right, living in Lahore but after viewing the atrocities of the Taliban, reverting to the CIA. There are beautiful touches added to the film like linking religious fundamentalism with economic fundamentalism - like the ruthlessness of capitalism where money and success are the only motivation versus the blind hate of religious extremism, both ideologies pursued without regard for who suffers as a result. It's a very fine balance to keep from tipping into either extreme and Mira Nair presented it beautifully. I read the book and I was afraid of the treatment - a British Asian playing the lead role did not conform to the image of Changez I had in my mind and I was afraid that the essence would be lost. But he managed to pull it off. The movie was adapted quite well. Every character had a story, nobody was good or evil, and everyone's behaviour had a consequence on the decisions made by other characters. It was a story of humanity where we are all the same yet cannot seem to get over the colour of the other person's skin. As a director, Mira is blunt - she shows things as they are. Rather than seeing an aerial view of the Badshahi mosque or the glossy shops of Liberty, we see the gritty part of Lahore. The film is ambitious - set in five countries and telling a complex story but I think it succeeds. It's not that I don't have problems with the film but I highly doubt someone else could have told it so well. It seamlessly integrates the beautiful sounds of Pakistani music from the highs and lows of qawwali to the beautiful poetry of Faiz. As a Pakistani who has worked on Wall street, I have seen reluctant fundamentalists pop up everywhere post-9/11 with the polarizing \"with us or against us\" Bush ideology, unapologetic racial profiling at airports, media portrayal of Pakistan as a cultural backwater, etc. I am glad someone is telling the story of how they came to be, how people who were once proud to be American withdrew back to their former identities, albeit reluctantly, but through the actions of the few people who unfortunately will have no interest in watching this movie because they are not interested in a dialogue. No, the only viewpoint that matters to them is their own.",
         "When I read on the Venice Film Festival schedule that the opening film, the Reluctant Fundamentalist, was going to be about 9/11, I have to admit I was a little disappointed. There have been just too many films, books, short stories, documentaries and so on on the subject and I didn't feel there was much left to say without risking to be too rhetorical or predictable. I attended the screening expecting a mediocre film, but what I watched instead was a surprising, moving, complex story that deals with a series of issues, the most important of which is not 9/11 but human emotions. The film is about Changez, a university teacher in Lahore who also appears to be right at the centre of the conflict between Pakistani and Americans, as another teacher was kidnapped and most of Changez's students are being watched carefully by the CIA. Then Changez meets Bobby, an American journalist who will end up to have more in common with him than we first thought, and we learn about Changez's past in Pakistan and America, to find out that there's so much more to both of them. There are several reasons why the film worked for me, but the main one would be that it doesn't only focus on one side of the story, but forces the viewer to assume both sides at different points. I have to admit I immediately sided with the journalist at the start, and I think it's because of the blurry way in which the film starts, that immediately makes us suspect there might actually be something that Changez's students are hiding. The viewer is literally thrown into a strange world that he doesn't understand, and the first thing he does is to take the side of something he does understand and that he is familiar with, and that is Bobby, who seems to be a journalist and whose background we seem to be able to understand. In a way, we are almost relieved when he appears, as before that moment everything moved really quickly and the story wasn't very clear yet. I found this a clever choice, as everything will be reversed at the end. But we do change sides quite soon in the story, as we get to know Changez's past and find that there was something we can recognize in it too: he went to university in America, he was successful, he was in love with the \"American dream\" and he spent many years in the country. When he talks to the journalist he makes an unexpected reference to CSI Miami, something that was in a way unexpected but also reassuring in the context of kidnapping, bombing and revolutionary ideas. His character is not as intimidating or mysterious as we first thought he was, and we actually find that it's easy to relate to him too. In a way, both Changez and Bobby look slightly out of place in the bar in Lahore, and yet we get the impression that if any of them said something wrong, something really bad would happen. When we go through Changez's past abroad, we do get a sense of his character through the small things he does or says, in a way. He seems to be a very positive, successful, ambitious character that means well, dreams big and is attached to his family, but we find out quite soon that he is also a cold, calculating person who knows exactly what he wants and won't stop until he gets it. It starts at work, when he suggests to fire a huge amount of people to make a company be more productive, without thinking of the repercussions on people's lives. It continues in his love life, when he gets together with a girl whose previous boyfriend had died a few months earlier, and when she feels like she is cheating and can't have sex with him he doesn't comfort her but suggests to her to \"pretend I'm him\". Just like Changez, his love story is flawed from the very start. And if Changez is flawed and living an illusion who is doomed to end, his love interest Erica (played by Kate Hudson) is also a broken, damaged character who doesn't even really get to redeem herself at the end. Her very reaction to his suggestion shows her inability to move forward and makes her sad and depressed. We understand straight away that the relationship means something different to her than what it means to him, and this is proved in the wonderful scene of her gallery opening, that is probably one of my favorite scenes in the film, where she portrays her love story as a hollow, shallow, cold pretense and also marks its end and a point of non return for Changez as well. Our sympathies change as the story evolves, we don't know who to trust and who to dislike, but the answer is that there is no right or wrong. That is, I think, what the ending wants to show. Some people will see it as a positive one, others will see it as the beginning of the end. Different people will get different messages from this film and understand it in different ways, and I think that's what the director wanted. As for me, I'm probably a pessimist, but as the credits scrolled down and I prepared to leave the cinema, the scene that came to my mind (and that sums up the whole film to me) was the one in which Changez asked his students, during a lecture, to forget about the \"American Dream\" and help him build/find a \"Pakistani Dream\" instead.",
         "This movie challenged my views of American policy. I thought that it was definitely written with an Indian audience as the demographic it would do best in. We had an opportunity to listen to the Director (Mira Nair) speak about this and her other movies. She told us \"This movie is intended to start a conversation\", and that it does. If you are a Hollywood / blockbuster fan you probably will not enjoy this as much. If you are open- minded, watch film for more than just entertainment, and like Bollywood / Indian film, this is for you. I think that just as 20 years ago film depicting disability, or sexuality was far less popular such is true about a film that illustrates a point of view that's not that of a gun toting American.",
         "For those who have read Mohsin Hamid's brilliant novel on which this film is based the story will be easier to follow than the somewhat disconnected screenplay that was written by Hamid with Ami Boghani and William Wheeler. Mira Nair directs, and knowing her previous work suggests that it is this very disconnect that she wishes to emphasize in this profoundly moving film - in these times of global unrest and fear because of terrorist acts we don't know who to trust and who to dislike, but the answer is that there is no right or wrong. Nair achieves this by beginning her film with a conversation between an American journalist Bobby (Liev Schreiber) and a Pakistani professor Changez (Riz Ahmed) in a setting of high tension in a bar in Lahore and our initial belief is that the Bobby represents the core we trust and with whom we identify, that Changez is the unknown 'different culture' stranger who is suspect. In the course of the film that position is deeply altered. And that is where the power of the message is so affecting. But we must go through flashbacks of eleven years to understand the real drama. Changez Khan (the very handsome and very fine actor Riz Ahmed) lives with his poet father Abu (Om Purl) and mother Ammi (Shabana Azmi) in Pakistan. The family is poor but educated and Changez decides to go to America to find his place in the corporate world of money and success - and help support his family (his sister is ready to marry but the family can ill afford a traditional wedding). Changez arrives in America, attends university, and rises rapidly, gaining a position with a Wall Street company that specializes in financial advising for business internationally. The head of the company Jim Cross (Kiefer Sutherland) personally picks Changez after testing his skills and sends Changez on missions to the Philippines etc where he examines the finances, cuts waste (and jobs of workers) and makes the businesses run efficiently, increase profits, but sacrificing the working class. On one such mission Changez is asked to analyze a publishing house in Istantbul, the owner Nazmi (Haluk Bilginer) has translated Changez' fathers poetry into Turkish, and pleads with Changez not to destroy his publishing house. Cross demands Changez shut it down and Changez refuses and submits his resignation. As he prepares to pack to return, jobless, to the US he is watching television and the twin towers of 9/11 are being attacked. His attempts to return to the US are met with police and airport interrogations since he is not a native born American, and this allows the viewer to witness the horrible and demeaning treatment 'foreigners' received in the wake of 9/11. Changez does return to New York and has another setback with his photographer artist girlfriend Erica (Kate Hudson), herself deeply bruised by the loss of her lover in a car crash she caused in the recent past, who has an art opening that includes videos and images of bits of conversation she has shared with Changez - information which in the exhibition further underlines the concept of Changez as a potential terrorist. Changez flees to Pakistan, becomes an anti-violence but fiery professor whose students seek to rid their Pakistan of the American intruders. And this is where the conversation at film's beginning ultimately makes sense (it is now 2011). The manner in which the film ends is left for the viewer to experience. As in the book there are many sidebar stories and characters that underline the stories of both Bobby (who has been talked into joining the CIA) and Changez who moves from his love of the American Dream and his sweetheart, to his spiritual commitment to his Pakistan. These characters, as well as many others in this film, allow us to see there is no one way to view acts as right or wrong. It is all perception and hopefully this brilliant film will assist us in understanding the confusion that deeply affects us all everyday as we walk around the topic of terrorism. Grady Harp, May 13",
         "Whilst it is tempting to dismiss this as just another 9/11 related tale, it goes a little deeper than one might think. A young Pakistani whose upward path to wealth in the finance industry in New York is interrupted by the atrocities of September 11, 2001 who then becomes the Asian looking man with a beard, the centre of everyone's suspicions. The country he had come to grow so fond of, suddenly puts him in a dark corner, which raises some uneasy questions; is hatred the response to hatred, or extremism the cure to extremism? A single event, with a chain of events that followed caused him to question everything. This is a story about two extremes. On the one hand is the religious fundamentalism which drives people to kill for the sake of dogma and blind obedience to a book whilst on the other hand lies the financial fundamentalism which drives people to gamble the livelihoods of others for the sake of individual profit maximisation and wealth accumulation. The former type of extremism is well noted and condemned, whilst the latter is noted but not so openly condemned although it is possible that it is causing more damage than religious fundamentalism. Regardless where one stands on such issues this film puts a young man in the middle of two extremes. Changez is a conflicted soul and whilst he starts out as a financial fundamentalist, should he not swap one extreme for another? Can he realise that fanaticism is harmful no matter whichever root it has? An interesting, and very relevant film.",
         "Four years after I read the impressive novel by Mohsin Hamid, I went to see the film which is based on the book. I wondered how a novel, which is essentially one long monologue by an educated Pakistani called Changez Khan with no other voices whatsoever, would be turned into a big screen offering but reckoned that, if they could do it for such complex works as \"Life Of Pi\" and \"Cloud Atlas\", it could work for Hamid's subtle narrative. So it proved. The 'conversation' in Lahore has been effectively opened out with shooting not just in Pakistan and India but the United States and Turkey, while very effective use is made of music, starting with a dramatic opening scene. The essential clash of cultures, via a confrontation between the reluctant fundamentalist (played by Riz Admed) and the ambiguous American Bobby (Liev Schreiber), is retained, but the film is less opaque than the book, with it being (eventually) much clearer where the two main protagonists stand in the 'war on terror'. Although the political messages are signposted more simplistically in the film than in the novel, this is still a work that challenges preconceptions about the capitalist West and the religious East and ultimately about ends versus means and good versus evil. Considerable credit should go to Indian director Mira Nair (\"Monsoon Wedding\" - another culture-conflict movie) and, as well as the excellent main roles, there is strong support in minor roles filled by Kiefer Sutherland and Kate Hudson. Although the turning point for Changez is the attack on the Twin Towers, subsequent events in Afghanistan, Iraq and elsewhere have only served to underline the need for a better understanding of what motivates fundamentalism and how best it should be opposed. So do see \"Zero Dark Thirty\" (which I thought was excellent), but also take the trouble to find the much less high profile film \"The Reluctant Fundamentalist\". At one point in the movie, Changez is asked by an American official: \"How do you feel about the United States of America?\" It is not a simple question. This film does not offer a simple answer.",
         "I went into the theatre not expecting it to be spectacular but I was wrong. Everything from the acting to the music composition and the dialogue was amazing. Riz Ahmed's performance was terrific. This film sheds light on America's deadly interventions in response to 9/11. A young Pakistani Muslim goes to America, gets an education and becomes successful. When 9/11 occurs, that young man's life is challenged because he is harassed by police and at the same time feeling the pain of his people. But does he become a fundamentalist and goes on a murderous spree on the invaders? Absolutely not. He remains peaceful. The reason is that there is no such thing as fundamentalism in Islam. A person who watches this film will see how peaceful Islam really is. Now that I've seen this film, I will definitely read the book.",
         "What a shame, though how predictable, that the multiplexes chose not to show Mira Nair's brave and provocative political thriller about the intricacies of fighting extremist Islam. Nair uses Mohsin Hamid's fictional novel to explore very real Western attitudes towards the East in the ongoing 'war on terror'. She has directed a film of huge cultural, political and moral significance at a critical juncture between the Muslim and non-Muslim world. Rising star Riz Ahmed (Four Lions) gives a memorable lead performance as Changez, a Pakistani immigrant in New York, who has an identity crisis in the wake of 9/11. He returns to live in Lahore when an MIT professor has been captured and held ransom there by terrorists, who use him as leverage to make demands of the US. Posing as a journalist, Secret Service Agent Bobby Lincoln (Liev Schreiber) visits Lahore to interview Changez, who has developed a reputation for being anti-American. The US authorities believe that Changez, if not a terrorist, at least knows something about the kidnapping. They exert pressure on him by harassing his family, a move which only deepens his hatred. During their interview, Changez asks Bobby to make a judgement about him only after hearing his entire story, and Changez's reminiscence allows for the film to unfurl as a flashback of epic proportions. Raised in a secular, literate Muslim household in Pakistan, Changez finds it easy to break the covenants of his religion. He consumes alcohol, eats pork and sleeps with non-Muslims, everything Islam forbids. He wins a scholarship to study at Princeton in the late 90s, where he claims never to have scored a B. There he is headhunted to work for a prestigious valuation firm where he ensures a rapid promotion by impressing his boss (Kiefer Sutherland). On the day of his promotion the towers come down. He tells Bobby that instead of feeling sadness, he felt awe. 'David had struck Goliath'. Ahmed gave his most famous performance in Lions, but this is his greatest. As an 'Asian' (I abhor the term but include it for your convenience) man myself, I have long had to suffer stereotypical performances by brown-skinned actors, who are used by ignorant directors to add colour and Schadenfreude to their ignorant stories. Ahmed transcends all that. This time we're analysing the reactions of White actors. Changez's hatred of America germinates slowly, against his will, as his life slowly falls apart. Colleagues turn on him. The bond he had with his widowed girlfriend Erica (Kate Hudson) withers. Ordinary citizens view him as the enemy. His choice to move back to Pakistan is made for him. Nair purposely shows much of Changez's life back home, as one of her clear aims is to challenge some key stereotypes. Changez's father (Om Puri) is a distinguished poet, not a farmer or rickshaw puller. The family is quite well off, not destitute. And the country is generally shown to be colourful, vibrant and civilised, instead of corrupt, backward and dangerous, as we normally see. The horror of the recent Woolwich (London) terrorist attack may do something to restrict the impact of this excellent film. Paradoxically, the attack serves to reinforce the arguments of the film. It makes several points, makes them powerfully and forces you to in future question what you are told.",
         "Off late, it seems that there's a new genre of films, both in India and in the West. As varied as they may be in their narratives, they share certain broad elements-a Muslim immigrant to the West facing the hostility and suspicion of a post-9/11 world and gradually becoming disillusioned with the once sought-after Western way of life and seeking solace in his/her own roots. 'The Reluctant Fundamentalist' is the latest addition to that particular genre and yet, unlike many of the others, it doesn't have a lot to do with terrorism. Sure, terrorism and its consequences do drive the plot to a significant extent; but above all, this is a very human story about identity, self-doubt, and internal conflict. The protagonist Changez Khan is a man living in two worlds, and throughout the story, he is never really able to pick a side, despite his assertion that his side has picked for him. In that regard, he is perhaps the most realistic reflection of a modern Muslim youth placed in a similar situation. Without spoiling anything much, I will say that this isn't your sundry story about young people feeling victimized and turning to radicalism-this is something far more complex...something you need to see the whole movie to truly appreciate. Riz Ahmed does a great job portraying the multi-faceted and conflicted protagonist Changez, and Liev Schreiber is brilliant as Bobby Lincoln, the enigmatic American whose conversation with Changez forms the backbone of the narrative. Less impressive is Kate Hudson as Changez's American lover Erika.",
         "As soon as I saw the early credits running right to left I was grabbed by the intelligent Mira Nair, then the rousing singers, sumptuous visuals, disparate actors woven together in this complex, compelling story... wow. The Reluctant Fundamentalist is why I love cinema. This movies imperfections are perfection. I read Mohsin Hamids exquisite book prior to viewing this fine movie and I almost side- stepped this movie because I didn't feel Hamids books subtle yet intense conversation would be translated onto the big screen. How wrong I was - thank you Mira Nair and all those involved. I walked out of this movie and clicked my heels - the sun was shining and the world was travelling just fine in far more places than most realise."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Cine Mosaic",
         "Doha Film Institute, The",
         "Mirabai Films"
      ],
      "summaries": ["A young Pakistani man is chasing corporate success on Wall Street. He finds himself embroiled in a conflict between his American Dream, a hostage crisis, and the enduring call of his family's homeland."],
      "budget": 0
   },
   "movielensId": 103083,
   "movielens": {
      "languages": [
         "English",
         "اردو"
      ],
      "releaseDate": "2013-03-17",
      "dvdReleaseDate": "2013-08-27",
      "directors": ["Mira Nair"],
      "runtime": 130,
      "movieId": 103083,
      "title": "The Reluctant Fundamentalist",
      "mpaa": "R",
      "actors": [
         "Riz Ahmed",
         "Kate Hudson",
         "Kiefer Sutherland",
         "Liev Schreiber",
         "Nelsan Ellis",
         "Martin Donovan",
         "Christopher Nicholas Smith",
         "Om Puri",
         "Shabana Azmi",
         "Haluk Bilginer",
         "Meesah Shafi"
      ],
      "imdbMovieId": "2032557",
      "originalTitle": "The Reluctant Fundamentalist",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["ouXWUenv5_Y"],
      "plotSummary": "In New York, a Pakistani native finds that his American Dream has collapsed in the wake of the 9/11 terrorist attacks.",
      "tmdbMovieId": 121677,
      "avgRating": 3.53788,
      "releaseYear": "2013",
      "numRatings": 66,
      "posterPath": "/h8GW6hvvmzrKKZbdB59b6ome5ki.jpg"
   }
}