{
   "tmdb": {
      "original_language": "pt",
      "keywords": [
         {
            "name": "brazilian",
            "id": 983
         },
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "blind",
            "id": 33768
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "lgbt teen",
            "id": 163037
         },
         {
            "name": "new student",
            "id": 190101
         },
         {
            "name": "blind teenager",
            "id": 222927
         }
      ],
      "imdb_id": "tt1687221",
      "video": false,
      "title": "I Don't Want to Go Back Alone",
      "recommendations": [
         237791,
         44120,
         90839,
         31230,
         77855,
         37810,
         167153,
         191132,
         53117,
         64631,
         44125,
         69746,
         77759,
         240636,
         27091,
         42481,
         246663,
         91515,
         99043,
         26
      ],
      "backdrop_path": "/51SpFoqN7TUjeBL35vw0x9P1Q7E.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Leonardo",
               "gender": 2,
               "credit_id": "52fe4878c3a368484e0f9ed9",
               "name": "Ghilherme Lobo",
               "profile_path": "/qBU0cF43YsBNyN6u3eOubKRzuO8.jpg",
               "id": 566882,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Giovana",
               "gender": 0,
               "credit_id": "52fe4878c3a368484e0f9edd",
               "name": "Tess Amorim",
               "profile_path": "/z2lsveqsH6WeMn31mosPv1tQRzB.jpg",
               "id": 566883,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Gabriel",
               "gender": 2,
               "credit_id": "52fe4878c3a368484e0f9ee1",
               "name": "Fábio Audi ",
               "profile_path": "/k9mmzjAB6FvovYX2EaeZShGQiuy.jpg",
               "id": 566884,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4878c3a368484e0f9ee7",
               "name": "Daniel Ribeiro",
               "profile_path": "/fhZGIzEpZrLr9xrW4JQeBeUeBc5.jpg",
               "id": 115174,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4878c3a368484e0f9eed",
               "name": "Daniel Ribeiro",
               "profile_path": "/fhZGIzEpZrLr9xrW4JQeBeUeBc5.jpg",
               "id": 115174,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "59fe095ec3a36867f60238ac",
               "name": "Diana Almeida",
               "profile_path": "/22oSILGZhAJrUVLaI51bSGTMZby.jpg",
               "id": 1289679,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.425552,
      "production_countries": [{
         "iso_3166_1": "BR",
         "name": "Brazil"
      }],
      "id": 72660,
      "vote_count": 78,
      "budget": 0,
      "overview": "The arrival of a new student in school changes Leonardo's life. This 15 year-old blind teenager has to deal with the jealousy of his friend Giovana while figuring out the new feelings he's having towards his new friend, Gabriel.",
      "similar": [
         449176,
         184352,
         26280,
         222918,
         383526,
         17483,
         428493,
         377154,
         142,
         9800,
         84892,
         376867,
         398818,
         338189,
         258480,
         26933,
         26371,
         10806,
         455661,
         468
      ],
      "original_title": "Eu Não Quero Voltar Sozinho",
      "runtime": 17,
      "poster_path": "/c0dVfg5wwiYzlYl9QsmrtWiwM6d.jpg",
      "spoken_languages": [{
         "name": "Português",
         "iso_639_1": "pt"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lacuna Filmes",
         "id": 28440,
         "origin_country": "BR"
      }],
      "release_date": "2010-07-18",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.lacunafilmes.com.br/sozinho/",
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": "BRL ",
      "directors": ["Daniel Ribeiro"],
      "runtime": 17,
      "synopsis": null,
      "writers": ["Daniel Ribeiro"],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt1687221/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE1NjgyNjYyM15BMl5BanBnXkFtZTgwODk2MzYwNDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tess Amorim, Fabio Audi, Ghilherme Lobo | See full cast and crew »"],
      "reviews": [
         "Short and sweet, delicate and sensible, \"Eu Não Quero Voltar Sozinho\" (\"I Don't Want to Go Back Alone\") brings us the story of Leonardo (Guilherme Lobo), a blind teenager who develops a crush on Gabriel (Fabio Audi), a new boy in his school of whom he becomes friends, and Leonardo also deals with the jealousy of his long-time friend Giovanna (Tess Amorim) who is always taking him home, and now she's more on second plan after the appearance of Gabriel in their lives. In its 17 minutes, the short explores two diversities that hardly ever are well presented in films (specially together) and hardly ever are not targeted or labeled by societies in general: people who are blind and people who has an affection/sexual interest on someone of the same sex. The use of both diversities is very relevant in a society that tends to ignore the difference or to deplore his similar human being just because of some variations. So, here's a movie that brings a better understanding on dealing with differences and why people must be tolerant to one another, to respect their individuality's. The film succeed it in this issue but not everyone got happy with this. Here's a sad story: this awarded short was selected by the government as part of a educational/cultural film program to be presented in schools, related on how sexual diversity must be respected and all, focused on students of the same age as the ones presented in the film. So far, so good, except that one state banned the film of their schools pressed by religious groups which only heard of the film. Very sad, since no one talked more about dealing with diversities in fair terms than the current government, and hearing that one state still wants to live like 50 years ago, without evolving in their laws, moral and all is such a disappointment. Besides this controversy, this is a must see film, well acted by the young cast and the few adults on scene. It has so many surprises to make your heart beat fast at all moments. One of the most beautiful short films I've seen. I really loved this story (which is going to be made as a feature film next year) 10/10",
         "This short film exudes of young innocence that is not just adorable to watch but is also brilliantly filmed and provides a fresh perspective of blind love. The three young actors, Ghilherme Lobo (Leo), Fabio Audi (Gabriel) and Tess Amorim (Giovana), where convincingly charming, passionate and well suited for their roles. This is a story of a blind high school student Leo, who has developed an attraction for a new classmate Gabriel and the jealousy that ensues when he reveals this attraction to his platonic girlfriend Giovana. The script, written by Daniel Ribeiro is brilliantly unique, well written, simple and effective, and allows the audience to connect with Leo and his affection for Gabriel. The only downside to this short film is that it could have been longer and shown how the relationship between Leo and Gabriel progressed and the effect it would have on Leo's \"girl\" friend, Giovana. A true gem of a short film and a must see.",
         "The short film genre was always an interesting one for gay-themed short films. The appearance of the issue here feels proportionally much much higher than in full feature films. I've seen many of these short films and there were many bad ones, but this one is quite good. I don't speak a single word Portuguese and occasionally one or two things may have gotten lost in translation to the English subtitles, but it didn't hurt the overall experience in the slightest. Summary in short: Girl and blind boy are best friends. Girl may feel a bit more. New boy comes to class and becomes friends with both. Blind boy falls in love with new boy. New boy seems to reciprocate the feelings. My favorite scene was when Leo grabbed Gabriel's arm although I felt a bit sorry for Giovana becoming the third wheel. By then, everybody really should have seen what's going on. The actors here don't really appear in anything else, but finally there is good news for fans of the short film. After several years of fund-raising, it looks like the cast will come back together reprising their roles for a feature film in 2014."
      ],
      "genres": [
         "Short",
         "Drama"
      ],
      "productionCompanies": ["Lacuna Filmes"],
      "summaries": ["The arrival of a new student in school changes Leonardo's life. This 15 year-old blind teenager has to deal with the jealousy of his friend Giovana while figuring out the new feelings he's having towards his new friend, Gabriel."],
      "budget": 80000
   },
   "movielensId": 103022,
   "movielens": {
      "languages": ["Português"],
      "releaseDate": "2010-07-18",
      "dvdReleaseDate": null,
      "directors": ["Daniel Ribeiro"],
      "runtime": 17,
      "movieId": 103022,
      "title": "I Don't Want to Go Back Alone",
      "mpaa": null,
      "actors": [
         "Ghilherme Lobo",
         "Tess Amorim",
         "Fábio Audi "
      ],
      "imdbMovieId": "1687221",
      "originalTitle": "Eu Não Quero Voltar Sozinho",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["9exT3nIRfAY"],
      "plotSummary": "The arrival of a new student in school changes Leonardo's life. This 15 year-old blind teenager has to deal with the jealousy of his friend Giovana while figuring out the new feelings he's having towards his new friend, Gabriel.",
      "tmdbMovieId": 72660,
      "avgRating": 3.76056,
      "releaseYear": "2010",
      "numRatings": 71,
      "posterPath": "/c0dVfg5wwiYzlYl9QsmrtWiwM6d.jpg"
   }
}