{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "street children",
            "id": 161663
         },
         {
            "name": "evil child",
            "id": 177201
         },
         {
            "name": "killer children",
            "id": 194310
         },
         {
            "name": "mexican island",
            "id": 194311
         }
      ],
      "imdb_id": "tt2341664",
      "video": false,
      "title": "Come Out and Play",
      "recommendations": [
         212673,
         86810,
         207273,
         62472,
         108147,
         135461,
         71326,
         167673,
         149148,
         40458,
         132250,
         54116,
         264480,
         83913,
         97895,
         227172,
         118305,
         84293,
         213803,
         78411
      ],
      "backdrop_path": "/lQ8ciQJ6IfZ5f8Ja8oEVgyVhSuA.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Reno",
         "id": "57b4ff509251410a71002799",
         "content": "> An impressive title for a thriller, and, well, that's it!\r\n\r\nWell, I neither read the book, nor saw the old film. But I find this theme is very interesting and at the end of the watch I kind of disappointed. Of course it is a low budget film, which involves little kids in a bad light, but that does not mean they should completely censor the violence. I'm disappointed with those serious avoidance which very essential for a film like this. I agree the children performing such act should not be shown, but the theme was promised something and delivered nothing. On that perspective anyone would be frustrated if they came here to see a good thriller.\r\n\r\nSo you can call it a horror-thriller for the families, that's how it looks. It is the story of an American couple with the seven months pregnant visits a tourist island destination in Mexico and soon finds the town is deserted. While looking for other souls, they are targeted by those who were the reason for the scenario of the island. Then begins the run and chasing game, and how it all ends revealed with a tiny twist.\r\n\r\nAs I feared the film failed to impress me, but there might be a few who would enjoy it better than me. So all I'm saying is just skip it if you're seeking 'Hatchet' kind of film, this is no way near to that. For a 30-35 years ago film, it might have worked better, but this is an outdated story to take place in the present world. The theme was fantastic, but I just wanted a different story and upgraded with the new stuffs. Though I must appreciate the director who has done multiple task for this film to happen. Finally, I want to clear that it is not a bad film of the year or decade or ever, but just too soft for its genre, that's all.\r\n\r\n5/10",
         "url": "https://www.themoviedb.org/review/57b4ff509251410a71002799"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Beth",
               "gender": 1,
               "credit_id": "52fe4b0cc3a368484e174e21",
               "name": "Vinessa Shaw",
               "profile_path": "/jMEm0tSVH3ZSqj5iXrHUhz9oLpu.jpg",
               "id": 5025,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Francis",
               "gender": 2,
               "credit_id": "52fe4b0cc3a368484e174e1d",
               "name": "Ebon Moss-Bachrach",
               "profile_path": "/ur1xAkenuiahTeQ8cIo20hwAvnm.jpg",
               "id": 21042,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "The Man",
               "gender": 2,
               "credit_id": "52fe4b0cc3a368484e174e19",
               "name": "Daniel Giménez Cacho",
               "profile_path": "/vIelVvfHTvmnwTIpOMzVTLCORma.jpg",
               "id": 1603,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4b0cc3a368484e174e31",
               "name": "Gerardo Taracena",
               "profile_path": "/mZhY59OxD5sy4uHkzG9EOwEkvDb.jpg",
               "id": 17689,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e35",
               "name": "Alejandra Álvarez",
               "profile_path": null,
               "id": 1157731,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e15",
               "name": "Makinov",
               "profile_path": null,
               "id": 1085910,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e27",
               "name": "Juan José Plans",
               "profile_path": null,
               "id": 133005,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e2d",
               "name": "Makinov",
               "profile_path": null,
               "id": 1085910,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e3b",
               "name": "Makinov",
               "profile_path": null,
               "id": 1085910,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e41",
               "name": "Makinov",
               "profile_path": null,
               "id": 1085910,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b0cc3a368484e174e47",
               "name": "Makinov",
               "profile_path": null,
               "id": 1085910,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54b3a0ecc3a3687a63000478",
               "name": "Jorge Juarez Horta",
               "profile_path": null,
               "id": 1412599,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "54b3a1039251417369002162",
               "name": "Gerardo Manjarrez",
               "profile_path": null,
               "id": 1412600,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "54b3a11b92514107e00052b0",
               "name": "Rodrigo Amoroz",
               "profile_path": null,
               "id": 1409835,
               "department": "Crew",
               "job": "Picture Car Coordinator"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 5.263345,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 127884,
      "vote_count": 40,
      "budget": 0,
      "overview": "A couple take a vacation to a remote island - their last holiday together before they become parents. Soon after their arrival, they notice that no adults seem to be present - an observation that quickly presents a nightmarish reality.",
      "similar": [
         341006,
         10185,
         294963,
         24920,
         381288,
         588,
         19204,
         23730,
         923,
         241927,
         434873,
         273477,
         9373,
         769,
         10781,
         36647,
         1690,
         948,
         60304,
         170
      ],
      "original_title": "Come Out and Play",
      "runtime": 87,
      "poster_path": "/Wsz4F4HaI1GzQdJ4ZG6MZpODaA.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Canana Films",
            "id": 1719,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Videocine S.A. de C.V.",
            "id": 17024,
            "origin_country": ""
         }
      ],
      "release_date": "2012-09-13",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Come out, come out, wherever you are.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": "MXN ",
      "directors": ["Makinov"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Makinov",
         "Juan José Plans"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2341664/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNjIwMTcwNF5BMl5BanBnXkFtZTcwMTQ1ODIxOQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ebon Moss-Bachrach, Vinessa Shaw, Daniel Giménez Cacho | See full cast and crew »"],
      "reviews": [
         "Come Out and Play is basically a carbon copy of the original 1976 film Who Can Kill A Child? It was a lazy remake that didn't even try to attempt something different with the concept or reinterpret it. The film is a retread and a missed opportunity to breath new life into the killer kids subgenre. The film still manages to capture the unsettling dread, suspense, mysterious and creepy atmosphere and terrifying helplessness that made the original effective. The musical score was intense and heart pounding and made you feel like you were watching a living nightmare captured on celluloid. The elements that made it watch able is that the premise is still creepy and disturbing and the story is still effective and shocking. Come Out and Play is in the end though just another pointless remake with nothing remotely new to show or say. The performances were solid for the most part but I thought the script was pretty weak with underdeveloped characters. The two leads were likable and did their best with little that they were given, but they just played the typical, token stranded tourists that waited too long to get the hell out of there. Ebon Moss-Bachrach and Vinessa Shaw play parents to be Francis and Beth, who take one last vacation before Beth is due to give birth to their child. They make a trip to a secluded island and realize too late that all of the adults are missing and the children left behind. The doomed couple soon discovers that the children are homicidal maniacs, with no explanation of how they got that way. We as viewers are just as baffled as the couple and there wasn't even a hint to how the children got that way. I think the main stars are talented performers, but are wasted here as the lackluster script raises more questions than answers. Director, Makinov pretty much cut and paste here with no inspiration behind the proceeding. He knows the basics of a horror movie but weren't inventive with the elements; as a result there wasn't any moments of surprise because if you've seen the original you know the outcome. The director brought nothing new to the story. Overall, it's an uninspired remake that's too faithful to the original and you might as well just rent the original because it's exactly the same right down to the ending. Both give effective chills, but there is no good reason for this remake to exist. Still there are far worse out there.",
         "When I saw that \"Who Can Kill a Child?\" was re filmed, I was optimistic. Despite its flaws, the 1976 movie was a chilling tale full of opportunity for a well made remake in the hands of a good director. Well, Makinov instead of trying to add something new, repeat the movie almost frame by frame. While he seems to be a good director, the kids in this movie are way less spooky than the older one, and the violence is way more edited, you barely see something. While the lead actor does a good job, the end is less meaningful because the kids are not that cool and the kills are way too boring. You don't see a damn thing. A great opportunity to do something new was wasted, but I hope that Makinov (a creepy guy with a red mask) does better movies in the future. He does have good hand, he just need risk a little more.",
         "For me the key ingredient to a successful horror movie is when the lead character/s behave intelligently when placed in a dire situation. I'm sure when most people watch horror movies they find themselves asking 'what would I do?'. A really good horror therefore tries to let its lead characters explore the options (when given a dire situation) that any sane person that wants to remain alive would explore. There is then also the question of what you would do to keep your loved ones safe when they are threatened. Again I'm sure most people would make decisions that put their loved ones safety before their own. Herein lies the biggest problem with this movie. Within the first 20 minutes any normal person would have figured out that the island wasn't safe and tried to make a quick exit. Of course our ultra-unrealistic protagonists do not. Instead they wander around looking for a store and enter the most uninviting hotel I've ever seen. From there it only gets worse as the male lead seems to have absolutely no concern at all for his pregnant wife's safety. He leaves her on many occasions in a town full of killers and on one with a man who attacked him only five minutes previously while he wanders off into the dangerous town again. The couple make so many ridiculous decisions that at one point I just wanted them to be captured and put out of their misery as anyone that stupid doesn't really deserve to survive as situation such as this. Harsh? Maybe but watch it for yourself and you will be equally frustrated with it as I was. A real shame as the premise was actually quite scary and to be fair the acting/directing was not terrible. You just felt nothing for the lead characters as they displayed absolutely no will to live and fight for their lives. Please give us horror movies that will actually scare us!",
         "Writer, Director, Producer, Cinematographer, and even Sound department, are the many hats worn by this Mononymous film-maker - Makinov, who prominently features his/her name in the title and at the end of the film so boldly as if their fame had already exceeded their talent (think Cher, Beck, Bono, Prince, or even Sting). That was the first laughable moment in this (first) film from the artist known as Makinov. But the (unintentional) laughs didn't stop there. The film begins with Ebon Moss-Bacharach's character searching, somewhat desperately, late at night for a boat to rent. He and his pregnant wife, played by Vinessa Shaw, are trying to get to a nearby island, for who knows why. After a long and tedious search, he finds a drunk fisherman reluctantly willing to part with his 15 foot row boat with an outboard motor, which, by the way, he uses daily for his work. After some less than shrewd negotiation, our hero offers the guy four thousand dollars (what?!?) for the use of his dinghy for a day. As an aside, it's worth mentioning that while the two leading actors are clearly not A-list performers, they do bring face recognition, if not name recognition to the film. They are recognizable and have faces you know, but can't quite place. They're decent enough actors, and typically play supporting roles quite well. In \"Makinov's Come Out and Play,\" however, they stumble around woodenly upon arriving to this island, which appears to be all but deserted, minus the odd child or two they run into, as they search for food and lodging. They deliver their lines well enough, but the direction is terrible, as there are long awkward pauses, and odd reactions that seem inappropriate for the scene. It takes some 35 minutes for our clueless couple to realize that there is something amiss, and come to realize the children have all gone bad (again for who knows how and why... which is never explained) and are wantonly slaughtering any adult in their paths, using chopped up body parts as footballs, necklaces, and other assorted toys. Mind you, there is not a child to be seen over the age of 13, most averaging 7-10 years old. We're talking tiny, wee kids, who somehow have the strength to bash down doors, chop through flesh and bone, and cart off struggling fully grown adults. After 40 minutes or so of our unlikely heroes running around aimlessly, painfully, and without any urgency to get off this Lord of the Flies island, Makinov provides us with an ending with a \"twist,\" if you can call it that. It's obviously meant to be shocking, but instead evokes laughter once again. Throughout this entire disaster though, there is somehow a fleeting twinge of anxiety and suspense. At first I couldn't put my finger on what could cause this tension. It surely was not the dialogue, nor the story-line, or the uninspired, single-shot camera work. I finally pinned it down to the music. Makinov did, actually, get one thing right it would seem. The delicate use of crescendos and diminuendos, notes that would as easily have accompanied Hitchcock's Psycho, created this dramatic tension throughout his film, albeit with a retro, 70's style sound, but well done none-the-less. As the final credits rolled, the screen filled with our Mononymous (A Film By) Makinov, I was dumbstruck that I could only muster a single word to describe what I had just saw, the lonely adjective looming as large in my mind as Makinov's moniker hung on the screen before my eyes, and I muttered aloud..... Awful! -- One star for the clever music, but otherwise, this film was nothing more than a big fat zero in my book. It is definitely one to be avoided, as an hour and a half spent chewing your own toenails would be more productive and thought provoking.",
         "What a waste of time and money to remake a film exactly like the first one..!!! Especially when the original wasn't even exactly a big hit... duh .. If you had planned on expanding, adding or enhancing it,,then yes otherwise what was the point ? The two main leads like the original were basically brain dead from the start. Nothing they did or came up with made any sense. And to add they were not even likable.. The premise that a pregnant woman can not exert some energy without endangering the child is also ancient crap... I know pregnant women that jog, exercise, dance and work right up to the 9th month.. Only reason I gave this steaming pile of manure a 2 instead of a 1 was the island scenery made me feel warm on a cold day...",
         "I really wanted to like this remake of Spanish cult classic, Who Could Kill a Child (1975) AKA Island of the Damned. However the movie is so flat it becomes hard to sit thru since I knew the outcome from the very beginning. As for the acting? There was a reason the female lead of the original, Prunella Ransome, won the Best Actress award from the Sitges International Horror Film festival. Oh well, if you never saw the original, you might like this thriller. Keep in mind, it's not as fast paced as most recent horror thrillers. You might enjoy the build-up. Better yet, look for the original on The Dark Sky DVD label. Then you will see true fear.",
         "Due to the location, great natural lighting and local atmosphere (wherever it was filmed) Come out and Play opens up well, these elements bring some nice cinematography and all said and done the cast is pretty strong - almost reminiscent of Monsters. The opening act left me with a drawn in feeling and I was impressed by this as I felt that holiday fish out of water sympathy for the characters as well as the great scenery making me want one. The two lead roles are taking a holiday island hopping in South America it would seem. All good although that voice in the back of the head begins with the 'what are they thinking the woman is heavily pregnant' - however the wonderful scenery and easy gait of the cast lull us along in this strange island where the adults are strangely missing and children are spotted here and there. This is a promising start for a sensible movie. There is an obvious homage to movies of the genre of yesteryear and this has certainly been done before, however this homage veers into replication of movies of yesteryear as the film progresses and ultimately unravels. This unraveling is the script as the film progresses the turn of events and characters simply get further into the realms of the silly. By the end I was drawing comparisons to The Island of Death - if you haven't seen the most banned movie of all time I can only recommend it as singularly the most bonkers movie I have ever watched, even more so because the makers seemed to take it seriously and they were all baked to the eyeballs obviously. Come out and Play doesn't match the grandeur of The Island of Death whose bonkerness is classic status however - I can suspend disbelief for a Sci-fi psychic link hive mind children idea, however as the script has actors simply perform actions that are silly - why does he keep leaving his heavily pregnant wife alone. They also meet a lady on the other side of the island whose not affected yet not even one mention of the savage children and everybody else dead? They also end up locking themselves in a pretty silly place then there's 'That Scene'. By this point I had gone through pretty much most emotions including hoping these protagonists would simply bite the dust and arrived at 'well this is just ridiculous' and reminiscing about The Island of Dead that did bonkers right proper. Taken as a homage to Who could Kill a Child with to be honest the same kind of script ham fistedness that existed in the seventies that deals its allegory with hammer smacks and little nuance this could be enjoyed however absolutely no modern take or contemptory flair is employed in the process. Making this, including the awful music a step into filming past and not necessarily in a good way.",
         "Seeing all the uneducated reviews its time someone with a bit of style added his review! Right , the reason everyone is criticizing this is because they are comparing it to some old film thats a cult classic, I've not seen it and my guess is this is better and you just have people with nostalgia reviewing. For me it's good , stylish , well filmed, well acted and very spooky. The film is edgy with a good pace and kept me wondering what was going to happen. Kids in the film were freaky and had me thinking ... God just go fully mentol and kill all the little things , but hey that's me. I def think this is a good watch , there's so much crummy horror out there and this is a real cut above all the nonsense. Can't believe there's loads of rubbish reviews for this , I watch every horror and I know my stuff , this is a great film and if you want something a little diff ( it's Spanish ) then it's a good film. Great ending also.",
         "We knew that already didn't we? Seriously though: The movie tries to not pull any punches but does fall back on some horror movie clichés where the viewer will not be able to stop shaking his head. Now I haven't seen the original movie, but the concept itself is not completely original anymore anyway. You don't have a big cast (if you don't count the many kids that are in this) so therefor it is very important to stay/stick with the few you have on board (no pun intended). But unfortunately they never really strike you or have you root for them. It's unfortunate because the journey they take and the allegories they try to play out never really fulfill their goal",
         "This is one of those movies that from the beginning you wonder what is the point. First of all the husband character is one of those guys that seemingly want to impress his wife with his \"I'm a man\" abilities. He acts like a man who is trying to impress a new paramour. The woman, OMG, his wife set womanhood back a hundred years. She is unlikable. AT one point he leaves her and tells her. I will be right back. If you see anyone just scream. Oh yeah that will help. The man, OMG, he's one of those foreigners that go to another country and think because he can speak the language he's a native. He rudely insinuates himself through the entire movie. Everywhere he goes he makes himself at home before they are invited to do so. As most American stupidly do. Secondly, I don't understand why this island was so important for him to visit. Had he been there before? Heard about it from a friend? Also, when you go to an island that already is unfriendly with the kid fishing when continue into an empty city, doing things as if nothing is wrong when obviously nothing is right so far? You've seen nothing but 2 kids. You stole from a restaurant and no one comes out to collect your money. You get what you want out of a grocers and no one stops you. You go to a hotel and go behind the desk and no one comes out and tell you don't to do that or a \"Excuse me butt hole, but you can't do that. You walk into people home and go through their stuff. If anyone was alive he would have been dead within the first 10 minutes of snooping. Monotonous. Is a good word for this film and another good thing about this film is every man and woman should see it before having children."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Canana",
         "Videocine S.A. de C.V."
      ],
      "summaries": [
         "Beth (Vinessa Shaw) and Francis (Ebon Moss-Bachrach), a young married couple, are on holiday together when they venture to a beautiful, but highly remote, island. Beth is pregnant and the two are hoping to enjoy their last vacation before their baby is born. When they arrive, they notice that while there are plenty of children present, the adults all seem to be missing. Initially attributing this to the after effects of a recent festival, they quickly realize something far more sinister is afoot. The two will face terror and unsettling difficult decisions in their quest to make it off the island alive.",
         "A couple take a vacation to a remote island - their last holiday together before they become parents. Soon after their arrival, they notice that no adults seem to be present - an observation that quickly presents a nightmarish reality."
      ],
      "budget": 12000000
   },
   "movielensId": 103008,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2012-09-13",
      "dvdReleaseDate": "2013-03-22",
      "directors": ["Makinov"],
      "runtime": 87,
      "movieId": 103008,
      "title": "Come Out and Play",
      "mpaa": "R",
      "actors": [
         "Vinessa Shaw",
         "Ebon Moss-Bachrach",
         "Daniel Giménez Cacho",
         "Gerardo Taracena",
         "Alejandra Álvarez"
      ],
      "imdbMovieId": "2341664",
      "originalTitle": "Come Out and Play",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["OCigbK1I0y0"],
      "plotSummary": "Beth (Vinessa Shaw) and Francis (Ebon Moss-Bachrach), a young married couple, are on holiday together when they venture to a beautiful, but highly remote, island. Beth is pregnant and the two are hoping to enjoy their last vacation before their baby is born. When they arrive, they notice that while there are plenty of children present, the adults all seem to be missing. Initially attributing this to the after effects of a recent festival, they quickly realize something far more sinister is afoot. The two will face terror and unsettling difficult decisions in their quest to make it off the island alive.",
      "tmdbMovieId": 127884,
      "avgRating": 2.875,
      "releaseYear": "2012",
      "numRatings": 12,
      "posterPath": "/Wsz4F4HaI1GzQdJ4ZG6MZpODaA.jpg"
   }
}