{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "village",
            "id": 5331
         }
      ],
      "imdb_id": "tt0051151",
      "video": false,
      "title": "The Vampire",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Dr. Enríquez",
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149db5",
               "name": "Abel Salazar",
               "profile_path": "/x9fEZNB9hfcFOpNCLMAA4yXNTXw.jpg",
               "id": 107288,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Marta González",
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149db9",
               "name": "Ariadna Welter",
               "profile_path": "/nnrc6DwYhANz6Bp7j2OnrZOrXNL.jpg",
               "id": 177785,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Eloisa",
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149dbd",
               "name": "Carmen Montejo",
               "profile_path": "/5QCPtR7IM0UIebkNRLmBnPUTyQD.jpg",
               "id": 1032548,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Emilio",
               "gender": 2,
               "credit_id": "52fe4a45c3a368484e149dc1",
               "name": "José Luis Jiménez",
               "profile_path": null,
               "id": 106086,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "María",
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149dc5",
               "name": "Mercedes Soler",
               "profile_path": null,
               "id": 940934,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "María Teresa",
               "gender": 1,
               "credit_id": "52fe4a45c3a368484e149dc9",
               "name": "Alicia Montoya",
               "profile_path": "/lugva7YkTki4o14BXnbAr49uA0J.jpg",
               "id": 590516,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Count Karol de Lavud / Duval",
               "gender": 0,
               "credit_id": "552f0907c3a3685da60006b6",
               "name": "Germán Robles",
               "profile_path": "/4xuDWo4xAP9y9NpsI0lPnIWjZJ0.jpg",
               "id": 100322,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149d99",
               "name": "Fernando Méndez",
               "profile_path": null,
               "id": 1027099,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149d9f",
               "name": "Ramón Obón",
               "profile_path": null,
               "id": 1028485,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a45c3a368484e149dab",
               "name": "Abel Salazar",
               "profile_path": "/x9fEZNB9hfcFOpNCLMAA4yXNTXw.jpg",
               "id": 107288,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55dabeb6c3a36832070069ce",
               "name": "Ramón Rodríguez",
               "profile_path": null,
               "id": 1499935,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "571ef194c3a368352f001504",
               "name": "Rosalío Solano",
               "profile_path": null,
               "id": 31317,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 1.159876,
      "production_countries": [{
         "iso_3166_1": "MX",
         "name": "Mexico"
      }],
      "id": 120303,
      "vote_count": 5,
      "budget": 0,
      "overview": "A pretty young Mexican girl returns to her hometown to make funeral arrangements for her beloved aunt, who has just died. Soon she begins to hear disturbing stories about the town being infested by vampires, and she eventually begins to suspect that her remaining aunt and the mysterious next-door neighbor may be involved.",
      "similar": [
         7131,
         138,
         6404,
         22440,
         36647,
         36648,
         6114,
         49017,
         277,
         8698,
         12437,
         628,
         755,
         252171,
         653,
         24021,
         76492,
         159824,
         8329,
         924
      ],
      "original_title": "El vampiro",
      "runtime": 95,
      "poster_path": "/clpcwdSrFJlwScaV3xRdmNmgNZo.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cinematográfica ABSA",
         "id": 20974,
         "origin_country": ""
      }],
      "release_date": "1957-10-04",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Paul Landres"],
      "runtime": 75,
      "synopsis": "Just before Dr Matthew Campbell [Wood Romoff] dies, he passes on the product of his long years of animal research to Dr Paul Beecher [John Beal] . \"It's the pills,\" he whispers. When Beecher gets a migraine, his daughter Betsy [Lydia Reed] mistakenly gives him one of the pills. That night, Beecher sleeps soundly but Marion Wilkins [Ann Staunton] is bitten by a vampire. When she is examined the next morning by Beecher, she gets hysterical and has a heart attack. Dr Will Beaumont [Dabs Greer] comes from the university to investigate Campbell's work. He knows only that it involved base instincts and some sort of addicting pills that change the brain chemistry after only one dose. The pills must then be taken every 24 hours or the 'animal' goes crazy. More people begin to die. They all have two puncture wounds on their throats and appear to have died from 'capillary destruction'. Sheriff Buck Donally [Kenneth Tobey] gets suspicious and exhumes the bodies only to find them in a severe state of 'cellular destruction'. Some virus, apparently introduced by the neck wounds, is eating their tissue. Beecher suspects himself. He asks nurse Carol Butler [Coleen Gray] to keep him company one night but gets called away to surgery. At 11pm, he transforms into an ugly caricature of himself. He follows Carol home but she gets away. The next night he stays with Beaumont but, when Beaumont takes away the pills, Beecher goes crazy and kills him. The next morning, Beecher decides to kill himself. Carol shows up early for work and tries to stop him. When they fight, Beecher transforms. He pursues Carol into the forest; Donally pursues them both. Beecher is shot 3 times by the deputy as he struggles with Donally. [Original synopsis by bj_kuehl]",
      "writers": [
         "Pat Fielder",
         "Pat Fielder"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051150/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2ODM5NjE3Nl5BMl5BanBnXkFtZTcwNTkyMDQ1MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: John Beal, Coleen Gray, Kenneth Tobey | See full cast and crew »"],
      "reviews": [
         "This obscure 1957 horror movie has been overlooked as far as I am concerned. It has an interesting twist to the \"man turns into bloodsucking monster\" premise. John Beal plays a kindly small town doctor who turns into a vampire after accidentally ingesting pills that a deceased scientist had invented and had been experimenting on with vampire bats (the winged variety!) before he died. 1950's horror stalwart Kenneth Tobey portrays the granite-jawed town detective who is investigating a sudden rash of mysterious deaths in the town. Colleen Gray is the requisite pretty love interest/possible victim. Although the vampire make up is pretty hilarious and not at all scary, there are some scary moments in the movie and all in all shouldn't be missed, especially if you are a lover of the old \"drive-in\" horror movies of the 1950's.",
         "Typical little 50's horror film that I found a little talky and the premise a little far fetched. John Beal is fine as the doctor who turns into a vampire. The main complaint I have towards this film is that is it really a vampire? He's more like a beast or a neanderthal. But I guess thats the films unique interpretation of what a vampire would be like. The cast is great! Kenneth Tobey from \"The Thing\" and Coleen Gray from \"The Wasp Woman\". And of course Dabbs Greer who has been in countless roles. What a consummate character actor he is. The most gruesome scene in the film is when the vampire stuffs Greer in the furnace and his legs dangling out. Tobey as a cop really is not the smartest police officer portrayed on film but Gray is pretty sexy. This certainly is not a classic horror film but its adequately made with a terrific cast and does have some genuine moments in it.",
         "Dr. Paul Beecher, a respected small-town physician and all-around nice guy, ingests some mysterious pills given to him by his annoying daughter. It seems the li'l brat has foolishly mistaken them for his migraine medication! After Beecher develops a chemical dependency for the drug, he slowly realizes that he was responsible for a series of bizarre murders committed while he was under the influence of these pills. Apparently, these harmless-looking tablets have the power to make their user mutate into a hairy, bloodthirsty vampire at nightfall, leaving him with no recollection of what he has done after the effects have worn off. How could these pills be so powerful? Easy! Because they contain a chemical extracted from a vampire bat!! This fun, fast-paced horror flick was made in that classic monster-movie style that we have all come to love, yet at the same time it has some very unique and clever twists. The vampire, who is played excellently by John Beal, really looks nothing like you'd expect. Rather than having the bloodsucker portrayed as the standard well-dressed, intelligent, and graceful DRACULA lookalike, THE VAMPIRE depicts him as a hairy, ugly, clumsy beast who ambles aimlessly after his targets. In my opinion, the interpretation of a vampire as being angry, primitive, and relentlessly brutal is much more frightening than the notion of a slick, attractive, intellectual vamp. The characters in this film are eccentric, likeable, and very well-acted; and the special effects, although simple and outdated, are surprisingly effective. Despite the fact that THE VAMPIRE's story may contain a few glaring inconsistencies, it still succeeds as a suspenseful yet down-to-earth creature feature.",
         "John Beal seems genuinely agonized in the title role. He is a well liked small-town doctor, who has got hold accidentally of pills that -- don't ask! -- turn him into a vampire. This is crisply filmed and Beal shows the pain of a decent man who knows something is wrong and suspects something is very wrong with himself. I wonder if this was strictly a drive-in movie or if anyone at the time recognized its merits.",
         "The film begins with a nice town doctor being called to the lab or a strange chemist who is dying. It seems that the chemist has developed something that he considers important but when the nice doctor arrives, the dying chemist mentions some pills he created and then dies. What these pills are for, the doctor has no idea but he sticks them in his pocket. Later, when the doc has a headache, he accidentally takes one of these pills and it makes him into a blood-sucking monster with really lousy makeup. While it's obvious that United Artists did not break the bank to make this film, despite its low price tag, it was reasonably interesting and is worth a peek to horror fans. Sophisticated patrons will most likely find the whole thing rather silly, but what sort of sophisticated or snobby viewer would watch a film like this in the first place?",
         "A small town doctor (John Beal) mistakenly ingests an experimental drug made from the blood of vampire bats which transforms the kindly medic into a bloodthirsty monster. I really enjoyed this movie a lot. Great plot, great acting and a very interesting looking monster. There is some odd sexism present (the doctor apparently cannot do his own laundry or cook so he has his 10-year old daughter do it for him). But, hey, it is the 1950s. Not much to say beyond that. I was a bit confused on whether the pills brought on the monster or kept it in check. It seems like pills or no pills the monster was going to kill someone, but maybe I was just confused.",
         "JOHN BEAL is the central character as a Dr. Beecher whose daughter inadvertently gives him pills extracted from a control serum for bats. COLEEN GRAY is his pretty nurse and KENNETH TOBEY a Sheriff who begins to suspect there's something wrong about a couple of deaths ruled as heart attacks. The suspense builds slowly from the very beginning as the credits unfold over the scene of a newspaper boy discovering an ill doctor in an old mansion. As the story progresses, it's easy to see that the script is way above average in the horror department with dialog that's sensible, concise and always on track. Beal's haggard appearance helps him to be more convincing than usual in the role of the tormented doctor victimized by the wrong pills. Although it's a variation on the vampire theme, there's a trace of Dr. Jekyll/Mr. Hyde in the way the screenplay develops. Summing up A rational vampire thriller that passes the time quickly and is fun to watch.",
         "This is a movie that I hunted down for quite some time. A small-town doctor accidentally takes some pills developed by one of his patients that turns him into a vampire. He begins picking off the local town folk. While the editing is clumsy, the premise is a novel change from the usual vampire fare. The cast includes veteran actors John Beal, Coleen Gray (The Leech Woman), Dabbs Greer, Herb Vigran (Adventures of Superman), Paul Brinegar (How To Make A Monster) and an uncredited cameo by Louise Lewis (I Was A Teenage Werewolf; Blood Of Dracula). For those of you who don't think 50s films scare you, get ready for the scene following Carol and Paul's date at the restaurant. Believe me, it packs a punch!",
         "Dr. Campbell is a sick man. Just before he dies, he gives a bottle of tablets to Dr. Paul Beecher (Paul Beal). Quite by accident, Paul takes one of the pills thinking it's his migraine medication. The pills were part of Dr. Campbell's work on mind regression to a more primitive state and were made from the blood of the vampire bat. Paul immediately becomes addicted to the pills and begins taking one each night. Coinciding with Paul addiction, people in town begin dying mystery deaths. Each has strange bite marks on their necks. Paul begins to suspect himself, but surely Paul's suspicions can't be true. Are the pills turning him into some kind of vampire? While I don't think it's quite as good as his later film The Return of Dracula, Paul Landres' The Vampire is still a solid little horror film that takes much of the existing vampire mythology and stands it on its head. For example, the creature in The Vampire isn't the suave, cape-wearing, seducer that we've all become familiar with over the years. Here, the creature is a primitive being that seeks blood for survival. It is more bat-like in appearance and action. I'm not saying that one interpretation is better than the other, I just appreciate the difference. There's a lot to like about The Vampire. I love the way the film introduces an element of horror into an otherwise safe and comfortable Leave It to Beaver type setting. The contrast is interesting. And I for one appreciate the make-up effects. I realize they were done \"on the cheap\", but I found them very eerie. Landres direction is solid. He keeps things interesting without a lapse during the movies runtime. But the area I find the most enjoyable in The Vampire is the acting. Everyone involved gives a performance far better than you would expect from a film of this type. As others have noted, Paul Beal gives real outstanding first-rate performance. Overall, The Vampire is a very satisfying film. I look forward to revisiting it for years to come.",
         "I continued my winter horror film viewings today with 'The Vampire'. A more descriptive name for it might have been 'Dr. Jeykll and The Vampire' or 'The Vampire Virus'. I'm kidding of course, yet it does borrow heavily from the Jeykll and Hyde story. Here a kindly small town Dr. accidentally takes an experimental drug. He becomes addicted to it. Each night at about 11PM it causes him to change into a hideous creature with a taste for blood. I thoroughly enjoyed this one. It's right down my alley. The kind of movie that must have been shown on double features at 50s drive-ins. I can imagine it playing with 'Frankenstein's Daughter' on the marquee. Teenage boys probably loved it cause their girl would want to be hugged tight during the show. These horror films have a special place with me, they bring back childhood memories. I was too young to have seen it at theaters during its first run. It was the sort of movie I'd watch on the late night horror shows in the 60s and early 70s. Yet, I some how missed ever catching this gem. It's the type of late night movie my mom would complain \"You're going to have nightmares if you watch that !\". Of course I would watch it anyway if I could. The feature monster had silly yet scary makeup that looks like the boogeyman kids imagine in the bedroom closet. Kenneth Tobey gets a chance to once again hunt down the monster like he did in 'The Thing'. He makes a good no nonsense type tough-guy any self respecting monster should hide from on site. My only regret was we didn't wait till after dark to watch it. That would have been more fun than an afternoon viewing. If you are a fan of 50s drive-in horror films, and I sure am, you should love this. I give it a 6 out of 10 rating."
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Gramercy Pictures (II)"],
      "summaries": [
         "Dr. Matthew Campbell has been experimenting on methods to regress the mind to primitive instincts so that we can find methods to improve our brains and not get taken in by cheap horror movie hogwash. He's developed a drug made from vampire bat blood and has begun treating himself with it. But instead of improving his mind, he's become ill and addicted. He dies, but not before trying to warn fellow doctor Paul Beecher. Fortunately for us, he dies before he can say more than that pills are to blame. While still at Campbell's house, Paul finds a bottle of pills and pockets them. He's also got another bottle of pills in his other pocket that he takes for frequent migraine attacks. He goes home, puts his jacket on a rack, and then he's struck with a migraine. He asks his daughter to give him the pills in his jacket pocket, and of course she gives him the pills of evil. He is instantly addicted and he must take one pill every day. Each time he takes a pill he turns into a hairy and very insane killer, and he doesn't remember what he's done, except as a vague dream. Can the police and the other scientists who work nearby figure out who the killer is and stop him before he kills the beauteous new nurse that he has just hired?",
         "A small town doctor mistakenly ingests an experimental drug made from the blood of vampire bats which transforms the kindly medic into a bloodthirsty monster."
      ],
      "budget": 115000
   },
   "movielensId": 103324,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1957-06-01",
      "dvdReleaseDate": "2005-10-25",
      "directors": ["Paul Landres"],
      "runtime": 75,
      "movieId": 103324,
      "title": "The Vampire",
      "mpaa": "",
      "actors": [
         "John Beal",
         "Coleen Gray",
         "Kenneth Tobey",
         "Lydia Reed",
         "Dabbs Greer",
         "Herb Vigran",
         "Hallene Hall",
         "Paul Brinegar",
         "Raymond Greenleaf",
         "Ann Staunton",
         "James Griffith",
         "Wood Romoff",
         "Brad Morrow",
         "Mauritz Hugo",
         "Anne O'Neal",
         "Louise Lewis",
         "Arthur Gardner"
      ],
      "imdbMovieId": "0051150",
      "originalTitle": "The Vampire",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "A small town doctor mistakenly ingests an experimental drug made from the blood of vampire bats which transforms the kindly medic into a bloodthirsty monster.",
      "tmdbMovieId": 120303,
      "avgRating": 2.25,
      "releaseYear": "1957",
      "numRatings": 4,
      "posterPath": "/gsvgniwtBym7lEJ89oltIunPie8.jpg"
   }
}