{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "talent",
            "id": 2276
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "boss",
            "id": 5306
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "rivalry",
            "id": 9823
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "advertising",
            "id": 15086
         },
         {
            "name": "humiliation",
            "id": 33740
         },
         {
            "name": "drunk",
            "id": 40879
         },
         {
            "name": "agency",
            "id": 201911
         }
      ],
      "imdb_id": "tt1829012",
      "video": false,
      "title": "Passion",
      "recommendations": [
         9280,
         18530,
         7983,
         9993,
         240881,
         214096,
         16005,
         150229,
         105531,
         94623,
         176079,
         15711,
         214069,
         50555,
         84355,
         275696,
         177552,
         37414,
         137566,
         10319
      ],
      "backdrop_path": "/a8VBIEbwhn7hEjIJU0vMOJibqNV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Christine Stanford",
               "gender": 1,
               "credit_id": "52fe4aaac3a36847f81db57b",
               "name": "Rachel McAdams",
               "profile_path": "/wqSznVIPp0YDFCuZ9jjbrzDyJhV.jpg",
               "id": 53714,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Isabelle James",
               "gender": 1,
               "credit_id": "52fe4aaac3a36847f81db57f",
               "name": "Noomi Rapace",
               "profile_path": "/xllWXMaKlPSQ9LUkG9niugX8vOx.jpg",
               "id": 87722,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Dani",
               "gender": 1,
               "credit_id": "52fe4aaac3a36847f81db587",
               "name": "Karoline Herfurth",
               "profile_path": "/8HVqhIaLQA3MOTO88Ncn6VOCzdp.jpg",
               "id": 17067,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Dirk Harriman",
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db583",
               "name": "Paul Anderson",
               "profile_path": "/fHLtf1RvQ2i6ZudyL0WRwmEeTxv.jpg",
               "id": 220448,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Inspector Bach",
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db58b",
               "name": "Rainer Bock",
               "profile_path": "/ebmPZimivfRFKYnKp2ygazkJO9r.jpg",
               "id": 65054,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Prosecutor",
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db5a3",
               "name": "Benjamin Sadler",
               "profile_path": "/9c9zOtcZOqB6v4WLXliqQtrwBt2.jpg",
               "id": 27419,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "J.J. Koch",
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db59f",
               "name": "Dominic Raacke",
               "profile_path": "/rHMHhPaIjjJHa0IL3KpukJ1vtcV.jpg",
               "id": 32822,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db59b",
               "name": "Ian T. Dickinson",
               "profile_path": null,
               "id": 40678,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Usher Theatre",
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db597",
               "name": "Frank Witter",
               "profile_path": "/71Jh7rDJudHWRBMhhSQHtDnepMg.jpg",
               "id": 550026,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Woman in Elevator",
               "gender": 1,
               "credit_id": "52fe4aaac3a36847f81db58f",
               "name": "Leila Rozario",
               "profile_path": "/wD1A1uKpN50fgKk3ess3otL2BVp.jpg",
               "id": 1045497,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Concierge",
               "gender": 0,
               "credit_id": "52fe4aaac3a36847f81db593",
               "name": "Alexander Yassin",
               "profile_path": "/gnB8XCSUbGqi1JCqj7IR3tYedUK.jpg",
               "id": 147642,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db56b",
               "name": "Brian De Palma",
               "profile_path": "/zTbQGFu5udsrX2i7BgmTgB0aJ1E.jpg",
               "id": 1150,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db571",
               "name": "Brian De Palma",
               "profile_path": "/zTbQGFu5udsrX2i7BgmTgB0aJ1E.jpg",
               "id": 1150,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db577",
               "name": "Saïd Ben Saïd",
               "profile_path": "/iv3BT0Fw8wFpZu4AAo4ErE7xI9A.jpg",
               "id": 53206,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db5af",
               "name": "Alain Corneau",
               "profile_path": "/b9VqEi4uzMBkuxM9Ys0tNlPn0iV.jpg",
               "id": 35927,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db5b5",
               "name": "Pino Donaggio",
               "profile_path": null,
               "id": 14138,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db5bb",
               "name": "José Luis Alcaine",
               "profile_path": null,
               "id": 4376,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aaac3a36847f81db5c1",
               "name": "François Gédigier",
               "profile_path": null,
               "id": 6794,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4aabc3a36847f81db5c7",
               "name": "Cornelia Ott",
               "profile_path": null,
               "id": 40752,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aabc3a36847f81db5cd",
               "name": "Anja Dihrberg",
               "profile_path": null,
               "id": 25755,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "54099c6b0e0a263a0a001883",
               "name": "Karen Muller Serreau",
               "profile_path": null,
               "id": 1169246,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57ab0674c3a36827b40003ce",
               "name": "Nathalie Carter",
               "profile_path": "/yo80M2BecNXFMIv4uPccThh52bm.jpg",
               "id": 84473,
               "department": "Writing",
               "job": "Original Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.866616,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 109099,
      "vote_count": 178,
      "budget": 30000000,
      "overview": "The rivalry between the manipulative boss of an advertising agency and her talented protégée escalates from stealing credit to public humiliation to murder.",
      "similar": [
         4771,
         281,
         180863,
         281957,
         3597,
         445954,
         3134,
         11033,
         238636,
         9679,
         979,
         431,
         101,
         769,
         256591,
         156022,
         320,
         241554,
         339692,
         399057
      ],
      "original_title": "Passion",
      "runtime": 100,
      "poster_path": "/fb4odFgekpIlFRGnW47D52Qwbky.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Integral Film",
            "id": 1905,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "SBS Productions",
            "id": 8997,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         }
      ],
      "release_date": "2012-09-07",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "No backstabbing. Just business",
      "adult": false,
      "homepage": "http://www.passionthemovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian De Palma"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Brian De Palma",
         "Natalie Carter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1829012/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjMwOTg4NjQ0MV5BMl5BanBnXkFtZTcwMTkzMDg2OQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rachel McAdams, Noomi Rapace, Karoline Herfurth | See full cast and crew »"],
      "reviews": [
         "Hard to believe Brian dePalma has sunk this low. The film is boring, dreadfully scripted, and looks like a long perfume commercial. Real people just don't dress and look like this; DePalma seemed to be heading toward this stylized, air-brushed look when he made \"Dressed to Kill,\" and it's gotten progressively worse with each film, except \"The Untouchables.\" \"Passion's\" script starts out to be about two female executives vying for the same account, and then goes off in five different directions. He toys with gratuitous lesbianism in some segments, which might have been bold and sexy in the 70's and 80's, but now just comes off looking dated and embarrassing. The film's 100 minutes could easily have been pared down to 20 and it would have been more interesting and less ponderous. A real disappointment.",
         "Advertising execs stab each other in the back over their careers and a an average looking cockney scrub in this mediocre pantomime thriller. Rachel Mcadams is given the opportunity to prove she is more than just a rom-com princess in the role of the manipulative boss lady to Noomi Rapace's Ad campaign creator, an opportunity she squanders. It's not entirely her fault though with such a terrible script to work with there wasn't a lot she could do. Noomi Rapace is dreadful, for me she hasn't yet been convincing in an English language role and she is just either wooden or over the top in this. The plot twists are visible with your eyes closed and nothing will be a surprise. The only thing that kept me watching were the laughs and this isn't a comedy. Some of the dialogue is so stupid I just kept feeling my jaw drop. When Rachel Mcadams tells a tragic story from her characters childhood and her and Noomi Rapace are just sat there sobbing it actually made me laugh because the acting was so terrible and the words they were saying were so poorly written. Add to this the amount of times you get one of those suddenly waking up from a dream moments (a cheap movie trick thats overused) that the film becomes a bit of a mess. So much of this is poor even down to the add campaign that triggers the war between these two women. Their clients are in such raptures over this dreadful idea that it's ridiculous. Also the rough looking guy they chose to play the love interest adds another comedy element to it. Why would these two attractive successful women be tearing each other apart over this guy? I'm sure I read on some of the advertising that this was supposed to be an erotic thriller. There were no erotic moments in this film anywhere. I think someone pulled a dildo out a drawer at some point and there was a lesbian smooch thats all the eroticism you get I'm afraid. I can't believe this was directed by De Palma. I have enjoyed many of his films in the past and I hope this is just a blip and not the shape of the things to come",
         "DePalma's first film in five years is purely for the fans, a throwback to his sensual thrillers of old; Sisters, Obsession, Dressed to Kill. So right off the bat, this probably excludes the majority of casual viewers who will find this too messy and too illogical to be of substance. Younger viewers who simply pick this off a website, will probably see the visual tricks he pulls as weird, lame stabs on ordinary technique. The problem is that DePalma has not changed as a filmmaker, it's the film norm that has absorbed and extended so much visual language that was considered somewhat radical in his time, so when Tony Scott films are marketed as ordinary action, of course he'll seem far less sophisticated. Same thing happened with Hitchcock near the end, when guys like DePalma where coming out. But oh what sweet, sweet DePalmaesque inanity this is! What DePalma is saying is always in the camera. He seems to say: this is a movie, the result of illusory placement of the eye, so why not go wild on placement? Also: the eye, by its very nature, causes narrative dislocation. He is intelligent, not in what the dislocations mean but in the fact they are shown to be at work, which now and then fool as depth in just the same way they fool the characters. You'll see all sorts of fooling the eye here. The car crash in the company garage, first filmed as dramatic with lachrymose piano cues and the second time as comedy. Scenes filmed with dutch angles and unusual shadows to register as dream but they are real. A split-screen that lies about its timeline. A scene set-up to be viewed as hallucinative dream but it's a flash back. And later we know it was an untrusted narration. Many others will make a more streamlined, more exciting thriller, but no one is so committed to expose cinematic illusion like DePalma. He doesn't hit deep, because the illusion is not wrapped around character but around plot, that is always the tradeoff with him. A tradeoff I am willing to make, because I can find more introspective filmmakers elsewhere. There is Wong Kar Wai, Shunji Iwai. Lynch, who brings illusion alive. But then you have an ending like this. It is utterly nonsensical as story, but the narrator has fooled us so much we'll fool ourselves thinking it's more than madness.",
         "This is just an OK film which means it's a bit disappointing from a director who has a reputation. It works as a - not very thrilling - thriller, and Noomi Rapace does a good performance. Plus the film delivers some intense scenes and good photography in front of very cool, emotionally empty sets. What doesn't work so good: It starts as a kind of 21st century version of an 80s erotic thriller, but never gets erotic. In fact, the title is ridiculous, because it never even gets passionate - everybody tries to be in control and nothing happens instinctively or out of reflex. (The slow, controlled ballet sequence strengthens this impression). Also, Rachel McAdams is good at bitchy, but I couldn't believe in her as a tough enterprise lady. And finally, the twist, when it finally came, was exactly what was hinted at ...",
         "Have you ever wondered how it is possible to identify a rubbishy movie within the first 20 seconds of dialog? It is simply amazing how fast a crap script writer can get fatuous nauseating inane notions across in such a short time; something that should surely be speculated upon in film schools during the first semester. And we sure have one here: silly spite, pointless rejoinders, phony regrets, token-lesbianism, sleazy egoism; all in one pointless, plot less string of malicious banalities that makes melodramatic 50s B movies look like literary fiction. Have you ever wondered why, even when given a million dollar budget, movie makers will waste such an opportunity on a string of clichés and bland story development that would embarrass your thirteen-year-old daughter and bore your cat? It is surely a wonder. And a wonder that movie audiences would put up with such drivel and not walk out. Well, I did. And it took me an hour to recover my composure.",
         "Terrible movie. Cant believe how bad this was. Its very rare that I leave the cinema mid way through a movie but for this I willingly made an exception. The acting was really bad, the script was horrendous, really bad! I only joined IMDb.com so that I can write a review of this movie - thats how bad this movie was! I thought that there was a very disappointing performance from Noomi, I thought she would be better. I thought Paul Anderson was also completely bad too and his name deserves a special mention for how awful his performance was. Some completely ridiculous bits in the movie which beggars belief as to how it was accomplished. Such a pity that Brian De Palma was involved in this movie, I'm sure there was lots of squirming at the premiere when it became apparent how bad this movie actually was...",
         "I had grown disappointed with Brian DePalma throughout the 1990s and 2000s. The man who gave us \"Phantom of the Paradise\", \"Carrie\", \"Dressed to Kill\", \"Scarface\" and \"Carlito's Way\"* suddenly turned to overblown stuff like \"Mission: Impossible\", \"Snake Eyes\" and \"The Black Dahlia\". So it's a little bit of a treat to see \"Passion\". It's not as good as his early work, but the tension between the main characters is definitely what I hope for in one of his movies. In fact, DePalma tricks the audience by getting them to think that it's a clash-of-egos story...before the real plot line sets in. Far from her perky roles in previous movies, Rachel McAdams plays a scary executive. The viewer practically wishes for Noomi Rapace's character to do something nasty. Basically, \"Passion\" has a hint of what usually made DePalma's movies good. It's probably not going to be for everyone, but I liked it. *For the record, I didn't think that \"Bonfire of the Vanities\" was that bad.",
         "Watchable De Palma time killer that borrows heavily from the director's earlier works...which in turn borrowed heavily from Alfred Hitchcock. Whole lot of borrowing going on. Still, that has little to do with judging how entertaining the film is and more about judging its artistic value. My first impression of Rachel McAdams is that she was miscast but I accepted her more as the film goes on. Noomi Rapace is fine. I assume both women were intentionally directed to act in a somewhat peculiar manner by De Palma. It bears pointing out for those misled by the poster, trailer, or press for this film that it's not really the sexy lesbian thriller it's made out to be. That stuff only plays a peripheral role in the film and you never get any particularly sexy scenes between McAdams and Rapace as one might be led to believe by the marketing. Still, it's an entertaining enough movie. Not De Palma's best but far better than his last two films.",
         "\"Passion\" is a ridiculous remake of the great French thriller \"Crime d'amour\". The screenplay uses the same storyline and has minors but significant modifications when compared to the original movie that spoils the movie. The scene of the murder of Christine in the original movie is unbeatable. The police investigation of the evidences is very poor in this remake. The conclusion is awful. The decadent Brian De Palma still uses split screen technique but without any brilliance. The two lead actresses of the original movie, Kristin Scott Thomas and Ludivine Sagnier, are wonderful and their duel is engaging. However, Rachel McAdams never convinces as an executive and looks like a vulgar woman. My vote is two. Title (Brazil): \"Passion\"",
         "Brian De Palma's latest is his version of the 2010 French film \"Love Crime\", starring Kristin Scott Thomas and Ludivine Sagnier, and directed by Alain Corneau. I found De Palma's movie to be a diabolical and lurid noir enhanced by fine performances. I looked back in my reviews and saw that I gave \"Love Crime\" the same rating as this new version. Rachel McAdams is superb as Christine, the vicious and conniving sociopath, who's into kinky sex, and will let no one stand in her way when she desires something, either in her office or personal life. She's the boss of a branch of an international advertising firm. Noomi Rapace portrays Isabelle,, Christine's top Account Executive at the company. When Chrisitne takes credit for a popular new advertising campaign that Isabelle and her assistant Dani, also strongly portrayed by Karoline Herfurth, had created, Isabelle retaliates by posting a youtube version of the ad (which goes viral) taking proper credit. This sets off a \"war\" between Christine and Isabelle that will escalate into all kinds of sabotage and eventually murder. I should mention also that a sub-plot here has Paul Anderson, as Dirk, who has embezzled 5 million euros from the firm and who's playing sexual games with both Chrisitine and Isabelle, at his own risk it turns out. Unfortunately, I thought De Palma's ending here was confusing and marred the film somewhat for me. I can see by most reviews that this movie is not for everyone but I found it to be, overall, an engrossing and erotic journey that kept my attention throughout."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "SBS Productions",
         "Integral Film",
         "France 2 Cinéma"
      ],
      "summaries": ["The rivalry between the manipulative boss of an advertising agency and her talented protégée escalates from stealing credit to public humiliation to murder."],
      "budget": 30000000
   },
   "movielensId": 103449,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2012-09-07",
      "dvdReleaseDate": "2013-11-05",
      "directors": ["Brian De Palma"],
      "runtime": 100,
      "movieId": 103449,
      "title": "Passion",
      "mpaa": null,
      "actors": [
         "Rachel McAdams",
         "Noomi Rapace",
         "Karoline Herfurth",
         "Paul Anderson",
         "Rainer Bock",
         "Benjamin Sadler",
         "Dominic Raacke",
         "Ian T. Dickinson",
         "Frank Witter",
         "Leila Rozario",
         "Alexander Yassin"
      ],
      "imdbMovieId": "1829012",
      "originalTitle": "Passion",
      "genres": [
         "Thriller",
         "Drama",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "-YhHeO1BuAI",
         "xaSVR4pCKT4"
      ],
      "plotSummary": "The rivalry between the manipulative boss of an advertising agency and her talented protégée escalates from stealing credit to public humiliation to murder.",
      "tmdbMovieId": 109099,
      "avgRating": 2.65068,
      "releaseYear": "2012",
      "numRatings": 73,
      "posterPath": "/fb4odFgekpIlFRGnW47D52Qwbky.jpg"
   }
}