{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0080835",
      "video": false,
      "title": "Hamlet",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Hamlet",
               "gender": 2,
               "credit_id": "5676ee3692514179d400630a",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gertrude",
               "gender": 1,
               "credit_id": "5676ee8ac3a36816850063b8",
               "name": "Claire Bloom",
               "profile_path": "/4x0Cfh1g8apqOPio8AJx9oUV9mK.jpg",
               "id": 29545,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Claudius",
               "gender": 1,
               "credit_id": "5676ee98c3a368168e006936",
               "name": "Claire Bloom",
               "profile_path": "/4x0Cfh1g8apqOPio8AJx9oUV9mK.jpg",
               "id": 29545,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Polonius",
               "gender": 1,
               "credit_id": "5676eeb192514179e10061c8",
               "name": "Claire Bloom",
               "profile_path": "/4x0Cfh1g8apqOPio8AJx9oUV9mK.jpg",
               "id": 29545,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ophelia",
               "gender": 0,
               "credit_id": "5676eed4c3a368167a00686f",
               "name": "Lalla Ward",
               "profile_path": "/45zTOiBHZVT0X1of113VPW7O6pY.jpg",
               "id": 20116,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Laertes",
               "gender": 2,
               "credit_id": "5676eee392514179e7006142",
               "name": "David Robb",
               "profile_path": "/7IE49gbJBLmbKgzyUryr0CVAOhp.jpg",
               "id": 102375,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a72c3a36847f81ce763",
               "name": "Rodney Bennett",
               "profile_path": null,
               "id": 449908,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a72c3a36847f81ce769",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.318452,
      "production_countries": [],
      "id": 106848,
      "vote_count": 3,
      "budget": 0,
      "overview": "Hamlet comes home from university to find his uncle married to his mother, and his father's ghost haunting the battlements and scaring the watch. Then his father's ghost directs him to seek revenge.",
      "similar": [],
      "original_title": "Hamlet",
      "runtime": 210,
      "poster_path": "/tIxpyOHUMP9aHX0MI4dVcrp4wLB.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1980-05-25",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rodney Bennett"],
      "runtime": 210,
      "synopsis": null,
      "writers": ["William Shakespeare"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080835/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzOTYzNTg3NF5BMl5BanBnXkFtZTcwMzg3OTkxMQ@@._V1_SY317_CR25,0,214,317_AL_.jpg",
      "actors": ["Stars: Derek Jacobi, Claire Bloom, Patrick Stewart | See full cast and crew »"],
      "reviews": [
         "No one production of \"Hamlet\" can completely satisfy except for the one that plays in your head as you read the play, but this is the extant version that comes closest for me (with one glaring exception). Derek Jacobi is probably the best actor that I've seen play the role, although he's brittle and snappish in places (his first exchanges with Claudius and Gertrude, his comments to Polonius during the 'Rugged Pyrrhus' speech) where I think a mellower touch is called for. But on the whole it's a wonderful performance, and since Hamlet has almost half the lines in the whole play Jacobi himself is enough to strongly recommend the whole. This Polonius is better than most, although not as funny as Hume Cronyn was. Rosencrantz and Guildenstern are well played, straddling the difficult line between being friends to Hamlet and scoring points with the King. A fine, fiery Laertes, and an Ophelia that's no worse than any others (I've yet to see Ophelia played the way I feel she ought to be). Gertrude was adequate (I've also yet to see a compelling Gertrude, but I don't particularly know what I would suggest). It's also too bad that nobody seems to put any sense of spectacle into the Ghost's appearance any more; the Olivier film and the Burton stage production both give it an unworldliness that the Jacobi, Kline, Gibson and Hawk versions lack (although if I remember correctly Brian Blessed was well-used in the Brannagh film)... The big drawback to this version is in the casting of Patrick Stewart as Claudius. The fault is not in his performance, which is worthy, but in the man himself. Granted, Claudius may not be as much of a toad as Hamlet thinks him to be, but his \"natural gifts\" should be poor compared to his murdered brother's. Stewart in fact HAS \"the front of Jove himself; An eye like Mars, to threaten and command,\" which Claudius pointedly lacks. In short, Stewart is just too REGAL to play Claudius, the \"king of shreds and patches\". (And it's not just the father-and-son Hamlets that consider Claudius visibly inferior; Gertrude herself, when Hamlet makes her confront the two pictures, sees black and grained spots on her soul at the comparison.) All in all, though, it's an excellent production.",
         "I've seen various Hamlets, and I've taught the play. As I watch Jacobi, I'm tempted to think that he's every bit as intelligent as Hamlet himself, so alive is he to every nuance of this character's wit. He deepens, rather than solves, every puzzle regarding Hamlet's character. He illuminates line after line, word after word, shining light into this sparkling mind. At the same time, however, we cringe at the horror Hamlet feels at his betrayal--far more than with any other actor--because Jacobi feels the pain more profoundly than anyone else. And we shudder at Hamlet's own betrayals, because Jacobi is not afraid of the baseness to which Hamlet can descend. In short, Jacobi gives us Hamlet in full, and Hamlet in full is the greatest character in literature. That's why I'm satisfied that Jacobi's Hamlet is the finest performance I've seen by an actor.",
         "This production of Hamlet, Prince of Denmark is by far the best that I have seen. Although it may not have the production value of some of the more recent adaptations, it does have the most important element: Sir Derek Jacobi as Hamlet. Jacobi's portrayal of the disturbed Prince is multi-layered and riveting. His displays of emotion swing from hatred to sorrow, love to vengefulness and everywhere else on the map, but without seeming forced or over-the-top. In fact, some of the more powerful sequences occur when he underplays them, with stillness, soft speech and thoughtful expression. As to whether or not he interprets Hamlet as mad or sane...well, you should decide for yourselves; I changed my mind more than once. At one point it seems he has thought himself sane and merely playing at madness, but suspects that he is actually mad after all...a revelation to himself, captured beautifully. Having performed the part of Hamlet on stage more times than any other actor in history, Jacobi's affinity for the role then comes as little surprise. As for the production itself, it is presented as a kind of \"filmed-copy\" of the stage play, with little special effects or fancy camera work, minimal sets and no musical accompaniment to speak of. This production relies on the acting prowess of the cast, and the words of Shakespeare, to evoke the emotion and interest of its audience. And it works. The other players are top-notch as well, particularly Patrick Stewart's \"Claudius\" and Claire Bloom's \"Gertrude.\" Together the cast present a seamless ensemble. The last (but far from least) element that makes this production stand out is the play itself. Here it is presented in its entirety, a rarity on film. But, oddly enough, I never noticed the time. I was too busy getting caught up in the story. I suspect that you will, too.",
         "I saw this version of Hamlet on television many years ago, and have seen every other version since, whether television or movie. However, this is the one that remains the truest depiction of the story for me. Most excellent Derek Jacobi made Hamlet *real* for me. Before I saw this version, Shakespeare was simply gibberish to me and I never tried to understand the Elizabethan English. Having seen Jacobi's Hamlet several times not only increased my knowledge of literature, but also that of my family. I promptly checked the play out of Library and read it, and poured over the accompanying recording. Jacobi's rendition attracted me to a deeper knowledge. And yet, I have been searing for a video of it for years and years to no avail. It gets a very high rating from viewers. Why, then, has it not been released on video? It's the only Hamlet that I'd invest in...",
         "I have seen all the film interpretations of Hamlet, from Sir Lawrence Olivier to Mel Gibson (gasp). Derek Jacobi captures the true essence of the character, from the beginning to the brutal climax. Superb acting all around. This one should not be missed.",
         "Absolutely the most thoughtful, spiritually deep, intense Hamlet ever done -- no other version comes close. Jacobi has the best understanding of the role of all the actors that have played it. Patrick Stewart's Claudius is ferocious and still sympathetic -- I particularly like the two doofuses playing Rosencranz and Guildenstern. Very feckless and yet sinister. Some might gripe about the need for a strong Ophelia -- she's not a strong person, that's the point, and Lalla Ward hits the proper nuances. Amazing. Simply Amazing -- every one of the more than two dozen times I've watched it.",
         "What a great play! Shakespeare really is more rich and detailed here than just about anywhere else.This particular production of Hamlet has great virtues. It also has a vacuum at the center that really kills it. Eric Portman, who usually played mournful death's heads like Soames Forsyte, here plays the best Polonius I've ever seen - a man of gravity and wisdom floating off into dottiness. Claire Bloom as Gertrude is, as usual, faultless in Shakespeare, completely natural in both language and understanding. Patrick Allen is a restrained and powerful Ghost, thinning out his rich voice into a dry and austere insistence. Robert Swann brings warmth and dignity to Horatio. That being said, there are problems. Patrick Stewart early in his career seems a bit lost, often setting the Indoor Iambic Pentameter Speed Record by simply gabbling his speeches at the expense of meaning. Lalla Ward's Ophelia is acceptable in her Mad Scene, but not so in what leads up to it, where she enjoys being watched a little too much. David Robb's Laertes is OK when quiet, without resources at top volume. Rodney Bennett, more at home with Dr. Who episodes, hasn't a clue about directing Shakespeare. Shot out of sequence in 8 days, the scenes lack emotional flow from one to the next, unusual in this BBC series. Patrick Stewart's hairpiece migrates distractingly up and down his pate, and Hamlet himself has two different haircuts. But the real problem is the star. Derek Jacobi followed a West End run as Hamlet with a two-year tour that took him all over the UK and the Far East. Taped immediately after his return, this DVD shows him ossified and stale, gimmicky and unable or unwilling to scale his performance down for TV. Hamlet's soliloquies are directed to the camera, which works only if we are addressed as individual viewers, not as a public gathering. Here they are overstated and wearisome. Especially in the first half, Jacobi's performance is often trivial silliness, as one audience-tested piece of shtick follows another with trip-hammer inevitability. Hamlet's bawling during the Ghost's speech is mere scene-stealing, and his subsequent collapse in a fit is just awful to watch, like diving off the high board into an empty swimming pool. Hamlet's scene with Ophelia is remarkably vicious, the one with Gertrud genuinely distasteful. Only as events speed up to a final climax does Jacobi even begin to pull himself together. Throughout, Derek Jacobi performs with one hand holding a mirror, so he can watch what he's doing. Worse, he likes what he sees. I presume this kind of calculation of effect can work on stage, but with a camera up his nose, it's unbearable. This is probably why Sir Ian McKellan has made a screen career and Jacobi hasn't. A film or TV actor doesn't project to the audience, he lets the camera read his mind. Jacobi, by contrast, alternates between megaphone and sledgehammer. For me, Jacobi remains a superficial, inconsequential Hamlet compared to Olivier or Burton. A strong director might have been able to bring all this under control, but that's not what happens here. A humane Polonius and genuine Gertrude can't compensate for a self-indulgent Hamlet, a tentative Claudius and a weak hand on the tiller. The BBC is sitting on a 1964 Hamlet actually filmed at Elsinore Castle with Christopher Plummer, Robert Shaw, Michael Caine and Donald Sutherland. May we see that please?",
         "Derek Jacobi's idea of Hamlet is a dreamer, a plotter, a voyeur in the corrupt court of Denmark, and it is an interesting variation on other versions. The downside is the traditional costume so he's in tights, not the best idea, but these things can be ignored. Gertrude is the great Claire Bloom, who is excellent in this, while Patrick Stewart is a nasty-minded letch as Claudius. Lalla Ward from Dr Who is an ok Ophelia but not wonderful. Aside from Jacobi there are two other great acting performances in this - Eric Porter is a busy Polonius, and Patrick Allen is a suitably sinister Ghost. The BBC staging is sparse, which suits this play very well and brings scenes such as Claudius praying, and Hamlet's scene with his mother, more intimate and effective.",
         "Havn't seen Branagh or Mel Gibson, & Olivier is a distant b&w teenage memory, but this is GOOD. The cast is awesome & lives upto its billing. Patrick Stewart is a great 'villain' (I havn't seen Conspiracy Theory, so I don't know how good a villain he is in movies), Claire Bloom is a sexy queen (she was one short of 50 when this was made, but very oomph). The sexual tension between she & Hamlet crackles. Stretches in between drag things down a bit (even Shakespeare was indecisive when he wrote it?) but the last hour is electrifying. As for Derek Jacobi, what do I say? Worth keeping the telly running for 4 hours.",
         "Let's face it, there is no perfect production of Hamlet, it's simply far too long and varied and cerebral to get completely perfect across the board, especially what with the challenges of Elizabethan English and Shakespeare's abstruse dialogue. In any staging of it, there are bound to be certain moments, scenes, or intonations that one disagrees with. I've seen a lot of filmed Hamlet productions: Olivier, Gibson, Branagh, Scott, and now this BBC film with Jacobi. In terms of faithful, full-length productions, this one ranks up there with the very best. Most Hamlet productions are drastically cut, because to perform the entire play takes a stage-time of four to five hours. This production appears to be complete -- that is, ALL of the original Shakespeare dialogue is intact -- and so it's essential for scholars and Shakespeare-lovers. And though the lines seemed rushed on rare occasion (for those less completely familiar with the text), for the most part the script is well-acted, well-spoken, and well-performed. Subtitles are available and very helpful, although upon occasion they lag slightly behind. Jacobi does a quite admirable job with theatre's longest and most impossible role. I actually cried when Hamlet dies, and I don't think I've done that before. Patrick Stewart (as Claudius) and Claire Bloom (as Gertrude) are excellent, as are Lalla Ward (Ophelia) and David Robb (Laertes), and the rest of the very on-point cast. Sets are minimal, so we can thankfully concentrate on the play without distraction or attention paid to non-essentials. At 3 hours and 45 minutes, this full-length Hamlet is a long haul to sit through, but again, if you want the real deal, it's 100% worth it, even if one needs to take an intermission for oneself. I highly recommend this production to all Shakespeare lovers and scholars."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Time-Life Television Productions"
      ],
      "summaries": [
         "Hamlet comes home from university to find his uncle married to his mother, and his father's ghost haunting the battlements and scaring the watch. Then his father's ghost directs him to seek revenge.",
         "Hamlet suspects his uncle has murdered his father to claim the throne of Denmark and the hand of Hamlet's mother, but the prince cannot decide whether or not he should take vengeance."
      ],
      "budget": 0
   },
   "movielensId": 103598,
   "movielens": {
      "languages": [""],
      "releaseDate": "1980-05-25",
      "dvdReleaseDate": "1980-01-01",
      "directors": ["Rodney Bennett"],
      "runtime": 210,
      "movieId": 103598,
      "title": "Hamlet",
      "mpaa": null,
      "actors": [
         "Derek Jacobi",
         "Claire Bloom",
         "Claire Bloom",
         "Claire Bloom",
         "Lalla Ward",
         "David Robb"
      ],
      "imdbMovieId": "0080835",
      "originalTitle": "Hamlet",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Hamlet comes home from university to find his uncle married to his mother, and his father's ghost haunting the battlements and scaring the watch. Then his father's ghost directs him to seek revenge.",
      "tmdbMovieId": 106848,
      "avgRating": 3.08333,
      "releaseYear": "1980",
      "numRatings": 6,
      "posterPath": "/tIxpyOHUMP9aHX0MI4dVcrp4wLB.jpg"
   }
}