{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "medicine",
            "id": 1279
         },
         {
            "name": "health",
            "id": 3721
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "food",
            "id": 10637
         },
         {
            "name": "pharmacology",
            "id": 10638
         },
         {
            "name": "nutrition",
            "id": 192606
         }
      ],
      "imdb_id": "tt1528734",
      "video": false,
      "title": "Food Matters",
      "recommendations": [
         37066,
         257249,
         168051,
         174309,
         77269
      ],
      "backdrop_path": "/A3yR2NeQ6W7V5Zh5Mh7qKQ3RSuV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e337",
               "name": "Andrew Saul",
               "profile_path": null,
               "id": 94734,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e32f",
               "name": "Charlotte Gerson",
               "profile_path": "/5oL0Ali4cty77VuP1fibKs00G7b.jpg",
               "id": 94732,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e333",
               "name": "Dan Rogers",
               "profile_path": null,
               "id": 94733,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e33b",
               "name": "David Wolfe",
               "profile_path": "/chE5q1tIZYEs2aTtsuaBEwj6gZO.jpg",
               "id": 94735,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e323",
               "name": "Ian Brighthope",
               "profile_path": null,
               "id": 94729,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e327",
               "name": "Jerome Burne",
               "profile_path": null,
               "id": 94730,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e32b",
               "name": "Phillip Day",
               "profile_path": null,
               "id": 94731,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e33f",
               "name": "Victor Zeines",
               "profile_path": null,
               "id": 94736,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e313",
               "name": "James Colquhoun",
               "profile_path": null,
               "id": 94562,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e319",
               "name": "James Colquhoun",
               "profile_path": null,
               "id": 94562,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e31f",
               "name": "Laurentine Ten Bosch",
               "profile_path": null,
               "id": 94728,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e345",
               "name": "Enzo Tedeschi",
               "profile_path": "/pzZH2UBTHqKaECOEb79ayoDQ7xk.jpg",
               "id": 135480,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e34b",
               "name": "James Colquhoun",
               "profile_path": null,
               "id": 94562,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e351",
               "name": "Laurentine Ten Bosch",
               "profile_path": null,
               "id": 94728,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e357",
               "name": "Enzo Tedeschi",
               "profile_path": "/pzZH2UBTHqKaECOEb79ayoDQ7xk.jpg",
               "id": 135480,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eac3a368484e03e35d",
               "name": "David Sander",
               "profile_path": null,
               "id": 135502,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "598b6db69251413f0c0001c5",
               "name": "Ray Blewitt",
               "profile_path": null,
               "id": 1866877,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "598b6df1c3a36817b400020e",
               "name": "James Bayliss Smith",
               "profile_path": null,
               "id": 1866878,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "598b6e9fc3a36817d0000264",
               "name": "Renee Endycott",
               "profile_path": null,
               "id": 1866879,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "598b6eb2c3a36817fd00030c",
               "name": "Laki Fotopoulos",
               "profile_path": null,
               "id": 1866880,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "598b6ed4c3a36817fd000343",
               "name": "Kevin Comty",
               "profile_path": null,
               "id": 1866881,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 0,
               "credit_id": "598b6ee89251413f0c000310",
               "name": "Matt Diks",
               "profile_path": null,
               "id": 1866882,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 4.195979,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 26018,
      "vote_count": 25,
      "budget": 0,
      "overview": "With nutritionally-depleted foods, chemical additives and our tendency to rely upon pharmaceutical drugs to treat what's wrong with our malnourished bodies, it's no wonder that modern society is getting sicker. Food Matters sets about uncovering the trillion dollar worldwide sickness industry and gives people some scientifically verifiable solutions for curing disease naturally.",
      "similar": [
         40807,
         238615,
         258230,
         415086,
         9096,
         439154,
         261768,
         433033,
         41827,
         26976,
         501251,
         150897,
         146452,
         117102,
         393961,
         18047,
         253277,
         24506,
         11214,
         19398
      ],
      "original_title": "Food Matters",
      "runtime": 74,
      "poster_path": "/g1u0Mf4VKKklC8fKsvAh5n5pk8T.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Permacology Productions",
         "id": 93492,
         "origin_country": ""
      }],
      "release_date": "2010-10-08",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Prevent illness, reverse disease & maintain optimal health... naturally.",
      "adult": false,
      "homepage": "http://www.foodmatters.com/films#section-our-films",
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "James Colquhoun",
         "Carlo Ledesma"
      ],
      "runtime": 80,
      "synopsis": "The documentary opens with Greek nutrition and how they valued their bodies and health more so than people today. Multiple health related facts are shown across the screen supporting their ideas about death-related illnesses such as cancer and heart disease. Linus `Pauling is referenced as a supporting scientists of supplemental nutrition. Different cultures are mentioned because of their habits in nutrition by David Wolfe, a nutrition specialist. Video of the food industry of the past was then shown and was compared to todays industry. It was proven that the quality and freshness of the food back then exceeded our present day food sources. Dr. Victor Zeines then revealed that our produce is traveling up to 2000 miles before it even reaches out dinner plate. He says as the food ages, the nutrition value exponentially diminishes. David Wolfe contests the methods used for agriculture, saying that we use too many pesticides and GMO techniques for our crop production. Every health expert in the documentary agrees that measures need to be taken to improve the quality of our crops and how theyre grown. Charlotte Gerson tells us that the soil is made of only 3 main minerals when it should have 52. This is when its considered healthy for the crops. The lack of minerals cause the plants to be more susceptible to diseases and, in turn, causes the companies to add more pesticides to their crops. A chemistry lab dominates the screen and a narrator's voice explains that over time many hours of research has been put in to develop chemicals to enhance production rates and immunity of crops. Gerson goes on to conclude that the pesticides have a negative effect of the crops, to the point of near toxicity. Victor Zeines and Ian Brighthope reveal that the act of cooking food denatures the live enzymes in the food that our body needs for digestion. This makes our body treat the cooked food as a poison. Philip Day shares that when cooked food is ingested, the white blood cell activity increases within the body as a defense mechanism. David Wolfe then references Dr. Paul Kouchakoff who said that an excess amount of cooked food in your diet could result in false immune defense activation. A 51% raw food diet is stressed to improve immune system health because there is less white blood cell activity. They state the longevity of our lives is dependent on our daily eating habits. David Wolfe then introduces superfoods and how great of a benefit they have on our bodies. Things such as spirulina and cacao beans have display a high concentration of antioxidants. Our values have changed throughout time dealing with our diet. Ian Brighthope mentions that our nutritional deficiencies are due to our lack of nutrients from the day before. Andrew Saul then demonstrates that high doses of vitamins can be used for preventative medicine and can even reverse disease. He goes on to explain that modern medicine discourages the use of vitamins with no clear explanation as to why. There has been 10 alleged documented deaths from vitamin consumption in the past 23 years that are still unverified. Some propaganda efforts promote a negative stigma toward the use of vitamins, saying that they have a negative effect on our body. There is an assumption that vitamins are similar to pharmaceutical drugs so they should be regulated like drugs. Andrew Saul is still looking for a medical explanation as to why people believe that vitamins are harmful. An old video clip is then shown that demonstrates a man telling another man that doctors are more accredited and can be trusted just because they have received more education on the subject. Andrew Saul then explains the stereotype of what a doctor is and how it is not connected to nutritional aspects. He then begins to describe an instance he had at a hospital he studied at that did not value nutrition, in the means of food, for their patients. Malnourishment is linked to hospital patients after discharging from a hospital rather than entering it. Andrew Saul states a case study (in the 1940s) in which medical doctors used high doses of vitamin C to cure viral diseases. He was shocked by the fact that he never heard of any of this throughout his medical studies in college.Linus Pauling was referenced because he was the first to suggest that Vitamin C could be used against the common cold. He was claimed to be very open to criticism and his idea of Vitamin C was turned down by the medical field. They claim that Vitamin C has many many beneficial aspects to it. An old medical idea is introduced called Selective Healing, in which Charlotte Gerson proves to us that the body is not capable of such things. Andrew Saul claims that vitamins enable the body to heal itself and boosts health. Pharmaceutical drugs do not promote health. Andrew Saul goes on to claim that studies conducted involving vitamins are very ambiguous due to the use of low doses of the vitamin. Phillip Day constitutes that stress causes an increased metabolic rate of Vitamin C in the body and this is connected to Cardiovascular diseases because of the lack of the vitamin. He also states that conventional medicine only focuses on treating disease and not prevention. Dr. Dan Rogers agrees with Dr. Days statement because of his own observations on how preventative medicine has been much more successful in curing diseases than conventional medicine. Cardiovascular disease is introduced and they say that the main cause of it all is the eating habits that our society has developed. Fast food and processed food contribute to this idea. Andrew Saul states that studies have been done that prove that organics have the ability to reverse Cardiovascular disease. He claims that a failure to take vitamins can be another blame for the development of Cardiovascular disease. He says that half of all deaths are due to Cardiovascular disease. To prevent this they stress that you must change your lifestyle by introducing meditation and a healthy diet to your life. Jerome Burne then compares the amount of deaths from adverse drug reactions to other instances of death that are considered common, such as a car accident. He reveals that there are much more deaths contributed through adverse drug reactions than from the common-type deaths, yet we worry about those more than the use of those drugs. Andrew Saul confronts the American Medical Journal and their account on the number of deaths due to pharmaceutical drugs. They then go on to say that the medical industry has a more money based motivation. Jerome Burn says that the economy of the medical industry is based on many businesses that are all ironically linked. Andrew Saul then refers back to the American Medicine Journal and how they do not index papers surrounding Orthomolecular medicine. An old video clip is presented that talks about health information through advertising that can be deceptive. Phillip Day agrees that drugs are necessary but believes the public relies too much on the concept of a Pill for an Ill. Andrew Saul demonstrates that if everyone was healthy then not a lot of money would be made for the health industry. Jerome Burne tells us that in order for any type of drug to be licensed, the drug has to be proven more effective than the placebo. This has to be proven in only two trials. Another old video clip is shown. Its talking about insulin and other drugs. They are supposed to be tested that they do actually work and are safe before they are allowed to be used by the public. Burne goes on to explain to us that the when people take a new drug, the doctors will tell them that yes, it has been tested. The people are really untaking an uncontrolled experiment. The new drug is only tested on hundreds, maybe thousands of people in order to get the license for it. Once the drug is licensed, its then going to be available to millions of people. Every persons body handles things differently. You dont know how your body is going to react to the new drug. The western side of the world, the United States is more susceptible to chronic conditions like depression, diabetes, arthritis, etc. According to Dan Rogers short term drug use can be good and also life saving, but long term use is really bad for us. Burne gives us the secret behind the drug companies perfect drug. The companies want to give us a drug that works part time, but not fully. If there was a drug out there that cured an illness, then the drug companies wouldnt be making any money. In order for the drug to become profitable, people need to take it for long periods of time. Andrew Saul explains to us what happened between Dr. Abram Hoffer and Bill Williams. They worked together. Bill had a problem with alcohol and Abram suggested he start taking a little bit of Niacin to help with the depression that comes hand in hand with alcoholism. Bill then suggests to the people in AA to start taking the Niacin to help with their own depression. According to Burne when it was almost time for Prozacs patton to wear off, people questioned whether there was going to be a new and better kind of drug. When they looked into it, it turns out that, yes there was going to be another. The new one was going to be called Prozac R. The drug companies had done some toying around with the molecular structure of the new Prozac. In order to produce a new drug, you have to be able to tell what the renovations of the new drug is. Saul informs us the just two handfuls of cashews gives us the therapeutic alternative to the prescription dose of Prozac. Ian Brighthope notifies us that our mind can be influenced by what we take in and the nutrients we have. We have a lot of lead in our bodies and its really unhealthy and harmful to us. Charlotte Gerson says that the doctors dont want people to know that all of the drugs we take are toxic. Victor Zeines lets us know that millions of people are getting lead in their fillings. He says though legally he cant tell this to his patients, but since this is a documentary, he will. Its very poisonous. When we stop putting toxins into our bodies, Charlotte says, they all start to come out. We must detoxify our bodies. David Wolfe urges us to drink water and lots of it. When we drink water it helps cleanse our bodies. The bodys main way of detoxify itself is through the bowels. Charlotte then informs that in order for the nutrients to get into our tissues, we need to detoxify. You cant get two things into one space. Wolfe continues to urge drinking lots of water. Drinking water hours before you eat or drink other things can have an amazing affect on our bodies. Well feel better, then we can begin our day. His cousin lost a lot of weight on the raw organic and water diet, all through his bowels. Philip Day talks about how people always think that there is going to be a breakthrough in cancer research coming up. There hasnt been & our relatives keep dying. Its false. The chemo is cell toxins. Old video of how cancer cells appear in a body, they start to form a clump and takes the nourishment from the other cells in the body. Dan Rodgers, Conventional medicines do not work. Less than 30% of people with cancer survive over five years using chemo. Old video again. The guy has cancer and his doctor tells him that he will need to go through surgery again as soon as soon as possible. Andrew Soules tells us about how Dr. Max Gerson found out that vitamins and fresh vegetable juices, with organic food you can reverse the role of cancer. Gerson was able to cure about fifty percent of his terminally ill patients by doing this. The medical schools we have do not talk about these types of things. Pictures of people with cancer appear. Before and after of using the Gerson Plus Nutritional Therapy. Charlotte Gerson explains how our bodies have powerful defenses when taken care of properly. Cancer would not be able to develop. Philip Day, If you want to give someone cancer, give them chemotherapy. Chemotherapy is consisted of carcinogens. The drug companies arent flat out lying to people, they just aren't handling things the way they need to be handled. He then goes on to tell us that survival rates mean that you have survived five years without the cancer returning. You could drop dead after five years and six months like one of his relatives and be forever labeled as a cancer survivor. Charlotte talks about in 1972 President Nixon said that if you put enough money towards cancer research, we would find a cure. Weve put a man on the moon, now we are going to find a cure for cancer. There has still not been a cure for cancer as of yet. Gerson tells us about how after getting government's help to aid in cancer research and receiving billions of dollars, the numbers of deaths rose to 560,000. Andrew Saul, comes in to explain to us that the The rate of people who survived cancer for 5 years or more has not changed for any form of cancer in the last four decades. Day then explains to us about how the cancer industry is a 200 billion dollar industry and that if we were to find a cure to cancer, many people would have to retrain. A slideshow of facts then come across the screen stating how countries in the world makes law about how people approach curing cancer. In most countries around the world it is illegal for doctors to treat cancer with nutritional therapy. Surgery, radiation therapy and chemotherapy are the only legal techniques to approach cancer treatment. Dr. Dan Rogers, explains why many American Citizens and Doctors go to other countries such as Mexico to either get cancer treatment or to provide treatment to cancer patients because they believe its a better system than what is legal in The United States Andrew Saul then comes in to say that he believes cancer has been fought with one hand and by restricting cancer treatment and research to drugs, surgery and radiation is a terrible service to the American people. He then goes on to state that people can take their own health into their hands by making choices on what they are and are not going to eat. Phillip Day and Andrew Saul state facts about how we need to treat our bodies correctly. They tell us that people need to do everything possible to a build a body up and not break it down. We can build up their immune systems nutritionally and use vitamins to fight diseases. A narrator then states that the most prevalent type of cancer, in males in of the digestive tract. Andrew Saul adds to that information by saying that colon cancer is 100% preventable by having a high fiber diet and avoiding things that irritate cancer. Ian Brighthope goes on to talk about how Japan has the lowest amount of cases of cancer in the world. He believes this is because of the high intake of seafood, trace elements and anti-cancer elements. This could also be because they intake a lot of fish oils and green tea that help to protect them from cancer and other diseases. The narrator now comes back into the documentary stating that in females the most prevalent cancer is uterus cancer and breast cancer.Ian Brighthope then comes back to the screen talking about how Japanese women, if transitioned into America's society and lifestyle would have an increased chance of getting cancer. He then states that 13% of American women are at risk of getting breast cancer while Japanese women have less than 1% of a chance. Andrew Saul begins to inform us of the benefits of high dosages of vitamin C. High doses of Vitamin C given as a therapeutical agent will have a wonderful effect for cancer patients. Its easy, safe and inexpensive. He believes within the next 10 years this will become widely accepted. By putting vitamin c directly into the bloodstream it will kill cancer cells. it is just like chemotherapy but it doesn't kill the healthy cells, it does not result in nauseousness or hair loss. Ian Brighthope states that in the past, people have pushed the dose of VItamin C up to nearly a quarter of a kilogram in a day. There were no major side effect other than thirst and a little dizziness. Andrew Saul then tells us why doctors are not using this technique and why patients are not asking for it to be done. He states people are not doing this because they believe if it was such a wonderful idea their doctors would already know about it, but their doctors do not learn about this in medical school because people in the medical profession only know what the pharmaceutical companies are telling them and they are not going to advocate vitamins because then they would lose their profits. He has seen research over the past 25 years, that state that high dosages of VItamin C improve cancer patients qualities and lengths of life. Saul states that this technique will not be used until enough people complain about it. Ian Brighthope states that he believes everyone needs to learn about self care and self health. The medical fields need to be taught more about vitamins and nutrition. There are plants that can help with just about anything, medicine is not always needed. Andrew Saul then start to speak about Americas health insurance. he points out that in many countries health care is given to everyone, but in America is not like that. There are 30-40 million people living in our country that are uninsured. He believes that US citizens need to be taught how to live a healthy lifestyle and that people need to be more aware of improving their health. Ian Brighthope states that nutrition needs to be made more important to the public and citizens need to realize they are what they eat. If people with illnesses lived healthier lifestyles they would be better off. Phillip Day adds that what you choose to eat everyday directly influences how you feel. People need to be more zealous on nutrition. Food changes your mood. It may be easy to not think about it when you are younger and still healthy, but it will affect you when you are older and you are extremely unhealthy. Ian Brighthope then comes in to say that our healthcare system is really a disease system dominated by doctors and hospitals who are only worried about themselves. They are not worries about reducing illnesses and diseases because the more people who are getting sick, the more profit they are bringing in to benefit themselves. Phillip Day comes into to say that that the medical industry is not all bad and they do get some things rights, but when it comes down to it, diseases is not one of the things they do correctly. Andrew Saul informs about how medical schools are lacking in teaching their students about nutrition. Even the medical schools that offer courses on nutrition, do not talk about mega doses. No medical schools focus solely on nutrition. He believe if someone wants something done right they need to do it themselves. People need to do research on nutrition, and be willing to juice vegetable and take vitamins and do other steps to improve their own lives. David Wolfe comes in and states that everyone watching this video has taken a step in wanting to changed their own lives along with their loved ones lives. Along with the life of the planet. In doing this Our food choices have to correlate with what type of health we want for ourselves and our families. If we change our food choices, we change our agriculture. Growing things is the number one thing we are doing on this planet. Phillip Day starts to state his concerns with todays lack of nutrition. He makes it clear that changes need to be made because the rates of most diseases are increasing. Americans need to go back to basics and look at the countries with low rates of diseases and see what they are doing so that we can copy their ways. David Wolfe believes that the nest doctor and nutritionist in the world is yourself. You know when something is either good or bad for yourself because you can feel what it does to you. You have the equipment within your body to be able to feel if something is right or wrong. Andrew Saul says that he is happy that many Americans are smart enough to take matters into their own hands. He says over half the population takes vitamins now even though doctors tell people they are not necessary. The public is catching on quicker than the medical profession. People do not need a degree to take care of themselves. People deserve to be healthy and happy, which can be done by changing your nutrition in Andrew Sauls opinion. Ian Brighthope says when people choose raw organic food, they are choosing not to make themselves suffer. By eating like this, you are not putting a variety of unneeded chemicals into your body. An 80% raw food diet is a part of a healthy and abundant lifestyle. There is no type of medicine or surgery that can cure and prevent all diseases, but there is a lifestyle change that can be done to regress and reverse chronic illnesses, as Andrew Saul says. David Wolfe says the cure has always been here, the only other thing left to do is to get people educated about it. He is convinced that once people know about this more in depthly, they will want to do it.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1528734/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxOTQyNjEwNF5BMl5BanBnXkFtZTcwNDE1ODc4Mw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Vicky Blewitt, Ian Brighthope, Jerome Burne | See full cast and crew »"],
      "reviews": [
         "The overall message of the film- that our food supply is in bad shape and that our dietary habits are contributing to our current health crisis - is one that I believe in whole-heartedly. However, making that argument with a bunch of new-age mumbo-jumbo pseudoscience mixed with a sprinkling of real facts as this film does is counterproductive. It just makes it that much easier for the giant corporations, medical establishment and public at large to dismiss these questions and continue destroying the world's farmlands and our collective health. Go watch \"Food Inc.\" instead if you wish to find out what is wrong with the world's food supply and what can be done to fix it.",
         "A very dangerous film. DO NOT LISTEN TO IT. I am a REAL Biochemist (degree and all) and I can say for sure MOST OF this film is a lie. Yes certain things are true such as B3 and depression but 11,500mg of B3 (Niacin) a day is NOT HEALTHY. The movie leads you on to believe that the person needs it because they are deficient. The truth could actually be that the person is actually not deficient and that the receptor in the brain for B3 is genetically hampered and doesn't respond well (or even none at all of which the next part wouldn't matter) to B3 unless massive doses (high molarity) is present which will decrease the Kd (dissociation constant). You could end up killing your family member doing this by OVER DOSING them. People have to understand that Niacin is a CHEMICAL and like all Chemicals they have side EFFECTS, so lets review them shall we? Primary side effects contain (hey we've seen this before right?) Blotching, Fever, dryness (Psoriasis), muscle damage, and hepatoxicity (liver damage to the extent of failure). also if you don't believe that you can always check an accredited medical site such as Mayo Clinic. Thank god the person listened to their psychiatrist and stopped that ludicrous regimen. Why its not healthy even though the movie people say it is. The thing is when you have a high molarity of anything other reactions in the body can and will take place. This can make things very dangerous, and also the reason why many nutritionists have no idea what's going on in the human body. Nutrition is mostly PREVENTIVE and slightly CURATIVE. Medicine is the opposite and that is why people who get cured get sick again because they don't learn the PREVENTIVE MEASURES or decline to do them. There is a Biochemist I know in fact that takes Lipitor to reduce their cholesterol even though they know healthy eating would be better just cause they hate exercise and wants to eat what they want despite knowing and admitting its bad for them. That is also quite shameful and a poor example to others. The whole thing about vitamin C and cancer is true to an extent. Vitamin C is an antioxidant and can prevent cancer (notice preventive!), so why don't we eat more of it? Because it can cause cancer at HIGHER MOLARITIES. There are hundreds of accredited documented papers that discuss this. They are hard to find (but they are there) because of all the science Jargon that I'm used to but It has been shown in: Podmore ID, Griffith HR, Karl HE, Mistry N, Mistry P & Lunec J (1998): Vitamin C exhibits pro-oxidant properties. Nature 392, 559�560. Cai L, Koropatnick J & Cherian MG (2001): Roles of vitamin C in radiation-induced DNA -damage in presence and absence of copper. Chem. Biol. Interact. 137, 75�88. Guidarelli A, De Sanctis R, Cellini B, Fiorani M, Dacha M & Cantoni O (2001): Intracellular ascorbic acid enhances the DNA single-strand breakage and toxicity induced by peroxynitrite in U937 cells. Biochem. J. 365, 509�513. What happens is metals such as iron can be reduced, oxidized, and then re-reduced, in a process called redox cycling that can generate reactive oxygen species and THOSE ARE BAD. Don't read the ones by Linus Pauling as they are biased (obviously) and were even cited as an embarrassment by the National Cancer Institute. Linus Pauling (discussed in this film) who was pretty much the founder of megadosing vitamin C took around 12,000mg of vitamin C A DAY and DIED of PROSTATE CANCER. If it was so miraculous why didn't it save him? Because it doesn't work. Now the film also states that modern medicine and scientist didn't try megadosing. Well, that's not true either. The Mayo Clinic which is a NONPROFIT organization tried to replicate Linus Pauling's work with megadosing and cancer and found that they COULD NOT REPLICATE the results even with THREE subsequent trials. Source: Cabanillas, F (2010). \"Vitamin C and cancer: what can we conclude--1,609 patients and 33 years later?\". Puerto Rico health sciences journal 29 (3): 215�7. Everything you eat causes cancer because of the superoxide anion radicals (O2*-) formed in the mitochondria, but is also reduced to H2O2 (hydrogen peroxide) and other reactions with OH and so on and so forth. Now Vitamin C pulls away those oxygen radicals. That's how it works to SAVE you, but again too much is not a good idea. Anyways, all foods have certain effects that negate one form of cancer and cause another. The trick is a BALANCE. Even grass fed beef while known to cause colon cancer and testicular cancer in men, prevents a slew of other cancers, diabetes, and other problems with its Conjugated Linoleic Acid only found in grass fed beef not corn fed beef. Again balance is key. Eat but in moderation. In conclusion this film is trash and an abomination to real scientists and again if it was so true then why at the end of the credits do they pretty much say, \"DO NOT DO THIS!\" It is insulting, dangerous for the average viewer, and full of lies and worst of all false hopes.",
         "Don't waste your time. Aside from being a poorly made, tedious documentary, I can't seem to find any evidence supporting the very outlandish claims that the people interviewed make--I can, however, find plenty of evidence that contradicts these claims. And I don't know about you but I'm going to need a good amount of evidence that someone lost 15 lbs in one day and didn't die, and that Vitamin C can cure cancer. They do make some points that seem okay like eat vegetables, take your vitamins etc. but who didn't already know that? What little evidence that does come up is not verified by the documentary at all, the viewer is left on their own to find it, and for all the major points that the doc makes I cannot find anything(with the exception of Linus Pauling's study on vit c done back in 1968, but it has been contradicted many times since (see the citations on the wikipedia pg of Linus Pauling) and Pauling's study was found to be bunk anyway. (ibid)). Also, I can't seem to find credentials on anyone interviewed here (well, not any credentials they would want to brag about anyway, like how Dan Rogers got his MD from a University in Mexico). Andrew Saul does write the occasional paper in the journal he mentions but he only has a small handful of citations and only then because he cites his own papers. There are also many logical fallacies. For example, Andrew Saul is being interviewed and says \"Doctors say you shouldn't take vitamins\". (or something to take effect) But I've never heard of a doctor doing that. Classic Straw-man fallacy. After all, if that were true how could Centrium claim that it's the \"#1 Doctor recommended\". All the doctors I've spoken to recommend multivitamins, with few reservations. Alright so to sum it up. Very strong, outlandish statements, and no evidence to back them up, not even if you look for it.",
         "Food Matters was a very intriguing and interesting documentary. It gave me an additional viewpoint on the development of modern medicine. Most Americans have no idea what's behind the scenes in this field, but this documentary uncovered some of the mystery. The health experts that were featured in the documentary gave an insight on many controversial issues such as cancer, vitamins, and the lack of nutrition knowledge in today's medical field. I personally enjoyed hearing about how organic methods are rarely considered when treating an illness or disease. The health experts gave us specific cases in history that retained to organic methods of healing being more beneficial than the \"pill for an ill\" approach that medical doctors are being trained to apply in their practices in today's society. It really opened my eyes hearing about how major medical industries are hiding the fact that vitamins and organics can be just as effective in body system healing as the medicinal methods. The health experts produced facts and statistics that proved this and it made me want to look more into the motivation of modern medical industries. In this documentary, the health experts repeatedly told their viewers how today's medical industry is very money driven. It is almost like they value the money over the actual health and well- being of the population. I was bewildered to hear that most medical schools do not thoroughly teach nutrition to their students, and this was said to be a big problem. It is a huge problem because the root of a lot of current illnesses and diseases lie in what the patient's daily diet consists of. I am a strong believer that a healthy, well-balanced diet is detrimental to stay healthy and active, so hearing this small fact from the documentary was no shock to me. In all, this documentary was very insightful and I recommend it for anyone interested in delving deeper into today's medical motivation's and uncovering how Orthomolecular medicine can impact the population in a beneficial way.",
         "The documentary \"food matters\" is about the unhealthy food and chemical injection into the human body. These unhealthy food and injections have increased diseases like stroke, obesity, cancer, Dementia, arthritis, heart attack and many more greatly over the years. Medicine swallowed in order for these diseases to be cured causes more harm because it adds up to the chemicals already in our body. Statistics show that about 106,000 die yearly in America from wrong pharmaceutical drug prescription. Some techniques used were music to accompany images- the sound pitches higher and higher when the documentary shows the chemicals. Another technique used was the variety of voices and perspectives- different age groups, people and genders all showed concerned on the same issue. Statistics was also used. The documentary suggest that people should eat natural food instead of GMO'S and change their life style because it is cheaper, natural and more effective. Changing their life style in the way they eat suggest that people should eat natural home made food and not settle for junk food such as fast food sold like KFC, MacDonald etc. This documentary was effective because they began to prescribe natural medicine instead of pharmaceutical. Also the video suggests that pharmaceutical industry should think about the ethical implications of their product and not only money.",
         "In general I support a lot of the \"emotional tone\" of this movie. I do think in many cases the medical industry has turned into the sickness industry. For an example of that you can watch a movie called the \"Widowmaker\" about a man who developed a scan to determine if you have cardiac disease risk and it was ignored. A lot of stuff that is cheap and effective, such as diet, is being ignored so we can keep playing this food drug pusher game with people and making them sick. There is that going on in the world, and in our country. But, you have to go at something like that very carefully and factually. Right away in this movie the woman Charlotte Gerson talked about there being 52 nutrients that plants need to survive. Well, science only knows about 18 of them. I listed them, they are well known, and it is not mystery how they were found. She did not mention any of the elements outside of the 18, but insinuated that lack of these nutrients causes cancer and disease. That is when I turned the movie off. When a writer or director does not vet their guests or their facts, and decides to go with statements made in this movie without qualifying them or explaining them, I think that is disinformation and manipulation. There is a lot of that in the nutrition industry. There are people that tell you that any and everything can cure cancer, or cause cancer. I gave this movie a 2 because it is not super-terrible or unwatchable, but it is dishonest in my opinion and did not check or explain its facts. Skip it and watch other movies, but more importantly, keep you thinking cap on, and anything that sounds fishy, look up and try to find out more about. Don't believe anything based on authority. 2/10",
         "The basis for this entire documentary is that they food we put into our bodies is not good for us and we take too much medicine. So much of the food we eat today is, compared to years ago, is covered in pesticides and produced in an unhealthy way. We are putting all of those toxins in our bodies and our bodies are then getting \"defensive\" and it acts like the body is being intruded. What they are saying about pesticides not being good for us is true, but not everyone has access to fresh, raw, organic foods. They come across like you're a horrible person if you don't eat the way they want you to. They also talk about how we take too much medicine. Every problem, even if its a little one, here we go, busting out the meds. While yes, its true that we do take a lot of medicine, it doesn't necessarily mean that we are being horrible to our body. I had a headache the other day, I did everything I could to get it to go away. I shut the blinds in my room, turned off the lights and the television, laid down, and closed my eyes. My headache never went away, it had been hours since it started, but I didn't want to take medicine for it. Eventually I decided to because it was getting annoying. THe medicine kicked and it went away. I haven't had a headache since. Medicine isn't always bad. Later on in the document they discuss cancer. Charlotte Gerson said that our body is amazing at what it can do. While i do agree with her, I do start to disagree when she says that the way we eat basically makes cancer develop. If we change our eating habits to the fresh, raw, organic food, our body will be able to fight off any cancer that tries to form. That is just simply untrue. I know one person and have heard of others being really super healthy and still getting cancer. The person I know lives in Los Angeles, has money, and access to these kinds of foods. He's always drinking water, eating right, taking care of his body, and he still got cancer. I think that the people in this video are very one sided and need to look at everything from both sides of the spectrum.",
         "I am inspired. I am motivated. I love watching this documentary, even though it's the fifth time I've seen it. Watching this has been on my to-do list for a long time. And, am I glad I saw it! I showed it to many of my friends and we all wholeheartedly agreed that this is a documentary we want to see a few times a year. It's that good! Every time I see it, I hear something new. And for the stuff I've already heard, it just further ingrains it in my sub consciousness and I feel myself internalizing its details more and more. I walk away feeling strong, smart, and empowered about my lifestyle decisions, albeit a bit frustrated at times because not enough people know this information. I pretty much hang on every line of Food Matters. I love the discussion of vitamins and the vital role vitamin C can play in helping fight illness at various quantities. It was fascinating to learn about the therapeutic effects of niacin, and its history as a cure for depression with the founder of Alcoholics Anonymous. There is so much more that I could write but you should see it for yourself. It's fantastic!",
         "Such a bimodal distribution in the reviews ... wonder why? Look at the content. Those who are for it, are totally for it, and in every case it is because they have personally experienced what Saul is talking about. Those against it are totally against it, abusive in fact, have never .. . let me repeat: NEVER tried Saul's recommendations. Also, in general they are squaking out of being completely offended because their pride has been hurt by Saul's accusations. Can you say \"biased\"? Especially with regard to vitamin therapies. For every peer review with original data (not trumped up \"comprehensive reviews\" which is a ploy to cherry pick data to fit your desired outcome) ... original data that shows no benefit from IVC you will find NONE that followed the recommended protocol that would achieve a minimum of millimolar concentrations of vitamin C in blood serum. In otherwords ... they're all underdosed. For those properly dosed (usually requires a minimum of 10g/dose of intravenous vitamin C) EVERY study has found at a minimum significant quality of life improvements from energy, to pain management, to organ function, to attitude and wellness for most of the respondents. There are at least 4 dozen peer reviewed studies all with original data, that show such findings ... and that's quality of life ... if you want to actually kill cancer with vitamin C you need even more. At least 50g per dose. Not increasing blood levels of vitamin C up into the millimolar range has been a very effective way to create a study that pretends to show that Vitamin C is ineffective at killing cancer. Also, the convenient neglect regarding quality of life improvement from vitamin C is also very devious by those more interested in saving the reputation of their medical comrades than in looking deeper into the data to see how horribly underdosed their \"proof\" is, or how all the test subjects were stage 4 metastatic chemo resistant patients in their coveted anti-vitamin C studies. Meanwhile many oncologists, not all mind you, will push experimental oral chemo drugs costing $10,000 per month to buy someone an extra %15 longer survival, whereas PROPER-protocol (emphasis on \"proper) IVC (intravenous vitamin C) in general extends life far further for 1/8th that cost plus imparts a ton of quality of life improvements while the oral chemo makes people feel like crap and want to die. These are the facts. And FYI .. that crap about super high dose vitamin C causing cancer ... beyond laughable. All the actual tests prove the opposite: higher dose more selectively kills cancer (while strengthening the normal cellular matrix). Don't believe me? then Look up the following ID numbers here (http://www.ncbi.nlm.nih.gov/pubmed) if you don't believe me: QOL (quality of life): 24500406 22021693 PMC2693571 PMC4199254 PMC3691494 14606098; Prevent sepsis & organ failure: PMC3937164; Corrects cancer-caused scurvy: 15068981 19284416 15690864; Decreases Inflammation: PMC3751545 PMC3968960 PMC3480897; Strengthens Immunity: PMC3202620 PMC4015650 1590939 7772741 PMC3111558 18468413; Improves chemo-effectiveness: 21402145 19254759 10559547 10067654 15523102 17283738 17405678 PMC3260161 17367938 15514298 PMC3128375 PMC2363673 PMC3482496; Inhibits the spread of cancer: PMC2820478 15166494 PMC2562367; IVC achieves cancer-killing concentrations: 22332036 PMC1224653 PMC1885574 4430016 PMC2363673 18678913; Relatively extremely safe when done correctly: PMC2898816. Find out for yourself. Just type each number above here: http://www.ncbi.nlm.nih.gov/pubmed",
         "My review of the Documentary Food Matters, that overall it was an interesting documentary with content that many people would not know about. The documentary uses many nutritionist and people with PhDs talk about the medical professions and how they do not know about nutrition. In the documentary, they did not organize the content very well and switched topics very quickly to where they missed some of the things they wanted to say and had to come back to it. Some of the people who were interviewed, only saw things the way they wanted to see it. Some of them took a one sided argument and did not care to see doctor's point of view when it comes to medicine. On top of this, some of the interviewees made some claims that were very hard to believe to be true. In one instance of this, the guy states \"by cleansing your body and drinking lots of water, I know a guy that lost 15 pounds in one day.\" Anyone with common sense would know that this is nearly impossible and if it is possible, then it very unhealthy and no one, especially someone with PhD, should not be promoting someone to lose weight that quickly. There were also other claims that were made in this documentary that I find very hard to be true and it does not seem that they are able to prove a lot of their \"facts\".On the other end of the spectrum, much of the content was very good information that more people need to know about. I believe that it is important that more people care about their health and that they change what they put into their bodies to help themselves. American people also need to realize how some drug can have many negative effects on them, if not kill them and if there is another way to go about fixing the issue that is healthier and more natural than people should try to use the healthier way."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [],
      "summaries": [
         "\"Let Thy Food Be Thy Medicine, And Thy Medicine Be Thy Food.\" - Hippocrates That is the message from the founding father of modern medicine echoed in this brave new documentary film brought to you by Producer-Directors James Colquhoun and Laurentine ten Bosch. 'Food Matters' is a hard hitting, fast paced look at our current state of health. Despite the billions of dollars of funding and research into new so-called cures we continue to suffer from a raft of chronic ills and every day maladies. Patching up an over-toxic and over-indulgent population with a host of toxic therapies and nutrient sparse foods is definitely not helping the situation. In a personal quest of discovery James & Laurentine together with a film crew and the editorial and production expertise of Enzo Tedeschi have set out on an independent mission to uncover the wholesome truth. The filmmakers have interviewed several world leaders in nutrition and natural healing who claim that not only are we harming our bodies with improper nutrition, but that the right kind of foods, supplements and detoxification can be used to treat chronic illnesses as fatal as terminally diagnosed cancer. 'Food Matters' seeks to uncover the business of disease and at the same time explore the safe, cheap and effective use of nutrition and supplementation for preventing and often reversing the underlying causative aspects of the illness. With the premise of the film being: access to solid information helps people invariably make better choices for their health. The 'Food Matters' duo have independently funded the film from start to finish in order to remain as unbiased as possible, delivering a clear and concise message to the world. Food Matters.",
         "Food Matters explores the world of Orthomolecular Medicine and how it compares to traditional Modern Medicine. The documentary begins with talking about how our food travels many miles before getting to it's final destination and by the time we buy it it is at least a week old. The freshness of our foods have drastically changed throughout time. The health experts start with the issue of the soil crisis and how it lacks the nutrients for food to grow in a healthy, natural way. Modern day chemists have found ways to optimize our crops for faster, more efficient growth. Andrew Saul, a therapeutic nutrition specialist and author of a famous Orthomolecular based text, reveals to us many paradox ideas about raw vs. cooked foods. Cooked food has many effects on the the body. Later on, David Wolfe, a raw food nutrition expert, introduced us to many of the world's unrecognized superfoods and how they positively contribute to our health. He suggests many alternatives to our daily diets. It was also mentioned that the medical field has a certain stigma about the use of vitamin supplements within their practice. The use of vitamins, they said, could reshape the economy of the medical field. The health experts linked many immune disorders to the everyday, unhealthy diets of our society. Many of the health experts, such as Ian Brighthope, talked about how immune disorders have developed into a cultural anomaly that differs throughout the world. They mentioned the medical methods used today and how it presumably could cause unexpected health effects. Charlotte Gerson, founder of the Gerson Institute, then comes in to speak about cancer treatment and research and how it plays a role in the health of our society. Further education was stressed to find a solution to this worldwide epidemic.",
         "Food Matter examines how the food we eat can help or hurt our health. Nutritionists, naturopaths, doctors, and journalists weigh in on topics organic food, food safety, raw foodism, and nutritional therapy."
      ],
      "budget": 0
   },
   "movielensId": 103521,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-10-08",
      "dvdReleaseDate": "2009-10-20",
      "directors": ["James Colquhoun"],
      "runtime": 74,
      "movieId": 103521,
      "title": "Food Matters",
      "mpaa": null,
      "actors": [
         "Andrew Saul",
         "Charlotte Gerson",
         "Dan Rogers",
         "David Wolfe",
         "Ian Brighthope",
         "Jerome Burne",
         "Phillip Day",
         "Victor Zeines"
      ],
      "imdbMovieId": "1528734",
      "originalTitle": "Food Matters",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["r4DOQ6Xhqss"],
      "plotSummary": "With nutritionally-depleted foods, chemical additives and our tendency to rely upon pharmaceutical drugs to treat what's wrong with our malnourished bodies, it's no wonder that modern society is getting sicker. Food Matters sets about uncovering the trillion dollar worldwide sickness industry and gives people some scientifically verifiable solutions for curing disease naturally.",
      "tmdbMovieId": 26018,
      "avgRating": 3.33333,
      "releaseYear": "2010",
      "numRatings": 30,
      "posterPath": "/g1u0Mf4VKKklC8fKsvAh5n5pk8T.jpg"
   }
}