{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "coffee shop",
            "id": 5483
         },
         {
            "name": "slacker",
            "id": 8631
         },
         {
            "name": "thirty something",
            "id": 14886
         },
         {
            "name": "carefree",
            "id": 185863
         }
      ],
      "imdb_id": "tt2234025",
      "video": false,
      "title": "Coffee Town",
      "recommendations": [
         370835,
         13311,
         17236,
         32163,
         10109,
         32150,
         32229,
         74718,
         206,
         37850,
         32162,
         44750,
         26486,
         146837,
         285844,
         18654,
         35851,
         31723,
         174343,
         267457
      ],
      "backdrop_path": "/hac0ngx7NLbLzJ3zWD2Xyb3ch7n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Will",
               "gender": 2,
               "credit_id": "52fe4d6c9251416c9111596b",
               "name": "Glenn Howerton",
               "profile_path": "/jccwzHfPbzv87iZ7YTVphQx7BTg.jpg",
               "id": 77870,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Chad",
               "gender": 2,
               "credit_id": "52fe4d6c9251416c9111596f",
               "name": "Steve Little",
               "profile_path": "/mm2AKYPv9raTzKo8eVvA1ClmPBa.jpg",
               "id": 141433,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Gino",
               "gender": 2,
               "credit_id": "52fe4d6c9251416c91115973",
               "name": "Ben Schwartz",
               "profile_path": "/ty2N3LuUiXO1uKyRg74DUN82xQe.jpg",
               "id": 222121,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Becca",
               "gender": 1,
               "credit_id": "52fe4d6c9251416c91115977",
               "name": "Adrianne Palicki",
               "profile_path": "/g9yOTKR1qsRrxKnR77hMz4dCka7.jpg",
               "id": 88995,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4d6c9251416c9111597b",
               "name": "Josh Groban",
               "profile_path": "/mZ6KCsmEgg3JVq2dTmE2H5R1WNk.jpg",
               "id": 117470,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Toby",
               "gender": 0,
               "credit_id": "52fe4d6c9251416c9111597f",
               "name": "Perry Joshep",
               "profile_path": null,
               "id": 1138600,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Female Barista",
               "gender": 0,
               "credit_id": "52fe4d6c9251416c91115983",
               "name": "Kristen Riley",
               "profile_path": null,
               "id": 1178367,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Toby",
               "gender": 2,
               "credit_id": "52fe4d6c9251416c91115987",
               "name": "Josh Perry",
               "profile_path": "/vGvSQeTSxoMj8Zex1AKwDSTBO26.jpg",
               "id": 1174106,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Cop",
               "gender": 2,
               "credit_id": "55c9e893c3a368597b000f2b",
               "name": "Matt Walsh",
               "profile_path": "/pHwLExdQGQYg8yNVSaF97TkMsoQ.jpg",
               "id": 59841,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Manager",
               "gender": 2,
               "credit_id": "55c9e8a4c3a368752c001c1e",
               "name": "Brian Huskey",
               "profile_path": "/krewoXz2qgDdIAB2PTGRuilX0K5.jpg",
               "id": 54728,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Roommate",
               "gender": 2,
               "credit_id": "55cbcc64c3a3685701000b66",
               "name": "Jake Johnson",
               "profile_path": "/7X6pb4SDs9RoXi5gI4Nl8ZiPO4l.jpg",
               "id": 543505,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d6c9251416c91115949",
               "name": "Brad Copeland",
               "profile_path": null,
               "id": 68574,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d6c9251416c9111594f",
               "name": "Brad Copeland",
               "profile_path": null,
               "id": 68574,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d6c9251416c91115955",
               "name": "The Wellspring",
               "profile_path": null,
               "id": 1178365,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d6c9251416c9111595b",
               "name": "Anthony B. Richmond",
               "profile_path": null,
               "id": 14139,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d6c9251416c91115961",
               "name": "Ned Bastille",
               "profile_path": null,
               "id": 62759,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d6c9251416c91115967",
               "name": "Jason Garner",
               "profile_path": null,
               "id": 1178366,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.239494,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 198062,
      "vote_count": 52,
      "budget": 0,
      "overview": "Three thirty-something friends band together when their carefree existence is threatened.",
      "similar": [
         12133,
         41733,
         82690,
         2652,
         76025,
         50359,
         2293,
         48034,
         155084,
         82532,
         13166,
         9794,
         1419,
         35428,
         14313,
         465260,
         24385,
         285025,
         33506,
         432583
      ],
      "original_title": "Coffee Town",
      "runtime": 87,
      "poster_path": "/m8qNXU2eDgZ1rDJhjRM2MinM2VK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-07-09",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://coffeetown.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brad Copeland"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Brad Copeland"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2234025/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4NTE3Njg2OF5BMl5BanBnXkFtZTcwMDU0MjQ2OQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Adrianne Palicki, Jake Johnson, Glenn Howerton | See full cast and crew »"],
      "reviews": [
         "This is one of those films that grabbed me right off the bat with it's true-to-life dialogue and immensely fun detailing of the small but hilarious things we all experience in daily life but have never taken the time to put into words. It's the movie version of GOOD stand-up comedy, and while I'm not much of a reviewer, I wasn't ten minutes into this before I felt an insatiable obligation to share the pleasure with someone. Which seems like a natural sentiment considering how much charm this movie derives from its relatability. The plot is simple enough and seems sufficiently outlined in IMDb's summary, so I won't repeat it here. Note: For fans of, \"It's Always Sunny in Philadelphia\", Glenn Howerton brilliantly deadpans the same type of semi-sociopath we've grown to...love to laugh and shake our heads at. He makes this film a treat. But what makes this movie truly engaging is its ability to produce a seemingly nonstop stream of jokes so personally relevant to the viewer and our daily lives, as to make one feel as if they're just as much of an insider to the humor as they are a witness. The dialogue's pace is its other strong suit. An off-hand remark may be overlooked by the characters as their attention is diverted elsewhere (along with the viewers') and and may have you intermittently wishing for a pause button in order to better relish just how funny these gems are. But by maintaining its momentum, the movie is allowing the viewer to catch some of these fastballs themselves, which of course, makes them that much more enjoyable. I'd compare its pacing with that of NBC's 30 Rock, but by replacing Rock's off-brand style of quirky jokes with the off-beat dialogue of a quirky character? The increase in humor just explodes exponentially. Really, this movie is THAT funny. If you're anything like me and not generally a laugh out loud type of person when it comes to cinema, I'll bet you'll find yourself coming out of this feeling like I did...that you really didn't have much of a choice in the matter! Many Kudos to CollegeHumor for that rare comedy that you'll probably want to watch again immediately after your first viewing so as to be better prepared for the onslaught of funny.",
         "Not enough comedies like Coffee Town are made today. The comedies in theaters fall into one of three categories: the sequel that shouldn't have been, the raunchy film with heart (one I never get tired of seeing), or the pointless star vehicle. Brad Copeland's Coffee Town is a simple, satisfying picture, not intent on being offensive or taxing, but more fixated on being a fun ninety minutes one can enjoy without the burden of being too explicit, too sentimental, and too self-satisfying. It's also nice to see that despite lacking these three things, it doesn't hesitate to welcome in some middle- class commentary that may definitely hold some truth in modern society. Will (Glenn Howerton) is a website manager in his early thirties, who uses the local coffee shop, Coffee Town, as his office. It has everything he needs from a comfortable, welcoming atmosphere, roomy workspace, and free Wi-Fi. It is everything he could ever want in a workplace at least until him and his two pals - the lackadaisical cop Gino (Ben Schwartz) and rolly-polly Chad (Steve Little) - discover that the owner of Coffee Town plans to turn the shop into a hip, modern bar and eliminate the comfort and marginal quietness that the joint has adapted over the years. The three decide to stage a robbery to give the illusion that the neighborhood in which the new bar will soon be erected is unsafe and unreliable, thus leaving their own coffee shop intact. In the meantime, Will is trying to find a way to grab the attention of Becca (Adrianne Palicki), a frequent customer to the shop and a local jogger, who is in the process of being smitten by Sam (singer Josh Groban), a cocky, condescending employee at the joint who is currently in a second-rate band. This is standard-fare, with a familiar plot and setups that don't seem too distant from being foreseeable. However, the film has a great niceness that prevents it from being too mean-spirited and nihilistic - as some comedies have gone on to be recently - and, finally, it doesn't feel like a competition to be too offensive and gut-turning with its humor. The language is present, but manageable and rather light, the raunchiness is almost nonexistent, which is a refreshing change of pace, and, for once in a long time, the tired male conversations of guiltless, free- spirited sex is kept to a minimum. However, I could see writer/director Brad Copeland being successful at incorporating raunchier, more sex-driven elements into a comedy. But incorporating such elements into Coffee Town would be out of place and thoughtless. This isn't a story that needs to be told through the lens of adolescent maturity. It doesn't need constant penis jokes, cruder sex references, and the use of several four letter words and one particular twelve letter word. It gets by almost solely on the quirks and the likability of the characters. For example, for the first thirty minutes, Copeland fixates the picture not on bizarre strands of events that show the characters' stupidity and denseness, but rather on the commonalities of them that I can see many audience members seeing themselves in. After those thirty minutes pass, these characters begin to feel like real life friends of ours, and if they don't, we can at least match a face of a person we know to their specific character. This is the debut film from the guys over at CollegeHumor, the website known for pumping out hilarious webshows and internet videos on demand. Judging from the content of their shorts, this could've easily been an extremely vulgar and graphic picture. It's nice to see the men behind the film took a more careful, conservative approach to the story. Again, they show that not every comedy needs to include obscene, shocking amounts of coarse language to be funny and memorable. Going back to the idea that Coffee Town offers some considerable truth about modern middle class America is the way it comments on the increasing need for acceptance. Will goes to the coffee shop daily not because he has a desire to freeload off of its Wi-Fi and casual resources, but because he could stay in his apartment, alone, growing older by the minute, wasting away on his laptop. At least when he grows older and wastes away on his laptop at Coffee Town he is in the presence of others and out in the open. This way he can see life pass him by right before his eyes; he won't need to turn on the TV or the evening news to realize it. Just by welcoming in this concept and idea, Coffee Town offers more to think about than several other comedies released this year. Starring: Glenn Howerton, Ben Schwartz, Steve Little, Josh Groban, Adrianne Palicki, and Josh Perry. Directed by: Brad Copeland.",
         "I found this film by accident and am glad I did. What a great film, great comic timing, a great storyline and a great cast. Yes I thought the film was great. The film harks back to the films Kevin Smith made in the beginning of his career and I wish he had continued. I thoroughly enjoyed this film from its brilliant and creative opening credits to its little jokes in the end credits. There were actual laugh out loud moments and I really think that Josh Groban stole the show. The cast worked well together and they all seemed to enjoy the film. The extras, down to Phil's happy birthday opera being dismissed was really funny. Those who hate politically incorrect jokes may not enjoy the film as much as I did, but if you just enjoy a joke for the sake of a joke then this film is one to see.",
         "I'm actually not much of a comedy movie fan, why? Because most really aren't worth wasting your time on. I am a fan of undiscovered movie gems though, and this really is one of those. I laughed very loud at so many of the scenes I couldn't count them all. It's very funny, very close to the line at times, and feels fresh all the way through. It has charm in spades. I will be recommending this to those who like a good comedy, though once again, I still hate Adam Sandler (and his cronies) so given that some intelligence probably went into making this little flick, Sandlerites may pass.",
         "This is just one of those times where you get someone who has yet to produce a feature film do so and hit it out of the ballpark. It has a funny storyline, a great cast, and a veritable who's who of cameos from college-humor actors. The best thing about it however is it's writing, it is one of those movies that doesn't take itself too seriously and in that allows it to have quite juvenile humor. Josh Groban plays a great antagonist in the movie, and I hope to soon see him in more comedies as he certainly has a nac for acting (what is he not good at?). I would recommend this for anyone who wants to see a good and refreshingly original comedy. It follows movies like Ted and 21 jump street as refreshing and original comedy on the silver screen.",
         "I'm not usually a comedy person, but I really enjoyed Coffee Town! Great, absolutely hilarious cast and great ending- this is honestly one of the best movies I've seen in a while. Josh Groban and Ben Shwartz's characters got me laughing so much, and Glenn Howerton's character just adds a genuine spark of life. The storyline is original and very well written. It's not another one of those trashy humored, meaningless comedies like those that we're so used to these days, and I would recommend this movie to everyone in general, not only comedy lovers. Trust me- it's way better than it seems in the trailer. It's definitely a good movie to see with friends and I really hope they make another one sometime! After you see Coffee Town you can judge for yourselves, but I'm going to recommend this movie to all of my buddies.",
         "There must be two Coffee Towns because the one I'm watching certainly doesn't tally with the reviews describing this as hilarious. Maybe you have to be one of the people who squats in one of these places to see the sub-text containing the secret hilarity but half an hour in and there's no sign of it. Forty-five minutes. Nope, still dull. One hour, losing the will to live. One hour, fifteen minutes and I'm wishing I had some drying paint to watch instead. Nah, I give up. Can't even bear to stick with it until the end. I'm out. Continuity errors are irritating too.",
         "I like most of what college humor does but this one isn't it. this feels like a sketch or a 30 minute sitcom episode stretched to a movie. the character development is close to nothing. the only character who gets any depth is the lead but hes just not that interesting to begin with. all the other character are static background that barely have anything to do with the movie and its story. your not sure how these guys meet and why they're even friends. acting is OK and Ben schwartch is the best of them unfortunately he has a simple role to play that gets repetitive fast. the story is very simple making you wounder why are you watching this and why so much effort was put into something so meaningless. the story tries to deliver some thought on life, karma and good and bad but barely scratches the surface. if your bored and like simple comedy this ones fine but just about any other movie to TV show will better fill your time.",
         "a normal comedy. not sentimental, not aggressive, not special. only a refreshing picture about few peoples, a coffee shop 's small universe and social relations. friendship, love, vulnerabilities, jokes, teenagers in body of men, all seems be known and only the science to not has the ambition to impress does the difference. a nice film for the inspired manner to say an ordinary story. for the sensibility and grace, for the common pieces from many other lives, for the strange innocence of characters and for the acting. a film who remains after its end a surprise. because after a lot of waves of humor in different proportions and packages, a film about a not significant space and its people could be source of fresh air.",
         "At first I thought it was rather amusing but that lasted for about five minutes and then it was like ho-hum. It seems that the writers really didn't know what they were doing when they wrote this screenplay and the actors are just simply \"phoning it in.\" Even Groban's acting like he's a bad musician is such an epic fail. I get it, he likes to play characters that are the opposite of him but this whole, \"Hey, I'm supposed to be this nice guy but I like playing the d-bag\" routine is getting OLD. Also, joking about the ex-roommate who died of AIDS? THAT'S NOT COOL! I like sarcasm and I can watch things that have insulting humor with no problem but you know what? I also know when to draw the line. If you're going to watch this movie, make sure you're high or drunk first because it's obvious that's who they were trying to attract...STONERS."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["CollegeHumor"],
      "summaries": [
         "Will (Glenn Howerton) is a 30-something website manager who uses local café, Coffee Town, as his office. When the owners of the shop discuss plans to convert Coffee Town into a bar, Will enlists the help of his two best friends Chad and Gino (Steve Little and Ben Schwartz) to save his freeloading existence. In order to thwart the plans of Coffee Town's owners, the trio stages a robbery to create the illusion of an unsafe neighborhood not suitable for the proposed venue. Also standing in their way is Sam (Josh Groban), a disgruntled barista with delusions of grandeur-he wants to be a rock star-and Will's heartache over unrequited love for Becca (Adrianne Palicki).",
         "A website manager enlists the help of his two friends in order to convince the owners of his favorite coffee shop -- which doubles as his office -- not to turn their business into a bar."
      ],
      "budget": 2000000
   },
   "movielensId": 103819,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-07-09",
      "dvdReleaseDate": null,
      "directors": ["Brad Copeland"],
      "runtime": 87,
      "movieId": 103819,
      "title": "Coffee Town",
      "mpaa": "NR",
      "actors": [
         "Glenn Howerton",
         "Steve Little",
         "Ben Schwartz",
         "Adrianne Palicki",
         "Josh Groban",
         "Perry Joshep",
         "Kristen Riley",
         "Josh Perry",
         "Matt Walsh",
         "Brian Huskey",
         "Jake Johnson"
      ],
      "imdbMovieId": "2234025",
      "originalTitle": "Coffee Town",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["MagOLStZWvs"],
      "plotSummary": "Three thirty-something friends band together when their carefree existence is threatened.",
      "tmdbMovieId": 198062,
      "avgRating": 3.1413,
      "releaseYear": "2013",
      "numRatings": 46,
      "posterPath": "/m8qNXU2eDgZ1rDJhjRM2MinM2VK.jpg"
   }
}