{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "andy hardy",
         "id": 191107
      }],
      "imdb_id": "tt0034458",
      "video": false,
      "title": "Andy Hardy's Double Life",
      "recommendations": [],
      "backdrop_path": "/jBvQbFLF8HehqvBRFPChPatN5xa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andy Hardy",
               "gender": 0,
               "credit_id": "52fe4631c3a36847f80f1ed9",
               "name": "Mickey Rooney",
               "profile_path": "/bgCm55k2eo2YV5bMn3D0O4NPwU.jpg",
               "id": 1937,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Polly Benedict",
               "gender": 1,
               "credit_id": "52fe4631c3a36847f80f1edd",
               "name": "Ann Rutherford",
               "profile_path": "/3ZRWZ6Opn94EXXbkJalW0TudTB.jpg",
               "id": 11495,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sheila Brooks",
               "gender": 1,
               "credit_id": "52fe4631c3a36847f80f1ee1",
               "name": "Esther Williams",
               "profile_path": "/nkQlUjqUymEkYNkF5PK6xN2IcWg.jpg",
               "id": 129520,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Judge James K. Hardy",
               "gender": 2,
               "credit_id": "53023440c3a3680a3730e7cc",
               "name": "Lewis Stone",
               "profile_path": "/mtFdA4QucZWYO6SlYEgiNmbucyx.jpg",
               "id": 29259,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Marian Hardy",
               "gender": 1,
               "credit_id": "5302344ec3a3680a2e34d553",
               "name": "Cecilia Parker",
               "profile_path": "/rV7LsftAc8W4iB76O5BumMr2rr5.jpg",
               "id": 90075,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mrs. Emily Hardy",
               "gender": 1,
               "credit_id": "5302345fc3a3680a113598ec",
               "name": "Fay Holden",
               "profile_path": "/uqaLmVtEmNFXjWFLRraTcjG9B0O.jpg",
               "id": 117414,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Aunt Milly Forrest",
               "gender": 1,
               "credit_id": "5302346fc3a3680a11359975",
               "name": "Sara Haden",
               "profile_path": "/wufYXd5Cy2EESw2VRa00tmlzH8s.jpg",
               "id": 85956,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Jeff Willis",
               "gender": 2,
               "credit_id": "5302347cc3a3680a1932b78b",
               "name": "William Lundigan",
               "profile_path": "/2KwSX3SEpa1rfoEpMGM5gywvSjF.jpg",
               "id": 18805,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Botsy, One of the Gang",
               "gender": 0,
               "credit_id": "53023489c3a3685ce708aab2",
               "name": "Robert Pittard",
               "profile_path": null,
               "id": 1293780,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "'Tooky' Stedman (as Bobby Blake)",
               "gender": 2,
               "credit_id": "53023497c3a3680a21342ab2",
               "name": "Robert Blake",
               "profile_path": "/fA9Zg9OprSMxjy54KuH1WDiCMvq.jpg",
               "id": 9287,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53023417c3a3680a21341af4",
               "name": "George B. Seitz",
               "profile_path": "/3mmyEbOIjH2vftpZ9ZjHxRFlLqv.jpg",
               "id": 89749,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53023424c3a3680a092fbe44",
               "name": "Aurania Rouverol",
               "profile_path": null,
               "id": 1072714,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 1,
               "credit_id": "5302342fc3a3680a3730e6f6",
               "name": "Agnes Christine Johnston",
               "profile_path": null,
               "id": 148426,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.119867,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43167,
      "vote_count": 3,
      "budget": 0,
      "overview": "Andy (Mickey Rooney) is about to head off to college but he's got a few things to take care of before leaving. For starters, he must try and sell his junk car for $20 to pay for a bill and he must convince his father (Lewis Stone) not to go with him to college. Worst of all is that Polly (Ann Rutherford) wants to make up but her best friend (Ester Williams) decides to give Andy a test.",
      "similar": [
         155752,
         43808,
         43789,
         43846,
         43793,
         43826,
         43483,
         120885,
         71012,
         206186
      ],
      "original_title": "Andy Hardy's Double Life",
      "runtime": 92,
      "poster_path": "/inNImfsIH8lBuL4w8N8ubgeBL4c.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1942-12-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "IT'S A ROMANTIC BATTLE-ROYAL!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George B. Seitz"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Aurania Rouverol",
         "Agnes Christine Johnston"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034458/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAxMjc3ODE4MTBeQTJeQWpwZ15BbWU3MDEyNzQwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lewis Stone, Mickey Rooney, Cecilia Parker | See full cast and crew »"],
      "reviews": [
         "Like most Andy Hardy movies, this film is fun, uplifting and entertaining. It's hard to watch it without smiling. In this edition of the series, Andy, played by Mickey Rooney, is preparing to depart for college. Before he leaves, he encounters one of his typical adolescent crises as Polly Benedict(his ex-girlfriend) and her visiting friend decide to teach him a lesson. Ann Rutherford returns as Polly, and her friend is played by Esther Williams in her studio debut. The acting, writing and directing are all very good in this picture. Although this type of movie might not appeal as much to modern audiences, it is still a good film worthy of your time, and if you enjoy Andy Hardy movies, I would certainly recommend that you see this one.",
         "Andy Hardy's Double Life finds Andy planning to go off to Wainwright College which was the Judge's alma mater. Interesting that in 1942 the war apparently had not yet come to Carvel. I would have thought that Andy would be worried about the draft at this time. But Mickey Rooney has his usual girl trouble and I swear I never did understand why Ann Rutherford as Polly Benedict just didn't give this guy the heave ho. It seemed like every film he was getting involved with some other girl, usually an MGM starlet the studio was trying to showcase. In this case it was quite the showcase as Esther Williams who played a college coed and guest of Ann Rutherford decides to do some psychological research on the American male. Guess who she decides will be her guinea pig? Cecilia Parker as Rooney's sister is also having troubles with William Lundigan who is a drinker and is before Lewis Stone for driving while intoxicated. As this hits close to home, Stone is looking for a root cause of the alcoholism as opposed to just tossing Lundigan in the clink. In an even briefer role at the very end of the film is another MGM showcase Susan Peters. She plays a young woman off to Wainwright College and she will be the first in a class of coeds as the venerable institution is admitting girls for the first time. That gets Rooney's attention real fast. Peters would have too brief a career, falling victim to a hunting accident that caused paralysis. She was a lovely talented young lady, probably best known as Ronald Colman's niece in Random Harvest. Andy Hardy's Double Life is an average entry in the series and will satisfy the fans of the eternal Mick.",
         "Despite having graduated from high school three movies ago, Andy Hardy has still not started college. And he won't start it in this movie, either! That comes in the next entry, Andy Hardy's Blonde Trouble. Here, though, we have Andy selling his jalopy to get the money to retrieve his convertible from storage in New York. The problem is the boys he's sold it to keep stalling on paying him and Andy's already written a check that will bounce if he can't get the money in time. Andy's also dealing with his usual drama with the opposite sex as well as trying to help his sister Marian and father Judge Hardy with their problems. Marian's still in love with her beau Jeff, the drunk driver. Judge Hardy is bending over backwards to prove a lumber company truck was responsible for an accident with a little boy (Robert Blake). This one's notable for being the feature film debut of Esther Williams. Esther plays a psychology student who teams up with Ann Rutherford's Polly Benedict to teach Andy a lesson. Have no fear, Esther fans, she does get into a bathing suit for one scene. Gorgeous as always, Esther also showcases her romantic comedy potential. Her scenes with Mickey are some of the movie's highlights. This is also, sadly, the last of the Hardy films with Ann Rutherford. She left the series after this and never returned. Rutherford was one of my favorite parts of these movies. She was always adorable beyond words with great comic timing and wonderful chemistry with Mickey Rooney. Cecilia Parker gets more to do as Marian than she has in awhile. She was a larger presence in the early films in the series. If I'm to be honest, she was never a favorite part for me. She might appeal more to many viewers as Marian is a slightly more modern (i.e. flawed) character. This would be her last appearance in the Hardy series until the attempted reboot in the '50s. Lewis Stone is perfect, of course. Judge Hardy was often the highlight of these movies, even when Andy was the focus. Here Stone gets a little comedy to work with but the best parts of the movie are his father-son scenes with Mickey Rooney. For his part Rooney is excellent, handling both comedy and drama with ease. Fay Holden gets few scenes as Mrs. Hardy but makes the most of them, stealing the picture each time she's on screen. This is one of the best Andy Hardy movies. A delightful mix of comedy and light drama. I smiled through the whole thing. I happen to love the Andy Hardy movies, corn and all. Your mileage may vary, though. If you're too cynical to enjoy these innocent movies with their sentimentalism and old-fashioned values, then spare yourself the trouble of watching. Also spare the rest of us as the world has enough snarky cynics as it is.",
         "Before leaving for Wainwright College, Andy (Mickey Rooney) has time for another romance set in his Carvel hometown. This time it's MGM's future swimming sensation Esther Williams (as Sheila Brooks). Introduced in this film as a psych major, Ms. Williams quickly became a major star. Inspiring half (or all) of the film's title, she is very beautiful. In their most memorable scene, Williams and Andy share an underwater swimming pool kiss. Meanwhile, Judge Hardy (Lewis Stone) gets involved in a dispute involving mischievous preteen Bobby (Robert) Blake (as \"Tooky\"). This episode's main storyline is that Andy doesn't want Judge Hardy to appear with him at college, which gives the two actors a nice generational conflict... \"Double Life\" featured the last appearance of Andy's off-and-on Carvel girlfriend Polly Benedict (Ann Rutherford) in the movie series. She was eventually asked back, but declined. After this feature, Mr. Rooney's \"Andy\" finally did go to college. He spent the last several films preparing. It seemed like MGM was reluctant to change the setting. They probably should have tried to do so earlier, because the series had become very tired; ironically, the scenes with the older Mr. Stone are the acting highlights. In a couple of scenes, Rooney has an obvious lip ailment (possibly a \"cold sore\"). **** Andy Hardy's Double Life (12/42) George B. Seitz ~ Mickey Rooney, Lewis Stone, Esther Williams, Ann Rutherford",
         "Andy Hardy's Double Life (1942) ** 1/2 (out of 4) Andy (Mickey Rooney) is about to head off to college but he's got a few things to take care of before leaving. For starters, he must try and sell his junk car for $20 to pay for a bill and he must convince his father (Lewis Stone) not to go with him to college. Worst of all is that Polly (Ann Rutherford) wants to make up but her best friend (Ester Williams) decides to give Andy a test. Number thirteen in the series isn't the greatest movie ever made and it's not even a good one but there's enough innocent charm to make it worth viewing. I'd probably put this towards the middle of the series as it's not even close to some of the better entries but there's no denying we get some very funny moments but at the same time, the screenplay offers up some weak stuff. The one sequence that really didn't work for me was an attempt at comedy when mom was trying to sleep in but people keep ringing the door bell. The comedy they were going for here just seemed rather weak and it didn't make me laugh. Some of the film's better moments, of course, happen when Andy must turn to his father and try to get advice on his life, which he just can't understand. I thought it was rather funny that Andy also gets to teach his dad a few things, which was a nice change of events. We also get a side plot about a case Judge is working on as it involves an injured boy and his broke mother. It goes without saying by Rooney and Lewis are at the top of their game and both men turn in very good performances. By this time both were so comfortable in their roles that there isn't a false step anywhere. Fay Holden, Cecilia Parker and Sara Haden are all good as the family. Rutherford gets a slightly bigger than normal part, which is good as she too is delightful. The real standout is Williams. There's no question that she's the highlight of the film and especially the sequence with her and Rooney \"test\" kissing by the pool. This entire pool sequence is classic Hardy stuff and makes the film worth sitting through.",
         "Before this one, the only previous Andy Hardy movie I'd watched in its entirety was Love Finds Andy Hardy-the first one to feature Judy Garland. The main reason I just watched this one was because since I've just watched most of the Our Gang comedies in chronological order, I had a yen to also watch many of the films outside the series that had at least one member in it as this one has Bobby \"Mickey Gubitosi\" Blake as a kid with a broken arm named Tooky. There's also some funny scenes involving Esther Williams in her film debut as a practicing psychiatrist who's a friend staying at Andy's on-off girlfriend Polly Benedict's house. Having just seen and liked Ann Rutherford in Whistling in Dixie, I liked her here as well. There are some touching scenes involving some talk between Andy and his father the judge. Mickey Rooney and Lewis Stone have a natural rapport which shouldn't be too surprising since they have been together in this series for so long in so many entries. So on that note, Andy Hardy's Double Life was a worthy entry for me.",
         "I agree with the other reviewers,Its not the best in the series,but still is fun to watch.If you have any partiality towards Andy Hardy,it's still a must see.It feels like a continuation from the previous movie \"The Courtship Of Andy Hardy\". There is Andy getting ready to go to college,plus another subplot involving one of the Judges court cases.And as usual, girl trouble.And what Girls they are!I am in love with both Esther Williams and Ann Rutherford in this one.Both are very beautiful,and the HD version of this flick I saw,brings their beauty more to life.I very much enjoyed it.Although in HD it can tell Andy has a cut lip in some scenes,and not in others.I mean it was as clear as day.I wonder what that was all about.Has to be some back story to that somewhere.",
         "I am one of the biggest supporter of wholesome values even though I have some sick movies in my collection. The point I am trying to make is that these Andy Harvy movies are about as innocent and wholesome as they come, but I still find them too corny to watch. Judging by the amount of reviews here, most people agree. Actually, I kept one in my collection (\"Andy Hardy Gets Spring Fever\") but discarded the rest, including this. I did like the first 30 minutes but once \"Andy\" (Mickey Rooney) got involved with two girls - his regular girl \"Polly Benedict\" (Ann Rutherford) and her new friend \"Sheila Brooks\" (Esther Williams) is got stupid or should I say, sappy. That first half hour was entertaining mainly because of the lingo. Many of the day's hip phrases were used and they were fun to hear. However, these romance angles keep popping up in the films and are so annoying and dumb I eventually lose interest.",
         "I must admit that aqua-fem Esther certainly made a big \"splash\" in this, her film debut. I can certainly understand how she's able to turn Andy into mush with her charm assault and why he prefers her company to plain old Polly, who looks pretty pedestrian in comparison to Esther's ethereal (yet s-e-x-y!) beauty.",
         "ESTHER WILLIAMS fans will get a kick out of her luscious appearance in one of her early MGM \"training\" films wherein she gets to show her stuff in and out of a bathing suit. She's delightfully sly (and coy) in her kissing scenes with Andy, proving even then why she was about to become one of MGM's hottest box-office stars. Not only does she look more beautiful than ever, but she shows a distinct flair for light comedy. As for MICKEY ROONEY, he's the same old Andy--having heart to heart (or man to man) talks with Judge Hardy (LEWIS STONE), getting advice on how to deal with women from big sister (CELIA PARKER), putting up with foolish Polly Benedict (ANN RUTHERFORD) and her schemes to get even with him for jilting her. It's all very silly, cornball and yet entertaining fluff, made worthwhile by the presence of Esther Williams in a key role and such other up and coming personalities as WILLIAM LUNDIGAN and SUSAN PETERS. The only reason I gave this one a watch is to see how Esther Williams fared in her supporting role. Otherwise, these Hardy stories are really too much to bear sitting through tolerably with the cornball stuff too obvious and sentimental for today's viewing."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["College-bound Andy (Mickey Rooney) blurts marriage proposals to his sweetheart Polly (Ann Rutherford) and her pert swimmer friend Sheila (Esther Williams). (Source: Turner Classic Movies + DirecTV guide)"],
      "budget": 0
   },
   "movielensId": 104011,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-12-01",
      "dvdReleaseDate": null,
      "directors": ["George B. Seitz"],
      "runtime": 92,
      "movieId": 104011,
      "title": "Andy Hardy's Double Life",
      "mpaa": "",
      "actors": [
         "Mickey Rooney",
         "Ann Rutherford",
         "Esther Williams",
         "Lewis Stone",
         "Cecilia Parker",
         "Fay Holden",
         "Sara Haden",
         "William Lundigan",
         "Robert Pittard",
         "Robert Blake"
      ],
      "imdbMovieId": "0034458",
      "originalTitle": "Andy Hardy's Double Life",
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "youtubeTrailerIds": ["l0g8qJlQCkc"],
      "plotSummary": "Andy (Mickey Rooney) is about to head off to college but he's got a few things to take care of before leaving. For starters, he must try and sell his junk car for $20 to pay for a bill and he must convince his father (Lewis Stone) not to go with him to college. Worst of all is that Polly (Ann Rutherford) wants to make up but her best friend (Ester Williams) decides to give Andy a test.",
      "tmdbMovieId": 43167,
      "avgRating": 3,
      "releaseYear": "1942",
      "numRatings": 1,
      "posterPath": "/qKd3AFwFHPfkqeE3daEQOk3hcFa.jpg"
   }
}