{
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 400,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0167565/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1OTk3NTY2MV5BMl5BanBnXkFtZTYwNDMzOTg4._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Gérard Depardieu, Ornella Muti, Jean Rochefort | See full cast and crew »"],
      "reviews": [
         "Eight hours allows for a greater presentation of the many subplots and complexities of the storyline. Depardieu (once you get past his size) is excellent as the Count, a man who, as the reviewer from Amazon says, exchanges one prison for another, a prison of his own hatred. The cast is general is very good and convincing, with Ornella Muti certainly the definitive Mercedes. Set design and production values are excellent. I have only two criticisms. The first and more minor one is that even this long adaptation doesn't have everything. They couldn't, of course, portray everything -- the book itself is well over 1,000 pages and in truth has padded sections -- but some worthwhile aspects of the story were cut, most notably early sequences with the Abbe Faria (who teaches Dante how to read and write) a very famous part that's usually included in dramatizations of the story. The ending, too, is happier than Dumas's. (I should add that some sequences were very sensibly cut). A more serious criticism is that Dantes's character is too soft. Depardieu is a fine actor but his portrayal allows Dantes to come off far more sympathetic than I think Dumas intended. The coldness and bloodthirstiness of the Count is not emphasized as much as it might (one sequence at an execution has a very different spin from the way it's presented in the book, for example), nor is the extent of his hatred. This is a real flaw, partly because it makes light of the theme of the story, the effect of revenge on the revenger, and partly because the climax is not as effective if we're already on Dantes side. The flaw here is not with Depardieu, who does his job admirably, but rather with the screenwriter and director. As such, I can't call this the definitive version -- a little more courage on the screenwriter and director's part would've done wonders. Still, it's probably the best we're going to get. It's hard to imagine anybody else lavishing this kind of care and attention on the story.",
         "One could say I am an old coot, geezer, at the age of 71. This wonderful series, starring the great Gerard Depardieu, pulled me back to my childhood at about eight years old. The two librarians in my little home town in Louisiana always pushed me to read books that were at least two grades ahead. At the end of the school year we were given the usual Summer Reading List. Presenting mine to the local librarians, they suggested a novel by Alexander Dumas, The Count of Monte Cristo. I had never actually read a \"novel\" of that size. I was a bit over- come, but began to read this book right then and there, sitting in a bay window overlooking the little river that flowed past the library's huge windows. That experience changed my life from a casual reader to a dedicated and life-long lover of books. I learned that Dumas was French and had written many other books. I read them all that summer. Then on to Victor Hugo, Balzac, George Sand, and others, all recommended by those lovely ladies in the local library. I have seen almost every film adaptation of The Count, going back to the 1934 version with Robert Donat to the last one with Guy Pierce. THIS one, with Depardieu,is my favorite. Although many liberties are taken, as usual with movie producers and directors, it still is an exciting and involving tale. Dumas' story is so sturdy that any injury visited upon it would be only superficial. I found myself an eight year old all over again. Unlike some adaptations of Dumas' novels, this one had very little swash and even less buckle, being more character driven and fueled by last minute escapes and near fatal outcomes. The ending, as several other comments express, is a bit too up-beat, but so what? Life is full of wonderful and unexpected joys. Watching this made-for-television series was one of them. AND I found it on DVD so I can watch it over and over.",
         "Le Comte de Monte Cristo is well done. Actors are made for their roles. Gerard Depardieu is fabulous in the role of count and Sergio Rubini makes the servant Bertuccio alive. In the novel Bertuccio was in a much smaller role. In the TV-version other characters have got bigger roles. It's a good thing that not only the count of Monte-Cristo is showing. I really recommend this beautifully done TV-film for everyone. After seeing this I started to appreciate the French in the film world in a very different way.",
         "Gérard Depardieu has lavished much care and attention to detail on this production of the famous Dumas story. He is most impressive as Edmund Dantes who is falsely imprisoned by his \"friends\" in the awful Château d'If for some 18 years, then escapes, finds a vast fortune, and as the mysterious Count takes revenge upon those who betrayed him in a very complex series of intrigues. Bearing in mind the great length of the original novel, simplification of the sub plots are inevitable in any screen version, although the extended running time of this TV series allows much of the text to be brought to the screen faithfully. Using some quite stunning set pieces and beautiful scenes to background the action, the cast perform exceedingly well, dominated by Depardieu's portrayal of Monti Cristo. Although a rather overweight Count, his strength as an actor overcomes this minor flaw, and certainly its unlikely we'll see a better performance of the role for years to come. If you have the patience to view the extended version here, it is a rewarding and finally well crafted adaption of a most difficult subject.",
         "One of the most powerful films of any venue ever made. This beautiful production in French with English subtitles faithfully follows the original Alexander Dumas novel with Gerard Depardieu absolutely sensational as the vengeful Count of Monte Cristo. All of the main and secondary roles are played to perfection. In addition, the beautiful photography and the exceptional acting is more than enhanced by the haunting, melodic musical scoring. This version is the best of any of the other more than 30 filmed adaptations of the famous Dumas novel. Furthermore, it is far better than the admittedly entertaining current 2002 production starring James Caviezel, which takes so many liberties with the story as to deserve to be titled, \"inspired by\" rather than \"adapted from.\" This movie is truly riveting. Once you get into it, you will not be able to turn the television off. **** - Four",
         "I like Gerard Depardieu, and I liked much of this movie. I am huge of the book, which provides amazing insight in human suffering, redemption, and revenge. The butchery of the script was benign relative to the recent Hollywood remake (a complete disaster - \"It was a nice film about something, but it was not the Count of Monte Cristo.\"), but apparently the writer(s) could not resist temptation to alter the ending - which was particularly galling given the mostly faithful recreation of the book up to the point of the conclusion. I personally was bitter - you can't take a story of revenge and remake it into Harlequin romance novel. If you know the story, you know what they should have done, and you know what they probably did. Given the time investment in this movie to watch the whole thing, I literally could not believe it as it became apparent that the sell-out was going to happen. They were so close, and that just made the experience that much more sour.",
         "I'm a big fan of the Alexandre Dumas story' Count of Monte Christo. The atmosphere in as well the book as the 2002 movie directed by Kevin Reynolds is fabulous!! Although in the 2002 movie I would have liked to see more detailed revenge plans, I really liked the part in which Edmond Dantes is educated by his visitor in jail Abbe Faria... In this miniseries the opposite is true.. it's absolutely fabulous in working out the part of revenge (so especially after you've watched the first 1/2 episodes, it gets great). Dantes teached by Faria is less more interesting in this miniseries.. which I think is logical since the French have a totally opposite view on what's interesting in comparison to the Americans. Gerard Depardieu acts great as le Comte le Monte Christo.. and this miniseries sticks better to the original story which I also like... One 2 Watch.. more than 1 time.. :-)",
         "Maybe you have read the book? Maybe you have seen the dramatization with Richard Chamberlain in the role of Edmond Dantes? Or maybe even you have seen the poor excuse of a movie with the same title made just a few years ago (after this mini-). This French series is by far the best dramatization ever made of the Dumas' classic about the young sailor tossed into prison, only to come back to wreak vengeance on his former friends (with friends like these, who needs enemies?). The portraying of Edmond Dantes posing as a banker, a gazillionaire, a jesuit priest and other characters vital to the story is very good - only I must confess that I would rather picture a different actor in the role as Dantes. Gerard Depardieu is an actor like the potato, usable for quite a lot of things, but his countenance and body, in my view, doesn't fit the description of Edmond Dantes... so a 10 becomes a 9.",
         "Given the length (and hence the capacity) of this mini series, and after Kevin Reynold's far-off 2002 version, I was hoping to see a visual duplication of the original storyline. However the way the screenplay was written many of the most dramatic moments were taken out and replaced with almost indifferent narration. One example would be, in the book, when Abbé Faria reveals to Dantes how he was framed, even having been there for more than 10 times, I can always feel the shocking Dantes feels as depicted by Dumas. However, in the mini series, Abbé Faria did it almost like a weather man reporting it's going to be another sunny day tomorrow, and Dantes is like, \"OK.\" Another big disappointment is Mr. Depardieu. He is a great actor. There is no question about that. But let's be straightforward - this just isn't his role. He is simply too physical and too outward for me to relate to the Count of Monte Cristo. If you ask me, Jereme Irons(10 years younger) would be the ideal actor. Also Depardieu's signature nose makes it almost like a joke for him to switch between the disguises. 8-)",
         "I first saw this at christmas about 3 years ago. I was ill in bed with flu and just wanted to die. I got up for a change of scenery and put the tv on. This was on. I spent the next three days setting the alarm for 3pm and getting up out of my death bed to watch this compelling series. I then found it on DVD, and bought it (the book was included and I have been reading that too). THe story is compelling and the characterisations by all of the actors are amazing. THe detail is fantastic and even though I don't normally \"do subtitles\" I have watched the entire series several times, finding something new and even more entertaining each time. I would recommend it to anyone - this would make kids WANT to learn french in school so they could watch it without the subtitles."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "TF1",
         "GMT Productions",
         "DD Productions"
      ],
      "summaries": [
         "A TV mini-series adaptation of the classic Alexandre Dumas novel. Edmond Dantes is falsely accused by those jealous of his good fortune, and is sentenced to spend the rest of his life in the notorious island prison, Chateau d'If. While imprisoned, he meets the Abbe Faria, a fellow prisoner whom everyone believes to be mad. The Abbe tells Edmond of a fantastic treasure hidden away on a tiny island, that only he knows the location of. After many years in prison, the old Abbe dies, and Edmond escapes disguised as the dead body. Now free, Edmond must find the treasure the Abbe told him of, so he can use the new-found wealth to exact revenge on those who have wronged him.",
         "Paris, 1830. A mysterious nobleman appears in the world of the salons. Styling himself the Count of Monte Cristo, he uses his vast wealth to try to secure a place for himself in society. No-one knows him, nor what his motivation is. The mysterious individual is actually Edmond Dantès, a widely-travelled sailor, and the victim of an evil conspiracy twenty years earlier, when he was falsely accused on his wedding day of loyalty to Napoleon, and sentenced to life imprisonment. He owed his years of suffering in the dungeon of the Château d'If to three scheming, so-called \"friends\" -- Fernand, Danglars and Caderousse -- one of whom wanted to deprive him of his wealth, another of his bride. His arrest was also very timely for Villefort, an ambitious magistrate whose career chances he was unwittingly obstructing. Inside the prison, Dantès is connected via a secret underground passage to the occupant of the neighbouring cell, Abbé Faria, who becomes his teacher and mentor. Before his death, the Abbé bequeaths to Dantès a valuable treasure buried on the island of Monte Cristo, and Dantès then succeeds in escaping from the prison by disguising himself as his late friend's \"corpse\". The wealth and knowledge imparted to him by the Abbé now enable Dantès, a man cheated out of half his life, to finally put his long-cherished and merciless plan of revenge into action ...",
         "A young sailor is involved into an intrigue by his friends and sent to prison while he is not guilty. Twenty five years later he gets the chance to return into society being a rich man, under a fake identity. One by one he takes revenge on his so-called friends from the past.",
         "The Classic tale from Alexandre Dumas. Edmond Dantes is unjustly sent to prison for 18 years. He escapes to reclaim his fiancée Mercedes and revenge against his nemesis, Mondego."
      ],
      "budget": 0
   },
   "movielensId": 104072,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-09-07",
      "dvdReleaseDate": null,
      "directors": ["Josée Dayan"],
      "runtime": 400,
      "movieId": 104072,
      "title": "The Count of Monte Cristo",
      "mpaa": null,
      "actors": [
         "Gérard Depardieu",
         "Ornella Muti",
         "Jean Rochefort",
         "Pierre Arditi",
         "Inés Sastre",
         "Stanislas Merhar",
         "Julie Depardieu",
         "Constanze Engelbrecht",
         "Jean-Claude Brialy",
         "Michel Aumont",
         "Georges Moustaki",
         "Jean-Marc Thibault",
         "Florence Darel",
         "Christopher Thompson",
         "Hélène Vincent",
         "Roland Blanche",
         "Sergio Rubini",
         "Micheline Presle",
         "Guillaume Depardieu",
         "Naike Rivelli",
         "Julien Rochefort",
         "Annick Alane",
         "Dominique Besnehard"
      ],
      "imdbMovieId": "0167565",
      "originalTitle": "Le Comte de Monte-Cristo",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "After nearly 20 years in prison, Edmond Dantes escapes the fortress Chateau d'If. He returns as the Count of Monte Cristo and recognizes that his love Mercedes has married another man. Now, he is only driven by revenge on the people who falsely accused him.",
      "tmdbMovieId": 4548,
      "avgRating": 3.87037,
      "releaseYear": "1998",
      "numRatings": 27,
      "posterPath": "/qfbttNFO1HMBp75iIvJKNeHOoI3.jpg"
   }
}