{
   "tmdb": {
      "original_language": "tr",
      "keywords": [
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "istanbul turkey",
            "id": 156345
         },
         {
            "name": "crime wave",
            "id": 190629
         }
      ],
      "imdb_id": "tt0181947",
      "video": false,
      "title": "Three Giant Men",
      "recommendations": [],
      "backdrop_path": "/zRDhFghhBNLCGLAB2SIDIvA34Xz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Captain America",
               "gender": 0,
               "credit_id": "586d71349251414325001559",
               "name": "Aytekin Akkaya",
               "profile_path": null,
               "id": 1015993,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "586d713d9251414318001536",
               "name": "Deniz Erkanat",
               "profile_path": null,
               "id": 1732769,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "El Santo",
               "gender": 2,
               "credit_id": "586d7148c3a368394d0016b9",
               "name": "Yavuz Selekman",
               "profile_path": "/dLtSQsmNw58XzRE70BU5CN3G3Uc.jpg",
               "id": 1296067,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Spider-Man",
               "gender": 0,
               "credit_id": "586d71549251414310001613",
               "name": "Teyfik Sen",
               "profile_path": null,
               "id": 1732770,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "586d715dc3a368395000178c",
               "name": "Dogan Tamer",
               "profile_path": null,
               "id": 1015998,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "586d7165925141431e0014f1",
               "name": "Mine Sun",
               "profile_path": "/5GIfJuchXyTBEcTM0BngW1s50h5.jpg",
               "id": 1325478,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "586d716cc3a368395a001707",
               "name": "Altan Günbay",
               "profile_path": "/9tnwWGO0cwQJKeMy3Zm133RzHx9.jpg",
               "id": 584556,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "586d7173925141431800154d",
               "name": "Ersun Kazançel",
               "profile_path": null,
               "id": 1732771,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 0,
               "credit_id": "586d717bc3a368394b0015ef",
               "name": "Hasan Ceylan",
               "profile_path": "/6ZQCYp8AK9EdUphc8emRCCtFk0d.jpg",
               "id": 1202127,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "586d706392514143250014cf",
               "name": "T. Fikret Uçak",
               "profile_path": null,
               "id": 1320896,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "586d7071925141431300157e",
               "name": "Dogan Tamer",
               "profile_path": null,
               "id": 1015998,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "586d70d4925141431e001490",
               "name": "Ridvan Tual",
               "profile_path": null,
               "id": 1732766,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "586d70f392514143130015fb",
               "name": "Orhan Kapki",
               "profile_path": null,
               "id": 1324560,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "586d70ff9251414313001605",
               "name": "Hüsamettin Üren",
               "profile_path": null,
               "id": 1732767,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "586d710dc3a368395700133e",
               "name": "Mehmet Özdemir",
               "profile_path": null,
               "id": 1732768,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 0.628457,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 58447,
      "vote_count": 1,
      "budget": 0,
      "overview": "Istanbul is being terrorized by a crime wave, and the police call in American superhero Captain America and Mexican wrestler Santo to put a stop to it.",
      "similar": [
         1924,
         141052,
         155,
         1452,
         8536,
         9531,
         40662,
         379291,
         13640,
         49521,
         99861,
         209112,
         364,
         24428,
         272,
         299534,
         297762,
         30061,
         382322,
         287947
      ],
      "original_title": "3 dev adam",
      "runtime": 81,
      "poster_path": "/6RtxP7ytjkwVlb87yl4jVnpArHy.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Renkli",
         "id": 15166,
         "origin_country": ""
      }],
      "release_date": "1973-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["T. Fikret Uçak"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Dogan Tamer"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt0181947/",
      "coverLink": null,
      "actors": ["Stars: Aytekin Akkaya, Deniz Erkanat, Yavuz Selekman | See full cast and crew »"],
      "reviews": [
         "It's your unfriendly neighbourhood Spiderman! But he's green! And he's in Turkey! And he's ripped a hole in his mask so you can see his bushy eyebrows! And he can't shoot webs anymore! Or climb up walls! Peter Parker must have been bitten by ANOTHER radioactive spider or something, presumably while on holiday in Turkey, because suddenly he's EVIL and likes nothing better than chopping people up with a knife, skewering them in the shower, and, especially, doing lame ass kung-fu on them. You know this film is going to be amazing when - BEFORE THE OPENING CREDITS - Spidey buries a girl up to her neck on the beach, then gets two blokes in a boat to reverse the outboard motor blades into her face. Seems the cops were right all along to be suspicious of that ol' web-slinger. Then those opening credits -- photographs (like actual paper photographs) taken on the set have been stuck on a wall next to fridge-magnet letters spelling out the title, and the camera zooms away from them very quickly...this passes for special effects in 70s Turkish cinema. The theme tune has exactly the same melody as \"Diamonds Are Forever\". There is no Turkish word for \"copyright violation\" - as if the psycho slasher Spiderman wasn't proof of that already. As if that wasn't enough, wait -- Evil Spidey is terrorizing Istanbul, so who's the best person to call to deal with the problem? Captain America of course! (well it makes more sense than trusting in the hapless raincoated detective who gets sliced up by Spiderman - who then looks into the camera and says \"ho ho ho ho ho. Adios!\") Oh, and also Santo, the masked Mexican wrestler. Santo is a trifle fatter than his Mexican version, but at least his blank face mask can be replicated easily - Captain America is a tougher task for the costume designer (who, looking at the costumes, is almost certainly the director's mum). He has the \"A\" on his head, but he has no shield -- then again, Spidey has no webs, so that evens things out. You have to see this movie. If necessary, go to Turkey to see it. Even better than the notorious Turkish remake of \"Star Wars\", and a 500% improvement on the recent Hollywood Spiderman. Did Spidey gruesomely murder a lovemaking couple in that movie? Well exactly.",
         "What a movie! The turks in the 1970's would put any bit of any country's pop culture and whir it in a blender and shoot it. This film has a homicidally insane Spiderman in a costume that looks like the director's elderly mother made with a rusty sewing machine and poor eyesight. Another great scene - the guy who is Capn America stops and talks on the side of a busy road WHILE CHANGING INTO HIS CAPTAIN AMERICA SUIT!!!(so much for secret identity) There is awful fight scenes - truly so bad that you laugh your head off. The clothes and hairstyles are stunningly ugly. Amazing. For true cheese lovers. Recommended!",
         "So here's an odd movie. Spider Man is a bad guy. And his mask is radically different. And he has these massive eyebrows--or maybe they were antenna? Anyhow, this has nothing to do with everybody's favorite webslinger. Technically, he is called Spider Man and kinda dresses like him, but instead uses the awesome powers of a switchblade to kill people and steal statues. Oh, and I think he can clone himself whenever he dies. Maybe. Didn't make much sense at the time. Come to combat this villain are the awesome duo of Captain America and El Santo. For those of you not up on your lucha libre, El Santo is the most famous Mexican wrestler of all time, having starred in approximately 100 movies in his forty-year career. The silver-masked man revealed his identity only a month before he died and was laid to rest in his cloak and cowl. Anyhow, they're fighting Spider Man. At least Captain America (not an American by any means) is, since El Santo isn't in this too much. After a few rumbles, good is triumphant. Worth a see? Definitely, if you like your cheese thick and incomprehensible (as detailed previously, there are no English dubbed or subtitled prints). It's no classic, but it is fun if you've got a wad of meat in each shoe (I never did understand that saying). Don't look too hard, but if you're in the back of a small, locally owned video store and this falls off a shelf onto your head, rent it.",
         "Priceless statues are being stolen all over Istanbuhl(?). Looks like the work of that infamous, murdering Spiderman. The police call in special outside help in Captain America from the United States and the legendary Mexican wrestler Santo. It's anyone's guess why Spidey's turned to a life of crime, what the significance of all the stolen art is, or if those are his bangs or his eyebrows sticking out of the holes in his mask. He's also traded-in his web-shooters for a slick little switch-blade,and can quickly clone himself if he's killed (that part gets real tiresome after a while). Captain America is missing his trusty shield and Santo's wrestling skills resemble Flintstone judo. In fact, nothing seems to make sense at all in this live-action cartoon that makes Tim Burton's 'Batman' look as tame as the 60's TV series. Dozens of people are killed needlessly, sudden jump-cuts take you to sleazy strip clubs, and there's a love scene that's interrupted by the Mr. Rogers' puppets. Even worse, it's all in Turkish. No version in English or English subtitles is available. I'm not painting a pretty pictures here, I know. But I can say it is, without a doubt , one of the BIGGEST film oddities the world over.",
         "Turkish cinema, gotta love it. Where else in the world can you get copyright infringement films that make you smile from ear to ear? In this film Marvel Comics hero Spiderman becomes a bad guy trying to take over the world. He is battled by Captain America (in possibly the best suit every put on screen) and Santo, the Mexican wrestler and movie star. The action is great as is some of nastiness that Spidey inflicts on his victims (The opening boat propeller to the face is a nice touch). As Turkish superhero movies go its pretty good, though the print I saw was sans any English so it was hard to know what was going on and it made the dialog scenes drag. Not the best of the Turkish cinema I've run across, and certainly not the worst. If you run across it and are curious about the madness that Turkish film makers have unleashed on their audiences give it a try. Also give it a try if you're a comic book fan who worries what Hollywood will do to your favorite creation. One Look at this film and you'll never complain they got something wrong again.",
         "One of the most auspicious movie starts in history, yet a walk in the park for movies coming out of Turkey. I thought I had seen everything Turkey had to offer. From Turkish Star Trek and Star Wars to Turkish Superman to Turkish Young Frankenstein. I was not prepared for a mostly green Spiderman, with a red hood and giant, untrimmed eyebrows. This isn't your Marvel Spiderman though. Turkish Spiderman is leader of a gang. His whole racket involves smuggling artifacts from Turkey to the US, selling them cheaply to dealers and then buying them back with fake money. The opening scene is of Spidey and his gang building a hole in the sand, dropping some woman in a night gown into it and then pushing a boat (the motor is on, propeller spinning) into her face. The Spider (as he is called in Turkey) has no powers whatsoever. He knows movie martial arts, is quite the escape artist and tends to sneak up on people. His primary weapons include a 2-inch knife, a shower head, shish-kabobing people and a complicated torture device involving hamsters. Welcome to Turkey !! Aytekin Akkaya is Turkish Steve Rogers, a.k.a. Captain America (minus a shield which would have cost extra). You may remember him from Turkish Star Wars. Sadly I cannot forget seeing his shirtless performance as he bounced around on the screen. His partners include a luchidore who stores everything in the crotch of his tights and a female secretarial assistant (who does most of the undercover work). Their mission is to stop the Green menace (thank you Jonas). This is truly an exercise in Turkish 70's film making. Turkish movies often remind me of the old movie serials (Flash Gordon, Batman and Robin,etc). They seem to be made on the cheap, poorly edited, poorly acted and done very quickly, often with little regard for intellectual property (the music seems to be from a James Bond movie). It is as if this is Turkey's attempt at mimicking the exploitation movies coming out of the US and/or the martial arts movies coming out of Asia. Exploitation is definitely what this movie is going for. It has all the elements for grind-house: a striptease (with pasties), graphic violence, shower scenes in underwear, crappy disco music, sex and alcohol. Well what did you expect, Turkey is a much different place? What was tame for us was probably raunchy for them. Context people, context. As with all the 70's Turkish movies I have seen, I cannot take them seriously. I find them quite amusing along with the lingering misogynistic undertones (seems like more women died in this movie than men). There also seems to be a lot of time spent in showing running, driving and chasing. If you have never seen a Turkish movie, try to get one with the appropriate subtitles. Understanding the dialog will only help you slightly, as the plots and edits are \"complicated\" (not to mention the cultural differences). I have seen Turkish movies without the subtitles and I can tell you it gets pretty confusing (Turkish Star Wars, I'm looking at you). These movies would have been prime candidates for MST3k. If only that were still possible. Maybe in an alternate universe. Until then, make mine a double whiskey. It's for the pain.",
         "I've heard a lot about this movie, and it's one of those you'd have to watch it to believe, cause what I'm about to describe sounds baffling for a movie like this to exist. Spider Man who was known as a hero in America is portrayed as a villain in this movie. In a poorly designed costume with no eye pieces to cover his actual eyes. The one thing that makes this Spider-Man look unusual is his large eye lashes. I don't think Spider Man has ever been depicted that way in any comic from my knowledge. Anyways Spider Man is causing crime in Turkey so Captain America and Santos(yes as in the wrestler) came to Turkey to defeat him. Not a lot to say about it other than it's unusual and low budget. Every the opening of the movie was low budget. The one thing I'd love to know is does Spider-Man have a good reputation in Turkey or is this how people see Spider Man in Turkey. I don't know that answer for sure. Cause I wonder if the Director or writer of this movie have anything against Spider-Man. No one knows for sure, so all I could do is speculate that the director and writer hated him so much they decided to make a movie to show every one in Turkey how horrible he is. But why's Captain America portray as good and not Spider Man. They're from the same comic company. While Santos was thrown in cause he's a big celebrity in the country of Turkey. For die hard Spider-Man fans this is a laugh riot and to non fans of Spider-Man this is still funny to watch.",
         "For a Turkish movie adaptation of a comic book, you wouldn't really know what to expect. The one thing I didn't expect this movie to do is make such a popular character... nothing like him. 3 Dev Adam, or Three Giant Men, or Turkish Spider-Man as fans refer to it as. I'm not gonna address much of the plot, because it's a foreign film. It's not that I don't like foreign films (In fact, I love Felidae), I just don't speak Turkey, so I can't get much out of it. So the 3 Dev Adam in this are Spider-Man, Captain America and Santo. But this time Spider-Man is a sinister assassin who... is trying to take over the world, I guess? Wow, Jonah Jameson was right about this one; he really is a menace. It's up to Santo and Cap to foil his evil plans. Now, I know it's the seventies, but even then, this movie was pretty strange. Though, I got to appreciate it because of how funny it is. In a sex scene, it cuts to some guy laughing and playing with... gnomes? Can someone please explain to me what the h*** is going on?? At least the music is good; pretty catchy for the 70s. The quality is okay for a 70s movie, but the SpiderMan costume is pretty silly; it looks far from what the cover of the movie shows it as. There's a bit of blood, not too much, but some of the killings are pretty shocking, including one where a white rat eats a man's face off (barely shown), or SpiderMan gets his head crushed, but I digress. I'd rate this PG-13 for blood and brief sexuality; not too inappropriate. I personally rate this 7 stars out of 10; it's not a masterpiece by any means, but it does provide some enjoyment, whether or not you can figure out what the actors are saying.",
         "Typically hilarious Turkish outing, as so-bad-it's-good as you could ever want, full of incredible scenes of action and surprises at every turn. Ignore the language barrier and instead focus on the nonstop entertainment this film has to offer, with bad actors beating each other senseless at every opportunity in poorly-choreographed fight sequences, displaying a lack of talent all round. Knowing that quality isn't always important in Turkish movies is a help, and instead watch for the sheer quantity of wackiness this film has to offer. Offering not one, not two but three classic superheroes, this is an unmissable combination. First of all you have Captain America, who doubles as an everyday guy with a fine line in bad 70's fashions, as played by Aytekin Akkaya (THE MAN WHO SAVES THE WORLD) in true old-fashioned heroic style with plenty of derring-do. Then there's the muscular but masked Santo, that fantastic Mexican wrestler-hero who appears to beat up a fair few bad guys before mysteriously disappearing towards the end of the movie. And what of Spider-Man? Well, forget the crusader of good - here, here's a pervert, a peeping tom who likes nothing better than to brutally murder innocent women in the shower. Yes, this film surprisingly mixes in comic-book style action with pretty graphic scenes of violence and murder, scenes which include a double-impaling a la BAY OF BLOOD; a strangulation with a shower cord a boat propeller being driven into a girl's face and blood splattering another woman's legs; a guy getting his head crushed in a press; another decapitated by a speeding boxcar (seeing as there is a huge space below him, he forgot to duck, obviously), and in the film's flawless highlight, a guy gets his eyes chewed out... by a pair of ravenous GUINEA PIGS! The plot is typical heroes vs. villains stuff, so easy to follow that a kid could understand. Padding includes lots of women undressing and showering in scenes that definitely push the no-nudity ruling, a striptease in a nightclub and people driving around in cars for no reason. However, the action sequences are extended and a lot of fun to watch, like the moment when Santo takes on a bunch of karate warriors in the local gym and teaches them wrestling Mexican-style. Or check out the \"titanic ding dong\" when Captain America and Santo team up to go one on one with Spider-Man. The ending is a real show-stopper as well, revealing that there is not just one evil Spider-Man but dozens, each with their own maniacal laughter, and each dying a death more bizarre than the last. Keep your eyes peeled for an interlude involving laughing puppet heads which may just be an insight into the deranged sickening mind of the perverted Spider-Man. Bad costumes, bad lighting, bad sets, bad acting, bad action, bad plot. On their own, each of these would be serious flaws in a movie. Combined, they offer eighty minutes worth of unintentional hilarity and an incredible viewing experience. You've just gotta love those Turks...",
         "This funky Turkish interpretation of graphic novel lore has Spider-Man as an ultra mean bad guy running a gang of thugs in Istanbul on the wrong side of town. He has none of his Spider powers, which I guess is why he is so angry, but makes up for some of it via his ruthlessness and a peculiar ability to come from the dead - multiple times. In fact Spider-Man while noticeably less agile looks as though he has let himself go a bit and is a tad flabby (What we in Canada refer to as \"Molson Muscle\"). His costume has some noticeable signs of wear and tear as well and his bushy eyebrows peak out of eye slits in his mask. Could it be that the makers of this film got their accounts of Spider-Man's exploits only from the slanderous accounts provided by that yellow journalism scandal-sheet the Daily Bugle? If they read the comics they would know that Spider-Man/Peter Parker would never use his powers for evil. What would his Aunt May think of him? Worse what would the spirit of his Uncle Ben think? Clearly this baddie is just some dude who ordered an ill-fitting, cheap imitation Spider-Man costume and couldn't get his money back. A rather improbable team up of Captain America (Akkaya) and Santo (Selekman) the wrestler/superhero track the Spider Gang to Turkey after Spider-Man's counterfeiting scheme in Mexico leaves a trail of angry people on both sides of the law. Cap's famous shield evidently didn't clear Turkish customs as we don't see it. But his girlfriend Julia came with him to help. This film is so spectacularly wrong on so many levels as to show the value of copyright protection as preservation of artistic integrity more than proper assignment of royalties. Turkey, then under the control of a military junta in a chaotic struggle with terrorist groups and engaged in a brutal suppression of leftist elements offered no such copyright protection to products of comic book heroism or Western entertainment. Like the Turkish version of Star Wars and Star Trek the staging of a rip-off like this utterly defies logic. Why not just dub or subtitle the Spider-Man cartoon and Santo movies into Turkish? Or better yet why just make a completely original set of characters with Turkish identities? There is low-grade production value and then there is no-grade production value. What is shown here is beyond what Hollywood producers would deem incredibly cheap though the cast soldiers on even with the various continuity errors and other goofs. It doesn't look like they were given a safe working environment to shoot under but really what does that even mean when the Turkish government was rounding up people - very much including artists and locking them up for even being suspected of having leftist sympathies? In one scene where Captain America rescues Julia from the baddies at the Spider gang's safe-house we see a pretty silly action sequence. Hanging from conveniently placed acrobat rings, Cap attempts to heel-kick one of the baddies behind him but the stunt guys must have messed up the timing because he misses. The thug falls anyway and from the angle of the shot it looks as though the villainous henchman has been knocked unconscious by a devastating, explosive fart to the face from the hero. Captain America's subsequent fight with Spider-Man betrays the fact that Cap is, for whatever reason, a lot more acrobatic than Spidey. El Santo is, by contrast to Spider-Man in considerably better shape than we have seen him and unlike the real Santo, generally goes unmasked. Santo in the Mexican movies he was hero of was never seen in public without his mask. The comedic possibilities offered in Santo's time on screen are rife as he infiltrates a dogo serving as a front for the Spider Gang, discovers incriminating papers in a back office and stuffs them in his tights in a manner which looks as though he has done it to make his crotch bulge look bigger. Unintentional humor throughout offers countless openings for snide one-liners and sarcasm. But no one needs to say anything as this Turkish rip-off lampoons itself so perfectly."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": ["Renkli"],
      "summaries": ["Istanbul is being terrorized by a crime wave, and the police call in American superhero Captain America and Mexican wrestler Santo to put a stop to it."],
      "budget": 0
   },
   "movielensId": 104017,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "1973-01-01",
      "dvdReleaseDate": null,
      "directors": ["T. Fikret Uçak"],
      "runtime": 81,
      "movieId": 104017,
      "title": "Three Giant Men",
      "mpaa": null,
      "actors": [
         "Aytekin Akkaya",
         "Deniz Erkanat",
         "Yavuz Selekman",
         "Teyfik Sen",
         "Dogan Tamer",
         "Mine Sun",
         "Altan Günbay",
         "Ersun Kazançel",
         "Hasan Ceylan"
      ],
      "imdbMovieId": "0181947",
      "originalTitle": "3 dev adam",
      "genres": ["Action"],
      "youtubeTrailerIds": ["-Lg4_QaFm_c"],
      "plotSummary": "Istanbul is being terrorized by a crime wave, and the police call in American superhero Captain America and Mexican wrestler Santo to put a stop to it.",
      "tmdbMovieId": 58447,
      "avgRating": 1.5,
      "releaseYear": "1973",
      "numRatings": 5,
      "posterPath": "/6RtxP7ytjkwVlb87yl4jVnpArHy.jpg"
   }
}