{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1305586",
      "video": false,
      "title": "Fred & Vinnie",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4d00c3a368484e1d1a2d",
            "name": "Steve Skrovan",
            "profile_path": null,
            "id": 1187397,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.011529,
      "production_countries": [],
      "id": 205005,
      "vote_count": 0,
      "budget": 0,
      "overview": "Lonely guy Fred Stoller is thrilled when his good buddy, Vinnie D'Angelo, the world's happiest agoraphobic and fattest vegetarian, comes to live with him, until Vinnie also proves to be the world's most maddening roommate.",
      "similar": [],
      "original_title": "Fred & Vinnie",
      "runtime": 89,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2011-01-01",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Skrovan"],
      "runtime": 89,
      "synopsis": "Fred Stoller works as an actor in Hollywood, playing an assortment of deliverymen, clerks, and other oddball schnooks. The rest of the time he wanders the streets researching his pet book project, Restaurants You Dont Feel Self-Conscious Eating Alone At. He has a long distance bond with his old friend from back East, Vinnie DAngelo, who these days hardly ever leaves his rent-free basement apartment. Fred calls Vinnie whenever he has an odd anecdote to relate about some dumb thing he overheard a lady say at the post office or how the owner of a video store refused to wish him a Happy Holiday because Fred was renting a porno on Christmas. For Vinnie, these mundane stories are great adventures. Its a quirky, symbiotic relationship where Fred provides Vinnie with a window to the outside world, while Vinnie is the adoring parent Fred never had. That relationship is put to the test when Vinnie ventures cross country to stay with Fred to give show business a try. At first, Fred is thrilled to have the company and eager to give Vinnie a live tour of his crazy life, but soon feels trapped when Vinnie quickly reverts to his agoraphobic ways. Will Fred be able to overcome his meek nature and get rid of Vinnie? Is Vinnie a freeloading conman taking advantage of an old friend or just a well-meaning guy who is truly incapable of dealing with the world? One things for sure. Everybody knows a Vinnie.",
      "writers": ["Fred Stoller"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1305586/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwODIyMTExMF5BMl5BanBnXkFtZTcwMzg2MTI1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Justin Roiland, Fred Willard, Richard Steven Horvitz | See full cast and crew »"],
      "reviews": [
         "This movie is unique in a whole lot of small, simple, good ways. For one thing, unlike most adult male friendship movies, beer, flatulence, sex and war are not factors. And unlike most independent, small relationship movies, it doesn't bend over to kiss some smug arty film-goer's butt with ridiculous new-age metrosexual renaissance men. Fred and Vinnie are these two semi-outsidery meek guys with a realistically warm and supportive long-distance friendship. Then you see this simple and realistic change happening when they actually, awkwardly, wind up living together. There are goofball comedy moments and clever-funny moments and definitely there's a ton of pathos ... so it's a little hard to characterize. In the end, it's more of a think-piece than anything else. But it doesn't seem that way at the time you're watching it, which is a good thing. I love that it doesn't condescend or get deliberately deep. It doesn't have any pretense. The movie's whole look, and the score and everything has sort of a grown up Charlie Brown vibe. The characters (Fred and Vinnie) are painfully sincere and pretty isolated in the world. They count on the friendship. They need one another. The particulars of who they are and their ridiculous delusions ... these things make them feel like people and not products of a screenwriter's mind (Fred is played by the real Fred, who wrote the thing based on a chapter in his life, and Vinnie is played by this incredible Angelo Tsouchas (sp?) actor guy). It sounds dumb any time you talk about deep stuff, but this little movie really hits all the big universal quandaries in human relationships. How close is too close? Are we really our brother's keeper? How can I appreciate you if you won't go away?",
         "After watching Fred & Vinnie... I was so touched. I was crying... Minutes before... I'd been laughing so hard, it was bothering my neighbors. The ending, while based on a true story, caught me totally by surprise. It was a sad and shocking jolt. How fragile and fleeting time is, and goes by at the speed of light without notice. It inspired me to call and make up with an old friend, whom I'd recently had a falling out with. Thank you so much for sharing such a personal story. A+++ I have recommended this film and the trailer to all of my friends, who are all part Fred or Vinnie in some way. They've all seen bits of it and enjoyed it. Great film! The cast of characters is very relatable to this long time Hollywood resident and recluse.",
         "At the same time funny and moving film, made ​​directly to my taste. The story of people who, though it seems not for this world too much importance, and yet we need to know about them because when we think they are everywhere around us. Intimate story of friendship between two men who meet together for years through phone and tell your experiences of your life. On the one hand, Fred, the quiet and desperate little man who tries to assert itself in Hollywood as an actor, has problems with women and visits a psychologist. And then there's Vinnie, the man buried in debt and his whole world is a couch, TV and candy. Vinnie is literally hungry for Fred's adventures, whether any one day and decides his \"old\" friend to visit...",
         "We've all know this guy. Mine was \"Buck-Fifty Bob.\" We'd met on the beach in Jupiter, Florida and immediately had something in common, I was minding my own business and he was too. Let me back track. As usual, my day/ life was in the shitter and I'd decided to spend some retrospective time on the beach. It's always been my place of refuge and solace. With miles of beach to be had this guy decides to get all up in my grill ignoring obvious boundaries, because when you're feeling ugly, depressed and alone the last thing you want is attention from a good looking man. Right? Talk about desperate and vulnerable. Was I wearing a sign? $1.50 was attractive, older, I like both of these things, and the best part of all, he liked me. OK, like is a strong word. Tolerated? Endured? Lusted? As losers go, we were a 'match made in heaven.' Several hours later I left the beach and went to work. Within an hour or so, he showed up. I was smitten. That's all it took in those days. Depressed, lonely, ugly girls are easily soothed with the attention of a man and easily justify things like rap sheets, ex-wives and matriarchal subterranean accommodations. We became inseparable, well as inseparable as one could be with two jobs, me not him. But I found things to love about him. He loved to read, was in OK shape, his kitchen skills were impeccable and matched only by the heat in the bedroom. He was so very thoughtful (cheap) like the time he made me stuffed shells for Valentine's Day and kept the pot at his house so they wouldn't go bad in the car ride to my place. You just don't find guys like that every day. A guy who sleeps on his friend's couch, doesn't have a job, lied about being divorced, lied about having a kid, and got his nickname because the only place he ever took me was to the $1.50 movies. What a catch! \"Fred and Vinnie\" written by Fred Stoller and directed by Steve Skrovan, is a quiet, lovely, hilarious, heartfelt film study of characters we all know and probably are. Two friends, Fred and Vinnie have known each other a lifetime, spend hours upon hours talking and sharing intimate moments of experiences. In other words, minding each other's business and yet, never really know each other at all, well that is until Vinnie moves in. From here we watch the internal struggles as two grown men, set in their ways, attempt to keep their relationship afloat while refusing to resurrect from the pigeonholes that suffocate them. Theirs is a relationship of mutual respect, compassion, disappointment and frustration. There are moments of understanding, anger and resentment. Fred Stoller is the \"Freddie\" who plays himself in this film, an actor, stand-up, writer guy with intermittent work who lives a modest life, has trouble with women, and looks to Vinnie (Angelo Tsarouchas) for comfort with phone calls recounting his daily misery. Vinnie, Freddie's $1.50 Bob is a self-imposed recluse of sorts who sleeps all day on 'his' couch, eats mountains of candy, smokes, weighs about 350 lbs, give or take, and lives vicariously through Fred hanging on his every word. Fred's life propels him to need Vinnie's attention and Vinnie needs a lot, but he's just happy needing Fred at the moment, well, Fred and baseball cards. What's most disturbing is we've all been either one or both of these guys, we've been the functionally working but not really working guy barely making ends meet, we've been the generous-to-a-fault-guy who resents friends for taking advantage and resent ourselves for being dumb enough to give away more than we have in exchange for acceptance, validation and worse, company. We've been the couch potato, the overeater, the smoker, the lonely guy who can't get laid, we've been both of them. Now put those guys in small quarters and watch this beautiful relationship unfold as a character study of the heart. This poignant film sublimely paradoxes the average buddy film by being both refreshing and familiar. \"Fred and Vinnie\" are both 'fish out of water' offering insight into the machinations of men who really are good at heart, misunderstood misfits whose quirks and seemingly \"loser\" nuances set them apart as interesting characters in other parts of the world, but certainly not in Los Angeles. This is a relationship film, a study of friendship and all that goes into that. A commitment to being the best you can be when you feel like being an asshole. I'll bet dollars to M&M's you won't be able to watch \"Fred and Vinnie\" and not to see yourself in this film. If you don't, you're in denial. Either way I win.",
         "I had no idea that I was in for such a special film. Fred & Vinnie was heartwarming and reminded me of a time in my own life. I laughed and cried. Cliché but true. The story was so authentic that it really impressed me. At no time during that film did I ever feel like I was watching a joke. The whole time I knew I was seeing something real. The acting was wonderful, comic timing - completely believable. Editing was perfect. The use of lighting and color was inspirational. The way the movie transports you through time and makes you feel as uncomfortable as the star does while laughing through tears was absolutely magical. I really enjoyed this film.",
         "\"Fred & Vinnie\" is a very strange film and I can honestly say I've never seen anything like it...and this is much of why I gave the movie a 6 and not a lower score. However, I should warn you that although it's listed as a comedy, it's really not...at least not in a traditional sense. It's actually quite tragic and unfunny-- especially when you realize that the film is based on true people! Fred Stoller plays himself in the film. He's a lonely single guy struggling in Hollywood and one day he makes a huge mistake--he invites his friend Vinnie to move in with him. It turns out Vinnie is one of the most annoying people on Earth and he's also chronically unemployed and a moocher. After a while, it becomes obvious that Fred has inherited Vinnie---and getting rid of the pathetic guy will be practically impossible. Had the film NOT been based on a real person and had the film NOT had such a downbeat ending, I would have enjoyed it more. Instead, it left me feeling depressed and a bit like a voyeur who SHOULDN'T have been watching these folks. Mental illness and personality disorders are not particularly the stuff of comedies! Hard to watch at times though the acting was quite nice. I wouldn't mind seeing more from these folks but I would recommend that they try infusing some more energy and watchability into future projects."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Fred and Vinnie"],
      "summaries": ["Lonely guy Fred Stoller is thrilled when his good buddy, Vinnie D'Angelo, the world's happiest agoraphobic and fattest vegetarian, comes to live with him, until Vinnie also proves to be the world's most maddening roommate."],
      "budget": 0
   },
   "movielensId": 104031,
   "movielens": {
      "languages": [""],
      "releaseDate": "2011-01-01",
      "dvdReleaseDate": null,
      "directors": ["Steve Skrovan"],
      "runtime": 89,
      "movieId": 104031,
      "title": "Fred & Vinnie",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "1305586",
      "originalTitle": "Fred & Vinnie",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Lonely guy Fred Stoller is thrilled when his good buddy, Vinnie D'Angelo, the world's happiest agoraphobic and fattest vegetarian, comes to live with him, until Vinnie also proves to be the world's most maddening roommate.",
      "tmdbMovieId": 205005,
      "avgRating": 3.5,
      "releaseYear": "2011",
      "numRatings": 2,
      "posterPath": null
   }
}