{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110583",
      "video": false,
      "title": "Moving the Mountain",
      "recommendations": [],
      "backdrop_path": "/9MEVQ7BhI43yht72aMIPGYHvfcg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e206795",
               "name": "Ling Chai",
               "profile_path": null,
               "id": 1199813,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e206799",
               "name": "Yiu-ming Chu",
               "profile_path": null,
               "id": 1199814,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Teach Lin",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e20679d",
               "name": "Yu-ru Lin",
               "profile_path": null,
               "id": 1199815,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e2067a1",
               "name": "Li Lu",
               "profile_path": null,
               "id": 1199816,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e2067a9",
               "name": "Chaohua Wang",
               "profile_path": null,
               "id": 1199818,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e2067ad",
               "name": "Wang Danyi Li",
               "profile_path": "/idFUnUSurDhNqAmP2bdUMWFWKcR.jpg",
               "id": 1173011,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e2067b1",
               "name": "Jingsheng Wei",
               "profile_path": null,
               "id": 1199819,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e2067b5",
               "name": "Wu'erkaixi",
               "profile_path": null,
               "id": 1199820,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 2,
               "credit_id": "55881c91c3a36837e90066c7",
               "name": "John Sham",
               "profile_path": null,
               "id": 975654,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4df5c3a368484e20677f",
               "name": "Michael Apted",
               "profile_path": "/j5KoJlZUepN36ZD8VoDLuvV5BG5.jpg",
               "id": 10781,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4df5c3a368484e206785",
               "name": "Trudie Styler",
               "profile_path": "/nRp9sQ5PRbcZ453YBOzYcRbaf9F.jpg",
               "id": 95022,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df5c3a368484e20678b",
               "name": "Liu Sola",
               "profile_path": null,
               "id": 1199811,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "5660dd9a9251417906004fb9",
               "name": "Maryse Alberti",
               "profile_path": null,
               "id": 33678,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.472293,
      "production_countries": [],
      "id": 215134,
      "vote_count": 1,
      "budget": 0,
      "overview": "ON JUNE 4th 1989, CHINA WAS CHANGED FOREVER.  Beijing, May, 1989. the world watched as a hundred students became a thousand, as thousands became a million - and a nation starved of freedom, cried out for a taste of democracy. In this compelling film, director Michael Apted (Nell, Gorillas in the Mist), captures the power and passion of the Tiananmen Square uprising through a unique combination of newsreel footage, dramatic re-enactments and extensive input from the actual student leaders. Exploring their personal histories, reflections and thoughts on the future. MOVING THE MOUNTAIN paints a portrait of courage, conviction, and commitment that the NEW YORK POST calls, \"A soaring - and sobering - tribute to the human spirit.\"",
      "similar": [],
      "original_title": "Moving the Mountain",
      "runtime": 83,
      "poster_path": "/dhWdqTVD0LtqxIqSpvaTbiBAIMs.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Xingu Films",
         "id": 3318,
         "origin_country": ""
      }],
      "release_date": "1994-09-15",
      "vote_average": 8.5,
      "belongs_to_collection": null,
      "tagline": "Moving the Mountain",
      "adult": false,
      "homepage": "http://www.imdb.com/title/tt0110583/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Apted"],
      "runtime": 83,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110583/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTAxMTAzMjY4MV5BMl5BanBnXkFtZTcwMDg1OTAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jin-Ming Zhang, Yi-Ming Huang, Yi-fen Kan | See full cast and crew »"],
      "reviews": [
         "\"Moving the Mountain\" does an excellent job of showing the complexity of a protest movement as it develops, apparently, spontaneously. The film roots the origins of the Tiananmen Square protests in the wake of the Cultural Revolution. Although shifts in Chinese governmental policy and Glasnost in Russia gave the participants the courage to ask for a dialogue about greater democracy, the Chinese government feared the instability created by a group of people questioning the government. The film will give you a sober account of the innocence and naivety of a group of young people who simply want to make a change for the better in their country. With the continuing globalization protests and the creation of the `Patriot Acts', this film is quite relevant for a glimpse into the motivations that bring diverse groups together in a common cause, not to mention the intolerance of the people in power to the public questioning of their policies. \"Moving the Mountain\" provides one example of the many protest movements that occur around the world, meeting with varying levels of repression. This film is well worth viewing and may stimulate a hunger to find out more about the conditions in China as well as other protest movements.",
         "A powerful, informative and sometimes deeply moving documentary about China's Tianamen Square protests in 1989; what led up to them, how they went down, and their aftermath for the participants. Both the interviews and the historical footage are riveting. What isn't quite as solid is Apted's choice to stage reenactments, and sometimes intercut them into the middle of real footage. It can feel hokey and unneeded. But that one minor glitch is not enough to seriously damage such an important and worthy work. It's a shame that such an important and alive work on recent history has been allowed to go out of print in the US, although some of the better video stores still have copies.",
         "According to THE WARNING (another documentary worth seeing), \"the superstructure for a police state is in place\" in this country. \"Hope is an illusion.\" We have \"an Imperial Presidency of a corporate state,\" and, until there's a war-crimes tribunal, politicians can pay all the lip-service they like to the notion of \"Democracy,\" but TRUE Democracy will continue to wither on the vine. In MOVING THE MOUNTAIN, we see students on a hunger strike wearing headbands that read: \"STARVING FOR DEMOCRACY.\" It's a LITERAL statement, in their case. \"Democracy does not come without sacrifice,\" warns Wei Jingsheng (\"The Father of Democracy\" in China). But, \"China's problems must be solved in China,\" Wang Dan asserts. The guilt expressed by the displaced dissidents should reflect most strongly on the government that continues to this day to deny them the Democracy they crave. Li Lu put it best: \"Behind that young man facing down that row of tanks stood an entire generation.\" His background information about The Democracy Wall and its unexpected widespread acceptance (as well as his own tragic personal story) perfectly sets the stage for what was to come. \"A great movement will never die,\" he concludes. \"The hope is still there.\" One of his last thoughts is the most moving: \"I have the sense that once again I will be summoned by History.\"",
         "This excellent documentary traces the lives of a group of student leaders, their role in the 1989 democracy movement in China, and what happened to them after the tanks moved in to Tiananmen Square. This film is harrowing, as many of those interviewed are still traumatised by their experience (the film was made four years after the protests were crushed) and are living in exile. Even so, the film is important for the lessons to be learned about building a movement and resisting an authoritarian regime. It also raises many questions about leadership, responsibility, and guilt when things go wrong. And it's not all depressing - it does present a dramatic account of an extraordinary moment in 20th century history. All human rights activists should see this film -if for no other reason than to remember what happened in Tiananmen Square in 1989. I showed it in 1999 at our local university to an Amnesty International group; and last week showed it to a group of human rights activists, to commemorate all those unknown people who lost their lives in the struggle for democracy, and to remember the courage of all who participated in those events.",
         "What happened in 1989 was grandeur. I am not sure what this is called. The first ten minutes, one student leader talked about his childhood which really has nothing to do with the 1989 students' democracy movement. So it is not a 100% documentary about it. And basically, he spent the whole time talking about himself, he was sort of a narrator for this film. They even found someone who looked like him to act as him when he was a boy. The film would be more effective, if they actually have someone in the background to tell the viewers from the beginning till the end of the student democracy movement and filled it with personal interviews, raw footages, etc. A good documentary about the movement can easily make viewers cry. This one lacks of the emotional elements. It doe have real shocking footages which I have never seen before. I watched the DVD, it doesn't have closed caption or English subtitle. Some of the people who appeared in film speak with an accent, so sometimes it is hard to understand them."
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": ["Xingu Films"],
      "summaries": [
         "The film is a documentary about the demonstrations of students in Peking on the 4th of June 1989 for more democracy in the People's Republic which were ended by army forces. The story is told from students point of view.",
         "A documentary addressing the history and consequences of the protests that rocked Beijing in the Spring of 1989. The film was directed by Michael Apted (\"Gorillas in the Mist,\" \"Coal-Miner's Daughter,\" \"Nell,\" etc.), produced by Trudie Styler (Xingu Films) and Edited by Susanne Rostock, with cinematography by Maryse Alberti. The film premiered in May 1994 at the Human Rights Film Festival in New York, where it was selected by Richard Gere as the featured film for the opening night of the festival. Its theatrical premiere followed, on 19 May, 1995, in New York. Drew Hopkins, Ph.D., served as Research Director and Production Manager for the film, developing all research materials, coordinated all aspects of production and post-production from inception through release, working closely with Apted and Styler in writing all treatments, promotional materials and budgets, and presenting the project to executive producers at the BBC, HBO, ABC, and Canal-Plus (Paris). Hopkins conducted all pre-production research, interviewing scores of officials, dissidents, and sinologists in China, Hong Kong, Paris, London, and the U.S. He also coordinated on-location production in China, Taiwan, Hong Kong, Washington, D.C., New York, Los Angeles and San Francisco. This also entailed coordinating and conducting clandestine interviews with leading dissidents in Beijing, including student leader Wang Dan and Nobel laureates Wei Jingsheng and Liu Xiaobo. At the time (December 1993), Wang Dan and Wei Jingsheng had only been freed from prison weeks earlier. Wei Jingsheng's interview with Apted was among the last interviews he was to conduct prior to being placed under house arrest days later and then returned to prison."
      ],
      "budget": 0
   },
   "movielensId": 104309,
   "movielens": {
      "languages": [
         "English",
         "普通话"
      ],
      "releaseDate": "1994-09-15",
      "dvdReleaseDate": null,
      "directors": ["Michael Apted"],
      "runtime": 83,
      "movieId": 104309,
      "title": "Moving the Mountain",
      "mpaa": "PG",
      "actors": [
         "Ling Chai",
         "Yiu-ming Chu",
         "Yu-ru Lin",
         "Li Lu",
         "Chaohua Wang",
         "Wang Danyi Li",
         "Jingsheng Wei",
         "Wu'erkaixi",
         "John Sham"
      ],
      "imdbMovieId": "0110583",
      "originalTitle": "Moving the Mountain",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "ON JUNE 4th 1989, CHINA WAS CHANGED FOREVER.  Beijing, May, 1989. the world watched as a hundred students became a thousand, as thousands became a million - and a nation starved of freedom, cried out for a taste of democracy. In this compelling film, director Michael Apted (Nell, Gorillas in the Mist), captures the power and passion of the Tiananmen Square uprising through a unique combination of newsreel footage, dramatic re-enactments and extensive input from the actual student leaders. Exploring their personal histories, reflections and thoughts on the future. MOVING THE MOUNTAIN paints a portrait of courage, conviction, and commitment that the NEW YORK POST calls, \"A soaring - and sobering - tribute to the human spirit.\"",
      "tmdbMovieId": 215134,
      "avgRating": 3.5,
      "releaseYear": "1994",
      "numRatings": 1,
      "posterPath": "/dhWdqTVD0LtqxIqSpvaTbiBAIMs.jpg"
   }
}