{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt2245223",
      "video": false,
      "title": "The Source Family",
      "recommendations": [],
      "backdrop_path": "/ReZv9esuG8zw21tWKw31hjliS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49fe9251416c750da367",
               "name": "Maria Demopoulos",
               "profile_path": null,
               "id": 1016132,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49fe9251416c750da36d",
               "name": "Jodi Wille",
               "profile_path": null,
               "id": 1151847,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.405189,
      "production_countries": [],
      "id": 98064,
      "vote_count": 8,
      "budget": 0,
      "overview": "A feature documentary film set in Hollywood, examining a radical experiment in '70s utopian living. The Source Family were the darlings of the Sunset Strip until their communal living, outsider ideals and spiritual leader Father Yod's 13 wives became an issue with local authorities. They fled to Hawaii, leading to their dramatic demise.",
      "similar": [
         27586,
         258480,
         401898,
         244772,
         17130,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         437557,
         242224,
         297762,
         370663,
         9762,
         254470,
         460793,
         243683
      ],
      "original_title": "The Source Family",
      "runtime": 91,
      "poster_path": "/1dCVpRbwxPNwroH2XQ3OkwxVlY3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-11-02",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Maria Demopoulos",
         "Jodi Wille"
      ],
      "runtime": 98,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2245223/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NTI4ODc0Nl5BMl5BanBnXkFtZTcwNzE0MjcyOQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Ahom Aquarian, Isis Aquarian, Elena Michaels | See full cast and crew »"],
      "reviews": [
         "I joined The Source Family in 1970 and remained for the duration of the experience, so I feel that my review of this documentary holds some merit. I feel the filmmakers tried to present our story as honestly as they could given their limited understanding of it, especially since the pool of people interviewed were limited in scope by distance & proximity to where the actual interviews were done. The first time that I watched the documentary, it brought back a flood of memories for me from forty years ago and was somewhat unsettling and disquieting; although after watching it a few more times it began to feel less of an intrusion on my senses. And although my son's father was featured at the very end during the credit roll performing his song Woman Beyond The Sun, but did not receive even one credit for either his song or his performance; as well as credit for his song Every Morning being given to Ahom/Robin Baker because she had recorded it....those omissions aside, I felt it was a job very well done considering the source.",
         "This is a documentary about the so-called 'Source Family'--a cult built around an odd guru in California. This man, who renamed himself 'Father Yod', slowly took the group from one that saw him as a great spiritual leader to a god-like being who should be obeyed without question. This is actually pretty typical of many of the cults of the era but what makes this one a little confusing is the ending. Now, many years later, his followers are interviewed--and some sound as if they STILL think he was god, some see him as flawed but a good part of their lives and a few see him as a huckster--though this seems like the minority. So, if you are looking for clear answers, this isn't what you'll find. Instead, it's a film that you watch and make of it what you will. As for me, I found it mildly interesting but nothing more. In fact, I got far less out of it than \"Commune\"--a similar sort of documentary that was made very interesting due to folks' insights into their group today.",
         "The movie was interesting and lesson in that you shouldn't get sucked into these goofy groups with a charismatic leader. Reminded me a little of reading about Ayn Rand's in-crowd \"the collective,\" until the end, then it reminded me a lot. There is something about getting people at a young age and feeding them some inside knowledge that keeps them for life. Of course the interviewees are self selected, I would guess there are members out there who feel fooled and ridiculous for falling for all of this non-sense and didn't want any part. At the end we find out these people are not overly upset being the minions of a kooky sex cult leader, they even use the knowledge gained to be life coaches and whatnot, furthering the unreality",
         "The reviewers so far are commenting on their opinion of the SUBJECT of the film, not the filmmaking. The job of the filmmakers is to get a reaction and experience the subject - good, bad or indifferent. This is a terrific documentary. I have rarely seen a doc that has been so well researched and has so much archival material. Plus they have tracked down all these folks who were originally part of this crazy, cultural experiment. Amazing story. As a cultural document is so strong, but with the addition of all the insider participation it transforms itself into a one-of-a-kind experience. One of the best of the recent Americana docs. - thanks.",
         "I don't even know where to start. So bad! One of the worst films I've ever seen - and I've seen a bunch. Had I not been stuck home with an injury, unable to do much of anything else, I would not have watched beyond the first 10 minutes on Netflix. I should have just shut it down then, but hope springs eternal, I guess. As I often do, I kept thinking it would get better...at least a little. It did not! Here's the deal: The Kibbleheads who were in this ridiculous cult truly believed the leader was God - when he suddenly decided he was and informed them of that fact - are still whack jobs today! All the drugs and \"herbs\" they took either affected their ability to think and reason or they started out at least halfway cuckoo and ended up totally bonkers. They are apparently beyond repair and/or any hope. It's pretty scary that they're allowed to vote and allowed out without keepers! I base this on what almost all of them had to say at the end of the film. One guy lives out in the wild, completely off the grid and claims he has 2 years of food squirreled away - and \"I'm not gonna tell you where it is.\" O.K., fine by me. If it's \"food\" that will still actually be safe to eat after being kept 2 years, I doubt you need worry about it being stolen - at least not by anyone with a working brain, Doorknob. Also, the \"music\" in this made me want to claw my ears off. Truly, the worst sounds I've ever heard and not worthy of being called music. Whoever created this cacophony to accompany the film deserves to be tied up and made to listen to it 24/7 every day until they expire. Don't waste your time streaming this and absolutely don't waste any money renting or buying it...unless you're as loony as the poor idiots who were in this cult & movie. Believe me, giving it 3 stars out of 10 was an act of great generosity."
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": [
         "Eternal Now",
         "Process Media",
         "TriCal Entertainment"
      ],
      "summaries": ["A feature documentary film set in Hollywood, examining a radical experiment in '70s utopian living. The Source Family were the darlings of the Sunset Strip until their communal living, outsider ideals and spiritual leader Father Yod's 13 wives became an issue with local authorities. They fled to Hawaii, leading to their dramatic demise."],
      "budget": 350000
   },
   "movielensId": 104384,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-11-02",
      "dvdReleaseDate": "2013-06-18",
      "directors": [
         "Maria Demopoulos",
         "Jodi Wille"
      ],
      "runtime": 91,
      "movieId": 104384,
      "title": "The Source Family",
      "mpaa": "NR",
      "actors": [""],
      "imdbMovieId": "2245223",
      "originalTitle": "The Source Family",
      "genres": [
         "Music",
         "Documentary"
      ],
      "youtubeTrailerIds": ["F6xeLuxXMRg"],
      "plotSummary": "A feature documentary film set in Hollywood, examining a radical experiment in '70s utopian living. The Source Family were the darlings of the Sunset Strip until their communal living, outsider ideals and spiritual leader Father Yod's 13 wives became an issue with local authorities. They fled to Hawaii, leading to their dramatic demise.",
      "tmdbMovieId": 98064,
      "avgRating": 3.5625,
      "releaseYear": "2011",
      "numRatings": 24,
      "posterPath": "/1dCVpRbwxPNwroH2XQ3OkwxVlY3.jpg"
   }
}