{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "beach",
            "id": 966
         },
         {
            "name": "grief",
            "id": 9872
         }
      ],
      "imdb_id": "tt0117924",
      "video": false,
      "title": "To Gillian on Her 37th Birthday",
      "recommendations": [
         31083,
         38509,
         46280,
         83489,
         149553,
         38981,
         25665,
         36290,
         73336,
         144060,
         73249,
         53882,
         20471,
         79783,
         18856,
         51333,
         76297,
         249391,
         2348,
         41971
      ],
      "backdrop_path": "/kwzLc9mzKzpvRFBpil9TfeNH4Qx.jpg",
      "revenue": 4137645,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "David Lewis",
               "gender": 2,
               "credit_id": "52fe44209251416c91005ce5",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gillian Lewis",
               "gender": 1,
               "credit_id": "52fe44209251416c91005ce9",
               "name": "Michelle Pfeiffer",
               "profile_path": "/vyoJV5QYwIGZohrPpKFdKc7EpSP.jpg",
               "id": 1160,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rachel Lewis",
               "gender": 1,
               "credit_id": "52fe44209251416c91005ced",
               "name": "Claire Danes",
               "profile_path": "/6Lr3Yc53iifCPtJz1jTzjhVxa0j.jpg",
               "id": 6194,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joey Bost",
               "gender": 2,
               "credit_id": "52fe44209251416c91005cf1",
               "name": "Freddie Prinze Jr.",
               "profile_path": "/xkbGC7tDwoKUwpNcOLsNUMjLjP4.jpg",
               "id": 33260,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe44219251416c91005d07",
               "name": "Seth Green",
               "profile_path": "/7ksgEtZZIhSkJmt7zMyVDOQfdxu.jpg",
               "id": 13922,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Cindy Bayles",
               "gender": 1,
               "credit_id": "52fe44219251416c91005d0b",
               "name": "Laurie Fortier",
               "profile_path": "/kLAmSfZmLz9wNN3IVXs2BoSiPO7.jpg",
               "id": 166930,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Kevin Dollof",
               "gender": 1,
               "credit_id": "52fe44219251416c91005d0f",
               "name": "Wendy Crewson",
               "profile_path": "/e20JNF2oF7B0uGcoepL8j3uY0iE.jpg",
               "id": 19957,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Paul Wheeler",
               "gender": 2,
               "credit_id": "52fe44219251416c91005d13",
               "name": "Bruce Altman",
               "profile_path": "/vCArPsn18bhTvBs9OiWyT7SJ6Ro.jpg",
               "id": 27545,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Esther Wheeler",
               "gender": 1,
               "credit_id": "52fe44219251416c91005d17",
               "name": "Kathy Baker",
               "profile_path": "/y9Sw1QsJQvcqDPvG4vYVy1lfR5P.jpg",
               "id": 1907,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Megan Weeks",
               "gender": 0,
               "credit_id": "52fe44219251416c91005d1b",
               "name": "Rachel Seidman-Lockamy",
               "profile_path": null,
               "id": 191588,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Blonde on the Beach",
               "gender": 1,
               "credit_id": "52fe44219251416c91005d1f",
               "name": "Lorielle New",
               "profile_path": "/qfmEc3Z1gR5H5DBmeCJSvhTyfLy.jpg",
               "id": 102896,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Lifeguard",
               "gender": 0,
               "credit_id": "52fe44219251416c91005d23",
               "name": "Danny Crook",
               "profile_path": null,
               "id": 572202,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Paramedic",
               "gender": 0,
               "credit_id": "52fe44219251416c91005d27",
               "name": "Todd Haven",
               "profile_path": null,
               "id": 572203,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44219251416c91005cf7",
               "name": "Michael Pressman",
               "profile_path": "/svlIYwFa9ATEQnM4QD3iz1G59vq.jpg",
               "id": 59649,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44219251416c91005cfd",
               "name": "Michael Brady",
               "profile_path": null,
               "id": 572201,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe44219251416c91005d03",
               "name": "David E. Kelley",
               "profile_path": "/hv9yx4XnWcIjy9UkLjiZ2MNr2b9.jpg",
               "id": 59650,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "598daf90c3a3687577011f98",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "598daf97c3a36875a2010bc8",
               "name": "Tim Suhrstedt",
               "profile_path": null,
               "id": 17146,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "598db23e92514178a4012749",
               "name": "David E. Kelley",
               "profile_path": "/hv9yx4XnWcIjy9UkLjiZ2MNr2b9.jpg",
               "id": 59650,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "598db246c3a368758e011e9a",
               "name": "Marykay Powell",
               "profile_path": null,
               "id": 71762,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598db24f92514178ec0115fe",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "598db25792514178b10115d9",
               "name": "William S. Scharf",
               "profile_path": null,
               "id": 20694,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "598db25f92514178fc01197f",
               "name": "Linda Pearl",
               "profile_path": null,
               "id": 22485,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "598db269c3a36875a2010f3e",
               "name": "Michael Atwell",
               "profile_path": null,
               "id": 16493,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "598db26f92514178d6011e85",
               "name": "Linda Pearl",
               "profile_path": null,
               "id": 22485,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.152717,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30500,
      "vote_count": 18,
      "budget": 0,
      "overview": "David loves his wife, Gillian. Unfortunately, she died two years ago. David deals with his grief by continuing his romance with Gillian during walks with her \"ghost\" on the beach at night. While David lives in the past, other family problems crop up in the present in the real world....",
      "similar": [
         332567,
         339846,
         147773,
         2770,
         4347,
         829,
         1907,
         19913,
         50546,
         334541,
         374720,
         205775,
         398818,
         122906,
         296524,
         10138,
         10144,
         1089,
         2756,
         559
      ],
      "original_title": "To Gillian on Her 37th Birthday",
      "runtime": 93,
      "poster_path": "/f0n7yAcN5JT3BRhmuUaG22axVBY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Triumph Films",
            "id": 23098,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rastar Pictures",
            "id": 2070,
            "origin_country": ""
         }
      ],
      "release_date": "1996-10-18",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Some love lasts a lifetime. Real love lasts forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Pressman"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Michael Brady",
         "David E. Kelley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117924/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3MDQ1ODMwMV5BMl5BanBnXkFtZTcwNTM2ODYxMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Gallagher, Michelle Pfeiffer, Claire Danes | See full cast and crew »"],
      "reviews": [
         "I can vaguely recall when this movie was released nationwide in 1996. The title struck me as odd and aside from the fact that I wanted to see/hear how James Horner would conduct another exceptional score, I had no desire to see the film. After recently viewing To Gillian on Her 37th Birthday, I am disappointed that I didn't see it in the theater. Peter Gallagher, Claire Daines, and Bruce Altman all deliver marvelous performances. Michelle Pfieffer was a nice surprise (she's always \"nice\") as she plays her part to perfection! One of the best things about this film is the fact that you're not sure whether or not what you are seeing is real or whether it's just what's in David's (Gallagher) mind. Whichever way you believe, it's an amazingly touching film and at times it's even powerful. Great dialogue, great directing, and a great score from Horner (again), make this a truly GREAT film!",
         "David E. Kelley is a brilliant writer. The early episodes of Picket Fences & Chicago Hope, the later episodes of L.A. Law and just about every Practice & Ally McBeal ever made are examples of his great talent. The only problem he has is trying to convert that TV magic to the big screen. His movie scripts are enjoyable, but lack the energy and excitement of his great TV writing. To Gillian on Her 37th Birthday deals with a man (Peter Gallagher) who loved his wife so much, he just can't let her go. The wife's ghost seems to appear to him on the beach and he spends hours talking to her while neglecting their teenaged daughter (Claire Danes). The dead wife is Michelle Pfieffer, the best-looking ghost I've ever seen in a movie! The tension between father and daughter grows and the arrival of Gillian's sister (Kathy Baker from Picket Fences) and her husband makes things even more tense. This movie has a good cast who all give strong performances and there is a memorable scene with Claire Danes and Laurie Fortier in thong bikinis, but the movie is hurt by Kelley's weak script, which is not up to the level of quality we've come to expect from him.",
         "I was in a community theater production of Gillian, and my comments echo another review here. (Contains spoilers) David E. Kelley's screenplay used almost none of playwright Michael Brady's dialogue, the characters were obnoxious, and they made Cindy into sleazy little tramp instead of a complex character who uses attitude to cover real growing pains. Esther was just a vicious harpy and Kevin had no substance to her. Rachel gets drunk at a party, and SHE saw Gillian? He also basically scrapped the whole anthropologist angle, and the abortion vignette, which was so key to David realizing that he had indeed constructed an icon divorced from reality. And of course, Paul, my character, was just a tool!",
         "Michael Brady wrote this play, and David Kelley wrote the script for the movie. The original poster of comments went on and on about David Kelley's \"weak writing\" but we must remember that it is a play, Broadway Play Publishers owns the rights. What is a wonderful play does not trancend to the screen with all the warm fuzziness the script calls for. While you are able to put in on Nantucket and you get the scene feel, it needs to be seen live. The casting is marvelous, and worth it to see Peter Gallagher play someone very lost, and the music could have been more haunting. All in all if you want to see it, do. It's a good story and an ok movie, but if a local theatre is doing Gillian, do go see it. It's better as a play.",
         "Many people have losses that are very hard to deal with, and they must \"Let-Go\" on their own time and in their own way after processing. I think this movie was well done. I believe that many of us who have lost either a spouse, parent, sibling, etc ... have kept in contact in some way in our heart, soul and mind. Here is to Dave and Gillian, and a very good screenplay!",
         "This was one of my favorite movies ever. I watched it once and was curiously confused by the twists and uncertainties in the plot. Then I watched it again and I cried more than I have ever cried in my life. I quietly bawled, tears flowing, through the entire movie. I have recommended it to many people as a great movie, but I don't know of anyone who has seen it. I think I will go look online and see if I can buy it. It is deep, deep, deep, especially for people with mental illness in their family, or let's say emotional illness in our society. Powerful lessons are taught about love and caring for our children. People need lessons on how to love, value, and treat each other selflessly. Most of us spend so much energy, research and resources on technological and financial advancement and so little on human concerns and relationship development. Commentators are complaining that the husband is fantasizing about an idealized wife, but we actually don't have to settle for poor quality relationships. We can learn to value, nurture, support each other and be real.",
         "DVD from my public library. Claire Danes really was a 16-year-old that she plays, and all the adults were really about 37 to 40 that they play. Peter Gallagher is David Lewis, BU literature professor who claims he is hanging out at the Nantucket summer home to write a novel. But there isn't any novel. Exactly two years earlier, on her 35th birthday, his wife died in a tragic accident while sailing. He has not gotten over it by any means, and still meets her on the beach at night, they talk, they embrace, it all looks very real. But she is dead. His wife is Michelle Pfeiffer as Gillian Lewis. His daughter is Claire Danes as Rachel Lewis. Per tradition, family comes over to celebrate Gillian's birthday, and the annual sand castle competition. Kathy Baker is Esther Wheeler, Gillian's sister, David's sister-in-law, Rachel's aunt. They want David to let go, they bring along a surprise, a single 40-ish lady, Wendy Crewson as Kevin Dollof. (He was told 'Kevin' was coming, he thought it was a man.) This surprise adds a layer of drama that may not have been necessary. The core issue in the story is whether David is fit as a parent, with his reclusive lifestyle and inability to move past his wife's death, Esther thinks Rachel would be better off living with them, and she is prepared to take the issue before a judge if it comes to that. Freddie Prinze Jr., still a teen, has a small role as Joey Bost, who takes Rachel out on a date. I enjoyed the movie. The actors were well-chosen and most of the situations believable. SPOILERS: Near the end David comes to the realization that Esther is right, and Rachel confirms that, she would be better off living with the aunt. But as they are boarding the ferry to go back to the mainland, David comes to his own realization, he decides to board up the house, move back and get his old job back at BU.",
         "This is one of the worst play-to-film adaptations I've ever seen. Of course, that's because it's a terrible hack job of one of my favorite stage plays, so I'm biased. It does my heart good to see David E. Kelley completely bombing out every time he tries to make a feature film. The guy is so overrated (in my opinion.) And he really, REALLY blew it with this movie, considering how excellent, how genuinely moving the source material is. When I went to see the film (with well-founded trepidation), I noticed that the only laughs generated out of the dialogue were for jokes that are found in the original play. Unfortunately, Kelley has done great violence to the original story in his filmic massacre...I mean \"adaptation\"...and the movie falls flat, flat, flat. It utterly misses the deeper points of the stage drama. In fact, except for the basics of plot, it barely resembles the award-winning play at all. Esther, instead of being a professional psychologist, becomes in the movie version a busybody nag who has taken a couple of psychology classes, which somehow qualifies her to analyze the main character David. Pretty lame. David E. Kelley (not the main character, thank God), in his infinite wisdom, turns Cindy into a horny little slut who tries to seduce Paul, instead of keeping her the teenage girl next door who has the sweet, and somehow sad, schoolgirl crush on David. Gillian's depth and complexity of character completely disappears. In the film she's merely an ethereal beauty who hangs around to inanely chat with David. The point of the play is that she's both saint and sinner -- something Esther wants David to remember, before he idealizes her into a fantasy that drives him literally crazy. Ugh! I could go on, but it will simply make me angrier and angrier. This movie stinks. Read the play. It's only a hundred thousand times better than the movie, that's all.",
         "This is actually a good case study for people to see everything that could be done wrong being done in one place :-) Not kidding at all. If you can realize how and why is this movie ridiculous and at least a few things that should have been changed pop up at you you'll learn something from Kelley's failure - and Brady's, since the play is not exactly stellar on it's own. Like the lack of a real antagonist (Esther could have been that but that requires some writing spine and ideas), the lack of a real dramatic reversal, watering down left and right (starting with long \"karaoke\" sequences), making all characters lukewarm and mediocre to the point that there are no clear leads, a \"ghost\" talking about her own non- reality akin to a spineless, self-doubting pseudo-intellectual and loosing even a trace of a mythical etc. etc. The audience for live theater plays may tolerate some of these things for all kinds of reasons and theatrical directors sometimes do have more spine and artistic bravery to tear a mediocre play apart and bring out some sharpened characters and stronger tension and emotion. In general, theatrical talking heads require some brave intervention in order not to be plain boring. So this is a rare confluence of a mediocre play, completely spineless adaptation and equally spineless direction. The sole mystery is whether Michelle Pfeiffer did this to make her husband happy of whether he was writing lukewarm to make her happy :-) One of them has to be the principal culprit.",
         "I watched this film a number of years ago. And how could I resist? This is the film version of the play I directed at the Walla Walla Little Theater for my senior project in theater back in 1990. Suffice to say, this movie really does away with the cozy script and the well-rounded characters to present something much more \"TV-slick\" and less than emotionally satisfying. Virtually no character is the same, and many have been given personality lobotomies for no apparent reason. If you get a chance to see \"Gillian\" at your local theater, go. It's works well in a more intimate, live setting. Here, the changed story is so much wasted potential."
      ],
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Rastar Pictures",
         "Triumph Films"
      ],
      "summaries": ["David loves his wife, Gillian. Unfortunately, she died two years ago. David deals with his grief by continuing his romance with Gillian during walks with her \"ghost\" on the beach at night. While David lives in the past, other family problems crop up in the present in the real world...."],
      "budget": 0
   },
   "movielensId": 1043,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-18",
      "dvdReleaseDate": "2002-05-07",
      "directors": ["Michael Pressman"],
      "runtime": 93,
      "movieId": 1043,
      "title": "To Gillian on Her 37th Birthday",
      "mpaa": "PG-13",
      "actors": [
         "Peter Gallagher",
         "Michelle Pfeiffer",
         "Claire Danes",
         "Freddie Prinze Jr.",
         "Seth Green",
         "Laurie Fortier",
         "Wendy Crewson",
         "Bruce Altman",
         "Kathy Baker",
         "Rachel Seidman-Lockamy",
         "Lorielle New",
         "Danny Crook",
         "Todd Haven"
      ],
      "imdbMovieId": "0117924",
      "originalTitle": "To Gillian on Her 37th Birthday",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["v3HER2IPuV4"],
      "plotSummary": "David loves his wife, Gillian. Unfortunately, she died two years ago. David deals with his grief by continuing his romance with Gillian during walks with her \"ghost\" on the beach at night. While David lives in the past, other family problems crop up in the present in the real world....",
      "tmdbMovieId": 30500,
      "avgRating": 3.01182,
      "releaseYear": "1996",
      "numRatings": 1269,
      "posterPath": "/f0n7yAcN5JT3BRhmuUaG22axVBY.jpg"
   }
}