{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "mining town",
            "id": 156018
         }
      ],
      "imdb_id": "tt0069825",
      "video": false,
      "title": "Brothers O'Toole",
      "recommendations": [],
      "backdrop_path": "/ePsP2FYzajGXC9TEYrKCbpO9xok.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael O'Toole",
               "gender": 2,
               "credit_id": "52fe4a7bc3a36847f81d0605",
               "name": "John Astin",
               "profile_path": "/2b0Iv7mg0kTnyH4ZU0ajk2e0wYL.jpg",
               "id": 41230,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Timothy O'Toole",
               "gender": 0,
               "credit_id": "5353ee5dc3a3681d8d004332",
               "name": "Steve Carlson",
               "profile_path": null,
               "id": 1311574,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Callie Burdyne",
               "gender": 1,
               "credit_id": "52fe4a7bc3a36847f81d060d",
               "name": "Pat Carroll",
               "profile_path": "/u3VKH6kvq3giRZ7UJTaec262HHW.jpg",
               "id": 35232,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mayor",
               "gender": 2,
               "credit_id": "52fe4a7bc3a36847f81d0611",
               "name": "Jesse White",
               "profile_path": "/5q5wzKTgFEzjYHYQybm1OHi6ivk.jpg",
               "id": 93664,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Paloma Littleberry",
               "gender": 1,
               "credit_id": "52fe4a7bc3a36847f81d0615",
               "name": "Lee Meriwether",
               "profile_path": "/8KMAQXWV3dUBThivDqvpiUjAM8B.jpg",
               "id": 16108,
               "order": 4
            }
         ],
         "crew": []
      },
      "genres": [
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.04E-4,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 107239,
      "vote_count": 0,
      "budget": 0,
      "overview": "The O'Toole Brothers are Eastern con men, exceptionally good at talking their way out of tight situations. When they ride into Molybdenum, Colorado, not suspecting the riches beneath the streets, they turn the sleepy mining town upside-down for their search for the gold. High-spirited hijinks ensue, with the brothers involved in everything from stolen gambling equipment to a \"belchin', cussin' and spittin' \" contest.",
      "similar": [
         16314,
         18885,
         10054,
         32302,
         1562,
         858,
         2064,
         5176,
         425,
         6557,
         40508,
         433,
         8967,
         9679,
         111,
         334,
         73,
         2288,
         4347,
         244772
      ],
      "original_title": "Brothers O'Toole",
      "runtime": 95,
      "poster_path": "/x795uTp1qz6CYpIu4GQsfOVWXFj.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CVD Studios",
            "id": 46416,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American National Enterprises",
            "id": 46417,
            "origin_country": ""
         }
      ],
      "release_date": "1973-05-16",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Erdman"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Marion Hargrove",
         "Tim Kelly"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069825/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NzI3ODM3NF5BMl5BanBnXkFtZTcwMDQyNTY1Mw@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Astin, Pat Carroll, Hans Conried | See full cast and crew »"],
      "reviews": [
         "Another one buck movie off a cheap 10 Westerns DVD release, 'The Brothers O'Toole' surprised me with it's excellent script. Perhaps John Astin's finest hour, he kind of overwhelms the rest of the very good cast of amusing characters. Released a year before 'Blazing Saddles', this gives rise to the thought that the makers of that better known comedy western had seen 'The Brothers O'Toole' and took notes. For my money, 'The Brothers O'Toole' has the better script and the better cast. But - the direction is often second rate and the photography uninspiring. However, given the choice of watching the above two movies as reruns, I'd vote for 'The Brothers O'Toole' every time.",
         "If there were no other single redeeming feature of the movie, John Astin's incredible diatribe reviling every obvious wart of the benighted little town of Molly-Be-Damn as it's known for a truly tortured pun on Molybdenum, would be worth the price of admission. There is a plot, but you don't need to worry about it. Go for Astin's bluster. He appears in a dual role and takes both completely over the top. If you can take a comedy-western on a fairly broad tack, this is a good one. Crank up the popcorn machine, set your brain on farce and relax. And memorize that cussing. Someday you'll need it.",
         "About the only movie I consider funnier than \"The Brothers O'Toole\" (1973) is \"The Big Lebowski\" (1998). Both have the same combination of huge exaggeration coupled with subtle parody, exploding film conventions of their respective genres with completely out-of-place dialog. My appreciation of this no doubt speaks to a twisted sense of humor and an appreciation of the absurd; of which there is so little in more mainstream comedy features. So if you happen to be \"Duckman\" off-kilter, then \"The Brothers O'Toole\" is a film that you should seek out. John Astin's success the year before in another western parody, \"Evil Roy Slade\" (1972), inspired a sequel of sorts. Or at least a reprise of his title role, this time playing a very similar extreme outlaw character named \"Desperate\" Ambrose J. Littleberry. When not busy terrorizing citizens, poor Desperate is a henpecked husband. An almost unrecognizable Lee Meriwether wonderfully overplays his shrewish wife Poloma. It is definitely her signature performance and I laugh every time I think about what the Miss America pageant people must have thought about this hysterical portrayal. The humor in both films is nicely twisted but the \"The Brothers O'Toole\" is several notches above \"Evil Roy Slade\" on the IQ scale, which may account for it being a bit more obscure. Think \"Support Your Local Sheriff\" vs \"Support Your Local Gunfighter\" for an example of the same type of comparative difference. For Astin this is a duel role, as he and Steve Carlson play the title characters; a pair of too sophisticated drifter brothers Michael and Timothy O'Toole. Michael is an unambitious cardsharp and Timothy is a small-time rogue and roué. They come to the tiny town of Molybdenum, Colorado (Molly B'Damn to the locals) from separate disasters. Michael has just been ridden out of another town and Timothy is fleeing the shotgun wedding bells and angry father of his latest conquest, Bonnie Lou MacClanahan (Miranda Berry who is flat out irresistible). The town is a collection of characters played by a collection of character actors like Richard Erdman, Pat Carroll, Allyn Joslyn (the reluctant sheriff), Jessie White (the slimy mayor). Joslyn and White are especially good, as is Hans Conried who plays a financier obviously modeled on Cornelius Vanderbilt. The main plot device is mistaken identity as Michael O'Toole is mistaken for A. J. Littleberry and thrown in jail. Michael's summation at his trial and a later diatribe about the town are simply comedy classics, as is pretty much everything done and said by Richard Jury who plays the town's greedy undertaker, Harmon P. Lovejoy. Then again, what do I know? I'm only a child.",
         "I only saw this movie ONE time in the theater, and never again, and have racked my brains out trying to remember the title. Tonight, I looked up John Astin's name, and THERE IT WAS! When I went to the local theater to see it, I was drawn in by the teaser that it was the funniest movie ever made. If it was so funny, why was I the ONLY patron in the theater for this showing?? Anyway, I have NO memory of the plot or the characters, but there is ONE thing that sticks out in my mind. During the middle portion of the film, the townspeople hold their annual spitting, belching and cussing contest. The spitting was disgusting, of course, but the belching was funnier, even showing an infant child doing a belch. The winner of the belching contest was John Astin's \"brother\", who let loose with a winner. After that, John's character let loose with a diatribe against the townspeople using proper English words to describe the town, its people and their low-life ways to show his disgust for them. After he finished, he was declared the winner of the CUSSING contest! And that, friends, is ALL I really remember about this film! I hope it is on home video so I can see it again (for the second time|) just for the heck of it.",
         "Simplistically, this offbeat concoction may be described as a Western spoof but it is just too uneven to be truly successful as a comedy. This is perhaps explained by the fact that director Erdman was mostly a veteran character actor and only stepped behind the camera a handful of times. The opportunity allowed for fellow character actors to have a field-day can be, likewise, excused as it gives the proceedings a glorified home movie ambiance and does, on occasion, provide the viewers with flashes of amusement. Most prominent in the cast are TV stars John Astin (in a dual role, no less) and Lee Meriwether (as the embittered wife of Astin’s bandido character) but equally notable are Hollywood veterans Jesse White (as the Mayor of a sleepy Western hamlet with an unpronounceable name), Allyn Joslyn (as the Sheriff) and Hans Conried (in a very belated cameo as an oil tycoon); as was to be expected, director Erdman also contrived to give himself a small but fun role as a bemused Judge. The bulk of the narrative sees cardsharp Astin being mistaken for bandido Astin and cardsharp Astin’s no-good younger brother is more often a hindrance to his pleas of innocence than anything else. The incarcerated Astin’s eventual trial, then, requires his alter ego to dress up conspicuously as an old man but this middle section of the film is also where it really drags and sags badly. The film does get back into shape (relatively speaking) with the appearance of Conried and, especially, the climactic foulness contest – where participants of every size and shape are awarded for their prowess in belching, spitting and cussing (don’t ask) – which, for better or worse, only serves to reinforce my afore-mentioned claims of the film’s inherent “home movie” quality.",
         "I happened to see this years ago by accident. Was flicking through TV stations and came across it. I wasn't expecting much because it was clearly a B movie. But I was wonderfully surprised to find it hilarious. I never saw it again, but it has stuck in my memory ever since. From the 'cussin' contest to the town name. Wonderful stuff. John Astin was great, always thought he was unappreciated after I saw this movie. Giving it 7. OK there are some great movies, but original comedy is very hard. Try and name some really good comedies ... short list huh? So a 7 from me. Never seen it on DVD, I should probably get off my behind and find a copy :)",
         "No, it's not Blazing Saddles, but The Brothers O'Toole is nevertheless a rollicking good time. See it if only to revel in Astin's fabulous lambasting of his addle-patted brother and the denizens of Molly-Be-Damn, \"a festering pustule on the face of the western slope!\"",
         "I have to say, this is one of the oddest movies I have ever seen. It starts out looking like a good comedy... but then something happens... or rather nothing happens. The movie begins to drag. And pretty soon it makes you think \"when will it end?\" There are still funny parts, but they become hard to find. Only near the end does it pick up and start to exhibit comedy again... and by then I find myself wondering why I am still watching. Yet it is memorable. So memorable, in fact, that I've been trying to remember the title for about 4 years.",
         "Inept conman John Astin rides into a hard-luck town and is immediately arrested, mistaken for a notorious outlaw (Astin again), wanted on a whole slew of charges. This leaves his none-too-bright brother scrambling to find a way to spring him before he ends up getting hung. The idea of a wronged slickster seeking comedic revenge on a hick town that nearly did him in is a good one, but everything else about this unfunny western spoof is bad. There's hardly any laughs or action. Astin and Lee Meriwether, who plays the outlaw's estranged wife are game, but this rambling movie doesn't really give them a chance to shine.",
         "International con-man John Astin (as Michael James O'Toole) and his younger brother Steve Carlson (as Timothy O'Toole) go to a small western mining town in Colorado. The town name is probably misspelled \"Molybdenym\" and most folks pronounce it \"Molly B. Damn.\" Mr. Astin is mistaken for a notorious bank and stage robber, gets thrown in jail. Meanwhile, Mr. Carlson moves in with spinster mistress Pat Carroll (as Callie Burdyne) and bonds with her brother, young Ted Claassen (as Gurnie)... Austin plays a dual role (as \"Desperate\" Ambrose J. Littleberry) and joins the story in his other guise. His wife is lusty Lee Meriwether (as Paloma). She throws a lot of dishes. Carlson enters the town's annual \"spitting, belching and cussing contest.\" It's held by jolly Jessie White, who serves as the mayor and prosecutor. Allyn Joslyn is the nervous sheriff and director Richard Erdman is the boozing judge. Richard Jury (as Harmon P. Lovejoy) multi-tasks. Hans Conried (as Polonius Vandergelt) arrives late. **** The Brothers O'Toole (5/16/73) Richard Erdman ~ John Astin, Steve Carlson, Pat Carroll, Jessie White"
      ],
      "genres": [
         "Western",
         "Comedy"
      ],
      "productionCompanies": [
         "American National Enterprises",
         "CVD Studios"
      ],
      "summaries": ["The brothers, a couple of ne'er-do-wells, turn a sleepy mining town upside-down in their search for quick riches."],
      "budget": 0
   },
   "movielensId": 104462,
   "movielens": {
      "languages": [""],
      "releaseDate": "1973-05-16",
      "dvdReleaseDate": "2008-08-05",
      "directors": [""],
      "runtime": 95,
      "movieId": 104462,
      "title": "Brothers O'Toole",
      "mpaa": "",
      "actors": [
         "John Astin",
         "Steve Carlson",
         "Pat Carroll",
         "Jesse White",
         "Lee Meriwether"
      ],
      "imdbMovieId": "0069825",
      "originalTitle": "Brothers O'Toole",
      "genres": [
         "Western",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The O'Toole Brothers are Eastern con men, exceptionally good at talking their way out of tight situations. When they ride into Molybdenum, Colorado, not suspecting the riches beneath the streets, they turn the sleepy mining town upside-down for their search for the gold. High-spirited hijinks ensue, with the brothers involved in everything from stolen gambling equipment to a \"belchin', cussin' and spittin' \" contest.",
      "tmdbMovieId": 107239,
      "avgRating": 1,
      "releaseYear": "1973",
      "numRatings": 2,
      "posterPath": "/x795uTp1qz6CYpIu4GQsfOVWXFj.jpg"
   }
}