{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "pregnant woman",
            "id": 18011
         },
         {
            "name": "maternity ward",
            "id": 184497
         },
         {
            "name": "college life",
            "id": 221135
         }
      ],
      "imdb_id": "tt0040104",
      "video": false,
      "title": "Apartment for Peggy",
      "recommendations": [],
      "backdrop_path": "/5goK34MqerD2kJ7Zr3Dt4weyMSf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Peggy Taylor",
               "gender": 1,
               "credit_id": "52fe4e46c3a368484e217d97",
               "name": "Jeanne Crain",
               "profile_path": "/x3knqqNAV3dYUwp1w3oaNzi5sng.jpg",
               "id": 82170,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jason Taylor",
               "gender": 2,
               "credit_id": "52fe4e46c3a368484e217d9b",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Prof. Henry C. Barnes",
               "gender": 2,
               "credit_id": "52fe4e46c3a368484e217d9f",
               "name": "Edmund Gwenn",
               "profile_path": "/6IL8cwEo3yPZs6hLq07YC0boUoI.jpg",
               "id": 22600,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Prof. Edward Bell",
               "gender": 2,
               "credit_id": "52fe4e46c3a368484e217da3",
               "name": "Gene Lockhart",
               "profile_path": "/7IL5fx1mfhCiMAvYXSiY1Dj7yky.jpg",
               "id": 30234,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "Dr. Philip Conway",
               "gender": 2,
               "credit_id": "565d34f29251416db40001b0",
               "name": "Griff Barnett",
               "profile_path": "/he4PCFIpbK79BxVOZ1reTBbqj1V.jpg",
               "id": 20146,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dorothy",
               "gender": 1,
               "credit_id": "52fe4e46c3a368484e217da7",
               "name": "Randy Stuart",
               "profile_path": "/n6XzBMsCcS5Wpu9eJDxBeBFROTO.jpg",
               "id": 109407,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Wife",
               "gender": 1,
               "credit_id": "52fe4e46c3a368484e217dab",
               "name": "Betty Lynn",
               "profile_path": "/qTLshO1vBUpDKLlthZhrphDa1o9.jpg",
               "id": 133730,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Ruth",
               "gender": 1,
               "credit_id": "545388760e0a2648d6001317",
               "name": "Marion Marshall",
               "profile_path": "/uG1hRlJJAurImOfo0WHuWegD2Sn.jpg",
               "id": 110938,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Jeanne",
               "gender": 0,
               "credit_id": "54538891c3a368148d00138e",
               "name": "Pati Behrs",
               "profile_path": null,
               "id": 1380025,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Prof. Collins (uncredited)",
               "gender": 2,
               "credit_id": "5453893cc3a368147300137c",
               "name": "Charles Lane",
               "profile_path": "/wu5fTupk5atyJlCsHhXPGcdf8Mg.jpg",
               "id": 29579,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Jerry (uncredited)",
               "gender": 2,
               "credit_id": "565d35219251416db00001c1",
               "name": "Gene Nelson",
               "profile_path": "/4r2dfRAqqk4cS5oesMrUjdq1to.jpg",
               "id": 16002,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Carson (uncredited)",
               "gender": 2,
               "credit_id": "565d35759251416d9f0001b0",
               "name": "Ray Walker",
               "profile_path": "/8cOCfrJ5zbf1QvrJhPZFSuTDKXD.jpg",
               "id": 34423,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Mrs. Landon",
               "gender": 1,
               "credit_id": "5a6bfac192514105e70033fa",
               "name": "Almira Sessions",
               "profile_path": "/9KaLRatIUKBnjNNIFS3PlVLNYXY.jpg",
               "id": 107678,
               "order": 12
            },
            {
               "cast_id": 28,
               "character": "Prof. T.J. Beck",
               "gender": 2,
               "credit_id": "5a6bfae3c3a36855620030f1",
               "name": "Houseley Stevenson",
               "profile_path": "/eWtZsY8dh0aS7GePfWePkRJttbq.jpg",
               "id": 99217,
               "order": 13
            },
            {
               "cast_id": 29,
               "character": "Prof. Roland Pavin",
               "gender": 2,
               "credit_id": "5a6bfb10c3a368556c003099",
               "name": "Henri Letondal",
               "profile_path": "/uSaLbsL8aujGaKNInAjfXn90tcI.jpg",
               "id": 97284,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4e46c3a368484e217d93",
               "name": "George Seaton",
               "profile_path": "/x6G1rB1GYeGKarRKU5epFyVi3aQ.jpg",
               "id": 24939,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5352e6ea0e0a265606003697",
               "name": "Faith Baldwin",
               "profile_path": null,
               "id": 1007703,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5352e71c0e0a26561400384d",
               "name": "David Raksin",
               "profile_path": "/4XgFLYDkcoMYPcxYmD2Z9ksgOPO.jpg",
               "id": 18593,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "54538734c3a368148000136c",
               "name": "George Seaton",
               "profile_path": "/x6G1rB1GYeGKarRKU5epFyVi3aQ.jpg",
               "id": 24939,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5453874b0e0a2648c20013cc",
               "name": "Darryl F. Zanuck",
               "profile_path": "/pfl8oR2otTYihADFtjLkrtKoFrM.jpg",
               "id": 8502,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5453875fc3a3681478001308",
               "name": "William Perlberg",
               "profile_path": null,
               "id": 26024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "54538773c3a3681484001369",
               "name": "Harry Jackson",
               "profile_path": null,
               "id": 127779,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54538784c3a368146f0012a5",
               "name": "Robert L. Simpson",
               "profile_path": null,
               "id": 8505,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54538797c3a368148d00137b",
               "name": "Richard Irvine",
               "profile_path": null,
               "id": 1128336,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "545387a80e0a2648d900139d",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "545387b9c3a368148800150a",
               "name": "Thomas Little",
               "profile_path": null,
               "id": 8508,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "545387ca0e0a2648d2001403",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "545387db0e0a2648d90013a6",
               "name": "Kay Nelson",
               "profile_path": null,
               "id": 1352668,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "545387ef0e0a2648cb0013b6",
               "name": "Ben Nye",
               "profile_path": null,
               "id": 26175,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.856893,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 218212,
      "vote_count": 2,
      "budget": 0,
      "overview": "Professor Henry Barnes decides he's lived long enough and contemplates suicide. His attitude is changed by Peggy Taylor, a chipper young mother-to-be who charms him into renting out his attic as an apartment for her and her husband Jason, a former GI struggling to finish college.",
      "similar": [
         40807,
         510,
         1367,
         2064,
         11005,
         325133,
         416477,
         10312,
         48138,
         378018,
         26976,
         8469,
         4922,
         4347,
         88,
         20453,
         567,
         8065,
         8836,
         1700
      ],
      "original_title": "Apartment for Peggy",
      "runtime": 96,
      "poster_path": "/pDCWR3NoOZLbVhD5aRvqX0YWyaZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1948-09-30",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Seaton"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "George Seaton",
         "Faith Baldwin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040104/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODM3MzI5ODA3M15BMl5BanBnXkFtZTgwNDA1NTkxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeanne Crain, William Holden, Edmund Gwenn | See full cast and crew »"],
      "reviews": [
         "Behind the misleadingly sappy title lies one of the decade's most positive and humorously enriching films. On the surface, the story is about the post-war housing shortage and the difficulties returning vets had in trying to start a family in old trailers, quonset huts, or whatever lodging could be slapped together. Peggy (Jeanne Crain) is a charmingly spunky newly-wed whose husband (William Holden) is in college on the GI Bill. There she meets stodgy old professor (Edmund Gwenn) and tries to talk her way into making his attic a new home for the couple and their expected baby. The trouble is Gwenn has turned his big old house into a mausoleum in tribute to his dead wife. Now he lives alone, in despair. Having completed his life's work he sees no further point in living and thus looks forward to suicide. In the process, however, he fails to factor in the life-affirming powers of youthful zest, old-age wisdom, and the wonderfully spirited Peggy. What a fine piece of obscure film-making, from scripter-director George Seaton and the cast of three principals, though Crain is a bit much at times. The film must have cost about 50 bucks to make since nearly all the scenes are indoors, but seldom has movie-making money been better spent. Beneath the post-war plot, there's a parable about generational sharing in which each age group brings uniquely enriching benefits to those around them. Thus, Peggy brings hope, joy, and a real home to the others, while husband Holden, though sometimes wayward, brings dedication, hard work, and finally a sense of real values. And as the ivory-tower professor, Gwenn contributes from the wisdom of the ages, but also finds that true philosophical thinking lies not on the dead pages of old books, but can also be found in the unlikeliest of places-- in a launderette full of seemingly empty-headed young wives. That superbly humane scene alone is worth the 90 minutes of watching. A movie like this could have gone off-track in so many places. The material alone might easily have slid into the sort of tear-jerking treatment that would send me running for the off-button. But never do the on-screen results descend to a sappy level. Instead Seaton and Co. maintain a consistently light and intelligent touch throughout, even during the darker passages. In fact, they accomplish one of the most difficult of all challenges inside an industry where cynicism is the norm and sneering is the response to any hint of idealism. To its great credit, the film actually makes us feel that beneath our differences, something like a harmonious human community may exist after all, as the wonderfully metaphorical last scene suggests. I expect a little project like this with its unfortunate title passed quickly into movie oblivion. However, now more than ever, Apartment for Peggy needs rediscovery. For its well-delivered message is truly trans-generational.",
         "On the surface, this film looks like a typical 1940's Technicolor feel good movie On paper, the story deals with a young GI couple looking for an apartment at a University. They find a retired professor, played by Edmund Gwenn, with an attic to rent. With this storyline known, I was expecting to be entertained, a little. What a surprise though when the movie got rolling... there were so many scenes in this movie that absolutely astonished me. The very first was Gwenn's, rationality for wanting to commit suicide at the beginning of the picture. There was in the script a logic and non-sentimentality for this rational that I was very surprised to see from a film of that era. Then comes Jeanne Crain, who plays the wife. I had always thought Jeanne Crain was a pretty, competent actress and had not seen her but once or twice on the screen. But she is absolutely tremendous as Peggy. She dominates every scene she's in because her presence is just that of aliveness and wonder. Then the movie becomes more surprising when it begins to talk about issues of poverty, making a living, racial issues, money, marriage, education, and so much more. \"Never hold money so close in front of you that you can't see anything else\". There is a long scene with Gwenn and a group of women talking about Philosophy that is also very refreshing. Then comes the other surprising parts. Peggy loses her baby...the movie shows the doctor walking into the room saying \"The baby's dead\" and with a long, long silence, Holden says \"Why\" and that's it, no more sentimentality about the baby...it's over. The one scene I was completely taken aback bye was the scene where Gwenn and Holden are trying to put together a baby tub, a gift for Peggy. The scene last almost 5 minutes of these to guys trying to figure out the instructions on putting this thing together. I reminded me of an Eric Rohmer picture, where people are shown as they're doing things without the need to hurry things along for the sake of the plot and gave the viewer a great connection with the characters. Although it is not on VHS or DVD, try to seek this film on TV or any old moviehouses showing it, you will be delightfully surprised how modern and life affirming this film is. A deeply rewarding experience indeed.",
         "George Seaton's \"Apartment for Peggy\" was a surprise that was shown on cable recently. This 1948 film is a wonderful reminder of how Hollywood used to make comedy by taking amazing talent out of a pool of superb cinema actors. The film is based on a Faith Baldwin novel, which the director adapted for the screen. \"Apartment for Peggy\" tackles the problem the housing shortage right after WWII. We are taken to a college town where some students are feeling the pinch and must adapt to whatever they could get from meager accommodations. It's this way how Peggy, a young pregnant wife of a student at the university, comes upon an attic apartment that Prof. Henry Barnes didn't even remember he had. Prof. Barnes wants to commit suicide, so Peggy, and her husband Jason, are in his way to accomplish the task. Prof. Barnes feels old and left out, when in reality, he has so much to give, not only to his newly found tenants, but to the community where he lives as well. Delightful performances by the cast was what George Seaton got from everyone. Edmund Gwenn makes an impression as Prof. Barnes. Mr. Gwenn was a man that went to enhance all the films in which he appeared. Jeanne Crain is the Peggy of the title; a beautiful woman in the prime of her youth. It was obvious the camera adored her. William Holden made a likable Jason. Gene Lockhart is excellent, as always, but we didn't expect anything short of greatness out of him, or the rest of the cast. \"Apartment for Peggy\" will delight anyone looking for a good time watching this film.",
         "I watched this twice on cable. I really liked the contrasts. I loved the way the young students respected the professors and elders in general, and co-existed with them -- not just barely tolerated them. Also, just simple common sense was so pleasant to see. No \"major plot twists\" with contrived \"stupidity\". By stupidity, I mean the typical, \"such as turning your back on a bad guy\", or when teens are in a house that has a known killer in it, and the kids decide to split-up to find him, and then get picked off one at a time. Needless to say, there is no \"bad guy\" or \"killer\" in this movie, but there are a couple of things that happen, and common sense not only wins out, but was also present from the beginning. Also, the hardship of a housing shortage just after World War II versus the desire for a college education. Despite that obstacle and other obstacles, these \"young\" adults were adult about overcoming their problems, most of the time. Also, I liked that Peggy established a lecture (series?) for the wives of students when she discovered that many wives felt left out of their husbands lives due to lack of formal education. The women weren't dumb, just hadn't been exposed to the same ideas. And a note to teens of today, yes, there was a time that many students were husbands/men and wives were in a secondary position. I found the movie very uplifting, amusing and well acted.",
         "Jeanne Crain is a breathlessly talkative expectant mother who lives with her husband, a former soldier, in a trailer; she chances to meet retired professor Edmund Gwenn, who feels his mundane, monotone existence means retreating from this world, but he goes along with her plan to let the couple temporarily move into his attic. The perfect example of what they used to call 'whimsical comedy'; despite a clumsy start, it still seems heartfelt today, perhaps even meaningful. Gwenn conveys the most complex emotions simply by wordless expression, and Crain's exuberance grows on you (she's better though in her quieter moments). With these two front and center, William Holden ends up playing third wheel, but his solid, masculinely amiable presence is a nice counterpoint to kooky Crain and he also has some fine scenes alone with Gwenn. The gentlemen in Gwenn's musical troupe are all wonderful, and the writing and direction, while primed for audience approval, genuinely work wonders with what might've been a stale set-up. This tear-jerker is a true gem. ***1/2 from ****",
         "This movie gives a heartwarming story about a young couple who move into an attic of an old man who is contemplating killing himself. The funny thing is that this situation would seem in any other movie to be very melodramatic but it is handled with the utmost care in this movie. Edmund Gwenn is so good in the movie. He was Santa Claus in Miracle on 34th Street. Jeanne Crain was very refreshing as the wife.",
         "An Apartment for Peggy is a surprise for anyone who comes across it---and that seems to be the only way it is re-discovered again and again. Jean Crain is a marvel and so is Edmund Gwenn and the two have many wonderful scenes together. Crain's snappy, slang-laden talk with Gwenn's resigned philosophic thoughtfulness is delightful. When they realize other post- war wives putting their husbands through college fervently desire education themselves, Peggy and the Professor organize a lecture series at the only available location---a pool hall. The way the scene unfolds, with the Professor leading the discussion of philosophy, and then the women taking over with a spirited debate of ideas is one of the best and sadly a singular occasion that shows women in this kind of intellectual exchange. It is what the recent movie Mona Lisa hoped for but failed to bring to life. And the other plot lines---research in chemistry at Harvard, with William Holden, a former chemistry-major in his first role; the difficulties of miscarriage and medicine (folic acid); and the strong bond of 'family' that developed due to unusual configurations of folks thrown together by the housing shortage; the struggles of loneliness and suicide, all are dealt with in a fresh and fascinating way. This film is one that is great to see again and find new things to appreciate and we can only hope it will be transferred to DVD someday very soon.",
         "(Filmed in 1948) Just imagine: You're a young newly-wed woman named Peggy, married to a veteran named Jason, he's just recently returned from the Navy after World War II. He has gone through some very rough experiences. He's going to the University and housing there is greatly in demand. This scenario happened to many vets who tried to get back into civilian life after up to 4 years of war (1941 to 1945). What's a wife to do? Especially when she's pregnant with their first child and the trailer they are now occupying will soon be reoccupied by the former tenants who are away having their own baby. In Peggy's case she is lucky enough to meet retired Professor Henry Barnes in a campus park. His desire is to be left alone as he feeds the birds, contemplates his loneliness, uselessness and desires to commit suicide. Her desire is to talk, tell him her troubles and see if he can help or knows anyone who can...and use lots of not so reliable statistics. Professor Barnes makes the mistake of mentioning the name of a friend, a fellow professor who had been in charge of campus housing at one time. He's hoping to distract Peggy and send her on her way. Which works, sort of. Imagine the Professor's surprise when Peggy shows up on his doorstep wanting to see his attic because she has been told it was used as housing for single men on campus at one time? This is just his good friend's way of getting even for being put on the spot like that. And he, also, realizes that his friend, Henry, is lonely and needs some distraction. It takes awhile but she talks herself past him and up the stairs. Then with more fast talking, warm smiles and lots of interest in 'Pops' (as Peggy has decided to call him), she wins him over. She and Jason get the attic. After Peggy and Jason move in Henry begins to feel more useful. He has family. But he...no, I won't tell you what he's up to...get the movie! Peggy involves 'Pops' and his band of retired cohorts in many projects where they use their educational training with others in mind. She is a fountain of thoughts and suggestions. They are willing vessels. Then a series of situations happen that turn all their lives around. Get it, see it, enjoy it! The cast alone makes it worthwhile. It stars Jeanne Crain as Peggy; William Holden as Jason; Edmund Gwen as Professer Henry (Pops) Barnes with the lovable Gene Lockhart (Cratchett in the original \"Christmas Carol\"), Griff Barnett and a cast of several young and old.",
         "Jeannie Crain (Peggy) \"Pinky\" '49 and William Holden(Jason) \"Sabrina\"'54 showed how a young couple with just love in their hearts for each other can overcome all materialistic problems in life and still strive to obtain a college degree. However, they needed the help of Edmund Gweenn, (Professor Henry Barnes)\"Miracle on 34th St.\" '47(Santa Claus) and Gene Lockhart(Prof. Edward Bell),father of Gene Lockhart,who gave excellent supporting roles. If you get a chance to view this film on TV, it is a film to view and enjoy even in the 21 Century, where young people have the same struggles to pay the high costs of getting a simple college education even in the late 1940's.",
         "Wonderful movie set in the post-World War II period. Prof. Henry Barnes (Edmund Gwenn) is a widowed professor living in a large faculty house, and wishing death would end his lonely existence. Peggy is the bride of a WWII veteran, one of many attending college under the GI Bill. Post-war housing is at a premium,, especially for struggling Vets, but someone remembers that Prof. Barnes had an extra room, and sends Peggy to see if she can rent it. The Prof. Barnes' protests are overwhelmed by Peggy's determination to make a real home for her husband, and soon the professor has a family of sorts. Great period piece, with many warm characters. Strong performances by Gwenn and Crain. Also serves as an excellent illustration of \"The Greatest Generation\" right after they came home and began settling back into society. Another wonderful movie that should have been made into a video and DVD long ago."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Professor Henry Barnes decides he's lived long enough and contemplates suicide. His attitude is changed by Peggy Taylor, a chipper young mother-to-be who charms him into renting out his attic as an apartment for her and her husband Jason, a former GI struggling to finish college.",
         "Professor Henry Barnes is a widower and retiring college professor in a small post-WWII American town. The Professor lives alone in a huge house and he is is tired, bored and lonely. The world has changed and Professor Barnes believes he has outlived his usefulness. So, he plans to commit suicide just as soon as he has accumulated a sufficient number of sleeping pills. The married students at the college have a hard time finding housing; it is a common problem across America. When Professor Barnes meets vivacious, young Peggy, the wife of a young hero attending college on the G.I. Bill, Jason Taylor, he gets a big jolt. Peggy is so young, so much in love and so full of enthusiasm; but Peggy is also pregnant and needs a decent place to live while Jason finishes college. Peggy implores Professor Barnes to rent his attic to the couple and his first impulse is to say no. But, Peggy is charming, very pretty and determined; it is very hard to say \"no\" to Peggy. Soon, the attic is transformed and Professor Barnes is drawn into some of the problems of G.I. wives. Many of the expectant mothers are not getting vitamins and proper food, as money is tight; the husbands are working and going to class. Peggy and her friends worry about their husbands finding them ignorant or silly in comparison with their educated friends; in no time, the Professor is so busy teaching a battalion of eager young minds, loving every minute of it, he forgets about his sleeping pills and focuses on teaching plans. If pregnancy is the state of being full of life, Professor Henry Barnes learns pregnancy can be contagious."
      ],
      "budget": 0
   },
   "movielensId": 104625,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-09-30",
      "dvdReleaseDate": null,
      "directors": ["George Seaton"],
      "runtime": 96,
      "movieId": 104625,
      "title": "Apartment for Peggy",
      "mpaa": "",
      "actors": [
         "Jeanne Crain",
         "William Holden",
         "Edmund Gwenn",
         "Gene Lockhart",
         "Griff Barnett",
         "Randy Stuart",
         "Betty Lynn",
         "Marion Marshall",
         "Pati Behrs",
         "Charles Lane",
         "Gene Nelson",
         "Ray Walker",
         "Almira Sessions",
         "Houseley Stevenson",
         "Henri Letondal"
      ],
      "imdbMovieId": "0040104",
      "originalTitle": "Apartment for Peggy",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Professor Henry Barnes decides he's lived long enough and contemplates suicide. His attitude is changed by Peggy Taylor, a chipper young mother-to-be who charms him into renting out his attic as an apartment for her and her husband Jason, a former GI struggling to finish college.",
      "tmdbMovieId": 218212,
      "avgRating": 3.75,
      "releaseYear": "1948",
      "numRatings": 2,
      "posterPath": "/r2WwX6PMUpvRzVeoUEteDUMQbaH.jpg"
   }
}