{
   "tmdb": {
      "original_language": "ko",
      "keywords": [],
      "imdb_id": "tt1971466",
      "video": false,
      "title": "Leafie, a Hen Into the Wild",
      "recommendations": [
         74982,
         249766,
         41416,
         69666,
         69646,
         19961,
         69407,
         69401,
         69634,
         77089,
         25656,
         92837,
         229173,
         69399,
         239367
      ],
      "backdrop_path": "/5vvYDbG1HQPDT7jn5XcuqwC1nrQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1006,
               "character": "Leafie (lp-Ssak)",
               "gender": 1,
               "credit_id": "531af0cc92514177c2003a77",
               "name": "Moon So-ri",
               "profile_path": "/7ZM0ClQnS3A4kyhaInI8fvTCKJJ.jpg",
               "id": 83122,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Drifter",
               "gender": 2,
               "credit_id": "531af0e492514177b1003a8f",
               "name": "Choi Min-sik",
               "profile_path": "/abLCstRJLpuzG39KAiG7hD72zcn.jpg",
               "id": 64880,
               "order": 7
            },
            {
               "cast_id": 1009,
               "character": "Dal-Soo",
               "gender": 2,
               "credit_id": "531af0f592514177c2003a7d",
               "name": "Park Cheol-min",
               "profile_path": "/jKWaKtFdlxtrrXe78XF2mGLH5cB.jpg",
               "id": 138527,
               "order": 8
            },
            {
               "cast_id": 1010,
               "character": "Greenie",
               "gender": 2,
               "credit_id": "55a274779251412974003679",
               "name": "Yoo Seung-Ho",
               "profile_path": "/lgasRVoDNo5KDaaj9i9cfM6RjI3.jpg",
               "id": 110382,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a239251416c910c4747",
               "name": "Oh Seong-yun",
               "profile_path": null,
               "id": 937484,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a239251416c910c474d",
               "name": "Seonmi Hwang",
               "profile_path": null,
               "id": 937485,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a9c5e5c92514127ea036db4",
               "name": "Lee Jong-hyeok",
               "profile_path": null,
               "id": 1515520,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.304232,
      "production_countries": [{
         "iso_3166_1": "KR",
         "name": "South Korea"
      }],
      "id": 89623,
      "vote_count": 14,
      "budget": 0,
      "overview": "Based on a bestselling preteen novel of the same title that has sold more than 1 million copies in Korea, “Leafie, A Hen into the Wild” is about a laying hen named Leafie who is destined to live the “same old” repetitive life confined on the chicken farm.  Her fate changes when she escapes from the chicken farm and hatches a duck egg. With the duckling (who believes Leafie to be his mother), sets off on a journey into the wild with her new son to find her freedom.",
      "similar": [],
      "original_title": "마당을 나온 암탉",
      "runtime": 93,
      "poster_path": "/8JwK3B4EIa8t5UIyWoOzUDXUxbD.jpg",
      "spoken_languages": [{
         "name": "한국어/조선말",
         "iso_639_1": "ko"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Myung Films",
            "id": 21415,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MK Pictures",
            "id": 4685,
            "origin_country": ""
         }
      ],
      "release_date": "2011-07-28",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "South Korea",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Seong-yun Oh"],
      "runtime": 93,
      "synopsis": "A laying hen named Leafie lives a repetitive life confined on a chicken farm. Little by little she starts to long for the yard seen through the doors of the chicken farm building and dreams of going out into the yard to care for her eggs there. Her fate changes when she escapes from the farm and hatches a duck egg that she stumbled upon. With the duckling, she sets off on a journey into the wild to find her freedom.",
      "writers": [
         "Seonmi Hwang",
         "Eunjeong Kim"
      ],
      "originalLanguage": "Korean",
      "imdbLink": "http://www.imdb.com/title/tt1971466/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5OTY2OTI2NF5BMl5BanBnXkFtZTgwMDgyNjAzMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: So-ri Moon, Seung-ho Yoo, Min-sik Choi | See full cast and crew »"],
      "reviews": [
         "I watched this wonderful Korean animation with my mum and by the end we were both uncontrollably crying. A short little plot of the movie: A hen escapes the barn and somehow becomes the 'mother' to a duckling, they bond beautifully but later their differences create tension and conflict. This movie has a nice soundtrack and the vibrant colours and settings of nature are really appropriate for a kids movie but this is so much more! The pictures sort of have an anime feel in the action scenes and is usually accompanied by music for highly emotional scenes. It's hard not to feel your heart sink at these moments. If you want your kids to watch it with you then be warned: there will be tears so be careful not to take the little little ones so that they aren't wailing about how sad and yet beautiful the ending is. The post-movie feelings are hard to describe because you can't help feel that it should've ended better in terms of the story line but I think that's what the real preciousness of the movie is, it really captures the rareness of ultimate love and sacrifice that you really have to appreciate what happens. A definite must-watch and I assure you watching it as a family is incredible.",
         "Anyone who ever had, or ever was a loving mother owes it to him or herself to watch this masterpiece of Korean animation. This is definitely one of the most touching, poignant movie I've ever had the pleasure to see. It will hit straight into your heart and awoken feelings you forgot you could experience. Everything from the vibrant art style, flawless animation, well structured narrative, good balance of humor and drama and brilliantly orchestrated score brings this movie to a state of perfection few other animated features have achieved before. Little warning to parents: Leafie deals with some pretty heavy stuff. I mean, you should definitely go watch it with your older kids, but the younger ones should probably sit this one out. It was, after all, based on a book for preteens and contains scenes of violence (don't worry, nothing too graphic, and this is definitely NOT one of those hyper-violent mindless summer blockbuster) and some heavy emotional investment that might not be suitable to younger audiences. In brief: I recommend Leafie heartily to everyone, it's a definitive must-watch, but be ready to cry a river.",
         "This movie is absolutely beautiful. Taking it as it is, it's visually appealing, has it's quirky and cute moments, and just overall touches your heart. It's everything you'd expect from an animated movie. That being said, it does take on some more adult themes, however I feel like it would appeal to people of all ages, 3 year old's and 40 year old's alike. This movie beautifully touches on the troubles of a female who becomes a mother in lieu of the unfortunate circumstance that is nature and all its dangers. Her love for the child and wish to raise a child of her own puts her on the path to raising a baby who's nothing like her. The movie proceeds to touch on how hard and how rewarding parenthood can be, the good, the bad, and the ugly, especially when your children grow old enough to fly the coop and you're left to remember all the beautiful times they gave you. This movie also displays the selflessness of the female, as well as her determination to protect a child that's nothing like her and not even hers, while in turn aiding someone else in need of protecting their children. This message is beautiful for kids, as well as it is for teens or adults. TL;DR: I HIGHLY suggest you watch this, whether in the original Korean version with English subs, or the English dubbed version. It's a rewarding experience that has highs, lows and enjoyable moments. This movie is just one of those warm, memorable movies. I guarantee you'll remember it years from now even after only watching it once.",
         "Leafie looks nothing like any American animated film. It carries out its story in a way unlike American animation as well. American animated movies are almost always kids' movies, and there's an implication that the story and characters should be similarly childish. Leafie, hailing from South Korea and based on a South Korean novel called \"The Hen Who Dreamed She Could Fly\", doesn't seem interested in stooping to the six-year-old demographic. There's a lot in the movie for kids to love, but it's also a bit scary, and the story isn't as neat and orderly as one expects from a kids' movie. Leafie is bittersweet, like real life, which makes it both interesting and hard to watch. Tears were in my eyes at one point, although I never started sobbing. Leafie the hen was born on a farm but wants to escape. Over time she has a child of her own who has different abilities than her. It's frustrating for mother and son that they are different enough for the other animals to make fun of them. Parenthood and belonging are major themes; \"Leafie\" is a blend of Animal Farm, Finding Nemo, and a little bit of The Lion King. It's all a bit predictable. Some parts throw you for a loop but it's usually not that hard to guess correctly about what's going to happen next. There are some brief jokes involving toilet humor, which weren't done in a clever enough way to make me appreciate them. They're more explicit than the toned-down toilet jokes you find in Finding Nemo or The Lion King, which is probably why I found them so distasteful. I appreciate seeing an animated movie that doesn't look like the homogenized \"Pixar / Dreamworks / Disney / Sony\" style. Vibrant colors abound, and it seems like the movie was animated mostly using two- dimensional techniques. It never made me as happy as \"Ernest & Celestine\" did, and I liked the way that movie looked even more than this one, but \"Ernest\" was never as sad as \"Leafie\" either. Although the movie always looks *different*, it doesn't always make the best use of its style. Very few scenes blew me away with their visual style: Frozen, The Lion King, Ernest & Celestine, and Wall-E have \"Leafie\" beat when it comes to beautiful artwork. I'm glad I watched this; there are too many sequels and too little heart in American animated movies. Characters don't have the nuance they do in Finding Nemo, and there's not enough humor to hold together the passable, but touching plot. I suggest watching it in HD - it was released on Blu-Ray in South Korea (Region A) and Germany (B). But once you're done, look up the original ending. It's a mandatory part of the experience, and it's a shame that they cut it from the film. You'll understand why it was cut once you watch it, but it contains major spoilers, so wait until you watch the movie first.",
         "A simple heart moving story. I was initially hesitant to see a South Korean movie with English subtitles. But I am glad I did. It is a story which will make you feel emotions that you forgot as one of the reviewers said. The story starts with a poultry hen, Leafie, wanting to be free. Leafie starves herself, so that she faints and is thrown out considered to be dead. She is then attacked by a weasel just to be saved by a duck. She is infatuated only to find him already in a relationship. It is a bumpy ride from there. She happens to mother a duck and takes care of him. When the duckling grows older he rejects her for being different and calls her an abomination. The duckling gets captured by the farmer. Leafie rescues him with her friends. The duckling then starts understanding her love. Don't forget to watch the ending and have a lot of tissues handy :)",
         "People seem to think this is original, but it is much like Doggie Poo and the English dubbing is painful at best. I really wanted the hen to get killed off pretty early on. She is pretty much a very dim stalker. I watched it and just thought of movies like Single White Female. As far as being more real, not at all, you want a hardcore animation, Watershed Down, Plague Dogs, When the Wind Blows, or any number or movies. This one was very basic and half though out. I had chickens far braver than this one and far smarter. This movie just bugged me on so many levels. It was like \"are you my mom\" but if the mom had no clue if she was, or like the ugly duckling if the duckling's mother was a psycho chicken. Young kids may like it, but nothing was good in this film other than some animation. There is far better Korean animation out there. Also I just watched Song of the Sea and I was a bit sad during parts of it, but this movie had me looking at the clock and never once felling any emotion (and as I said I had both chickens and ducks as a kid and think there were fun to have around)."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Myung Films",
         "Odolttogi"
      ],
      "summaries": [
         "Leafie is a hen who manages to escape the horrible conditions of an egg production line. After surviving a harrowing encounter with a one-eyed weasel and being rejected by the barnyard animals where she grew up, a chance encounter sees her becoming the guardian of a duckling.Â  Despite the child being a duck, Leafie is willing to learn and make the sacrifices she needs in order to ensure the happiness of her son.",
         "Daisy is a hen who manages to escape the horrible conditions of an egg production line. After surviving a harrowing encounter with a one-eyed weasel and being rejected by the barnyard animals where she grew up, a chance encounter sees her becoming the guardian of a duckling."
      ],
      "budget": 0
   },
   "movielensId": 104764,
   "movielens": {
      "languages": ["한국어/조선말"],
      "releaseDate": "2011-07-28",
      "dvdReleaseDate": null,
      "directors": ["Oh Seong-yun"],
      "runtime": 93,
      "movieId": 104764,
      "title": "Leafie, a Hen Into the Wild",
      "mpaa": null,
      "actors": [
         "Moon So-ri",
         "Choi Min-sik",
         "Park Cheol-min",
         "Yoo Seung-Ho"
      ],
      "imdbMovieId": "1971466",
      "originalTitle": "마당을 나온 암탉",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["wENxx-3jYnI"],
      "plotSummary": "Based on a bestselling preteen novel of the same title that has sold more than 1 million copies in Korea, “Leafie, A Hen into the Wild” is about a laying hen named Leafie who is destined to live the “same old” repetitive life confined on the chicken farm.  Her fate changes when she escapes from the chicken farm and hatches a duck egg. With the duckling (who believes Leafie to be his mother), sets off on a journey into the wild with her new son to find her freedom.",
      "tmdbMovieId": 89623,
      "avgRating": 3.5,
      "releaseYear": "2011",
      "numRatings": 2,
      "posterPath": "/8JwK3B4EIa8t5UIyWoOzUDXUxbD.jpg"
   }
}