{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt2369497",
      "video": false,
      "title": "Three Worlds",
      "recommendations": [
         255482,
         160156,
         111728,
         204853
      ],
      "backdrop_path": "/8CKv7q0H8mtGUU3KshzkL2l9YCB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Al",
               "gender": 2,
               "credit_id": "52fe4adcc3a368484e16ad47",
               "name": "Raphaël Personnaz",
               "profile_path": "/yK75JzDbDGHV44RzJCeOrvFpQAM.jpg",
               "id": 147041,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Juliette",
               "gender": 0,
               "credit_id": "52fe4adcc3a368484e16ad4b",
               "name": "Clotilde Hesme",
               "profile_path": "/8EpC9doloj6JRmDzZWFuNcjok95.jpg",
               "id": 53429,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Vera",
               "gender": 0,
               "credit_id": "52fe4adcc3a368484e16ad4f",
               "name": "Arta Dobroshi",
               "profile_path": "/xX3eo18vU8uAsV9qQtjcKquQ3gM.jpg",
               "id": 73328,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Franck",
               "gender": 2,
               "credit_id": "52fe4adcc3a368484e16ad53",
               "name": "Reda Kateb",
               "profile_path": "/mvDuT7covYkAjK2Ix2VHJcvPyE0.jpg",
               "id": 89626,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Martin",
               "gender": 0,
               "credit_id": "52fe4adcc3a368484e16ad57",
               "name": "Alban Aumard",
               "profile_path": "/4Y41NxGrTNCN3ZqSptehr5zDLs4.jpg",
               "id": 1088197,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Marion",
               "gender": 1,
               "credit_id": "52fe4adcc3a368484e16ad5b",
               "name": "Adèle Haenel",
               "profile_path": "/hjdVKSzqs8QXtARvV2RTbzR1a4H.jpg",
               "id": 68816,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4adcc3a368484e16ad43",
               "name": "Catherine Corsini",
               "profile_path": "/eGvGhQu0EQX1JHA0DgTN70RLLvs.jpg",
               "id": 73654,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4adcc3a368484e16ad61",
               "name": "Benoît Graffin",
               "profile_path": null,
               "id": 51117,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4adcc3a368484e16ad67",
               "name": "Catherine Corsini",
               "profile_path": "/eGvGhQu0EQX1JHA0DgTN70RLLvs.jpg",
               "id": 73654,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4adcc3a368484e16ad6d",
               "name": "Claire Mathon",
               "profile_path": null,
               "id": 1090814,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.822128,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 126321,
      "vote_count": 7,
      "budget": 0,
      "overview": "Al, a young man from a modest background is about to marry his boss’ daughter, along with succeeding him as the head of a car dealership.  One night, while coming back from his bachelor party, he is guilty of a hit-and-run accident, urged by his two childhood friends present in the car. The next day, gnawed with guilt, Al decides to inquire about his victim. What he does not know is that Juliette, a young woman, has witnessed the entire accident from her balcony.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         858,
         141,
         634,
         112160,
         394117,
         376867,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Trois mondes",
      "runtime": 100,
      "poster_path": "/rLTISWu9tOsiPrZ6l3eEZuF2YNO.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Pyramide Productions",
         "id": 58749,
         "origin_country": ""
      }],
      "release_date": "2012-12-05",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Catherine Corsini"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Catherine Corsini",
         "Benoît Graffin"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt2369497/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyMTE3NzQ1Ml5BMl5BanBnXkFtZTcwNjQxNDc2OQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Raphaël Personnaz, Clotilde Hesme, Arta Dobroshi | See full cast and crew »"],
      "reviews": [
         "THREE WORLDS is a stunningly dramatic film directed by Catherine Corsini who co-wrote the story and screenplay with Benoît Graffin in collaboration with Antoine Jaccoud and Lise Macheboeuf - a film that approaches several poignant subjects that all weave together to make this a study in human responsibility from birth to death. The acting is extraordinary, the pacing exactly on mark, the cinematography by Claire Mathon enhances the themes, the subtle musical score by Grégoire Hetzel underlines the tension, and the lessons it presents and drives home make is one of the more important social statements before the public today. And additional credit should be given to Film Movement for bringing it to our attention. Al (the very fine Raphaël Personnaz) is an attractive young man who has risen from the lower stratum of French society to become the co-owner of an automobile firm owned by the shifty but wealthy Testard (Jean-Pierre Malo) and is due to be married to the Testard's daughter Marion (Adèle Haenel) in 10 days. Out celebrating one evening with his friends and fellow workers Franck (Reda Kateb) and Martin (Alban Aumard) Al is the perpetrator of a hit and run accident, critically injuring a Moldavian pedestrian, a scene that is witnessed by the pregnant Juliette (Clotilde Hesme), a woman struggling with her own problems of relationship with the baby's philosophy professor father Frédéric (Laurent Capelluto) who calls 911 to the scene. Al is terrified of his actions, but is convinced by his friends to ignore the situation: after all, the victim is merely an illegal immigrant. Juliette is wrought with empathy, discovers the victim's name, meets the victim's wife Vera (Arta Dobroshi) and the two women bond. Al is so disturbed by his action that he visits the hospital where the victim is in ICU and is seen by Juliette who then sets about to find Al to ask him to do the right thing - turn himself in to the police or at least give money to Vera who is without funds to pay for her husband's care. The plot becomes more complex as Al and Juliette are drawn together - Juliette is the only person with whom he can share and admit his guilt. Juliette is then placed in a position of intermediary between the critically wounded husband of Vera, Vera's Moldavian 'family' and Al. How the situation resolves - including the consequences of Al's moves with his boss and his finance and his encounters with Vera and her 'family' and the death of Vera's husband forms the closure of this powerful film. There is a scene in a classroom where Juliette's husband is teaching philosophy that quotes Martin Heidegger, a German philosopher known for his existential and phenomenological explorations of the \"question of Being\" who Frédéric quotes as saying 'the only thing we truly own is our death'. It is a poignant moment that allows the rest of the film's themes to gel. This is a superb film worthy of wide attention. Grady Harp",
         "This film is actually a sort of mix up between thriller, social and drama. A film about guilt which grabs you from the beginning to the end. Very well built and acted, this is the tale of a hit and run accident that occurs the death of an illegal foreigner. Three men, including a young executive, are aboard the vehicle responsible of the accident and decide to keep silence about the whole thing. But a young woman is witness of it and succeeds in finding the driver. She also searches and finds the deceased's wife too. Very well edited, I repeat, and also enhanced by brilliant, above average performances, this picture provides very good feeling for the audience. Some poignant scenes, such as this one, where the young widow goes shopping, buying a fancy suit for her dead husband's funeral, so that his body remain decent even in his own grave. Unforgettable sequence. Maybe, we could consider this feature too much cheesy, from time to time, as if the female director wanted the audience to think this or that, this way rather another... But no film is flawless. It remains a very good movie.",
         "Ultra serious drama with BIG themes - migrant workers, social barriers, personal responsibility. Upward socially mobile Personnaz is driving one of the company's Mercs with his hoon mates, when the car hits a Moldovan illegal worker, under pregnant Hesme's window. By going to the hospital she becomes involved in Personnaz' life and that of the injured man's wife Dobroshi, who has the best scenes - demanding the payment for the dead man's organs, which they make in her own country from a trying to be understanding French medical team or laying out the cost of repatriating the body or the final assessment of legal consequences. Much unraveling of lives and self re-assessment. Dim plausible location filming and serious performances. Occasionally impressive"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Pyramide Productions",
         "France 3 Cinéma",
         "Canal+"
      ],
      "summaries": ["This is the tale of a hit and run accident that results in the death of an illegal foreigner. Three men, including a young executive, are aboard the vehicle responsible of the accident and decide to keep silence about the whole thing. But a young woman is witness of it and succeeds in finding the driver. She also searches and finds the deceased's wife too."],
      "budget": 0
   },
   "movielensId": 104774,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2012-12-05",
      "dvdReleaseDate": "2013-06-25",
      "directors": ["Catherine Corsini"],
      "runtime": 100,
      "movieId": 104774,
      "title": "Three Worlds",
      "mpaa": null,
      "actors": [
         "Raphaël Personnaz",
         "Clotilde Hesme",
         "Arta Dobroshi",
         "Reda Kateb",
         "Alban Aumard",
         "Adèle Haenel"
      ],
      "imdbMovieId": "2369497",
      "originalTitle": "Trois mondes",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Al, a young man from a modest background is about to marry his boss’ daughter, along with succeeding him as the head of a car dealership.  One night, while coming back from his bachelor party, he is guilty of a hit-and-run accident, urged by his two childhood friends present in the car. The next day, gnawed with guilt, Al decides to inquire about his victim. What he does not know is that Juliette, a young woman, has witnessed the entire accident from her balcony.",
      "tmdbMovieId": 126321,
      "avgRating": 2.125,
      "releaseYear": "2012",
      "numRatings": 4,
      "posterPath": "/rLTISWu9tOsiPrZ6l3eEZuF2YNO.jpg"
   }
}