{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt2371824",
      "video": false,
      "title": "Paradise: Faith",
      "recommendations": [
         150897,
         103686,
         121359,
         35075,
         288708,
         174371,
         214251,
         94649,
         186332,
         192142,
         382212,
         180685,
         29722,
         104317,
         51122,
         88052,
         253277,
         33642,
         20017,
         60971
      ],
      "backdrop_path": "/dwqwLe0LSEzUN3aNBqzdck6bu3R.jpg",
      "revenue": 6508,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Anna Maria",
               "gender": 1,
               "credit_id": "52fe4b45c3a368484e1808d7",
               "name": "Maria Hofstätter",
               "profile_path": "/qJfP2qKrolxANEgwzgpiTwUvotv.jpg",
               "id": 40525,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Nabil",
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808db",
               "name": "Nabil Saleh",
               "profile_path": null,
               "id": 1169611,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Natalya",
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808df",
               "name": "Natalya Baranova",
               "profile_path": "/ssJXXbbVHVcHMhbt7E0G9XKkdIZ.jpg",
               "id": 40523,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Herr Rupnik",
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808e3",
               "name": "Rene Rupnik",
               "profile_path": null,
               "id": 1169613,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 0,
               "credit_id": "534658a00e0a265fe9001178",
               "name": "Daniel Hoesl",
               "profile_path": null,
               "id": 1134670,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b45c3a368484e18089d",
               "name": "Ulrich Seidl",
               "profile_path": "/kXCopAgsprzVaunIOOT4Nvt890f.jpg",
               "id": 40506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b45c3a368484e1808a3",
               "name": "Ulrich Seidl",
               "profile_path": "/kXCopAgsprzVaunIOOT4Nvt890f.jpg",
               "id": 40506,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4b45c3a368484e1808a9",
               "name": "Veronika Franz",
               "profile_path": "/b32SwlwIMxhBjEhFxvZPtueAkOv.jpg",
               "id": 40509,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b45c3a368484e1808af",
               "name": "Edward Lachman",
               "profile_path": "/yXhB83p1aRpJzd3qKke6uBYescB.jpg",
               "id": 6345,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808b5",
               "name": "Wolfgang Thaler",
               "profile_path": null,
               "id": 803,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808bb",
               "name": "Christof Schertenleib",
               "profile_path": null,
               "id": 40518,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808c1",
               "name": "Eva Roth",
               "profile_path": null,
               "id": 1169609,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808c7",
               "name": "Andreas Donhauser",
               "profile_path": null,
               "id": 40515,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808cd",
               "name": "Renate Martin",
               "profile_path": null,
               "id": 40516,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b45c3a368484e1808d3",
               "name": "Tanja Hausner",
               "profile_path": null,
               "id": 1169610,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.636349,
      "production_countries": [
         {
            "iso_3166_1": "AT",
            "name": "Austria"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 129734,
      "vote_count": 33,
      "budget": 0,
      "overview": "Second film in Ulrich Seidl's Paradise trilogy. A devout Catholic woman practises her religion at home and in the local community, but is unprepared for the reappearance of her estranged husband, who is a Muslim.",
      "similar": [],
      "original_title": "Paradies: Glaube",
      "runtime": 113,
      "poster_path": "/6Egz4mlWNxbPfAhZQI6MOGit0Ix.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "2012-08-29",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Paradise Trilogy",
         "id": 243811,
         "poster_path": "/voylusyFQZJV3DsDH7sJIZZxe7c.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Austria",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ulrich Seidl"],
      "runtime": 115,
      "synopsis": "Anna Maria (Maria Hofstätter) is a middle-aged Austrian woman who lives alone in a well-knitted house in Vienna. When she doesn't work in the hospital then she clean her house thoroughly. But she doesn't feel alone; she has Jesus; she loves Jesus; This unconditional love to god, empowers her to overcome the temptations of her flesh, by praying and by using methodically all sort of self- punishments. But she is not alone in her quest; she is member of a small ultra-religious group which tries to bring back the Catholic faith to Austria; when she takes a break from her work instead of going to vacations, she tries door to door, to bring God to the poor neighborhoods, which are occupied mostly by immigrants. Although her faith is strong, it is going to be challenged not only by the various reactions of the people that she tries to approach, but also back home, where her past is vividly back. Her crippled Muslim husband is back and demands a share of her love, who offers gladly only to Jesus.",
      "writers": [
         "Ulrich Seidl",
         "Veronika Franz"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt2371824/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA3MzczOTkyOV5BMl5BanBnXkFtZTcwNTg1NzI4OQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Maria Hofstätter, Nabil Saleh, Rene Rupnik | See full cast and crew »"],
      "reviews": [
         "I saw this film as part of the Rotterdam film festival 2013. After having seen Paradise: Love in the Ghent film festival 2012, I was of course prepared for having to watch not-so-easy digestible scenes. In other words, some scenes you wished you were somewhere else, but still you feel the need to observe what's going on because you won't miss a tiny thread of what the film makers want to get across. Maybe I was prepared too much, surprisingly finding myself less bothered in my spectator role than with predecessor Paradise: Love. Especially the masturbation scene with a crucifix for which we were warned by several professional reviewers, progressed nicely under the blankets and proved suggestive rather than shown in the flesh. More problematic for me to watch were her house calls while attempting to convert people to the catholic faith, or at least to interest them for Saint Mary. She carries a nearly life-size statue of Saint Mary along during her missionary journey. Cold calling as she practices is unsympathetic by definition. It may come to no surprise that she meets resistance with most of the people, particularly in the poor neighborhoods with many immigrants she has chosen as her target. But it perfectly fits in her belief that all of Austria should become catholic, as propagated by a small ultra-religious group that counts her as a devoted member. We see a few scenes with group meetings, but these insights were kept relatively short, confined to relevant background information, no more no less. The film starts on the last working day before her holiday. We see her making preparations for the self-assigned task of spreading her belief. This is apparently her main occupation during her holidays, being happy that she now has all day for making house calls. Not an encouraging journey, however. She has to cope with indifference at best, more often than not with skepticism and hostility, and meets loaded questions to challenge the position she advocates when visiting people (for instance) living together out of wedlock. It is not always easy to explain the rules imposed by the catholic church, and one can always ask who has the right to determine what entails a mortal sin. Yet she seems unshakable in her belief. As a bonus we see vivid discussions from time to time, on average not with either side being really right or wrong. The story gets more and more interesting when her husband decides that it is time to reunite. Though it is not made very explicit, I assume they never formally divorced. They apparently lived apart a number of years for reasons not revealed to us. The husband is a follower of Allah, a fact that raises questions how these two got married in the first place. The husband is crippled, and totally dependent on a wheelchair. Of course, her belief considers his health situation as a sort of punishment, better said a divine retribution with a specific purpose. Her first action after his homecoming is to arrange a separate sleeping place for him, in spite of his stance that sleeping together is a matter of course when people are married. Their mutual relationship deteriorates further as the story progresses. Differences in beliefs are a core element in their disputes, in combination with her firm position to avoid all forms of sex and intimacy with her husband. These two story lines intertwine throughout the film, both with headstrong beliefs about right and wrong as fundamental driving forces. Difficult moments for us, viewers, are for example repeated self-flagellation scenes, when she considers herself to have underperformed in her missionary activities, or when she suspects any mark of infamy however small in our eyes. All of this fully justifies the title of this film. Though religion was lost on me many years ago, even I have to admit that the situation becomes more and more interesting alongside subsequent developments. All in all, a compelling performance of the main characters, especially Anna Maria who we are allowed to follow from close-by. The extent of religious belief we see is very extreme. We may recognize it from books and movies, mostly set in times long past or in areas far away. Such a strong and persistent devotion is rarely seen in western countries, but I can very well imagine that more or less underground movements like this exist even here. Fanatics are not time bound, and exist within many religions. We read and hear about it at present, leading to breakups between people, or at worst even physical abuse and destructive activities. This movie lets us re-consider our own position in this, letting us think why we have dropped the religious education we previously received. Yet I have no answer to those questions. The only constructive thing I could do was giving a maximum score for the audience award when leaving the theater. Not everyone seems to agree, since it ranked far below the top: 42th (out of 176) with score 4.016 (out of 5) from 703 votes.",
         "Austrian screenwriter, producer and director Ulrich Seidl's fourth feature film which he co-wrote with screenwriter Veronika Franz and co-produced, is the second part of his Paradise trilogy which was preceded by \"Paradise: Love\" (2012) and succeeded by Paradise: Hope (2013). It premiered In competition at the 69th Venice Film Festival in 2012, was shot on location in Austria and is a Austria-Germany-France co-production which was produced by producers Philippe Bober and Christine Ruppert. It tells the story about a middle-aged Catholic missionary worker named Anna Maria who is a member of a minor group of religious adults called Legio Corbis Jesu who promises their number one man that they will make Austria Catholic. Anna Maria lives on her own, has a cat she tends to from time to time and likes to sing and play on her keyboard, but her relationship with religion which goes beyond comparison is the most important aspect of her life and after starting on her vacation she begins walking from door to door imposing her message upon whomever she meets and insisting that they join her in praying to the Virgin Mary. Distinctly and statically directed by Austrian filmmaker Ulrich Seidl, this quietly paced fictional tale which is narrated mostly from the main character's point of view, draws an exceptional and moving portrayal of an utterly devout and headstrong Austrian woman whose faith is challenged when she is reunited with her husband named Nabil. While notable for its naturalistic milieu depictions, distinct production design by production designers Andreas Donhauser and Renate Martin, cinematography by American cinematographer Edward Lachman and Austrian cinematographer Wolfgang Thaler, use of sound and use of colors, this character-driven and dialog-driven story and scrutinizing examination of religion which stands out amongst the director's three individual and connected films and which is as hilariously comical as it is seriously unsettling, depicts a heartrending and close to surreal study of character. This conversational, situational and theatrical drama which is set in Austria and where the very unorthodox relationship that the sister of the sex tourist in Kenya has with the man of her prayers is disturbed by the arrival of her spouse, is impelled and reinforced by its cogent narrative structure, substantial character development, subtle continuity, exceedingly brilliant dialog, instrumental and vocal music and the poignant acting performances by Austrian actress Maria Hofstätter and actor Nabil Saleh. A minimalistic, dramatic, cinematic and incisive narrative feature which gained, among other awards, the Special Jury Prize Ulrich Seidl at the 69th Venice Film Festival in 2012.",
         "The second movie of the 'Paradise' trilogy which sets in the summer holiday. Like I said in my previous review all the three stories happen in the same timeline in different locations with different themes and people. This movie which unfolds the story of 'Faith' of a woman in her 50s. And her devotion and affection towards Christ. Be ready to to see drama on a serious subject within a few dark humorous. Anna Maria is a nurse in a private hospital. In her summer vacation she begins to do a missionary work as spreading the religious awareness to the people of Austria. Some of her friends' support it by joining the prayer she orange in her home and sometime she goes door to door to every house in her neighborhood. As planned the expedition runs smoothly until her long gone husband return home which shook her. Her real faithful will be tested when he begins to interfere into her work. It was quite a nice second movie of the trilogy. It mainly speaks about the honest dedication of a religious stuffs. Sometime clash between another religious showed in the movie was very much true. The director's approach in this second movie was very much artistic. But in scenes where he showed about sex hunger like outdoor orgy and masturbation were totally not understandable. You know, unlike the first movie 'Paradise: Love' I thought it will be exactly opposite and a pure spiritual content story. The director had a different opinion in his mind and mixed with multiple sub-contents. In the end, the ends of both the movies were not much distinct but the audience will be divided especially adult and spiritual theme fans. 7.5/10",
         "This film goes right in the heart of it all in Austria and for that matter in Western Europe as well. Islam is coming and Christans are afraid! That is the real truth! Struggle of Anna Maria and Nabil is a struggle of the worlds, different continents and cultures. But it has compatibility to it. Struggle between two great religions brings them together in love-hate relationship! Who will win? People in the park! They are the only the once who understand: There is no God and only thru sexual satisfaction you can achieve happiness before inevitable end! It is also a story of foreigners coming to Austria for a better life and they do not find any! Austrians are terrified from them but can not start ovens in Aushwitz or Dachau yet. That little bit of power USA and Russia still have, prevents them from doing that. Please try to obtain this film and watch it!",
         "We have a loser at the focus of the story and gets humiliated in a variety of different situations. These themselves were constructed to create the classical gritty art-house feel. It feels as if made my a film school graduate who got the assignment to create a collage of gritty situations related to faith. This resulted in a storyline which had no credibility. I'm surprised that this film has received awards at festivals. It was one of the most unoriginal films I've seen. This is not only related to the story but also to lighting and general feel. On a positive note the encounters she had with \"real\" people was well observed but were just three excellent short films. This film reminded me in many places of films made by Peter Mullen and British Social Realism which is repeated over and over again."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Ulrich Seidl Film Produktion GmbH",
         "Tatfilm",
         "Société Parisienne de Production"
      ],
      "summaries": [
         "Anna Maria, a single woman in her 50s, devotes her summer vacation to doing missionary work, so that Austria may be brought back to the path of virtue. On her daily pilgrimage through Vienna, she goes from door to door, carrying a foot-high statue of the Virgin Mary. When her husband, an Egyptian Muslim confined to a wheelchair, comes home after years of absence, her life is turned upside down.",
         "A lonely wife has become obsessed with Catholicism (although we find out early on that she was originally married to a now-missing Muslim man). As her loneliness increases, so does her religious fervor, to the point where she spends her vacation time walking through different (and sometimes dangerous) neighborhoods in a quest to re-convert all of Austria to Catholicism. Carrying her statue of the Virgin Mary and endlessly repeating the rosary, she eventually begins to engage in ritualistic physical punishment, such as self-flagellation, purportedly out of her love for Jesus. But a nagging undercurrent of repressed sexuality and transference looms large in her masochistic behavior, and when her Islamic husband returns by surprise, we see the real extent of her \"Christian\" behavior."
      ],
      "budget": 0
   },
   "movielensId": 104998,
   "movielens": {
      "languages": [
         "العربية",
         "Deutsch"
      ],
      "releaseDate": "2012-08-29",
      "dvdReleaseDate": null,
      "directors": ["Ulrich Seidl"],
      "runtime": 113,
      "movieId": 104998,
      "title": "Paradise: Faith",
      "mpaa": "NR",
      "actors": [
         "Maria Hofstätter",
         "Nabil Saleh",
         "Natalya Baranova",
         "Rene Rupnik",
         "Daniel Hoesl"
      ],
      "imdbMovieId": "2371824",
      "originalTitle": "Paradies: Glaube",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["OlAPlz2CCOo"],
      "plotSummary": "Second film in Ulrich Seidl's Paradise trilogy. A devout Catholic woman practises her religion at home and in the local community, but is unprepared for the reappearance of her estranged husband, who is a Muslim.",
      "tmdbMovieId": 129734,
      "avgRating": 3.36207,
      "releaseYear": "2012",
      "numRatings": 29,
      "posterPath": "/6Egz4mlWNxbPfAhZQI6MOGit0Ix.jpg"
   }
}