{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "holocaust",
         "id": 1739
      }],
      "imdb_id": "tt0379158",
      "video": false,
      "title": "Imaginary Witness: Hollywood and the Holocaust",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "narrator",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81ccffd",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a6cc3a36847f81cd001",
               "name": "Norma Barzman",
               "profile_path": null,
               "id": 119463,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd005",
               "name": "Michael Berenbaum",
               "profile_path": null,
               "id": 7493,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd009",
               "name": "Robert Clary",
               "profile_path": "/fAKYA3aCP9Y22764Y8ByxIKXG8N.jpg",
               "id": 165467,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd00d",
               "name": "Dan Curtis",
               "profile_path": null,
               "id": 29648,
               "order": 4
            },
            {
               "cast_id": 27,
               "character": "",
               "gender": 0,
               "credit_id": "5327baa39251411a1e001655",
               "name": "Ralph Edwards",
               "profile_path": "/dPULl6iMi8fuHhMojtwcXf9EUAy.jpg",
               "id": 1221925,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd015",
               "name": "Ralph Fiennes",
               "profile_path": "/95C56hfbvSA1UNvD433EzXviyV5.jpg",
               "id": 5469,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd019",
               "name": "Stanley Frazen",
               "profile_path": "/nErDliVc4h7mJ8CIAAK2xKwxAjk.jpg",
               "id": 32125,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd01d",
               "name": "Ben Kingsley",
               "profile_path": "/2Eu3j31JDJek70ZXLY6xfeUaJoR.jpg",
               "id": 2282,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd021",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd025",
               "name": "Branko Lustig",
               "profile_path": null,
               "id": 930,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a6cc3a36847f81cd029",
               "name": "Abby Mann",
               "profile_path": null,
               "id": 12140,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd031",
               "name": "Vincent Sherman",
               "profile_path": null,
               "id": 19528,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd035",
               "name": "Steven Spielberg",
               "profile_path": "/pOK15UNaw75Bzj7BQO1ulehbPPm.jpg",
               "id": 488,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd039",
               "name": "Martin Starger",
               "profile_path": "/6fUAYOXgAXpbSzYP3xnVmJ4ezZh.jpg",
               "id": 30592,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd03d",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 17
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd041",
               "name": "George Stevens Jr.",
               "profile_path": null,
               "id": 24803,
               "order": 18
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd045",
               "name": "Malvin Wald",
               "profile_path": null,
               "id": 86190,
               "order": 19
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a6cc3a36847f81cd049",
               "name": "Harry M. Warner",
               "profile_path": null,
               "id": 1170501,
               "order": 20
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a6cc3a36847f81cd04d",
               "name": "Fritz Weaver",
               "profile_path": "/bUEX09s2t9vMN3Z5IHchpfxpijU.jpg",
               "id": 6839,
               "order": 21
            },
            {
               "cast_id": 30,
               "character": "Himself",
               "gender": 2,
               "credit_id": "552a79c7c3a36858d60036bb",
               "name": "Gene Reynolds",
               "profile_path": "/bjrNIqNKFqZsd38FMkrTiXtyzXe.jpg",
               "id": 14874,
               "order": 22
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a6cc3a36847f81ccff9",
               "name": "Daniel Anker",
               "profile_path": null,
               "id": 1181223,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a6cc3a36847f81cd053",
               "name": "Daniel Anker",
               "profile_path": null,
               "id": 1181223,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a6cc3a36847f81cd065",
               "name": "Bruce Shaw",
               "profile_path": null,
               "id": 1096257,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "54858d599251416a6c002c97",
               "name": "Nancy Schreiber",
               "profile_path": null,
               "id": 17048,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54858d689251416a5d002d0c",
               "name": "Tom Hurwitz",
               "profile_path": null,
               "id": 143066,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.382479,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 106599,
      "vote_count": 2,
      "budget": 0,
      "overview": "Daniel Anker’s 90-minute documentary takes on over 60 years of a very complex subject: Hollywood’s complicated, often contradictory relationship with Nazi Germany and the Holocaust. The questions it raises go right the very nature of how film functions in our culture, and while hardly exhaustive, Anker’s film makes for a good, thought provoking starting point.",
      "similar": [
         424,
         423,
         51828,
         41630,
         200727,
         289222,
         10358,
         10096,
         38,
         28468,
         35056,
         388,
         4233,
         2667,
         254470,
         16869,
         637,
         639,
         668,
         301337
      ],
      "original_title": "Imaginary Witness: Hollywood and the Holocaust",
      "runtime": 92,
      "poster_path": "/pTU6ZTOf0MXlfs0ycOVgh7Q9SDS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Anker Productions Inc.",
         "id": 14901,
         "origin_country": ""
      }],
      "release_date": "2004-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Daniel Anker"],
      "runtime": 92,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0379158/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyMTMwOTEzMl5BMl5BanBnXkFtZTcwNjUzNTkyMg@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Gene Hackman, Norma Barzman, Jack Benny | See full cast and crew »"],
      "reviews": [
         "I am perplexed that this documentary has not reached more people. And I am equally confused as to why the IMDb \"weighted\" rating is below 6 when only TWO people gave it less than a 6! Does this make sense????? Will IMDb publish this review? Anyway, this is an expertly made documentary on Hollywood, not just how they handled one topic, but how they are embroiled in current politics. There will be some surprises to some moviegoers and clips from some relatively unknown gems, some of which I have never seen and will now seek out! I am a big fan of Gene Hackman but I think his narration was a little lackluster. Otherwise, I have to give this documentary a big thumbs up.",
         "A great review of what Hollywood needed to do -and whatnot- to expose Nazi Germany's intentions... It is a well-documented film with great interviews and original footage to prove that cinema can be used for either wrong or right purposes... This one, it is for the right mission: illustrate how coward was US witnessing what Hitler was doing against the Judaism... Nevermore, please! And even though some raw footage is missing when US troops discovered the death camps, the narration accomplished the feelings of those who watched back then... Hopefully Michael Moore sees this documentary to make him to shift their style of film documenting, where serious stuff can be covered straight forward, without all the comic gimmicks he used to abuse them on his films...",
         "\"Imaginary Witness: Hollywood and the Holocaust\" (2004) was directed by Daniel Anker and narrated by Gene Hackman. The film is a serious, in-depth exploration of Hollywood's and television's portrayal of the Holocaust. The director presents film clips--both newsreels and commercial films--about Hollywood's response to the Holocaust before, during, and after World War II. Hollywood is an industry, of course, not a force for or against social justice. Both before and after the war, Hollywood's decisions about portraying the Holocaust hinged on the possibility of profits, or loss of profits, from depicting the Nazi horrors. Seventy-five years after the rise of Naziism, we forget how much support Fascism then had in the U.S. and in western Europe. Producers, even though many were Jews, feared losing potential markets if they portrayed the true nature of the situation in Germany. During the war, many filmmakers worked for the Army Signal Corps, and they accomplished great things. However, most American leaders were more interested in defeating the Germans than in saving the Jews and other minorities being shipped to concentration camps. After the war, an unwritten code of silence arose. Possibly producers believed that an honest portrayal of the Holocaust would alienate audiences. Also, of course, postwar Germany was considered an important ally in the struggle against Communism, and politicians quietly urged that Hollywood turn its attention elsewhere. Another factor in downplaying the Holocaust was the wish to prevent people from asking, \"Why didn't we do something?\" It wasn't until the 1970's that television producers realized that people would watch dramas about the Holocaust. Once the unspoken taboo was broken, Hollywood struggled to catch up. However, it's interesting to consider how long it took for films like \"The Pawnbroker,\" \"Sophie's Choice,\" and \"Schindler's List\" to make it to the screen. All in all, an excellent, but discouraging film. Worth seeing, but definitely not a feel-good movie. We saw \"Imaginary Witness\" at the outstanding Rochester Jewish Film Festival. However, it should work well on a small screen",
         "An outstanding account of the atrocities that happened in Germany, and Hollywood's dealing with in in light of the makeup of Hollywood, the acceptable mores of the times, the House Un-American witch hunt, and other factors. It was interesting that television led the way in presenting the Holocaust with a guest on \"This is Your Life\" being the first instance. After a weak Anne Frank movie, TV returns with Judgement at Nuremberg on \"Playhouse 90\" in 1959. The fact that one of the sponsors was The American Gas Company muted the effort. But, Hollywood soon began to get it right. It was after The Holocaust, an 8 hour miniseries was aired and survivors began telling their stories. How Hollywood handled this tragic part of history is an interesting story and part of a body of knowledge that will help in viewing these films.",
         "This documentary goes over the history of the Holocaust on film from 1940 up through today (2004). What I found most interesting is how they actually started with the presentation of Nazis on film, and not the Holocaust in particular. The point being that aside from \"Great Dictator\" and \"Mortal Storm\", many films of the war era were not at all critical of the Nazi regime... in fact, they were almost pleasant. What I next found interesting was the reluctance to use he word \"Jew\" in a movie. Anne Frank was a Jewish girl who died in the Holocaust. Yet, apparently, the first film version of Frank's story goes out of the way not to mention why her family is being persecuted because they felt that non-Jews would not be able to identify with the events. Interestingly, Steven Spielberg says that not many films have been made about the Holocaust. I would say that all depends on how you define \"not many\". There have been hundreds, starting with a slow trickle (5) in the 1940s and up to dozens a year since the 1970s...",
         "Imaginary Witness, Hollywood and the Holocaust (2004) The history of Jewish persecution under Nazi rule as presented in Hollywood movies is a very interesting and complex subject. Imaginary Witness, Hollywood and the Holocaust (2004) attempts to document Hollywood's treatment of the Jewish experience in Germany during World War Two and in particular, what has become known as the Holocaust. While being critical of America and the Allied powers for not stopping the Holocaust before or after it began, \"They knew what was happening yet did nothing!\", this film is clearly designed to pull at the heart strings. In plainer language, Imaginary Witness is sophisticated Hollywood propaganda. Steven Spielberg makes a somewhat remarkable comment early in this film claiming; \"The reason Hollywood hasn't made many Holocaust pictures is because it is an ineffable experience only understood by those that survived the camps.\" Maybe when compared with the Hollywood Western, which of itself rests on the genocide of the Native American Indians, Holocaust pictures are few but since the 1960's there has been a steady and increasing flow of films and TV series that deal with the issue of the Holocaust during World War Two. As the film attests, Hollywood did not want to overtly criticise or alienate the Nazi regime but it fails to mention that the reason was primarily financial because Germany was a highly profitable audience for the US studios at the time. As the film states, it took the non-Jewish Charles Chaplin and his classic and independently produced The Great Dictator (1940) to break the self imposed silence of the Hollywood moguls on the plight of the European Jew. Chaplin's classic, The Great Dictator, while popular with the crowd was severely criticised by the establishment at the time and made Chaplin some powerful enemies. Imaginary Witness is made from a solely Jewish perspective and almost all the talking-heads are Jewish. The historical omissions are considerable, the speculation abundant and the tone is one of veneration. The reality is that Hollywood has exploited the Holocaust. What would be of interest is a film that studies how Hollywood has implanted the image of the Holocaust so succinctly into our minds. The result of this sanctified history is that today literature by those that question certain events concerning the Holocaust have their books burned and are thrown into jail by official sanction. It is also of note that the Holocaust TV series (1978) and War and Remembrance TV series (1988) are noted by the narrator as being based on novels yet when Schindler's List (1993) is mentioned, it is said to be based on a book. This may be a subtle difference but it shows the level of sophistication that Hollywood propaganda has reached in our ignorant and misinformed age. The list of historical inaccuracies in movies such as Schindler's List are numerous yet while some may be admitted as fictitious, the movie has the power to make them fact, certainly for an impressionable audience. As with all historical movies, history automatically becomes inaccurate (language, location and chronology are often the first compromises) and at the same time it becomes our official history when the images are repeatedly drummed into our minds. What is not mentioned in Imaginary Witness, Hollywood and the Holocaust (2004), nor can it be expected, is the truth that the Second World War contained numerous Holocausts, such as the bombing of Dresden, the fire bombing of Tokyo and the dropping of the Atomic bombs on Hiroshima and Nagasaki. \"Never Forget\" is the modus of the Holocaust yet historical films of war, injustice and brutality have been rendered moot due to the ongoing atrocities and genocide in the world today. The 1 million killed in Iraq since 2003, of which 90% are civilians, the continuing occupation of Afghanistan, the bombings of Pakistan, Somalia, Yemen and Libya, the daily brutalities and crimes against humanity perpetrated in apartheid Israel. Why one particular historical atrocity should be venerated in numerous movies and TV series above all other genocidal atrocities is a lingering question. Another question is why a people so persecuted could be so ready and willing to persecuted another people while at the same time justifying that persecution on their own historical persecution. However much the Holocaust has been portrayed on screen, it is clear that the lesson of the Holocaust has not been learnt."
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": ["Anker Productions"],
      "summaries": [
         "Of recent historical events, few events have been so searing, and thus so difficult to depict faithfully both in nature and scope in film, than the Holocaust perpetrated by the Nazis. This film tells the story of Hollywood's approach to the subject, starting with its initial pre-war reluctance to alienate the lucrative German market. With World War II, and the discovery of the Nazi horrors, we follow Hollywood's reaction over the decades to the atrocity. Challenged with a tragedy that beggared the imagination of artists and audiences, Hollywood grew from trying to keep it in the abstract to striving to depict it head-on in ways that would be both truthful and respectful with the proper humanity.",
         "The history of Hollywood's handling of the Nazis and its later depiction of the Holocaust they perpetrated."
      ],
      "budget": 0
   },
   "movielensId": 104971,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-01-01",
      "dvdReleaseDate": null,
      "directors": ["Daniel Anker"],
      "runtime": 92,
      "movieId": 104971,
      "title": "Imaginary Witness: Hollywood and the Holocaust",
      "mpaa": "",
      "actors": [
         "Gene Hackman",
         "Norma Barzman",
         "Michael Berenbaum",
         "Robert Clary",
         "Dan Curtis",
         "Ralph Edwards",
         "Ralph Fiennes",
         "Stanley Frazen",
         "Ben Kingsley",
         "Sidney Lumet",
         "Branko Lustig",
         "Abby Mann",
         "Vincent Sherman",
         "Steven Spielberg",
         "Martin Starger",
         "Rod Steiger",
         "George Stevens Jr.",
         "Malvin Wald",
         "Harry M. Warner",
         "Fritz Weaver",
         "Gene Reynolds"
      ],
      "imdbMovieId": "0379158",
      "originalTitle": "Imaginary Witness: Hollywood and the Holocaust",
      "genres": [
         "Documentary",
         "History"
      ],
      "youtubeTrailerIds": ["NAgLtIcGU0E"],
      "plotSummary": "Daniel Anker’s 90-minute documentary takes on over 60 years of a very complex subject: Hollywood’s complicated, often contradictory relationship with Nazi Germany and the Holocaust. The questions it raises go right the very nature of how film functions in our culture, and while hardly exhaustive, Anker’s film makes for a good, thought provoking starting point.",
      "tmdbMovieId": 106599,
      "avgRating": 3.83333,
      "releaseYear": "2004",
      "numRatings": 3,
      "posterPath": "/pTU6ZTOf0MXlfs0ycOVgh7Q9SDS.jpg"
   }
}