{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "horror",
         "id": 8087
      }],
      "imdb_id": "tt1022883",
      "video": false,
      "title": "Pig Hunt",
      "recommendations": [
         213224,
         108147,
         80034,
         273511,
         183661,
         30286,
         162010,
         24716,
         283150,
         213803,
         406582,
         84293,
         84558,
         18217,
         280005,
         59120,
         47891,
         40446,
         52017,
         113957
      ],
      "backdrop_path": "/ursBfGIrtq7i2ezVrx6LhemuXXB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Hickman",
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b59f",
               "name": "Travis Aaron Wade",
               "profile_path": "/hpsZOtrJzXoibhIKBKIBz84Xmky.jpg",
               "id": 89375,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Brooks",
               "gender": 1,
               "credit_id": "52fe444dc3a368484e01b5a3",
               "name": "Tina Huang",
               "profile_path": "/88gyrF0i0oY5rrKUhzu2Y0X1ODK.jpg",
               "id": 89376,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5a7",
               "name": "Howard Johnson Jr.",
               "profile_path": null,
               "id": 89377,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5ab",
               "name": "Rajiv Shah",
               "profile_path": null,
               "id": 89378,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5af",
               "name": "Jason Foster",
               "profile_path": null,
               "id": 89379,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Poppy",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5b3",
               "name": "Lanie Grainger",
               "profile_path": null,
               "id": 89380,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Quincy",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5c9",
               "name": "Trevor Bullock",
               "profile_path": null,
               "id": 163157,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ricky",
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5cd",
               "name": "Nick Tagas",
               "profile_path": "/3EUbMJ7QJZSyEVTOJdOyyo10lgd.jpg",
               "id": 966383,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Hippie Stranger",
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5d1",
               "name": "Bryonn Bain",
               "profile_path": null,
               "id": 966386,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Crystal",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5d5",
               "name": "Christina McKay",
               "profile_path": null,
               "id": 1088979,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5d9",
               "name": "Charlie Musselwhite",
               "profile_path": null,
               "id": 1088980,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Preacher",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5dd",
               "name": "Les Claypool",
               "profile_path": "/oGgmohJnEqL61W98X4T7ZWzVgyZ.jpg",
               "id": 87274,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Sage",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5e1",
               "name": "Marissa Ingrasci",
               "profile_path": null,
               "id": 1005797,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "T.J.",
               "gender": 0,
               "credit_id": "52fe444dc3a368484e01b5e5",
               "name": "Luis Saguar",
               "profile_path": null,
               "id": 200057,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5b9",
               "name": "James Isaac",
               "profile_path": "/j1j2q5iVzPptPNr1p9NluULP89L.jpg",
               "id": 69579,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5bf",
               "name": "Robert Mailer Anderson",
               "profile_path": "/bBMklYzM9aY9n82BSGeHkUMDfEm.jpg",
               "id": 89381,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe444dc3a368484e01b5c5",
               "name": "Zack Anderson",
               "profile_path": null,
               "id": 89382,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "5360c15a0e0a262f46000e22",
               "name": "Robert Mailer Anderson",
               "profile_path": "/bBMklYzM9aY9n82BSGeHkUMDfEm.jpg",
               "id": 89381,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5360c18b0e0a262f3b000db8",
               "name": "James Isaac",
               "profile_path": "/j1j2q5iVzPptPNr1p9NluULP89L.jpg",
               "id": 69579,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5360c1b70e0a262f3b000dc8",
               "name": "Nancy Hayes",
               "profile_path": null,
               "id": 1315164,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5360c2120e0a262f32000e01",
               "name": "David E. Russo",
               "profile_path": null,
               "id": 51386,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "5360c2300e0a262f3b000dda",
               "name": "Aggie Guerard Rodgers",
               "profile_path": null,
               "id": 8428,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "572c6404c3a3684b65000577",
               "name": "Adam Kane",
               "profile_path": "/wVmfwTmm4P8CknVKBYSwJ7edGU1.jpg",
               "id": 18695,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.476871,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22731,
      "vote_count": 18,
      "budget": 0,
      "overview": "When John takes his San Francisco friends to his deceased uncle's remote ranch to hunt wild pigs, it seems like a typical guys weekend with guns - despite the presence of John's sexy girlfriend Brooks. But as John and his crew trek deeper into the forest, they begin tracking the awful truth about his uncle's demise and the legend of The Ripper -- a murderous three-thousand-pound black boar!",
      "similar": [
         1690,
         19994,
         16871,
         1991,
         2024,
         76617,
         24,
         19912,
         282035,
         156022,
         126889,
         4232,
         2667,
         298250,
         505177,
         381288,
         588,
         49530,
         127144,
         769
      ],
      "original_title": "Pig Hunt",
      "runtime": 100,
      "poster_path": "/xshNV9XQsOI2z6gKAmS6o0Tlmrr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Epic Pictures Group",
         "id": 7662,
         "origin_country": ""
      }],
      "release_date": "2008-07-31",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.pighuntmovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James Isaac"],
      "runtime": 99,
      "synopsis": "In the opening scene, with a man running for his life through the forest, obviously in a panic he hides behind a tree, trying to spot what was following him. As he calms down, something comes up from behind him, throwing him up into the air and back down again. The man screams as something begins eating him, and as the man dies, the camera turns to a pair of dog tags that are slowly overtaken by a small river of blood. In San Francisco, John Hickman (Travis Aaron Wade) and his girlfriend Brooks (Tina Huang) are a pair of residents who invite their friends; tough guy and military man Ben (Howard Johnson Jr.), his close friend Wayne (Rajiv Shah), as well as the naive and weak-willed Quincy (Trevor Bullock) and his dog Wolfgang, to a backwood redneck community for a weekend of hunting, drinking and fun and camping near John's uncle's home. Enroute, they stop at a gas station for directions and encounter a van of hippie women and their male leader who run a commune in the woods nearby. After obtaining some supplies and directions, they make their way to the abandoned cabin and camp outside. The next morning, they encounter Jake (Jason Foster) and Ricky (Nick Tagas) old friends of John's who are interested in joining them on a wild hog hunt. Quincy, who is eager to get to know them is obviously inexperienced in any sort of outdoor activities, and Jake accuses Wolfgang of being a 'pet' not a 'dog' seeming equally oblivious to hunting as well. As the group makes their trip through the woods, they encounter an area called the Big Wallow, where boars are known for hanging out and using a horn as a lure, they manage to convene several pigs on their location. One of them rams into Wayne's leg at full charge giving him a compound fracture in his kneecap and incapacitating him. Wolfgang goes charging after the boars while Brooks shows off her marksmanship talents and kills one of them. While looking for a way to carry Wayne back to the cabin, Quincy encounters a large stash of marijuana plant in a forest clearing and leads the others to it, leaving Brooks with Wayne. A conflict emerges when John objects to Jake and Ricky taking the plants for profit as they appeared to have been cultured, and an ensuing argument forces Ben to kill Ricky who was ready to kill John. Jake flees to tell his inbred clan, and the others return to Wayne and Brooks, while Quincy and Ben start making their way back to the cabin while Brooks and John leave Wayne to seek help and head for town. Shortly after their departure, Wayne is attacked by something and manages to fire off a single round. Brooks and John circle back and find him missing as well as Ricky's body. Meanwhile, Ben and Quincy make their way back to the cabin. They find Wolfgang's mutilated body, and determine he was killed by the rednecks. Ricky and Jake's clan make their appearance, Ben manages to kill his pursuer and escape, but Quincy is knocked out of the jeep he was attempting to escape in, and is executed by the bloodthirsty rednecks in a fashion of any suffering animal; with a single gunshot wound to the back of the head. The redneck clan members then go after the surviving hunting party where they are ambushed and killed in passing by Brooks as she and John make their way to the main road, only to be pursued themselves by the clan. The wounded Ben makes his way and finds the commune where he is led into an enormous pit. He encounters Wayne who says that something has been eating him, Ben turns to see something approaching him, but his fate is not shown. Brooks and John run into the same hippie they had seen earlier who slays two of the redneck hunters and leads the pair of them back to the commune. When John questions why Ben's equipment is there, but not Ben himself is not, they force him into a cell while the leader takes Brooks out into the pit. They encounter \"Pigzilla\" an enormous, three-ton and a half boar who is finishing the remains of one of the redneck clan. Jake makes his way to the commune and forces himself into John's cell, as Jake prepares to kill him, one of the commune women attack him, stabbing him in the eye with her boar's tooth necklace before she gets shot. Jake dies from his wounds while the hippie leader tries to feed Brooks to the boar. She forces him to move in front, causing the boar to turn its gaze on him, and despite his best efforts, he has his intestines ripped out by the creature. John forces his way from the cell and using a crossbow, fires an arrow up under the boar's jaw. He uses force and lodges the arrow up into the boar's brain, killing it. As the pair recover from these events, they fail to notice one of the redneck clan's children watching in anger as John and Brooks make their escape from the commune.",
      "writers": [
         "Robert Mailer Anderson",
         "Zack Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1022883/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzOTcxOTIzN15BMl5BanBnXkFtZTcwNzE0Njg1Mw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Travis Aaron Wade, Tina Huang, Howard Johnson Jr. | See full cast and crew »"],
      "reviews": [
         "Pig Hunt get's 8 out of 10 points from me. It has everything that should be in a horror movie, some weirdos (like the \"redneck family neighbors\" or the \"hippie community\") and some strong characters like Jason Foster who sometimes visually comes up like a sort of \"badass\" Aragorn ( by the way Travis Aaron Wade and Tina Huang as main char's did a great job, too). The story has multiple threats what makes it more interesting than other films in this genre, it contains enough suspense, horror and gore (great job on the special FX even the mutant pig) and good action too! As there are many horror movies simply duplicating old \"hits\" this one does not come up with really something new, but it has enough potential not to see it as a copy of the older genre stuff because of his mixture of horror and monster movie. As a real fan of this genre i spend a good time on that!",
         "Not for the faint of heart. James Isaac directs this gory low budget flick from Fangoria. John Hickman(Travis Aaron Wade)puts together a hunting weekend for some of his San Francisco buddies that is suppose to be a guys-only thing; but somehow John's girlfriend Brooks(Tina Huang)is a tag-a-long. Fine; John hustles the group off to his late uncle's property in the boondocks to hunt wild pigs. This outing will not be a typical weekend trip...there will be hillbillies, hippies, massive marijuana fields, muddy wallows and the legend of a big ass 3,000 pound wild boar named \"The Ripper\". Things get violent, insane and bloody. Others in the cast: Howard Johnson Jr., Trevor Bullock, Jason Foster, Rajiv Shah and Christina McKay.",
         "In this bloody mix of RAZORBACK & DELIVERANCE, a group of buddies head into the woods to take down a wild Razorback, who is said to be the biggest boar that has ever lived! however the boys soon discover this is one wild hog that just may take them down & apart instead! as it goes around picking them off one by one & that's not all, they also must face not only an all female cult & their male leader who worship the thing & offer it human sacrifices, but also a group of backwoods hillbilly maniacs who seek vengeance for the death of one of their family, who was shot by one of the hunters. With all three threats surrounding them, can they make it out of the woods alive & if so, will they all be in one piece? JASON X director JIM ISSAC, has delivered a pretty decent genre effort. Released under the new FANGORIA FRIGHTFEST label, PIG HUNT is a fairly amusing horror item that has all three of it's stories seemingly going on all at once & while the film is a tad overlong & while the boar isn't really featured all that much, the film still manages to wring out a few good performances from the actors, taut direction & has many suspenseful & bloody moments to keep the horror fan occupied (not to mention a little nudity) there's also plenty of slime (courtesy of the Pig of course!) & the body count is pretty high by the time the film is finished. Recommended to horror fans. If only it could have been a bit short though... *** stars",
         "Honestly, I saw this movie against my will. To my surprise, it was a joy and a pleasure. This movie is pure camp. I knew the plot of the movie within the first 20 minutes to be honest. A scary adventure for the cityfolks amongst the redneck, backwoods folk. However, even though they do pay homage to Deliverance - this movie goes in an entirely different direction. The anchor in this film for me was the lead actress. She was subtle yet strong - and sexy all at the same time. The characters were surprising because it included many minority actors who brought strong performances. As ridiculous as the plot was, I enjoyed the acting. I even enjoyed when you saw them cringe at the clichéd lines because they gave it their all. That is the KEY for good camp. The cinematography was clearly lacking, but I wonder if that was done purposely for the camp factor. This was pure fun, pure ridiculousness, and just an all around good time. It never took itself too seriously, but brought much more than I expected.",
         "There aren't a whole lot of horror movies out there involving pigs. Or maybe there are, but not as many as there should be. Most of the time pigs in popular culture are cute, funny, a term of insult, to a majority the word pig brings up a dirty, snuffling and shuffling pack of beasts in a farmers yard, waiting to get turned into delicious food. So to use pigs as a force for horror, to have them preying on humans, it's a good role reversal. Plus, the basic form of a pig doesn't take too much distortion and increase in size to become a pretty menacing looking customer. It was with these thought in mind that I sat down to Pig Hunt, unknowing that the pig action is actually just one aspect of the film, it being more of a backwoods genre mash up. The film sets about its build up during the course of a hunt, friends out for macho bonding in the forest (though one girlfriend tags along), a soaking, chilly trek with a few hints and rumours to stir a sense of mystery. Monster pig action is conspicuously absent for quite some time as the film combusts somewhere around the halfway mark, blazes through exciting hick-sploit action and some more unexpected craziness before we finally get into monstrous territory. Fortunately, the beast is mighty impressive, no CGI in sight, a tightly shot ferocious tusked beast rather worth the wait. A downside of all of this is that such a set up somewhat requires decent, memorable or likable characters and performances and Pig Hunt is pretty meh on the characterisation and acting fronts. No one is especially bad, but equally I never felt much for anyone. Travis Aaron Wade is a competent enough hero figure, Tina Huang does a fair tough gal schtick as his girlfriend, Howard Johnson Jr. makes for a decent a-hole, slightly more of a punch is provided by Jason Foster and Nick Tagas as wild natured but initially friendly hicks, while most notable is Les Claypool as a bulky, mystical figure who becomes important later on in the game. Though generally competent, the film suffers from a drawn out first half in which presumably we are supposed to get to know the characters so we can suffer and thrill along with them, but as mentioned they just aren't especially interesting. Slick, wet and vivid cinematography from Adam Kane makes for a suitably arduous atmosphere and when things do get exciting director James Isaac keeps tight, stylish hold on things, making for one or two impressive, thrilling moments. There's more nudity than might be expected, which is rather pleasing to behold, and a few good grisly scenes, the film isn't too concerned with gore but uses it for some nifty jolts. Interestingly, the goriest scene involves a pig rather than a human. Comment on the savagery of man? I could have done with more general gore, a shorter first half and longer final block (the film needs more pig!) but generally I was pretty pleased by this one. No classic, but certainly a worthy modern day B picture.",
         "This movie certainly wasn't anything like I expected, yet I'm not quite sure whether that's a good thing or not. Based on the title and particularly the enticing DVD-cover, I was anticipating (or hoping�) to see a good old-fashioned creature feature and perhaps even a homage to that nostalgic childhood favorite of mine; \"Razorback\". Instead, \"Pig Hunt\" is a lot more ambitious than that (perhaps even too ambitious for its own good) and presents a miscellany of creature feature, hillbilly backwoods horror, slasher and even satanic cult horror. Oh, and there are naked lesbians! The film starts traditionally enough, with a bunch of enthusiast friends (read = stereotypical twenty-something idiots that certainly don't belong in the woods) heading out to the Californian wilderness to go a-hunting for wild hogs. They quickly get stuck with two obtrusive marijuana-addicted and aggressive local yokels, who tell them about the most notorious inhabitant of the woods: a humongous and ferocious 3.000lbs hog nicknamed \"The Ripper\". The group runs into conflict with a sect that worships the giant hog as some sort of deity, but their main issue lies with the hillbillies. Pretty soon, the teens find themselves pursued by bloodthirsty hicks and only then The Ripper. The variety of sub plots made it very difficult for me personally to like \"Pig Hunt\", but I acknowledge that James Isaac (director of \"Jason X\" and late 80's guilty pleasure \"House III\") wanted to try something innovative and daredevil. The film all too often feels overly hectic and incoherent, which is a shame because Isaac does create a decent macabre atmosphere and swears by traditional non-computer engineered special effects. There's also a lot of gore and shocking imagery, including a detailed pig-gutting process, so better make sure there aren't any kids around then. Overall, this is an admirable attempt at hardcore horror but nevertheless ends up in the dreaded category of mediocrity because it's too random and all over the place. I like foaming hillbillies and naked lesbian hog-worshipers as much as the next guy, but here I wanted to see a big fat monster eating idiots from the city. Call me naive, but I think a movie entitled \"Pig Hunt\" should largely stick to humans hunting pigs and vice versa.",
         "Pig Hunt is set in San Francisco where John Hickman (Travis Aaron Wade), his girlfriend Brooks (Tina Huang) & a couple of their friends have decided to go hunting in the great outdoors for the weekend, the four friends travel to John's dead uncle's cabin to prepare for the hunt. Two local Hillbilly brother's Jake (Jason Foster) & Ricky (Nick Tagas) show up & offer to act as guides on a Pig hunt, rumours of a huge 3000lb Hog nicknamed 'Ripper' & 'Hogzilla' are used to add interest. The hunters set out & venture deep into the forest where they find a marijuana crop, a group of lesbian hippies & discover that the rumours of a huge man eating Hog are in fact true... Co-produced & directed by James Isaac I must admit that I am not a fan of modern low budget horror & I really wasn't expecting much from Pig Hunt but I was surprised to find an oddball exploitation horror film that certainly has plenty going on even if it doesn't quite know how to juggle everything with total success. There are lesbians, cult's, a weird Hog worshipping cult leader, Rednecks, car & bike stunts, Pig hunt's, drugs, nudity, gore, moral dilemmas, a giant mutant Hog monster & lots of backwoods brutality in a really odd mix of Deliverance (1972), Razorback (1984) & Wrong Turn (2003) that has so many things going on but the script doesn't really know how to bring them all together & the climax basically features anyone left alive in the same place with a giant monster Pig as it is finally revealed. Pacing is a bit of a problem in Pig Hunt, at almost one hour & forty minutes it could have done with maybe a good ten minutes cut from it, it just takes a little bit too long to get going & certain sequences just go on for too long. The character's are alright but I can't quite work out the Iraq war symbolism on show, from teens who aren't soldiers dressing up & acting like soldiers to hunt Pigs to John's uncle having lots of anti-Bush newspaper clippings in his cabin for no apparent reason. I assume the intention was to make a film in which hunting, shooting & killing isn't glamorised & have the Pig hunt represent actual combat in Iraq but the whole war vibe is completely ditched about halfway through as either the script or director forgot about it. There is some decent gore here, a guy's knee cap is torn off, a Pig has it's head sawn off & is then gutted in a very gory sequence, a Deer is shot & killed, a Snake is shot & impaled with an arrow, more Pigs are shot, there's plenty of guts on show, a guy is shot in the head, someone is impaled to a wall, a guy has his head cut off, a severed hand is seen, there's an eye gouging, there's plenty of blood splatter & very little CGI which is nice. The giant Pig monster isn't seen until the last fifteen or so minutes & it's good old latex rather than CGI, even though the makers couldn't afford to make an entire giant mutant Pig monster since we only ever see close-up & tight shots of it's face & eye's. Set in the forest the film does have an isolated feel. There are a few car & motorbike stunts & your typical insulting horror film clichéd interpretation of Rednecks who are all inbred psychos with bad teeth. There's also a fair bit of nudity at the end as an entire cult of women walk around naked. The IMDb says Pig Hunt had a budget of about $6,000,000 which I find hard to believe, there's no way this cost that much. The production values are nice, it's well made & the lack of horrible CGI is a definite plus. The acting is fine, the cast do a good if not amazing job. Pig Hunt is an odd film, it's a Redneck backwoods brutality film, a giant killer Pig film, a slasher thriller film that has lots going on if nothing else. I liked it for it's mix of odd moments, styles & genres & the gore & nudity don't hurt either. Much better than I expected, not a masterpiece but an entertaining backwoods brutality exploitation monster flick. It could have been worse.",
         "Horror conventions like Frightfest are an ideal home for z- grade movies, because they will be lucky to find distribution anywhere else. At first glance, Pig Hunt may seem like one such movie, but once you see it you realize that labelling it as Z-grade may a tad degrading. Sure it's low budget, but the premise is something more legitimate than the kind of rip off of a rip off of a rip off that one might be anticipating. Indeed Pig Hunt's problem is not a lack of material. On the contrary, it has too much. The film is overambitious and uncertain of what it wants to be. It delivers a scenario where hunters go after pigs, pigs go after hunters, hillbillies go after hunters, and Eurasian brothel girls are after anyone. Pig Hunt is arguably enjoyable in that it doesn't feel predictable or familiar. It has a fun disgusting sense of humour, which is sustained for all most the entire running length, but is still not enough to keep the viewer blind to the movie's error. After a while, Pig Hunt starts to feel bloated and overlong. When it's all said and done, Pig Hunt could be called an amusing mess. I can't say I didn't enjoy it, I guess it's all a matter of how you approach it.",
         "A mashup of elements from \"Razorback,\" \"Deliverance\" and other rural-peril faves, \"Pig Hunt\" proves an enjoyably offbeat hybrid horror exercise. Helmer Jim Isaac's first indie production, following several compromised studio efforts including sci-fi slasher \"Jason X,\" amplifies the quirkiness of Robert and Zach Anderson's screenplay by unpredictably mixing disparate pacing, tones, humor and brute action. Sum isn't entirely satisfying, and the current marketplace preference for formulaic scare pics won't help B.O. But fans tired of rote remakes and ripoffs will appreciate the pic's idiosyncrasy. It's currently playing limited theatrical gigs while in search of a wider distribution deal. Four twentysomething buds, led by John (Travis Aaron Wade), leave San Francisco for a weekend of game hunting in rural Mendocino County, though the guys-only plan goes south when John's g.f. Brooks (Tina Huang) -- who turns out to be the group's sharpest shooter -- insists on coming along. After being warned about an improbable 3,000-lb. \"Pigfoot\" (aka \"the Ripper\") roaming wild, they acquire uninvited company in the form of two local yokels who have an apparent score to settle with John. City-slicks-vs.-hicks tension soon gets ugly, resulting in full-on war waged by the large, inbred Tibbs clan against the panicked visitors. Meanwhile, carnivorous Hogzilla turns out to be no mythical beastie. A local \"hippie commune\" consisting of one charismatic male (Bryonn Bain) and his sizable harem of Amazonian babes further adds to the eventual mayhem, which doesn't explode until halfway through the pic's runtime. Slow start has its own rewards in atmosphere and slyly offbeat rhythms; when the porcine stool finally hits the fan, the action (especially that taking place chez Tibbs) is no-holds-barred muscular. Given the welcome sense that the story might lunge in any direction at any time, however, the final payoff (which involves some not-very-convincing creature effects) is a little less kicky than one might have hoped. Perfs are enthusiastic, tech and design contribs above-average. Score by Les Claypool of Primus adds to hipster cachet; he and blues mouth harpist Charlie Musselwhite contribute cameo roles.",
         "Yeah...so Pig Hunt. I'm pretty sure I've seen lots of movies like it, but at the same time, I've never seen anything like it. We've got city boys going to the woods for a guys weekend of hunting, we've got the \"unexpected\" girlfriend tagging along, we've got an (apparently) inbred family of rednecks, we've got family drama, we've got a killer giant boar on the loose, and a Les Claypool cameo AND soundtrack. I didn't even get to the cult of emu-raising, pig-worshiping, pot-growing lesbians and the Baron Samedi-esque man who lives with them. Pig Hunt isn't a good movie, and it's not even particularly entertaining, but it's so wildly random that I probably wouldn't discourage anyone from watching it. ff"
      ],
      "genres": [
         "Action",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Pig Hunt Productions"],
      "summaries": ["When John takes his San Francisco friends to his deceased uncle's remote ranch to hunt wild pigs, it seems like a typical guys weekend with guns - despite the presence of John's sexy girlfriend Brooks. But as John and his crew trek deeper into the forest, they begin tracking the awful truth about his uncle's demise and the legend of The Ripper -- a murderous three-thousand-pound black boar! Their pursuit leads them through fields of marijuana and into the muddy landscape of Big Wallow, involving high-powered weaponry, the violent and unpredictable Tibbs Brothers, massacred emus, a machete-toting Hippie Stranger, vengeful rednecks, and throat-slitting Cult Girls who grow dope by day and worship a Giant Killer Pig by night. By the time the pig hunt is done, no one is innocent - or unscathed. Not for the faint of heart, PIG HUNT is a darkly comic horror film that combines the best of DELIVERANCE, JAWS, and DINER, but remains uniquely Nor-Cal in its tone and scope. It is cinematic punkabilly - fresh, shocking, unforgettable!"],
      "budget": 6000000
   },
   "movielensId": 105071,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-07-31",
      "dvdReleaseDate": "2010-09-28",
      "directors": ["James Isaac"],
      "runtime": 100,
      "movieId": 105071,
      "title": "Pig Hunt",
      "mpaa": "",
      "actors": [
         "Travis Aaron Wade",
         "Tina Huang",
         "Howard Johnson Jr.",
         "Rajiv Shah",
         "Jason Foster",
         "Lanie Grainger",
         "Trevor Bullock",
         "Nick Tagas",
         "Bryonn Bain",
         "Christina McKay",
         "Charlie Musselwhite",
         "Les Claypool",
         "Marissa Ingrasci",
         "Luis Saguar"
      ],
      "imdbMovieId": "1022883",
      "originalTitle": "Pig Hunt",
      "genres": [
         "Action",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When John takes his San Francisco friends to his deceased uncle's remote ranch to hunt wild pigs, it seems like a typical guys weekend with guns - despite the presence of John's sexy girlfriend Brooks. But as John and his crew trek deeper into the forest, they begin tracking the awful truth about his uncle's demise and the legend of The Ripper -- a murderous three-thousand-pound black boar!",
      "tmdbMovieId": 22731,
      "avgRating": 2.375,
      "releaseYear": "2008",
      "numRatings": 8,
      "posterPath": "/xshNV9XQsOI2z6gKAmS6o0Tlmrr.jpg"
   }
}