{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0004277",
      "video": false,
      "title": "Mabel at the Wheel",
      "recommendations": [
         53396,
         53372,
         53391,
         22938,
         53398,
         53390,
         53376,
         53401,
         42366,
         21701,
         53393,
         53397,
         22858,
         22941,
         53392,
         53416,
         49292,
         22895,
         22870,
         54235
      ],
      "backdrop_path": "/n8gPloKBuhLMSzwopTuGPBKCqVC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Villain",
               "gender": 2,
               "credit_id": "52fe4862c3a36847f81647fd",
               "name": "Charlie Chaplin",
               "profile_path": "/pcvSg2LqnyVFel9dPIwTRagpfur.jpg",
               "id": 13848,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mabel",
               "gender": 1,
               "credit_id": "52fe4862c3a36847f8164801",
               "name": "Mabel Normand",
               "profile_path": "/9ZAIdsns64onnKgxlv6GezfsIL2.jpg",
               "id": 89563,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mabel's Boyfriend",
               "gender": 0,
               "credit_id": "52fe4862c3a36847f8164805",
               "name": "Harry McCoy",
               "profile_path": null,
               "id": 89601,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mabel's Father",
               "gender": 2,
               "credit_id": "52fe4862c3a36847f8164809",
               "name": "Chester Conklin",
               "profile_path": "/s9P3OhaUEMcs84P0oSfUewTMRjC.jpg",
               "id": 30195,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Reporter",
               "gender": 2,
               "credit_id": "52fe4862c3a36847f816480d",
               "name": "Mack Sennett",
               "profile_path": "/fvOPbAAY5zPl9Kh17W7gA1gIQTX.jpg",
               "id": 89518,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Henchman (as Andy Anderson)",
               "gender": 2,
               "credit_id": "547eaaabc3a3683965000774",
               "name": "Dave Anderson",
               "profile_path": null,
               "id": 148063,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Dubious Character",
               "gender": 2,
               "credit_id": "547eaae4c3a368395a0007e4",
               "name": "Joe Bordeaux",
               "profile_path": null,
               "id": 1086622,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Spectator at Races",
               "gender": 2,
               "credit_id": "547eaaf492514124af0006f3",
               "name": "Mack Swain",
               "profile_path": "/5sx09KDe6w2SofmPdh2eYUiTbVy.jpg",
               "id": 14435,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mabel's co-driver",
               "gender": 2,
               "credit_id": "547eab0392514124b9000774",
               "name": "William Hauber",
               "profile_path": null,
               "id": 150167,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Cheering Spectator (uncredited)",
               "gender": 0,
               "credit_id": "547eab1d92514124bb000791",
               "name": "Dan Albert",
               "profile_path": null,
               "id": 1373133,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Spectator in Grandstand (uncredited)",
               "gender": 0,
               "credit_id": "547eab2e92514124bf0006f0",
               "name": "Charles Avery",
               "profile_path": null,
               "id": 148002,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Race Spectator (uncredited)",
               "gender": 2,
               "credit_id": "547eab3fc3a368395a0007f4",
               "name": "Charley Chase",
               "profile_path": null,
               "id": 108627,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Spectator in Grandstand (uncredited)",
               "gender": 0,
               "credit_id": "547eab4f92514124b60007f7",
               "name": "Alice Davenport",
               "profile_path": "/2QDdNO0bXXwasHUdLIxnUMmDo8F.jpg",
               "id": 89600,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Spectator in Grandstand (uncredited)",
               "gender": 0,
               "credit_id": "547eab6192514124bf0006f8",
               "name": "Minta Durfee",
               "profile_path": "/6r28vOrjHuOJz62uRNmgS6i2T5L.jpg",
               "id": 89522,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Spectator in Grandstand (uncredited)",
               "gender": 2,
               "credit_id": "547eab74c3a368396c0007ed",
               "name": "Edgar Kennedy",
               "profile_path": "/nCun7c3czorbRoK2kxqaz9BjyPg.jpg",
               "id": 30018,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Cheering Spectator (uncredited)",
               "gender": 0,
               "credit_id": "547eab87c3a36839680006f5",
               "name": "Charles Lakin",
               "profile_path": null,
               "id": 1130471,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Henchman (uncredited)",
               "gender": 0,
               "credit_id": "547eab9792514124b300073b",
               "name": "Grover Ligon",
               "profile_path": null,
               "id": 1041499,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Dubious character (uncredited)",
               "gender": 0,
               "credit_id": "547eaba6c3a36839680006fd",
               "name": "Fred Mace",
               "profile_path": null,
               "id": 1086663,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Spectator (uncredited)",
               "gender": 2,
               "credit_id": "547eabb6c3a368395a00080e",
               "name": "Edward Nolan",
               "profile_path": null,
               "id": 1373121,
               "order": 18
            },
            {
               "cast_id": 22,
               "character": "Race Starter (uncredited)",
               "gender": 0,
               "credit_id": "547eabc7c3a368395c0008cb",
               "name": "Fred Wagner",
               "profile_path": null,
               "id": 1393253,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4862c3a36847f81647f3",
               "name": "Mabel Normand",
               "profile_path": "/9ZAIdsns64onnKgxlv6GezfsIL2.jpg",
               "id": 89563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4862c3a36847f81647f9",
               "name": "Mack Sennett",
               "profile_path": "/fvOPbAAY5zPl9Kh17W7gA1gIQTX.jpg",
               "id": 89518,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.364252,
      "production_countries": [],
      "id": 53374,
      "vote_count": 8,
      "budget": 0,
      "overview": "Charlie, competing with his rival's race car, offers Mabel a ride on his motorcycle but drops her in a puddle. He also kidnaps his rival before the race. But Mabel decides to take the wheels in his place, thus causing a threat to Charlie. As the race progresses, despite a very late start, Mabel manages to gain a lead of three laps. Charlie with his henchmen, tries to sabotage the race by using oil and bombs on the track. They seem to succeed for a while, but their dirty tricks were not enough to stop the high-spirited Mabel from winning the race.",
      "similar": [
         21385,
         1581,
         3981,
         10555,
         858,
         5,
         87818,
         62177,
         140300,
         254470,
         257211,
         634,
         773,
         808,
         437557,
         383498,
         460793,
         391713,
         9603,
         74643
      ],
      "original_title": "Mabel at the Wheel",
      "runtime": 18,
      "poster_path": "/bwWJsguPc15IUX9rl7Yu2hGHK30.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1914-04-18",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Mabel Normand",
         "Mack Sennett"
      ],
      "runtime": 18,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0004277/",
      "coverLink": null,
      "actors": ["Stars: Charles Chaplin, Mabel Normand, Harry McCoy | See full cast and crew »"],
      "reviews": [
         "Mabel at the Wheel is one of those movies with a behind-the-scenes story that's more interesting than the movie itself. This was Chaplin's tenth comedy for Keystone during his year of apprenticeship, and his first two-reeler. Here he played one of his last out-and-out villain roles (although the feature-length Tillie's Punctured Romance was yet to come), and it also marked one of the last times he would work for a director other than himself. In fact, Chaplin's conflicts with director and co-star Mabel Normand almost got him fired from the studio. Chaplin hadn't gotten along with his earlier directors, Henry Lehrman and George Nichols, but according to his autobiography having to take direction from a mere \"girl\" was the last straw. Charlie and Mabel argued bitterly during the making of this film. Chaplin was still a newcomer at Keystone and his colleagues didn't know what to make of him, but everyone loved Mabel. Producer Mack Sennett was on the verge of firing Chaplin when he learned that the newcomer's films were catching on and exhibitors wanted more of them A.S.A.P., so Chaplin was promised the chance to direct himself in return for finishing this movie the way Mabel wanted it. In light of all this it's appropriate that Charlie and Mabel are at odds during much of Mabel at the Wheel. In the opening sequence Charlie is courting Mabel and offers her a ride on his bike, but she tumbles off into a mud-hole and, soon afterward, Charlie reveals his villainous nature. We notice right away that Chaplin looks odd here, sporting a goat-like beard on his chin and wearing the top hat and frock coat from his very first film appearance, Making a Living. The outfit suits the over-sized, Ford Sterling-style villainy he displays. He's certainly no gentleman. When Mabel strikes him across the face he promptly hits her back, and during the course of the film he sticks a pin in almost everyone's derrière. What a mean guy! The central plot concerns an auto race in which Mabel's beau (Harry McCoy) is scheduled to compete, but wicked Charlie and his henchmen abduct the lad, and Mabel must take the wheel in his place. For all the racing around, brick hurling and finger-biting the film is frankly short on laughs, but there are some points of interest. There's good cinematography and editing in the race sequence, though there aren't really any gags, just lots of frantic activity. Visible in the stands at the race track are several Keystone stalwarts such as Chester Conklin, Edgar Kennedy in a strangely dandified get-up, and a more characteristic Mack Sennett, hawking up spit and doing his usual mindless rube routine. As a performer Sennett was about as subtle as the movies he produced, but you have to give him credit: he knew what people liked. These films were hugely popular in their day. Mack's performance doesn't add much to Mabel at the Wheel, but he probably had to be on hand for the filming just to make sure his stars didn't murder each other.",
         "The plot of this movie is based on a Vitagraph movie from 1908: \"An Auto Heroine\" In that film, a woman's father gets kidnapped and she drives his car to win the race. In this film, a woman's boyfriend gets kidnapped and she drives his car to win the race, while her father cheers from the stands. In an article called \"Speeding Sweethearts of the Silent Screen,\" film historian William Drew notes that after Mary Pickford's car chase movie \"A Beast At Bay\" (Griffith, 1912), this is only the third movie to feature a woman's driving. It will only become standard in movies starting in 1915. Drew notes, \"In fact, one can view Mabel at the Wheel as a kind of feminist parable with the heroine defeating the male competitors on the race course as well as the villainous Chaplin.\" Besides seeing Mabel Normand's feminist heroics, the other reason this film, directed by Ms. Normand, is noteworthy is Chaplin's unique performance. He plays the villain wearing a trench coat and whiskers. Through much of the film, he does what seems like a perfect impression of comedian Ford Sterling. At one point, Chaplin even crosses his eyes like Sterling. It should be remembered that Chaplin was hired at Keystone to replace Ford Sterling. In fact Chaplin's tramp costume uses Sterling's large size shoes, perhaps symbolizing the fact that he was hired to fill Sterling's shoes literally as well as figuratively. The first five minutes of the film is quite different from the rest. Chaplin plays simply Harry McCoy's rival for Mabel Normand. This is exactly the same triangle we saw in Chaplin's first film, \"Making a Living.\" The second five minutes of the film is different with Chaplin suddenly turning into a ridiculous villain caricature. He goes around jabbing people and tires with a pin. There is a scene where Chaplin takes out a water hose to water a race car course. Apparently, Chaplin refused to do it. Chaplin probably did not see the humor in endangering people's lives. Slapping, punching, pricking and kicking people is one thing, but actually endangering people's lives is another. He worked off the set. Famously, Mack Sennett threatened to fire him. He submitted and played the rest of the movie as Normand wanted him to, in Ford Sterling absurdist style. We should remember that Chaplin's humor was based on the funny drunk sketch he made famous. The drunk is funny, but not absurd. The absurd humor that Keystone dealt with was simply not something that Chaplin appreciated. This is really a Mabel Normand film and it seems unfair to give Sennett credit for directing it when all he did was discipline Chaplin. Normand had her own problems with Sennett and was probably only staying with him at the time because he gave her the opportunity to direct. There are some powerful images in the film: Mabel falling off a motorcycle, Mabel behind the wheel of the car with mechanic William Hauber, Charlie sitting next to Mabel and jabbing her with a pin and her jabbing him right back, and Mack Sennett as a country bumpkin in a cameo appearance. It seems possible that Mabel was expressing how she really felt about Sennett by having him act this way. The original film was 1900 feet and the restored version is about 1400. Please keep in mind that over 25% of the film is still missing. Probably the jumpy, quick shots in the racing scenes were much smoother with longer shots in the original. Sennett supposedly got a telegram from his partners in New York demanding more Chaplin films during the production of this film and only this telegram stopped him from firing Chaplin. I tend to think that it was the success of this movie that really put Chaplin on the map. While Chaplin was fine in his first ten films, there was nothing particularly distinguishing about him. This two-reeler would have established him as the real replacement for the popular Ford Sterling.",
         "When Chaplin arrived at Keystone, Ford Sterling (head of the Keystone Kops, among other roles) was the top comic at the studio. By all accounts Chaplin spent his first few films being asked to act more in Sterling's frantic trademark Keystone style, and none more so than in this one. By the time \"Mabel at the Wheel\" was shot, Ford Sterling had left Keystone, and Charlie, who had spent the majority of his previous films dressed in his famous Little Tramp costume (even if the soulful, wistful characterisation thereof was yet to be created), not only was made up in the Dutch comic style of Ford Sterling (a false goatee to go with his false moustache) and given Ford Sterling's frock coat to wear, but the whole style of his performance, down to his facial expressions and physical mannerisms, echo Ford Sterling's established screen persona. There is hardly a trace of the tramp in this film, but Chaplin's imitation of Ford Sterling is a model of accuracy. The film is more interesting than amusing. Some of the wide shots of the crowd at the race feature actual spectators visibly amused at the antics of the actors, which is always fascinating to see after so many decades of movies carefully framed and set-managed to avoid such things. That said, there are a few funny moments, and one \"special effects\" (by the standards of the time) shot almost shocking in the unexpectedness of its technique, in which a tilting camera is used to create the illusion that one of the race cars is tipping over in the race.",
         "Chaplin once again plays villain to Mabel Normand's heroine in Mabel At The Wheel. Chaplin has two notorious henchmen with overgrown mustaches, one of whom is played by the famous Director of 1930's and 1940's films William A. Seiter. Mack Sennett and Charley Chase can be seen in the racing galley. Chaplin's job is to stop Mabel from winning the race at all costs, but like any dastardly villain worth his salt, Chaplin enlists others to do his dirty work. Whether it's a brick fight with Mabel or throwing smoke bombs on the race track, Chaplin has a grand old time hamming it up as villain for the camera. One wonders whether he enjoyed this role more than others he had played up to this point because he does look better and is somewhat funnier playing this part. ** of 4 stars.",
         "Not merely viewing this film for its humor, I watched it to gather an understanding about its time and the things it implied. In this film, Mabel Normand wants to drive her boyfriend's car, but he declines. The reason he declines was not given, but considering the title, it may well be because of condescension towards her as a female. Not content with no for an answer, and to Chaplin's convenience, she accepts Chaplin's offer to ride with him on his bike to spite her mate. Unfortunately for Chaplin, she falls into a puddle, becoming furious; she then reconciles with her boyfriend. Her partner was going to be in a car race, but Chaplin had plans to thwart his success. After tying him up in a shed, Mabel \"takes the wheel.\" Also recognizing Mabel Normand being the directer and writer, I see this as a point of triumph for her, conveying herself as accomplishing what she wanted and breaking the gender gap. When her boyfriend was finally freed, he found to his delight that Mabel was the victor. The irony makes a point: women can do as well as men in men's stereotypical roles and there is no justification for men to be seen as superior!",
         "Just watched this-a Keystone comedy short starring Mabel Normand and Charlie Chaplin-on YouTube. Ms. Normand is also the director and Chaplin does not play The Tramp but the comic villain. As such, he's the funniest thing here as he does overacting to a T which is such a standard technique in these silent movies whether melodrama or slapstick comedy. Mabel is quite an accomplished comic herself whether taking a fall, throwing bricks, or biting Charlie's hand. The race sequence doesn't really have any laughs but is quite exciting to watch as we see Ms. Normand do as the title says. Overall, Mabel at the Wheel is highly recommended. P.S. It would have been nice if any of the versions I checked out had a music accompaniment but I can't complain too much about the complete silent version I watched.",
         "Mabel at the Wheel (1914) ** 1/2 (out of 4) The behind the scenes issues with this movie are pretty interesting but from what I've read Chaplin hated being directed by a woman and his constant battles with Normand almost got him fired. For whatever reason Keystone decided to keep him and Chaplin's hatred of \"other directors\" finally caused him to be directed by himself from this point on in his career. In the film Mabel and her boyfriend (Harry McCoy) have a falling out so she takes a ride with his rival (Chaplin) but she eventually gets knocked off his bike and into a puddle of mud. Later she's back with the boyfriend who's at a race track when Chaplin kidnaps him forcing Mabel to race the car. This is a mixed bag as far as the film goes because the first half is pretty funny but the second half dealing with the race falls apart. Seeing Chaplin and Mabel slap one another makes you wonder how much they both enjoyed it but these early scenes are certainly the best in the film. The actual auto race wasn't too thrilling or funny to me but things do pick up towards the end and Chaplin's final scene is very funny.",
         "This one reeler has the same structure of a stage play with various acts, but instead of having 5 acts like Shakespeare, it has three acts. The set up is predictable and used again in 'Death Race 2000' with Sylvester Stallone. Although Chaplin is quite physical in this short film, it is somewhat lacking in a storyline that we care about."
      ],
      "genres": [
         "Short",
         "Comedy"
      ],
      "productionCompanies": ["Keystone Film Company"],
      "summaries": ["Charlie, competing with his rival's race car, offers Mabel a ride on his motorcycle but drops her in a puddle. He next joins some dubious characters in abduction of his rival just before the race for the Vanderbilt Cup. With her boyfriend locked up in a shed, Mabel takes his place. Charlie does what he can to sabotage the race, even causing Mabel's car to overturn."],
      "budget": 0
   },
   "movielensId": 105081,
   "movielens": {
      "languages": [""],
      "releaseDate": "1914-04-18",
      "dvdReleaseDate": "2006-07-11",
      "directors": [
         "Mabel Normand",
         "Mack Sennett"
      ],
      "runtime": 18,
      "movieId": 105081,
      "title": "Mabel at the Wheel",
      "mpaa": "",
      "actors": [
         "Charlie Chaplin",
         "Mabel Normand",
         "Harry McCoy",
         "Chester Conklin",
         "Mack Sennett",
         "Dave Anderson",
         "Joe Bordeaux",
         "Mack Swain",
         "William Hauber",
         "Dan Albert",
         "Charles Avery",
         "Charley Chase",
         "Alice Davenport",
         "Minta Durfee",
         "Edgar Kennedy",
         "Charles Lakin",
         "Grover Ligon",
         "Fred Mace",
         "Edward Nolan",
         "Fred Wagner"
      ],
      "imdbMovieId": "0004277",
      "originalTitle": "Mabel at the Wheel",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Charlie, competing with his rival's race car, offers Mabel a ride on his motorcycle but drops her in a puddle. He also kidnaps his rival before the race. But Mabel decides to take the wheels in his place, thus causing a threat to Charlie. As the race progresses, despite a very late start, Mabel manages to gain a lead of three laps. Charlie with his henchmen, tries to sabotage the race by using oil and bombs on the track. They seem to succeed for a while, but their dirty tricks were not enough to stop the high-spirited Mabel from winning the race.",
      "tmdbMovieId": 53374,
      "avgRating": 2.4,
      "releaseYear": "1914",
      "numRatings": 5,
      "posterPath": "/bwWJsguPc15IUX9rl7Yu2hGHK30.jpg"
   }
}