{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "politician",
         "id": 6083
      }],
      "imdb_id": "tt0024961",
      "video": false,
      "title": "The Cat's-Paw",
      "recommendations": [],
      "backdrop_path": "/u6Ia5ZnD2oGevdlRkRLPleFTTkw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Ezekiel Cobb",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91ef",
               "name": "Harold Lloyd",
               "profile_path": "/aE1pPjEoYOVeG9BtqoYkKePzgCd.jpg",
               "id": 88953,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Petunia Pratt / Cobb",
               "gender": 1,
               "credit_id": "52fe45c3c3a36847f80d91d1",
               "name": "Una Merkel",
               "profile_path": "/hBDjQyU2xJ9vELw0H63igS7ugSD.jpg",
               "id": 13963,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jake Mayo",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91d5",
               "name": "George Barbier",
               "profile_path": "/tu988TdkoHrhR61HPPQPdUP8QYp.jpg",
               "id": 30276,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Strozzi",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91d9",
               "name": "Nat Pendleton",
               "profile_path": "/dOtnUOR6bKMkIkPANf4C6JQnXXt.jpg",
               "id": 32430,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Dolores Doce",
               "gender": 1,
               "credit_id": "52fe45c3c3a36847f80d91f3",
               "name": "Grace Bradley",
               "profile_path": "/wHpWbDt9tua4oqCfC7iBYiQSihx.jpg",
               "id": 148397,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mayor Ed Morgan",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91f7",
               "name": "Alan Dinehart",
               "profile_path": "/zItSFkXyFGu1MInFuLaKNvhooNr.jpg",
               "id": 34348,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Silk Hot McGee",
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91fb",
               "name": "Grant Mitchell",
               "profile_path": "/cDZpWgH0qOF4L5nmZJzGIHE5xo3.jpg",
               "id": 30215,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Gangster (uncredited)",
               "gender": 2,
               "credit_id": "59460853c3a368171b01cb53",
               "name": "John George",
               "profile_path": "/gEhNTzAQ2EoZzpAQWMYQuOVkSpF.jpg",
               "id": 97999,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91df",
               "name": "Sam Taylor",
               "profile_path": "/pY9U3YTrPTZY68YF75nszT9WX7G.jpg",
               "id": 143561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a36847f80d91e5",
               "name": "Clarence Budington Kelland",
               "profile_path": null,
               "id": 143565,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a36847f80d91eb",
               "name": "Sam Taylor",
               "profile_path": "/pY9U3YTrPTZY68YF75nszT9WX7G.jpg",
               "id": 143561,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.090075,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41347,
      "vote_count": 2,
      "budget": 0,
      "overview": "Naive Ezekial Cobb, brought up by his missionary father in China returns to America to seek a wife. Corrupt politicians enlist him to run for mayor as a dummy candidate with no chance of winning. Their plan backfires as he wins and embarks upon a reform crusade.",
      "similar": [
         77953,
         9388,
         38050,
         376290,
         10139,
         11000,
         586,
         5125,
         35056,
         23631,
         36027,
         891,
         26389,
         7485,
         9798,
         10316,
         51876,
         665,
         261023,
         446354
      ],
      "original_title": "The Cat's-Paw",
      "runtime": 102,
      "poster_path": "/fK6VEu97YBAIidt7TzS1v8smXR5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Harold Lloyd Corporation",
         "id": 4111,
         "origin_country": ""
      }],
      "release_date": "1934-08-07",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "Everything new but these [eyeglasses]",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Sam Taylor",
         "Harold Lloyd"
      ],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Clarence Budington Kelland",
         "Sam Taylor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024961/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MDc1NDYzM15BMl5BanBnXkFtZTgwNTIzODYwMjE@._V1._CR56.883331298828125,52.53334045410156,1169,1886.0499725341797_SX214_AL_.jpg",
      "actors": ["Stars: Harold Lloyd, Una Merkel, George Barbier | See full cast and crew »"],
      "reviews": [
         "Before Frank Capra's socially-aware comedy-dramas such as \"It's a Wonderful Life,\" \"Mr. Deeds Goes to Washington\" and (my favorite) \"Meet John Doe\" there was \"The Cat's Paw.\" In fact, \"The Cat's Paw\" and \"Meet John Doe\" share a similar plot: Corrupt politicians in a pickle find a sap to run for office so that they can use him for their own purposes. In this case, Harold Lloyd plays a naive missionary just returned from China to his hometown of Stockton. Lloyd's character, Ezekiel Cobb, had planned on catching up with a friend of his, the Rev. Julius P. Withers, who dies unexpectedly. Withers had been running for mayor as the token losing opposition against the long-corrupt incumbent. His planned loss would've insured Withers' party (THE REFORM PARTY, no less! Talk about cynicism!) would continue to be paid off through the mayor's graft. Wouldn't you know it, just as the Reformers are looking for some sap to take Withers' place, in walks Ezekiel. Naturally, Ezekiel wins instead of losing, and turns idealistic political reformer -- much to the dismay of all the town's corrupt politicians and criminal class. Ezekiel's solution to halting the political corruption is both surprising and hilarious. I found this film on TCM and, much to my surprise, not only kept watching it, but kept laughing -- all the way through. Great performances by Lloyd, transforming from unsophisticated (he doesn't even know how to use a phone!), Chinese-proverb quoting straight-arrow to incorruptible populist mayor; Una Merkle as the tough-girl love interest who convinces Ezekiel to do what's right through canny reverse psychology; and George Barbier as the initially-corrupt Reform Party boss, who comes around to Ezekiel's way of thinking. Also, lots of familiar character-actor faces whom you can't identify though you know you've seen them before. This film is well worth seeking out. If it's not on VHS or DVD, it should be! It's a forgotten classic!",
         "Returning from 20 years in China, a young missionary refuses to become THE CAT'S-PAW for a gang of hometown hoodlums. This movie was a bit of a departure from Harold Lloyd's previous movies. Comedy derived more from dialogue, often rather serious, predominates here, rather than the elaborate sight gags which powered Harold's classics of the past. There are some splendid moments, however, which are pure visual fun, as when Harold attempts to follow a convertible down a crowded street, or when he desperately tries to keep a nightclub stripper from losing her clothes. There is also the climactic scene, set in a Chinatown basement, in which Harold gleefully jumps unabashedly into the darkest comedy. But most of the humor derives from Harold's refusal to be the patsy of the criminals who've run his hometown for years. And it's quite a collection of crooked politicians & thugs Harold finds himself up against, played by a bevy of fine character actors: George Barbier, Nat Pendleton, Grant Mitchell, Edwin Maxwell, Alan Dinehart, Warren Hymer & stuttering Fuzzy Knight. Pert Una Merkel is on hand as the tobacco stand girl who catches Harold's eye and keeps him intrigued by her no-nonsense outlook on life. Movie mavens will recognize Samuel S. Hinds as Harold's missionary father; Charles Sellon as an elderly Stockport clergyman; and Herman Bing as a German gangster--all uncredited. Also, showing up for only a few seconds as an attempted kidnapper, is Noah Young, a familiar face from Harold's silent films, here making his final appearance in a Lloyd picture. Fox gave the film fine production values, especially in the opening scenes set in China.",
         "This generally enjoyable comedy is unusually satirical for a Harold Lloyd feature, but as long as you don't take it too seriously, it has some very amusing moments. Lloyd's character lets him combine elements of his familiar silent-screen roles plus dialogue and other material that take advantage of the relatively new sound technology. Una Merkel also helps out as a sarcastic young woman who takes an interest in Lloyd's character. The prologue is a little lengthy, but it works in establishing a positive view of the Chinese culture in which Lloyd's character was raised and which determines his personality, so it serves a purpose. The main part of the movie has Lloyd as Ezekiel, a missionary's son, coming back to the USA and innocently contending against the rampant corruption in the local government and the distorted values of society. Much of it is amusing in a low-key fashion, but eventually it also builds up the tension between Ezekiel and the local political machine. You always hope for something big in the finale in a Lloyd movie. Here the finale is creative, taking advantage of the possibilities in the story, and making use of sound in addition to the many visual effects. Though slower and not filled with slapstick the way that his great silent film finales were, it caps things off suitably enough. Like most of Lloyd's sound features, this one doesn't come up to the level of his silent classics. But it does give him a good character to work with, and it is often rather funny as long as you don't read too much into the story and characters.",
         "What is often neglected about Harold Lloyd is that he was an actor. Unlike Chaplin and Keaton, Lloyd didn't have the Vaudeville/Music Hall background and he wasn't a natural comedian. He came to Hollywood to act; and he discovered he had a knack for acting funny -- first in shorts, then in features. He made a name for himself as \"Lonesome Luke\", a Chaplin knock-off; with the \"glasses character\" that made him the all-American boy rather than a grotesque, Lloyd found his stride and his movies became some of the best produced during the silent era. He developed a reputation as a \"daredevil\" in some shorts, and retained this in some of his best movies (\"Safety Last\", \"For Heaven's Sake\", \"Girl Shy\"). He was more popular than either Chaplin or Keaton during the twenties and he became very rich before the advent of sound. The first sound movies were often disasters. To get the most out of their \"sound\", too much dialog was used in many movies. Lloyd's acting skills were, after two decades, geared for silents. He didn't have a bad voice; its high pitch suited his \"glasses\" character. And his sound films weren't the unqualified disasters of legend. Yet silent movies had been raised to a high art (especially Lloyd's, which did not stint on budget and were extremely well-crafted); with the introduction of talkies movies had to learn to walk again and they made some missteps. Though he tried to move with the times and embraced sound, Lloyd's best bits from his early (overly talky) talkies were still visual -- such as the scene in \"Movie Crazy\" where he appears to be riding in a swank car, but actually \"hitched a ride\" on his bicycle. Trying to recapture the daredevil antics that made him famous, as he did in \"Feet First\", was misstep. (In \"Safety Last\", his best movie and the one that, deservedly or not, shoved Lloyd in the box as a \"daredevil comic\", he played a determined young man, climbing to the top. \"Safety Last\" had a natural structure that ascended to his character's scaling the side of the building. He was obviously afraid, but his fear added to the humor. In \"Feet First\", he arrived in a precarious building-scaling position by accident; his frantic cries for help detracted from the humor. His character was pathetic and cringing, aspiration to save his neck -- possibly an accurate statement of the 1930s, but not amusing). Harold Lloyd was not mired in the past, like some wacky Norma Desmond. He embraced sound and tried to take his movies in different directions, growing and changing with the industry. When \"Feet First\" failed he left the daredevil business and made a satire on the talking movie industry, \"Movie Crazy\". Just as he had to flounder through many movies as \"Lonesome Luke\" before carving his place in movie history with the glasses character, he had tried several directions in sound movies before hitting his stride in sound, which he did with \"The Catspaw\". In \"The Catspaw\" he plays a missionary's son reared in China who unwittingly gets elected mayor as a front for corrupt political interests. When he finds out the truth, he sets himself the task of cleaning up the town. Only in his early forties, Lloyd could still act the brash young man. Yet \"The Catspaw\" was another box-office failure, and Lloyd made only three more movies, including \"The Milky Way\". Of his chief competitors, Chaplin still had silent movies in him and Keaton was hopelessly mismanaged. \"The Catspaw\" and \"The Milky Way\" suggest Lloyd might have mastered sound comedy if he had been a little younger, or if audiences had given him the benefit of the doubt after his early sound fiascoes. Though the movie has been unfairly maligned about the way Lloyd's character cleaned up the town, it suits him. From his days in \"shorts\" Lloyd wanted to scare his audience, and the climax of \"The Catspaw\" achieved it yet again, in a surprising way; until the trick is revealed it appears gruesome, and then come the laughs. Viewed as a product of its time, \"The Catspaw\" is charming and funny. A very well-written sound comedy, well-acted by Lloyd. Directed by Sam Taylor, its curious blend of drama and sly humor make it look almost like a Frank Capra or Preston Sturges comedy.",
         "For those of you looking for the crazy stunts that typified a Harold Lloyd silent comedy, this is not the film for you. What The Cat's-Paw gives us is an interesting and atypical character for Lloyd who was trying to establish himself in sound. For me the closest movie comparison to Lloyd's character is that of Peter Sellers in Being There. For all the education that Lloyd has received in dealing with the world, he might as well have been brought up in isolation as Sellers was. But where he was brought up was as a missionary's child in China and I don't know how much Christianity he and his family were able to teach the Chinese, but young Harold has learned the wisdom of Chinese philosopher Lin Po whom he quotes constantly like a fortune cookie aphorism. As it turns out Lin Po turns out to be one wise dude. Anyway Lloyd's father Samuel S. Hinds has decided his son needs some education in the modern world of 20th century America and he sends him back to be the guest of the pastor of the home church which sponsors the mission. The pastor there is the perennial candidate of the 'reform' movement of that town of Stockport. But no sooner does Lloyd arrive and the pastor dies. Now the reform movement is a sham and the pastor a patsy of the political bosses who need a straw-man opponent in every election. They decide Lloyd just might be a better patsy than the guy who just died. Of course as it goes in these type of films the patsy proves to be not so easy a proposition. In fact Lloyd constantly quoting from Lin Po, the way Charlie Chan used to dispense wisdom proves quite the adversary for the crooks who run Stockport. In addition Lloyd gains the admiration of Una Merkel, as cynical a dame as Jean Arthur was in Mr. Deeds and Mr. Smith. The Cat's-Paw is still a nice political satire though it did not establish Harold Lloyd as big a comedy name as he was in silent films. A nice cast of players was selected by director Sam Taylor topped by George Barbier who plays a political boss who discovers Lloyd and actually proves to have a streak of honesty in him.",
         "As a Harold Lloyd fan, i agree with the other reviewer's comments, EXCEPT that I feel that \"Movie Crazy\" was his best sound film; \"Cat's Paw\" is a close second. (But, this is just MY opinion). This film is a \"hoot\" from beginning to end and, in many scenes, George Barbier (the crook that gets him elected mayor) almost steals the show! (Especially at the end of the film). One wishes that Una Merkel's character would be a bit more sympathetic to Harold, especially as the film progresses. Only in the last few minutes of the film do we find out her true feelings for him. (And, even then, there is no \"romance\" - kissing, etc). This is a Must-See film!",
         "It has to be admitted that the best work of Harold Lloyd ended with his last great silent comedy \"Speedy\" in 1928. After that he enters sound films (like Chaplin and Keaton and Laurel & Hardy and W.C. Fields) and does do better than Keaton, but not as well as the other three. Chaplin was rich enough to make his own films as producer (but he paced his films so there were five years between productions). Laurel & Hardy were under the protection of Hal Roach, so production standards for their shorts and sound films were pretty good. Fields first worked with Mack Sennett, than with Paramount, and then free-lanced. Lloyd tried the route that Chaplin took, but with less success. He produced his own films, but unlike Chaplin he did not own his own studio. Also his first two choices were not good (especially \"Feet First\"). But he did begin to choose more wisely and \"Movie Crazy\", \"The Cat's-Paw\", and \"The Milky Way\" were all good choices. These three (and possibly \"The Sin of Harold Diddlebock\") were his best sound ventures. They are all entertaining, but none are up to \"Safety Last\", \"The Freshman\", \"The Kid Brother\", or \"Speedy\". Of the top four sound films \"The Cat's Paw\" is the most controversial. Ezekiel Cobb's solution to ridding the city that elects him mayor is very extreme for the tastes of 2005. Or is it? When a movie is made dictates what it's politics are: \"The Cat's Paw\" is from 1934. That second year of the Roosevelt New Deal (itself rather controversial for heavier government involvement) movie audiences saw films like \"Gabriel Over the White House\" and \"The Phantom President\", where our leaders did extra-Constitutional actions to rid the nation of internal enemies (and to force disarmament around the globe). Even Cecil B. De Mille got into this act with \"This Day and Age\", where a bunch of teenagers use rats to force a gangster to confess his crimes. To us, the use of violence to force anyone (even a bunch of goons and boodlers like Alan Dinehart's gang) to confess is repellent. After all, the Supreme Court has protected us from confession under duress. What we forget is that the reforms we are thinking of did not occur until the Warren Court and the Burger Court made them. For example, although Mr. Justice Sutherland's opinion in the Powell (\"Scottsboro Boys\") Case of 1932 guaranteed every criminal defendant had a right to counsel, Gideon v. Wainwright did not extend this to ordering court paid counsel to defendants until 1962. The Miranda Case, with it's now well-known anti-self-incrimination warning is from 1963. Nothing like this were considered necessary in 1934. If you study other movies of the period up to 1954 (and even to 1960) tricks are used to get confessions - Kirk Douglas confesses his crimes in front of witnesses in \"I Walk Alone\" while Burt Lancaster holds a gun to him. When Lancaster leaves, Douglas sneers about confessing under duress, only to see the gun is unloaded. Suddenly he realizes that (legally - in 1948) he has confessed without duress. Hate to say it, to any civil libertarians reading this note, but what Cobb/Lloyd does to Dinehart and his pals in the conclusion of \"The Cat's Paw\" was not only legal, but would have led to their jail sentences in 1934. We may call it heavy handed, fascistic, or horrid, but it would have worked legally when it was thought up.",
         "We hear so much about how the coming of sound ruined careers. This doesn't seem to be the case for Harold Lloyd, who smoothly makes the transition to talkies in 'The Cat's Paw' (1934). The story has Lloyd as missionary's son Ezekiel Cobb raised in rural China. On return to America Cobb becomes a patsy for a political machine, but to everyone's surprise gets elected mayor. The story is entertaining even though most of the jokes fall flat. It does contain a lot of racial stereotypes and epithets, but is good natured and pretty equal-opportunity in it's treatment of various ethnic groups making it at least honest in it's portrayal of life in Depression era U.S.A. Modern audiences may find the use of caucasian actors in Chinese roles, and the dubbing of Lloyd when he speaks Chinese in 'The Cat's Paw' as much more blatantly obvious than did audiences of the time. And while it's not as groundbreaking as Lloyd's silent film work, and there are admittedly better films from the mid 30s, as mentioned, it's entertaining and fast moving, and worth checking out if for no other reason than to see Una Merkel as savvy cigarette girl Pet and to see Lloyd transition from sight gags to speaking.",
         "No specific spoilers. So many viewers, in my opinion, have unfairly maligned Lloyd's transition to talkies, including several reviewers here. I think that from a retrospective, critical point of view, Lloyd was reasonably successful in this switchover (in fact, he has much of the manic quality and all of the voice of Woody Allen in his most successful talkie, _Movie Crazy_). Although it is a flawed film, _The Cat's-Paw_ is, on the whole, another such success. While the film's controversial ending may be a tad facile, and while the reviewer Patricia Parker very capably articulates the full, disturbing political implications of this ending, it is precisely the outrageous, provocative nature of the plot's culmination that makes this film more engrossing to watch today. Some other reviewers have commented on the film's racism, asking us to excuse it as typical of the time. However, again I feel that these viewers are slightly skewing the issue. Yes, the movie is an interesting document of the utter prevalence of casually racist attitudes in the United States of the 1930s. However, I would say that 95% of the time, _the film itself_ is not racist (there are a few moments of racial condescension, such as Lloyd's too-precious quip about white women looking alike, and there is a stock-stereotype black character introduced at the end); rather it is numerous _negative characters_ who express racist attitudes. References to brutality and misogyny aside, for the most part Chinese culture is accorded a fair degree of respect in this film, and is indeed used as a foil for the corrupt and ignorant world of Stockport, USA. Note, for instance, Lloyd's response whenever another character uses the slur 'ch*nk': he winces every time (or at least pauses with displeasure), and then answers in a manner that tries to maintain dignity for the Asian culture and individuals being referenced. While this is not to say this is a bold, crusading film, nonetheless, some credit should be given for this attitude in the early 1930s; it is, in its own clumsy sort of way, a gently anti-racist film. And credit should also be given for the engrossingly cynical view of society put forward here, as well as the comically dark resolution of the plot, even if that resolution is ultimately fairly problematic in its political implications.",
         "Being a fan of Harold Lloyd since the days of the BBC2 shows in the seventies I was looking forward to this talking feature of his from 1934. A lot of silent comedians had trouble when making the switch to sound (to be fair this was down to the new 'technology' as much as anything) but Lloyd seemed to make the transition quite well. The Cat's Paw is an easy watching film that neither bores nor excites. Harold plays a missionary's son who is sent back to his hometown in the states, for the 1st time since childhood, to find a wife so he can take over the running of the missionary. He ends up being a stooge in an election (the cat's paw of the title) put against the corrupt mayor to supposedly ensure an easy victory. Of course, Harold wins and goes about cleaning up the town and finds a wife in the process. The film takes a long time to wake up and it isn't until Harold's election victory that the film really starts. Unfortunately throughout the whole film, Harold the slapstick ace never appears regardless of how much you hope for it and you have to settle for Harold the reasonable character comedian, an unfortunate use of his talents that was to blight most of his talkies. The scene in the nightclub when the singer/stripper/gangster's moll tries to discredit him (and does the opposite) is very interesting as it's quite risqué. It must have have been a pre-coder, and possibly one of the last. All in all this is an average movie, enjoyable but well below Lloyd's capabilities."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["The Harold Lloyd Corporation"],
      "summaries": [
         "Naive Ezekial Cobb, brought up by his missionary father in China returns to America to seek a wife. Corrupt politicians enlist him to run for mayor as a dummy candidate with no chance of winning. Their plan backfires as he wins and embarks upon a reform crusade.",
         "Being the son of Christian missionaries, Ezekial Cobb has lived in a small isolated town in China for twenty years, since he was an adolescent. Because of this sheltered life, Ezekial, who follows the teaching of Chinese poet and philosopher Ling Po, is a naive and overly trusting man. His parents send him back to his birthplace of Stockport, California so that he can find a wife, and for the two of them to return to China to continue the mission. In the big city of Stockport, Ezekial being unwise to the ways of the world gets him into one misadventure after another. Jake Mayo equates Ezekial's simplicity with being a pushover, just the type of person he needs to run as mayor on behalf of the Good Government League - the reform ticket - which is solely a front for the corrupt political machine in power who want to make it look like the election is being run in a true democratic fashion. Although Ezekial accepts the nomination on the premise he will lose as his primary goal is to find that wife and return to China, Ezekial, a man with integrity, may have different goals once he learns how corrupt politics in Stockport truly is. But Ezekial making changes to Stockport politics may be easier said than done, especially against those who the League fronts. Through it all, Ezekial gets the help of streetwise Pet Pratt, a fellow boarder at the rooming house where Ezekial is staying."
      ],
      "budget": 617000
   },
   "movielensId": 105077,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-08-07",
      "dvdReleaseDate": null,
      "directors": ["Sam Taylor"],
      "runtime": 102,
      "movieId": 105077,
      "title": "The Cat's-Paw",
      "mpaa": "G",
      "actors": [
         "Harold Lloyd",
         "Una Merkel",
         "George Barbier",
         "Nat Pendleton",
         "Grace Bradley",
         "Alan Dinehart",
         "Grant Mitchell",
         "John George"
      ],
      "imdbMovieId": "0024961",
      "originalTitle": "The Cat's-Paw",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Naive Ezekial Cobb, brought up by his missionary father in China returns to America to seek a wife. Corrupt politicians enlist him to run for mayor as a dummy candidate with no chance of winning. Their plan backfires as he wins and embarks upon a reform crusade.",
      "tmdbMovieId": 41347,
      "avgRating": 3.3,
      "releaseYear": "1934",
      "numRatings": 5,
      "posterPath": "/fK6VEu97YBAIidt7TzS1v8smXR5.jpg"
   }
}