{
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robin Spry"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Tom Alderman",
         "Douglas Bowie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093196/",
      "coverLink": null,
      "actors": ["Stars: Kerrie Keane, Daniel Pilon, Saul Rubinek | See full cast and crew »"],
      "reviews": [
         "I found this video in a secondhandshop and i paid less than a dollar for it. What a positive surprise. This is a great film. Great acting and a great story. Especially for those people who have kids, this film will really take you on a rollercoaster of emotions. Normally i'm not really into TV films but this one is a gem. A must see!",
         "If you are a fan of Canadian entertainment, you should really check this out. It's sort of a psychological drama about the after-effects when a child is killed by a hit and run driver. Saul Rubinek plays the driver from the USA who flees back there to avoid facing the consequences. The bulk of the film deals with the boy's mom, Kerrie Keane, trying both through legal and unusual channels, to bring Rubinek back to Canada to face justice. Veteran French-Canadian actor Daniel Pilon plays the boy's dad who tries to help. Alan Thicke plays Rubinek's lawyer. Jacob Tierney (well known to Canadian youths from late 80s/early 90s TV) plays Rubinek's son. The late Colleen Dewhurst plays the judge. How can you ask for a better cast than that? The film does have that Canadian look (that is, it appears to have the budget of an average American made-for TV film) but the story is engaging and deeper than expected and the performances are satisfying. The film covers ground that few other movies have. It's one of the few films in which the Canadian content and locales actually work to the film's advantage. There are even references to the TV show \"Danger Bay\"! If that's not enough, how could any fan of Canadian film or TV turn down a chance to see Daniel Pilon tackle Alan Thicke?",
         "Hitting Home(Obsessed) is one of those rare movies that was actually better than the book it was based on - in this case, Hit and Run. As a film, it's really effective - particularly in the fact that it leaves the viewer feeling sympathy for both the \"protagonist\", Dina Middleton (the mother of the kid who was killed) and the \"antagonist\", Owen Hughes (the guy who ran the kid over). Neither of them fit firmly into the \"antagonist\" or \"protagonist\" category - both of them do some pretty despicable things over the course of the drama. I still remember the scene where the kid (Alex Middleton) was graphically dragged. It's shocking and surprisingly well done for a made for TV film. My main complaint would be that the political drama regarding extradition tends to feel thrown in as opposed to a major plot point. Well worth a watch if you can find it.",
         "I saw this movie by chance years ago and it pretty much stuck with me since. That's very telling, don't you think? What made this movie was the strong performances and the fact that you go from routing for the grieving parents to hoping they rot with their dead kid. At least that's how I felt. It's hard to even respect people who sink lower than person they want justice/revenge from. Some of the most powerful scenes took place in the courthouse and it's a shame that the Canadians couldn't manage to get the neglectful driver(played by the ever cool Saul Rubinek) extradited. Honestly, he should have been. He killed a kid. That shouldn't have gone unpunished. Then again, he did a good job punishing himself. So, did the grieving parents, especially in the end, where they do the right thing when they didn't have to. Overall, it's an okay movie. Not exceptional, but one that gets to you and can haunt you for a long time."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Les Films Téléscène Inc."],
      "summaries": ["Canadian businesswoman Dinah Middleton's is devastated when her teenage son, Alex, is killed by a hit-and-run driver. When the police fail to turn up any suspects, she turns private detective to track the killer down. She traces the murderer to New York, only to discover that the crime is not covered by the extradition treaty between Canada and the US. She becomes obsessed with bringing the criminal to justice."],
      "budget": 0
   },
   "movielensId": 105115,
   "movielens": {
      "languages": ["English"],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": ["Robin Spry"],
      "runtime": 0,
      "movieId": 105115,
      "title": "Hitting Home (1987)",
      "mpaa": null,
      "actors": [
         "Saul Rubinek",
         " Daniel Pilon",
         " Kerrie Keane"
      ],
      "imdbMovieId": "0093196",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 1.5,
      "releaseYear": "",
      "numRatings": 1,
      "posterPath": null
   }
}