{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2332579",
      "video": false,
      "title": "Crystal Fairy & the Magical Cactus",
      "recommendations": [
         91101,
         174344,
         142106,
         174314,
         175426,
         249169,
         214641,
         136466,
         74929,
         13406,
         204255,
         47059,
         124873,
         108241,
         86823,
         82136,
         27134,
         169644,
         102051,
         128133
      ],
      "backdrop_path": "/xrKS2nmAR8vGSKkldB5EVlkusMx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jamie",
               "gender": 2,
               "credit_id": "52fe4bc59251416c910e5289",
               "name": "Michael Cera",
               "profile_path": "/kxeJQa9Ae7Ns1J1b5012SMeyXn2.jpg",
               "id": 39995,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Crystal Fairy",
               "gender": 1,
               "credit_id": "52fe4bc59251416c910e528d",
               "name": "Gaby Hoffmann",
               "profile_path": "/zg7FTMjtdWmyg8b4o5DXEZNC5uv.jpg",
               "id": 12930,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Champa",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e5291",
               "name": "Juan Andrés Silva",
               "profile_path": null,
               "id": 1138744,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lel",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e5295",
               "name": "José Miguel Silva",
               "profile_path": null,
               "id": 1138745,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Pilo",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e5299",
               "name": "Agustín Silva",
               "profile_path": null,
               "id": 941301,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Lobo",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52b5",
               "name": "Sebastián Silva",
               "profile_path": "/5YP9fre6zBEh2LPQuqOON740RNP.jpg",
               "id": 98251,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Girl high on life",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52b9",
               "name": "Manuela Baldovino",
               "profile_path": null,
               "id": 1272876,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Daniel Riveros",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52bd",
               "name": "Gepe",
               "profile_path": null,
               "id": 1272877,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Botota",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52c1",
               "name": "Esteban Carreno",
               "profile_path": null,
               "id": 1272878,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Hanna",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52c5",
               "name": " Juan Carlos Lara",
               "profile_path": null,
               "id": 543965,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Highway Restaurant Man",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52c9",
               "name": "Gary Boyd",
               "profile_path": null,
               "id": 1272879,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Copiapo Hostel Owner",
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52cd",
               "name": "Marines Munoz",
               "profile_path": null,
               "id": 1272880,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e527f",
               "name": "Sebastián Silva",
               "profile_path": "/5YP9fre6zBEh2LPQuqOON740RNP.jpg",
               "id": 98251,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e5285",
               "name": "Sebastián Silva",
               "profile_path": "/5YP9fre6zBEh2LPQuqOON740RNP.jpg",
               "id": 98251,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e529f",
               "name": "Diego Macho",
               "profile_path": null,
               "id": 1049549,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52a5",
               "name": "Sebastián Silva",
               "profile_path": "/5YP9fre6zBEh2LPQuqOON740RNP.jpg",
               "id": 98251,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52ab",
               "name": "Sofía Subercaseaux",
               "profile_path": null,
               "id": 1208221,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52b1",
               "name": "Mark Grattan",
               "profile_path": null,
               "id": 1208222,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52d3",
               "name": "Pedro Subercaseaux",
               "profile_path": null,
               "id": 1289459,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52d9",
               "name": "Cristián Petit-Laurent",
               "profile_path": null,
               "id": 1208220,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52df",
               "name": "Juan de Dios Larraín",
               "profile_path": null,
               "id": 1075100,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bc59251416c910e52e5",
               "name": "Pablo Larraín",
               "profile_path": "/zp9v8hxFiRE4b8A7pjlFtHOzBNk.jpg",
               "id": 225009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bc59251416c910e52eb",
               "name": "Cristóbal Sotomayor",
               "profile_path": null,
               "id": 1289460,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ab414b00e0a265f27010d3d",
               "name": "Jorge Gonzalez",
               "profile_path": "/wlzqasywi4bcXQAshqysVWn8ZTU.jpg",
               "id": 1956878,
               "department": "Sound",
               "job": "Songs"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 4.17849,
      "production_countries": [{
         "iso_3166_1": "CL",
         "name": "Chile"
      }],
      "id": 157409,
      "vote_count": 68,
      "budget": 0,
      "overview": "Jamie is a boorish, insensitive American twentysomething traveling in Chile, who somehow manages to create chaos at every turn. He and his friends are planning on taking a road trip north to experience a legendary shamanistic hallucinogen called the San Pedro cactus. In a fit of drunkenness at a wild party, Jamie invites an eccentric woman—a radical spirit named Crystal Fairy—to come along.",
      "similar": [],
      "original_title": "Crystal Fairy & the Magical Cactus",
      "runtime": 98,
      "poster_path": "/eH3zbfYoAlFAON8YOzZE2HXoW53.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fábula",
            "id": 21546,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Diroriro",
            "id": 62281,
            "origin_country": ""
         }
      ],
      "release_date": "2013-07-12",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Chile",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sebastián Silva"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Sebastián Silva"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2332579/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3Mjk5NjUxNF5BMl5BanBnXkFtZTcwMTk3OTA4OQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michael Cera, Gaby Hoffmann, Juan Andrés Silva | See full cast and crew »"],
      "reviews": [
         "Hiding behind masks that cover their vulnerability, two Americans in Chile, Jamie (Michael Cera) and Crystal Fairy, a young free-spirited woman (Gaby Hoffmann), spar off against each other in Chilean filmmaker Sebastián Silva's psychedelic comedy Crystal Fairy. The film was nominated for the Grand Jury Prize and won the Directing Award for World Cinema at the 2013 Sundance Film Festival. Jamie's act is one of controlling, overly-aggressive behavior but not quite the \"Ugly American,\" while Crystal's is the opposite but equally phony, a caricature of a \"hippie\" filled with love for everyone who spouts clichés about chakras and mother earth, walks around her hotel room naked, engages in healing rituals, and chides the others for eating junk food. It's hard to tell if the director is using her persona as a means of ridiculing these ideas or just showing how inauthentic she is. In any event, Crystal and Jamie's way of being, while it fills a need for them, has costs in sacrificing who they really are. On the surface, the film is a road trip to find a psychedelic substance in the San Pedro cactus plant which, when boiled for twelve hours and ingested, has the properties of mescaline (it has been said that the actors used mescaline while shooting the film). In essence, however, the film is not really about mescaline but about releasing rigid patterns of behavior and discovering new ways of interacting that are more fulfilling. The film begins at a party where Silva's hand-held camera-work and improvised conversation is established. On a cocaine high, the caustic Jamie invites a partygoer, a girl who calls herself Crystal Fairy to accompany him and his friends on a quest to repeat the spiritual high described in Aldous Huxley's book The Doors of Perception. When Crystal takes him up on the offer the next day (which he has forgotten that he even made), he is dismayed by her annoying behavior, even though his Chilean friends, Champa (Juan Andres Silva) and his two brothers Lel (Jose Miguel Silva) and Pilo (Augustin Silva), seem more tolerant, perhaps because at least one does not understand English. Their trip to the ocean to locate and purchase a piece of the San Pedro cactus from reluctant residents is one of the comic highlights of the film, even though Jamie has to eventually use surreptitious means to acquire it. Crystal Fairy ends up in a good place even though it is more than a little irritating in getting there. During the trip, Jamie and Crystal talk to each other, but at cross purposes. The results are unpredictable but, suffice it to say, their longing for a spiritual experience does not take the form that Huxley described. Michael Cera's role is out of character from the lovable, nerdy self he has played in earlier movies, but he is terrific in this film, totally natural and very real, as is Hoffmann in her role, both continuing to reveal a new dimension to their character. Ultimately, the group's sharing about their fears and their discovery of how their act no longer serves their purpose in life is more open and honest than anything I've seen in films recently and stays in the memory.",
         "A hit at the 2013 Sundance Film Festival, Crystal Fairy stars Michael Cera (Scott Pilgrim vs. the World) as an uptight American drug-partaking lout backpacking parts of Chile with three friends (whom are native Chileans) in search of a rare cactus -- the San Pedro -- in hopes of experiencing its hallucinogenic effects on a northern beach. At a random party before their trek is set to begin, a coked-out Jamie (Cera) spontaneously invites another American party-er to partake with them. She (Gaby Hoffman - remember the little girl from Field of Dreams and Sleepless in Seattle?) is a hairy (uh ... yep) free-spirit who channels the vibes of nature and goes by the name Crystal Fairy. After their trip begins (it is a few hundred miles of a drive from the city to the beach), Jamie and Crystal discover that they have conflicting personalities and they clash many times before their group even comes across the cactus to imbibe as he is boorish and insensitive and she is unique and a deep-thinker. Jamie becomes increasingly annoyed with Crystal while his three Chilean friends tolerate her much better and actually respect her point of view and sensibility. Jamie is oftentimes unaware of his rude-ness but he is written well and believably portrays an American tourist expecting concessions and advantages. When they actually find a cactus (one she has spotted), Jamie and Crystal Fairy even disagree as to how to obtain it because Jamie likes things being his way and he is a stressful worry-wart. While this portion of the journey is complicated, the real \"adventure\" begins on the beach when they make their drinkable concoction. The film becomes one about personal and inner understanding, acceptance and compassion. The first half comes across as rather annoying as Jamie's character is very self-centered and not too-likable and while I believed the drug-induced portion of the film would be the hardest part to endure ... I was wrong as this is when the true characters of each are actually revealed. As for the film's acting: Cera fans know what to expect from him and he plays another slight variation of manic that he's shown audiences before. His character is high-strung and abrasive and some might want to reach through their screens and punch him a time or two; but this is a testament to Cera's acting talent. He plays his character very well. Hoffman hasn't been on many movie screens lately and it is nice seeing her play the titular (ahem) character. She bares more than just her soul in a few scenes ... and her final admission around a late-night campfire is moving and emotional. Welcome back to the big screen Gaby! This is a good little, independent film ... but it isn't one for everybody. It takes some patience and those who dislike grainy picture and plot-lite story lines won't appreciate or enjoy this. It is only those patient enough to make it to the end of this film and willing to take the entire trip who will be rewarded with the film's high.",
         "Michael Cera is Jamie, an American traveler in Chile who plans a road trip with his friends to indulge in a legendary hallucinogen, the San Pedro cactus. While drunk at a party, Jamie invites an eccentric, radical spirit named Crystal Fairy, played by Gaby Hoffmann. When Jamie's insensitive, controlling, impatient, selfish nature is revealed it conflicts with Crystal Fairy, making what was suppose to be a care-free adventure into an uncomfortable journey for everyone. Michael Cera and Gaby Hoffmann are both very brave for taking on these characters, who are in perfect contrast with one another. The result is excellent performances of well-written characters. Unfortunately the film is going to attract audiences looking for a drug-fueled adventure in the vein of Fear and Loathing in Las Vegas, not a character-driven comedy lacking any real laugh-out-loud moments. The film is played almost too serious to be any fun, though there is depth. Writer/director Sebastián Silva proved his powers as a serious filmmaker with Magic Magic, which also starred Cera and was released earlier this year. Other than having Cera in lead roles, the only thing the two films share in common is an abrupt ending that will either leave you haunted or irritated. While Magic Magic is an effective psychological horror film, Crystal Fairy is a thought-provoking character study poorly marketed as an adventure comedy. Crystal Fairy and The Magical Cactus isn't a bad film but it does fail as a comedy. As for the adventure, the credits begin to roll too soon after the film gets interesting. This will annoy more than it will amuse or enlighten.",
         "I am late seeing this flick and I must disagree with a few other reviewers and their take on this very simple yet complex movie. Once again Sebastián Silva is offering up questions on youth and how youth sees the world around them. Jamie is obviously a self centered person with a limited experience in communicating with others (sort of like the US) (as Jamie is an American) and we can see this in his 'attitude' throughout the story. The other three boys have had to share with others and they try to make the best of their trip to the beach. Jamie, on the other hand insist they do it as planed. Enter Crystal Fairy into this mix and you already have an altered perception of exactly what they want to do - she is like the drug reduced from the cactus later in the story (she has an altered view of reality). She wants to share everything the three other boys don't seem to mind. Jamie can't tolerate it - he wants none of her. Crystal mothers them, she wants to know them, the boys are like children to her - yet she is very childlike herself. Jamie suddenly wants to be friends with her but only when he's 'high', after he comes down he's back to his original self. Crystal leaves quietly, Jamie sees her leave and calls her name, Crystal disappears behind a rock. What is Silva showing us here? Crystal is the personality of many different people, she's giving, caring, willing to accept life on her own and take risks - and being alone isn't easy, she is alone throughout the movie and Jamie thinks she's a phony. Jamie cannot see that he is the phony because in the end Crystal is what Jamie was seeking in the brewed Cactus they drink and even when high he could not accept it.",
         "\"Crystal Fairy\" is a road trip taken by two of the ugliest Americans to ever trod a cinematic foreign country. Their goal: Mescaline and spiritual discovery � or closer to the truth, themselves. Comedy star Michael Cera, Jamie, showcases trademark Allenesque neuroses, whining and flat affect in a role based on the experiences of Director Sebastián Silva. The reversal is Silva was a native while Cera is an interloper of whom it is asked, \"Did you travel to (beautiful) Chile just for the San Pedro (the cactus harvested for Mescaline)?\" The answer is a resounding yes, and there is nothing he won't do to get it, including stealing cactus from a lonely, mentally challenged woman. Gaby Hoffman, Crystal Fairy, is a pontificating Sixties throwback who wanders about in the nude and chastises people about their food choices (while drinking Coke). She's also an unwanted (by Cera) barnacle clinging to the trip which includes three native brothers. (The scenes of the brothers trying to look like they're not gawking at the nude Hoffman in a hotel room are hilarious.) Cera's performance is admirable but his usual one-note. Hoffman easily outshines him. The improvised dialogue adds immediacy and verisimilitude while masking the bitter subtext; Neo-Colonialism and Financial Imperialism. Like \"Tony Manero\" (a film crediting thanks to Silva), United States' influence and interference lightly greases this story's wheels. Unlike \"Tony Manero,\" \"Crystal Fairy\" adds character arcs: Cera departs his obnoxious head to find self-acceptance and a heart recognizing Fairy's inner beauty; Fairy discovers her healing powers cannot reanimate a dead animal and the world just might not end in 2012. She also finds acceptance of the sexual abuse leading her to a life as a strap-on wearing Dominatrix. The Chilean brothers are antithetical to the Gringos. Their portrayals are a given as they're natives of the country of the film's origin, but their counterpoint makes Cera and Hoffman all the more ridiculous. To say \"Crystal Fairy\" is a comedy (stoner or otherwise), twisted love story or angry gringo-invective is to sell the film short. This is a sweet, abstract film with multiple layers and a few very fine moments. The film plants itself in the psyche � much like Mescaline. Giving in to the film's charms results in a feeling you actually tripped along. Multiple viewings may help in understanding off-the-cuff lines delivered sotto voce. And the abrupt, unsatisfying ending is a shortcoming. There is a movement to cut to black and end films with ambiguity. To feed post-viewing conversation and debate? Whether lazy, uninspired, unmotivated or ill-advised, an ambiguous ending cheats the audience. (\"The Birds\" notwithstanding.) A welcome respite to noisy, tent-pole, superhero entertainment, joining this troupe on the road is definitely worth the ninety minute trip � straight or high.",
         "This is my opinion. I think this movie is incredibly deep but in a light kind of way, in a way that the viewer learns from it what applies and relevant for him. I think it's honest, a rare thing in movies these days. No clichés, no bullshit. I think it makes you think, makes you feel. It makes you connect with the characters, almost as if you are traveling with them. And what I liked most about this movie is the \"twist\", when who you think is the main character turns out to be just the scenery for the real deal. I recommend this a lot to people who are done with the Hollywood industry, who are looking for something real and worth watching, and especially to people who are about to travel, especially to travel alone. I think in some way you will learn a lot.",
         "You most likely don't know this, but in Canada we can just walk into a store, and buy the cactus already dried, and ready to use, and it costs very little. These characters are mostly jerks, and for the most part it is really hard to root for them on this quest, even if I have been on several similar. This movie has no magic, but there is a long drive, and a lot talking and trying to get high. Michael Cera's Jamie is a winy troubled little jerk, and Gaby Hoffmann as the Chrystal Fairy herself is just a complete flake, but that is what they are supposed to be so as far as the acting in this movie it is all really good, it is just hard to watch good acting no matter how good when you are watching such unacceptable people. I really did not Enjoy this movie, there are parts that deserve praise, but it was just such torture watching these characters that I do not recommend this unless you just love art films, and have your own Cactus questing memories you want to relive.",
         "CRYSTAL FAIRY & THE MAGICAL CACTUS has little to offer its viewers. The dialogue comes off as a documentary or a reality show (which, as I recently discovered, is because most of the film was not scripted, as the cast either improvised or was fed lines by the director right before takes), and there isn't much plot to the film. To put it simply, a group of friends in Chile search for the San Pedro cactus in order to cook it and drink it as a hallucinogenic drug, and once they finally find it, they camp out in the desert, cook it, drink it, and trip on it; that's all that there is to it. There are so many unnecessary scenes that do absolutely nothing to move the barely existent plot along, and the very little that this film accomplishes could have been accomplished in a half-hour short film. The characters have very little depth to them and are not compelling at all, and the film is just, to put it simply, incredibly boring. I was excited to see this film because I am a fan of Michael Cera, but I am so drastically disappointed, and if, like me, you are only interested in seeing this film because you are a Michael Cera fan, then waste your time with this pointless film if and only if you're that desperate to see him because otherwise, this probably won't be worth your time. It might have been a bit better if the whole script had actually been written, but the improvisation technique works for some productions and not for others; this film falls into the latter category, to say the least.",
         "I saw the trailer, and thought this film showed some promise. After seeing THIS IS THE END, Michael Cera definitely became more then a simple character actor. Unfortunately, this film will do nothing for his career. The article I read about this film, said, this film was made, while the film that was supposed to be happening, was put on hold. And most of the film was improvised. No doubt. There was nothing remotely interesting about anyone, or anything \"happening\" in this. The story could be told in 15 minutes, and was totally without anything interesting to say. But one thing I must comment on, the cinematography. They forgot to rent a tripod, and the whole film is hand-held, and it's hand-held by someone who must have some nerve ailments. It's a mess. This was a film you pay to see in a theater, and it's 3 months before you decide to go see another film. Sorry to be so negative,,,,,,but,,,,,,",
         "Crystal Fairy is one of the most pointless films I think I've ever watched. It's not trying to be avant-garde and it's not trying to be mainstream, it lingers somewhere inbetween without reason. It has little story, with no plot and hence, goes nowhere from the start. Michael Cera is somewhat fun to watch, but the film as a whole has no motive to make you enjoy it. I can see where the film wanted to go, this exotic road trip, but it fails so many times that it feels like you are watching an idea that could have been unfold into this series of pointless images. Crystal Fairy and The Magic Cactus is one of those boring films with no substance to give you anything to keep you watching. Michael Cera is possibly the only reason for you to pick this movie up with no other big names."
      ],
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Diroriro",
         "Fabula"
      ],
      "summaries": [
         "Jamie (Cera) is a boorish, insensitive American twentysomething traveling in Chile, who somehow manages to create chaos at every turn. He and his friends are planning on taking a road trip north to experience a legendary shamanistic hallucinogen called the San Pedro cactus. In a fit of drunkenness at a wild party, Jamie invites an eccentric woman -- a radical spirit named Crystal Fairy (Hoffmann) -- to come along. What is meant to be a devil-may-care journey becomes a battle of wills as Jamie finds himself locking horns with his new traveling companion. But on a remote, pristine beach at the edge of the desert, the magic brew is finally imbibed, and the true adventure begins.",
         "As Jamie travels in Chile, he invites an eccentric woman to join his group's quest to score a fabled hallucinogen, a move that finds him at odds with his new companion, until they drink the magic brew on a beach at the edge of the desert."
      ],
      "budget": 0
   },
   "movielensId": 105254,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2013-07-12",
      "dvdReleaseDate": null,
      "directors": ["Sebastián Silva"],
      "runtime": 98,
      "movieId": 105254,
      "title": "Crystal Fairy & the Magical Cactus",
      "mpaa": "NR",
      "actors": [
         "Michael Cera",
         "Gaby Hoffmann",
         "Juan Andrés Silva",
         "José Miguel Silva",
         "Agustín Silva",
         "Sebastián Silva",
         "Manuela Baldovino",
         "Gepe",
         "Esteban Carreno",
         " Juan Carlos Lara",
         "Gary Boyd",
         "Marines Munoz"
      ],
      "imdbMovieId": "2332579",
      "originalTitle": "Crystal Fairy & the Magical Cactus",
      "genres": [
         "Comedy",
         "Adventure"
      ],
      "youtubeTrailerIds": ["E7nInvUzAI8"],
      "plotSummary": "Jamie is a boorish, insensitive American twentysomething traveling in Chile, who somehow manages to create chaos at every turn. He and his friends are planning on taking a road trip north to experience a legendary shamanistic hallucinogen called the San Pedro cactus. In a fit of drunkenness at a wild party, Jamie invites an eccentric woman—a radical spirit named Crystal Fairy—to come along.",
      "tmdbMovieId": 157409,
      "avgRating": 3.08667,
      "releaseYear": "2013",
      "numRatings": 75,
      "posterPath": "/eH3zbfYoAlFAON8YOzZE2HXoW53.jpg"
   }
}