{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "propaganda",
            "id": 2903
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "rebellion",
            "id": 11196
         }
      ],
      "imdb_id": "tt0064684",
      "video": false,
      "title": "The Monitors",
      "recommendations": [],
      "backdrop_path": "/770zHap0vYjenllNTNogLxg5kjN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Harry Jordan",
               "gender": 2,
               "credit_id": "52fe4d89c3a368484e1ee97b",
               "name": "Guy Stockwell",
               "profile_path": "/kUT8VPWDVTOvgyhHf29w2ggCIJx.jpg",
               "id": 93655,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mona",
               "gender": 1,
               "credit_id": "52fe4d89c3a368484e1ee97f",
               "name": "Sherry Jackson",
               "profile_path": "/yU0RSvX8BIz9P5ScaK0TKSsBhoA.jpg",
               "id": 119245,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "General Blackwish",
               "gender": 2,
               "credit_id": "52fe4d89c3a368484e1ee983",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Barbara Cole",
               "gender": 1,
               "credit_id": "53633487c3a368159f001462",
               "name": "Susan Oliver",
               "profile_path": "/uePe60APf8f0dBvxBxSe7IYL30N.jpg",
               "id": 90520,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "U.S. President",
               "gender": 2,
               "credit_id": "53633497c3a36815950013ad",
               "name": "Ed Begley",
               "profile_path": "/or39TZVqz9egZPDqQ1Lzeago1zr.jpg",
               "id": 39816,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Stutz",
               "gender": 2,
               "credit_id": "536334aac3a368159f00146e",
               "name": "Larry Storch",
               "profile_path": "/ZGsMveB21D6n2r7bKCH30Xhrr4.jpg",
               "id": 151644,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Max Jordan",
               "gender": 2,
               "credit_id": "536334bec3a36815950013b3",
               "name": "Avery Schreiber",
               "profile_path": "/mOhdekVshv8N97KebvY3IeeBKEe.jpg",
               "id": 100624,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Tersh Jeterax",
               "gender": 2,
               "credit_id": "536334d6c3a36815860013ba",
               "name": "Shepperd Strudwick",
               "profile_path": "/4LH8tFZHdejNYRdJyka1Wo3a4H.jpg",
               "id": 82676,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Production Manager",
               "gender": 2,
               "credit_id": "536334f2c3a36815760013de",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Street Cleaner",
               "gender": 2,
               "credit_id": "53633503c3a368156800140d",
               "name": "Alan Arkin",
               "profile_path": "/gcrKO2z0YVUXBXVeB9V8PndG0IJ.jpg",
               "id": 1903,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Cameo",
               "gender": 2,
               "credit_id": "5363350fc3a368158d001476",
               "name": "Stubby Kaye",
               "profile_path": "/rr8PedX37Yg62H9K7j0Ylc1Ir3o.jpg",
               "id": 12827,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Cameo",
               "gender": 2,
               "credit_id": "53633522c3a36815760013e8",
               "name": "Xavier Cugat",
               "profile_path": "/pZqbwaJrOK44EMrEpwKc6Dd5G9z.jpg",
               "id": 579763,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d89c3a368484e1ee977",
               "name": "Jack Shea",
               "profile_path": null,
               "id": 190793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "594073a0c3a3687ddb001251",
               "name": "Bernard Sahlins",
               "profile_path": null,
               "id": 1231953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59407441c3a3687ddb0012aa",
               "name": "Patrick Kennedy",
               "profile_path": null,
               "id": 1118130,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "568bed76c3a368362801765c",
               "name": "Keith Laumer",
               "profile_path": null,
               "id": 1245339,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "568bed91c3a368227b02380e",
               "name": "Myron J. Gold",
               "profile_path": null,
               "id": 1420773,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "568bede392514131df02b5d1",
               "name": "Vilmos Zsigmond",
               "profile_path": "/zItpdF2B0mohQSFs40E7eUg3nkL.jpg",
               "id": 12235,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "594073d8c3a368040a013f25",
               "name": "Sheldon Patinkin",
               "profile_path": null,
               "id": 1099370,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5940742dc3a36851f80090ac",
               "name": "Fred Kaz",
               "profile_path": null,
               "id": 1535855,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "594074499251414af2015ede",
               "name": "Roy Henry",
               "profile_path": null,
               "id": 1833179,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59407455c3a36851f80090cd",
               "name": "Rusty Meek",
               "profile_path": null,
               "id": 1780734,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "59407476c3a36851c4009465",
               "name": "Ralph Hall",
               "profile_path": null,
               "id": 1767430,
               "department": "Art",
               "job": "Set Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.221212,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 210940,
      "vote_count": 2,
      "budget": 0,
      "overview": "Earthlings chafe at the peace established by a benevolent alien race and set about to rebel.",
      "similar": [
         840,
         20424,
         601,
         10200,
         49849,
         228161,
         602,
         16866,
         10122,
         1891,
         348,
         608,
         17654,
         47933,
         8836,
         101299,
         299687,
         137113,
         126889,
         563
      ],
      "original_title": "The Monitors",
      "runtime": 92,
      "poster_path": "/40oyp1C1ciPq1VK2F7j6mPbYFq3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Wilding Picture Productions",
            "id": 16733,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bell & Howell",
            "id": 91359,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Second City",
            "id": 91360,
            "origin_country": ""
         }
      ],
      "release_date": "1969-10-08",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Shea"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Myron J. Gold",
         "Keith Laumer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064684/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyNTkxNTE0Nl5BMl5BanBnXkFtZTYwMzIxODg5._V1_.jpg",
      "actors": ["Stars: Guy Stockwell, Susan Oliver, Larry Storch | See full cast and crew »"],
      "reviews": [
         "I remember watching this movie on late nite TV many times as a child. Although a bit slow it is a good movie and worth watching. The Monitors are a group of aliens which inhabit Earth and take responsibility as a sort of police force, bringing peace to the planet as well as technological and medical advancements. Although the Monitors are truly benign, an underground movement does not want the planet to be controlled by outsiders. The TV series Earth Final Conflict seems suspiciously similar. The social statements are similar to those found in Metropolis, 1984, and Planet of the Apes, and Colossus: The Forbin Project, to name a few. The commentary questions government intervention in affairs domestic as well as foreign, and seems to question whether peace is better than the freedom of self-governance, and if \"peace\" can be enforced. It is also one of the few cold war science fiction movies that does not focus on the USSR by proxy.",
         "This film bounces between being yet another stupid sixties oddity, to an almost forgotten work of sheer genius. There are moments where you'll question whether the cast or crew were on some dodgy medication, and others where you'll think \"blimey. That's not too bad.\" Some of the elements are high comedy - for example one character uses a variety of items (melon, whipping cream, french stick) from a shopping basket in a fight scene, but at the same time the film maintains a certain darkness. The monitors come across as perhaps the most polite but menacing characters seen for a long time. Worth your time.",
         "I've begun to wonder if there are more than a few hundred people on earth who remembered Keith Laumer at all...but now I KNOW there aren't more than a few hundred people... THE MONITORS is a sloppy movie (as befits the era it was made in, where people sometimes went against convention simply because it WAS convention), but the basic humor and theme are definitely still timely. Whoever owns this is a fool for not releasing it on DVD as a cult film. However, if I had 10 or 20 million to make a film with, I wouldn't re-make what is actually one of Laumer's more minor works. I would commit Keith Laumer's greatest literary creation to celluloid; something that should have been done long ago. Or is there no one left out there who remembers Jame Retief of the Corps Diplomatique Terrestrienne?",
         "This used to turn up at 3AM on those stations you had to stick a coat hanger in the back of your TV to get semi-clearly, but I haven't seen it crop up in twenty years now. Aliens conquer the Earth, but the twist is that they bring peace and prosperity and the population rebels against it. Based on a book by Keith Laumer one of the movies more memorable moments are the recurring commercials promoting the Monitors that begin with a chorus singing \"the moooo-nitors mmmm-mmmmmm.....\" Worth a look if you ever stumble across it.",
         "I've been hunting this movie down for the last 10 years. Saw in on late night TV and loved it. But no one thinks that it ever existed. Hopefully the parties involved in this movie decides to make some quick cash and release it for all of us poor chumps to watch and buy!",
         "\"The Monitors\" has some great ideas but it is a really bad film--so bad that a 3 is being VERY generous. It's amazing how such an interesting idea can be so incompetently handled--and this is one incompetent film! I only give it a 3 because some elements of the film are quite good...though most are awful. The basic idea isn't bad. Some aliens who call themselves the Monitors have taken over the planet. However, unlike the typical movie aliens, these guys are very benevolent. They apparently have a strong need to keep order--to be sure the humans stop war, treat each other well and behave. Naturally, some folks hate being told what to do and there is a resistance movement--and here's where the film falls apart. Although the basic idea is good, the resistance folks are comic book morons (with the likes of Larry Storch working for them). Add Avery Schreiber and you've got the nice makings for an episode of \"Love Boat\"--not the makings of a good sci-fi movie! It's really sad, as the ending is really good as well--when the aliens decide to leave since we just aren't worth the trouble and they aren't willing to kill to keep order. If you bother seeing this mess of a movie, check out the odd cameos by the likes of Xavier Cugat (his is pretty cute), Peter Boyle and Alan Arkin as well as a baby carriage scene that is an obvious homage to \"Potemkin\". Also listen for the most annoying music you can find in a film!",
         "This is a somewhat cool movie; however, it loses a bit because the styling and theme is so much like \"The Prisoner\" (if it had antedated the Prisoner, then it would have been really cool), but it seems more like some kids doing \"their version\" of the Prisoner for high school. It certainly has its moments, and I realize it's intended as a black comedy, but since the Prisoner at its core is somewhat dry humor itself...well, there you have it. I mean, even the \"leader\" is in a room that seems exactly like Number #2's headquarters. It does get at least two stars just for the appearance of Sherry Jackson, famous for her cross-halter jumpsuit wearing android in the Star Trek and while that is hard to top, she is even more fetching in \"the Monitors\". Note: This film is now available with Netflix streaming.",
         "I saw this years ago, before I really knew much about Second City. Apparently, this was done by a group of Second City folks in the \"let's make a movie\" spirit, & it shows! Cameos by everybody & their dog, including Jackie Vernon, Sen. Everitt Dirkson, & Xavier Cougat (& his dog!). I knew it was based on a Keith Laumer novel, but didn't know until now that he co-wrote it. Very funny, very strange, & now that I live in Chicago, I recognize many of the locations as being within a few blocks of Second City! How can you beat Guy Williams, Larry Storch, & Avery Schreiber? Fun, relaxed performances in a very enjoyable SF story.",
         "I first saw it when it was only 2-3 years old on the late, late show (it evidently was that unsuccessful), and I was half-asleep. Even though it has almost no resemblance to the book (which I only read a few years ago), I still think it's great. And IF it's a bad one, it's a bad one FULL of clever parts (some of which ARE taken from the book)- The Monitors being \"do-gooders\", but unemotional ones (wanting \"no gratitude\", as the theme song says), their \"prisons\" being more like weekend retreats, the commercials for them, just like campaign ads, with the person in the street interviews and the chirpy song. And of course, Keenan Wynn as the \"General Ripper\" variation, and Ed Begley Sr. as the president. If NOTHING ELSE works, his two scenes DO - the next-to-last one (which I'm tempted to give away), and the earlier one, where, without being a callous person, he somehow manages to HATE being president in a world without crises - \"If you think I'M bitter, you should hear what certain parties in the KREMLIN have to say!\" And Larry Storch as the most incompetent spy ever. After he spells out his group's whole plan to Susan Oliver, she asks him to let her go, and he says, \"I can't - you know too much.\" (I don't know whether this was even an original joke, but he made it funny.)",
         "I saw this on TV back in the 70s. A comic twist on a classic SF theme, made on a shoestring in Chicago. I think some of the Second City troupe was involved in it. I don't remember how it ends, so I can't spoil it. The part that tickled me the most were the constant radio ads the Monitors ran. They sounded exactly like the AM radio station ID jingles of the 60s and 70s. One went \"The Monitors are here/There's nothing left to fear/The Monitors!\" (I know, hard to translate into print, but it had the same saccharine harmonies that top 40 jingles had.) I don't recall exactly how they conquered the Earth--there was no bloodshed. Maybe those jingles had subliminal messages! I also remember seeing a riot in progress, and the Monitors sending a car with a PA system that said \"Reason, not force. Reason, not force.\" It was kind of like very polite cops running the world. The Monitors were very nice folks, but a little too naive. Would love to see it again."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Bell & Howell",
         "Second City",
         "Wilding Picture Productions"
      ],
      "summaries": [
         "Unusual sci-fi invasion film, with a black-comedy twist: The Earth is taken over by The Monitors, aliens who run it like hall monitors in a 1950's high school, with overtones of Big Brother. The film follows the progress of the human underground rebellion. The twist is that as the film goes on, the audience's sympathies shift to the aliens, who are basically benevolent. When the humans manage to oust them, it's back to corruption and bribery by the usual suspects.",
         "Earthlings chafe at the peace established by a benevolent alien race and set about to rebel."
      ],
      "budget": 0
   },
   "movielensId": 105379,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-10-08",
      "dvdReleaseDate": null,
      "directors": ["Jack Shea"],
      "runtime": 92,
      "movieId": 105379,
      "title": "The Monitors",
      "mpaa": "",
      "actors": [
         "Guy Stockwell",
         "Sherry Jackson",
         "Keenan Wynn",
         "Susan Oliver",
         "Ed Begley",
         "Larry Storch",
         "Avery Schreiber",
         "Shepperd Strudwick",
         "Peter Boyle",
         "Alan Arkin",
         "Stubby Kaye",
         "Xavier Cugat"
      ],
      "imdbMovieId": "0064684",
      "originalTitle": "The Monitors",
      "genres": [
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Earthlings chafe at the peace established by a benevolent alien race and set about to rebel.",
      "tmdbMovieId": 210940,
      "avgRating": 3.5,
      "releaseYear": "1969",
      "numRatings": 1,
      "posterPath": "/40oyp1C1ciPq1VK2F7j6mPbYFq3.jpg"
   }
}