{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt1422800",
      "video": false,
      "title": "Beneath the Dark",
      "recommendations": [
         35241,
         69396,
         34302,
         20782,
         187448,
         52405,
         46313,
         82304,
         71548,
         28943,
         25646,
         62105,
         143928,
         39303,
         44158,
         52409,
         258075,
         78339,
         127843,
         77874
      ],
      "backdrop_path": "/qAAyZbUSKdsJkIKPpM7hCKB9NaB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe477fc3a36847f8139025",
               "name": "Josh Stewart",
               "profile_path": "/x9ZQibxASPwVWGeQn4Y5dcU2ZJG.jpg",
               "id": 40039,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Adrienne",
               "gender": 1,
               "credit_id": "52fe477fc3a36847f8139029",
               "name": "Jamie-Lynn Sigler",
               "profile_path": "/ufz89DMTHABqUufCTqFzUv2ZUcq.jpg",
               "id": 99241,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe477fc3a36847f813902d",
               "name": "Chris Browning",
               "profile_path": "/coja80Y3B1XJeCJpW6l1ReCH7Zh.jpg",
               "id": 76543,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sandy",
               "gender": 1,
               "credit_id": "52fe477fc3a36847f8139031",
               "name": "Angela Featherstone",
               "profile_path": "/ubE9z8bDrIy06IKaSLI5LN551vR.jpg",
               "id": 15276,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "The Man",
               "gender": 2,
               "credit_id": "5a61b2030e0a261025011d5f",
               "name": "Afemo Omilami",
               "profile_path": "/bHluEOsKBKajFbk2cnxESo1nSCY.jpg",
               "id": 37825,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Jason",
               "gender": 2,
               "credit_id": "5a61b20b9251410e2301172c",
               "name": "Trevor Morgan",
               "profile_path": "/zoVYTwBw6FOTCG35Tvwd7Ky7m7W.jpg",
               "id": 4940,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Max",
               "gender": 2,
               "credit_id": "5a61b2139251410e1d0115e7",
               "name": "Christopher Gessner",
               "profile_path": null,
               "id": 129143,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Billy",
               "gender": 0,
               "credit_id": "5a61b21dc3a368535d00ecae",
               "name": "Robert Maxhimer",
               "profile_path": null,
               "id": 1963150,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Shirley",
               "gender": 1,
               "credit_id": "5a61b22ac3a368535d00ecb9",
               "name": "Jeannetta Arnette",
               "profile_path": "/uVaqZLhpTh5OmJDFSv7wim63sV1.jpg",
               "id": 2842,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Tim",
               "gender": 2,
               "credit_id": "5a61b234c3a368537b00f649",
               "name": "Grainger Hines",
               "profile_path": "/8eKbbE6CCtPS5NcIRQ7evoORr22.jpg",
               "id": 169839,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Beatrice",
               "gender": 1,
               "credit_id": "5a61b23c9251410e20011a67",
               "name": "Carlease Burke",
               "profile_path": "/vqYAwiodYB8a02iLqM2iYLqPQvR.jpg",
               "id": 149486,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Cameraman",
               "gender": 0,
               "credit_id": "5a61b24b0e0a26102201271a",
               "name": "Chris Hayes",
               "profile_path": null,
               "id": 1411538,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Shawnee",
               "gender": 0,
               "credit_id": "5a61b25ec3a368536000fce4",
               "name": "Melissa R. Bacelar",
               "profile_path": "/4BRuWfUKZJ86NzOCWxPTKCQBxaW.jpg",
               "id": 1630511,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Pledge",
               "gender": 0,
               "credit_id": "5a61b267c3a368536000fcf3",
               "name": "Wade Feehan",
               "profile_path": null,
               "id": 1963151,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe477fc3a36847f8139037",
               "name": "Chad Feehan",
               "profile_path": "/adoL32zdw2zoeNrUZQH4vXHyzqQ.jpg",
               "id": 56665,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe477fc3a36847f813903d",
               "name": "Chad Feehan",
               "profile_path": "/adoL32zdw2zoeNrUZQH4vXHyzqQ.jpg",
               "id": 56665,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "591264e4c3a36864d404d350",
               "name": "Karin Silvestri",
               "profile_path": "/dQ9YCbXe3DjOMhFp2jOgefCqj4x.jpg",
               "id": 1813644,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5912661fc3a36864ec0467de",
               "name": "Daniel Licht",
               "profile_path": "/i6hSKUXNwH8wOnxTNDXB9rCFEsQ.jpg",
               "id": 46353,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59126630c3a36865190461d4",
               "name": "Jason Blount",
               "profile_path": null,
               "id": 993913,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5912663fc3a36864d404d489",
               "name": "Michael Griffin",
               "profile_path": "/7FjZndOdWOow3ukF6osvA8fTMDG.jpg",
               "id": 1099841,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5912664dc3a36864d404d496",
               "name": "Deanna Brigidi",
               "profile_path": null,
               "id": 989750,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "591266679251414edb04bfeb",
               "name": "Emily Batson",
               "profile_path": null,
               "id": 1394639,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "591266829251414ead0482a2",
               "name": "Scott R. Fisher",
               "profile_path": null,
               "id": 1357062,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5912669dc3a36864fc04ad0f",
               "name": "Jamison Scott Goei",
               "profile_path": null,
               "id": 1358021,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.774681,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49004,
      "vote_count": 19,
      "budget": 0,
      "overview": "Driving to a wedding in Los Angeles through the Mojave Desert, Paul and Adrienne pull off the highway and into Roy's Motel and Cafe. This roadside artifact proves to be a strange and surreal place with an unsettling mix of travelers, who force our couple to discover the secret hidden between them and ultimately, the horrifying reality of their current situation.",
      "similar": [
         274,
         10285,
         2832,
         189,
         949,
         336843,
         181283,
         1949,
         158011,
         910,
         996,
         654,
         1939,
         8834,
         12150,
         371608,
         4638,
         845,
         28902,
         72784
      ],
      "original_title": "Beneath the Dark",
      "runtime": 102,
      "poster_path": "/7ZpmvqrvWwAhUtHmthG8Vvb8Iry.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-11-05",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Bring out the truth.",
      "adult": false,
      "homepage": "http://www.bringoutthetruth.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chad Feehan"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Chad Feehan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1422800/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNzY1MTEzNV5BMl5BanBnXkFtZTcwMzA3MjUwNA@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Josh Stewart, Jamie-Lynn Sigler, Chris Browning | See full cast and crew »"],
      "reviews": [
         "This film begins like so many others of its genre -- namely, a young couple on their way to a far away destination pull into an eerie, almost deserted motel where things aren't what they seem. If you think you've seen it before, likely you have. Beneath the Dark has strong echoes of the 2003 John Cusack film Identity, though it pales in comparison. Ahh, what to say about this movie? I enjoyed watching it, but then I am a fan of the suspense genre which has been in a serious state of drought lately. Is it a good movie? Not really. Is it a bad movie? No. The plot line does catch your interest as you watch the two very different back stories of the young traveler and the motel manager unfold. The narrative of the film makes the viewers expect the inevitable connection, which is mildly interesting once revealed. However the entire conceit of the movie is nearly immediately obvious. I suppose in a world where twisty thrillers have been around for so long, it is far more difficult to pull off true surprise. Yet I feel that the director/writer Chad Feehan missed the opportunities to misdirect the audience. One can only hope Chad was not trying for an M. Night Shyamalan production. The film used so many clichés, that it could have been the product of a university class on the genre: the isolated motel in the Midwest and the slightly off motel manager are photocopied directly from Psycho. The jukebox that plays the same song over and over is also lifted. (Didn't we see that in a number of Rod Serling productions?). Yet all is not as grim as this review seems. Mr. Feehan studied well, and utilized these and other familiar elements effectively. So a sense of mild suspense persists throughout the movie. The ending is a bit of a let down -- but the journey was fun. Bottom line: If you like this genre, this movie is serviceable. I certainly wasn't sorry I watched it, although I thought that the motel manager needed to be cast with a stronger performer. If you have nothing to do on a Saturday afternoon, punch this one up. Keep your expectations low and you might enjoy it.",
         "... then you shouldn't be disappointed. A young couple in a hotel out in the desert somewhere close to LA. The Hotel office guy acts strangely, and so do all the other people the couple, mainly the guy, will meet during that night. Up to here it is an absolute cliché but this leads the viewer into the wrong direction. Things are getting stranger and stranger but instead of hysterically screaming girls and bloody massacres, suspense keeps steadily up by clues to the reason why this is happening. But of course there is also a little screaming and blood. Even though this movie leads into a rather parallel World it is pretty reasonable. So people who are able to find a movie mysterious enough without too much blood and bones, but rather by a good and also surprising story and characters should have a good one and a half hour with this one.",
         "Wow, I just finished watching this and I cannot frigg'n believe that people only have rated it an average of 4.8. Geez... What the HELL do people wanna see these days anyway, I mean REALLY! I've commented on a few other Indie films recently where I felt they were rated way too low, but the average rating this one has REALLY burns my butt. Okay, maybe the story is not completely original; and maybe people may be put off by the VERY MILD spiritual overtones. BUT... and it is a BIG BUT like Mariah Carey's... the film was very well directed and written, and it is one of the rare cases where it is acted even better. The main dude Josh was like a younger, milder version of Sean Pen; the guy was COOL personified. And the Black Dude, MAN! I don't know where they found him, but he was bloody PERFECT! The acting alone was so well done and blessedly NOT over the top or overdone in ANY way what so ever, that that alone merits a 7 or more. That is EXTREMELY rare these days; usually, the acting is one of THE worst parts of these kinds of films. In my lowly and wretched opinion, many of these other Indie Horror films can be a bit rough and are DEEPLY into 'B' territory, but THIS baby here frigg'n ROCKED with much better quality than usual. I have to say that this is one particular case where I am truly disgusted with what people have rated this film; it really almost makes me lose total hope for the taste of the movie going / watching public. I'm not gonna add snide comments about how mindless people are who have rated this low or how horrible their taste is, etc., etc., like you usually hear all the time in cases like this. No... But, I WILL say that PLEASE remember that the purpose for reviewing and rating films here is NOT just to trash these films because of our individual little petty and pissy likes and dislikes. NO... The primary reason why I come here myself is to get an HONEST and OBJECTIVE view of the Quality of the film itself REGARDLESS OF WHETHER YOU COMPLETELY LIKED IT OR NOT. Man, it's like if a movie doesn't just make you explode in your pants, you're gonna give it a crap rating (of course, if a movie DOES indeed make you explode in your pants, that probably would merit a '10' : ) Let's remember here people that sometimes we may not personally like a film for one reason or another, but if it is well made and of high quality, it would really be appreciated if ones would temper their ratings and reviews and try to be a little more OBJECTIVE and include that information for those of us who just MIGHT damn well appreciate a movie that is well done like this, despite the fact that YOU didn't like it... THAT is precisely why we come here...",
         "This is probably a good 7 Stars, but I've given it an extra few to try an outweigh the absolutely undeserved 1 Star. I know we all like or loathe different things but this is so far from bad that this review is entirely inaccurate. ***SPOILER START It was pretty obvious to me within 5 minutes that the lead characters were dead, ***FINISH; but for me, it made no difference, I was interested to see how, why, when etc, and I enjoyed getting there! The actors did a great job, with a stand out performance from Angela Featherstone, Although Jamie-Lynn Siglers effort was for me the least convincing. Some elements I have seen elsewhere, but in this case they were repeated well, and I didn't mind at all; in any case the stories pack was shuffled in such a way, that I wasn't quite sure which cards I was going to be dealt, but by the end there were a few unexpected aces in the Directors hand. I enjoyed the look and overall feel of the film, with a lovely 'sunset walking' shot at the end. Supernatural thrillers with big budgets & buckets of blood are ten a penny, and most are dreadful, but this one entertains on a fraction of their budgets, and succeeds where most of them have failed.",
         "The plot for this movie is not exactly new but even with me saying that it will keep you guessing for a bit. The production is great, the acting top notch, characters, direction all good. The most notable quality of this movie though is the pace, it is very slow and considered. The characters are examined in massive detail but you never really get to know them. This is how the plot is disguised so well. If you have patience and you don't mind a film that takes its time then this is definitely for you. For me it was a little slow and void of substance.",
         "While crossing the Mojave Desert to go to a wedding in Los Angeles, Paul (Josh Stewart) and his girlfriend Adrienne (Jamie-Lynn Sigler) have a car accident. They decide to spend for the night into the Roy's Motel and Cafe and they check-in with a man called Frank (Chris Browning). Paul is uncomfortable to disclose a secret to Adrienne while Frank's wife Sandy (Angela Featherstone) has a hidden past that affects their lives. Along the night, weird and surreal things happen to Paul until a stranger help him to discover the truth and make a choice. \"Beneath the Dark\" is an engaging but predictable thriller. The story is unoriginal and the mystery is easily disclosed still in the beginning. But anyway it is entertaining. My vote is six. Title (Brazil): \"A Escolha\" (\"The Choice\")",
         "I won't go into to much detail but this is a great mystery thriller nothing amazing and different tho. It has a slow start and is somewhat predictable, although there where some unexpected twists at the end. The low Ratings are unfair maybe viewers had there expectations to high. Seems like people are struggling to appreciate a decent film these days. What more do you want ? not every movie is going to be the best thing you've seen in years. All round a good film.",
         "Beneath The Dark starts well enough. A young couple pull up into a hotel, looking for a place to stay for the night. As in so many hotel horrors that went before it, the place is deserted and what little people that are around are incredibly sinister. Sound familiar? That's because it is. Imagine Reeker, Vacancy and The Shining (try spot the references) thrown into a blender. That's the impression Beneath The Dark makes early on, and it's a good 'un. Slowly the movie unfolds a series of flashbacks which give an insight into the past of a few of the characters we have seen throughout the movie and into the secrets that their past holds. Paul and Adrienne are a run of the mill young couple experiencing a few relationship problems (Vacancy anyone?) and Frank is the lonely hotel owner who is sinister in his overt friendliness. All sounding pretty run of the mill so far? Here's where it veers off. Through the pre-mentioned flashbacks, and also the bizarre reveals we begin to realise there's a lot more going on in Paul's life than meets the eye, and from some reason, the events of the night seem to be unfolding around the mysterious secrets of his past. As the intensity of these bizarre incidents is cranked up the viewer begins to feel increasingly unsettled and also engrossed. The slow burning build-up beats every last inch of possible tension out of what is, in all fairness, a very lame script. Slowly Beneath The Dark appears to be building to something magnificent, and then boom, the end has happened. Where was our sensational denouement? Nowhere to be seen. In a finish that's likely to leave more questions than answers, and not in the good David Lynchian way, the viewer is left feeling somewhat ripped off. You put up with the bad acting and poor dialogue for what appears to be an interesting plot and quite decent direction to be left feeling somewhat dumbfounded as to how the writer felt that to be an acceptable finish to the movie. Beneath The Dark as a result, appears to be a case of a writer biting off more than he can chew, but with some very blatant signs of potential for the future. All in all I give it 6/10.",
         "So, this morning I watched the 2010 Chad Feehan as writer / director film, Beneath the Dark. The synopsis sounded good, but I tried it mostly because Jamie-Lynn Sigler beneath(Sopranos, Guys With Kids) was in it. The film also stars, Josh Stewart, who has been in a number of good films and TV shows as well. Okay. The basic idea is that Paul (Stewart) and Adrienne (Sigler) are headed to a wedding. A guy from Paul's college frat is tying the knot. Growing weary on the way, and a little frisky, Paul runs the vehicle of the road. It's decided they will not push it and land a hotel room for the night. The Roy Hotel is run by Frank (Chris Browning). He's a step-and-a-half above Anthony Perkins on a creepy-meter, and the hotel is slightly more modern than the Bates Motel. Once tucked away in a room, Adrienne is still frisky (and while there is no nudity, it is quite hot), only Paul has too much on his mind and cannot perform. Frustrated he heads to the connected diner for coffee where he meets a Man (Afemo Omilami) who claims to be the Son of God. The Man certainly knows a lot about Paul, and Paul's soiled past, and aside from conversation, he tries to have Paul answer some simple questions . . . What Do You Believe In? I can't forget Frank's wife, Sandy (Angela Featherstone). She is not a happy woman. Sandy stalks the bars looking for company. Isn't hard for her to find what she wants. Not bra-less in a thin white tank-top. She shows up here and there. (And is quite sensual in a barfly kind of way). Seems her sole (or soul) purpose is to torment the loser-ness of her husband. There is always homemade cherry pie and fresh coffee. There is a jukebox�while outdated with its selection�that is always ready to play. Beneath the Dark is nothing new. Sadly, I knew the end of the story at the very beginning of the movie. There have been a flood of \"identical\" big-screen and direct to DVD films with the same ending over the last four years. I could name them. But if you see one � then I have ruined the ending for the rest. I hate that. Hate it. Because the story was as solid as the acting. Both I enjoyed. The dialogue was crisp enough. The filming was simple but effective. If I were to assume you saw none of the other films with the same ending � then this is an excellent movie. If not, then this is a mediocre film. Since the Beneath the Dark is from 2010 � and we are on the cusp of 2014, I am going to assume the ladder and for that, give the movie 5 out of 10 Stars. Zombie Author Phillip Tomasso http://www.philliptomasso.com",
         "I actually watched this movie by accident, mistaking it for \"Beneath the Darkness\" with Dennis Quiad. I must say that I'm glad I watched this movie. It has a dark atmosphere, and it keeps itself a mystery until the end. I was bored at times, but all things considered i had a good time with this movie, though at the end I had a feeling of deja-vu. The atmosphere reminded me of \"Identity\" while the plot itself was actually a lot like 2003's \"Dead End\", but i liked that movie much more. It succeeds to create an atmosphere full of suspense, but at the end you will be left feeling like you've already seen it all somewhere else."
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Fort, The"],
      "summaries": [
         "Driving to a wedding in Los Angeles through the Mojave Desert, Paul and Adrienne pull off the highway and into Roy's Motel and Cafe. This roadside artifact proves to be a strange and surreal place with an unsettling mix of travelers, who force our couple to discover the secret hidden between.",
         "While crossing the Mojave Desert to go to a wedding in Los Angeles, Paul and his girlfriend Adrienne have a car accident. They decide to spend for the night into the Roy's Motel and Cafe and they check-in with a man called Frank. Paul is uncomfortable to disclose a secret to Adrienne while Frank's wife Sandy has a hidden past that affects their lives. Along the night, weird and surreal things happen to Paul until a stranger help him to discover the truth and make a choice."
      ],
      "budget": 0
   },
   "movielensId": 105560,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-11-05",
      "dvdReleaseDate": "2011-03-29",
      "directors": ["Chad Feehan"],
      "runtime": 102,
      "movieId": 105560,
      "title": "Beneath the Dark",
      "mpaa": "R",
      "actors": [
         "Josh Stewart",
         "Jamie-Lynn Sigler",
         "Chris Browning",
         "Angela Featherstone",
         "Afemo Omilami",
         "Trevor Morgan",
         "Christopher Gessner",
         "Robert Maxhimer",
         "Jeannetta Arnette",
         "Grainger Hines",
         "Carlease Burke",
         "Chris Hayes",
         "Melissa R. Bacelar",
         "Wade Feehan"
      ],
      "imdbMovieId": "1422800",
      "originalTitle": "Beneath the Dark",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Driving to a wedding in Los Angeles through the Mojave Desert, Paul and Adrienne pull off the highway and into Roy's Motel and Cafe. This roadside artifact proves to be a strange and surreal place with an unsettling mix of travelers, who force our couple to discover the secret hidden between them and ultimately, the horrifying reality of their current situation.",
      "tmdbMovieId": 49004,
      "avgRating": 2.6,
      "releaseYear": "2010",
      "numRatings": 5,
      "posterPath": "/7ZpmvqrvWwAhUtHmthG8Vvb8Iry.jpg"
   }
}