{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "passion",
            "id": 2983
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "lust",
            "id": 14794
         },
         {
            "name": "fashion",
            "id": 15479
         },
         {
            "name": "anger",
            "id": 18047
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0119576",
      "video": false,
      "title": "Another 9 1/2 Weeks",
      "recommendations": [
         30671,
         45774,
         54873,
         270383,
         348955,
         124409,
         88067,
         36572,
         80287,
         36571,
         40661,
         31246,
         43742,
         271331
      ],
      "backdrop_path": "/7dCrwv8PuVT4TqJhpVXFBaVYms4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Gray",
               "gender": 2,
               "credit_id": "52fe47659251416c75097c3f",
               "name": "Mickey Rourke",
               "profile_path": "/AvGzQ8fvjurGmZW3W1wlQ5WfSeT.jpg",
               "id": 2295,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe47659251416c75097c43",
               "name": "Agathe de La Fontaine",
               "profile_path": "/4LeMOBBoLJ8YV0miTM3VE3Bmf6k.jpg",
               "id": 53903,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lea Calot",
               "gender": 1,
               "credit_id": "52fe47659251416c75097c47",
               "name": "Angie Everhart",
               "profile_path": "/n4coY7os9hPRRLAzcpr4clpLVh1.jpg",
               "id": 58312,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vittorio DaSilva",
               "gender": 2,
               "credit_id": "52fe47659251416c75097c4b",
               "name": "Steven Berkoff",
               "profile_path": "/jiYMK9prj46Qe4gmbKtBDE6YlSr.jpg",
               "id": 782,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe47659251416c75097c4f",
               "name": "Dougray Scott",
               "profile_path": "/zeZmtK4EKK9R2r6bp2nTxMs3ByS.jpg",
               "id": 15336,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gilles",
               "gender": 2,
               "credit_id": "53994d68c3a3681cfd000db4",
               "name": "Werner Schreyer",
               "profile_path": null,
               "id": 232446,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Drug Dealer #2",
               "gender": 0,
               "credit_id": "53994d79c3a3681d11000ddf",
               "name": "Faisal Attia",
               "profile_path": null,
               "id": 1330036,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Hotel Raphael Doorman",
               "gender": 2,
               "credit_id": "53994d8ac3a3681d0d000dcd",
               "name": "Philippe Beglia",
               "profile_path": "/ycGSaT7IRQrIm1ChAuqsUJJT9xS.jpg",
               "id": 20676,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Kahidijah (as Christine Brandner)",
               "gender": 0,
               "credit_id": "53994d9ec3a3681d11000df2",
               "name": "Christin Amy Artner",
               "profile_path": null,
               "id": 1330037,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Hotel Maid",
               "gender": 1,
               "credit_id": "53994db7c3a3681d11000df7",
               "name": "Sandra Cervik",
               "profile_path": "/o1OANZIaFdIXNQIjngqsGiu8MPZ.jpg",
               "id": 49205,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Woman at Fashion Show",
               "gender": 1,
               "credit_id": "53994dd8c3a3681d15000d39",
               "name": "Lana Clarkson",
               "profile_path": "/mPcfJBBENUFpXkK7eWGeljxhuun.jpg",
               "id": 52144,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47659251416c75097c55",
               "name": "Anne Goursaud",
               "profile_path": null,
               "id": 2873,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53994dfac3a3681d0a000ddd",
               "name": "Mick Davis",
               "profile_path": "/brlM60xbZ5BenwznK2IHY90z1Bk.jpg",
               "id": 59248,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53994e0ec3a3681d1b000dcc",
               "name": "Elizabeth McNeill",
               "profile_path": null,
               "id": 1330038,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "53994e21c3a3681d11000e01",
               "name": "Robert Alazraki",
               "profile_path": null,
               "id": 73717,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "53994e33c3a3681d02000e0a",
               "name": "Stephen W. Parsons",
               "profile_path": null,
               "id": 40283,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "53994e42c3a3681d1b000dd2",
               "name": "Francis Haines",
               "profile_path": null,
               "id": 19125,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.252171,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 18167,
      "vote_count": 18,
      "budget": 0,
      "overview": "John flies over to Paris to find out his girlfriend Elizabeth. He finds a mysterious fashion designer named Lea and her assistant Claire, and it turns out that Lea was Elizabeth's friend in Paris. Lea says to John that Elizabeth married and moved away. The passion starts to appear between John and Lea, when Lea's business partner Vittorio tells John another version of Elizabeth's fate.",
      "similar": [
         979,
         1643,
         1024,
         17612,
         276,
         36630,
         316021,
         226,
         24420,
         300,
         52371,
         10995,
         1427,
         1278,
         38,
         116,
         28468,
         281,
         1813,
         51828
      ],
      "original_title": "Another 9 1/2 Weeks",
      "runtime": 105,
      "poster_path": "/2Dou7Kutnv1BDt2GBM6ErpazUPX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Saga Pictures",
            "id": 25052,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jones Film",
            "id": 25053,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "M6 Films",
            "id": 1115,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "NTTS Productions Ltd.",
            "id": 25054,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Odessa Films",
            "id": 1712,
            "origin_country": ""
         }
      ],
      "release_date": "1997-06-12",
      "vote_average": 4,
      "belongs_to_collection": {
         "backdrop_path": "/lwajd7A0z7WQ132S0sot6YjFzBU.jpg",
         "name": "9½ Weeks Collection",
         "id": 121195,
         "poster_path": "/kx0VUFPvAMTesOY1ymkxbBJAmQL.jpg"
      },
      "tagline": "On the trail of an old love, he found a dangerous new obsession.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anne Goursaud"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Elizabeth McNeill",
         "Mick Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119576/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MDI1MzEzMV5BMl5BanBnXkFtZTcwNDYyNzkxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Mickey Rourke, Agathe de La Fontaine, Angie Everhart | See full cast and crew »"],
      "reviews": [
         "The original 9 1/2 weeks was a fun and sexy film that was full of life. Another 9 1/2 Weeks is almost the exact opposite of the first film and that's why so many fans of the first film were so unhappy with this one. This ain't 9 1/2 Weeks. In this one the character of John is so devastated by the loss of Elizabeth (his lover from the first film) that in the opening moments he places a gun to his head. It doesn't get any happier from there. A few scenes later he looks out his window and sees a once beautiful horse being turned into a dead one. That pretty much describes the state of John and of this sequel. It's a dark dirge of a movie with none of the joy of the first film and that's the whole point. We see John with sexual partners, including a prostitute he tries to pretend is Elizabeth, but there's zero chemistry even with the film's lead actress Angie Everhart. Elizabeth departure has left a void in John's soul and few know the dark places of a man's soul like Mickey Rourke. Just take a look at his performance in Angel Heart if you have any doubts. This time Rourke's face has become so battered from boxing that his appearance fits his character's emotional devastation perfectly and this is underscored by the film's black and blue cinematography. Rourke's John truly seems to be a man who has lost everything as he wanders from the art galleries to the dark alleys of Paris like a ghost searching for some glimpse of redemption. It's not a pretty picture and it's not supposed to be. This is film about pain, loss, and regret. It's a joyless purgatory of a film which works best as a canvas for Rourke's haunting performance as the devastated John. This is not 9 1/2 Weeks. This sequel is bleak, dark, and tragic. That's what I like about it.",
         "Surprise! I actually liked love in Paris. I think it was much darker than the first one, but I respect the writers ideas and can see where they were going with it. What alot of people don't know is Mickey was disfigured from boxing when the movie was made. And he still hasn't fully recovered yet. It took guts to go on filming in such a superficial business. But he always shows his fearlessness, and that makes him a great actor. And Everhart wasn't bad. She's a good actress and can only grow as long as she continues to believe in herself. The scenes between John and Lea said just what they needed to say. Use your imagination and feel John and Lea's pain! This darkly romantic film made sense as it showcased John's inability to love again. Sorry, but there is someone who did enjoy this film.",
         "I rented this one thinking it might be an entertaining bit of tawdry trash with some cheap thrills. It is. It is also one of the saddest love stories ever. I can't say I \"enjoyed\" Another 9 1/2 Weeks, but I can say that I love the movie's romantic streak. It's a terribly sad romantic streak, but a great romantic streak nonetheless. Another 9 1/2 weeks is also cheesy and trashy. It's cheesier and trashier bits actually work to the movie's advantage by adding much needed levity to a very tragic story. Some have said the filmmakers should have had Mickey Rouke's character move on after losing his great love, but that would have diminished the power of their connection. He can't just move on. She's gone and he can't change that. There's no way out from his torturous pain. Mickey Rourke makes you believe it. The filmmakers were smart in building their entire film around him. He truly seems like he's been through Hell. His character begins the film in tremendous pain and ends the film in tremendous pain. There's no happy ending (although I like to imagine he changed his name to Marv and moved to Sin City). Another 9 1/2 Weeks isn't an easy movie to enjoy. Very few love it, but I do. I rented it, watched it, and then I bought it.",
         "First off I LOVED the original 9 1/2 weeks, let me remind you that this film was previously close to 3 hours long and very faithful to the book (at least that is what I have read) apparently test audiences felt it was too disturbing so the director, Adrien Lyne was forced to cut A lot of parts. this is why the film looks disjointed - if you haven't noticed, the editing was pretty bad. I even read the Mickey Rourke had wanted Lyne to stick to his guns and let the film stay faithful to the book. if you haven't read the book yet.. PICK IT up - its by far the best erotic novel I've ever read, its short and to the point.. apparently it is based on a true story - so it intrigues me even more. back to my review on this sequel, lets face it folks most sequels are always bad.. its hard to make a great sequel period. when I first heard that there is a sequel to this film I was in shock - I felt that they should leave the story alone. but many of us who have watched the original have often wondered what became of the two protagonist... this sequel takes us there. the biggest turn off was Angie Everhart's acting... yes she is gorgeous (not as gorgeous as Kim Basinger in my opinion) but looks only go so far - she was merely eye candy, watching her scenes was painful. Mickey was great as the tortured John. I agree with another reviewer that the filmmakers made a wise choice to start the sequel where the original left off. I'm sure others would have liked john to move on - but that sometimes isn't reality. In theory the story was good, it just wasn't executed that well. I really felt deeply sad for him and the fact that he could not be with the one woman he loved - even when confronted with gorgeous women - its just not the same chemistry as he had with liz. I like the fact that elizabeth liked the games John played without having to tell him directly - she was almost like a child - which John liked. whereas lea wanted john to play with her sooo bad - it seemed pathetic. anywho.. the acting on everhearts part made the film bad for me... overall the film wasn't that bad. I think most audiences are use to the typical films which Hollywood feeds us with, this one was different. It was extremely sad and painful - a love story so intense and so amazing, one in which its main protagonist has to move on with his life knowing that he will never be with the love of his life ever again.",
         "Let me start with the good points: the movie is on a high quality print, the art direction is lovely, the sets are sumptuous, the exteriors are shot in Paris and the French countryside (how bad can you screw that up) And that's about it. The entire movie is shot in a corny blue lighting scheme, and most of the sets are also blue. Given the presence of such a beautiful woman, Miss Everhart, and given that she did some rare-for-her topless scenes, some clearer lighting might have been sexier. Talk about a lack of Chemistry between leads. These two never seem to like each other at any time. Rourke looks better suited to do a sequel to Angel Heart than 9 1/2 Weeks. He's aging ... gracelessly. He looks like a ventriloquist's dummy that recently had his hair refitted. Despite his physical appearance, Rourke gives it his best shot, and he's pretty effective as a man locked inside himself, tortured by past mistakes and chances never taken. This could have been very effective opposite Kate Blanchett or Emma Thompson or Gwyneth, but just seems to echo unnoticed off Everhart. Miss Everhart is a presence. Unfortunately, sound developed before color, and there were never any silent color movies, which would have been perfect for her. She has a magnificent physical aura, at 5'11\", with the mane of hair, the supermodel looks, and the ability to fill out a sweater with extraordinary curves. But the girl went to the Royal Kathy Ireland Academy of Dramatic Arts. In terms of depth, she makes Pam Anderson seem like Soren Kirkegaard. She delivers every line with the chirpy intonations of a high school cheerleader. Surely there is more to her than this? What possessed someone to cast her in this role as a successful and powerful career woman? Well, what else is there to say about a pseudo-arty piece of erotica that isn't erotic? Missing the right leads, and missing any chemistry between them ... what else could redeem the movie? Plot? You want plot? Maybe you should try to re-watch Sleuth instead of renting this movie.",
         "I think there's two kind of males. One of them is the sexually overheated and uninhibited, first-sex-then-romance(or nothing) type, and the other one, who prefers the romantic involvement in its classic sense. First get to know, then trying to trust and to love. John Gray is the two kind in one. And Mickey Rourke makes a good job. This movie is not the rehearse of the first one, and OK, not as good too, but I think it shows the second kind of male. (9 out of 10) I would like to recommend The Casanova's Return (1992). Alain Delon's character shows great similarity to John Gray in Love in Paris.",
         "I actually had the dubious experience of watching these movies in reverse, I saw Another before I saw 9 and honestly the difference is surprisingly glaring. Mickey Rouke takes center stage in this one. No longer the supporting character, he has become the focus. A man tortured by guilt is not a new plot point but it's a refreshing development for a character who was otherwise two dimensional. Thusly, it's a welcomed change. Angie Everhart has an energy about her that's intoxicating. She isn't just willing to pose nude, She owns her nudity. She is the playful one trying to lure Rourkes character out of his shell. Her motives remain questionable along with the fate of Elizabeth (the chick from the first movie). And the culmination of her motives is simplistic without feeling dumbed down. The other two predominant characters, Angie's assistant and business partner, are both likable and they are suppose to be. And all four turn in performances that make them memorable. So how does it compare to the original? Another is soft-core porn. It's a story about moving on from guilt or risking repeating your same mistakes. The mystery surrounding Angie's character draws you in as Rouke tries to unravel the mystery. And loads of gratuitous frontal nudity tucked in around the plot keep our attention. 9 on the other hand is just a boring trudge through an unhealthy relationship where two people unrealistically expect something out of the other. Until finally it ends. Also no titties at all. So in the end. You can watch Another without seeing 9 and not miss a thing. It's soft-core, but with talented and under appreciated actors delivering compelling performances, this is worth checking out at least once. Plus naked Angie Everhart. 'Nuff Said",
         "Another 9 1/2 Weeks (1997) 1/2 (out of 4) What on Earth were they thinking? John Gray (Mickey Rourke) travels to Paris to try and track down Elizabeth but after learning that she's now married he starts up a relationship with a young fashion designer (Angie Everhart). I think 9 1/2 weeks in hell would be much more pleasant that trying to sit through this film. It has one of the worst reputations in the history of sequels and it's easy to see why. It would be like trying to make a Friday THE 13TH film but instead of violence, gore and Jason you threw in singing, good vibes and Barney the dinosaur. I'm really not sure what the producers were thinking but this here is perhaps the most unerotic erotic movie ever made. They clearly were just wanted to cash in on the notoriety of the first movie and I understand that. I'm fine that they were simply wanting to make money but for the life of me why would they deliver something like this? There's very little sex, little nudity and there's nothing erotic that happens. The majority of the overbearing 105-minute running time features the two stars just going into various clubs and getting in trouble. They flirt, they talk, they talk some more and then they go home to do nothing. Director Anne Goursaud might have been given an impossible task but she didn't help matters any. The pacing of the film is downright horrid, the lack of style just made for an ugly mess and I'm really not sure why she decided to make everything so dark. The entire film just seems like a bad nightmare that you can't wake up from and this includes the two leads. Rourke and Everhart have zero chemistry together and Rourke appears bored out of his mind and wishing he was anywhere but in front of the camera. ANOTHER 9 1/2 WEEKS is a really bad movie on all levels and it's even poor when compared to much of the direct-to-Cinemax trash that was making the rounds during this period.",
         "Great interesting plot, really dramatic \"noir\" events that do really shock, terrific chemistry between the leads, a really seductive female lead, brilliant acting, from everyone, steamy \"sex\", and a terrific Mr. Rourke cast in a romantic lead when other lesser actors would no longer look the part. The original was great, but this one is better! See it over again, it just gets better, much better, it is a classic, pure and simple. It's great! And very exciting! Watch it over and over to get the most out of it! Mickey Roarke always showed signs of greatness, and now we see why.",
         "First time I ever watched this film was on my vacation in Jamaica. I didn't see all of it at the time but it stuck with me until I came back to the states and tried to buy it. All I could remember thinking was \"WHO IS THAT GORGEOUS REDHEAD?!\" I bought the film and curled up with my boyfriend and watched it after dark and watched this...OK film. Mickey Rourke bored the hell out of me because seriously...he had no passion about him. Angie Everhart was fantastic in my opinion but as my boyfriend said about her acting \"You can only do so much with a dead fish\" the dead fish being Rourke. Right of the bat I felt no chemistry between them. I think Angie is a good actress I just don't think she's found the best movie to show off her greatness. Everhart was the hot French fashion designer and Rourke was....the depressed kinky dude from America that seriously made me wonder why he didn't just kill himself as soon as he found out that Elizabeth was dead.....so Angie Everhart: 9, Rourke: 3, and the movie.....could have been better....a whole lot better"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Jones Film",
         "M6 Films",
         "NTTS Productions Ltd."
      ],
      "summaries": ["When John travels to Paris to attend an art sale hosted by his old flame, he begins a torrid affair with a gorgeous woman (Angie Everhart) who used to be her best friend. As the erotic tension between them builds, John finds himself drawn into a dangerous new obsession."],
      "budget": 0
   },
   "movielensId": 105794,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-12",
      "dvdReleaseDate": "1997-11-04",
      "directors": ["Anne Goursaud"],
      "runtime": 105,
      "movieId": 105794,
      "title": "Another 9 1/2 Weeks",
      "mpaa": "R",
      "actors": [
         "Mickey Rourke",
         "Agathe de La Fontaine",
         "Angie Everhart",
         "Steven Berkoff",
         "Dougray Scott",
         "Werner Schreyer",
         "Faisal Attia",
         "Philippe Beglia",
         "Christin Amy Artner",
         "Sandra Cervik",
         "Lana Clarkson"
      ],
      "imdbMovieId": "0119576",
      "originalTitle": "Another 9 1/2 Weeks",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["v0kEWhgd9f0"],
      "plotSummary": "John flies over to Paris to find out his girlfriend Elizabeth. He finds a mysterious fashion designer named Lea and her assistant Claire, and it turns out that Lea was Elizabeth's friend in Paris. Lea says to John that Elizabeth married and moved away. The passion starts to appear between John and Lea, when Lea's business partner Vittorio tells John another version of Elizabeth's fate.",
      "tmdbMovieId": 18167,
      "avgRating": 2.23077,
      "releaseYear": "1997",
      "numRatings": 13,
      "posterPath": "/2Dou7Kutnv1BDt2GBM6ErpazUPX.jpg"
   }
}