{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sexual abuse",
            "id": 739
         },
         {
            "name": "sadomasochism",
            "id": 6373
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "dead body",
            "id": 10877
         },
         {
            "name": "chainsaw",
            "id": 12394
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "theater",
            "id": 163110
         },
         {
            "name": "show",
            "id": 170850
         }
      ],
      "imdb_id": "tt0077247",
      "video": false,
      "title": "Bloodsucking Freaks",
      "recommendations": [
         28177,
         15711,
         27328,
         28180,
         48221,
         36232,
         28172,
         39342,
         48636,
         27815,
         27495,
         27313,
         23506,
         48350,
         40469,
         22130,
         28170,
         3043,
         16233,
         28389
      ],
      "backdrop_path": "/x30MrCZzj0xqT1TXPtl4mkQjdi5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Master Sardu",
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d84d",
               "name": "Seamus O'Brien",
               "profile_path": null,
               "id": 239181,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Natasha D'Natalie",
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d851",
               "name": "Viju Krem",
               "profile_path": null,
               "id": 239182,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Tom Maverick",
               "gender": 2,
               "credit_id": "52fe454c9251416c9102d855",
               "name": "Niles McMaster",
               "profile_path": null,
               "id": 136915,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Sergeant John Tucci",
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d859",
               "name": "Dan Fauci",
               "profile_path": null,
               "id": 239183,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Creasy Silo",
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d85d",
               "name": "Alan Dellay",
               "profile_path": null,
               "id": 80143,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "Ralphus",
               "gender": 0,
               "credit_id": "535cf932c3a36830b9003fbe",
               "name": "Luis De Jesus",
               "profile_path": null,
               "id": 106406,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "Sardu's Assistant - Curled Hair",
               "gender": 1,
               "credit_id": "535cf94ac3a36830a0003d5e",
               "name": "Helen Thompson",
               "profile_path": null,
               "id": 932475,
               "order": 6
            },
            {
               "cast_id": 1008,
               "character": "Sardu's Assistant - Straight Hair (as Saiyanidi)",
               "gender": 1,
               "credit_id": "535cf95dc3a36830a0003d60",
               "name": "Ellen Faison",
               "profile_path": null,
               "id": 1182138,
               "order": 7
            },
            {
               "cast_id": 1015,
               "character": "White Slave Dealer",
               "gender": 0,
               "credit_id": "57f1a635c3a3680d1200109e",
               "name": "Alphonso DeNoble",
               "profile_path": null,
               "id": 136919,
               "order": 8
            },
            {
               "cast_id": 1016,
               "character": "Doctor's Compensaion",
               "gender": 0,
               "credit_id": "57f1a6459251414645001105",
               "name": "Lynette Sheldon",
               "profile_path": null,
               "id": 1209512,
               "order": 9
            },
            {
               "cast_id": 1017,
               "character": "Caged Girl (as Erica Wolfe)",
               "gender": 0,
               "credit_id": "57f1a657c3a3686891003a77",
               "name": "Crystal Sync",
               "profile_path": null,
               "id": 104554,
               "order": 10
            },
            {
               "cast_id": 1018,
               "character": "Maya",
               "gender": 0,
               "credit_id": "57f1a65f9251414a8d003a3f",
               "name": "Rita Montone",
               "profile_path": null,
               "id": 101611,
               "order": 11
            },
            {
               "cast_id": 1019,
               "character": "Human Dartboard (as Joann Friedman)",
               "gender": 0,
               "credit_id": "57f1a671c3a3686909003661",
               "name": "Joann Sterling",
               "profile_path": null,
               "id": 937700,
               "order": 12
            },
            {
               "cast_id": 1020,
               "character": "Caged Girl",
               "gender": 0,
               "credit_id": "57f1a67b9251415c72005f1a",
               "name": "Juliet Graham",
               "profile_path": null,
               "id": 100435,
               "order": 13
            },
            {
               "cast_id": 1021,
               "character": "Caged Girl",
               "gender": 1,
               "credit_id": "57f1a68492514146a800117c",
               "name": "Arlana Blue",
               "profile_path": null,
               "id": 103213,
               "order": 14
            },
            {
               "cast_id": 1022,
               "character": "Girl on Rack",
               "gender": 0,
               "credit_id": "57f1a68dc3a36868c20038c4",
               "name": "Jennifer Stock",
               "profile_path": null,
               "id": 1077358,
               "order": 15
            },
            {
               "cast_id": 1023,
               "character": "Electrically Shocked Girl (as Janis Beaver)",
               "gender": 1,
               "credit_id": "59f8cd97c3a3682d170022a1",
               "name": "Jenny Baxter",
               "profile_path": null,
               "id": 558481,
               "order": 16
            },
            {
               "cast_id": 1024,
               "character": "Girl on Guillotine",
               "gender": 0,
               "credit_id": "59f8cdaa9251414c290023ab",
               "name": "Illa Howe",
               "profile_path": null,
               "id": 1791742,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe454c9251416c9102d849",
               "name": "Joel M. Reed",
               "profile_path": null,
               "id": 239180,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "535cf970c3a36830b0003df4",
               "name": "Joel M. Reed",
               "profile_path": null,
               "id": 239180,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "535cf97ec3a36830a0003d63",
               "name": "Alan C. Margolin",
               "profile_path": null,
               "id": 1314118,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "535cf98ac3a3683099003ed7",
               "name": "Michael Sahl",
               "profile_path": null,
               "id": 1209227,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "535cf99ac3a3683099003edb",
               "name": "Ron Dorfman",
               "profile_path": null,
               "id": 558219,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "535cf9a6c3a3683099003ede",
               "name": "Joel R. Herson",
               "profile_path": null,
               "id": 1314120,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "535cf9b3c3a3683091003d6f",
               "name": "Victor Kanefsky",
               "profile_path": null,
               "id": 1192222,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 2.442723,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 34023,
      "vote_count": 38,
      "budget": 0,
      "overview": "Sardu runs the theatre of the macabre. Sardu is into S&amp;M. Sardu likes to kill people in public and make them think it's fake.",
      "similar": [
         10781,
         357096,
         9373,
         123109,
         1696,
         10285,
         238636,
         588,
         133805,
         300665,
         205,
         281957,
         73861,
         948,
         298312,
         3597,
         3600,
         49797,
         36599,
         24124
      ],
      "original_title": "Bloodsucking Freaks",
      "runtime": 84,
      "poster_path": "/45H4AGgkM19lFs0F1r00vfJezu4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Troma Entertainment",
            "id": 3052,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alan C. Margolin - Joel M. Reed Productions",
            "id": 22457,
            "origin_country": ""
         }
      ],
      "release_date": "1976-11-02",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Join The Fun!… Human Dart Boards… “Home Style Brain Surgery”… Dental Hijinks!",
      "adult": false,
      "homepage": "http://www.troma.com/films/bloodsucking-freaks/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joel M. Reed"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Joel M. Reed"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077247/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1NzE5Mjg1Ml5BMl5BanBnXkFtZTcwMzU3OTAyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Seamus O'Brien, Viju Krem, Niles McMaster | See full cast and crew »"],
      "reviews": [
         "Extreme violence, graphic nudity, white slavery, a diabolical midget, forced ballet, imprisoned girls being caned on their bare arses; this movie has everything! How can this movie get such a low rating??? Any fan of John Water's \"Pink Flamingos\" or Troma movies such as \"Mother's Day\" or \"Toxic Avenger\" will find this movie to be a masterpiece! Yes, it is demented. Sure, it is in bad taste. Of course it is as sick as hell, but I love this movie. I have seen many movies that attempt to push the boundaries of decency, but this is the funniest one I have ever been privileged enough to view. Sure, you can get the nudity and violence in a film like Caligula or Ilsa, but this movie offers so much more. The humor is darker than a grizzly bears butt during new moon, but if you are as twisted as I am you will want to view this cinematic opus of insanity over and over again. I have watched it many times, and will watch it again many times in the future. When I have had a bad day, there is nothing like this farcical film about captive women being abused by a midget and a madman to cheer me up.",
         "It's VERY hard to believe that it has already been four years since I first saw this film. I vividly remember the non-stop tastelessness, the pathetic attempts at humour, the frequent gore, and of course, Ralphus, who is one of the most vile characters that I have ever seen in the movies. Yet, having said all that, I liked this movie. There are some scenes that are as funny as anything that you're ever likely to see...although in a SICK way. It isn't for the squeamish or the easily offended, but if you can appreciate low-budget trash for what it is, then you'll probably find that this movie is well worth your time.",
         "I bless the day that I purchased my DVD player and PC, for they have both allowed me to sample rare delights such as this. The BBFC have never taken too kindly to this kind of movie, thus leaving the british fans of exploitation and horror movies with little to write home about...until now! For those of you wishing to open your minds, scour the web and grab yourself a sense of humour (albeit twisted), Bloodsucking Freaks is probably a good starting point. Directed by Joel M. Reed and starring Seamus O'brien, The movie is set predominantly in a New York 'theatre of the macabre' Where the evil, yet witty, Sardu (O'brien) delights in torturing young (and often naked) women on stage with various medieval devices, for an audience that believe the proceedings to be nothing more than illusions. Off course, they are not! The wafer thin storyline revolves around Sardu trying to pass off his 'work' as art, but a disagreable art critic who attends one of Sardu's shows says he 'has seen better' and refuses to review his Grand Guignal...so Sardu plots revenge! What follows, is about 80 minutes of bad taste, poor acting, terrible special effects, nudity, violence and gore, all polished off in a nice campy 1970's fashion. Basically, everything I enjoy in a movie that cannot possibly be taken seriously! Bloodsucking Freaks is pure trash...and I mean that in the nicest possible way! Watch for Sardu's killer line...\"her mouth would make an interesting urinal\"",
         "If you rent this cult classic, don't judge it on your first viewing. You MUST watch it 2 or more times before you can really appreciate it. Look past the blood and gore (although that's part of the fun) and see what really makes this film tick. The subtle (and sometimes not so subtle) humor make this worth watching over and over. Give BSF the benefit of the doubt! You will not be disappointed. (NOTE: The director, Joel M. Reed, is currently working on Bloodsucking Freaks 2: The School.)",
         "Blood Sucking Freaks is often considered an exploitation classic, and is one of the select few Troma films to receive a reputation anything like that. It's not hard to see why this film is so well revered among fans of wayward cinema - the gore is disgusting, the torture scenes are extended and make for highly unpleasant viewing and there's an extremely misogynistic tone running throughout the film; something that is very popular with many fans of this sort of cinema. I definitely consider myself an exploitation fan, but I'm only going to rate this film as a must see for people like me; as in it's own right, Blood Sucking Freaks really isn't all that good. The film reminded me a lot of a HG Lewis movie, and the plot seems to take some influence from the \"classic\", The Wizard of Gore, as it follows a stage act. The stage act here concerns S&M and torture, and the \"magician\" at the centre achieves his realistic effects through actually killing his actors on stage while his crowd watch. Furthermore, the girls are put to use again for his own sick pleasure, and he has a cage full of rabid, meat-eating naked women in his basement... The main problem with this film as far as I'm concerned is that it gets too caught up in the sadistic acts and the plot doesn't move fast enough, so after a while it starts to get boring. Director Joel M. Reed clearly has an eye for nasty torture, however, as this film features some of the sickest sequences I've ever seen; chief among them being the guillotine scene, and the part where someone drills a hole in someone's head and proceeds to suck out their brains with a straw! Seamus O'Brien is the lead actor, and it's not surprising that this was one of only two roles for him. His acting is campy and silly, and I really couldn't see him fitting into any other kind of film...which is both praise and a criticism. The locations and special effects all look very cheap, and it's clear that this film was shot on a very low budget; but this grittiness creates a very unclean atmosphere, which helps the film overall as it bodes very well with the nastiness of the action on display. Overall, Blood Sucking Freaks isn't exactly a classic film for my money - but it is mandatory viewing for exploit fans.",
         "Anyone whose tastes run towards exploitation films kind of knows \"the drill,\" the recurring themes, methodology, and clichés of the genre. We embrace them, and an exploitation film which effectively \"plays the game\" can get away with a multitude of since which would be unforgivable in mainstream cinema (bad acting, bad writing, bad production values, etc.). By those standards, \"Bloodsucking Freaks\" should be hailed as a masterpiece of the genre, and, judging by its enduring cult popularity, it is. Still, there's something about this film which limits the viewer's ability to enjoy it for what it is, and, thus, limits itself. At first, it's hard to put one's finger on exactly what it is, but I think I've finally worked it out. Simply put, filmmaker Joel M. Reed made a film whose spirit is as mean-spirited and diabolical as what we see up on the screen. \"Bloodsucking Freaks,\" as often as not, plays its numerous horrors for laughs. (Indeed, Sardu and Ralphus occasionally come across as a kind of nightmarish stand-up comedy act.) The trouble is, the intention behind the humor is anything but good-natured. Any viewer with any kind of decency at all can't relate to the motivations behind what they see, and this diminishes the fun of watching this movie to a great degree. For exploitation fans, there is a fine line between brutal and unwatchable, and there are many times during which \"Freaks\" sinks below that line. And so while this film is an absolute must-see for fans of the genre (although how many such fans have not seen this movie?), it's not going to be one of the films in their collection which can be revisited often.",
         "If you enjoy a movie full of weird, sick and revolting content this is the one to watch! I absolutly love this movie. No their isnt any vampires in it (Although it does have similarities) but it is filled with sadistic, gross, torturistic images sure to satisfy any vampiristic desires.. Think of it as a sideshow of the grotesque for that is how I view it. If I had to point out the shortfalls in the movie I would say the ending although ok, could have been better and at times the content moves along rather slow but once it gets going you will love it.. In a strange way it reminds me of the \"suicide club\" segment in the \"Nighttrain To Terror\" movie.. You find yourself anticipating the next scene. Is this movie sick? Depends on the viewer and their outlook. I would say it was great grotesque entertainment..",
         "*SPOILER ALERT* *SPOILER ALERT* \"Bloodsucking Freaks\" is an essential exploitation flick. All horror and B-movie fans should see it. Put it on the list of flicks to check out before you die. It's gross, sick, inhumane, disturbing and yes, exploitative. It is must see B-movie madness. \"Bloodsucking Freaks\" tells the tale of a bunch of warped S&M freaks putting on a show. They want to create a new theater of the macabre. They take girls on stage and torture them as the audience cheers. Soon the fiends won't be satisfied with the usual whippings and beatings. They want critical recognition of their talents. They decide to stage a bloody ballet so their main critic can soak up the action. Many topless women will howl in agony before this show is over. This is exploitation stripped down to its purest form. There is not much plot here to get in the way of the sadism. What we are left with is a movie that exists only to delight B-movie fans with its love of pain, suffering and bloody naked women. This movie is sicko. It wanted to push the limits of bad taste as far as it could. It succeeded. One could make some nitpicking criticisms, like the dancing dwarf was driving me insane, but I don't think anything could really derail a movie that has so many delirious torture scenes with topless women screaming their heads off. If all of this sounds disturbing, you probably don't want to watch this one. This is for acquired tastes only. As for me, I have acquired the taste. \"Bloodsucking Freaks\" delivers the sick thrills.",
         "\"Bloodsucking Freaks\" may have been quite the shocker back when it was first released, but by today standards it comes across as a pretty funny, low budget classic that gets better and better as your watching it. \"Bloodsucking Freaks\" serves it's purpose nicely. It also has a VERY generous amount of unshaven bush and 70's boobies in practically every scene. Awesome!! Although the special effects aren't all that special, \"Blooduscking Freaks\" contains a very nice share of blood, quirky sadistic murders, and fun elements of torture sprinkled throughout. The real charm of \"Bloodsucking Freaks\" lies within the perfect partnership of Master Sardu and his little henchman Ralphus. The scenes with them together (whether its a game of backgammon or a gleeful torture sequence) play out beautifully and comically. Ralphuses smile alone is sure to melt your heart. Sardu and Ralphus are really the stars of this show, and they seem to be having a great time in the movie. The more I watched them together, the more I couldn't stop laughing. Brazen, unrelenting, and carefree, \"Bloodsucking Freaks\" is by definition a \"B\" movie at it's finest. Perfect for all you cult classic lovers.....",
         "The dastardly Master Sardu ( Seamus O'Brien) has made a special theater for adults that show torture and death in the grand guignol style to make his audience think the deaths on his shows are fake as a police sergeant is on the verge to find out the shocking truth about the shows. Sickening, misogynistic and sleazy trash flick written and directed by Joel Reed and released by the infamous and popular low budget studio known as Troma, this movie is guaranteed to make you feel nauseated. When it was released in 1975 the film was attacked by women's groups as \"woman hating filth\" as they may be right but the movie became a midnight cult fave (ala, \"Pink Flamingos\" or \"Rocky Horror Picture Show\") and made a lot of people sick back then yet it still does as it's truly one of the most disturbing movies i've ever seen, the movie isn't one to defend and will offend anyone who watches it. Also recommended: \" Men Behind The Sun\", \" Cannibal Ferox\", \" Mountain of the Cannibal God\", \"Jungle Holocaust\" ( a.k.a. Last Cannibal World)\", \"Man from Deep River\", \" Caligula\", \"Pink Flamingos\", \"Blue Velvet\", \"A Clockwork Orange\", \" I Spit on Your Grave\", \"Maniac ( 1980)\", \"High Tension\", \"Eaten Alive! ( 1980)\", \" Re-Animator\", \"Evil Dead II\", \"The Toxic Avenger\", \" Cannibal Holocaust\", \" Day of the Dead\", \" Pink Flamingos\", \"Beyond The Dark ( a.k.a Buio Omega)\", \" Basket Case\", \"Suspiria\", \" Tenebre\", \" The New York Ripper\", \" Hostel\", \" The Texas Chainsaw Chainsaw series and 2003 remake\", \" Fight Club\", \"Natural Born Killers\", \"Troma's War\", \" Se7en\", \" Ichi The Killer\", \"Urotsukidoji: Legend of the Overfiend\", \" Riki-OH: The Story of Ricky\", \" Last House on The Left\", \"Mother's Day\"."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Alan C. Margolin - Joel M. Reed Productions"],
      "summaries": [
         "In New York's Soho district, the master of ceremonies Sardu runs the Theater of the Macabre, which specializes in acts where people are tortured and dismembered. The audiences dismiss it as fakery but the gore is real. Behind the scenes, Sardu and his dwarf assistant Ralphus torture and mutilate women for their own pleasure, as well as sell girls they have abducted into slavery. When the critic Creasy Silo contemptuously dismisses the show, Sardu has him abducted and tortured. At the same time, Sardu also abducts the ballerina Natasha Di Natalie and determines to break her will in order to make her agree to perform in his new show.",
         "Sardu, master of the Theatre of the Macabre, and his assistant Ralphus run a show in which, under the guise of 'magic', they torture and murder people in front of their audience. But what the punters see as a trick is actually real."
      ],
      "budget": 0
   },
   "movielensId": 105763,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1976-11-02",
      "dvdReleaseDate": null,
      "directors": ["Joel M. Reed"],
      "runtime": 84,
      "movieId": 105763,
      "title": "Bloodsucking Freaks",
      "mpaa": "",
      "actors": [
         "Seamus O'Brien",
         "Viju Krem",
         "Niles McMaster",
         "Dan Fauci",
         "Alan Dellay",
         "Luis De Jesus",
         "Helen Thompson",
         "Ellen Faison",
         "Alphonso DeNoble",
         "Lynette Sheldon",
         "Crystal Sync",
         "Rita Montone",
         "Joann Sterling",
         "Juliet Graham",
         "Arlana Blue",
         "Jennifer Stock",
         "Jenny Baxter",
         "Illa Howe"
      ],
      "imdbMovieId": "0077247",
      "originalTitle": "Bloodsucking Freaks",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["f9GlGrHxYbs"],
      "plotSummary": "Sardu runs the theatre of the macabre. Sardu is into S&amp;M. Sardu likes to kill people in public and make them think it's fake.",
      "tmdbMovieId": 34023,
      "avgRating": 1.72727,
      "releaseYear": "1976",
      "numRatings": 11,
      "posterPath": "/45H4AGgkM19lFs0F1r00vfJezu4.jpg"
   }
}