{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Amos Posner"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Amos Posner",
         "Joe Uchill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2445556/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI5NjEzODk1OV5BMl5BanBnXkFtZTgwNjA5MzU0NjE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Bryan Batt, Sebastian Beacon, Ashanti Brown | See full cast and crew »"],
      "reviews": ["This looked promising in the trailer, but the movie was just a bit flat. We were really hoping to like it more than we did... The story follows a typical romantic comedy trajectory, with oddball roommates, etc; the characters were likable, and the chemistry between the main characters is believable, but flat - no bubbles... The dialog, although often fairly witty and interesting, didn't resonate most of the time, and the whole thing never took off. I couldn't really put my finger on it. The actors weren't bad, the story wasn't bad, the dialog wasn't bad, but it just didn't work. Blame the director and editing, maybe? Maybe different actors could have given it more sizzle, I don't know. The finale also didn't make any sense to us - a change of heart that, if explained, went completely over our heads."],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": ["When an underground radio DJ makes fun of a fading pop star who happens to listen to his show, the two begin an unlikely relationship. But difficult life and career crossroads jeopardize their idyllic New York romance."],
      "budget": 0
   },
   "movielensId": 105841,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-04-26",
      "dvdReleaseDate": null,
      "directors": ["Amos Posner"],
      "runtime": 0,
      "movieId": 105841,
      "title": "B-Side (2013)",
      "mpaa": null,
      "actors": [
         "Jennifer Damiano",
         " Ryan Eggold",
         " Tobias Segal",
         " Ryan Metcalf"
      ],
      "imdbMovieId": "2445556",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 4.75,
      "releaseYear": "2013",
      "numRatings": 2,
      "posterPath": null
   }
}