{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "godzilla",
            "id": 7671
         },
         {
            "name": "kaiju",
            "id": 161791
         }
      ],
      "imdb_id": "tt0255198",
      "video": false,
      "title": "Godzilla vs. Megaguirus",
      "recommendations": [
         39466,
         36679,
         12561,
         39469,
         19336,
         6593,
         12636,
         36243,
         15767,
         18289,
         3115,
         10643,
         39465,
         39464,
         1679,
         19545,
         1680,
         1682,
         19333,
         38582
      ],
      "backdrop_path": "/1wkAwwgyMEgjkvErIbpFfuq7mpB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Kiriko Tsujimori",
               "gender": 1,
               "credit_id": "52fe471d9251416c9106a639",
               "name": "Misato Tanaka",
               "profile_path": "/nUfv6Jnt6biUHRkhPNPYzE9mdHA.jpg",
               "id": 232823,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Motohiko Sugiura",
               "gender": 2,
               "credit_id": "52fe471d9251416c9106a641",
               "name": "Masatō Ibu",
               "profile_path": "/oVy1sMt7DVttkG5Gpxcv6ullVU9.jpg",
               "id": 93892,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Hajime Kudo",
               "gender": 0,
               "credit_id": "54b16d85c3a3680945002732",
               "name": "Shosuke Tanihara",
               "profile_path": "/qJC0cztL9JBxs0IBytPxJhQyAq8.jpg",
               "id": 129701,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Yoshino Yoshizawa",
               "gender": 0,
               "credit_id": "52fe471d9251416c9106a645",
               "name": "Yuriko Hoshi",
               "profile_path": "/hepS7Io9Qbv3QyU66r0lCYuXw5B.jpg",
               "id": 67023,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Takuji Miyagawa",
               "gender": 2,
               "credit_id": "52fe471d9251416c9106a649",
               "name": "Toshiyuki Nagashima",
               "profile_path": "/xfL757VHSZg02HETRXGi3pS7XMr.jpg",
               "id": 82869,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Kid's TV Host",
               "gender": 2,
               "credit_id": "55df5e4ac3a36813b800015e",
               "name": "Kouichi Yamadera",
               "profile_path": "/m5su8OKD2rZn9XWJfh8aPC403Nz.jpg",
               "id": 20664,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Gojira",
               "gender": 0,
               "credit_id": "52fe471d9251416c9106a659",
               "name": "Tsutomu Kitagawa",
               "profile_path": null,
               "id": 1135826,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Government Official",
               "gender": 0,
               "credit_id": "54bf2f949251411d7700e885",
               "name": "Kôichi Ueda",
               "profile_path": "/qOWfODlgb2J8zcVnTXA90zvRMDT.jpg",
               "id": 50659,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "5778571792514136e1002379",
               "name": "Yuusaku Yara",
               "profile_path": "/c9r45GYdiZmqKtWYDekWFnXqjfS.jpg",
               "id": 547982,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe471c9251416c9106a629",
               "name": "Masaaki Tezuka",
               "profile_path": null,
               "id": 73189,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe471c9251416c9106a62f",
               "name": "Hiroshi Kashiwabara",
               "profile_path": null,
               "id": 66156,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe471d9251416c9106a635",
               "name": "Wataru Mimura",
               "profile_path": null,
               "id": 50652,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.493711,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 39468,
      "vote_count": 29,
      "budget": 8300000,
      "overview": "Godzilla returns to terrorize Japan! This time, however, Japan has two new weapons to defend themselves. The Gryphon, a high-tech ship, and the Dimension Tide, a device that creates artificial black holes! During a test of the Dimension Tide, eggs appear in the city of Shibuya and hatch into terrifying Meganurons! These creatures need water to grow and flood the city of Shibuya by breaking underground water veins. As they multiply and grow, they start to feed on the energy of humans. After gathering enough energy, they transform in to giant dragonfly monsters called Meganuras! And now they target Godzilla for energy to feed to the larva of their queen, which eventually hatches into the terrifying 60-meter Megaguirus who also begins to attack Godzilla for his energy. Now a 3-way battle between Godzilla, the Megaguirus, and humans begins! Will Godzilla win? Will humanity survive?",
      "similar": [
         15766,
         15767,
         19545,
         1682,
         124905,
         39256,
         373571,
         36243,
         7191,
         929,
         15092,
         5876,
         268896,
         68726,
         293167,
         620,
         1680,
         315011,
         1678,
         6593
      ],
      "original_title": "ゴジラ×メガギラス G消滅作戦",
      "runtime": 105,
      "poster_path": "/ffgupHs4tQFo1cDCyT1zH9AfNrB.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Toho Film (Eiga) Co. Ltd.",
         "id": 622,
         "origin_country": ""
      }],
      "release_date": "2000-11-03",
      "vote_average": 5.6,
      "belongs_to_collection": {
         "backdrop_path": "/hhUQwi9Z7wE2kwwC1AM1AE418oU.jpg",
         "name": "Godzilla (Millennium) Collection",
         "id": 374512,
         "poster_path": "/v9fV11I7KVP9xa6UWvW2YlGtErD.jpg"
      },
      "tagline": "Godzilla disappears.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "JPY ",
      "directors": ["Masaaki Tezuka"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Hiroshi Kashiwabara",
         "Wataru Mimura"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0255198/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI4NTQ3NzkyNV5BMl5BanBnXkFtZTgwMjI3NTgwMzE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Misato Tanaka, Shôsuke Tanihara, Masatô Ibu | See full cast and crew »"],
      "reviews": [
         "Although I enjoyed GODZILLA 2000: MILLENNIUM (released in the US as, simply, GODZILLA 2000), I thought that this in-Godzilla-only follow-up, GODZILLA X MEGAGUIRUS: THE G ANNIHILATION STRATEGY, was a vast improvement over its predecessor, and I can see why! Although G2000 was an initial box office success in Japan, it was a critical failure, especially with the fans. Although it had FX that improved over the films from 1989-1995 (but didn't match up to the more successful Heisei Gamera Trilogy), the story wasn't very well put together, and audiences (in both Japan and the US) had a hard time figuring out what was going on (unless you read the manga adaptation or the movie compendiums they had for every new Godzilla film). Godzilla's reappearance (remember, the film was supposed to follow the first film from 1954) was not explained. And keep in mind that G2000's director Takao Ookawara was not into Godzilla at all, and just \"did his job.\" But at long last, Toho hired Masaaki Tezuka (who was assistant director for 1999's MOTHRA 3), who not only made his directorial debut with this film, but is a big Godzilla fan! He, IMHO, is the best director of a Godzilla film after Ishiro Honda (along with Heisei Gamera Trilogy director Shusuke Kaneko, who next directed the more successful GODZILLA, MOTHRA, KING GHIDORAH: THE GIANT MONSTERS' GENERAL OFFENSIVE). The story does not follow G2000 (but Godzilla is exactly the same from that film) because executive producer Shogo Tomiyama had planned to do a trilogy of stand-alone Godzilla films. But in this entry, Godzilla was not only much better explained, but more delightfully protrayed, as both the villain and antihero! A good compromise of the Godzillas from the decades! Godzilla's titular adversary Megaguirus, the three-phase hyper-dragonfly monster (the first stage is a remake of Meganuron, the giant insect from the original 1956 RODAN) looks like a cross between the final stage Battra (from 1992's GODZILLA VS. MOTHRA) and Scyther (from POKEMON), but made a very interesting foe, giving Godzilla the trial of speed! Kenji Suzuki's FX work is a vast improvement over his work in G2000, producing some of his best, most breathtaking visuals (such as the flood in Shibuya, and the Meganeura dragonflies that flock through said city to buzz around on Godzilla like mosquitoes), and the climactic battle between the two title monsters is one of the most vigorous monster fights I've seen! There are nods to spaghetti westerns, samurai flicks and Toei's Sentai Series, as Godzilla suitmation actor Tsutomu Kitagawa does a tribute to his Sentai work by having Godzilla jump into the air on Megaguirus (though it also recalls the 70s Godzilla, but with the friends I saw it with, this scene got as many laughs as it did cheers)! Screenwriters Hiroshi Kashiwabara and Wataru Mimura have outdone themselves this time, more than making up for their mixed work in G2000. Their story does a better job in conveying emotion, action and suspense, and manages to stay away from the many plotholes that plagued the previous film (with only one hilarious major plothole: In one scene, after the first Dimension Tide test, the little boy Jun sneaks past the heavily secured site with the greatest of ease! Tom Cruise has nothing on this tyke)! The music score by Michiru Ooshima (the first female Godzilla composer) is excellent, and the best non-Akira Ifukube composer for a Godzilla film to date! Very dark, cataclysmic and suspenseful, and her brooding theme for Godzilla fits him perfectly! I also noticed that the theme music for the Gryphon (the G-Graspers' super-jet vehicle) recalls Barry Gray's famous THUNDERBIRDS theme! But of course, Toho tacks on two stock Ifukube tracks in the score to tell us that this is a Godzilla film. And last but not least, the human characters were much better done, have more direction and better motivation! I actually felt for and liked the human characters here, and that hasn't been done after 1975's TERROR OF MECHAGODZILLA! Misato Tanaka as the brooding heroine, Kiriko Tsujimori, is tough, intense and sympathetic, sort of reminding me of Carrie Anne Moss' \"Trinity\" character from THE MATRIX; Shousuke Tanihara (who was just in Shusuke Kaneko's CROSSFIRE) portrays the hip inventor Hajime Kudo so perfectly and carefree as any hip Gen-X type should be; Veteran actress Yuriko Hoshi (from MOTHRA VS. GODZILLA and GHIDRAH THE THREE HEADED MONSTER) is very wise and intelligent as Yoshino Yoshizawa; For a kid actor, Hiroyuki Suzuki did a very good job at playing the little boy Jun Hayakawa; Desipte his limited screen time, Toshiyuki Nagashima plays the key role of Tsujimori's late commander Takuji Miyagawa very flawlessly; And actor/anime voice performer Masato Ibu is likeable as the shady Motohiko Sugiura, who organizes G-Graspers. Oh, I noticed that this film emphasizes less on copying the latest Hollywood hit, as the films since 1984 have done so blatantly! The plot in a nutshell: Through the decades since 1954, Godzilla attacked Japan for its nuclear energy. Even though government scientists Motohiko Sugiura (Ibu) and Yoshino Yoshizawa (Hoshi) develop a \"safe\" plasma power plant free of nuclear energy, Godzilla attacks it anyway! Army rangers led by Takuji Miyagawa tried to stop him, but Godzilla killed them in his destructive wake, and the only survivor of the team was Kiriko Tsujimori (Tanaka), whose hatred for the big green terror grew more bitter. Five years later, now as the commander of G-Graspers (and anti-Godzilla task force), Tsujimori enlists both Yoshino Yoshizawa and young inventor Hajime Kudo (Shosuke Tanihara), who come up with a Dimension Tide satellite, which shoots an \"Artificial Black Hole\" on the sky of Earth to suck anything in its radius to oblivion. This would make a perfect weapon against Godzilla, and its test was successful, but some residue from the Artificial Black Hole leaves a bunch of prehistoric insect eggs, one of which is picked up by a little schoolboy named Jun Hayakawa (Hiroyuki Suzuki). When he is forced to dump it into a sewer, a new terror begins, as the egg hatches into a giant Meganuron insect that slaughters a teenage couple, and then sheds its skin to reveal a dragonfly-like insect stage called Meganeura. While Tsujimori and the G-Graspers are in pursuit of Godzilla (she even manages to ride on Godzilla's back), the Meganeuras reproduce heavily and swarm out of the Shibuya district to suck energy out of Godzilla, so that they can inject it into their queen cocoon, which hatches into a huge dragonfly monster called Megaguirus! Now, Megaguirus goes after Godzilla while the G-Graspers prepare the Dimension Tide for him. Which monster will win? Will the Dimension Tide finally get rid of Godzilla? And what IS Godzilla looking for in Shibuya . . . Even though GODZILLA X MEGAGUIRUS was a commercial failure in Japan (the film had a weaker advertising campaign because of G2000's failure), it was a critical success, and the fans agreed! IMHO, this is the Godzilla film that should've been released to US theaters! A fun, fast-paced, action-packed and exciting film! Now I've GOT to see the next Godzilla film (GODZILLA, MOTHRA, KING GHIDORAH: THE GIANT MONSTERS' GENERAL OFFENSIVE)! From what I've seen and read about, this looks to be the best Godzilla film yet!",
         "I avoided this movie for months; most online reviews I read were negative, and it just had a bad stench about it. But then my ever-wise brother recommended it, and I'm glad he did. It's fun - damn fun. Where else can you see Godzilla besieged by giant dragonflies, or cool visuals like a half-submerged city and a woman riding on Godzilla's purple-tinged spines? Many of the special effects shots are a touch sloppy in execution (obvious CGI is rampant), but they're tremendously imaginative in concept. So, improbably enough, they work. Megaguirus is a cool opponent for Godzilla, and their climatic battle is practically high comedy. Both monsters get great reaction shots and some particularly nasty moves. In one infamous - but quite amusing - shot, Godzilla wallops Megaguirus with a leaping tackle that evokes the wrestling maneuvers of his 1960s-70s movies. Fans who complain that too many of the Big G's more recent battles have been decided by \"beam contests\" should delight in the wacky grappling on display here. The human characters have interesting motivations, and are even allowed to be selfish, which is a nice change of pace from the preachy and saintly types you usually get in these movies. There's even a cute kid who manages not to be annoying. In short, it's all good - I like the silly monsters AND the incredibly earnest humans AND the totally insane visual effects. All these ingredients add up to a rare Godzilla feast. Now I'm more jazzed than ever to see \"Final Wars\"!",
         "Version: Eastern Eye R4 DVD - Japanese, English subtitles Godzilla is back to stomp all over Japan, but this time he has to fight a giant dragonfly... Sounds awesome, yes no? In 1996, Japan has been running on clean, renewable energy for thirty years, and has not seen Godzilla since 1966. Clean energy can no longer provide enough power for Japan, the government begins research into neutron energy. Naturally, Godzilla takes the opportunity to announce his coming out of retirement and levels the neutron facility while decimating the anti-Godzilla force 'G-Grasper'. Obviously, military's plan was to confuse Godzilla with a funny name, and then fire a few missiles at him. Needless to say, it doesn't work. Several years later, Kiriko Tsujimori (Misato Tanaka) - a survivor of G-Grasper's 1996 encounter with Godzilla - is now the G-Grasper commander and has a grudge against Godzilla. Obviously G-Grasper need a new weapon to take on Godzilla, and so they turn to Japan's crazy scientists. The result is a cannon called the 'Dimension Tide': a weapon designed to shoot black holes, which they intend to shoot at Godzilla, from space, to minimize the damage to Earth. Obviously no one thought of any possible negative consequences of shooting a black hole - from space, mind you - towards a moving target Earth. The mad scientists have really gone off the deep end here. Of course, they test it first, and open up a rift to another dimension, letting a swarm of Meganuron (over-sized dragonflies) through. Essentially, 'Godzilla vs Megaguirus' is a lighter, happier version of both 'Godzilla vs Destroyer' and 'Gamera 2'. The Meganuron / Megaguirus greatly resembles the Legion from 'Gamera 2'. The shots of Godzilla being swarmed by the Meganuron, look much like the shots of Gamera being swarmed by the Legion. However, going one up on the other two movies, 'Godzilla vs Megaguirus' has better special effects. The 'Alien' style Meganuron look a lot better than the 'Alien' style Destroyer(s) from 'Godzilla vs Destroyer'. Also, it has mad scientists. A big bonus. They might not look like mad scientists, but they certainly think like them. There is some nice monster action, even if it is heavily offset by the human characters running shooting black holes at things. The Tokyo showdown between Godzilla vs Megaguirus is fun. It may not come close to one of the best monster fight scenes, but its funny and entertaining. Smart use of CGI ensures the monsters and fights look good, but on the other hand, for a giant dragonfly, Megaguirus does not beat his wing that often. 'Godzilla vs Megaguirus' is a fun Godzilla movie, and should appeal to Godzilla fans. It does drag on a little though - 7/10",
         "Masaaki Tezuka clearly understands the secret to making rubber monster movies - make 'em big, and make 'em fun! GXM returns the element of spectacle to the series that had been missing in the later 90s entries. The battles are epic, the monsters believably gigantic and menacing, and the destruction sweeping. When crowds of extras run away in GXM, they look genuinely terrified. The wonderful musical score and \"old school\" directorial style come as close to rivalling the best of Honda-Tsuburaya-Ifukube as anything Toho has done since their heyday. Perhaps most important, the monsters have personalities, without sacrificing menace. No more stiff, slow-moving suits lumbering in a straight line toward one another for a battle consisting primarily of optical effects. Both Godzilla and Megaguiras are intelligent, cunning combatants, and their climactic war is among the best of its kind ever filmed. On a whole, GXM is not as flashy or technically seamless as its followup, 2001's GMK(also an outstanding film), but I found it to be more fun. It reminded me of nothing so much as curling up on the floor on Saturday as a kid, watching an AIP rubber monster epic on Shock Theatre or Son of Svengoolie. GODZILLA VS MEGAGUIRUS is a genuine classic!",
         "If any of you out there know me at all, you know that I simply love Godzilla and all of his rubber-suited brethren. That said, I am fully capable of giving a fair and impartial review of Big G's films; let's face it, the big guy's had his share of stinkers (GODZILLA ON MONSTER ISLAND anyone? Peeee-yew!!!). Some of the Godzilla oeuvre (fancy film-snob word!) have been attempts at social commentary, with varying degrees of effectiveness, yet most are simply good, old-fashioned city-stompin' fun. I am pleased to inform you that the latest installment in the series is a fine return to the old-school fun monsterfests of yore, in fact GODZILLA VS. MEGAGUIRUS gets the El Buncho seal of approval as the best Godzilla flick in a decade!!! SPOILER WARNING!!! As of now, since I basically just gave you all the \"yea or nay\" of all of this, you can skip this review if you don't care about Big G. All others, stick around! Also, since this film has yet to see US release, and most of you may not have my video resources, where else are you going to hear about this one? In this installment, despite what Toho has set up in the previous entries of the current series, it is revealed that Godzilla (there is no longer a distinction between old and new) has shown up a couple of times since 1954 (when he was decisively killed by an \"oxygen destroyer\", but I won't go there�) in search of nuclear energy to feed off of. To curb the big critter's appetite (to say nothing of his periodic rampages all over the country), the Japanese government bans nuclear power and develops a plasma-based clean fuel system. For whatever reason, this does absolutely nothing to thwart Godzilla. The government then implements a paramilitary group called the G-Graspers (Yes, I'm serious) who intend to put an end to the big guy once and for all using a focusable black hole generator called the Dimension Tide. The leader of the G-Graspers is a young woman named Tsujimori, a former ranger whose commanding officer was killed in an encounter with Godzilla five years previous, and she is obsessed with avenging her commander's death. She recruits a humble nano-technology (itty-bitty robots) genius named Kudo to help on the Dimension Tide project by using his skills to create the ultimate computer system to guide it. Why he creates a super-guidance system that can only be operated from his personal laptop computer is beyond me, but I'll let that one go� The test of the Dimension Tide gun is a success, sucking an abandoned test building into oblivion, but there is evidence of residual dimensional distortion. Of course, no one thinks anything of it, and a little boy who accidentally witnesses the test finds a mysterious egg, which he promptly takes home. His family is then transferred to Tokyo, where he abandons the growing, oozing egg in the city sewer system. At the same time, a solar powered satellite is launched into orbit which houses the Dimension Tide gun and can be focused anywhere in the world. However, it has been untested from such a great distance� Meanwhile, the egg has begun to replicate in the stagnant sewer water, and soon there are thousands of the damned things� In the meantime, Tsujimori and the G-Graspers find Godzilla on his way to the mainland, and Tsujimori plants a tracer on Godzilla (while hitching a ride on him, no less!!!), making it easier for the G-Graspers to track him with the orbiting black hole gun. A young couple walk into a back alley and are devoured (very graphically for one of these movies!) by what appears to be a giant dragonfly larva. Then, for absolutely no reason, Tokyo is flooded (???), creating a perfect environment for these giant dragonflies to mature in. Presently, there is a swarm of them flying about in search of radioactive sustenance (I know they ate people, but what the hey?), and by swarm I mean thousands. And what better radioactive snack than a 400-foot tall guy in a rubber suit? Megaguirus proceeds to hand Godzilla the granddaddy of all ass-kickings in a scene which is truly painful to watch. This is without question the fight of Godzilla's career, with a climax that made me feel like I haven't felt since that day back in 1977 when I first saw Luke Skywalker blow the Death Star out of the sky. For once Godzilla really earns his victory. Trust me, Godzilla fans, this is the stuff. Once Megaguirus is dry-roasted, Godzilla falls victim to the Dimension Tide's black hole. Or does he? (Watch all the way through the credits for the answer to that question.) As is apparent from my synopsis, this movie doesn't make a whole lot of sense, even by the somewhat dubious standards of the Godzilla series. To that I say, \"who cares?\" This is one of the few times where I'm utterly willing to overlook such things, because this is the rare Godzilla flick where the story with the humans is actually interesting and lively. If you like this kind of stuff, definitely check it out! FINAL EL BUNCHO GRADE: A SOLID 9 OUT OF A POSSIBLE 10.",
         "...Hard to say. The original 1954 pre-Raymond Burr was always my favorite, but having had the privilige of seeing it a couple of weeks ago, I'm tempted to put this one at the top of my list. As good as GODZILLA 2000 was, this one definitely blows that out of the water; better acting, storyline and special effects, and more screen time for the Big G. The opening scene depicts Godzilla's 1954 attack on Tokyo, not as stock footage from the classic original, but a restaging of scenes done in newsreel style-very well done but all too brief. The action then shifts to the year 1966 as the monster attacks a nuclear power plant which, as the story goes, forces the Japanese government to outlaw nuclear energy. After yet another attack on another Japanese city, this time in 1996, a new weapon designed to create an artificial black hole is used against Godzilla with catastrophic results. During the initial testing, a horde of prehistoric insects is released, resulting in the creation of Megaguiris, a mutated dragonfly/scorpion creature. The battle scenes between Godzilla and Megaguiris are the finest I've ever seen in any Godzilla movie before or since ( then again, I've yet to see GMK ! ). Also the design of Megaguiris, while not totally original, works well here. One may even be reminded of the \"demon locusts\" from the Book of Revelation, hideous insect-like creatures with scorpion tails and wings. Whether or not this inspired the design of Megagurius is anyone's guess. Still, this is a much more worthy opponent than Orga from G2000. All in all, for my money GxM was a worthwhile moviegoing experience. And for those whose only exposure to Godzilla was the awful GODZILLA'S REVENGE or Centropolis's \"Fraudzilla\", give this one a chance. You'll be glad you did. Rating: ***** out of *****",
         "Just read all the IMDb reviews of this film (going back years!) so I'm going to confine my posting to things that HAVEN'T previously been mentioned by others. But to briefly recap: this movie is great fun, with a plot that adults as well as kids can find interesting. It definitely hearkens back to the early 1960s 'glory days' in both its epic feel, and its portrayal of Godzilla as a serious menace to humanity. But you got all that out of the other reviews. I'm surprised no one else has commented on some rather unique photography techniques used in the SPFX sequences of this picture. I have seen nearly all the Godzilla films, going back to 1954, with the exception of the very recent GMK and Final Wars. There are several things I found unique about GXM's photography vs nearly every other film in the franchise. This is the only time I have seen a sort of time-delay technique used in showing the monster. At some dramatic moments, the action inexplicably (and artfully) freezes for just a moment. At other times Godzilla's lumbering advance is shown with a surreal technique that makes his movements kind of jerky in a strobe-like effect. Rather than speeding up his movements (which would look ridiculous) this slows action into a 'flash-card' surrealistic style, like a film made with (for example) 12 separate image frames per second, rather than the usual 24. One thing I didn't care for as much, that is very abundant in this film, is a kind of unrealistic flight effect for Megaguiras. He hangs in the air as if suspended on strings (OK, he is suspended on strings, but they obviously filmed it to emphasize rather than lessen this effect) with wings moving too slowly to be convincing. I don't think this is a \"flaw\" so much as an intentional artistic choice, but for me it hearkens back to some of the lesser G-films of the 1970s. I prefer the more realistic flight techniques from RODAN (1956). But that is just a personal bias. Unrealistic effects do not equate to bad effects. Too many American reviews of kaiju films make that mistake. Unrealistic is often an artistic choice. The ending of the movie is also unique and artistic in its own way. No other film from the series ends quite like this, with the dialogue freezing midway through a human dialogue scene. It was a very interesting artistic choice and caught me by surprise. Like the director probably intended, it left me wanting to know what would happen a heartbeat later. But then the credits were rolling. The big G's suit looks good in this film and his presence is powerfully portrayed. If I had to quibble about anything, I would say that the face lacks animation in many closeups and tends more toward looking frozen and rubbery. Godzilla's face looked much more animated and 'alive' to me in films like 'VS Biolante' or the early 1990s \"VS King Ghidora\". There are a number of water effects sequences that look great in GXM. The flooded Tokyo streets, and the big G's spines surfacing out at sea, come immediately to mind. Great entry in the series!",
         "This is one of the best Godzilla movies ever!!! The first Millennium G-film I ever saw ( on Sci-Fi). It is a huge improvement over \"Godzilla 2000\" and in my opinion should've been released in American theaters instead. This movie gives the feeling of the classic Godzilla films, but at the same time still has that modern awe that is much better than in disappointing \"Godzilla 2000\". The characters are fantastic and deliver great performances. It was good to see Yuriko Hoshi return to the G-franchise, and Kirko and Kudo both kept the emotional side going with some actually funny humor. I LOVE the whole conspiracy idea with Sigiura, all thanks to the marvelous screenplay. We can understand the characters and why they do what they do, even Godzilla. Mazaaki Tezuka directs the film amazingly, and I love the opening scene with the original \"Gojira\" footage, but with the new Godzilla added to it. The plot was an excellent piece of writing by Wataru Mimura and Hiroshi Kashiwabara. Dimension Tide was a very cool new weapon that was nicely done. Kenji Suzuki's work is great and the flooded Tokyo is totally convincing. This leads to our spectacular monsters. Godzilla looks mostly the same but is much better characterized as the symbolic anti-hero. The nuclear message is a nice part of the story. Both the Meganulon and Meganula look incredible, and the metamorphism scenes look just as good. One of the film's best shots is when the whole side of a building is covered in Meganula, who metamorphize and begin to wreak havoc on Tokyo. Megaguirus is an excellent villain, much better than Orga. We finally see a true battle of speed and the battle between Godzilla and Megaguirus is one of the best ever!! Megaguirus' energy vacuum needle was a clever attack and the fight is interesting because the Monster King is forced to fight without his heat ray. Another nice touch is the 'camp' that fits in great during the final battle. The island battle with the swarm of Meganula was an excellent display of modern Toho effects at work and the action is superb in this film. The dramatic final climatic showdown between Godzilla and G-Graspers is a nice ending that ( stay tuned after the credits) gets even better! The film would be truly incomplete without Michuru Oshima's excellent score. All together this is one incredible G-film that I'm glad to have seen. If you haven't seen it, you definitely need to buy yourself a copy. Now!!",
         "An action heroine in this one surprisingly gets as much screen time as the big G, and her character surprisingly has as much depth as the G's wrinkles when he smiles. Of course, he never smiles. But the plot of the humans has received more attention than the big G's carnage for this one. It's basically the plot of the heroine of Gamera 3, but with more development. And, unlike the Gamera teenager, the heroine of Gojira vs Megagirasu does not wait for a monster egg to fall on her laps to go after the big G. She kicks ass big time! Don't worry Gojira fans, the movie's title is not Tom Boy kicks Gojira's ass, so you know who's the boss. And this one's got a trick up its sleeve too! I'm sure you'll all fall for it. This movie has nothing to do with Gojira 2000, if you couldn't stand that little brat and the journalist, or worse, the guy who's last wishes were GOJIRAAAAAAA. I won't say action girl in here does better than Jean Reno in the infamous Godzilla, but the monster she's fighting is more lovingly menacing. No raptor look-alikes running around here. Just the big G and her. The music also changed. Each movie in the new Gojira trilogy must have been made for different audiences. This one is for the wide movie-going female audience between the kids for whom they made Gojira 2000, and the otakus and die-hard fans for whom they've made Daikaiju Soukougeki.",
         "The Godzilla series came to a dramatic end with the death of Godzilla (after 22 films and 41 years) in GODZILLA VS. DESTROYER (spelled in the U.S. release as DESTOROYAH) in 1995. The survival of little Godzilla, grown up from Baby Godzilla in the two previous films, paved the way for a sequel. Instead, sequel plans were squelched by Sony's planned American version, which came out in 1998, and Toho Pictures instead produced a series of three new Mothra movies. After Godzilla fans expressed supreme disappointment with the Hollywood remake, Toho revived the franchise in Japan with GODZILLA 2000, which dispensed with all of the history and events of every Godzilla movie since the first one and was touted by Toho as a sequel to the very first Godzilla movie (1954). Some Godzilla fans bought this and some didn't, causing great debate over the film's merits or lack thereof. Leaving aside the issue of where the film fits in the Godzilla timeline, G2K still came up short in the areas of monster battles and urban destruction. MEGAGUIRUS is a half-hearted effort to keep the franchise alive until someone can come up with new ideas. It offers a bit more action and urban rampage than G2K and features a couple of no-nonsense women as the leading characters. It has no real relation to any other Godzilla movies and simply treats Godzilla as a monster menace who needs to be stopped at all costs. The military and government agencies charged with the task of stopping the Big G come up with a device called Dimension Tide that's designed to create a black hole that will presumably suck in Godzilla. In the course of testing it, they somehow create giant dragonflies which morph into an awkward, clunky, flying insectoid monster dubbed Megaguirus by some handy old male scientist whose only role in the film is to tell us this. Before the morphing, the dragonflies invade Tokyo, causing a devastating flood which inundates the Shibuya district. What causes the dragonflies to transform into the monster is never explained. G and MegaG eventually battle it out in Tokyo to great destructive effect. The human cast is, thankfully, rather small and they keep to their assigned roles efficiently, in contrast to the overbearing busybodies in G2K who kept getting into G's face (sometimes literally!). Interestingly, the two female lead characters, one an officer (Misato Tanaka) devoted to neutralizing Godzilla, and the other an older scientist (Yuriko Hoshi) overseeing the Dimension Tide project, dominate the action with their resolute behavior and forceful personalities. The actresses are quite good and one wishes they'd been given a little more to do with their characters (but not too much). While this film decidedly breaks no new ground, it does offer enough action and destruction to please the less discriminating Godzilla fans. Although its effects are not sophisticated enough for the jaded palates of today's JURASSIC PARK-weaned monster fans, the film's bursts of imagination might well surprise them."
      ],
      "genres": [
         "Action",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Toho Company"],
      "summaries": [
         "Godzilla returns to terrorize Japan! This time, however, Japan has two new weapons to defend themselves. The Gryphon, a high-tech ship, and the Dimension Tide, a device that creates artificial black holes! During a test of the Dimension Tide, eggs appear in the city of Shibuya and hatch into terrifying Meganurons! These creatures need water to grow and flood the city of Shibuya by breaking underground water veins. As they multiply and grow, they start to feed on the energy of humans. After gathering enough energy, they transform in to giant dragonfly monsters called Meganuras! And now they target Godzilla for energy to feed to the larva of their queen, which eventually hatches into the terrifying 60-meter Megaguirus who also begins to attack Godzilla for his energy. Now a 3-way battle between Godzilla, the Megaguirus, and humans begins! Will Godzilla win? Will humanity survive?",
         "When Japan's new Black Hole machine spawns a race of killer insects, they set their sights on Godzilla, collecting enough energy until, their queen, Megagurius, arises hell bent on becoming the dominant species, even if it means going up against Godzilla",
         "Japan creates an artificial black hole device to trap Godzilla forever, but a test of the device creates new foes for Godzilla, car-sized dragonflies called meganula and their queen, Megaguirus."
      ],
      "budget": 950000000
   },
   "movielensId": 105811,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2000-11-03",
      "dvdReleaseDate": null,
      "directors": ["Masaaki Tezuka"],
      "runtime": 105,
      "movieId": 105811,
      "title": "Godzilla vs. Megaguirus",
      "mpaa": "NR",
      "actors": [
         "Misato Tanaka",
         "Masatō Ibu",
         "Shosuke Tanihara",
         "Yuriko Hoshi",
         "Toshiyuki Nagashima",
         "Kouichi Yamadera",
         "Tsutomu Kitagawa",
         "Kôichi Ueda",
         "Yuusaku Yara"
      ],
      "imdbMovieId": "0255198",
      "originalTitle": "ゴジラ×メガギラス G消滅作戦",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Godzilla returns to terrorize Japan! This time, however, Japan has two new weapons to defend themselves. The Gryphon, a high-tech ship, and the Dimension Tide, a device that creates artificial black holes! During a test of the Dimension Tide, eggs appear in the city of Shibuya and hatch into terrifying Meganurons! These creatures need water to grow and flood the city of Shibuya by breaking underground water veins. As they multiply and grow, they start to feed on the energy of humans. After gathering enough energy, they transform in to giant dragonfly monsters called Meganuras! And now they target Godzilla for energy to feed to the larva of their queen, which eventually hatches into the terrifying 60-meter Megaguirus who also begins to attack Godzilla for his energy. Now a 3-way battle between Godzilla, the Megaguirus, and humans begins! Will Godzilla win? Will humanity survive?",
      "tmdbMovieId": 39468,
      "avgRating": 2.59615,
      "releaseYear": "2000",
      "numRatings": 26,
      "posterPath": "/ffgupHs4tQFo1cDCyT1zH9AfNrB.jpg"
   }
}