{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "snake",
            "id": 1585
         },
         {
            "name": "giant snake",
            "id": 3891
         },
         {
            "name": "cobra",
            "id": 191574
         }
      ],
      "imdb_id": "tt0047966",
      "video": false,
      "title": "Cult of the Cobra",
      "recommendations": [
         39311,
         35919,
         36456,
         59589,
         29324,
         84719,
         109109,
         41033,
         84234,
         99545,
         84230,
         3164,
         112481,
         51787,
         52840,
         59566,
         80720,
         98092,
         30345,
         91733
      ],
      "backdrop_path": "/6MopPjK7zwWh5Q5Y1ulxVXDYROu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lisa Moya",
               "gender": 1,
               "credit_id": "52fe45bd9251416c9103cc37",
               "name": "Faith Domergue",
               "profile_path": "/aKtclDdmAcUuBsD3CqeSFqVpFfK.jpg",
               "id": 85740,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paul Able",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc3b",
               "name": "Richard Long",
               "profile_path": "/8DDSKe894Otlz2HiTvhlhA5Xqir.jpg",
               "id": 78852,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tom Markel",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc3f",
               "name": "Marshall Thompson",
               "profile_path": "/1VmHSu2Xrlqpe25mfQdGNygAlRN.jpg",
               "id": 84233,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Julia Thompson",
               "gender": 1,
               "credit_id": "52fe45bd9251416c9103cc43",
               "name": "Kathleen Hughes",
               "profile_path": "/7n9BWIvHskTONRrfQsAf3dChzhr.jpg",
               "id": 114956,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Pete Norton",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc47",
               "name": "William Reynolds",
               "profile_path": "/lEktGYizRyyo6BO8HSLgdCyXVOc.jpg",
               "id": 114957,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Carl Turner",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc4b",
               "name": "Jack Kelly",
               "profile_path": "/qdXr1rTYuHJ2Gcds762Hyqq3A4O.jpg",
               "id": 12311,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Marian Sheehan",
               "gender": 1,
               "credit_id": "52fe45bd9251416c9103cc4f",
               "name": "Myrna Hansen",
               "profile_path": null,
               "id": 94033,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rico Nardi",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc53",
               "name": "David Janssen",
               "profile_path": "/xJTcnw9X76FWkfB596qR2dIUOp7.jpg",
               "id": 51377,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Daru",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc57",
               "name": "Leonard Strong",
               "profile_path": "/c4w7CzUtElSEt4hdQ94vod52MoH.jpg",
               "id": 30514,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Cpl. Nick Hommel",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc5b",
               "name": "James Dobson",
               "profile_path": null,
               "id": 114958,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Police Inspector",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc5f",
               "name": "Walter Coy",
               "profile_path": "/scEs3MMVJA05wpbfOcQ5n5jAZdr.jpg",
               "id": 30557,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Major Martin Fielding",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc6b",
               "name": "Olan Soule",
               "profile_path": "/l1pU68suGKtjeZxPwjBsGdQloAq.jpg",
               "id": 114961,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Mrs. Webber",
               "gender": 0,
               "credit_id": "52fe45bd9251416c9103cc6f",
               "name": "Helen Wallace",
               "profile_path": "/cLgm1zgZ5SbNyEZ9i74eySFgdZm.jpg",
               "id": 114962,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Lamian threatening death",
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cca3",
               "name": "Edward Platt",
               "profile_path": "/3ZEEg2FwYjDxJVzNU4nR03l0K2h.jpg",
               "id": 2646,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc75",
               "name": "Francis D. Lyon",
               "profile_path": null,
               "id": 29324,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc7b",
               "name": "Jerry Davis",
               "profile_path": null,
               "id": 60679,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc93",
               "name": "Howard Pine",
               "profile_path": null,
               "id": 114964,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc99",
               "name": "Russell Metty",
               "profile_path": null,
               "id": 13809,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45bd9251416c9103cc9f",
               "name": "Milton Carruth",
               "profile_path": null,
               "id": 1552,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55eec3f892514106d6011b9b",
               "name": "Cecil Maiden",
               "profile_path": null,
               "id": 114963,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55eec40ac3a3682c62019d7f",
               "name": "Richard Collins",
               "profile_path": null,
               "id": 69812,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55eec3e9c3a3682c6b01817f",
               "name": "Jerry Davis",
               "profile_path": null,
               "id": 1470237,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55eec421c3a3682c62019d86",
               "name": "Alexander Golitzen",
               "profile_path": null,
               "id": 12346,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55eec42e9251413e3e019f3f",
               "name": "John Meehan",
               "profile_path": null,
               "id": 8623,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55eec7a09251413e45018d89",
               "name": "Irving Gertz",
               "profile_path": null,
               "id": 103356,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55eec7ab92514106d6011c5c",
               "name": "William Lava",
               "profile_path": "/bj6jr8LoKuPgN5YxIRJDhZjvVp0.jpg",
               "id": 30681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55eec7b79251413e41018c87",
               "name": "Lou Maury",
               "profile_path": null,
               "id": 1486062,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "55eec7c3c3a368090c0090bd",
               "name": "Stanley Wilson",
               "profile_path": null,
               "id": 120261,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.514086,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35911,
      "vote_count": 10,
      "budget": 0,
      "overview": "While stationed in Asia, six American G.I.'s witness the secret ritual of Lamians (worshipers of women who can change into serpents). When discovered by the cult, the High Lamian Priest vows that \"the Cobra Goddess will avenge herself\". Once back in the United States, a mysterious woman enters into their lives and accidents begin to happen. The shadow of a cobra is seen just before each death.",
      "similar": [
         98106,
         44548,
         4011,
         11471,
         7555,
         9502,
         72559,
         672,
         314095,
         278927,
         14869,
         11237,
         1911,
         9360,
         65851,
         423453,
         157847,
         103731,
         326,
         425591
      ],
      "original_title": "Cult of the Cobra",
      "runtime": 82,
      "poster_path": "/kdGhrtYptjMRkm9VfapNMl6bRMc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
         "name": "Universal International Pictures",
         "id": 10330,
         "origin_country": ""
      }],
      "release_date": "1955-05-30",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Can a woman's beauty be changed to a thing of terror?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Francis D. Lyon"],
      "runtime": 82,
      "synopsis": "The movie opens with title and credits over an Indian shrine to the cobra with flanking burning lamps. We are told the time is 1945 and the place is Asia. A group of G.I.s are wandering around an Indian bazaar. Paul Able (Richard Long) and Pete Norton (William Reynolds) are at a table selling cloth. Pete asks Tom Markel (Marshall Thompson) what he thinks of the cloth. Rico Nardi (David Janssen) directs the men's attention to a snake charmer. Nick Hommel (James Dobson) and Carl Turner (Jack Kelly) join the others around a basket. They take a few pictures then talk to the snake charmer, Daru (Leonard Strong). For $2 he agrees to hold the snake. Paul asks about a cult that believes snakes can be transformed into humans. Daru is visibly surprised. One man says he'd give anything to see it. This piques Daru's interest. He tells the men that he is a Lamian and for $100 he will show them, \"she who is a snake, and yet a woman.\" They make arrangements to see the ceremony that evening, but Daru warns them that pictures are forbidden. The men meet and get reasonably drunk. Daru shows up as promised. He gets them past the guards. They are dressed like locals. He warns them that if they are discovered they will be killed. They enter a large curtain lined room. On a raised platform there is a stone shrine and a large basket. They discover Nick is missing from the group. A dancer performs a ritual and out of the basket a woman emerges and dances. The ritual includes the snake woman biting and killing a man. Against orders, Nick takes a picture; his flash angers the assembled men. Nick is attacked. The other five men start a fight as Nick grabs the basket and makes his way to the exit. One of the Lamians (Edward Platt) tells them, \"The Cobra Goddess will avenge herself. One by one you will die!\" Just prior to exiting, Tom sets the curtains on fire to create a diversion. Daru is killed by the mob. The five men escape in the jeep, but Nick is still missing. They spot a woman walking away from the basket and discover Nick on the ground. Tom chases the woman but she escapes. Nick is still alive, but they discover a snake bite on his neck. Tom performs a hasty snake bite remedy to remove most of the venom. Carl, Rico and Pete carry Nick to the jeep. Tom tells Paul, \"Lets get out of here.\" They return to the base. They are supposed to ship out the next morning. Nick Hommel is in a hospital bed surrounded by his buddies. He tells the men he wanted the basket as a souvenir. The nurse (Mary Alan Hokanson) arrives to take Nick's temperature and asks the men to leave. She adjusts the window down a bit to keep out the rain. Outside a cobra works its way towards the building. It enters Nicks room. He sees it and screams, but a clap of thunder muffles his cry. The next morning Major Martin Fielding (Olan Soule) tells Paul Able that Nick died early in the morning. He succumbed to neurotoxic venom that paralyzed his heart. After Paul leaves to catch his transport home, Fielding explains to Capt. Steve Williams (Alan Reynolds) that he is puzzled also. Most of the venom was removed from Nick before he was admitted to the hospital, but by morning he had been re-infected. The body was loaded with cobra venom. The men fly home on a DC-3. They discuss their post-military lives. Rico will be running his Dad's bowling alley. All the men are discharged from the military and begin their civilian lives. On the streets of New York City, Paul Able and his fiancé, Julia Thompson (Kathleen Hughes) have come to see Rico Nardi at the bowling alley. She tells Tom she is going to marry Paul. She still needs to tell Rico. Tom is initially angry and disappointed and tells Rico the good news before Julia has the chance. She had been dating Tom and Rico before she got serious with Paul. Tom and Paul are roommates. In his apartment, Tom's dog is restless and wakes him in the middle of the night. He goes to the kitchen and hears a woman scream. He exits his apartment and forces the door to the apartment across from his. He finds Lisa Moya (Faith Domergue) against the wall sobbing. She tells Tom there was a man in her apartment. Tom checks the apartment, finds no one, then picks up the phone to call the police. Lisa tells him no, no police. She tells him to stay a while. She explains that she just moved into the apartment today and has only been in the city a week. He tells her he is a commercial artist--advertising. They agree to a date the next day to see the city. They meet the next day and visit some of the sights in the city: Staten Island Ferry, the Statue of Liberty, Wall Street and the Fulton Fish Market. They stop at a hot dog stand for lunch. That evening they return home, but she rebuffs his advance to kiss her. Tom introduces Lisa to his roommate, Paul and the dog freaks out. She sees a picture and picks it up. It is a picture of the six men taken when they were deployed in Asia. Tom explains who and where everyone is now. They agree to meet on Sunday at Carl's apartment; he is having a party. No sooner is she back in her apartment, but she gets her coat and leaves. She walks along the street and encounters a cat that screeches at her and runs away. It is apparent she just doesn't have a way with animals, any animals. At Rico's bowling alley, Carl and Pete, who are also roommates, pay their tab and leave. Rico is closing up the place when Lisa arrives outside. A bowling pin falls over and Rico investigates. He carries a case of beer out to his car for Carl's party. Mrs. Webber (Helen Wallace) asks for a donation for a charitable organization. Rico heads back inside to close up. He grabs his coat, locks the door and gets in his car. He drives off, whistling, sees the cobra in the rear view mirror, panics and runs his car off the street. He rolls the car and is killed instantly. Lisa walks back to her apartment. The remaining four men and Lisa attend Rico's funeral. Carl decides to have the party on Sunday. As Tom and Paul walk with Lisa back home a horse freaks out at her presence. She tells Paul she's always been afraid of horses. Paul is beginning to believe Lisa is not who she claims to be and is increasingly worried about her influence over Tom. He is starting to believe the curse is real and they are all destined to be killed. At Carl's party, Lisa is dancing with the host. Tom is jealous. At one point he slugs Carl and tells Lisa to get her coat, they're leaving. Paul tells Carl, \"I'm sure she's no good for him.\" Paul meets Julia after she returns from her show out of town. She is back in New York rehearsing--she is an actress. Paul asks her to talk to Tom. He admits he's afraid of Lisa. It has to do with Rico's death. He doesn't think it was an accident. He tells her about the cult story. He thinks Lisa is involved. Tom returns from his date with Lisa at Carl's party. They talk and he tells her he loves her. She leaves and returns to her own apartment. He checks on the dog. Tom notices that Lisa forgot her gloves. He tries to return them. He knocks on her door, but she doesn't answer. He uses the key he borrowed earlier to get some ice and lets himself in. He discovers she isn't there. He sits and has a smoke and waits for her. The party is over at Carl's and everyone is leaving. Pete leaves with Marian Sheehan (Myrna Hansen) his date for the evening. Carl set them up. He is going to take her home, then return. They leave the building. Lisa sees them and hides, and then enters the building. She knocks on Carl's door; he invites her in. She tells him she wanted to apologize for spoiling the party. She tells him she really came back to see him. Carl goes into the kitchen to mix some drinks, but when he returns to the living room Lisa is gone. He goes over to a chair and sees the cobra. He strikes it with a plaster vase, but it bites him and he falls over a railing and down to his death on the sidewalk. Pete returns and finds a crowd gathered around Carl's body. Lisa joins the crowd and Pete warns her not to look. The police arrive and ask if anyone knows the deceased. Pete volunteers that he and Carl were roommates. The police ask Pete to come with them. Lisa returns home to find Tom sleeping on her couch. They talk about their relationship. She voices her concern about hurting him. The next morning Paul makes breakfast for him and Tom. They talk. He tells Tom he and Julia are going down for their marriage license. The telephone rings; its the police asking about Carl. They want to see both Paul and Tom immediately. Paul tells them they will be right down. Pete Norton's blood is checked for type. The Police Inspector (Walter Coy) tells the lab tech when Paul and Tom arrive he wants their blood typed as well. The Inspector interrogates Pete then releases him. Julia is at Tom and Paul's apartment reading up on cults. Lisa stops by for her usual breakfast coffee and inquires about Tom and Paul. Julia tells her they are at the police station. Julia tells Lisa about Paul's recent fascination with cults and cobras. She tells Lisa that there are people that believe they can turn into snakes. Lisa responds strangely. Julia adds that Paul fells that is why Rico, Carl and Nick are dead. Julia hastily departs after paying the dry cleaner for some shirts delivered. The Police Inspector interrogates Tom and Paul. They are released to go when the blood tests reveal they were not involved directly in Carl's death. Before he leaves, Paul volunteers the cult story. Paul accuses Lisa of being an agent for the curse. Tom storms off. Back at Lisa's apartment, Pete Norton confronts Lisa over a scratch on her arm. He believes it came from the vase Carl threw at the cobra. He accuses her of being a Lamian. She goes to her bedroom under the pretense of getting her passport to prove she was elsewhere when Nick was killed in India. There we see her, in shadow, transform into a cobra. She leaves her apartment and collects Tom at his. They sit and have coffee. They are formally dressed for Julia's Broadway show that evening. The Police Inspector tells Paul that, working on his story, they checked the autopsy reports on Carl Turner and Rico Nardi. It was death by snake venom, a large one. He agrees to pick up Lisa for questioning. The police force the door on Lisa's apartment and find Pete's body. He has two puncture wounds on his neck. Paul calls the Theatre to talk to Tom. Lisa goes up to Julia's dressing room looking for Paul. Paul tells Tom they found Pete dead in Lisa's apartment. The police leave Lisa's apartment and drive over to the Theatre. Julia returns to her dressing room while Tom notices Lisa is missing from her box seat. A door slowly opens and Julia notices the cobra on the floor. She screams. Tom enters her dressing room and is confronted by the snake. He throws a costume over it. He breaks a window with a chair and using a coat rack pushes the cobra out the window. When the police arrive we see the cobra transform back into Lisa, dead on the street below the window. A crowd gathers. We close with an anguished Tom walking away down the street. Cast credits roll.",
      "writers": [
         "Jerry Davis",
         "Jerry Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047966/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMTE2ODQ1MV5BMl5BanBnXkFtZTcwOTIxMDcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Faith Domergue, Richard Long, Marshall Thompson | See full cast and crew »"],
      "reviews": [
         "Set in 1945, six American GIs crash a snake-worshipping cult, and are threatened to be killed, one by one, for their misdeeds. The setup is a bit long (about 15 minutes), but once they get back to New York City, the excitement begins. Faith Domergue is amazingly beautiful, and most alluring, as a faux Asian \"Cobra Woman\", an instrument of death. Despite his third billing in the film, Marshall Thompson is her co-star, giving a strong performance as the GI who falls for her, and proves her ruin. He and the rest of the cast, Richard Long, William Reynolds, Jack Kelly and David Janssen, became more successful as television stars. Kathleen Hughes is also on hand as a pretty blonde love interest. Not much is made to recreate the era, it's definitely 1955, via the clothes, makeup, hairstyles, etc. And when Domergue is transformed back to a human, she's fully clothed! But as in most of Universal-International's decade of sci-fi/horror classics, which hold up better (and are re-shown on Cable and released to DVD/video) than their other output, save a few Douglas Sirk dramas, it's well-written, photographed, scored, paced and acted.",
         "American G.I.'s who trespass in on a forbidden Hindu ceremony are relentlessly hunted down by a beautiful woman who has the power to metamorphose into a snake. While the film gets a bit slow in the middle, the end is exciting and so is the beginning. What made this film great, for me, was the talented snake dancer from the cult. Her face is obscured, but her body is capable of amazing bends and twists. One of the only really big drawbacks to the film is that the audience knows what is going on from the very beginning. We see the men try to solve a mystery we already know. The urge to yell \"you are so stupid\" is hard to suppress. And they really are not that stupid -- they simply have not reached the illogical conclusion we already know to be true.",
         "I really like this movie, but most reviews that I see seem to trash it. It has an excellent cast of B movie stars, who are probably trying at this time to get recognition. They are Faith Domergue, Richard Long, David Janssen, Jack Kelly and Marshall Thompson. Here is a quick synopsis of the movie: Stationed in Asia, six American G.I.'s witness the secret ritual of Lamians (worshipers of women who change into serpents). When discovered by the cult, the High Lamain Priest vows that the Cobra Goodess will avenge herself. Once back in the U.S., a mysterious woman enters into their lives and accidents begin to happen. The shadow of a cobra is seen before each death.",
         "On paper, this was arguably the least promising entry among Universal's second exclusive \"Sci-Fi Collection\" � but it turned out to be quite enjoyable in its unassumingly campy way, lying somewhere between the exotic fancy of Universal's earlier COBRA WOMAN (1944) and the cautionary Gothic of Hammer's THE REPTILE (1966). Director Lyon generally cut his teeth on a variety of Western oaters and, while not exactly inspired by the material at hand, elicits a very good performance from his leading lady Faith Domergue � a former protégée' of the legendary Howard Hughes. The story starts at the tail-end of WWII where six G.I. buddies, looking for some kicks before leaving Asia for home, attend a clandestine ceremony held by the titular sect where no reptiles are actually worshipped � instead we have a woman painted like one who comes out of a large vase and crawls around on the floor! Suspicious Richard Long, embittered (and incredulous) Marshall Thompson and a carefree David Janssen comprise half of the band of infidels who incite the wrath of the cultists by their irreverent presence (foolishly, one of them photo-graphs the ceremony, even if he had been repeatedly warned beforehand not to); needless to say, the proverbial curse is invoked on them by the High Priest which is subsequently enforced when they return to the United States. In quick succession, four of them get offed (including bowling alley owner Janssen who expires in a fairly spectacular car crash) after having a close encounter with a cobra; their demise coincides with Thompson's meeting with his sensuous but enigmatic neighbor Domergue. There are virtually no transformation scenes (or, rather, only in silhouette and via a quick dissolve to boot!) and we only get a good look at the large cobra during its last attack backstage in a theater, where it eventually receives its come-uppance by being pushed out a high window by Thompson (for whom the conflicted Domergue actually almost jeopardized her mission!)...and which is just as well, since there is no creature on earth that I loathe or fear more! Incidentally, I was somewhat bugged by the fact that when the dead snake inevitably regains human form, it is unaccountably dressed in the black gown Domergue wore prior to her demise!",
         "What's the first behavior rule when you're visiting a faraway continent � particularly Asia, Africa or South America � that culturally speaking differs a lot from your own? Duh, don't interfere with local religious movements and/or voodoo cults, because they WILL come after you and they WILL find you, even when you consider yourself to be safe back home again. \"Cult of the Cobra\" is a charming and fairly entertaining 50's occult thriller, but it's certainly nothing special or unique. In fact, the plot is quite derivative of the Jacques Tourneur/Val Lewton classic \"Cat People\" (undeniably one of the greatest horror milestones ever made), since both stories revolve gorgeous women living with the ability � or is it curse? � to transform into a deadly animal. Six American members of the same Air Force unit spend a few touristy days in an Asian country (my best guess would be either India or Malaysia) and bluntly pay a snake charmer big money to secretly attend a gathering of the infamous Lamian cult, of which the members supposedly change themselves in snakes and back. Naturally they get caught, when the dumbest boy of them all takes a photograph, and only narrowly escape. Unaware they've been placed under a curse, the six friends start being killed off one by one when back in the United State. Moreover, the mysterious accidents began simultaneously with Tom acquaintance with an introvert exotic beauty living across the hall. \"Cult of the Cobra\" benefits the most from Faith Domergue's performance as the oddly seductive Lisa (she's a lot better here than she was in \"This Island Earth\" or \"It Came from beneath the Sea\") and a couple of imaginative camera gimmicks, like for example snake POV shots and nice use of shadow effects. Unfortunately, there are also several overlong and tedious scenes and not a single one of the male protagonists deserves any of your sympathy. Especially Tom is a pretty loathsome guy, since his behavior is obtrusive and aggressive towards women and jealous towards his own friends.",
         "I had alway wanted to see this, having grown up watching all of the 50's SF films. This one had a cast of people I had grown up with in those SF films. I was not disappointed. The plot is slight, but well done. The 50's were not a decade for whodunits. It's pretty obvious who the killer is before the guys even leave Asia. Faith is a beautiful woman, and rarely has she been prettier than here. A little more meat on the script would have made this a better remembered film. The story is straightforward, with little in the way of subtlety. This was the same studio that made Tarantula and The Deadly Mantis. Both of those films were better than this, yet they had the same cookie-cutter feel to them. I put it up to the need to have new films in the drive-ins every week. All the studios suffered from this by the late 50's, with originality going out the window. Overall, I would give it a 6 out of 10. Good, but it could have been better considering the talented cast they had. ------------------------------------------------------------------- Since there is no way to add a Goof to this film, I'll put it here. WARNING: Spoiler ahead. In the scene where David Janssen is killed at the bowling alley, he walks by a wall calendar several times. It is the 5th of the month when he walks past it the first time. The next time he goes by it is the 6th of the month. The date changes twice more between the 5th and 6th as David goes about his business.",
         "Six American GI's stationed in Asia find themselves in considerable jeopardy after they witness a secret ceremony by a Hindu cult who worship snakes. Lovely and charming snake goddess Lisa Moya (well played and perfectly embodied by the beautiful and beguiling Faith Domergue), who has the ability to transform into a lethal serpent, goes to America and starts picking the guys off one by one. Director Frances D. Lyon, working from a compact and engrossing script by Jerry Davis, Cecil Maiden, and Richard Collins, relates the absorbing story at a steady pace, offers a neat evocation of the foreign land setting in the opening third, and builds a good deal of tension and spooky atmosphere. The solid acting from a capable cast helps a lot: Richard Long as the affable Paul Able, Marshall Thompson as the decent and likable Tom Markel, Kathleen Hughes as the sweet Julia Thompson, William Reynolds as nice guy Pete Norton, Jack Kelly as smooth womanizer Carl Turner, and David Janssen as the happy-go-lucky Rico Nardi. Moreover, there are a few cool little touches such as animals all being scared or freaked out by Lisa's presence and Lisa feeling conflicted by what she has to do. The actors playing the GI's display a pleasantly relaxed and natural chemistry and hence make for engaging protagonists. Russell Metty's handsome black and white cinematography boasts several funky cobra POV shots. The shuddery and spirited score by Irving Getz, William Lava, and Lou Maury hits the spine-tingling spot. A worthwhile movie.",
         "This off-beat horror flick is cheesier than those bargain nachos. Big thrill during the Drive-In Movie era. While stationed in Asia,six Air Force buddies sneak into a secret ceremony where cobras are worshiped. After their presence is discovered, a high priest puts a curse on the men. After returning to the states, the group of friends more or less laugh off the curse. Things get suspicious after the arrival of a vengeful priestess, Lisa Moya(Faith Domerue), who moves into an apartment right across the hall from one of the Air Force buddies Tom Markel(Marshall Thompson). Tom is on the rebound after his girl jilted him for one of his buddies. Here is the opportunity to spend time with attractive and too available Lisa . Mysteriously the airmen start dying one by one. Shadows of a cobra and snake venom are involved with each death. Oooooh! Cast includes: Kathleen Hughes, Richard Long, William Reynolds, Jack Kelly, Myrna Hansen and David Janssen.",
         "Francis D. Lyon directed this horror tale that begins after WWII ends, where six American G.I.s,(among them Richard Long, Marshall Thompson, and David Janssen) stationed in Asia sneak into the secret ceremonies of a cult of snake worshipers, where they see a snake turn into a woman(or so it seems) they are discovered but escape, though the cult leader curses them with their avenging snake goddess. When one of them dies shortly later from a snake bite, they dismiss it as coincidence, but when they return home, and more start dying, it's obvious that something followed them home. Could it be attractive newcomer Lisa(played by Faith Domergue)? Interesting premise mishandled in failed thriller. No attempt is made to recreate a post-war feel, and even worse, Faith Domergue is far too human to be believed as anything else, though the acting is otherwise fine.",
         "Six army buddies decide to do some sight-seeing among a cult of shape-shifters when they should have stayed in the bar and had a few more beers. The movie's not as bad as the title suggests, thanks mainly to enthusiastic performances from Thompson, Kelly, and Long. You might expect them to walk through their parts in a low budgeter like this, but they don't. Instead they inject needed vitality into the far-fetched premise. Now, if Domergue could just suggest some menace in an otherwise deadpan performance as the snake lady, we might get a hint of a coming shape-shift. No wonder director Lyon has to use a pin light on her expressionless face to indicate she's no lady after all. The bowling alley sequence is the movie's only scary part. Too bad Lyon doesn't play up the suspense in the other stalking sequences. Instead, we go from snake shadow to dead body, leaving out the scary part. Then too, I wish they had more than one staircase street set. If I catch this flick again, I'll try counting the times they use and re-use it. In my book, the movie isn't bad enough to make it as camp. Instead, it's a not-very-good horror flick, mainly because of Domergue. But at least the guys went on to starring success with TV."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Universal International Pictures (UI)"],
      "summaries": [
         "While stationed in Asia, six American G.I.'s witness the secret ritual of Lamians (worshipers of women who can change into serpents). When discovered by the cult, the High Lamian Priest vows that \"the Cobra Goddess will avenge herself\". Once back in the United States, a mysterious woman enters into their lives and accidents begin to happen. The shadow of a cobra is seen just before each death.",
         "American G.I.s who trespass on a Hindu ceremony are hunted down by a beautiful woman who has the power to transform herself into a cobra."
      ],
      "budget": 0
   },
   "movielensId": 105821,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-05-30",
      "dvdReleaseDate": null,
      "directors": ["Francis D. Lyon"],
      "runtime": 82,
      "movieId": 105821,
      "title": "Cult of the Cobra",
      "mpaa": "",
      "actors": [
         "Faith Domergue",
         "Richard Long",
         "Marshall Thompson",
         "Kathleen Hughes",
         "William Reynolds",
         "Jack Kelly",
         "Myrna Hansen",
         "David Janssen",
         "Leonard Strong",
         "James Dobson",
         "Walter Coy",
         "Olan Soule",
         "Helen Wallace",
         "Edward Platt"
      ],
      "imdbMovieId": "0047966",
      "originalTitle": "Cult of the Cobra",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["nfZyon_K4dg"],
      "plotSummary": "While stationed in Asia, six American G.I.'s witness the secret ritual of Lamians (worshipers of women who can change into serpents). When discovered by the cult, the High Lamian Priest vows that \"the Cobra Goddess will avenge herself\". Once back in the United States, a mysterious woman enters into their lives and accidents begin to happen. The shadow of a cobra is seen just before each death.",
      "tmdbMovieId": 35911,
      "avgRating": 3.375,
      "releaseYear": "1955",
      "numRatings": 4,
      "posterPath": "/kdGhrtYptjMRkm9VfapNMl6bRMc.jpg"
   }
}