{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "kaiju",
            "id": 161791
         },
         {
            "name": "space monster",
            "id": 172136
         }
      ],
      "imdb_id": "tt0065776",
      "video": false,
      "title": "Space Amoeba",
      "recommendations": [],
      "backdrop_path": "/edQ1KeQ5DWjreId97EZK9GD8ImA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Taro Kudo",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a6b3",
               "name": "Akira Kubo",
               "profile_path": "/twe3lU2nP2sVphNgpQ1JySEpdGr.jpg",
               "id": 30469,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Dr. Kyoichi Mida",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a6c9",
               "name": "Yoshio Tsuchiya",
               "profile_path": "/mU0dJP8dZxSucRTung1mZmL2TDh.jpg",
               "id": 17540,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ayako Hoshino",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6bd",
               "name": "Atsuko Takahashi",
               "profile_path": null,
               "id": 1117079,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Makoto Obata",
               "gender": 2,
               "credit_id": "52fe46a09251416c9105a6c5",
               "name": "Kenji Sahara",
               "profile_path": "/544eLJEuliVTsxQ27DGCSSh99bV.jpg",
               "id": 18613,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Rico, the guide",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6d1",
               "name": "Noritake Saito",
               "profile_path": null,
               "id": 1117080,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Yokoyama, an agent",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6dd",
               "name": "Chôtarô Tôgin",
               "profile_path": "/t6rhfy9hVKl9jx8PNrfY1pKGCV5.jpg",
               "id": 30474,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Chieftain Ombo",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6e5",
               "name": "Tetsu Nakamura",
               "profile_path": null,
               "id": 121193,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Saki, native girl",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6c1",
               "name": "Yukiko Kobayashi",
               "profile_path": "/sWiVN7tj7lEXl9v4M3nwliGqKLL.jpg",
               "id": 30471,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Promotion Division Manager",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6cd",
               "name": "Yû Fujiki",
               "profile_path": "/am1RppKjEZV8mw216UtAIRblLwe.jpg",
               "id": 144797,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "The Editor",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6d9",
               "name": "Sachio Sakai",
               "profile_path": "/5b6g3ZHfSXxfNgInvwz44lUv43I.jpg",
               "id": 108026,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sakura",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6e1",
               "name": "Wataru Ômae",
               "profile_path": "/7fvtaP6157lROlkBTwEgdarAB1R.jpg",
               "id": 235720,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Islander",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6e9",
               "name": "Yukihiko Gondô",
               "profile_path": null,
               "id": 235718,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Islander",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6ed",
               "name": "Shigeo Katô",
               "profile_path": null,
               "id": 1117087,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Islander",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6f1",
               "name": "Rinsaku Ogata",
               "profile_path": null,
               "id": 552182,
               "order": 13
            },
            {
               "cast_id": 10,
               "character": "Stewardess",
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6d5",
               "name": "Yûko Sugihara",
               "profile_path": null,
               "id": 1117081,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Gezora/Ganimes",
               "gender": 2,
               "credit_id": "55aafc219251411e06006471",
               "name": "Haruo Nakajima",
               "profile_path": "/u5CbtBOHgp3k7pJY20ZJ8ZW17sc.jpg",
               "id": 235722,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Kamoebas",
               "gender": 0,
               "credit_id": "55aafc359251411e1800615e",
               "name": "Haruyoshi Nakamura",
               "profile_path": null,
               "id": 1488353,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6af",
               "name": "Ishirô Honda",
               "profile_path": "/4B0Q9uj7nCxmGgnmyh9QYhDrxF.jpg",
               "id": 18598,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a09251416c9105a6b9",
               "name": "Ei Ogawa",
               "profile_path": null,
               "id": 1044263,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 0.961815,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 38221,
      "vote_count": 2,
      "budget": 0,
      "overview": "When a space probe crash-lands on a far-flung Pacific atoll, the craft's alien stowaways decide to take over their new world one creature at a time. Soon, the parasitic life forms latch onto three indigenous critters -- a squid, a crab and a snapping turtle -- and transform them into colossal mutant monsters.",
      "similar": [
         15766,
         15767,
         19545,
         124905,
         39256,
         1682,
         7191,
         929,
         373571,
         5876,
         68726,
         293167,
         268896,
         15092,
         620,
         1680,
         315011,
         1678,
         6593,
         3107
      ],
      "original_title": "Gezora, Ganime, Kameba: Kessen! Nankai no daikaijû",
      "runtime": 84,
      "poster_path": "/3tYRB7NPykoLGfZaWSGf6lVokuK.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": "/lYCOp17DBEjFD1UygdRor98PVWR.png",
         "name": "Toho Company",
         "id": 882,
         "origin_country": "JP"
      }],
      "release_date": "1970-08-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Hideous creatures from outer space advance to invade the earth!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ishirô Honda"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Ei Ogawa"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0065776/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0NjgzMjE5MF5BMl5BanBnXkFtZTYwNjMzMjg5._V1_.jpg",
      "actors": ["Stars: Akira Kubo, Atsuko Takahashi, Yukiko Kobayashi | See full cast and crew »"],
      "reviews": [
         "The enjoyment that you derive out of this movie is directly proportional to what your expectations are. I'm a big fan of Honda's work, he's made some of the very best giant monster (not just limited to Japanese kaiju) movies ever made - this is not one of them. It's really pretty bad - not Jun Fukuda bad, mind you, but in the world of Ishiro Honda's works it's quite the stinker. And yet... It's somehow great. What makes it truly great can essentially be summed up in one word. Gezora. Gezora is a giant squid, or an octopus, or perhaps a cuttlefish, or... It really doesn't matter what Gezora is supposed to be, just know that (unlike the giant octopus from \"King Kong vs. Godzilla\") Gezora is not a slimy creature that flutters and unfurls itself along the ground like an octopus probably would if it could actually move outside of the water. No, my friends, Gezora is rubbery looking and he walks. Let's say that again so that the utter ridiculousness of it can sink in: Gezora WALKS. On tentacles. You see, they didn't have access to high-tech animatronics and kaiju films have always had an aversion to stop-motion animation, so, as was custom - it's a guy in a suit. But how does a guy in a suit impersonate the flowing movement of an octopus/squid/cuttlefish on land, you ask? He doesn't. He walks around, dragging and swinging tentacles with reckless abandon. That, if for no other reason, is why this movie must be seen to be appreciated. Gezora is, by far, my favorite bad kaiju. Yes, even better and far more ridiculous than King Seesar. This may be difficult to believe, but he's even sillier (and more lovable) than Guiron - knife-headed foe of Gamera. You, too, will love Gezora if you just give him a chance - and that chance has arrived as of today, for \"Space Amoeba\" has been released on DVD. Huzzah!",
         "This is another alien-invasion movie from Toho studios. It features space alien (s) that invaded a tropical island, where it mutates a squid, crab, and turtle to the size of Godzilla. The aliens' main purpose: to conquer Earth. We have a group of explorers visiting an island to investigate the whereabouts of a lost space probe. There, they encounter the alien monsters, and try to stop them, with the help of some very courageous island natives. The hero of the film is portrayed by Akira Kubo. He has been portraying so many heroic roles by the time he filmed this movie that him being type-casted started to get annoying. Aside from that, we have monsters that were surprisingly very campy and rubber-ish looking. Overall, an OK kaiju film that should have featured more monsters, providing that the aliens mentioned that they were trying to mutate a lot of animals to attack Earth. The film contains a pretty exciting \"rescue-the-earth\" mission, nonetheless. Grade B",
         "For some reason, I remembered this flick more than many other kaiju eiga (giant monster movies) from the same period. In fact, I even have an original \"Yog\" poster on my wall right next to one for \"The Green Slime\". The film is set on a remote tropical island that is being looked at as the possible home of a luxury tourist resort. Funky photographer Kudo (wearing a floppy hat) and his adorable female companion are there to take pictures and check in with some other company personnel on the island. Dr. Mida is there to study marine evolution. And then there is the suspicious acting Obata, who claims to be an anthropologist but is actually an industrial spy. There is another visitor to the island and this one came from a lot farther than Tokyo. The misty blue space creature Yog (an \"astro-quasar\" he is called) has fallen to Earth on a space capsule and is now busy turning harmless animals into giant monsters. First of these fearsome freaks is the weird octo-squid Gezora, a plastic-eyed giant that uses its tentacles to walk (stagger is a better word) on land! Gezora sets about killing people and destroying the native huts, but Kudo and pals find a way to defeat the beast. The only problem is, Yog just jumps to another giant monster. Ganime, a giant crab, is next and then comes Kameba, a titanic tortoise who could give Gamera a run for his money. Not only that, but Yog also takes control of Obata and uses him to sabotage the human's plans. It's a sticky pickle but the Earthmen find a secret weakness of Yog's that they can use to attack the space monster. Another key to Yog's defeat is Obata...can his mind be turned against the Monster from Space? The movie is fun and exciting if you're not too demanding. You see plenty of the monsters and even a nasty battle between Ganime and Kameba. Call me nuts, but I thought dialog and acting were a lot better here than other period kaiju films. The characters had more personality...especially Kudo, played by Akira Kubo...and I kind of liked the way every tied together. Some may be disappointed that no cities get destroyed, but if you're looking for a Japanese monster mash with a bit of a difference, \"Yog\" will satisfy your craving!!!",
         "When I rented this movie I thought this would be a low budget, rubber monster type, bad acting movie you would see on a late late late show. All of that is true, but the movie plot and situation was kind of interesting. Yog changes into three different giant size monsters, but Yog is more of a blue mist that takes control of the host. The side story with the space mission is very interesting as well and merges well with the rest of the story. This story also has the cutest oriental woman I have ever seen which kept my attention. But without her, I would still be watching the movie finding out how it turns out. This movie was a surprise to see and I did enjoy the film very much.",
         "An unmanned space capsule plummets back to earth carrying an unwelcome visitor in the form of a glowing, amoeba-like invader. In short order, the alien menace inhabits a cuttle fish (a type of squid), a turtle and a crab. Naturally as this is a kaiju, the animals grow to enormous size and attack a small tropical island where our heroes are planning to build a luxury hotel. Bad choice. Happily, mother nature has a secret weapon against the invaders, sonic waves created by dolphins and bats, which are plentiful on the island. As the 70's dawned, director Ishiro Honda wanted to do something different from the Godzilla movies and this was it. On the plus side, it is really different and I felt the monsters were well done. Also, the remote island setting is effective and there are some impressive special effects, along with a terrific musical score by Akira Ifukube. The version in the original Japanese is much better than the dubbed version and adds to the fun. If you like to watch terrified people battling enormous creatures made of rubber (I confess I get a kick out of it), you could do much worse than this. Colorful and fast paced, for those who enjoy kaiju.",
         "Space Amoeba was essentially the last fresh giant monster film from Toho's Showa era. After this 1970 entry, the rest of their giant monster films were Godzilla pictures. Space Amoeba is mostly a rehash of elements we've seen before at Toho. Alien life forms have come to conquer the planet and use a human vessel as assistance in carrying out the plan. However, instead of bringing their own monsters as the alien races do in The Mysterians, Ghidorah, the Three Headed Monster, or Godzilla vs Gigan, they simply blow up the size of some Earth animals (more on that later). It is up to a small group of people on the plot's island to save the day. In spite of being that last original giant monster picture from Toho's Showa series, Space Amoeba fails to move the needle as much as some of their 50s and 60s movies did. The plot could've worked if it had been carried out with a bit more care, but the boring plot was made no more interesting by good acting or special effects. Eiji Tsuburaya was a famous special effects director at Toho, and this was the first kaiju film made after his death. The special effects are pretty hit-and-miss here, so he is missed. The monster with the most combined discussion and screen time is the first to appear, Gezora; he is thought to be a monster god by the inhabitants of the island. Gezora is referred to as both a squid and an octopus in the picture depending upon which audio and subtitles you're listening to, but he mostly reflects the proportions of a squid in my opinion. He isn't very convincing in his motions and his suit wrinkles unnaturally. His eyes look very fake as well. Gezora is a pretty obscure monster even within Toho's fans, but it's not without warrant. Ganime is a giant mutated crab, somewhat similar to Toho's own giant lobster Ebirah that starred in Ebirah, Horror of the Deep (aka Godzilla vs The Sea Monster) and much more recently in Godzilla: Final Wars. Compared to his Showa Ebirah stablemate, I actually think Ganime looks better and more menacing. A pretty well done suit and acceptable movements here. Kamoebas is the third and final monster in the film, a giant turtle. He is probably the best known due to his second appearance in a far more popular movie, 2003's Godzilla: Tokyo SOS. Kamoebas and Ganime actually fight at the end of the movie and plummet into a volcano to their demise (predictably). The only real reason to view Space Amoeba is to see some new monster action, because from the standpoint of the plot and acting, you've seen it before at Toho many times over. That's not to say I will give this film a low rating; I'd still rate it a mediocre 5/10, but that's the most it deserves. Toho did a plenty of superior monster movies before this one (and some of the Godzilla ones that followed), so this shouldn't be one of the first ones you seek.",
         "My fellow Trekkers who rent Ishiro Honda's 1970 offering, \"Space Amoeba,\" expecting to see an 11,000-mile-long, single-celled organism on the order of the one shown in the classic \"Immunity Syndrome\" episode may be a bit disappointed here. Rather, the sparkling hive colony in this film that attaches itself to Earth's unmanned Helios 7 rocket, en route to Jupiter, is comparatively teeny, but still capable of causing major-league mishegas nonetheless. This space hive causes the Earth rocket to crashland in the Pacific and proceeds to transform a squid, a crab and a turtle into some giant monsters, respectively Gezora, Ganime and Kamoeba. Good thing that a Japanese biologist, a photographer, an industrial spy AND the obligatory pretty girl all happen to be convening on nearby Selgio Island to explore a future resort area.... Anyway, this Honda monster bash is a mixed blessing at best. While Gezora looks pretty cool lumbering about on his tentacles, his fellow monstrosities are fairly lame, and the seemingly inevitable dukeout between two of them may be the dullest in the history of the kaiju eiga. The film grows increasingly loopy as it proceeds, and the final 1/3, conflating bats, a native marriage ceremony and a deus-ex-machina volcano, is quite bizarre. Fortunately, the photography of the island looks great, longtime Honda collaborator Akira Ifukube provides another rousing score, and FX man Sadamasa Arikawa dishes out some interesting visuals, especially his outer space shots and the \"amoeba\" itself. (Sadly, his giant monsters are not equal to those of an earlier Honda colleague, Eiji Tsuburaya.) All in all, the film is an undeniably fun mixed bag that should just manage to please fans of the genre. Oh...a great-looking DVD here, thanks to the fine folks at Media Blasters' Tokyo Shock unit.",
         "In the late sixties and going into the seventies Toho loved monster movies based on islands. Well, this time it really works. The story is cool, the acting is great and the three main monsters are major league cool. Their names are hard to pronounce but I do feel that the designs are cool and they are not the standard monsters that you find in these movies, a cuddle fish, a crab and a snapping turtle. I love the effect that allows the Snapping Turltle to shoot out his neck. Okay, now the downside, the old native thinking that Gezora is some kind of God even though there is no monsters like that in their religion is just stupid. But that's just me. So to make a long story short, I give it 9 big stars!",
         "Alien spores hitch a ride on an unmanned space probe and go to Earth. The parasitic life forms crash land on an island and cause a squid, a crab, and a snapping turtle to grow to giant size. Director Ishiro Honda, working from a compelling script by Ei Ogawa, relates the engrossing story at a brisk pace, makes fine use of the exotic tropical setting, maintains a serious tone throughout, and stages a fierce climactic beast bash between the crab and the turtle with rip-roaring aplomb. The sound acting from the capable cast rates as another substantial asset, with especially commendable contributions from Akiro Kubo as likable photographer Taro Kudo, the adorable Atsuko Takahashi as the perky Ayako Hoshino, Kenji Sahara as cynical opportunist Makoto Obata, and Noritake Saito as traumatized native Rico. Moreover, the filmmakers warrant further praise for playing the wild premise completely straight, with no silly humor or an annoying subplot involving a cutesy kid. The special effects are quite colorful and impressive. Taiichi Kankura's sumptuous widescreen cinematography gives the picture an attractive vibrant look. Veteran composer Akiro Ifekube comes through with a typically robust and rousing full-bore orchestral score. A nifty creature feature.",
         "The Japanese have always had incredible ambitions in their fantasy movies. They have always been ready to destroy cities by huge plastic monsters coming from outer space and elsewhere. The problem is they have never had the money to succeed in making convincing special effects. This film, released in France under the title Les envahisseurs de l'espace, is no exception. Its ambition is to show three creatures from the giant octopus to the giant lobster trying to have the upper hand on the humans. It's extremely awkward and laughable, but well quite enjoyable too. After all, we do like these creatures and these films after all, don't we?"
      ],
      "genres": [
         "Adventure",
         "Sci-Fi"
      ],
      "productionCompanies": ["Toho Company"],
      "summaries": ["A space probe is infiltrated by alien beings and then crashes on a remote Pacific atoll. A group planning to build a resort hotel land on the island and discover it to be inhabited by giant mutant monsters created by the aliens in an attempt to conquer the world."],
      "budget": 0
   },
   "movielensId": 105936,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1970-08-01",
      "dvdReleaseDate": null,
      "directors": ["Ishirô Honda"],
      "runtime": 84,
      "movieId": 105936,
      "title": "Space Amoeba",
      "mpaa": "",
      "actors": [
         "Akira Kubo",
         "Yoshio Tsuchiya",
         "Atsuko Takahashi",
         "Kenji Sahara",
         "Noritake Saito",
         "Chôtarô Tôgin",
         "Tetsu Nakamura",
         "Yukiko Kobayashi",
         "Yû Fujiki",
         "Sachio Sakai",
         "Wataru Ômae",
         "Yukihiko Gondô",
         "Shigeo Katô",
         "Rinsaku Ogata",
         "Yûko Sugihara",
         "Haruo Nakajima",
         "Haruyoshi Nakamura"
      ],
      "imdbMovieId": "0065776",
      "originalTitle": "Gezora, Ganime, Kameba: Kessen! Nankai no daikaijû",
      "genres": [
         "Science Fiction",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "c8V_VdYzLrE",
         "zU1YZds8mAo"
      ],
      "plotSummary": "When a space probe crash-lands on a far-flung Pacific atoll, the craft's alien stowaways decide to take over their new world one creature at a time. Soon, the parasitic life forms latch onto three indigenous critters -- a squid, a crab and a snapping turtle -- and transform them into colossal mutant monsters.",
      "tmdbMovieId": 38221,
      "avgRating": 3,
      "releaseYear": "1970",
      "numRatings": 2,
      "posterPath": "/3tYRB7NPykoLGfZaWSGf6lVokuK.jpg"
   }
}