{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "children",
         "id": 10103
      }],
      "imdb_id": "tt0083900",
      "video": false,
      "title": "The Escape Artist",
      "recommendations": [
         41951,
         40820
      ],
      "backdrop_path": "/ucYG1EvaBjFag42sEsteycPRQN0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Danny Masters",
               "gender": 2,
               "credit_id": "52fe4942c3a36847f8191399",
               "name": "Griffin O'Neal",
               "profile_path": "/80xL21qTnaOYt6fpPIv7bY6YN6t.jpg",
               "id": 92822,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Stu Quiñones",
               "gender": 2,
               "credit_id": "52fe4942c3a36847f819139d",
               "name": "Raúl Juliá",
               "profile_path": "/nh6jWnEubiTKp61EpEYcB2lFQH0.jpg",
               "id": 27888,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Arlene",
               "gender": 1,
               "credit_id": "52fe4942c3a36847f81913a1",
               "name": "Teri Garr",
               "profile_path": "/dG1PeN7MdRlP6ZeSeRmaGwSeUWd.jpg",
               "id": 8437,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Aunt Sibyl",
               "gender": 1,
               "credit_id": "58c75b179251417a2300512c",
               "name": "Joan Hackett",
               "profile_path": "/YCPt7OdseCr4D0ywXTWhmg2QIh.jpg",
               "id": 18588,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Mayor Leon Quiñones",
               "gender": 2,
               "credit_id": "52fe4942c3a36847f81913a5",
               "name": "Desi Arnaz",
               "profile_path": "/fsRaJptnHcfx6j0shupOJiwgWbD.jpg",
               "id": 91711,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Fritz",
               "gender": 2,
               "credit_id": "58c75b2ec3a3683ddf0055fd",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Magic Shop Owner",
               "gender": 0,
               "credit_id": "58812e4b925141302e002467",
               "name": "Jackie Coogan",
               "profile_path": "/AsRLmcdR5fqhxXlPlwH5TkMMJ2C.jpg",
               "id": 19426,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53dc95c0c3a3684331000e3f",
               "name": "Caleb Deschanel",
               "profile_path": "/2TsYnZibZRfHY3vcmEdLTJSR4kl.jpg",
               "id": 8750,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "569a04c0c3a3686fa5000ad4",
               "name": "Melissa Mathison",
               "profile_path": null,
               "id": 9964,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "569a04e39251414800000abe",
               "name": "Stephen Zito",
               "profile_path": null,
               "id": 179955,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.611908,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 57725,
      "vote_count": 8,
      "budget": 0,
      "overview": "The young and self-confident Danny blufs at the local police-station that he will escape out of prison within one hour. What follows is a flashback about his childhood with his uncle and aunt, which are 'vaudeville'-artists themselves.",
      "similar": [
         103663,
         46705,
         150540,
         394117,
         298312,
         77949,
         10320,
         15373,
         20352,
         9355,
         601,
         342473,
         394823,
         5123,
         290637,
         9339,
         11637,
         3112,
         137116,
         428449
      ],
      "original_title": "The Escape Artist",
      "runtime": 94,
      "poster_path": "/73fKILafMAEWhaQNJ1mxknNWjdf.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Zoetrope Studios",
         "id": 13349,
         "origin_country": ""
      }],
      "release_date": "1982-05-04",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "He can get away with anything... that's why they call him The Escape Artist",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Caleb Deschanel"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "David Wagoner",
         "Melissa Mathison"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083900/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5OTY4MjQxNV5BMl5BanBnXkFtZTcwNDQ2NzUzMQ@@._V1_.jpg",
      "actors": ["Stars: Raul Julia, Griffin O'Neal, Desi Arnaz | See full cast and crew »"],
      "reviews": [
         "This is a truly wonderful movie experience. The magical score adds to the atmosphere perfectly. It is beautifully photographed by Stephen H Burum and perfectly directed by Caleb Deschanel. The central performance by Griffin O'Neil is very watchable as is a great support cast which includes Elizabeth Daly and the late great Raul Julia. This is THE movie that made me want to make movies. The haunting final shot combined with the beautiful music has stayed with me for years.",
         "About legacy, and fathers and sons. Much better and deeper than the ratings on this board give it credit for, in my opinion. There is little violence, sex or break-neck action but much boils under the surface and there are powerful moments. This is a fine movie.",
         "This film needs to be re-mastered and re-released. I absolutely loved the performances by Griffin O'Neal, Raul Julia, and the late Joan Hackett - who died of Ovarian Cancer shortly after the film was originally released. A great family film for little kids, and us big kids too!",
         "It's a great kid's film, I saw it as an early teen and it really got me interested in magic. The main character gets away with so much because of his skills but it was all within the realms of plausibility if you've got a bit of bottle and enough books on magic and safe cracking etc. Griffin O'Neal is really expressive and natural in his role. Even though what he gets up to is pretty wild you believe that this kid is amazing enough to pull it off.",
         "I forgot to mention the wonderful haunting score by Georges Delerue. The main theme has a sad music box quality to it - gives a sort of a longing childhood feeling....VERY effective.",
         "I loved this film. It ranks as my number 1 film of all time. I think it is warm, funny and poignant. The whole film from the acting to the photography is infused with a kind of otherworldliness. It is magically warm and sad, and uses illusion to describe how we come terms with our place in the world. The stand out performance by Griffin O'Neal bests anything that i have seen from the O'Neal clan.",
         "A whimsical bittersweet tale with quirky characters, charming moments and which is quite enchanting as a whole. Griffin O'Neal (Ryan's son) as the young lead character showed great promise in this film. Raul Julia is at his most vibrant as the spoiled son of a mayor (played by Desi Arnaz!) who befriends O'Neal's character. This film is HIGHLY under-rated and desperately needs to be remastered and reissued on video.",
         "This unheralded gem was produced by Francis Ford Coppola's Zoetrope Studios. I give it 10 stars for the theme music alone. There are some very good performances by Griffin O'Neal (his debut) as Danny and Desi Arnez Sr (Lucille Ball's husband) as the crooked Mayor...but the best performances are Raul Julia as Stu, the slightly(!) unhinged son of the Mayor and Joan Hackett as Danny's Aunt Sibyl. Funny and understated performances by John P Ryan as Stu's sidekick Vernon and Teri Garr as Stu's dotty girlfriend Arlene (pure eye-candy) are also worth mentioning. There's even a couple of the original 'Dead-End Kids' in the mix, Huntz Hall and Gabriel Dell, plus the original Uncle Fester and silent screen kid actor, Jackie Coogan. I've just realised all the names I've mentioned bar O'Neal and Garr are all gone now. Sad. M.Emmet Walsh throws in a greasy, smirking performance as the Chief Jailer with corruption oozing from every pore. Walsh never disappoints, even in a cameo role. The ending just about pulls it all together but not quite, though it doesn't disappoint. Once again though...beautiful music One strange thing, Richard Bradford as Sam the City Treasurer is missing off the film credits. It took me two updates to get his name listed on IMDb as uncredited.",
         "This is one of those odd movies which is much greater than the sum of its parts. Leonard Maltin is quite right that it is muddled, and the plot has tons of holes and inconsistencies. The casting is odd and quirky. But when the smoke clears, it stays with you. Maybe it's just the concept of a child prodigy magician. BTW, the contemporary reviews in 1982 were pretty much in accord with this opinion.",
         "When the movie came out, it pretty much disappeared right away, which is often the fate of small movies, simply because the studios don't bother to advertise them. As well, the film was \"pegged\" as a kid's movie, which is absurd. It's about kids; and kids could watch it with profit and get excited about it; but where kids see a film about a boy who succeeds ultimately in becoming an \"escape artist,\" and using his talents to defeat the bad guys, adults see a whole different film, one that is about a profound emotional connection a boy has with his father who has died. And this side of the tale is made even more affecting by its only slowly being revealed as the film goes on. One thing that may also have confounded audiences is that it's not a \"talky\" film. The young hero does things, he doesn't much talk about things, and that makes it a little hard to follow the motivations in places. But it is a lovingly crafted, beautifully put together, piece of work, one that is long long overdue for a release on DVD. The sequence of the young boy cracking the safe is fascinating, as is the dream sequence in the jail where he magically floats his father out of danger. Striking visuals, and a clear dramatic structure. Wonderful. As of last year, I believe American Zoetrope held the rights to the title, and while it is on their list to release, they've had higher priorities (for example, Coppola's \"One From the Heart,\" which is good, but suffers from Frederick Forrest's unfocused performance) so it may be quite a while before this marvelous film is released. Let's hope that when it is released, Deschanel has some say in the process, i.e., we get at least a small documentary on what it's like to make your first film, we get an anamorphic transfer, and we get a reasonably high bit rate for the transfer. If you can find this on VHS, that's not the best way to see it, but it'll do until the DVD comes along. Enjoy"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Zoetrope Studios"],
      "summaries": [
         "The young and self-confident Danny blufs at the local police-station that he will escape out of prison within one hour. What follows is a flashback about his childhood with his uncle and aunt, which are 'vaudeville'-artists themselves. We also follow the problems of Danny with the corrupt son of the mayor.",
         "Danny Masters, teen-aged son of the late Harry Masters, the \"greatest escape artist except for Houdini,\" leaves home to join Uncle Burke and Aunt Sibyl (formerly called Louise) in their magic/mentalist act. Sibyl welcomes him; Burke is unenthusiastic. Danny is himself an accomplished magician and escape artist. He soon finds himself embroiled with Stu Quinones, over-the-edge son of Mayor Leon Quinones. The quest for a missing wallet with \"hot\" bills inside (pocket-picked by Danny) leads to the comeuppance of the crooked mayor and -- separately -- of his vindictive and out-of-control son. Along the way, Danny comes to terms with the death of his father, the circumstances of which he did not previously know."
      ],
      "budget": 0
   },
   "movielensId": 106046,
   "movielens": {
      "languages": [""],
      "releaseDate": "1982-05-04",
      "dvdReleaseDate": null,
      "directors": ["Caleb Deschanel"],
      "runtime": 94,
      "movieId": 106046,
      "title": "The Escape Artist",
      "mpaa": "PG",
      "actors": [
         "Griffin O'Neal",
         "Raúl Juliá",
         "Teri Garr",
         "Joan Hackett",
         "Desi Arnaz",
         "M. Emmet Walsh",
         "Jackie Coogan"
      ],
      "imdbMovieId": "0083900",
      "originalTitle": "The Escape Artist",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The young and self-confident Danny blufs at the local police-station that he will escape out of prison within one hour. What follows is a flashback about his childhood with his uncle and aunt, which are 'vaudeville'-artists themselves.",
      "tmdbMovieId": 57725,
      "avgRating": 2.16667,
      "releaseYear": "1982",
      "numRatings": 3,
      "posterPath": "/73fKILafMAEWhaQNJ1mxknNWjdf.jpg"
   }
}