{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt2304426",
      "video": false,
      "title": "The Selfish Giant",
      "recommendations": [
         187864,
         202573,
         187028,
         168806,
         142374,
         142373,
         14495,
         198537,
         42044,
         209350,
         215935,
         158091,
         12627,
         125414,
         34683,
         49559,
         167571,
         59058,
         127320,
         127323
      ],
      "backdrop_path": "/s43WO5oGFAgaMYdJTEVw6l5sUec.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Arbor",
               "gender": 0,
               "credit_id": "52fe4ce29251416c911034ff",
               "name": "Conner Chapman",
               "profile_path": null,
               "id": 1169852,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Swifty",
               "gender": 0,
               "credit_id": "52fe4ce29251416c91103503",
               "name": "Shaun Thomas",
               "profile_path": "/l5slSapPCEfKkiivQ8qnYGI8jP.jpg",
               "id": 1169853,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kitten",
               "gender": 2,
               "credit_id": "52fe4ce29251416c91103507",
               "name": "Sean Gilder",
               "profile_path": "/3k9U78b90A93O5KtbSSb4QDOJ19.jpg",
               "id": 77292,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe4ce29251416c9110350b",
               "name": "Lorraine Ashbourne",
               "profile_path": "/1CLCZ0Pr4ZZVwAg9UyKZdCDNuBs.jpg",
               "id": 78329,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mick Brazil",
               "gender": 2,
               "credit_id": "52fe4ce29251416c9110350f",
               "name": "Ian Burfield",
               "profile_path": "/g8Nuj7mPcTZLhAN6HW5uhZf13Ja.jpg",
               "id": 11285,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Price Drop Swift",
               "gender": 2,
               "credit_id": "52fe4ce29251416c91103519",
               "name": "Steve Evets",
               "profile_path": "/zLSynCYJI8UgLuW2zR7ScDFK5mU.jpg",
               "id": 83814,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mrs. Swift",
               "gender": 1,
               "credit_id": "52fe4ce29251416c9110351d",
               "name": "Siobhan Finneran",
               "profile_path": "/7vRsMFgGXF0L5I1DAmwZCanFGgH.jpg",
               "id": 82711,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Johnny Jones",
               "gender": 2,
               "credit_id": "52fe4ce29251416c91103521",
               "name": "Ralph Ineson",
               "profile_path": "/zqvpAuiocN9hHjg6f9Dqu2S8y9x.jpg",
               "id": 202032,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Michelle 'Shelly' Fenton",
               "gender": 1,
               "credit_id": "52fe4ce29251416c91103525",
               "name": "Rebecca Manley",
               "profile_path": "/fY5HSTXYN5UDUXo86eg4Mak4c8J.jpg",
               "id": 195389,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Daniel",
               "gender": 0,
               "credit_id": "52fe4ce29251416c91103529",
               "name": "Rhys McCoy",
               "profile_path": null,
               "id": 1278754,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Martin Fenton",
               "gender": 2,
               "credit_id": "52fe4ce29251416c9110352d",
               "name": "Elliott Tittensor",
               "profile_path": "/5xODUjecHxAZrM8pNzMuVvDzKAI.jpg",
               "id": 549520,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ce29251416c911034fb",
               "name": "Clio Barnard",
               "profile_path": "/3t7kB3miBr9bvGIs1948MLDpUQM.jpg",
               "id": 229604,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ce29251416c91103515",
               "name": "Clio Barnard",
               "profile_path": "/3t7kB3miBr9bvGIs1948MLDpUQM.jpg",
               "id": 229604,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "566ae6dec3a36836990091fc",
               "name": "Amy Hubbard",
               "profile_path": "/u4hp7Yes0B45LvZjas5Kf8ZZaNU.jpg",
               "id": 1016176,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "566ade1392514173830047c0",
               "name": "Mike Eley",
               "profile_path": null,
               "id": 68543,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "566adf2ec3a3683f560042cb",
               "name": "Nick Fenton",
               "profile_path": null,
               "id": 967482,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "566adf45c3a3683f560042ce",
               "name": "Harry Escott",
               "profile_path": null,
               "id": 20459,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "566adf8b92514169e2004d18",
               "name": "Helen Scott",
               "profile_path": null,
               "id": 36205,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "566adf9a92514173fc009437",
               "name": "Matthew Price",
               "profile_path": null,
               "id": 66572,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "566ae0adc3a36836b4008ae9",
               "name": "Tracy O'Riordan",
               "profile_path": null,
               "id": 1547727,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "566ae0b992514173ff00920c",
               "name": "Lizzie Francke",
               "profile_path": null,
               "id": 62955,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "566ae0c89251417383004801",
               "name": "Katherine Butler",
               "profile_path": null,
               "id": 210705,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "566ae97292514173fc009575",
               "name": "Sylvia Parker",
               "profile_path": null,
               "id": 1402943,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "566aece092514173ff00938c",
               "name": "Martin Jensen",
               "profile_path": null,
               "id": 1340116,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "566aed0592514169e2004eaa",
               "name": "Forbes Noonan",
               "profile_path": null,
               "id": 1444956,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.08766,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 194101,
      "vote_count": 96,
      "budget": 0,
      "overview": "A hyperactive boy and his best friend, a slow-witted youth with an affinity for horses, start collecting scrap metal for a shady dealer.",
      "similar": [
         27586,
         258480,
         112160,
         858,
         141,
         244772,
         634,
         401898,
         394117,
         242224,
         17130,
         370663,
         43923,
         340485,
         250124,
         3981,
         57201,
         437557,
         297762,
         376660
      ],
      "original_title": "The Selfish Giant",
      "runtime": 91,
      "poster_path": "/AmqZnGqnvGYvKsCrZn05KFm3MxR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Moonspun Films",
            "id": 34527,
            "origin_country": ""
         },
         {
            "logo_path": "/vuDafYIcuoY0YyvgcqtjXOKwn6Q.png",
            "name": "British Film Institute (BFI)",
            "id": 7281,
            "origin_country": "GB"
         },
         {
            "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
            "name": "Film4 Productions",
            "id": 6705,
            "origin_country": "GB"
         }
      ],
      "release_date": "2013-05-16",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Clio Barnard"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Clio Barnard",
         "Oscar Wilde"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2304426/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQyMzUxODEwMF5BMl5BanBnXkFtZTgwOTc5NzE2MDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Conner Chapman, Shaun Thomas, Sean Gilder | See full cast and crew »"],
      "reviews": [
         "The Selfish Giant shows basically how capitalism works: not by making an academic movie with statistical figures, but by telling the highly capturing dramatic story of two teenagers in an English community who need to collect scrap to make ends meet. They are no longer motivated in studying, because the bills need to be payed by the end of the month. At school they are expelled because of their frustrated behavior. Their family is in ruin due to the stress caused by not earning enough money. In their quest for scrap they see how the best thief's also gain the most money. So eventually they turn to criminal behavior. Not by choice, but by necessity. Making money becomes separated from doing 'the right thing' to do. The director does a good job not telling this as a straight forward moral tale, nor using sentimental 'tricks', nor trying to pretend that all ends well. But telling it as an illustration on a human level in an ordinary community where the downside of our economic model is not theory but reality.",
         "This film is stunning - a visually powerful glimpse into a savage, precarious world, with humour and tenderness. It can't just be reduced to a political diatribe, although the post-industrial setting is bleak and the poverty grinding. Mainly it's the story of a young lad's struggle towards adulthood, ahead of his time and in tough circumstances, as he learns the hard way what it is to be a grown-up. The echoes of 'Kes' are obvious, but with the destruction of that old industrial world the characters too are ambiguous and troubled. Arbor is a complex mix of ruthlessness, cheekiness and wit. We see his character develop from being a cocky little tawt to something altogether more complicated and touching...",
         "Since Shane Meadows hit us with phenomenal This Is England in 2007, there's been a dusty spot on the mantle of gritty kitchen sink dramas that truly capture the modern current of low- class British life. Fish Tank has been the only contender since but it doesn't feel like it has stuck as firmly as England, which then spawned several mini-series that I really should watch. Instead, British film seems to be concerned with crowd-pleasers after the roaring but typical success of The King's Speech. BAFTA nominees for Best British Film have been questionable this year, with big budget or mainstream films such as Gravity, Mandela, Philomena, Rush and Saving Mr. Banks, all with big stars on their shoulders. The only exception in the bunch is Clio Barnad's The Selfish Giant, and is the only one that truly deserves the honour. Now that Steve McQueen has stepped firmly into the limelight with the powerful 12 Years A Slave, I must urge that Barnard is the next under-the-radar British voice that needs to be heard. Loosely based off Oscar Wilde's short story of the same name, Clio Barnard's vision is comparable to a Ken Loach slice-of-life style but rather than the sloppiness and lack of clarity that style can bring, it's startlingly energetic and tight in its delivery. It immediately engages you with its opening scene of a cathartic pounding of rage under a claustrophobic bed then a sincerely moving image of holding hands, all from angry underprivileged boys. It's a rough world depicted here. Conflict is around every corner without exception. Characters step outside and witness kids chased down the street. The harshest swear words are thrown around without much regard for their consequence. It's intimidating, but our characters embrace it and dive in with both feet. It's a world of scroungers, those that see the resale value in everything and abuse that opportunity. It's a bleak life, but the film executes it in such an honest way that it doesn't feel preachy in the way that this is the limits of quality of life and future in the working- class north. Their immoral tunnel vision is one of necessity rather than choice. It's a cruel situation that the film immerses you without comfort. While there may be a touch of melodrama with the theme of the mother's concern and the pacing it thrives off of seems unnatural, what makes the film work is that it still feels authentic in its performances and script. It's perfectly reflected in its terrific cinematography. It's rough and raw, but it's well-measured in its framing and characters don't get lost in its saturation. The real revelation is its lead performance, Connor Chapman, who gives a genuine and confident performance for his age. Mature, if not sophisticated, beyond his years to be able to take on a brutish character like this with such fearlessness. At first you feel animosity towards him, then a deep pity burrows deeper and deeper. Then the film utterly shatters your heart with its inevitable Shakespearean tragedy making it an unforgettable experience. Any doubts I had about the films power hinges on those fateful final 15 minutes. It may be bleak, but there's a thin ray of hope bursting through the grey clouds. The Selfish Giant single-handedly puts my faith back in British independent filmmaking. I hope this sparks a new era. 8/10",
         "'The Selfish Giant' is British filmmaker Clio Barnard's new film, set on the same Bradford estate that featured in her debut 'The Arbor'. Swifty (Shaun Thomas) and Arbor (Conner Chapman) are two thirteen year old boys, best friends who always seem to be upto something they shouldn't be in. But theirs is not merely a selfish path of youthful gratification, they know their parents struggles and want to improve their lives. Victims of their circumstances, expelled from school and lacking a purpose in life, the boys drift aimlessly down a dangerous path. The boys hit upon a scrap metal scam, stealing copper cables left on a railway line by some just as untrustworthy individuals. They soon embark on trying to make a living from scrap metal, twinned with a fascination for horses. Swifty in particular has a gift with horses, and feels even more at home with them then he does with Arbor. He's the more sensitive and innocent of the two, Arbor's behavioural problems (ADHD) and big mouth tends to land them both in trouble. The boys start to work for a local scrap-dealer named Kitten (Sean Gilder). Kitten shows no qualms about exploiting the boys' willingness to earn money, encouraging them to rent his horse and cart from him in order to collect scrap metal from sources that aren't legal. Kitten also runs an illegal horse-and-cart race, shown in one of the standout scenes, and he wastes no time in employing Swifty as a jockey. Barnard makes a subtle comment on child exploitation, but far more on the world commodities boom which has led to many people taking huge risks where copper has become the new gold. It also illustrates the waste that exists in society , plus how an entrepreneurial spirit can make money out of anything. 'The Selfish Giant' is the sort of film that the British excel in, and there is a point where you do get tired of yet another film about how grim it is up North. But you cannot fault the film, and if anything its nowhere near as bleak as you'd have imagined. First-timers Conner Chapman and Shaun Thomas are exceptional, as are the whole cast who give the whole film a naturalistic feel. There's clearly a lot of anger in this film concerning the way society has let down these boys and forgotten about these communities. Barnard doesn't pull any punches but there is a surprising level of compassion and grace from the adults which really pulls on your emotions. For all the hardships they've suffered there's still something inside them which burns through their grim reality to reveal what it really takes to be an adult and a parent. The final moments of the film are practically dialogue-free, but you won't find a more powerful sequence all year.",
         "I have to confess I have a 'soft spot' for realist British drama and any film featuring scrapyards and neglected locations nearly always gets a high rating for me. Having seen Clio Barnard's previous film 'The Arbor' a couple of years back, I was curious to see her next feature and it's well worth the price of admission. Her style and subject matter here remind me of Andrea Arnold's 'Fish Tank' and also a little of Rufus Norris's dysfunctional family in 'Broken', both of which were high on my score sheet. The two young leads are outstanding, even if their strong northern accents are sometimes hard to follow for me, a southerner, and the portrayal of exclusion, its consequences and repercussions is handled brilliantly by the film makers as you are immersed in their world for what feels far longer than the 90 minutes running time. See it and appreciate that British drama is alive and kicking. I look forward to her next project.",
         "Based loosely on the Oscar Wilde story, THE SELFISH GIANT is set in contemporary Bradford, north England, and focuses on the lives of two boys, both of whom are misfits. Arbor (Conner Chapman) cannot fit in to high school life, and prefers to spend his time collecting scrap metal to help his impoverished family. His friend Swifty (Shaun Thomas) is emotionally softer, but proves brilliant at dealing with the prize horse of local dealer Kitten (Sean Gilder). With its washed-out colors and lengthy shots focusing on a grim post-industrial landscape, Clio Barnard's film looks at life on the margins, where families quite literally have to sell everything in order to survive. Despite their hardships, Arbor and Swifty forge a close friendship - so close, in fact, that we are both shocked and moved when tragedy strikes at the end of the film. THE SELFISH GIANT has strong links to Ken Loach's KES in its portrayal of contemporary working-class culture. The dialog is harsh and uncompromising, while the two central performances are memorable. There are certain rough edges - Gilder's Kitten comes across as rather two-dimensional, while his wife Mary (Lorraine Ashbourne) is almost too good to be true - but the film is definitely worth watching more than once.",
         "In the Giant's garden in Oscar Wilde's children's story The Selfish Giant, it is always winter. Having built a wall to keep children from playing in his garden, there are no longer any peach trees, flowers, or birds, only perpetual hail and snow. Spring has forgotten this garden as it also seems to have forgotten the industrial town of Bradford in West Yorkshire, England, the setting for Clio Barnard's authentic and visceral The Selfish Giant. Nominated for a BAFTA award for Best British Film of 2013, The Selfish Giant is in the tradition of Ken Loach, Shane Meadows and others, films of social realism that show the world there is more to merry old England than Stratford-on-Avon and Westminster Abbey. Though the film is about economic and social dysfunction, it is not all grim. Even in the metallic gray of the rotting town as captured by cinematographer Mike Eley, scenes of horses grazing in a tranquil field, oblivious to the surrounding train tracks and power lines, add a touch of timeless beauty. The real standout, however, are the remarkably convincing performances of Arbor (Conner Chapman) and Swifty (Shaun Thomas), 13-year-old best friends whose connection is born out of their desperate need for affection. Arbor, a pint-sized, hyperactive, sharp-tongued ADHD sufferer, lives with his mother (Rebecca Manley) and older brother (Elliott Tittensor) who sells his A.D.H.D. medication to pay off his drug debts. His father is nowhere to be seen. \"They sleep on the living room sofas but are better off than Swifty who lives with his eight siblings in a home lacking in the means to support them. Swifty's mother played by Siobhan Finneran, is caring, though she is intimidated by her overbearing husband (Steve Evets) who supports the family by renting furniture from discount stores and selling them for cash at inflated prices.\" Struggling to keep his aggressive behavior in check, Arbor relies on the heavy-set Swifty, a kinder gentler soul with a love for horses to calm him down. Banned from school as a result of fighting to defend themselves against bullies, the boys use a horse and cart to scavenge scrap metal, pots and pans, as well as copper cabling from telecom, railway, and power utilities. To earn money to help support their families, they sell the scrap to an exploitative but fatherly local junk dealer (Sean Gilder), incongruously called Kitten but given to bursts of anger. In one of the visual highlights of the film, an illegal harness drag race is run on a major highway with serious money at stake. Recognizing Swifty's way with horses, Kitten offers to let him ride one of his horses in the next race. Feeling his friend drifting away from him, Arbor concocts a potentially lucrative plan to steal or collect electrical power cables, but the adventure leads to unforeseen consequences. Much of the dialogue without subtitles is indecipherable due to the heavy Yorkshire accents, but consists mostly of non-stop swearing anyway. What does come through loud and clear, however, without the need for subtitles is the closeness of the boys' friendship. Although they have different temperaments, they are connected by a struggle for survival and a drive to preserve whatever joy is left in their childhood. There are definitely economic and political overtones in The Selfish Giant, yet it is not about politics or even selfishness, in spite of the title. It is a film with a human element at its core and we care about the characters as Barnard obviously does as well. According to the director, the film \"is about what we have lost�and what we need to value and hold on to.\" It is also a film about the resilience of two boys determined to avoid becoming objects like the discarded scrap they collect.",
         "A story of dependence, damage and desperation, told with grit and grimy frankness. It's also a portrait of friendship born of need and emptiness, on the road to nowhere. The tone of documentary accuracy makes the film even darker. Much of the movie is hard to bear, yet it never drags, thanks to the momentum that writer and director Clio Barnard finds in the fable, and, above all, to the energy that she unleashes in her young leads, Conner Chapman and Shaun Thomas. The first great fiction film to be released in 2014, Clio Barnard's second feature, \"The Selfish Giant,\" is breathtakingly assured, ruggedly beautiful, moving and justifiably tragic.",
         "I saw this film at the Leiden film festival (LIFF) 2013. Two main characters Arbor (13 years old) and Swifty (15 years old), both played by unexperienced actors, make this movie rise above the story that in itself is not that spectacular, though the authors certainly intended it as social commentary. The working class environment, the poor neighborhood, the shady business where these two boys get themselves involved in, many people living together in small houses, and so on, it all provides for the perfect context to explain why these people do what they do. The only silver lining in this story is that Swifty proves to Kitten that he has his way with horses, and thus is allowed to prepare his best horse for the races. The remainder is depressing all over, but nevertheless a must-see, if only to observe a way of living that is insufficiently covered in newspapers and magazines.",
         "This is a brutally stark and powerful dark drama, which I would say is impeccably written and directed by Clio Barnard, and the cast gives such realistic performances you won't even know they're acting. The two leads here are terrific. Connor Chapman stars as Arbor, an extremely hyperactive 13-year-old, who often dos not take his medication, and has enormous problems with authority figures. Shaun Thomas co-stars as Swifty, who is polar opposite to Arbor in personality being soft-spoken, kind-hearted, and has an affinity for horses. Yet there's no question the two boys have an inseparable bond. Set in England, facing dire poverty at home and bullies at school, they are emboldened when they're able to receive cash from the local unscrupulous scrap metal dealer for some stolen wiring. Sean Gilder is perfectly cast as the shady dealer named Kitten. Arbor and Swifty proceed to go out and try and collect any metal they can find in the neighborhood or steal whatever they can get away with. They begin to take more and more risks to obtain the goods to sell, and Arbor even begins to \"bite the hand that feeds him\", as he steals from Kitten and tries to sell the merchandise at an out of town dealer. However, he's exposed and after being physically threatened by Kitten ends up being sent on a dangerous assignment to try and steal some underground cable worth thousands of dollars, but which could be still electrified. When Swifty joins him there you can see tragedy could be just around the corner, and the movie doesn't disappoint in that regard. This a difficult film to watch, and normally may have been too grim for me, but I was glad I stayed with it, and the power of it stayed with me well after it was over. I might mention in closing that if you have any sensitivities to raw language, pretty much every other word here is a swear word. I felt it belonged though in the context of the realism of the film."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "British Film Institute (BFI)",
         "Film4",
         "Moonspun Films"
      ],
      "summaries": [
         "An official selection at the Cannes Film Festival, The Selfish Giant is a contemporary fable about 13 year old Arbor (Conner Chapman) and his best friend Swifty (Shaun Thomas). Excluded from school and outsiders in their own neighborhood, the two boys meet Kitten (Sean Gilder), a local scrap dealer. Wandering their town with just a horse and a cart, they begin collecting scrap metal for him. Swifty has a natural gift with horses while Arbor emulates Kitten - keen to impress him and make some money. However, Kitten favors Swifty, leaving Arbor feeling hurt and excluded, driving a wedge between the boys. As Arbor becomes increasingly greedy and exploitative, tensions build, leading to a tragic event that transforms them all.",
         "A contemporary fable about two scrappy 13-year-old working-class friends in the UK who seek fortune by getting involved with a local scrap dealer and criminal, leading to tragic consequences."
      ],
      "budget": 0
   },
   "movielensId": 106144,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-05-16",
      "dvdReleaseDate": null,
      "directors": ["Clio Barnard"],
      "runtime": 91,
      "movieId": 106144,
      "title": "The Selfish Giant",
      "mpaa": "R",
      "actors": [
         "Conner Chapman",
         "Shaun Thomas",
         "Sean Gilder",
         "Lorraine Ashbourne",
         "Ian Burfield",
         "Steve Evets",
         "Siobhan Finneran",
         "Ralph Ineson",
         "Rebecca Manley",
         "Rhys McCoy",
         "Elliott Tittensor"
      ],
      "imdbMovieId": "2304426",
      "originalTitle": "The Selfish Giant",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "7tEgcpTbvJ8",
         "yzbShOU7Ops"
      ],
      "plotSummary": "A hyperactive boy and his best friend, a slow-witted youth with an affinity for horses, start collecting scrap metal for a shady dealer.",
      "tmdbMovieId": 194101,
      "avgRating": 3.65426,
      "releaseYear": "2013",
      "numRatings": 94,
      "posterPath": "/AmqZnGqnvGYvKsCrZn05KFm3MxR.jpg"
   }
}