{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "biological weapon",
            "id": 1865
         },
         {
            "name": "giant robot",
            "id": 10891
         },
         {
            "name": "giant monster",
            "id": 11100
         },
         {
            "name": "creature feature",
            "id": 158126
         },
         {
            "name": "gojira",
            "id": 159099
         },
         {
            "name": "bio organic weapon",
            "id": 161786
         },
         {
            "name": "kaiju",
            "id": 161791
         }
      ],
      "imdb_id": "tt0314111",
      "video": false,
      "title": "Godzilla Against MechaGodzilla",
      "recommendations": [
         39469,
         18289,
         6593,
         10643,
         39468,
         39466,
         15767,
         39465,
         12561,
         19336,
         36679,
         36243,
         38582,
         39464,
         1682,
         39264,
         1679,
         3115,
         1680,
         19333
      ],
      "backdrop_path": "/9EaamJaBM0kuvtsZAEUIL6kPuVK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Akane Yashiro",
               "gender": 1,
               "credit_id": "52fe450c9251416c7504a03b",
               "name": "Yumiko Shaku",
               "profile_path": "/AvkPUjxfSTd8VHI0AHvF0s0AJOP.jpg",
               "id": 46004,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tokumitsu Yuhara",
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a03f",
               "name": "Shin Takuma",
               "profile_path": "/o6LKSfDix4KT0Dt7DeiFuE0ozhW.jpg",
               "id": 73186,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sara Yuhara (Tokumitsu's daughter)",
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a043",
               "name": "Kana Onodera",
               "profile_path": null,
               "id": 73187,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "JSDF Lieutenant Togashi",
               "gender": 0,
               "credit_id": "52fe450d9251416c7504a07d",
               "name": "Kô Takasugi",
               "profile_path": null,
               "id": 1131961,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Gojira / Maser Tank Pilot",
               "gender": 0,
               "credit_id": "52fe450d9251416c7504a081",
               "name": "Tsutomu Kitagawa",
               "profile_path": null,
               "id": 1135826,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "1999 Prime Minister Machiko Tsuge",
               "gender": 1,
               "credit_id": "554c455d925141400b000ace",
               "name": "Kumi Mizuno",
               "profile_path": "/6gJ9LKkcJY3puMRhAPzT2tH2rWp.jpg",
               "id": 30564,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "General Dobashi",
               "gender": 0,
               "credit_id": "5a8aaefdc3a36862a706fa9d",
               "name": "Kôichi Ueda",
               "profile_path": "/qOWfODlgb2J8zcVnTXA90zvRMDT.jpg",
               "id": 50659,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "2003 Prime Minister Hayato Igarashi",
               "gender": 0,
               "credit_id": "5a8ab0220e0a2652ab0758f8",
               "name": "Akira Nakao",
               "profile_path": "/wK68o124VhedgKlygYphLOZG4WL.jpg",
               "id": 50658,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a049",
               "name": "Masaaki Tezuka",
               "profile_path": null,
               "id": 73189,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a04f",
               "name": "Wataru Mimura",
               "profile_path": null,
               "id": 50652,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a055",
               "name": "Takahide Morichi",
               "profile_path": null,
               "id": 73190,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a05b",
               "name": "Shogo Tomiyama",
               "profile_path": null,
               "id": 50661,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450c9251416c7504a061",
               "name": "Shogo Tomiyama",
               "profile_path": null,
               "id": 50661,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe450c9251416c7504a067",
               "name": "Michiru Oshima",
               "profile_path": "/jF0WbxhJCRjleeSMvwSgzmuXUWZ.jpg",
               "id": 73191,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe450d9251416c7504a06d",
               "name": "Masahiro Kishimoto",
               "profile_path": null,
               "id": 72825,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe450d9251416c7504a073",
               "name": "Shinichi Fushima",
               "profile_path": null,
               "id": 73192,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe450d9251416c7504a079",
               "name": "Shinichi Natori",
               "profile_path": null,
               "id": 73193,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 5.896975,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 12636,
      "vote_count": 38,
      "budget": 8500000,
      "overview": "After the appearance of a new Gojira (Godzilla), the Japanese government builds a robotic Godzilla from the bones of the original monster that attacked Tokyo in 1954 to stop the beast.",
      "similar": [
         124905,
         39256,
         373571,
         15767,
         15766,
         19545,
         7191,
         6593,
         1682,
         315011,
         36243,
         21930,
         5876,
         68726,
         293167,
         929,
         22899,
         70327,
         26947,
         35616
      ],
      "original_title": "ゴジラ×メカゴジラ",
      "runtime": 88,
      "poster_path": "/jbFSVc8aRSguOjUCFp4YJXCDN8Z.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Toho Film (Eiga) Co. Ltd.",
         "id": 622,
         "origin_country": ""
      }],
      "release_date": "2002-11-02",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/hhUQwi9Z7wE2kwwC1AM1AE418oU.jpg",
         "name": "Godzilla (Millennium) Collection",
         "id": 374512,
         "poster_path": "/v9fV11I7KVP9xa6UWvW2YlGtErD.jpg"
      },
      "tagline": "Fight to a crumbling fall!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "JPY ",
      "directors": ["Masaaki Tezuka"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Wataru Mimura"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0314111/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNzQxMDU1N15BMl5BanBnXkFtZTcwNDM5MjUyMQ@@._V1._CR6,6,307,436_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Yumiko Shaku, Shin Takuma, Kana Onodera | See full cast and crew »"],
      "reviews": [
         "The opening sequence was down right awesome. Right away Godzilla is out and about stomping through town. Right off the bat I have found things I liked about this movie. One thing that I liked was the fact that Godzilla spits his blue radioactive breathe instead of the fire-like breath scene in Godzilla 2000 or Godzilla X Megaguirus. Godzilla's look also resembles that of the Godzilla 2000 and Godzilla X Megaguirus movies, which is a plus in my book. I found it nice that they mention other monsters either then Godzilla like Mothra and Gaira (Green Gargantuan) in as previous monster attacks against Tokyo. The movie shows some of he science behind the creation of MechaGodzilla instead of say skipping till the end when it is finished or something that some movies do. Other times like Godzilla Vs MechaGodzilla 2 the movie starts with MechaGodzilla already built. This whole thing is another plus for this movie. The storyline is a little better developed then some of the other Godzilla movies. Some of the characters get a little more development at the beginning. Though it is hard to do in relatively short amount of time this movie still gives a nice storyline to go along with the monster aspect. Now onto the monsters. Kiryu, or MechaGodzilla, is the best version of MechaGodzilla to date. It is equipped with many weapons, which include the Absolute Zero Cannon that freezes things instantly. This is a nice touch to the massive MechaGodzilla arsenal. It still has some of the same lasers and missiles as previous versions.In all this MechaGodzilla is my favorite monster (aside from Godzilla) in the whole Millenium series. As mentioned above Godzilla was given his blue radioactive breathe back (he did have it in GMK, but still). This time the breath was a combination of the blue and the fire-like one. Out of all the looks for Godzilla this is one of my favorites. This movie also has Godzilla get powered by electricity as it did in the Showa series. Favorite part of this movie has to be when Kiryu goes crazy and starts rampaging through the city. The whole triggering of memories because of Godzilla's roar was nice. This is just another good area of the movie. I mean it has the man against machine element brought in here while still having the man against monster element. Which in both cases for this movie it is man against their creations (Nuclear weapons made by man created Godzilla). This continues the great storyline of this movie and makes it a little more interesting. The battle between Godzilla and Kiryu was nice. They actually had some physical fighting instead of just having Kiryu blast away at Godzilla the entire time. Both Godzilla and Kiryu got knocked around quite a bit. I mean the movie still has the lasers, missiles, and radioactive heat beams as all the previous movies, which is still good in itself. This epic battle is a great one!! All in all it is an excellent Godzilla movie and should be enjoyed by any Godzilla Fan out there.",
         "Better than last year's GMK, in fact, (still, I give that one ****). After the original Godzilla is destroyed in 1954, Japan has become the stomping ground (pun intended!) for a host of other kaiju over the years(featured in brief flashbacks). A special branch of the Japanese Defense Force is created to counter this threat, resulting in the creation of MechaGodzilla, a biomechanical monster created from the dna recovered from the remains of the original Godzilla. After it's initial encounter with Godzilla, the thing goes berserk when it \"hears\" Godzilla's roar which triggers a genetic memory in the robot's control system, causing it to go on a rampage. GODZILLA vs MECHAGODZILLA returns the Big G to his sci-fi roots. The beginning is very similar to that of GODZILLA vs MEGAGUIRIUS, which is no surprise since it's directed by Masaaki Tezuka, who also directed GxM. The acting is superb, and the special effects are top notch-light years ahead of any premillennial G-films, or even GODZILLA '98 for that matter. I won't give away the ending, but it does leave room for a sequel currently in production in Japan, so stay tuned. Rating: ***** out of *****",
         "Version: Japanese with English Subtitles (Madman's R4 DVD) 'Godzilla vs Mechagodzilla' opens with a typhoon hitting southern Japan, and then a giant monster turns up to lay waste to a small town - everyone runs away - except for the one guy who thinks he can save his house from being stepped on - and the 'Anti-Megalosaurus Force' is called in, and eventually runs away, but not before their commander, Akane Yashiro (Yumiko Shaku) accidentally causes the deaths of several of her troops. Soon we learn the monster is Godzilla, and according to this movie's time-line, Godzilla attacked Japan only once, when he first appeared in 1954. Other monsters have attacked Japan since, but none have been as destructive as Godzilla. With Godzilla's reappearance, those wacky Japanese scientists come up with their best plan yet - they're going to build a Mechagodzilla, with added firepower, and controlled by a 'DNA Computer' using DNA extracted from the original Godzilla's skeleton. Apparently by doing this, Mechagodzilla can think like Godzilla, and will have a reaction time markedly better than that of a normal computer. Obviously this a bad idea, but these Godzilla movies need bad-ideas for the movie to proceed. On the human side of things, Akane Yashiro is assigned to the Kiryu Squadron (Mechagodzilla Squadron), and is met with hostility from her comrades their. Tokumitsu Yuhara, one of the Mechagodzilla scientists spends most of the movie chatting up Akane, while Akane tries to get Tokumitsu's daughter, Sara, to open up to her. Awww, how sweet. Enough of the love-ins, lets get down to some city crushing! The plot is simple, and like several other Godzilla movies, makes some interesting points that it completely skips in favour of monster action (in this case, Japan's rearmament is mentioned, but only briefly), of which is there is plenty. In their respective adventures, Godzilla and his mechanical cousin destroy a few cities and make a mockery of Japan's defence forces (just another day on the job for Godzilla), and get down to one way-cool giant-monster fight scene at the end. Did I mention the fight-scene at is way-cool? My only problem with the movie is the use of the Godzilla suit: there are times when it is plainly obvious that the Godzilla suit is empty, and not for any complicated reason - he just stands there motionless. Otherwise, there was a fair amount of CGI effects, but they were done well enough for me to say \"this movie is awesome\". 8/10 - This movie is awesome. Godzilla fans should check it out.",
         "This film had everything a Godzilla film needs: a bunch destruction, Godzilla fighting another monster with incredible results, and of course, a little camp! The special effects in this film are unbelievable, they are just getting better and better... basically equal to America! There are so many highlights in this film I can't think of all them; the scene with Mechagodzilla falling under the moonlight was fantastic, and as MG is falling, the energy sockets on its back burst flames, resulting in the greatest flying kaiju scene since Gamera 3! Some of you may be thinking \"well the special effects are good, but that is not the most important thing in a film.\" Well, this film had quite a bit of drama which surprisingly was touching, and it all mixed in a Godzilla film very well... connecting the theme all together!! The music and acting was excellent, as simple as that.. The fight scenes between godzilla and Mechagodzilla were great, often having grappling and punching instead of constant beam battles like in the Hesei series. Godzilla's 26th film is one of the greatest G-films of all, almost beating Godzilla, mothra, and King Ghidorah!! Director Mr. Tezuka is directing a sequel to this film, which features two mothra larvae, one Mothra adult, Godzilla, Mechagodzilla, and the giant turtle Kameba, all in an all-out war! It will be great, and will probably top Shusuke Kaneko's Gamera series as long as Mr. Tezuka uses his creative talent of directing, creative camera angles, and spectacular Specail FX!!",
         "This is a classic monster movie as it is supposed to be. SFX are definitely 2000ish and show no big shortcomings. As well, this movie is about monsters levelling cities, or men in suit levelling cartonbox cities: pure&simple. The character development is left to a minimum, but we don't miss it. Other monster movies try to thicken the plot with poor results: here they keep it low profile. There are not many subplots (unlike say Final Wars ) and that makes it less cluttered. Fights are very good and this time Kiryu can actually beat the hell out of Godzilla. Kiryu is no less than some cyborg engineered from the 1954 Godzilla cells & built around that skeleton by a scientist who could syntetize trilobites out of fossil cells i guess. There is the subplot about the scientist & his child daughter still mourning her mother's loss; there is the army girl outcast after a mistake of hers triggers the death of other soldiers, but it's pretty much all there.",
         "This Godzilla movie has a better storyline than any of the other originals. The special effects used were excellent, however the Godzilla and MechaGodzilla (Kiryu) costumes were similar to the ones used in the early Godzilla movies. The performance of Japanese Pop Idol Yumiko Shaku (Yuki from Shura Yukihime/The Princess Blade) was great, she really portrayed her character (Akane Yashino)'s emotions well. The overall its a good movie to watch for fun!",
         "I must admit, I had my worries. So many good and bad reviews. First off, I just want to say both Godzilla and MechaGodzilla, or Kiryu as he's called, looked incredible. This has to be one of the fiercest looking Godzilla suits since the Heisei era. My favorite of the Shinsei era. Plus his heat ray was remarkable, the way it charges up. Kiryu looks cool as hell and has some of the most impressive weapons yet seen in a robot monster. Anyways, Mazakki Tezuka returns to direct and he did an excellent job. Wataru Mimura provides a great screenplay, as usual. Akira Nakao returns, one of my favorite G-actors. Akane is played by Yumiko Shaku, a beautiful actor that gave a very emotional performance. The love story is awkward because there's a huge age difference between her and Dr. Yahara ( Shin Takuma), but it still works. Sara, his daughter, was a bit annoying at times but it helps the story along greatly. Godzilla, despite this being the shortest G-film since the Showa era, gets a lot of screen time. The many battles against JSDF are incredibly well done and I love the Maser Tanks!! The battle in the rain looked awesome and I would love to see a monster battle in the rain in the future. Prior to rumor, you don't have to wait that long for the title monsters to meet. Unfortunately, when they do Godzilla just sits there like a statue, not even flinching. Only the hit from the Maser rays in Kiryu's mouth make him wake up and react to what's going on. This was PATHETIC and I don't know what the staff was thinking but they must have been high to think it looked good. Moving on, then Kiryu goes on a fantastic rampage that looks bad-ass as hell. The drive of Michuru Oshima's music and sound of explosions combine to make a very cool scene. I love that part of the story, Kiryu being part Godzilla, part man's machine to destroy him. How he turns evil, it's just great. In the end, the two meet again, after some nicely done rampage scenes. The first battle makes you wonder, but Tezuka delivers and Yuichi Kikuchi's SFX really kick ass! The CGI is excellent and MechaG even engages in a physical battle with Godzilla. His best weapon is that electrocuting machete, nice. At the climax, we finally see a weapon that really wounds Godzilla. I love that scene, seeing that bloody crater in his chest. The movie is well done and could've been a ten star film, but a few things brought it down, all blasting a star off. First off, Godzilla being a statue when they first fought and secondly, Godzilla isn't exactly what I want him to be. Sure he gets screen time and all, but he's hardly ever mentioned in the dialogue. Plus he hardly interacts with the human characters, and he seems to be more of a afterthought if you ask me. The sequel, \"Godzilla: Tokyo S.O.S.\" , had the same problem. I don't know what went wrong here, because \"Godzilla vs. Megaguirus\" was a remarkable achievement, and yet I felt Tezuka lacked here. In actuality, Kiryu is the main monster, not Godzilla. This was kind of a bother to me. He's basically a villain without character. The film is still a very good one, but the story should've revolved more around Godzilla. The characters just don't talk about him enough.",
         "I saw this film recently. I used to be a big Godzilla fan but the newest one I saw was Godzilla vs King Gidorah from the 1980s so I didn't know what to expect. I saw the 1996 US film and hated it and had heard even worse things about the most recent Godzilla films but this one was great. The special effects were brilliant even though I know for the most part its a man in a suit it doesn't matter. It goes to show that every other country can do it better than Hollywood at the moment. Definitely amongst the best Godzilla films I have seen. Well worth a look. Every thing is great. From the special effects to the music. Even the performances are great.",
         "The story starts with truck load of unknown object being moved out of Tateyama city. Shortly after that, Godzilla appears in Tateyama city. What's the connection ? The object that was moved out of Tateyama city was the remains of the original Godzilla that attacked Tokyo in 1954. Japanese special defense force JXSDF (Japan Counter-Xenomorph Self Defense Force) attacks Godzilla but it's weapons are ineffective against the Godzilla. Prime minister Takushoku (Kumi Mizuno) assembles a team of scientists to build a robot based on the original Godzilla's skeleton named Kiryu (Mechanical Dragon) to counter Godzilla's attack. This movie had good special effects, the Mecha Godzilla (which only Dr. Uhara and his daughter refers to in this fasion in the movie) 's design was by far the best of all Mechagodzillas. They really took the effort to get the details right on this movie with cool looking cargo planes Shirasagi (White Heron) to transport Kiryu from its base to battle ground. Yumiko Shaku's performance as Akane Yashiro was engaging, and acting was believable. The plot was good and the score which was performed by Moscow International Symphonic Orchestra was in my opinion best of all Godzilla series. This Godzilla was just as entertaining as the original Godzilla of 1954 which it pays homage to. None other Godzilla film even comes close to the quality of finish this movie has except for the 1954 original, and for this reason, movie scores a high mark.",
         "Godzila X Mechagodzilla is COOL! I didn't like Godzilla X Megaguirus a lot, but I believe Masaaki Tezuka has improved his G-Flicks in every way. The story is much better and the characters have more depth. mechagodzilla and Godzilla look a lot cooler than before. There's a lot more of a rivalry between the monsters than in GXM. Sometimes the CGI effects look absolutely fake but they have their moments(Godzilla opening his eye and such). Michiru Oshima's score is great, and she uses more themes than in GXM. I have seen the movie in Japanese and English and both jobs are well done. This actually makes me look forward to Masaaki Tezuka's other Godzilla movie to come to America, Godzilla X Mothra X Mechagodzilla: Tokyo S.O.S."
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Toho Company"],
      "summaries": [
         "To protect Japan from yet another monster attack, this time from a new and malevolent member of the Godzilla (Gojira) species, the Japanese government creates a human-piloted cyborg, codenamed Kiriyu, using the skeleton of the original Godzilla (Gojira) that attacked Japan in 1954.",
         "As a typhoon is raging across Japan, and a loud roar alerts the populace that they are once again being visited by a rampaging monster. The military manages to drive the beast back into the ocean, but another attack looks inevitable. In preparation, the Ministry of Science designs Kiriyu, a enormous lizard-like robot constructed from the bones of the first giant monster that attacked Tokyo almost fifty years earlier. Sure enough, just as the finishing touches are being put on Kiriyu, the real monster comes back to settle some old scores. Will the team of crack soldiers at Kiriyu's controls have what it takes to keep Shinagawa, and all of Japan, monster-free?",
         "After the appearance of a new Gojira (Godzilla), the Japanese government builds a robotic Godzilla from the bones of the original monster that attacked TÃf'kyÃf' in 1954 to stop the beast."
      ],
      "budget": 1000000000
   },
   "movielensId": 106243,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2002-11-02",
      "dvdReleaseDate": null,
      "directors": ["Masaaki Tezuka"],
      "runtime": 88,
      "movieId": 106243,
      "title": "Godzilla Against MechaGodzilla",
      "mpaa": "PG",
      "actors": [
         "Yumiko Shaku",
         "Shin Takuma",
         "Kana Onodera",
         "Kô Takasugi",
         "Tsutomu Kitagawa",
         "Kumi Mizuno"
      ],
      "imdbMovieId": "0314111",
      "originalTitle": "ゴジラ×メカゴジラ",
      "genres": [
         "Science Fiction",
         "Action",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After the appearance of a new Gojira (Godzilla), the Japanese government builds a robotic Godzilla from the bones of the original monster that attacked Tokyo in 1954 to stop the beast.",
      "tmdbMovieId": 12636,
      "avgRating": 2.9375,
      "releaseYear": "2002",
      "numRatings": 24,
      "posterPath": "/jbFSVc8aRSguOjUCFp4YJXCDN8Z.jpg"
   }
}