{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1673376",
      "video": false,
      "title": "Free the Mind",
      "recommendations": [
         250784,
         174352,
         174344,
         434234,
         292539,
         159988,
         180383
      ],
      "backdrop_path": "/xZS4Xk7tIQbmzDUL2PeYyLp99bJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4d619251416c75139505",
               "name": "Richard Davidson",
               "profile_path": null,
               "id": 1170821,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4d619251416c75139509",
               "name": "Travis Leanna",
               "profile_path": null,
               "id": 1170822,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d619251416c751394fb",
               "name": "Phie Ambo",
               "profile_path": null,
               "id": 1136913,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d619251416c75139501",
               "name": "Phie Ambo",
               "profile_path": null,
               "id": 1136913,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.598455,
      "production_countries": [],
      "id": 189747,
      "vote_count": 4,
      "budget": 0,
      "overview": "Brain scientist Professor Richard Davidson sets up his mind to conduct an unusual experiment: He will teach American war veterans and children meditation and yoga. Can veterans through meditation and yoga ease their pain and nervous system, find happiness and be more peaceful and get back to a life more like the one they had before the war?",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         376867,
         394117,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Free the Mind",
      "runtime": 80,
      "poster_path": "/va6UROu6SoWw8N0VYdnzpOhRxjL.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-05-03",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Phie Ambo"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Phie Ambo",
         "Phie Ambo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1673376/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2Mjg1Njg2Nl5BMl5BanBnXkFtZTcwMjMzNDgyOQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Davidson, Emma Seppala, John Osborne | See full cast and crew »"],
      "reviews": ["According to the Department of Veterans Affairs, twenty two veterans of the Iraq and Afghanistan wars commit suicide every day, more than die in combat itself. Many more suffer from post-traumatic stress disorder (PTSD) and are compelled to take prescription drugs simply to be able to function. Professor Richard Davidson at The Center for Investigating Healthy Minds in Madison, Wisconsin is looking for a different and more effective way of treatment. Danish director Phie Ambo, in her film Free the Mind, has documented a seven-day study directed by Davidson to see if the brain can be \"rewired\" to achieve stabilizing results that drugs have been unable to. The study used techniques popular in Eastern cultures such as deep breathing exercises, meditation, mindfulness, yoga, and other alternative methods and their report suggests that the program, even after one week, shows promise. (If meditation techniques were indeed found to work better than pills in this situation, my guess is that it would be quickly marginalized by the media acting on behalf of the pharmaceutical industry). Professor Davidson has been meditating for thirty years, much to the chagrin of his colleagues, and states that a conversation he had with the Dalai Lama in 1992 put him on a path to attempt to counter depression and suicide by developing an individual's capacity for compassion and kindness. He says that, \"We actually have no idea of how conscious experience arises from this blob of matter that weighs three pounds. It's really still very much a mystery.\" The film focuses on married veterans Steve and Rich who have come home from the front with self-destructive feelings of guilt about their participation in the war and witnessing the death of fellow combatants that they had become close to. For Rich, the leader of a battalion, his trauma has taken the form of anxiety attacks and an inability to communicate his feelings, even to those closest to him. Both suffer from insomnia and irritability and have lost touch with their childhood innocence and the love they once felt for life. Rich has ended his marriage and is seeking a divorce while Steve's marriage is in jeopardy because of his inability to control his anger. Also participating in the study is five-year-old Will who has been diagnosed with ADHD and is attending a preschool for children, many of whom have similar emotional problems. As a result of his once being trapped in an elevator by himself, Will has a deep-seated fear of elevators and is working with meditation teacher Laura Pinger to use mindfulness techniques to deal with these fears and other social behavior issues. Unfortunately, after a dispute with another boy who ended up in tears, the meditation teacher failed to seize the opportunity to teach the children about sharing or coming up with their own solution to the problem, rather concentrating on a learned script about locating their emotions in the body. Free the Mind comes from the ground of being that the brain is a mechanistic object and Ms. Ambo feels the need to use snazzy visual displays including flashing cable lights to simulate what is happening in the brain, and intrusive Twilight Zone-type music to make sure that we know that something \"mysterious\" is going on. While we can only applaud seeking methods to lessen the dependence on prescription drugs, especially its use on children as young as three, it seems to me that the substituting of one technique for another does not fully address the problem. In my view, it should be part of a broader holistic approach that may include a combination of drugs as well as meditation and breathing exercises, yoga, and large group interaction that can encourage the participants to see that they are not alone and can reach out to others, and to be in touch with a larger spiritual experience of themselves and others. After all, in its essence, meditation is not a scientific tool but a spiritual practice that allows us to expand our awareness and access a deeper reality."],
      "genres": [
         "Documentary",
         "Adventure"
      ],
      "productionCompanies": [
         "Danmarks Radio (DR)",
         "Making Movies Oy",
         "Special Broadcasting Service (SBS)"
      ],
      "summaries": [
         "In 1992 Professor Richard Davidson, one of the world's leading neuroscientists, met the Dalai Lama, who encouraged him to apply the same rigorous methods he used to study depression and anxiety to the study of compassion and kindness, those qualities cultivated by Tibetan meditation practice. The results of Davidson's studies at the Center for Investigating Healthy Minds at the University of Wisconsin, Madison, are portrayed in Free the Mind as they are applied to treating PTSD in returning Iraqi vets and children with ADHD. The film poses two fundamental questions: What really is consciousness, and how does it manifest in the brain and body? And is it possible to physically change the brain solely through mental practices?",
         "Free the mind is the fantastic tale of how one man's vision provides a turning point in the lives of three people. Professor Richard Davidson is one of the world's leading researchers of the human brain. He sets out to discover if, and how, it is possible to physically change the brain using only the power of thought. Steve and Rich are just two out of thousands of American war veterans. Their lives have turned into painful nightmares; restless insomniacs tormented by their own consciences after events witnessed and deeds done during wartime. Will, 5 years old, suffers from ADHD and anxiety. His parents are eager to try other options than those provided by traditional medicine. Can Richard Davidson make a difference?"
      ],
      "budget": 450000
   },
   "movielensId": 106202,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-05-03",
      "dvdReleaseDate": null,
      "directors": ["Phie Ambo"],
      "runtime": 80,
      "movieId": 106202,
      "title": "Free the Mind",
      "mpaa": "NR",
      "actors": [
         "Richard Davidson",
         "Travis Leanna"
      ],
      "imdbMovieId": "1673376",
      "originalTitle": "Free the Mind",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["mJvGZmOhCDo"],
      "plotSummary": "Brain scientist Professor Richard Davidson sets up his mind to conduct an unusual experiment: He will teach American war veterans and children meditation and yoga. Can veterans through meditation and yoga ease their pain and nervous system, find happiness and be more peaceful and get back to a life more like the one they had before the war?",
      "tmdbMovieId": 189747,
      "avgRating": 3.5,
      "releaseYear": "2013",
      "numRatings": 5,
      "posterPath": "/va6UROu6SoWw8N0VYdnzpOhRxjL.jpg"
   }
}