{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2315628",
      "video": false,
      "title": "For Those in Peril",
      "recommendations": [
         358912,
         285856,
         226639,
         26771,
         36714,
         126862,
         40502,
         117549,
         241432,
         119826,
         383462,
         215931,
         223042,
         194104,
         287322,
         166624,
         201419,
         44986,
         138130,
         174309
      ],
      "backdrop_path": "/lVKcpk85K5NI9MP1HeD3sIZHZZ5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Aaron",
               "gender": 2,
               "credit_id": "52fe4d2a9251416c7513224d",
               "name": "George MacKay",
               "profile_path": "/sCaq9tY5QJcWB56fHL37Po9Bg8W.jpg",
               "id": 146750,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d2a9251416c75132251",
               "name": "Michael Smiley",
               "profile_path": "/muzJQpsKJ4srfVpyRa7qkrRYWSq.jpg",
               "id": 17078,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d2a9251416c75132255",
               "name": "Nichola Burley",
               "profile_path": "/843UInoHza4noNjlGJDAt4E1g85.jpg",
               "id": 74440,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Cathy",
               "gender": 1,
               "credit_id": "52fe4d2a9251416c75132259",
               "name": "Kate Dickie",
               "profile_path": "/nEcvqwrXakqhOX8fa3WZIhGAjA1.jpg",
               "id": 71083,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4d2a9251416c7513225d",
               "name": "Jordan Young",
               "profile_path": null,
               "id": 1186791,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d2a9251416c75132261",
               "name": "Conor McCarron",
               "profile_path": "/ao3RiRloV8c6dglzAMJPRJZoKKB.jpg",
               "id": 239562,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d2a9251416c75132237",
               "name": "Paul Wright",
               "profile_path": null,
               "id": 1032801,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d2a9251416c7513223d",
               "name": "Paul Wright",
               "profile_path": null,
               "id": 1032801,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d2a9251416c75132243",
               "name": "Mary Burke",
               "profile_path": null,
               "id": 1127666,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d2a9251416c75132249",
               "name": "Polly Stokes",
               "profile_path": null,
               "id": 1169686,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.253332,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 187927,
      "vote_count": 7,
      "budget": 0,
      "overview": "Aaron, a young misfit living in a remote Scottish fishing community, is the lone survivor of a strange fishing accident that claimed the lives of five men including his older brother. Spurred on by sea-going folklore and local superstition, the village blames Aaron for this tragedy, making him an outcast amongst his own people. Steadfastly refusing to believe that his brother has died, he sets out to recover him and the rest of men.",
      "similar": [],
      "original_title": "For Those in Peril",
      "runtime": 93,
      "poster_path": "/oGNFwYN6kehsBWFtau96SDib5fx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Warp Films",
            "id": 12180,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Warp X",
            "id": 17817,
            "origin_country": ""
         }
      ],
      "release_date": "2013-05-18",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Paul Wright"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Paul Wright"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2315628/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNzQ1NjEzNl5BMl5BanBnXkFtZTgwODA5NzU4MjE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: George MacKay, Kate Dickie, Michael Smiley | See full cast and crew »"],
      "reviews": [
         "The Edinburgh International Film Festival 2013 Presents: Writer, Director Paul Wright creates a beautiful poetic tale, exploring the power of love and loss in his deep, visceral and emotionally charged feature debut. Aaron, an awkward outsider in his small fishing community, returns home after surviving the boating tragedy that claimed the lives of all else aboard, including his elder brother Michael (Jordan Young). Aaron, who feels increasingly frightened and isolated, can remember no details of what happened. He not only struggles with the guilt felt from being the only survivor, but the guilt imposed on him by a community who will not readily forgive him for being alive, while their loved ones are dead. In his loneliness and anguish, Aaron reaches out Michael's fiancée (Nichola Burley) which fuels the communities suspicions and anger further, in particular Nicola's father (Michael Smiley). \"Do you think if you believe anything enough, it'll become true?\" asks Aaron. With his state of mind worsening by the day, Aaron, propelled by folklore and local superstition clings to the hope that Michael is still alive, and thus sets out to save him from \"The devil in the ocean\". Wright's feature debut is a strong character drama that explores psychological trauma through a visceral coloured palette and a rich, compelling and thought provoking narrative. Wright uses almost every aid at his disposal to ensure the audience feels and experiences Aarons increasing fragility, torment and state of mind, and he balances it note perfect. This is achieved through a tapestry of visual formats (Super8 footage), sound, folklore and news articles that blur the lines between reality and fantasy. These methods of storytelling never force an idea, but rather tease the audience with possibilities, allow them to draw their own conclusions. Wrights prominent direction and vision is felt throughout the narrative, but it must be said, his cast deserve as much recognition. George Mackay gives a powerful, sad and heartbreakingly honest performance as our troubled lead, Aaron. Kate Dickie provides the emotional centre of the film, and exists as Aarons only buoy in stormy waters, in a town that has outcast one of their own. Cathy performance although understated encapsulates the heartbreak and strength of a mother who wrestles with her own grief, whilst trying remain strong for her now, only remaining son. Both performances are quite simply stunning and career defining. It could be argued that the film becomes stagnant in its second act, refusing to move on in narrative, busying itself with visual flourishes and techniques that slow the pace. I however enjoyed these moments and found they added intrigue, beauty and mystery to an already compelling film. In-Short As someone I know put it, \"For those in peril is as deep, scary and as beautiful as the sea itself\" For all my other film reviews and movie ramblings head to www.moviereviewworld.com",
         "Borderline mental illness is not one of the most commercially appealing genres, so this is the sort of movie that has absolutely no chance of any box office success, anywhere in the world. This movie upset me enormously, worried me, scared me and made me extremely sad. And I loved every minute of it, so I know that I am in a peculiar minority. George MacKay playing Aaron was truly extraordinary. Even though his filmography shows that he was pretty much a child star, it isn't easy to play a rather unpleasant role during the period when you have spots all over your face and no muscular definition to speak of. On top of that, shooting the film must have been a nightmare considering the number of scenes shot in the cold sea. I worried about what would happen next the same as in a Hitchcock movie or any number of modern thrillers. Was somebody going to be killed unexpectedly. What on earth was the main character trying to do? The ending of the film was both unexpected and marvelous and whether or not it was a hallucination or a psychotic episode does not matter to me.",
         "Aaron is the sole survivor of a fishing boat accident that still pains the community. Having lost his brother in the accident, Aaron grieves, but his grief gives way to an increasingly fragile grip on reality. For Those In Peril could have been a myth-imbibed exploration of tragedy and sibling rivalry. It could have been an insightful depiction of unhinged grief. It could have been a story of personal redemption achieved in the face of a hostile community. While it hints at exploring all of these potential story lines, what it ends up being is an under-realised mish-mash that fails to cohere around any thematic, emotional or narrative thread. The film ever-so studiously chases art-house credentials, but invokes clunky genre devices that would make Michael Bay blush. For example, there is no need to wonder what the community makes of Aaron's miraculous survival of the tragedy, as this is relayed constantly in off-screen expositional comments by various bystanders. The cliché scene where someone with a lot on their mind dries up in front of a karaoke audience, so often seen on screen but never in real life, makes a jaded outing here. (Who in real life would ever ask a grieving mother to get on stage and sing karaoke?). You do not have to have spent time in fishing communities such as Ullapool and Shetland to feel the lack of authenticity of setting, though it will jar all the more if you have. Similarly, if you have known grief, Kare Dickie's one-note moping around will not invite empathy. In terms of a mind becoming unhinged, the film does better, with George MacKay's performance occasionally evoking both fear and concern. But these moments are far too few, as the script seems unable to handle the task of developing rounded characters, and falls back instead on lazy invocation of myth to bind the story, what there is of it, together. I am all for eschewing linear narrative in favour of an immersive experience, but none of the imagery is particularly memorable. The climax places its bet on one striking image, but instead that is fudged in an extreme wide shot, suggesting the production design of the model was not up to the job of providing the emotional whump this film requires at its end. Ostensibly bold and experimental, this film instead is tame and unimaginative. Perhaps learning how to handle the basics of simple story, well-told, would have been a better move for these clearly uninspired filmmakers.",
         "This film seemed to have such promise as it developed, but ultimately that promise was squandered by a fizzler of an ending and many missed opportunities for more interesting storytelling along the way.  As the sole survivor of a boat tragedy, Aaron seemed initially to be unfairly shunned by the other residents of his small Scottish fishing village - but later developments give an inkling into the reason that he attracts such hostility.  Unfortunately, the film takes too long to get there and does nothing with the new narrative turn.  While the decision to leave the boating tragedy completely unexplained may have seemed a good one to the filmmakers, for the audience it just further serves to underline the hollowness at the heart of the narrative.  By taking too long to say too little, the film fails to sustain atmosphere, story or emotion.  Its haphazard use of locations means that it is also unable to sustain a sense of place, with each scene feeling like a separate, dull bead spaced widely along a thin thread of narrative.",
         "A story of a younger sibling trying to recapture the life he believes he had before a tragic incident leaves him the only survivor, living in a small community where all but his mother and his dead brother's girlfriend turn against him, a community where he was raised. Severely underdeveloped in character motivation (what is leading him? his brother's death? the tale his mother told him? or would he have been like this anyway given how the backstory unfolds), held together by a mix of hand held plus supposed home movies, none of which provide a coherence (my companion was really bugged by the relentless shots of the back of his head). Too many questions, such as who's view is this? Who is behind the home movies,and why? Who is filming on board the fated boat? At one point, when he straps the knives together I thought for a moment we were returning to NEDS (which I liked). Much of this was cliché - hands trailing over cement walls, held up to light;a horse suddenly on the beach. And the ending? I am not sure what to make of that. Many of the scenes could have been taken out as I wasn't sure they were propelling the story, or the scenes were too short so didn't lead anywhere, eg Aaron wearing the mask but no-one noticing. Given the good reviews, I must have missed something!",
         "..i didn't quite know what to expect - probably some action on see, webbed in some atmospheric scenes.. it takes a minute or two until i realised the topic. you can see very clear how confusing and actually kinda impossible it is to point your finger on this if it happening in front of you. a lot of judgement comes to mind about self-responsibility..or the lack of. the mind of a schizophrenic/bipolar person is actually like two different persons - i know, kinda common knowledge, but at least i was always looking for a connection between the both..for a response from the 'true self' in everyone in the them. because its not like you realise it that clear when you watch/talk to/are involved with someone. there can be so many reasons for actions that take place, that an actual mentally illness is nothing that comes to mind that easy. unless really drastic things happen..than you start wondering, but can't really believe it. like it happens to the boy in the movie. better his friends, family, neighbours. but you have to take it as serious as if your life, and that of others, depends on it. i really loved the ending. you could say he died on sea and in his and his mothers mind he came through and freed his brother. and himself. it looks maybe like a romantic version of the truth but for me it felt much more real than any other attempt of explaining something you don't even understand.",
         "Scottish screenwriter and director Paul Wright's feature film debut which he wrote, premiered in the International Critics' Week section at the 66th Cannes International Film Festival in 2013, was screened in the Michael Powell Award Competition section at the 67th Edinburgh International Film Festival in 2013, was shot on locations in Scotland and is a UK production which was produced by producers Mary Burke and Polly Stokes. It tells the story about a son and brother named Aaron who lives with his mother named Cathy in Gourdon, Aberdeenshire in Scotland. After returning from a fishing boat accident where his brother named Michael and four other men were taken by the sea, the citizens of the community wonders why he doesn't have any memory of what happened and places the blame for the accident on him. Although Aaron becomes alienated, he is convinced that his brother his still alive. Distinctly and acutely directed by Scottish filmmaker Paul Wright, this quietly paced fictional tale which is narrated by the main character and mostly from his viewpoint, draws a heartrendingly reflective portrayal of a sole survivor whom whilst missing his brother hangs on to a childhood story his mother used to tell him and his brother when they got scared, and turns to his brother's girlfriend named Jane whom he thinks is the only one that will believe him. While notable for its naturalistic, distinct and atmospheric milieu depictions, versatile cinematography by cinematographer Benjamin Kracun, production design by production designer Simon Rogers and use of sound, colors and light, this character-driven, monologue-driven and narrative-driven story where a fairy-tale becomes a reality to a person who believes that everything will be fine again if he can bring his brother back, depicts a densely internal study of character and contains a great and timely score by composer Erik Enocksson. This eloquently mysterious, distinguishable and somewhat sociological indie which is set in a coastal village in Scotland in the 21st century and where the one who were not taken by the sea takes on a responsibility for something he isn't responsible for so that things can return to the way they were and a mother stands by her ostracized son, is impelled and reinforced by its fragmented narrative structure, substantial character development, rhythmic continuity, powerful use of music, remarkable use of flashback scenes, humane examination of its central themes, the singular acting performance by English actor George Mackay and the reverent acting performances by Scottish actress Kate Dickie, English actress Nichola Burley and Scottish actor Jordan Young. A resonating and profoundly elegiac audio-visual poem for those in peril at sea which gained the Douglas Hickox Award Paul Wright at the 16th Möet British Independent Film Awards in 2013.",
         "Thanks to her role in 'Game of Thrones', the biggest name (okay, pretty much the *only* name) in 'For Those in Peril' is Kate Dickie. But she's not the lead: that responsibility falls to the husky young George MacKay. He plays Aaron, the sole survivor of a trawler tragedy which claimed the lives of five other men (one of whom was his brother). The small, close-knit fishing community regard him with suspicion: why did he survive when everyone else died? Only his mother (Dickie, adding to her extensive repertoire of Working-Class-Women-Who-Nobly-Suffer) and his brother's fiancée have kind words to say to him. Gradually, Aaron becomes more and more withdrawn and disturbed. If you think this is the kind of story that can only end in tears, you'll be right, sort of. The film makes much use of home-video footage to show the close relationship of Aaron and his brother, and voice-over vox-pop interviews with the villagers to explain their feelings about his survival. I thought these were clever devices, as they added to the realism of the piece: and there is a very strong sense of realism about the film (even leading man MacKay's acne is not covered with make-up). But that makes the ending such a rude shock: what had seemed to be a portrayal of one man's mental breakdown under unbearable grief and guilt instead veers into fantasy and fairytale. That, I felt, spoiled things. The acting? As I said above, Dickie has played this part several times before, and she does it as well as she ever does. MacKay could perhaps have been a bit less monotone and starey - but hats off to him for the many scenes where he had to swim in what must have been the freezing waters of the North Sea - he should get a medal!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Warp X",
         "Warp Films",
         "Film4"
      ],
      "summaries": [
         "Aaron, a young misfit living in a remote Scottish fishing community, is the lone survivor of a strange fishing accident that claimed the lives of five men including his older brother. Spurred on by sea-going folklore and local superstition, the village blames Aaron for this tragedy, making him an outcast amongst his own people. Steadfastly refusing to believe that his brother has died, he sets out to recover him and the rest of men.",
         "Aaron, a young misfit in a remote Scottish community, is the lone survivor of a strange fishing accident that claimed the lives of five men including his older brother. Spurred on by sea-going folklore and local superstition, the village blames him for this tragedy, making him an outcast amongst his own people."
      ],
      "budget": 0
   },
   "movielensId": 106436,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-05-18",
      "dvdReleaseDate": null,
      "directors": ["Paul Wright"],
      "runtime": 93,
      "movieId": 106436,
      "title": "For Those in Peril",
      "mpaa": null,
      "actors": [
         "George MacKay",
         "Michael Smiley",
         "Nichola Burley",
         "Kate Dickie",
         "Jordan Young",
         "Conor McCarron"
      ],
      "imdbMovieId": "2315628",
      "originalTitle": "For Those in Peril",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["FTGM9CX_Ugs"],
      "plotSummary": "Aaron, a young misfit living in a remote Scottish fishing community, is the lone survivor of a strange fishing accident that claimed the lives of five men including his older brother. Spurred on by sea-going folklore and local superstition, the village blames Aaron for this tragedy, making him an outcast amongst his own people. Steadfastly refusing to believe that his brother has died, he sets out to recover him and the rest of men.",
      "tmdbMovieId": 187927,
      "avgRating": 3.66667,
      "releaseYear": "2013",
      "numRatings": 6,
      "posterPath": "/oGNFwYN6kehsBWFtau96SDib5fx.jpg"
   }
}