{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111159",
      "video": false,
      "title": "Shatter Dead",
      "recommendations": [
         78253,
         171703,
         58200,
         79975,
         87469,
         29692,
         58864,
         83404,
         81478,
         68180,
         40252,
         61909,
         30996,
         72648,
         29611
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe491f9251416c910a36f3",
               "name": "Flora Fauna",
               "profile_path": null,
               "id": 1277853,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Susan",
               "gender": 0,
               "credit_id": "52fe491f9251416c910a36f7",
               "name": "Stark Raven",
               "profile_path": null,
               "id": 1204276,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe491f9251416c910a36ef",
            "name": "Scooter McCrae",
            "profile_path": null,
            "id": 99996,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.331962,
      "production_countries": [],
      "id": 85024,
      "vote_count": 4,
      "budget": 0,
      "overview": "Depressing tale about a world of the undead and a woman's trek to get home to her boyfriend's house.",
      "similar": [],
      "original_title": "Shatter Dead",
      "runtime": null,
      "poster_path": "/frtUhb8ixzt9Lzu7FFLvpnn78b6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1994-12-13",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scooter McCrae"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Scooter McCrae"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111159/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMTYxNjg5NF5BMl5BanBnXkFtZTcwMjg2OTIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Stark Raven, Flora Fauna, Daniel 'Smalls' Johnson | See full cast and crew »"],
      "reviews": [
         "After hearing much hype about this supposedly graphic yet thoughtful zombie movie I gave it a shot, much to my dismay. Strait-jacking Romero's infamous 'Dawn of the Dead' line about there being no more room in hell for it's plot, 'Shatter Dead' follows the exploits of a rather unpleasant female as she attempts to get to her boyfriend in a world were the dead don't die. Along the way she meets assorted boring humans, a wack-job preacher, and some living dead just trying to get by. The film tries for high-concept, but lays limp at low-execution. The locations look like spots near the director's home, the actors don't ever act, the script is thin past the set up, the gore FX aren't convincing, the direction is uninspired, etc, etc. Just nothing about it ever works. The film could have tried to rely upon the strength of the set-up to at least flirt with some existential examination, but instead the filmmakers fall back on dime-novel psycho-babble and pseudo-religious rhetoric. As far as providing exploitive thrills, yet again the promise is not delivered. There is some violence and blood/gore, but it's cheaply executed and badly edited together. On the sexploitive front, things fare no better. While there is a fair amount of nudity, it is mostly of the lead female who (I am sorry to say) is not very attractive. For the whole movie only one bit, just one, actually stood out; a late movie sex scene where a blood drained zombie male is forced to strap on a hand-gun in order to engage in intercourse. That one blurb of exploitive lunacy accounts for the 2 rating. Not much of a horror movie, not much of a sexploitive movie...just not much of a movie. 2/10",
         "Having read of this film and its charms in such reputable genre magazines as \"Rue Morgue\" and \"Fangoria\" over the past eight years or so, I finally got around to viewing \"Shatter Dead\" in its newly released DVD format. That said, I find myself shaking my head (and just shaking in general) as to how anyone with an IQ higher than that of the most scholarly of algae could summon up anything positive to say about this terrible waste of time and money. While the premise of having the living dead trying to live amongst us is an intriguing one to this long-time viewer of hardcore porn, (Oops! Did I say hardcore porn? Sorry, I meant to say zombie movies.) there is nothing at all intriguing about watching a lousy student film (which is to say, a student film) shot directly to video, starring said student's film school chums running around backyards and stripmalls with the same blatantly latex makeup jobs as if they'd all consumed cases of Schlitz Malt Liquor with Vicatin chasers. Much more interesting would be a film about a pencil factory where the evil CEO falls into the grinding machine and his soul comes to inhabit millions of number two pencils the world over. Mankind, armed only with his own moxie and a few good pencil sharpeners, in the end are no match for this fiendish plot, and soon succumb to the heathen pleasures of permanent and non-permanent inks. I call it, \"Get the Lead Out!\", and while it may not exactly be coming to a theater near you anytime soon, when it does, you will find it a much more harrowing experience than say, \"Shatter Dead\", and you will believe (!!!), or, at the very least, you'll think twice before chomping on our bright yellow friends. As I close, I am reminded again of this kindergarden klownfest's declaration that \"God Hates You!\". Well, duhh! Tell me something I don't know! Of course God hates me. He told me to watch \"Shatter Dead\".",
         "When I borrowed a friend's copy of Shatter Dead, I expected to get some thrills of the zombie gore-fest variety. What I received was really really bad. It wasn't even good in a really really bad way. The first thing that upset and disgusted me was not blood or wanton violence but rather that it was shot on video, not film, immediately cheapening the whole experience. The pictures on the DVD case (yes, DVD) misled me into thinking that this would be a professional piece of work. I have seen many low-budget films, but this takes the prize for worst makeup. Some characters, many of which I'm sure were willing locals and student volunteers, donned grey paint on their skin. Others had some some cheap looking gashes about the face. Most, however were not made up at all. It was also very slow paced, a bit confusing and featured both flat staging and acting. It was hard to tell whether it was the poor acting or the poorly written lines (\"Don't be scared, I'm scared too\") were what made me want to turn it off. Having ripped in to this movie quite a bit, it's only fair to share some highlights. Indeed writer/director, Scooter McRae puts an interesting spin on the old living dead yarn that discusses \"souls\" as being un-killable, despite condition of the body. It also receives my thumbs up for explicitly using, one more than one occasion, a hand gun as a phallus. It's also encouraging to any aspiring filmmaker to see the manifestation of McRae's ideas and labor, on DVD no less. I guess it won some sort of award, too. Bottom line, this flick is for hardcore low-budget horror fans only. If, on the other hand, a friend owns it you might want to watch it. If not for a laugh, then at least to broaden your filmic horizons.",
         "I had heard that this movie was so cool and creative, so I had high expectations. I was immediately disappointed when the movie started and the picture looked like it was filmed by a camcorder. The female lead's acting is so bad, I contemplated turning the dvd off. That bad. I kept on watching because I paid a pretty penny (more than the average price for a dvd) to get a copy of this movie (from the distributor). I also wanted to see if the story and gore were any good. Good luck. The story is about a girl trying to get back to her apartment, that's it. There was some crappy gore and a xxx scene involving the female lead, her boyfriend and a pistol (a pellet handgun in reality). You can probably figure out the rest. I threw away the dvd, just as I threw away my money when I bought it.",
         "More regrets: I have to be the biggest sucker in the world. What other person would go out and buy so many of these backyard home video horror movies? Why did I buy into all the hype that these little genre websites give to these pieces of garbage!? Well I've learned my lesson. Yes, I was an idiot to go out and buy so many of these films but having done so, I feel safe in saying that any positive reviews that junk like this gets has to be written by cast members or the directors themselves because there's no way anyone besides people involved who could actually like this crap. First off, this is not a movie for fans of traditional zombie films! Shatter Dead is a cheap looking home video. It's not a horror film in any sense, it's nothing more then a wanna be art film. It's got the most vile looking cast ever assembled to carry the lame story forward. It's got the lowest production values I've ever seen and I've seen a lot of these type films lately. There was no way of getting behind any of the character's because they all sucked! A bunch of art film school students making a video in their backyard. Nothing more!!! The only good thing about this garbage was the DVD sleeve which worked like a charm in suckering me into buying it. If one is desperate for a z-grade zombie film then they'd be better to look into MEAT MARKET 2 which I also recently bought. While that movie was nothing great either, it's at least a zombie film that entertains the viewer. Shatter Dead does nothing but annoy and bore the viewer. 0/10 AVOID!!!!!!!!!!!!!!!!!!!!",
         "'Rage...building. Contempt...growing. 'Hatred...inevitable.' This 'film' is a crime against humanity. I watched in horror as the movie progressed from one clip to the next. When it was silent, I begged for dialog. When there was dialog, I plead for silence. ****SPOILER**** Apparently, the dead have risen, but all they really want is a good job and benefits. The hero tries to stay away from some rather lame bad guy, and ends up becoming one of the undead. Sound generic? It was...except for the almost pornographic pistol sex. Plot? Story? Character? PHAW! Who needs 'em? Please, God, let this be the last time any living creature has to view this fetid pile of monkey droppings. Never, ever watch this movie. Never. Never...never.",
         "Ugly. Ugly would be the single word to describe this 'home movie'. Ugly writing, ugly direction, ugly lighting, ugly sets, ugly acting and ugly actors, sheesh! I don't have many qualms about nudity in films...but I've never witnessed that much unwanted nudity in my life. The make-up falls in to the 'Dime Store' variety; I've seen children with better make-up jobs on Halloween. In the 'Special Features', the director talks about going to film school (and he has the nerve to bash actual film makers and other film schools). Anyway, I'll give him the benefit of the doubt and assume he went to film school AFTER shooting this home movie mess.",
         "This movie wouldn't be as bad if it just had a half way decent leading actress in it. All through this movie I had to look a pathetic looking vagabond wandering around zombie town searching for a place that had non-dead existing humans left. I still couldn't understand why two half way good looking guys even considered this woman good looking. Anyway....This story starts off as Susan finishes her grocery shopping and is soon attacked by a group of zombies with the most unconvincing makeup that wouldn't even be fit for trick or treating on Halloween. This makeup looks as if it were bought at your local Dollar Store and slapped on a few innocent cheap paying bystanders. And then there is the Preacher who for what reason I don't know is in this movie steals Susans car and leaves her alone to fend for herself. She then shacks up at a local house where there are more ugly people like her living there and the house is soon invaded by a man dressed as Howard Sterns character Fart Man (they couldn't have that much originality so they they had to borrow from none other than Howerd Stern) who then shoots up the place and all the zombies are dead. I did think that the baby incident was a little gross but laughable as I watched a plastic doll being breast fed in a bloody bathtub. I do not recommend this film at all to anyone unless you cannot afford a doctor to cure you of your insomnia or that you have the need to loose weight by laughing so much.",
         "GOD HATEs YOU Of course he does!He made possible the distribution of this incredible piece of \"whatever\".No one in his right mind or an IQ over 2 digits can possibly love this movie and I' pretty sure that most of the good comments we hear about it are from people who played in it or family members and by the way if you had the extreme pleasure of playing in this home video production would you show it to your family members? I'm a zombie fan and I never thought that the day would come when I'd have to say this but, I'm a shamed...I spent time and money trying to find this piece of art and I have to admit this is the WORST attempt to entertainment ever made on the face of this earth. Finally if you are brighter than a \"Q-Tips\" do the Devil a favor don't buy this cause then you'll be convinced \"GOD REALLY HATES YOU\"",
         "~Spoiler~ Another big disappointment here. I remember reading glowing reviews for Shatter Dead in Fangoria way back in the day when these movies weren't readily available to me. During that time I could only read what Fango said about these wild, indie films and imagine what they'd be like. I didn't imagine Shatter Dead to be this terrible. I'd also read a lot of essays and reviews by the writer/director, Scooter McCrae, and he always seemed intelligent and knowledgeable of his subject matter. So I was really blown away by how awful this flick was. What I thought was going to be the storyline was great. The dead are returning to life but they are not flesh-eating ghouls. They just want to exist in our world (I think McCrae was alluding to the homelessness situation here, but I may be looking too deep). Sadly, that aspect is dropped all too quickly and meaningless gore and porn is introduced. Not what I wanted to see, to be sure. Thankfully someone (the French no less) ran with a similar idea and made the quite surprising They Came Back. I'd urge you to watch that film instead."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Tempe Video"],
      "summaries": [
         "In a horrible turn of events, the people of this world go on living even in death. With gangs about killing people to share in their misery, and people (corpses) confused, it is indeed a bleek future. When Susan, not yet dead, is faced with her boyfriend's impending trek home, she does her best to cope.",
         "Depressing tale about a world of the undead and a woman's trek to get home to her boyfriend's house."
      ],
      "budget": 0
   },
   "movielensId": 106609,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-12-13",
      "dvdReleaseDate": null,
      "directors": ["Scooter McCrae"],
      "runtime": 0,
      "movieId": 106609,
      "title": "Shatter Dead",
      "mpaa": "",
      "actors": [
         "Flora Fauna",
         "Stark Raven"
      ],
      "imdbMovieId": "0111159",
      "originalTitle": "Shatter Dead",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "Depressing tale about a world of the undead and a woman's trek to get home to her boyfriend's house.",
      "tmdbMovieId": 85024,
      "avgRating": 1.5,
      "releaseYear": "1994",
      "numRatings": 2,
      "posterPath": "/frtUhb8ixzt9Lzu7FFLvpnn78b6.jpg"
   }
}