{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt1703049",
      "video": false,
      "title": "Trigun: Badlands Rumble",
      "recommendations": [
         14572,
         285592,
         55426,
         55430,
         20529,
         72037,
         63641,
         64994,
         22914,
         120811,
         48361,
         52120,
         135832,
         46955,
         63439,
         69598,
         97342,
         91847,
         173056,
         92968
      ],
      "backdrop_path": "/xnS3livu4Q1BhJzm1ReOj4S0v0e.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1005,
               "character": "Vash The Stampede",
               "gender": 0,
               "credit_id": "52fe4808c3a36847f8154f83",
               "name": "Masaya Onosaka",
               "profile_path": "/8Nu3PwPFure0MW9YtPSvwwA60cC.jpg",
               "id": 125617,
               "order": 0
            },
            {
               "cast_id": 1006,
               "character": "Milly Thompson",
               "gender": 1,
               "credit_id": "52fe4808c3a36847f8154f87",
               "name": "Satsuki Yukino",
               "profile_path": "/biGCf5klZP8IFHOBaMl0bGPWRx6.jpg",
               "id": 112205,
               "order": 1
            },
            {
               "cast_id": 1007,
               "character": "Meryl Stryfe",
               "gender": 0,
               "credit_id": "52fe4808c3a36847f8154f8b",
               "name": "Hiromi Tsuru",
               "profile_path": "/oaIWrqxdoFd1ErdmCSlIIIIZAVF.jpg",
               "id": 122193,
               "order": 2
            },
            {
               "cast_id": 1008,
               "character": "Amelia",
               "gender": 1,
               "credit_id": "52fe4808c3a36847f8154f8f",
               "name": "Maaya Sakamoto",
               "profile_path": "/4f8l14Q9XjkG2YTKxZC5egDphv6.jpg",
               "id": 9711,
               "order": 3
            },
            {
               "cast_id": 1010,
               "character": "Nicholas D. Wolfwood",
               "gender": 2,
               "credit_id": "52fe4808c3a36847f8154f99",
               "name": "Sho Hayami",
               "profile_path": "/HU9LZJdb4H8coHiSaHiUprcFm1.jpg",
               "id": 144773,
               "order": 4
            },
            {
               "cast_id": 1011,
               "character": "Gasback",
               "gender": 2,
               "credit_id": "52fe4808c3a36847f8154f9d",
               "name": "Tsutomu Isobe",
               "profile_path": "/qP5vQMIbLNvSsSFkEMLZRVt4ZW5.jpg",
               "id": 20661,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4808c3a36847f8154f73",
               "name": "Satoshi Nishimura",
               "profile_path": null,
               "id": 144766,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4808c3a36847f8154f79",
               "name": "Yasuhiro Nightow",
               "profile_path": null,
               "id": 144768,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4808c3a36847f8154f95",
               "name": "Shigeru Kitayama",
               "profile_path": null,
               "id": 104722,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58ebb0d0c3a3684aa407875f",
               "name": "Satoshi Nishimura",
               "profile_path": null,
               "id": 144766,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.290729,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 51859,
      "vote_count": 30,
      "budget": 0,
      "overview": "In a quicksand surrounded town called Makka, rumors spread of a legendary robber named Gasback is after the town. To protect it, Mayor Kepler has hired bounty hunters. These hunters have been following Gasback from town to town in hopes of getting the bounty. Vash the Stampede is in town, along with Meryl and Milly, along with the female bounty hunter Ameria and Nicholas D. Wolfwood.",
      "similar": [],
      "original_title": "トライガン バッドランド ランブル",
      "runtime": 95,
      "poster_path": "/AcYGkLY2ALu0OhPmiHnYmLOz3iy.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "FUNimation Entertainment",
            "id": 3964,
            "origin_country": ""
         },
         {
            "logo_path": "/72thYMKJUagID5KUi4QuXZBFwE2.png",
            "name": "Madhouse",
            "id": 4288,
            "origin_country": ""
         }
      ],
      "release_date": "2010-04-02",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.trigun-movie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Satoshi Nishimura"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Yasuhiro Nightow",
         "Satoshi Nishimura"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1703049/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NTI5NjQxNF5BMl5BanBnXkFtZTcwNjQ2MDk0NQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Baker, Ed Blaylock, Johnny Yong Bosch | See full cast and crew »"],
      "reviews": [
         "Trigun Badlands Rumble is a very good movie, with some nice nostalgia for Trigun fans. It's in the style of the first half of the series, Vash wandering around getting into trouble and helping people out. He runs into our cool heroine of the movie, Amelia, and she's quite likable. Of course, Meryl, Millie, and Wolfwood are in the house as well. The story here is not black and white with good guys and bad guys, it's interesting in that the villains of this movie aren't all that evil, and overall the movie has a more laid-back feel than you might expect. One cool aspect is how they incorporate Vash's past and how old he is, by tying in a flashback from 20 years prior into the current events. We have some nice fun dialogue, great slapstick humor, a crazy bar brawl, lots of action, and a bit of drama to give it some weight. The animation is the most flawless aspect of the movie, the art is detailed and it's lushly done. There's a lot of great detail, and all the wacky background characters have a lot of care put into them. Overall, though the plot takes a couple clever turns, the movie is just a nicely done, very straightforward light action romp, done well. I enjoyed the ending especially, which had a nice way of commenting on Vash's ideals. And of course, this movie is even better for letting us hang out with those classic Trigun characters for another hour and a half. Check it out!",
         "I wish I could write about spoilers. But I can't. And I won't out of principle. But more on that later. I got to see Badlands Rumble during its world premier run at Sakura-Con 2010 in Seattle. This was almost a year after seeing the world premier of the trailer and the panel at Anime Expo in 2009. I had been excited about this since the rumors started, and the at the panel I was given a taste of what the movie could be. By the time I finally saw it I didn't care that it was raw and I couldn't understand more than just a couple of passing phrases. It was Trigun. It was a movie. It had the original cast. It was SHINY. And oh yeah. Wolfwood was back. I sat in a fangirl stupor enjoying the pretty on the screen. So that's why I really can't write about spoilers - I suppose I could try and give something away via analyzing the animation, but I could be very, very wrong. Chronologically speaking, Badlands Rumble takes place somewhere in the middle of the series. Hence Wolfwood still being alive. The prologue is dated about twenty years (I think) before the start of the series, but the bulk of the movie takes place in the middle of the series. In addition to fan favorite characters returning (including Wolfwood, but you should know this already), there are a handful of new characters created just for the movie. In terms of animation, it's much sharper and cleaner than the TV series - basically it's what the TV series would look like if they made it today. It should be noted, however, that despite the ten year gap in production between the series and the movie, the character designs are the same. No radical make-overs, they just look cleaner and sharper. Seriously, visually speaking, the movie is a treat. A major coup for the movie is the return of the four original cast members. No word on if it will cross over into the dub or not (if Funimation is smart, they'll have the four main actors return). Another coup is Tsuneo Imahori returning for the music. While it's not the exact same tracks from the series, the spirit of the music is the same, all while keeping an independent feeling unique to the movie. Big Damn Movie, indeed! As my friends and I exited the auditorium, Satoshi Nishimura thanked everyone who attended at the door. My friends and I enjoyed ourselves so much we actually bowed and thanked him for the honor of allowing us to attend one of the first screenings of the movie. He got all embarrassed and I swear he blushed. But seriously. Well deserved praise, Nishimura-san. It should be noted that the first time a recognizable character appeared on screen, the whole room went up in cheers and whoops of joy. Even when Kuroneko-sama appeared. Actually, every time Kuroneko-sama appeared. I think it goes to show just how much the American audience loves Trigun, and the fact that even ten years later it could get its very own Big Damn Movie. I have no idea what its reception at Anime Expo was this year (as it had finally been subtitled at that point), but I can imagine that it was just as enthusiastic as it was at Sakura-con, especially given how packed the Trigun movie panel was the year before. I cannot wait until this movie comes out on DVD. I was completely blown away by watching it raw, I'm sure that feeling will be ramped up to eleven when I can finally understand what they're saying.",
         "I just saw the movie, and I have to say it was quite an experience, it brought back fond memories of one of the best Animes I've ever seen, Trigun is truly an epic. The animation was top notch, fighting sequences were great too, the story was predictable but that wasn't a bad thing. You really have to thank the creators for their great vision, Vash the Stampede's character is pure genius, he's the hero that everybody loves and respects, and you'll find this apparent in both the TV series and movie. Kudos to everyone who worked on this, hopefully a dub will come along soon. A must watch to all the Trigun fans.",
         "I saw this about a month after finishing the show, and I realized I should have seen it sooner. Badlands Rumble is one of those few cases where the movie that is based on a show is up there with the show itself in quality. The animation keeps a style similar to the one of the original show, but it is updated to todays standards...and I LOVE IT! Vash is back, Wolfwood's back, the insurance girls are back...even Kuro- Neko-Sama makes a glorious return! In other words, all the good characters are back, as good as ever. Even the new characters like Gasback for example are very good. And thank you Madhouse for bringing back Tsuneo Imahori to make the soundtrack! I love the original soundtrack so much and was really happy to see his name in the credits again. No one makes Trigun music better than Imahori-Sama, no one! Trigun: Badlands Rumble is *beep* awesome and feels a lot like one of those episodes that never made it into the show, based on the story and feeling. I just love this movie!",
         "This was a good movie: Even when the plot feels pretty much like a extended episode of the original series (More exactly, one of the first 11 episodes, before things start to turn more dramatic and serious) I think it was entertaining enough, having some of my favorite elements of \"Trigun\", such as the good balance of comedy, adventure and seriousness and very likable characters. The animation from this movie was excellent, showing a huge improvement in comparison with the original anime. The same goes for the art and the designs, which keep the same style from the television show. Without being as great as the last episodes of the \" Trigun\" anime series, this movie worked very well for me as a very enjoyable and well made animated flick.",
         "So some of you might be angry or annoyed that I haven't given this film a good score (since so far the ratings have been good) but there is a very good reason I do so. It is more to try and not have your expectations to high for the film, which is what I did when waiting for this film to come out in Australia this month. So as Trigun being my favourite anime of all time and being a huge fan to it, here is my review. I did have very high expectations for this film because of how much Trigun, the anime series, impacted me with its emotions and morals and especially how Vash was as a character. When I first watched the series, Vash the Stampede was the type of person I wanted to be, though maybe not including the situation he was in. And even though I do mostly prefer the Japanese dub in anime, I did watch the English dub first and thought the characters voices suited perfectly. Saying this, I did realize before watching the movie all the English voice actors weren't the same and thought they did a great job of each character, especially Meryl's character. I personally think the voice actors were fine. This is where we get to the main issue, the movie itself. I personally didn't fully understand the theme of this film, or even the point. I was hoping for another intense, confronting moment with Vash's past and his serious side in where his morals come into conflict with everything around him, which is one of the reasons I loved the series. Though the movie was a huge side story which was similar to the first half of most of the episodes in the anime series and possibly more focusing on being an action film. This theme was not very strong because of the lack of amazing action in the film. Trigun Badlands animation is amazing. There is this shot in the opening of the anime series which is shown in telling about Vash's past in the movie and it looks absolutely stunning. With the animation being so amazing though, there is a lack in amazing action scenes. every now and then you go \"oh that was cool\" but nothing that makes you grip your seat in excitement action, which it needed badly. I really felt everything was squashed into this one movie because the movie wasn't fully focused on the fans but for new audiences as well. The characters (especially Vash) did not act the same way in the series. I know this type of opinion is from a fan based point of view but Vash seemed... almost annoying because he is trying too hard to pretend to be an idiot where it felt more natural in the series. I don't blame the voice actors but more so the script and plot. Some of the scripting in the English version was plain typical of most American cartoons where sometimes, the characters would just state the obvious for no reason. Saying this, the movie has its moments. One of the scenes in the movie was hilarious where Milly and Meryl along with Vash and Amelia are in a bar drinking away. So much credit has to go to the drawing because of the facial expressions being so priceless. Some more scenes just work perfectly but still does not make up for this entire film. My biggest let down was the music. The Trigun Series Original Soundtrack has to be one of my favourite soundtracks not just because it has so much emotional connection to the series but because it was written so well with so many themes you could relate to. If the movie had kept the same composer, I would imagine this movie would have had more impact on the trigun fan audience. While watching this film, I wanted to believe so much that I was wrong and that I just viewed it wrong or something stupid. But as I did watch it again, this is how I do feel about the film. The film was good but its more of a feeling of I wish it was better, wishing this film could've satisfied your Trigun needs. Though I have said not a lot of good things about this film, I still suggest checking it out but you might feel better not buying the film and maybe even renting it just in case the film was not your cup of tea also."
      ],
      "genres": [
         "Animation",
         "Action",
         "Sci-Fi",
         "Western"
      ],
      "productionCompanies": [
         "Flying Dog",
         "Madhouse",
         "Shonengahosha"
      ],
      "summaries": ["20 years after meddling into the bank heist of a notorious robber named Gasback, Vash the Stampede is heading towards Macca City. Rumors say that the legendary thief might appear there causing an enormous influx of bounty hunters in the area who want to collect the $300,000,000 prize for his head."],
      "budget": 0
   },
   "movielensId": 106762,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2010-04-02",
      "dvdReleaseDate": null,
      "directors": ["Satoshi Nishimura"],
      "runtime": 95,
      "movieId": 106762,
      "title": "Trigun: Badlands Rumble",
      "mpaa": "",
      "actors": [
         "Masaya Onosaka",
         "Satsuki Yukino",
         "Hiromi Tsuru",
         "Maaya Sakamoto",
         "Sho Hayami",
         "Tsutomu Isobe"
      ],
      "imdbMovieId": "1703049",
      "originalTitle": "トライガン バッドランド ランブル",
      "genres": [
         "Science Fiction",
         "Action",
         "Comedy",
         "Animation",
         "Western"
      ],
      "youtubeTrailerIds": ["jWBEG0VHCZ8"],
      "plotSummary": "In a quicksand surrounded town called Makka, rumors spread of a legendary robber named Gasback is after the town. To protect it, Mayor Kepler has hired bounty hunters. These hunters have been following Gasback from town to town in hopes of getting the bounty. Vash the Stampede is in town, along with Meryl and Milly, along with the female bounty hunter Ameria and Nicholas D. Wolfwood.",
      "tmdbMovieId": 51859,
      "avgRating": 3.72083,
      "releaseYear": "2010",
      "numRatings": 120,
      "posterPath": "/AcYGkLY2ALu0OhPmiHnYmLOz3iy.jpg"
   }
}