{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2628830",
      "video": false,
      "title": "Marriage Material",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bcdc3a368484e199bf3",
               "name": "Kentucker Audley",
               "profile_path": "/oFeyT31aUrh9GHzsjLuvm713lyl.jpg",
               "id": 107766,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4bcdc3a368484e199bf7",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4bcdc3a368484e199bfb",
               "name": "Kris Swanberg",
               "profile_path": "/pktiebuU6WYJB6Z4b6D75xVK2cg.jpg",
               "id": 45423,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bcdc3a368484e199bff",
               "name": "Caroline White",
               "profile_path": "/1J3Ly2MJnzJAfAFmKUUtkSUCblZ.jpg",
               "id": 1107178,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4bcdc3a368484e199c03",
               "name": "Adam Wingard",
               "profile_path": "/1REtc4xYwyT2XcbGCJbCEtvBBwm.jpg",
               "id": 98631,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bcdc3a368484e199be9",
               "name": "Joe Swanberg",
               "profile_path": "/nG4oDcuPaNmk8lnSyzQi9UDLRbl.jpg",
               "id": 40863,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bcdc3a368484e199bef",
               "name": "Adam Wingard",
               "profile_path": "/1REtc4xYwyT2XcbGCJbCEtvBBwm.jpg",
               "id": 98631,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.194149,
      "production_countries": [],
      "id": 134372,
      "vote_count": 2,
      "budget": 0,
      "overview": "Emily and Andrew, a young couple living in Memphis, agree to babysit their friend’s 6-month-old for a day. The experience causes them to examine their own relationship and their feelings about marriage and children.",
      "similar": [],
      "original_title": "Marriage Material",
      "runtime": 55,
      "poster_path": "/qE0Z476yPpHpfhl5ne3csrwIdQn.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-01-12",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "https://vimeo.com/34790491",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joe Swanberg"],
      "runtime": 55,
      "synopsis": null,
      "writers": [
         "Kentucker Audley",
         "Amanda Crawford"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2628830/",
      "coverLink": null,
      "actors": ["Stars: Kentucker Audley, Amanda Crawford, Joe Swanberg | See full cast and crew »"],
      "reviews": ["Director Joe Swanberg, over the course of his small yet notable film career, has taken a deep and intimate look at the active sexuality, technology, and activity commonly associated with the twentysomethings of the current generation. His film Hannah Takes the Stairs was a fine and delightfully quiet look at post-college listlessness, shot in the mumblecore style, utilizing the talents of Greta Gerwig, Andrew Bujalski, and the prolific and reliable Mark Duplass. Swanberg was also responsible for bringing us one of the several shorts in the horror anthology V/H/S, which was enjoyable to an extent. In that film, he capitalized off the use of webcams to create a seemingly normal, yet unsettling atmosphere, which, I believe, few directors are willing to touch. Now comes his short film, Marriage Material, which is easily accessible online on the video-sharing site Vimeo. It's a fifty-five minute glimpse in the life of two people in their late twenties in an open relationship that begin to question their togetherness and the ideas of conforming to the America Dream. The ideas are had by Andrew and Emily (Kentucker Audley and Caroline White) after they take the infant child of their friends (Swanberg himself and his wife, Kris, respectively) off their hands while they have a night out. During their brief stint with the child, Emily seems to have taken a fond liking to the baby and the experience of nurturing it and giving it a safe home, while Andrew is simply content and unmoved positively or negatively by the ordeal and almost sees it as another thing that will get in the way of his writing. When the child goes back home with their friends, Emily and Andrew contemplate their relationship status, the looming thought of marriage, which is proposed by Emily, and the possibility of welcoming a child or more in the world. The first act primarily details with brief, detailed conversations between the four about the pros and cons of having a child, while the second act is almost entirely comprised of one long static shot of Emily and Andrew laying in bed discussing all of these tops. The third act, on the other hand, is different from the previous because it is almost obsolete of all dialog and centered on the day-to-day life of the two. The third act in itself is arguably when the film speaks the most, and then we see that Swanberg may be a more gifted impressionist than we had previously thought. Swanberg does a lot in Marriage Material, in terms of providing modern day marital commentary and proposing a small, manageable amount of issues for the cast of amateurs to tackle, but his characters don't always say a lot, contrary to one of the basic principles of mumblecore filmmaking. Only in the second act, which runs about fifteen minutes, do we get fulfilling, consistent, rapid-fire dialog, yet in the concluding shot we are nourished with deep thought and contemplation on the differences between mental life and the dating life. This film has a different back-and-forth style to it that makes it flow a little strangely, but also makes it a very interesting and unique experience. Consider the characters and notice how Swanberg's calm writing asserts them into a position of comfort and genuine subtlety. I'm growing more and more weary of directionless and sometimes comical marriage fights in films that feel forced and set up in order to allow the plot to tread deeper waters. Swanberg doesn't set up the marital fights in the conventional sense where one character says something impulsively, the other responds in an insulted way, the one who said it apologizes on a whim, yet the other isn't totally content on accepting it. Swanberg allows the characters to talk openly and meaningfully during the second act and doesn't try to initiate hastiness or plot points for the sake of doing-so. It's also pretty apparent that Swanberg, a married man of six years himself, is trying to capture the real life of marriage and not the cinematic life. The cinema has sort of captured marriage in the way where it's always on the brink of falling apart or so frothy and allowing that each party acts as though they were single. There's a great sense of building monotony in the lives of our characters, and what we're feeling is only a taste of what they're feeling. When Emily proposes the idea of marriage, and Andrew isn't totally sure he wants to pursue that life, we see the concluding long shot of both of them doing yard work, pretty similar to that of a married couple. I get that what is being communicated is that married or not, life doesn't change in a big way between you and your partner, except for maybe a certificate and an expensive rock on your finger. We get the feeling that if marriage was adopted by these two characters that they'd experience a greatly miserable future. Marriage Material is a work of primitive cinema that has much more to say than almost anything currently playing in theaters. If it chosen to be seen by brave married couples, it will provide them with plenty of topics to discuss long after the film was over (possibly mimicking the lengthy second act in this film), and could even generate a competition among singles and those who are dating. Kentucker Audley and Caroline West work wonders in their lead roles, utilizing richly improvised dialog that flows in a simple and compelling way, and Swanberg uses the ideal runtime of fifty-five minutes, where modern romantic comedies that do nothing but tack on a perfunctory, feel-good ending tack on an extra hour or so to the already bloated run time. NOTE: It's also wonderful that Swanberg chose to make this film easily accessible to an already overblown audience. The entire film is available for free via Vimeo, http://vimeo.com/34790491"],
      "genres": ["Drama"],
      "productionCompanies": ["Swanberry"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 106820,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-01-12",
      "dvdReleaseDate": null,
      "directors": ["Joe Swanberg"],
      "runtime": 55,
      "movieId": 106820,
      "title": "Marriage Material",
      "mpaa": "",
      "actors": [
         "Kentucker Audley",
         "Joe Swanberg",
         "Kris Swanberg",
         "Caroline White",
         "Adam Wingard"
      ],
      "imdbMovieId": "2628830",
      "originalTitle": "Marriage Material",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Emily and Andrew, a young couple living in Memphis, agree to babysit their friend’s 6-month-old for a day. The experience causes them to examine their own relationship and their feelings about marriage and children.",
      "tmdbMovieId": 134372,
      "avgRating": 3.33333,
      "releaseYear": "2012",
      "numRatings": 3,
      "posterPath": "/qE0Z476yPpHpfhl5ne3csrwIdQn.jpg"
   }
}