{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "bear",
            "id": 10468
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "overalls",
            "id": 209100
         }
      ],
      "imdb_id": "tt0120381",
      "video": false,
      "title": "True Heart",
      "recommendations": [],
      "backdrop_path": "/4DdLxxFiU7c9GdTEMcjra0YpbI3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bonnie",
               "gender": 1,
               "credit_id": "52fe45dfc3a36847f80df5e7",
               "name": "Kirsten Dunst",
               "profile_path": "/hA5wdCWKbRi7vOZExgEuGxakLsA.jpg",
               "id": 205,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Sam",
               "gender": 2,
               "credit_id": "543fcebec3a368410d000030",
               "name": "Zachery Ty Bryan",
               "profile_path": "/aDRbXDiLbmNGB6GYmNcVFP5UTZ8.jpg",
               "id": 52477,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Khonanesta",
               "gender": 2,
               "credit_id": "52fe45dfc3a36847f80df5ef",
               "name": "August Schellenberg",
               "profile_path": "/iZ7dQ3JMdrWoUyh4vB8vOxhqoSI.jpg",
               "id": 18260,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Wanda",
               "gender": 0,
               "credit_id": "5358d4aac3a3685601009f46",
               "name": "Dey Young",
               "profile_path": "/gJuNn1Iw7UKopsDrhbfiDCV9XJS.jpg",
               "id": 39568,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dick",
               "gender": 2,
               "credit_id": "5358d4b5c3a36855eb009d55",
               "name": "Michael Gross",
               "profile_path": "/nYCWEUdFbMo2JJo2Hd9KHNcP2GS.jpg",
               "id": 67015,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe45dfc3a36847f80df5e3",
               "name": "Catherine Cyran",
               "profile_path": null,
               "id": 98940,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "54821fae9251416e810069f6",
               "name": "Catherine Cyran",
               "profile_path": null,
               "id": 98940,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.184961,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41831,
      "vote_count": 11,
      "budget": 0,
      "overview": "A brother and sister are plane-wrecked in Canada, where they must rely on the help of a native and his bear.",
      "similar": [
         258480,
         244772,
         401898,
         62177,
         297762,
         281957,
         858,
         141,
         634,
         112160,
         376867,
         437557,
         242224,
         11421,
         370663,
         8966,
         98,
         587,
         8810,
         808
      ],
      "original_title": "True Heart",
      "runtime": 92,
      "poster_path": "/eaNtnGXNXXnpPzLjQyXRBlDbsju.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
         "name": "Orion Pictures",
         "id": 41,
         "origin_country": ""
      }],
      "release_date": "1999-02-17",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Catherine Cyran"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Catherine Cyran"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120381/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNzI0Njc1MV5BMl5BanBnXkFtZTcwMTUzNjEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kirsten Dunst, Zachery Ty Bryan, August Schellenberg | See full cast and crew »"],
      "reviews": [
         "I thought this was a pretty good adventure flick. Perhaps not for everyone, but it was an entertaining midday movie if nothing more. This movie is definitely more for kids and families. Some of the elements verge on magical (which has got some of the commenters on this site up in arms but I think the point is to suspend your disbelief - it's an adventure flick for children), morality plays a huge role and the line between good and evil is clearly defined. Basically it's the story of how 2 children, Bonnie and Sam, find their way to safety after their plane crashes in the wilderness, helped by nature-loving wilderness-man Khonanesta and hindered by a group of greedy, selfish poachers with guns. The kids sort of find themselves the middle of an existing battle over the bears. There are a few moral issues raised, which is standard and I think appropriate for the target audience. The conservation of nature vs the greed of the poachers (who are clearly defined as \"bad guys\" from the get-go). Acceptance and looking beyond first impressions are major themes - the kids have to learn to trust Khonanesta who seems strange to them at first (they also have to trust the bear to a degree). There is also an ongoing moral sub-plot about how they can't let go of the memory of their dead father and have a strong resentment towards their stepfather which Khonanesta tries to help them resolve. Kirsten Dunst is always good, and always seems to have a knack for action/adventure- which this movie is certainly equal parts of. The Home Improvement kid was pretty stilted, didn't seem to really make much of his character which made parts of the script drag. Their relationship could have been more convincing. The Khonanesta character was a bit clichéd in the way he spoke, but I can't really see any other way they could have got the story across in a way that English speaking children could understand. If you're looking for gritty realism you won't find it here, but if that's the case get outta the family section and grab something based on a true story. If you're after a story of hope and courage - family style - then you're on the right track with this one.",
         "I've seen True Heart on TV and I think it's fine. It is a family movie, and like most of family movies this one tries to give you moral values, and it's fun. It's pretty fine for me. I liked this movie because of the ecological sights and also because it's an innocent movie, good for kids. Kirsten Dunst is great as one of the lost kids in the forest. The story is about two kids that have a plane accident. The plane crashes in a forest. After they find out the pilot was dead, they meet a native. This native and his friend bear help them to find the way back to civilization, but some hunters want to ruin their plans because they want to kill the bear. It's basically this. I give a 6 out of 10.",
         "Bonnie and Sam are teenagers in a plane flying across a mountainous wilderness (we're never told exactly where, but the mountains are too high to be in the eastern U.S.). The plane goes down and the adults in the plane appear to be dead, so they are left on their own until an old Indian finds them and offers to help them get back to civilization. He says they will need his help because of the bad men. It turns out there are poachers in the area, and the teens would have been in trouble without him. The kids offer to find help, once rescued, to do something about the poachers, but the Indian does not want help (we later learn one reason why this might be true). The Indian teaches the kids a lot about getting along in the wilderness, and rescues them from several dangerous situations (they also get to rescue him once or twice). We also learn that the teens are brother and sister, and that they lost their father. Their mother has remarried, and Bonnie in particular doesn't like their stepfather. Among other things, the Indian teaches the kids that they still have their father inside. Later, the Indian goes back to the plane without the kids, fearing that the people searching for the kids will encounter the poachers. This was pretty good though it may not be a classic. August Schellenberg gave a fine performance as the Indian, though he talked like Tonto and that may offend some people (I assume this reflects a lack of contact with white people, since the Indian seems very intelligent). And I've liked Kirsten Dunst ever since she was a little girl in 'Little Women'; she didn't disappoint here. The scenery is magnificent, and wildlife shots quite good. The credits say nothing about animatronic bears but assure us animal action was carefully monitored so that no actual harm came to the bears. Some good work, then, was done with those bears. And the music was quite distinctive: nearly all of it sounded Native American or close to it, with some really good vocal performances in what sounded like Indian languages (there was even one song with children). Speaking of children, the youngest ones probably shouldn't see this. Among the reasons: the plane crash itself is quite scary, and there are several scenes where the poachers fire shots at people who they believe might be interfering with them (when the Indian is around, he fired back using arrows, but no one appeared seriously injured). The poachers threaten the children with guns when the Indian isn't around, and there are the usual scenes with one or both teens in danger. Also, one of the bears steps into a painful trap, gets taunted by the poachers, and is finally shot. The extent of the injuries to the poachers involved is not quite clear, but the other bear attacks several poachers. This was an edited version I saw, but there were still a few curse words (nothing too major). SPOILER: Also, one of the poachers is apparently killed by a bullet.",
         "This is an entertaining family movie, with gorgeous scenery and wonderful native music throughout. While the plot gets a little far-fetched in spots, it is still fun to watch. Kirsten Dunst turned in a terrific performance, and the subtle moral lesson is an added bonus. My only real problem with this movie is the repeated reference to the Kodiak. This movie takes place in British Columbia, Canada, but the Kodiak Bear (a sub-species of the Brown or Grizzly Bear) is only found on the isolated Kodiak Island, Alaska.",
         "I have actually to this date seen the last half hour of this movie. But let me tell you, the music was just awesome. I loved the voices, and the Indian music. I wish there was a score CD available. A great movie overall!! Kirsten Dunst is great, and pretty",
         "This one of the best movies that I have seen in a long time. I recommend it for anyone that loves the wild life and I would say that it is a good movie for kids. The music is great wish that I could get the sound track. Know how I can get it?",
         "This is a fantastic adventure flick. Kirsten Dunst is electrifying! Regrettably, Zackary Ty Bryan is not so fascinating. His character is too solid and cold. His attitude was a major drawback. Despite that whoever played Conanesta was wonderful and brought spirit to his character. The scenery is zesty and lively. 9 out of 10.",
         "The reason True Heart doesn't get a ten is because it does simplify certain situations, which lower the films believability. However, this does not ruin the film, if you are the type of person that doesn't expect life to always show up as black or white. Also, given that young children are a part of its target audience, it makes sense not to make the stories events too involved. Children are great at using their imaginations to fill in the blanks, or at just accepting something at face value. So don't get stuck on the few moments in the film where moments are oversimplified. Instead, let yourself get lost in the amazing, beautiful scenery, and the mystical and magical undertones that leave you feeling inspired and hopeful about life, and the world. Yes, the Native American is slightly stereotyped, but look past that to his modeling of how to embrace, be respectful, patient, compassionate, passionate, reverent, graceful, courageous, kind and caring. As for the children, perhaps the heart on her sleeve, leaping in, openly passionate girl's character is easier to connect with, but the boy's character, with his closely held emotions, quiet passion, cautious - but still open to the world around him - exploration might be more interesting, if you give him a chance. If nothing else, they are a nice complement to each other... a good reminder of how different, yet similar we are as human beings. Go on, watch this film using your child-mind. View it from a place of curiosity, innocence, and imagination. You won't be sorry.",
         "I tuned in and i thought that it was going to be a bad film, but i was miss lead by what i had red about. I have to say that however great an actress Kirsten Dunst is, she seems to have the same type of emotions in every film that she does. I though Zachery Ty Thomas was a great asset to the film and overall it was very enjoyable to watch. Totally worth watching 8/10",
         "Contains Spoilers Sorry I can't see how this movie was ever green lighted. I recognized a young Kirsten Dunst instantly. Written for very young viewers. Anyone older than ten will not put up with this crap. The continuity is awful, with many things (like Khonanesta somehow escaping being locked up in a shed), never explained. There is sloppy editing, lousy dialog, and poor acting to boot. Gunshot wounds that appear to bother the victims less than a mosquito bite. More than once, the poachers have a clean shot to kill the Kodiak, yet somehow fail to pull the trigger and let the bear attack them. The bear even chases 4 men with loaded rifles away from their camp. Hmm, come to think of it, if their gunshots were so ineffective, I would run too. Kirsten Dunst leaves her jacket in one direction while they escape in another, only to kick up dirt and gravel in the opposite direction so they could easily be tracked. A poacher shot with an arrow, in a scene that looks fatal, later re-appears later without a scratch. An old clue cloth (that looks plastic coated), with an insipid riddle that leads the way to a sacred Indian place. Writer/director Cyran's script may have looked good on paper, but the low budget, poor acting and bad direction make this a film to avoid. Interesting only to Kirsten Dunst enthusiasts (she looks very very young here) One Star"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Orion Pictures"],
      "summaries": ["A brother and sister are plane-wrecked in Canada, where they must rely on the help of a native and his bear."],
      "budget": 0
   },
   "movielensId": 106887,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-02-17",
      "dvdReleaseDate": null,
      "directors": ["Catherine Cyran"],
      "runtime": 92,
      "movieId": 106887,
      "title": "True Heart",
      "mpaa": "PG",
      "actors": [
         "Kirsten Dunst",
         "Zachery Ty Bryan",
         "August Schellenberg",
         "Dey Young",
         "Michael Gross"
      ],
      "imdbMovieId": "0120381",
      "originalTitle": "True Heart",
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["NqV9UTvUFiY"],
      "plotSummary": "A brother and sister are plane-wrecked in Canada, where they must rely on the help of a native and his bear.",
      "tmdbMovieId": 41831,
      "avgRating": 1.25,
      "releaseYear": "1999",
      "numRatings": 2,
      "posterPath": "/eaNtnGXNXXnpPzLjQyXRBlDbsju.jpg"
   }
}