{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0089488",
      "video": false,
      "title": "The Life & Adventures of Santa Claus",
      "recommendations": [],
      "backdrop_path": "/gSwfkrTaReTMNPluGfXYCLK0fkD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Santa Claus",
               "gender": 2,
               "credit_id": "52fe477ac3a36847f8137d91",
               "name": "Earl Hammond",
               "profile_path": null,
               "id": 197547,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "King Awgwa",
               "gender": 2,
               "credit_id": "52fe477ac3a36847f8137d95",
               "name": "Earle Hyman",
               "profile_path": "/9asrD1BfigpdXg0UvDjk1JbWCWN.jpg",
               "id": 177937,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Commander of the Wind Demons",
               "gender": 2,
               "credit_id": "52fe477ac3a36847f8137d99",
               "name": "Larry Kenney",
               "profile_path": "/xfV4vhQdVw3vHsfXv6IH17lhxQJ.jpg",
               "id": 354368,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Queen Zurline / Wife / Additional Voices",
               "gender": 1,
               "credit_id": "52fe477ac3a36847f8137d9d",
               "name": "Lynne Lipton",
               "profile_path": null,
               "id": 246960,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Tingler",
               "gender": 0,
               "credit_id": "531267acc3a3682a020031e2",
               "name": "Bob McFadden",
               "profile_path": null,
               "id": 224778,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe477ac3a36847f8137d87",
               "name": "Jules Bass",
               "profile_path": "/6QU9zlGh3BA4DN4h4bNv5ZfLo6e.jpg",
               "id": 16410,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe477ac3a36847f8137d8d",
               "name": "Arthur Rankin, Jr.",
               "profile_path": "/ea8EC04C9VhDd0iMpIyCmZHnMak.jpg",
               "id": 16411,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.335832,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48880,
      "vote_count": 3,
      "budget": 0,
      "overview": "The Great Ak calls a council of the Immortals to ask that Santa Claus be given immortality. And to justify it, he tells the history of Santa Claus. The Ak found an abandoned baby and gave it to a lioness and a fairy to raise, who named him Claus. When Claus grew up, the Great Ak showed him the evil and hardship in world and Claus decides to live there and relieve some of the suffering. He decides to make toys for orphans, but King Agua, the ruler of the valley where Claus lives doesn't want the chidren to be happy. and there is a great battle among Immortals.",
      "similar": [],
      "original_title": "The Life & Adventures of Santa Claus",
      "runtime": 50,
      "poster_path": "/h8VMHxMrPqaBpQYqBsUEpioVnbf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/65PkdDSyh6fwXgwg47x73pvgWiW.png",
         "name": "Rankin/Bass Productions",
         "id": 688,
         "origin_country": ""
      }],
      "release_date": "1985-12-17",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Jules Bass",
         "Arthur Rankin Jr."
      ],
      "runtime": 50,
      "synopsis": null,
      "writers": [
         "Jules Bass",
         "L. Frank Baum"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089488/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODIwMjg5MjE3NF5BMl5BanBnXkFtZTcwODE1NDcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Earl Hammond, Earle Hyman, Larry Kenney | See full cast and crew »"],
      "reviews": [
         "I thought this was a beautiful and surreal stop motion animated film. It's certainly superior to the cell animation version. I thought it was beautifully done by the Rankin / Bass people- who brought us such classics as Rudolph the Red Nosed Reindeer, The Little Drummer Boy, Frosty the snow man, among many other holiday specials. I don't think this has been released to DVD yet and it's a shame that it hasn't been. It's a true classic. It's based on the short story by L. Frank Baum, author of The Wizard of Oz. In fact, though neither movie tells you this, the immortal fairies in this story are the ones who enchanted The Land of Oz to begin with. If you love beautifully done fantasies and stop motion animation I highly recommend this movie. I read another review that called this film pagan and frightening- I think this person was looking for reasons to hate it and simply didn't understand the fantastical creatures portrayed. It's not scary at all, it's quite beautiful, just not what you'd expect. You should keep an open mind when viewing it, it's quite beautiful.",
         "The only reason I ever even heard of this was by putting in blank VHS tapes out of boredom one day when I was about 10. For me this movie has special meaning because I used to watch it with my buddy when we were little. We could probably recite almost ever word and sing every song. But about the movie itself, it is a rare gem that almost nobody has ever heard of. This is a side of Christmas that is so refreshingly different, bearing absolutely no resemblance to any other Santa story ever written, capturing the Christmas spirit in its own way. This gets a full 10 from me for the stunning art-work of its creation and magical creativity that brought it to life. Go get it! Journey with Clause from the forest of Berzee to the Laughing Valley of \"Ho Ha Ho\" in this one in a million production. Expect the unexpected with characters such as Peter Nook, the great Ak, and the commander of the wind demons.",
         "I have watched this movie since i was little, and for all i do admit the subject and the themes used in the movie are slightly darker then the average kids movie, it is one of the best i have seen. I've always loved the entire premiose of the story, and the characters are brilliant, especially the Commander of the Wind Daemons (The Bat like Creature) and Blinky the Cat.",
         "If you prefer fantasy to holiday hokum, you'll want to check this one out. A little dark at times for very little ones, this stylish take on the Santa story will appeal to older children or little ones accustomed to fantasy and fairy tale themes. Alive with Faerie folk of all kinds it offers a colorful journey through Santa's life. Santa is not spared the horrors of the human world, however, and this story illustrates how he developed compassion for the human race. Very moving in parts, this story gets to the heart of the Christmas spirit, without getting preachy or religious.",
         "when i first saw this movie, i completly loved the songs, but now that i've got it recorded and got another look at it, i found that i loved the storyline. the characters were amazing, i loved how they represented themselves, and the scenery, i just loved this film for........ everything it had.",
         "This was one of my favorite Rankin-Bass productions. This particular telling of the Santa story is based on L. Frank Baum book of the same title: \"The Life and Adventures of Santa Claus.\" The immortals are gathered by the Great Ak to decide whether or not the mortal Santa deserves the honor of becoming immortal (something the immortals can only grant once). The story is narrated by Ak and recounts how he found the young babe and watched over him as he was raised by some of the nymphs and animals that fell under Ak's jurisdiction. As with any Rankin-Bass stop animation production the creature concepts can be wildly imaginative (and scary... the Nooks tend creep me out, but I wouldn't mind a plush version of one) and be sure that there are numerous musical outbursts as the story progresses. This Baum story has also recently received an animated retelling. I am saddened that this particular version does not receive as much airing time, but I am very grateful that we always recorded Christmas specials when I was younger. I recommend this to anyone who enjoys Rankin-Bass holidays escapism and has an imagination that enjoys being stimulated.",
         "AWESOME CLAYMATION Christmas CLASSIC...a must have for the Christmas holidays .It is unfortunate that the networks no longer show this tale of how Santa Claus becomes the symbol of Christmas. This tale has gods ,elves,fairies and Santa Claus . If you like the Lord of the Rings ,Harry Potter and other Rankin and Bass classics , then this will be a welcome addition to your movie collection.I have seen this movie so many times and every time I see something new. However, do not buy this UNLESS YOU CAN STAND SEEING IT YEAR-ROUND.This is sort of hard to find so get it when you see it .I OFTEN SEE THE WELL KNOWN OTHERS LIKE RUDOLPH THE RED NOSE REINDEER AND THE ABOMINABLE SNOWMAN but this one is sort of rare .",
         "Somehow, most Christmas related movies and specials seem to be sendemental, campy or some times even sickening sweet. But \"The Life and Adventures of Santa Claus\" is a big relief from those Holiday special clichés. Think of putting together a typical Rankin Bass special, Mythology of the British Isles and Jim Henson's \"The Dark Crystal\" and you get this movie about a mortal named St. Nicholas and how he came to be. Some people seemed to complain about the film being too dark. But face it, some things may tend to be *gasps* ARTISTIC, and *gasps* original and *gasps* not sappy or an un-artistic film just made to tell you to shell out your bucks on the crappy merchandise. If you catch this on TV or on any VCR format, or if you love \"The Dark Crystal\" or Mythological based films, you will love this special. I know I do!",
         "In this adaptation of L. Frank Baum's story, produced by Rankin Bass, we see how Santa came to be, from his origin an immortal to his dedication to bringing presents and happiness to kids around the globe. It's a better story than the 'true meaning of Xmas' crud we're used to in Xmas Specials. Erasing th 'birth of Baby Jesus' angle was also a wise move. I'd never heard of the novel until I saw this special, but it seems kinda similar to The Wizard of Oz. The music by Bernard Hoffer is also notably better than the usual medley of Xmas carols. I guess it doesn't rate too highly among the rest of the holiday clutter, but certainly worth watching.",
         "I've never heard the \"raised by faerie folk\" story of Santa before. It was refreshing to see fantasy wood elves instead of the usual fat bearded ones. The council around the table looked as if they were drinking Wassail and celebrating the Winter Solstice. If you grew up playing D&D, you'll most likely enjoy this!"
      ],
      "genres": [
         "Family",
         "Animation",
         "Musical",
         "Fantasy"
      ],
      "productionCompanies": ["Rankin/Bass Productions"],
      "summaries": [
         "The Great Ak calls a council of the Immortals to ask that Santa Claus be given immortality. And to justify it, he tells the history of Santa Claus. The Ak found an abandoned baby and gave it to a lioness and a fairy to raise, who named him Claus. When Claus grew up, the Great Ak showed him the evil and hardship in world and Claus decides to live there and relieve some of the suffering. He decides to make toys for orphans, but King Agua, the ruler of the valley where Claus lives doesn't want the chidren to be happy. and there is a great battle among Immortals.",
         "At a council convened by The Great Ak, the forest being tells the story of Santa Claus to explain why he deserves to made immortal."
      ],
      "budget": 0
   },
   "movielensId": 106986,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-12-17",
      "dvdReleaseDate": "2009-11-17",
      "directors": [
         "Jules Bass",
         "Arthur Rankin",
         " Jr."
      ],
      "runtime": 50,
      "movieId": 106986,
      "title": "The Life & Adventures of Santa Claus",
      "mpaa": "G",
      "actors": [
         "Earl Hammond",
         "Earle Hyman",
         "Larry Kenney",
         "Lynne Lipton",
         "Bob McFadden"
      ],
      "imdbMovieId": "0089488",
      "originalTitle": "The Life & Adventures of Santa Claus",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The Great Ak calls a council of the Immortals to ask that Santa Claus be given immortality. And to justify it, he tells the history of Santa Claus. The Ak found an abandoned baby and gave it to a lioness and a fairy to raise, who named him Claus. When Claus grew up, the Great Ak showed him the evil and hardship in world and Claus decides to live there and relieve some of the suffering. He decides to make toys for orphans, but King Agua, the ruler of the valley where Claus lives doesn't want the chidren to be happy. and there is a great battle among Immortals.",
      "tmdbMovieId": 48880,
      "avgRating": 3.44444,
      "releaseYear": "1985",
      "numRatings": 9,
      "posterPath": "/h8VMHxMrPqaBpQYqBsUEpioVnbf.jpg"
   }
}