{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "heroin",
            "id": 2671
         },
         {
            "name": "drugs",
            "id": 14964
         }
      ],
      "imdb_id": "tt0052242",
      "video": false,
      "title": "Stakeout on Dope Street",
      "recommendations": [],
      "backdrop_path": "/ysE3TceOJBxyhjjOI6ojcUZ6d1N.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Jim Bowers",
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a337d",
               "name": "Yale Wexler",
               "profile_path": null,
               "id": 229866,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Julian 'Ves' Vespucci (as Jonathon Haze)",
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a3381",
               "name": "Jonathan Haze",
               "profile_path": null,
               "id": 98452,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Nick Raymond (as Morris Miller)",
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a3385",
               "name": "Steven Marlo",
               "profile_path": null,
               "id": 161287,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Kathy",
               "gender": 1,
               "credit_id": "52fe499bc3a36847f81a3389",
               "name": "Abby Dalton",
               "profile_path": "/jmXbIi1mf77odUkJmIZtCJFhro5.jpg",
               "id": 159522,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Danny",
               "gender": 0,
               "credit_id": "5a14cf0fc3a368073e002978",
               "name": "Allen Kramer",
               "profile_path": null,
               "id": 1927784,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Mitch Swardurski",
               "gender": 0,
               "credit_id": "5a14cf1ec3a3680742002972",
               "name": "Herman Rudin",
               "profile_path": null,
               "id": 1848222,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Lenny Potter",
               "gender": 0,
               "credit_id": "5a14cf4092514178c5002735",
               "name": "Philip Mansour",
               "profile_path": null,
               "id": 1927785,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Capt. Richard R. Allen",
               "gender": 0,
               "credit_id": "5a14cf4c92514178b900286f",
               "name": "Frank Harding",
               "profile_path": null,
               "id": 170614,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Chuck",
               "gender": 0,
               "credit_id": "5a14cf60c3a3680746002765",
               "name": "William Shaw",
               "profile_path": null,
               "id": 88015,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Stan",
               "gender": 2,
               "credit_id": "5a14cf7292514178bc0029a3",
               "name": "Andrew J. Fenady",
               "profile_path": null,
               "id": 115484,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Officer Lynn Donahue",
               "gender": 0,
               "credit_id": "5a14cf7e92514178bf002898",
               "name": "Slate Harlow",
               "profile_path": null,
               "id": 1927786,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Mr. Fennel",
               "gender": 2,
               "credit_id": "5a14cf8bc3a368071a002a3a",
               "name": "Herschel Bernardi",
               "profile_path": "/k386JDVsnHVTEc00Q7QZhHcJNPe.jpg",
               "id": 18860,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Nick's Girl",
               "gender": 0,
               "credit_id": "5a14cf9892514178bf0028b8",
               "name": "Carol Nelson",
               "profile_path": null,
               "id": 1927787,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Samuel Alber",
               "gender": 2,
               "credit_id": "5a14cfb1c3a36807460027d3",
               "name": "Edward Schaaf",
               "profile_path": null,
               "id": 44609,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Vespucci's Girl",
               "gender": 0,
               "credit_id": "5a14cfc192514178bc002a20",
               "name": "Wendy Wilde",
               "profile_path": null,
               "id": 1164968,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Suspect",
               "gender": 0,
               "credit_id": "5a14cfd692514178bc002a35",
               "name": "Byrd Holland",
               "profile_path": null,
               "id": 85773,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Detective",
               "gender": 2,
               "credit_id": "5a14cfe4c3a368071a002a9b",
               "name": "Coleman Francis",
               "profile_path": null,
               "id": 45091,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a3367",
               "name": "Irvin Kershner",
               "profile_path": "/iSlCSA4WeR1eNt6T0yoL4HiO9XJ.jpg",
               "id": 10930,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a336d",
               "name": "Andrew J. Fenady",
               "profile_path": null,
               "id": 115484,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a3373",
               "name": "Richard Markowitz",
               "profile_path": null,
               "id": 229862,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a3379",
               "name": "Haskell Wexler",
               "profile_path": "/k3JSEg2tildKuFl6F6T1gLQSwgf.jpg",
               "id": 7067,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a338f",
               "name": "Andrew J. Fenady",
               "profile_path": null,
               "id": 115484,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe499bc3a36847f81a3395",
               "name": "Irvin Kershner",
               "profile_path": "/iSlCSA4WeR1eNt6T0yoL4HiO9XJ.jpg",
               "id": 10930,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe499bc3a36847f81a339b",
               "name": "Irwin Schwartz",
               "profile_path": null,
               "id": 1194866,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.046032,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 59833,
      "vote_count": 1,
      "budget": 0,
      "overview": "Three teens get into the drug business when they discover heroin in a stolen briefcase.",
      "similar": [
         627,
         180863,
         23949,
         20289,
         979,
         507,
         9025,
         641,
         796,
         12271,
         8649,
         9352,
         12143,
         4771,
         6075,
         106646,
         4995,
         122081,
         39939,
         319
      ],
      "original_title": "Stakeout on Dope Street",
      "runtime": 89,
      "poster_path": "/xpMRPnGPGmg1Gm8sXkPicnqVerb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1958-05-03",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Screen's First Blazing Story of Kids Who Go Rumbling Down Dope Street!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Irvin Kershner"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Andrew J. Fenady",
         "Andrew J. Fenady"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052242/",
      "coverLink": null,
      "actors": ["Stars: Yale Wexler, Jonathan Haze, Steven Marlo | See full cast and crew »"],
      "reviews": [
         "This is a surprisingly strong AIP feature, a first for Irvin Kershner as writer and director. Although stylistically it seems, at first sight, little more than an expanded DRAGNET episode in which you get to see the criminals' viewpoints, this largely no-name cast gives a bunch of decent performances with some well-written characters. The feature is about a group of rather clueless teenagers -- who appear to use all their off-screen time body building -- who discover a cannister of heroin. Neither hard core criminals nor saints, they want all the things that society says they should want, and are not choosy about how they go about getting it. The writing and direction are stronger than the acting, but the overall effect is quite striking. Definitely worth your time.",
         "(There are Spoilers) Very probably the first movie coming out of Hollywood that addressed the drug epidemic on the streets of America with both street level smartness and native intelligence, among dealers users and police, in just how illegal drugs, in this case heroin, is both marketed and sold to it's many hooked and desperate customers. A stakeout on Cole Street, known as Dope Street among the dealers and police, goes bad with one of the cops Sgt. Matthews, Matt Resnick, and the arrested drug pusher Jerome Lake, Charles Guasti, ending up shot and killed in the ensuing crossfire. Lake not being able to make his escape, in that he's handcuffed to the dead Sgt. Matthews, throws the briefcase loaded with the drugs, a two pound can of uncut and pure heroin, into the bushes. This happens just moments before Lake is gunned down by Sgt. Matthew's partner Officer Donahue (Slate Harlow), and the police back-up, who's also seriously wounded in the shootout. Lake's partners Mitch Swardurski & Lenny Potter, Herman Rudin & Phllip Mansour, unable to retrieve the drugs or the suitcase, with the initials J.R.L stenciled on it, flee leaving it in the nearby bushes where it's found the next day by grocery delivery boy Julian \"Vas\" Vaspucci, Jonathon Haze. At his fathers grocery store Vas together with his two friends Jim Bowers & Nick Raymond, Yale Wexler & Steven Mario, open the suitcase finding samples of womens cosmetics and a strange two pound can of white powder, the pure heroin. Keping the cosmetics, Jim gives them as a present to his girlfriend Kathy(Abby Dalton), the three young men throw the valuable heroin away in the garbage thinking that it's worthless powder. It's only later after selling the empty suitcase to a local pawnbroker Samuel Alber, Edward Schaaf, the trio realize, by seeing the story of the Dope or Cole Street shootout in the newspapers, that they threw away a fortune in illegal drugs! Finding the missing can in the city dump the three now would be drug dealers get in touch with a middle man, a local heroin junkie, Danny played by Allen Kramer in order to first authenticate, by him using it, the heroin and then sell it to his friends splitting the take with his three partners in crime. What goes completely over the heads of Vas Jim and Nick, as well as Danny, is that both the mob headed by gangster Mr. Fennel, Herschel Bernardi, as well as police are out looking for them and the heroin. And in their case it would be a lot better if the cops instead of Mr. Fennel's boys got to them first! Harrowing story of greed as well as stupidity on the part of the three young men with the can of pure heroin who were way over their heads and didn't realize it until it was almost too late. The naive trio think that they can get rich by not only selling death on the streets without the say so and approval of mobster Mr. Fennel, whom the heroin belongs to, but with the pursuing cops breathing down their necks who are out to avenge the murder of one of their own, Sgt. Matthews,over the missing drugs. Working almost as a team the police and Fennel Mob slowly track down the three by finding the suitcases where the heroin came from at Alber's pawnshop. It's then that the Mob tracks down Danny who not realizing he's the only heroin pusher in town because, with him having the missing heroin, he's the only one who has any smack, or heroin, to sell! Predictable, but very exciting, and by the numbers final as Vas Nick and a very reluctant Jim, whom Kathy talked out this this drug dealing insanity, end up on the wrong side of the law as well as in the gun-sights of Mr. Fennel's hit men Swardurski & Potter. The final scene in a deserted L.A power plant has you on the edge of your seat in hoping that Jim, who's the one with the can of heroin, gets away from the two Mr. Fennel hit-men before they finish him off for good. But at the same time also knowing that if Jim, as well as his friends Vas and Nick, end up alive he'll have to pay for that brief moment of insanity in thinking that dealing drugs is a swell way to get rich; rich off the sufferings and deaths of those that he sells the drugs to.",
         "Irvin Kershner has directed some excellent, some famous, movies. This one was his first. It certainly isn't famous but it is indeed excellent. It's about three young men who find a briefcase that contains, hidden among cosmetics, a can of heroin. The guys reminded me of characters from \"West Side Story,\" though they are more middle-class. They kind of hang out, kind of have jobs. One kind of has a girlfriend. (She is played by Abby Dalton, the only name in the cast list I'd ever heard, and I'm not sure where I heard it.) That girlfriend notwithstanding, one of them has also drawn a head and unclothed torso of one of the others. This drawing is shown throughout the film. Though it's a sensationalistic film, it is not pro-drug. I am going to risk some brickbats but I never liked \"Easy Rider.\" And I'm a baby boomer. Yes, I liked Jack Nicholson but the whole stoned thing: No, not for me. This little film has a jazz score. It plays out for us like a poem. It reminds me of Allen Ginsburg. It's smart, it's hip. It's everything a movie ought to be. And, I'd guess, it accomplishes this on a pretty low budget. The movie has a Police Gazette type title. And it may have played at drive-ins. But make no mistake: This is real art.",
         "\"Stakeout on Dope Street\" is one of the most pleasantly surprising b-flicks I've seen in a while. Its not a masterpiece of cinema or anything along those lines, but for what it is (a combination of the popular juvenile delinquent and film noir genres), its exemplary. If you're a fan of Stanley Kubrick's \"The Killing\", than you should check this little sleep out, as both of them have similar styles. They both deal with a crime gone horribly wrong (in \"The Killing\" it was the heist of a race track, here its the dealing of discovered heroin), both have narrations, and both involve warring factions for the loot. Still, there's enough here to make the film an unique experience. Its full of beatnik cool in the Hollywood style - you know, a loud and jazzy score with plenty of hep dialog. The direction by Irvin Kershner works well for the material. He keeps everything moving at a lightning quick pace and several scenes are full of tension. There's one highly memorable part in the whole movie, which oddly enough is the anti-drug message. One of the junkie characters has a flashback to a methadone clinic, which is presented as complete hell and has the gritty and simple effectiveness of William S. Burrough's finest work. \"Stakeout on Dope Street\" is definitely a sleeper - a film which turns out to be much better than you'd expect it to be. Its just an incredibly cool little flick. (7/10)",
         "This film reminded me about a film called, \"The Man with the Golden Arm\" starring Frank Sinatra and Kim Novack and this film clearly shows the horrors of withdrawal from the drug of heroin. Three young men get involved with a suitcase that holds a very large supply of uncut heroin and wind up throwing it away, thinking it was a cleansing powder and it winds up in a garbage dump which they manage to rescue. The young men decided to sell this drug and are able to make plenty of money by filtering it out through and old time heroin user. There are some girl friends in this film who try to stop these guys and tell them to turn the drugs into the police, but they do not face the consequences of turning themselves in. This is a great 1958 classic film filmed in Los Angeles, California and there is also some pretty way out music through out the film that makes this a very exciting black and white film.",
         "A jazz score accompanies the soundtrack of this gritty story about three teens who get involved with drugs (heroin supply) and then try to make a deal with a druggie who can turn over some cash for whatever amount they come up with. Meanwhile, some drug dealers are also after the drugs and will stop at nothing to find out where the teens have stashed the goods. The no name cast is headed by YALE WEXLER as the more sensitive one who decides the drug heist should be handed over to the cops--but by the time he makes this decision it's too late and the dealers have already trapped his friends and beat them up. He manages to elude them when they pursue him on a climactic chase that forms the climax of the story. Interesting, gritty and worthwhile if you're a film noir buff, but nothing extraordinary. The only reason I watched it was because I had seen the screen test of YALE WEXLER for the role of \"Ben-Hur\" in 1959 and wondered if he ever pursued an acting career after losing that role. Evidently, he did. He gives a convincing performance here and so does the rest of the cast.",
         "Three aimless young men find a briefcase containing a load of valuable heroin. So what are they going to do with it. Desperate, they end up trying to sell it through an ex-junkie. The trouble is the mob wants their heroin back and are on the trail of the kids. And so are the cops. Given the potentially explosive material, the 90-minutes comes across as peculiarly lacking in drama. The motions are there, but not the felt impact. Much, I think, has to do with the quality of the performances. Of the three boys, Marlo manages some grit as Nick. However, Wexler and Haze (yes, that Haze) appear to flounder in stand-around bland fashion. Plus, poor Abby Dalton looks completely lost. Thus, the movie's core is compromised at the outset. Then too, the cops are a particularly colorless bunch, adding nothing to the impact. Kramer, at least, looks the part of a washed-up ex- junkie, getting the big dramatic turn of painful drug withdrawal, where he writhes in expressive fashion. It's a scary public warning. Then again, I didn't know whether to laugh or cry at the movie's high point. Namely, where the boys thrash through a real city dump looking for the heroin as a dozer keeps piling the trash higher. Talk about needles in a haystack, or climbing a mountain that keeps getting higher. One thing for sure, I've seen nothing like it before or since. Anyway, the direction (Kershner) is pretty spotty. There are some nice touches like the crashing bowling ball and bouncing pinball punctuating the two beatings, plus the cascade of heroin down the tank's side. Clearly, however, Kershner is more adept at staging than either coaching actors or building suspense. Even the imaginatively staged showdown doesn't generate the suspense it should. One big positive is the staging throughout. Real locations are used, lending a good glimpse of LA, circa 1958. Too bad the movie as a whole never quite gels, despite the promising premise.",
         "The underrated director Irvin Kershner is best known for the second Star Wars film but early in his career specialized in films and TV programs about troubled youth. I've seen an episode of the series Confidential File he directed on the danger posed to youngsters by comic books, and one of his best theatrical jobs, Hoodlum Priest. This was his first feature and has interesting credits: photography by Haskell Wexler (under a pseudonym)a jazz score by Richard Markowitz performed by the Hollywood Chamber Jazz Group, and as one of the three protagonists, Jim, a nice role for Haskell's younger brother Yale Wexler. Jonathan Haze, who would star two years later as Seymour in the cult success The Little Shop Of Horrors, plays one of the other boys, Ves. The story of teenagers finding abandoned drugs (at first they are so naive they think the heroin is pimple powder) suffers somewhat from obtrusive Dragnet-style narration and most of the other players are little known \"B\" performers. The treatment is also rather melodramatic, such as the climax in which Jim is pursued by syndicate thugs on his trail to the top of a power tower at night. But there is a long, striking sequence in which an older man, an addict named Danny, warns Jim in lurid detail about the consequences of drug addiction; as we see scenes of Danny writhing in a prison cell in withdrawal we hear his voice-over. The episode bears comparison to the more famous scenes of Ray Milland as an alcoholic having the DTs in The Lost Weekend Here and elsewhere in the picture Kershner and Wexler use high angles (e.g through the bars above the cell) for dramatic effect. The period detail of LA locations shot in 1957 such as a Redondo Beach bowling alley also includes some curious dated slang.",
         "Stakeout on Dope Street (1958) is the first movie feature directed by Irvin Kershner whose technique is angled much more to the demands of TV than the cinema � as we might expect from someone who spent the previous five or six years filming episodes for TV's Confidential File series. Although interest is kept alive by intercutting the sluggish main action with an occasional flash as to what the police are doing, the pace is often dead slow in these sequences too. No need to list all the movie's not-so-admirable TV traits like the over-reliance on close-ups, the filling-in-time dialogue that slows down the action while we needlessly tune in to the banal philosophy that underlies the actions of the three principals as they throw their dialogue back and forth in the one cramped studio set. As if this were not enough, we are then forced to take in another dose of philosophy from the hero's girlfriend, played by Abby Dalton, an attractive girl with a pleasant face and an absence of bustiness that makes her acceptable as a girl-next-door type. Stakeout was obviously lensed on an extremely tight budget. There is very little action and even the climax is rather tame. Best feature of the movie is Haskell Wexler's glossy, low-key photography. Available on a Video Beat DVD.",
         "Long before Irvin Kershner tackled big budget movies such as \"The Empire Strikes Back\", he began his theatrical directorial career with this little movie. At times it's a pretty interesting debut. It tackles the subject of drugs when it was next to taboo to deal with them in movies. Kershner probably got away with it because the movie does portray drugs in a very negative light, from showing the brutal criminals that deal with them to the addicts controlled by the drugs they take. The negative portrayal is a little heavy handed at times, but one must remember the movie was made during a different time. Anyway, as entertainment the movie is certainly not boring, though the plotting is somewhat off - the bad guys after the opening sequence don't really reappear until the last part of the movie, and the youths' plan to sell the heroin seems padded out by today's standards. It also doesn't help that the \"youths\" are portrayed by actors who obviously left their teenage years many years in the past. In short, this is a flawed movie, but may be of interest to those who have interest in low budget youth-oriented movies from this period."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["Three teenagers find a briefcase with a beat-up old can in it. They throw away the can and pawn the suitcase. When they read in the papers that the can was full of uncut heroin and belonged to a drug dealer who killed two narcotics agents in a shootout, they go back to look for the can, find it, and decide to go into the heroin selling business. However, the drug dealer's gang also wants the heroin, finds out the boys have it, and sets out to hunt them down and get back their dope."],
      "budget": 35000
   },
   "movielensId": 106996,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1958-05-03",
      "dvdReleaseDate": null,
      "directors": ["Irvin Kershner"],
      "runtime": 89,
      "movieId": 106996,
      "title": "Stakeout on Dope Street",
      "mpaa": "",
      "actors": [
         "Yale Wexler",
         "Jonathan Haze",
         "Steven Marlo",
         "Abby Dalton",
         "Allen Kramer",
         "Herman Rudin",
         "Philip Mansour",
         "Frank Harding",
         "William Shaw",
         "Andrew J. Fenady",
         "Slate Harlow",
         "Herschel Bernardi",
         "Carol Nelson",
         "Edward Schaaf",
         "Wendy Wilde",
         "Byrd Holland",
         "Coleman Francis"
      ],
      "imdbMovieId": "0052242",
      "originalTitle": "Stakeout on Dope Street",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Three teens get into the drug business when they discover heroin in a stolen briefcase.",
      "tmdbMovieId": 59833,
      "avgRating": 3,
      "releaseYear": "1958",
      "numRatings": 2,
      "posterPath": "/xpMRPnGPGmg1Gm8sXkPicnqVerb.jpg"
   }
}