{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0489085",
      "video": false,
      "title": "I-See-You.Com",
      "recommendations": [
         49733,
         37731,
         47070,
         34681,
         35176,
         49940,
         93222,
         87069,
         57548,
         9925,
         51321,
         29822,
         31063,
         33494,
         18856,
         38309,
         50006,
         25973,
         35343,
         13802
      ],
      "backdrop_path": "/99SgX8tn5BYAVr0vdRnrnjgKow7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harvey Bellinger",
               "gender": 2,
               "credit_id": "52fe46019251416c75069ec9",
               "name": "Beau Bridges",
               "profile_path": "/xv6sDCHxHvBgCK4y96H32kxgcdr.jpg",
               "id": 2222,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lydia Ann Layton",
               "gender": 1,
               "credit_id": "52fe46019251416c75069ecd",
               "name": "Rosanna Arquette",
               "profile_path": "/rQMQYQUF9QzD6oDfkP6tsjmyZhS.jpg",
               "id": 2165,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Colby Allen",
               "gender": 2,
               "credit_id": "52fe46019251416c75069ed1",
               "name": "Mathew Botuchis",
               "profile_path": null,
               "id": 166701,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Greg Rishwain",
               "gender": 2,
               "credit_id": "52fe46019251416c75069ed5",
               "name": "Héctor Elizondo",
               "profile_path": "/48UNfVFZVr0jyMIlLPhzm8IIM7f.jpg",
               "id": 1210,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Doris Bellinger",
               "gender": 1,
               "credit_id": "52fe46019251416c75069ed9",
               "name": "Doris Roberts",
               "profile_path": "/4J9jniy4ZEd6NRTfkzq9prKoEIt.jpg",
               "id": 45863,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jessica",
               "gender": 1,
               "credit_id": "5713d8b39251414a710025fa",
               "name": "Tiffany Baldwin",
               "profile_path": "/rYbpxbrfzrCIscaz2DjIYZnvhjG.jpg",
               "id": 1607174,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Kløsen Executive #3",
               "gender": 1,
               "credit_id": "59539e5f925141691400934f",
               "name": "Brittany Petros",
               "profile_path": "/2kRIy4GVgfwehuoXSkTQFMx33Uc.jpg",
               "id": 106458,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46029251416c75069edf",
               "name": "Eric Steven Stahl",
               "profile_path": null,
               "id": 126303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46029251416c75069ee5",
               "name": "Sean McLain",
               "profile_path": null,
               "id": 225054,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46029251416c75069eeb",
               "name": "Eric Steven Stahl",
               "profile_path": null,
               "id": 126303,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 7.000222,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14569,
      "vote_count": 14,
      "budget": 6200000,
      "overview": "A 17-year-old boy buys mini-cameras and displays the footage online at I-see-you.com. The cash rolls in as the site becomes a major hit. Everyone seems to have fun until it all comes crashing down....",
      "similar": [
         3134,
         298312,
         8810,
         281,
         948,
         4638,
         10212,
         11564,
         43923,
         133805,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483,
         101,
         205
      ],
      "original_title": "I-See-You.Com",
      "runtime": 92,
      "poster_path": "/ioWVeYvD5HwMxXLdLsuoMTqEJ0F.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Polski",
            "iso_639_1": "pl"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Filmquest Pictures",
         "id": 2929,
         "origin_country": ""
      }],
      "release_date": "2006-03-08",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.i-see-you.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Steven Stahl"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Eric Steven Stahl",
         "Sean McLain"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0489085/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMDUzNzA5Nl5BMl5BanBnXkFtZTcwMjQ2Njk3MQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Beau Bridges, Rosanna Arquette, Mathew Botuchis | See full cast and crew »"],
      "reviews": [
         "I saw this at the Waterfront Film Festival in Saugatuck, Michigan. This was an okay movie, nothing really special. The first half of it was good, but then it sort of went the traditional route and didn't seem very original. It's about a family that's having some money troubles. Beau Bridges plays a single father who marries single mother Rosanna Arquette. The son comes up with a way to fix the money problems. To get back at his half sister, he puts a video camera in her room and puts the footage on the internet. It becomes a big success so he decides to put cameras in every room in the house. The result becomes one of the first reality shows ever, and he is the only one in the family that knows they are being watched. There were just too many plot holes and some of the characters seemed pretty pointless (especially Jessica who arrives late in the film and does absolutely nothing). And the ending was pretty weak as well. It's probably be best to pass on it if it comes to theaters, rent it if you're a fan of the stars, but other than that, this is a movie to watch at home when it's on TV.",
         "I'm seriously doubting the taste of some reviewers on this site. how this movie could get the comments it does and its rating is beyond me. this is one lame movie. Bridge's acting was as over the top as a circus clown. Do these people not know we've moved on from all that theatrical over doing it to believable characters in interesting situations. The sex scenes between him and Arquette were laughable, but not in a funny way, as in a \"have neither of you had hot sex before and can bring that experience to your acting\" kinda way. I fast forwarded through great chunks of the movie in the hope that it would get better but it never once found its footing. What a waste of my time, and your money making it, although I note in the blowing up the house scene it was high school standard CGI so obviously you didn't waste too much cash on it. but there's still the matter of my time I'd like back.",
         "I didn't laugh once for the last hour of the movie. The preview looked promising: the premise seemed original and edgy, and even in the event that the plot fell through, there also appeared to be ample sex scenes to hold your interest. Wrong. The acting was poor all around, especially on Beau Bridges' part - WAY over-the-top. The writing was dull; there is scarcely a funny joke to be found... predictable, lowest-common-denominator humor. The plot is full of holes and loose ends. Basically the film falls flat on its face. In a word: Boring. There was not a single joke that I didn't see coming from a mile away....I felt like I'd seen this movie a hundred times already. And in case you're wondering - the \"sex scenes\" are phony and PG-13. Could have maybe, somehow, been made into something cool....but it wasn't. Skip it!",
         "I saw this movie as part of the \"selling to distributors\" process. The test audience was peppered with media PTBs and you could tell them apart from the \"civilians\" because they were seated in taped off areas. Anyway, the movie... Before the movie started I had doubts about the timeliness. Because of the \"dot gone\" bust and \"reality TV\" I was concerned I was about to see a movie that was a little anachronistic. Five minutes into the movie and I was no longer worried - I was laughing too hard. Beau Bridges and Mathew Botuchis' performances are OK, but the girls (Rosanna Arquette, Baelyn Neff and Shiri Appleby) steal the show. Rosanna plays the mom and she does a great job as the sex/day-trading addicted counter to Bridges \"toilet bowl\" salesman. Ms. Neff is great in the role of \"daddy's little princess\" providing the foil to Mathew's \"Colby\". But the best had to be Shiri Appleby as \"Randi Sommers\". Ms. Appleby, always understated and extremely watchable, takes what could have been a throwaway role and works it until the closing scene when everyone in the theater clapped. All in all, I really liked the film. I don't recommend it for \"date night\" - it is definitely a \"guy film\" but us guys need one of those every now and then.",
         "I wanted to like it, but just couldn't buy into it. Couldn't believe Bridges, in the early scenes he's pure ham with a rancid edge. Comedy is not his genre. Couldn't believe Bridges would be married to Arquette and having hot sex all over the house. Couldn't believe the premise that the world would keep watching, even after it became clear that everyone knows they are being taped. Could have worked, if the scale had been kept realistic: if the success of the show and commensurate payday were such that the family could have at least pretended NOT to be in on the joke. A little less would have been so much more... Instead, it just insults the intelligence of every character, and the audience as well.",
         "I saw this film at the Waterfront film festival and thought it was hysterical. What a biting satirical snap shot of our society's mindless obsession with 15 minutes of fame, Paris HILTON and getting rich quick. Think of it as FEAR FACTOR meets DOWN AND OUT IN BEVERLY HILLS... on STEROIDS! The story was refreshingly original and did not succumb to the typical dumb formulas of most studio comedies today. I was in a crowd of nearly 700 regular movie goers and it was interesting to see a Midwestern audience not only get the jokes, but belly laugh out loud at a pretty sophisticated farce that did not resort to the obvious Will Farrell and Ben Stiller shtick. I hope it makes it to the big screen.",
         "Having lived in the Los Angeles all my long life, I have watched it change from a hard working, sharing, caring type attitude to a \"skys the limit\" fun filled me first ego type attitude. Here is a movie that does a great job at poking fun at our present way of life. It probably will get a R rating for sex and language, which is definitely LA today. The cast did a really great job portraying their characters. It looked like they were having a lot of fun making this very funny, ridiculous, spoof of todays life style and the toys we \"adults\" play with. They take the usage of the credit cards, the computers, the video cams and our other \"adult\" toys to the nth degree. If you can laugh at yourself, you will laugh at this. The audience that I was in liked it so much that they applauded at the end.",
         "You will laugh your butt off. I See You way funny spoof on how we all got hooked on reality TV garbage like Big Brother. Down on their luck family needs money. Geek son wires house with nanny cams to show subscribers online what is happening. Silly funny good time. Characters were unbelievable how good they were. Jokes were perfectly timed. How many of us out here in IMDb have given in to a reality show? I'm guilty of watching Brett Michaels from a hair band in a series. I See You is a reality TV show in a movie. When geek son makes a deal to sell ads he meets two idiots that do that cool guy sell. That made me laugh. Wife getting burned being a day trader buying Enron and Worldcom stocks hilarious. Movie was a joke on reality TV. I got the joke. Rent this when you want laugh without thinking to hard.",
         "I was surprised when I saw this movie because I was suspecting a horrible B movie and it turned out to be an hysterical studio level movie. I saw a screening at the HBO Comedy Film Festival in Aspen and I thought it was the best movie I saw all week. I can't believe it didn't get a theatrical release. It has a great ensemble cast and a great plot. Everyone wants their fifteen minutes of fame, but how crazy do you go when you get it. In this movie the family goes completely overboard when they get there shot at fame, which I felt was really funny. I am looking forward to seeing it again when Warner Bros releases it in August."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Filmquest Pictures"],
      "summaries": ["A 17-year-old boy buys mini-cameras and displays the footage online at I-see-you.com. The cash rolls in as the site becomes a major hit. Everyone seems to have fun until it all comes crashing down...."],
      "budget": 6200000
   },
   "movielensId": 107065,
   "movielens": {
      "languages": [
         "English",
         "Polski"
      ],
      "releaseDate": "2006-03-08",
      "dvdReleaseDate": null,
      "directors": ["Eric Steven Stahl"],
      "runtime": 92,
      "movieId": 107065,
      "title": "I-See-You.Com",
      "mpaa": "",
      "actors": [
         "Beau Bridges",
         "Rosanna Arquette",
         "Mathew Botuchis",
         "Héctor Elizondo",
         "Doris Roberts",
         "Tiffany Baldwin",
         "Brittany Petros"
      ],
      "imdbMovieId": "0489085",
      "originalTitle": "I-See-You.Com",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A 17-year-old boy buys mini-cameras and displays the footage online at I-see-you.com. The cash rolls in as the site becomes a major hit. Everyone seems to have fun until it all comes crashing down....",
      "tmdbMovieId": 14569,
      "avgRating": 2,
      "releaseYear": "2006",
      "numRatings": 1,
      "posterPath": "/ioWVeYvD5HwMxXLdLsuoMTqEJ0F.jpg"
   }
}