{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "corruption",
            "id": 417
         },
         {
            "name": "samurai",
            "id": 1462
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "zatoichi",
            "id": 10157
         }
      ],
      "imdb_id": "tt0202154",
      "video": false,
      "title": "Zatôichi and the Doomed Man",
      "recommendations": [
         21410,
         54275,
         54306,
         54273,
         54278,
         54277,
         54281,
         54307,
         54276,
         54265,
         54272,
         54279,
         54266,
         54283,
         115799,
         54284,
         40897,
         18624,
         24444,
         18511
      ],
      "backdrop_path": "/kI9JfzvcfDQ4smxSdaE8KxSoCAE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Zatoichi",
               "gender": 2,
               "credit_id": "52fe4894c3a36847f816efa9",
               "name": "Shintarô Katsu",
               "profile_path": "/zuuQ8ANj95nFyYwLcvPr6K64513.jpg",
               "id": 80704,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Monk Hyakutaro",
               "gender": 0,
               "credit_id": "52fe4894c3a36847f816efad",
               "name": "Kanbi Fujiyama",
               "profile_path": null,
               "id": 150291,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Yone",
               "gender": 0,
               "credit_id": "52fe4894c3a36847f816efb1",
               "name": "Eiko Taki",
               "profile_path": "/7yG7ZuHCgnaJ2sxkP2x3MXZqYlg.jpg",
               "id": 150288,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Chiyo",
               "gender": 0,
               "credit_id": "52fe4894c3a36847f816efb5",
               "name": "Masako Myojo",
               "profile_path": null,
               "id": 150292,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Boss Jubei Araiso",
               "gender": 0,
               "credit_id": "52fe4894c3a36847f816efb9",
               "name": "Kenjiro Ishiyama",
               "profile_path": null,
               "id": 72539,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Yakuza boss",
               "gender": 2,
               "credit_id": "52fe4894c3a36847f816efbd",
               "name": "Ryûzô Shimada",
               "profile_path": null,
               "id": 80706,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Shimazo Kitase",
               "gender": 2,
               "credit_id": "52fe4894c3a36847f816efc1",
               "name": "Kôichi Mizuhara",
               "profile_path": null,
               "id": 125015,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4894c3a36847f816ef99",
               "name": "Kazuo Mori",
               "profile_path": null,
               "id": 80709,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4894c3a36847f816ef9f",
               "name": "Shozaburo Asai",
               "profile_path": null,
               "id": 124997,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4894c3a36847f816efa5",
               "name": "Kan Shimosawa",
               "profile_path": null,
               "id": 3435,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.114534,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 54274,
      "vote_count": 13,
      "budget": 0,
      "overview": "Blind swordsman Zatoichi, jailed briefly, is implored by another prisoner to aid him in proving his innocence of a crime for which he is sentenced to death. Zatoichi is reluctant to get involved, because he knows how often such involvement has led to trouble in the past. But events conspire to thrust him repeatedly into involvement, and gradually he comes to believe in the man's innocence and determines to free him.",
      "similar": [
         58857,
         14537,
         616,
         64686,
         11878,
         346,
         7007,
         11712,
         4771,
         826,
         1592,
         1904,
         36586,
         7485,
         9798,
         311,
         9772,
         251,
         582,
         24
      ],
      "original_title": "座頭市逆手斬り",
      "runtime": 88,
      "poster_path": "/1nPk37qKQx4nTnIDBc3cFOKc8aw.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Daiei Studios",
         "id": 881,
         "origin_country": ""
      }],
      "release_date": "1965-09-18",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": "/bY8gLImMR5Pr9PaG3ZpobfaAQ8N.jpg",
         "name": "Zatôichi: The Blind Swordsman",
         "id": 96887,
         "poster_path": "/re3RXSkMVep1BBNLe9t1mVXeF9G.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kazuo Mori"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Shôzaburô Asai",
         "Kan Shimozawa"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0202154/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjc1ODM4NDYwNV5BMl5BanBnXkFtZTgwNjAyODIyMTE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Shintarô Katsu, Kanbi Fujiyama, Eiko Taki | See full cast and crew »"],
      "reviews": [
         "This Zatoichi film is pretty good--thanks to a good plot and a bit of needed humor. The film begins with Zatoichi being caned and imprisoned briefly for illegal gambling. The guy in the adjoining cell has been sentenced to death and he pleads with the blind man to help him, as he's done nothing and was wrongly convicted. He wants Ichi to see the boss in a nearby town, as they are friends and this friend would never let him be executed. For once, Zatoichi isn't eager to do good--after all, what can he do to help the guy? And, he figures, he's probably NOT innocent after all. Soon after being released, Ichi is back to his usual gambling and there he meets an idiot named Hyakutaro. Hyakutaro decides to be nice and let Zatoichi be his partner in gambling--after Ichi proves to be not only an amazing gambler but an amazing swordsman. The guy turns out to be very talkative and annoying. When the two soon separate, Ichi wanders about...until he learns that Hyakutaro is telling everyone in the boss' city that HE is the great swordsman, Zatoichi! Ichi knows he needs to confront the idiot (especially since he's doing a lot to damage Ichi's good reputation)--and he can also talk to this boss about his imprisoned friend. The boss listens to Zatoichi's account of the friend in prison awaiting execution. The boss agrees that the man is his friend AND he could never have committed any crime. He also agrees to go to the prison and arrange his release. However, this boss is, according to a lady in town, quite the liar and Ichi should be very careful. In the next scene, Hyakutaro quickly is caught pretending to be Zatoichi by Zatoichi himself in a rather funny scene. It seems that \"Zatoichi\" has expensive habits and agrees to work with the boss IF he gets very well paid, the best food and women. To placate this fake Zatoichi, they also arrange for him to get a massage...and you can probably guess who his masseur is! You can probably also guess that the boss really IS a scoundrel, as he is responsible for sending his friend to jail on trumped up charges. And, predictably, the boss sends out his goons to kill Ichi. And, also quite predictably, Ichi cuts them to ribbons with his fancy swordsmanship. Overall, this is another solid film in the franchise. While an awful lot of it is familiar, it is well done AND there is some nice (and not overdone) comic relief.",
         "11 entries in and finally we get a non-generic title that's actually descriptive of the movie's own plot! Zatoichi and the Doomed Man is directed by Kazuo Mori, not the best director of Zatoichi films but not the worst. The movie can be described the same way. Not bad, but it could be better. At this point, the formula is really growing stale and the movie pokes fun at it. Also, Zatoichi has by now harnessed a considerable street cred - nearly everybody knows who he is, and this time around he even has an impersonator going around trying to make money and get laid by pretending he is Zatoichi. There are a lot of comical moments here and it's obvious that the series has noticeably evolved from the dark melodrama of the first few films. Zatoichi is still here to kick ass and spread good deeds to the oppressed. The body count keeps piling up and up, all gambling dens across Japan have probably prohibited him to enter, and Shintaro Katsu's hair grows longer with each passing film (except for #9, where it sloppily changes between scenes). I also like how each Criterion cover has a different art style. This one is light-hearted and caricatural, and I think it fits the movie really well. Highlight: Zatoichi encountering the ocean for the first time and wondering about its size, unable to see it.",
         "This entry in the series is silly at times, but ends with a lengthy and bloody fighting scene. Zatoichi befriends a charlatan on the road (Hyakutaro). Hyakutaro steals Zatoichi's name and reputation and tries to extort money from local bosses. Zatoichi isn't too pleased when he finds out about the situation, but Zatoichi eventually comes to think better of Hyakutaro. Hyakutaro has a good heart and Zatoichi encourages him to straighten up his life. There are some funny scenes throughout the film. But in the end, Zatoichi must fight his way through a huge gang of yakuza in order to free Hyakutaro's father, who was wrongly accused of murder. The gangsters employ nets and other contraptions in order to try to take down Zatoichi, but they only succeed in further angering an already dangerous man! I must admit that the first time I watched the film, I was not very impressed. But after a few more viewings, I have come to better appreciate the acting of both Katsu Shintaro and the actor who plays Hyakutaro.",
         "Equal measures of humour and action enliven this entry in the series. Zatoichi hooks up with a cowardly but greedy hustler who steals the blind swordsman's identity. Of course he eventually needs Zatoichi's assistance! There's a lengthy battle at the end of the film to please aficionados of the genre, as Zatoichi must rescue a wrongly condemned man from execution."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Daiei Studios"],
      "summaries": [
         "Blind swordsman Zatoichi, jailed briefly, is implored by another prisoner to aid him in proving his innocence of a crime for which he is sentenced to death. Zatoichi is reluctant to get involved, because he knows how often such involvement has led to trouble in the past. But events conspire to thrust him repeatedly into involvement, and gradually he comes to believe in the man's innocence and determines to free him.",
         "The blind masseur and swordsman, Zatoichi, searches for proof an imprisoned man's innocence."
      ],
      "budget": 0
   },
   "movielensId": 107262,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1965-09-18",
      "dvdReleaseDate": null,
      "directors": ["Kazuo Mori"],
      "runtime": 88,
      "movieId": 107262,
      "title": "Zatôichi and the Doomed Man",
      "mpaa": "",
      "actors": [
         "Shintarô Katsu",
         "Kanbi Fujiyama",
         "Eiko Taki",
         "Masako Myojo",
         "Kenjiro Ishiyama",
         "Ryûzô Shimada",
         "Kôichi Mizuhara"
      ],
      "imdbMovieId": "0202154",
      "originalTitle": "座頭市逆手斬り",
      "genres": [
         "Adventure",
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Blind swordsman Zatoichi, jailed briefly, is implored by another prisoner to aid him in proving his innocence of a crime for which he is sentenced to death. Zatoichi is reluctant to get involved, because he knows how often such involvement has led to trouble in the past. But events conspire to thrust him repeatedly into involvement, and gradually he comes to believe in the man's innocence and determines to free him.",
      "tmdbMovieId": 54274,
      "avgRating": 3.35714,
      "releaseYear": "1965",
      "numRatings": 7,
      "posterPath": "/1nPk37qKQx4nTnIDBc3cFOKc8aw.jpg"
   }
}