{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0081250",
      "video": false,
      "title": "The Night of the Hunted",
      "recommendations": [
         29130,
         106758,
         29562,
         79406,
         84068,
         35718,
         31319,
         39986,
         64719,
         3146,
         38946,
         29129,
         34546,
         28719,
         55781,
         57706,
         203151,
         83096,
         39931,
         41499
      ],
      "backdrop_path": "/xMvGmAjomaaXJid5voWbPYbxDSL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "Elysabeth",
               "gender": 1,
               "credit_id": "5662fa88c3a3682bd80043f1",
               "name": "Brigitte Lahaie",
               "profile_path": "/3o4jIGQ2rYbiBGwAfC60TkDYK1U.jpg",
               "id": 1545081,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Véronique",
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763b1",
               "name": "Dominique Journet",
               "profile_path": "/nTx9U6y6ix4rUSL35PX9mUjNJ1i.jpg",
               "id": 104260,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Solange",
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763bd",
               "name": "Rachel Mhas",
               "profile_path": null,
               "id": 104263,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Le docteur Francis",
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763b5",
               "name": "Bernard Papineau",
               "profile_path": "/2jYDYfJemOwNEk3kUq2QxogPWG2.jpg",
               "id": 104261,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "-",
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763b9",
               "name": "Vincent Gardère",
               "profile_path": "/lFV0unNBkueSvaJiplvPXaR5qX1.jpg",
               "id": 104262,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "The Mother",
               "gender": 1,
               "credit_id": "52fe45eac3a368484e0763c5",
               "name": "Natalie Perrey",
               "profile_path": null,
               "id": 104212,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Christiane",
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763c9",
               "name": "Christiane Farina",
               "profile_path": null,
               "id": 104265,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe45eac3a368484e0763cd",
               "name": "Élodie Delage",
               "profile_path": "/xQcbg3ry2wczsGmvfi1lWWhOV2n.jpg",
               "id": 104266,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Jacques",
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763d1",
               "name": "Jean Hérel",
               "profile_path": null,
               "id": 104267,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Alain",
               "gender": 2,
               "credit_id": "52fe45eac3a368484e0763d5",
               "name": "Cyril Val",
               "profile_path": null,
               "id": 104244,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Catherine",
               "gender": 1,
               "credit_id": "59aff591925141070706c838",
               "name": "Cathy Stewart",
               "profile_path": "/hV3c2Q9zquMAeXUh5VGm1OlKfnQ.jpg",
               "id": 1169180,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45eac3a368484e07639d",
               "name": "Monique Samarcq",
               "profile_path": null,
               "id": 104259,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763a3",
               "name": "Jean Rollin",
               "profile_path": "/odV8f23LdkRqYzxKMWBEEMddYZ.jpg",
               "id": 88820,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45eac3a368484e0763a9",
               "name": "Jean Rollin",
               "profile_path": "/odV8f23LdkRqYzxKMWBEEMddYZ.jpg",
               "id": 88820,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.502253,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 29565,
      "vote_count": 13,
      "budget": 0,
      "overview": "A woman is taken to a mysterious clinic whose patients have a mental disorder in which their memories and identities are disintegrating as a result of a strange environmental accident.",
      "similar": [],
      "original_title": "La Nuit Des Traquées",
      "runtime": 87,
      "poster_path": "/pd6n6PVtQaBE8HnNW64NFHJddn6.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1980-08-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "FRF ",
      "directors": ["Jean Rollin"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Jean Rollin"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0081250/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTQ5MzgwNzEyMF5BMl5BanBnXkFtZTcwNzU2NDcxMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Brigitte Lahaie, Vincent Gardère, Dominique Journet | See full cast and crew »"],
      "reviews": [
         "This Rollin movie takes us into a surreal world, the cold architecture of satellite cities, with touches of 70s sci-fi from Rollerball to Rainer Erler, but nevertheless with Rollin's usual sex and gore obsessions. Several actresses had previous experience in the hardcore genre and provide gratuitous nudity, while any gore-hound will remember the suicide scene when the woman kills herself by stabbing a pair of scissors through her eyes into the brain. No, this is not a movie for the faint-hearted, but by no means a simple exploitation flick either. Let us take a closer look at the story. Robert, a young man, drives through the night, when suddenly Elisabeth (Brigitte Lahaie) appears in front of his car. She seems confused and remembers nothing except her name and that she was trying to escape - but from where and from whom? Robert takes Elisabeth to his home, but a doctor followed them and he takes Elisabeth back to the place she ran away from - a lunatic asylum in a skyscraper. Robert has doubts that this a normal psychiatric hospital, it rather looks like a prison with the heavily armed guards. Does the doctor have a secret to hide? This is a surprisingly quiet movie, literally. Music is often absent from the soundtrack. This stylistic means fits the situation of the mentally ill who complain about their loss of memory or lack of ability to use their limbs. Many scenes are painfully slow moving, but if you liked other movies by Rollin, you won't mind. That is setting a mood of intensity and concentration that you get into or you don't. The human touches are well done, especially the scene when Elisabeth feeds another inmate who cannot hold a spoon with her hands. Furthermore, I want to point out the memorable performance of red-haired Dominique Journet (in her first screen appearance!) as Véronique, Elisabeth's friend who tried to escape with her. When she loses the ability to speak and wanders around with empty eyes - behind which lies a scream -, such are moments of absolute horror, but in a very sophisticated way. The motif of two girls trying to survive together in a strange, hostile world, by the way, is one of the most typical for Rollin, see \"Les Deux Orphelines Vampires\" for example. And just like that later film, \"La Nuit des Traquees\" is a good movie for its low budget!",
         "Not a lot of action in this film because in many of the scenes there are zombie-like characters who are suffering from complete loss of memory. It appears that their brains have been grossly affected by a recent nuclear spill. To avoid panic among the general public, the patients are confined as prisoners in a high-rise city building. Patients who are past the point of recovery either commit suicide (scissors in the eyes), or are put to sleep with an injection and disposed of in a furnace, or shot in the back if attempts are made to escape, or strangled by one of the mad inmates. It's so over the top, humour takes over from horror! The story is spiced up with a couple of sex scenes and there is full frontal male and female nudity. Elizabeth and Veronique (who spend a lot of time in flimsy night-gowns) make a daring attempt (after stealing a revolver) to get a message to the outside world. Subsequently a young man breaks into the well-guarded building to save them. The plot is full of weaknesses and the editing lacks the professional touch. The music is quite good and suggests danger at every turn in the labyrinth of corridors. Despite the exagerated nonsense portrayed in the film I watched it to the end. I think my brain too had been affected by the weird goings-on!",
         "Night of the Hunted is ostensibly something of a departure for French horror auteur Jean Rollin. Its story is on the face of it unusual for the director. Its about a mysterious clinic in a high-rise building where patients have a mental disorder where their memories and identities are disintegrating due to an environmental accident. The setting is in the middle of a city and the visuals are ones of sterile urban alienation as opposed to the Gothic surrealism more typically associated with Rollin. Yet, within this veneer is a film that anyone even remotely familiar with the director's work can identify quite easily as one of his films. It has the typical Rollin characters - alluring yet strangely asexual young women in the central roles and extremely dull men in the periphery. The dialogue is as poor as always. The story is as flimsy and senseless as its possible to be. There is an abundance of nudity. It has the strange melancholic, romantic atmosphere which always makes his movies so odd for horror films. And it also displays Rollin's eye for the surreal. The ending in particular on the grassy viaduct over the city being a perfect example of this. In other words, Night of the Hunted, despite surface differences contains all the strengths and weaknesses that all Rollin films have. The story and setting itself very much recalls the work of David Cronenberg. But the similarities are entirely superficial. As Rollin is pretty much diametrically opposite in approach to Cronenberg as a filmmaker. Where the latter is highly scientific in his approach, Rollin is a pure romantic. In fairness, the story here could have done with a bit of developing to make it entirely satisfying but then you could probably say that about all the other films in the directors oeuvre to some extent. There is a quite nice score which certainly adds to the atmosphere well; while Brigitte Lahaie is a good presence and by some distance the only memorable actor in the entire film. If you have any hope of enjoying this film you need to be able to buy into the weird haunting world typical of this director. You need to have some appreciation of his visual ideas too. Otherwise I expect you may dislike this rather a lot. I wouldn't say this is a particularly accessible Rollin film; I'm not really sure there is such a thing.",
         "I went into \"Night of the Hunted\" not knowing what to expect at all. I was really impressed. It is essentially a mystery/thriller where this girl who can't remember anything gets 'rescued' by a guy who happens to be driving past. The two become fast friends and lovers and together, they try to figure out what is going on with her. Through some vague flashbacks and grim memories, they eventually get to the bottom of it and the ending is pretty cool. I really liked the setting of this one: a desolate, post-modern Paris is the backdrop with lots of gray skies and tall buildings. Very metropolitan. Groovy soundtrack and lots of nudity. Surprising it was made in 1980; seems somewhat ahead of it's time. 8 out of 10, kids.",
         "In this film Jean Rollin traded in his usual surrealist-Gothic, crumbling-castle-by-the-seaside setting for a cold, modern Paris office building. Still this film has the same strange atmosphere of haunting romanticism and the interesting visuals that characterize the director's best work. The plot is uncharacteristically coherent--a man falls in love with a woman who has escaped from a high-rise clinic where she is being kept along with a number of other patients whose memories, identities, and very minds are being eaten away as the result of an environmental accident. On a superficial level, the movie seems like a cross between David Cronenberg's \"Shivers\" and George Romero's \"The Crazies\", but it's a Rollin film all the way focusing more on the tragic romance than the conspiracy angle. There's too much dialog and much of it is pretty inane, but some of it is actually pretty moving. It makes you think of the plight of Alzheimer's patients (albeit young, attractive, and frequently naked ones). The only real let-down is the acting. Brigitte Lahaie is a great actress for a former porn star, but that's kind of like being a great basketball player for a quadriplegic. The male lead is a stiff and the guy playing the doctor is pretty unconvincing. Still,if you like Rollin films in general, this one is worth checking out at least.",
         "This interesting film from Jean Rollin is somewhat of a departure from his usual vampire films. There is no supernatural element to be found in this one. Here the terror is more of the David Cronenberg variety. Plot begins with a man encountering a young female amnesiac wandering along a country road one night. It turns out she has escaped from a lunatic asylum which is inside a very futuristic-looking skyscraper (one of the film's best touches). All of the other patients are also amnesiacs. They are unable to remember anything but the last 15 to 20 minutes. Inside the asylum they are basically just left to wander aimlessly. There's quite a bit of violence and sex with patients attacking each other, having hot sex, etc.. I really enjoyed this one. I am surprised it is considered one of Rollin's weaker films. I tried watching \"The Iron Rose\" right before this and found it such a crashing bore that I couldn't finish it. But I really like \"Night of the Hunted\". I can only imagine people think this one of Rollin's weaker films because it lacks the Gothic element of some of his other films. The futuristic architecture is a neat touch. Also, Brigitte Lahaie is gorgeous and she has a certain deer in the headlights look that is perfect for this. Unfortunately, Rollin totally botches the ending. It could easily have been haunting but what he goes for (in my opinion) does not work. It ends up being unintentionally funny. Oh well. Besides that it was good.",
         "Even if you're a fan of Jean Rollin's idiosyncratic body of work, you will be caught off guard by this exceptional foray into science fiction territory. For once, there's not a single diaphanously gowned vampire girl in sight ! True to tradition, the budget proved way too tight to realize the director's vision entirely. Yet this is largely compensated by his obvious love of genre cinema, dedication to his craft and sheer ingenuity. Jean-Claude Couty's atmospheric cinematography makes the most of the foreboding locations and Philippe Bréjean (a/k/a \"Gary Sandeur\") contributes a startling soundtrack that fortunately doesn't resemble any of the sappy stuff he composed for hardcore. Shot in and around a Paris office block before and after working hours, the film was largely cast with porn regulars Rollin was already quite familiar with from his \"Michel Gentil\" cash-gathering XXX efforts, most notably French f*ck film royalty Brigitte Lahaie in the demanding lead. Playing Elisabeth (rather well, I might add), she's picked up wandering a nearby highway one night by Robert (Vincent Gardère), driving home at the end of a long work day. Barely able to piece together the string of events that got her there, Elisabeth seems to lose her memories mere moments after events occur, even forgetting Robert's name and heroic savior role before their night flight comes to an end at his apartment. Prior to making love, she rightfully describes herself as a virgin (further credit to Brigitte's thespian skills that she can handle the line so convincingly, being after all one of the more active adult actresses of the '70s) because she cannot recall a single touch preceding his. Because of this nifty bit of context, the relatively long sex scene that follows totally eschews the gratuity of other \"commercial\" interludes Rollin has had to include in other works to assure funding. When Robert leaves for work, he's inevitably erased from Elisabeth's feeble mind. A mysterious doctor (comedian Bernard Papineau effectively cast against type) and his menacing assistant Solange (striking porn starlet Rachel Mhas) move in on her during her protector's absence and take her back to the place she turns out to have escaped from. Here we get one of the movie's strongest scenes as she's re-introduced to her roommate Catherine (the late Cathérine Greiner a/k/a hardcore performer \"Cathy Stewart\" in a quietly devastating turn), both girls desperately supplying fictitious shared \"memories\" for one another in a bid to outrun their inevitable fate. That deterioration is not solely limited to the mind becomes painfully clear when they are served lunch and Catherine's unable to control her movements in trying to eat a spoonful of soup. It's also Catherine who gets to voice the filmmaker's compromise with the demands of commerce as she urges Elisabeth to get naked and hold her because sex is all they have left now that both mind and physical faculties have deserted them. Several rather explicit - if not quite hardcore - sex scenes make up the movie's mid-section and French porn aficionados should recognize the likes of Alain Plumey (a/k/a \"Cyril Val\"), Jacques Gateau and Elodie Delage, along with a blink and miss bit from future porno princess Marilyn Jess whose rape at the hands, mouth and member of Plumey was only present in the film's rarely screened XXX version FILLES TRAQUEES. The pivotal part of Véronique, a girl Elisabeth almost seems to remember and whom she seeks to escape anew with, is beautifully handled by the exquisite Dominique Journet - in her unforgettable debut - who would go on to play a sizable supporting role in Franco Zeffirelli's LA TRAVIATA. The six feet under ending reveals the deteriorating condition to be the result of a nuclear spill, the quarantined \"patients\" ultimately leaving a barely breathing empty shell, unceremoniously disposed off in a fiery furnace. The final shot offers a particularly heartbreaking variation on that of Chaplin's MODERN TIMES as Elisabeth, approaching complete meltdown by now, and a wounded Robert stumble along the railroad bridge, clumsily clasping each other's outstretched hands.",
         "Early on in the movie a man named Robert (Vincent Gardere) picks up a stranger on the side of the road. Yes, she is blond and beautiful and I'm sure that helped her get a ride. And as it turns out our good Samaritan Robert has hit the jackpot as once her gets her home (he takes her there because she has no memory and doesn't know where she lives) he scores some of the quickest a** in the history of cinema. Oh, did I mention this is a French film? I guess I really didn't have to, as us Americans, prudes that we are, are far too restrained to ever open a film like that. And me, being in the camp that you can never have too many French films, nor can you have too much sex on screen, had a blast watching \"The Night of the Hunted.\" It does take place in something of an alternate reality where everybody carries guns and nobody wears underwear (and who wouldn't want to live in this reality), but that works to its advantage. For better or for worse the sex does feel downright pornified and if there is a female character you will see her breasts. But perhaps I've gotten ahead of myself. The plot, post-aforementioned sex scene, involves Elizabeth being brought back to a diabolical mental ward where she shares a living space with others who share her Memento-like syndrome. Her memory has deteriorated to the point where she often times forgets what happened just a few minutes prior. She wanders around the minimalist set that looks stolen from an Off Off Broadway production (and the music is no more elaborate) while men and women hit on her. The janitor, realizing the upside to this situation, sets off to turn their disadvantage into his own sexual advantage. That, of course, goes terribly wrong for him, and Elizabeth, realizing there is something terribly wrong with the entire world she is living in, sets off on a quest to escape. After enlisting the help of Robert, her and her friend Veronique dash through the halls of the mental hospital from hell. The film is filled with sex and violence, but it is not there just to entice the masses. The doctor who presides over this pit of despair has sucked the life out of most of his patients/prisoners. Sex and violence becomes an outlet for these people, something that makes them feel alive. I will admit though, I was left scratching my head over what this film was trying to say. Near the end they began to lean heavily on Nazi imagery and I wonder if it wasn't trying to indict doctors and science in general through the Third Reich. Nazi's made fantastic scientific discoveries, but most would say that it came at the price of humanity. The doctor here was also aiming for a great discovery, but the byproduct of that was having to discard bodies into incinerators. This all sounds like a very unsentimental view of humanity, and it is, but it is very effective at searing its images into your brain. The film is weird, but not off putting. French filmmakers have always felt comfortable using surrealism and here is no exception. It may not be a masterpiece, but for fans of unique cinema it is a can't miss. ***1/4",
         "Rollin's images are usually pure enough in just being themselves, that it's all a matter of how much concentrated emptiness he can shape around them; in other words he does story poorly, so when he manages to concentrate just a few strands around a sense of place his films can soothe with a dreamlike resonance. The story here is about distraught amnesiacs kept under lock in a mysterious apartment complex. So we get a lot of somnambulist wanderings along empty corridors, a lot of stanzas about the ineffabilities of touch and connection in clinical environments; always on the verge between paralysis and sleep, bursts of emotional clarity - usually in the nude - drowned by despair. The imports are distinctly Cartesian; so the mind matters, thought matters because ergo we are, memory, the self. Losing these is tantamount to a spiritual death. So a lot of outdated ruminations on a philosophical level, not to say anything of Rollin's tendency to eventually rationalize the mystifying in a way that, looking back, we can contend ourselves that it all somehow made sense; here nonsense about a nuclear spill and the mind deteriorating on a cellular level. But the sense of place is occasionally just powerful enough, the emptiness mirrored outside in desolate urban landscapes, that it merits one viewing for fans. You can relax with this, but perhaps a bit too much.",
         "'Night Of The Hunted' has been slammed in the other comments posted here to date, which I find hard to understand. While the movie isn't one of Jean Rollin's best it is far from worthless. The stunning Brigitte Lahaie, star of Rollin's vampire classic 'Fascination', plays a beautiful amnesiac befriended by a passing motorist. She is in a state of panic and trying to escape somebody, but we don't know who, and neither does she. She is subsequently recaptured by a man who claims to be a doctor and is returned to a mysterious apartment block cum hospital. In there are other similarly afflicted patients, or are they prisoners? The movie is slow and puzzling and will probably appeal more to fans of J.G. Ballard or Kobo Abe than those of conventional SF or horror movies. The Cronenberg comparisons it has been given aren't exactly on the money but give some idea that this isn't your average b-grade thriller, and it is even odd for Rollin, not exactly a conventional film maker at the best of times. I say ignore 'Night Of The Hunted's flaws and you'll be in for a fascinating, if not completely satisfying, experience."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Impex Films"],
      "summaries": ["A woman is taken to a mysterious clinic whose patients have a mental disorder in which their memories and identities are disintegrating as a result of a strange environmental accident."],
      "budget": 40000
   },
   "movielensId": 107248,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1980-08-20",
      "dvdReleaseDate": null,
      "directors": ["Jean Rollin"],
      "runtime": 87,
      "movieId": 107248,
      "title": "The Night of the Hunted",
      "mpaa": "R",
      "actors": [
         "Brigitte Lahaie",
         "Dominique Journet",
         "Rachel Mhas",
         "Bernard Papineau",
         "Vincent Gardère",
         "Natalie Perrey",
         "Christiane Farina",
         "Élodie Delage",
         "Jean Hérel",
         "Cyril Val",
         "Cathy Stewart"
      ],
      "imdbMovieId": "0081250",
      "originalTitle": "La Nuit Des Traquées",
      "genres": [
         "Horror",
         "Thriller",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman is taken to a mysterious clinic whose patients have a mental disorder in which their memories and identities are disintegrating as a result of a strange environmental accident.",
      "tmdbMovieId": 29565,
      "avgRating": 2.66667,
      "releaseYear": "1980",
      "numRatings": 6,
      "posterPath": "/pd6n6PVtQaBE8HnNW64NFHJddn6.jpg"
   }
}