{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0162854",
      "video": false,
      "title": "American Raspberry",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lisa Allen",
               "gender": 1,
               "credit_id": "56f2cdcf92514134db0002fb",
               "name": "Joanna Cassidy",
               "profile_path": "/p7CQ4EmGmtAaR3YWKRJTnmnRU8i.jpg",
               "id": 593,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Celebrity Sportsman",
               "gender": 2,
               "credit_id": "56f2ce9d92514134db000323",
               "name": "Warren Oates",
               "profile_path": "/pZG3khTobQkIpGuIyd8DpcJRniT.jpg",
               "id": 8255,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Trucker's Friend",
               "gender": 2,
               "credit_id": "56f2ceca92514134d600039c",
               "name": "Harry Shearer",
               "profile_path": "/qtGHYpWLbqQVY9ymVPtrJZV6MHg.jpg",
               "id": 6008,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Loan Officer",
               "gender": 1,
               "credit_id": "5a3c918e0e0a264cca22f705",
               "name": "Susan Doukas",
               "profile_path": null,
               "id": 136248,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "56f2cd9b92514134d600036e",
            "name": "Bradley R. Swirnoff",
            "profile_path": null,
            "id": 1058225,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.106881,
      "production_countries": [],
      "id": 77161,
      "vote_count": 3,
      "budget": 0,
      "overview": "Some unknown source has interrupted all television transmissions around the world. In place of the regular broadcasts, a lineup of extremely tasteless programs and commercials have been substituted. Included in the mix are such show as The Shitheads, The Charles Whitman Invitational, and commercials for a number of improbable products.",
      "similar": [],
      "original_title": "American Raspberry",
      "runtime": 75,
      "poster_path": "/dvbsuGpCJjXJDJbzC4pMMzEsJzE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1977-09-12",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The Movie That Grabs TV by the Dials and Won't Let Go!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bradley R. Swirnoff"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "John Baskin",
         "Stephen Feinberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162854/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1OTIxODc4Nl5BMl5BanBnXkFtZTcwMTk1MDc0NQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Ainsley, Wil Albert, Royce D. Applegate | See full cast and crew »"],
      "reviews": [
         "As I am kind of a fetishist for these 1970's sketch comedy movies, I was rather excited to finally have a look at this one, which I had neither seen nor heard of. As far as I can tell, this is the only example of this small but potent sub-genre I haven't seen yet. If you liked Tunnelvision, which is much more well-known that this flick, you will enjoy the politically incorrect humor on display here, in the form of rapid-fire TV commercial and TV program parodies. This even has the same voice over guy as Tunnelvision (for part of it). There are plenty of familiar character actors on display here if you were a TV watcher in the 1970's, including George Furth (you might recognize him from Blazing Saddles) as the President of the United States. Also keep an eye open for fleeting parts by Stephen Furst, Three Stooge associate Mousie Garner, Harry Shearer, and current candidate for Governor of Texas and long time musician and mystery novelist Kinky Friedman, performing his chestnut \"Ol Ben Lucas.\" This film is currently obtainable as it is present on a DVD box set titled \"50 Drive-In Classics.\" Do an internet search for that and you should find it no problem. It costs about 20 bucks. I'd put this movie about half-way up the scale of entertainment in this genre. Of course, Kentucky Fried Movie and Amazon Women on the Moon are at the top, as they were the only ones of these sketch movies made with any kind of budget to speak of. As I was a young boy in the late 70's, I do remember most of the stuff they are taking off on in Prime Time, but you young movie hounds of today won't remember the R-O-L-A-I-D-S TV commercial, the Sears Die Hard battery spots or the American Express \"Do You Know Me?\" campaign, I fear. In spite of its die-hard political incorrectness, it seems to give most minority or religious groups something to be angry about (equal opportunity offender), and its jokes are mostly laugh-inducing, which can ameliorate a multitude of sins. If you like this film try the following, in order of recommendation: Kentucky Fried Movie, Tunnelvision, Amazon Women on the Moon, The Groove Tube, Loose Shoes, The Boob Tube, American Tickler, and Miss Nymphet's Zap-In. If there's any of these type of movies I forgot or am not aware of, drop me a line...",
         "Closer to Tunnelvision than Groove Tube or Kentucky Fried Movie, in that it has a connecting plot this movie is pretty much 75 minutes of good TV show and commercial spoofs. The central plot has the President of the United States attempting to find out who is behind the decidedly un-family friendly shows that are playing on TVs across America. For the most part the movie is full of very funny low brow and topical humor. Some of the topical stuff, the Biafra TV dinner for example, will mean nothing to those who weren't around in 1977 when this was made. If you were around then you'll probably find this very funny. Of course some of the jokes are topical once more with a tobacco ad spoof taking aim at organizations like Save the Children. Much of the humor is very pointed and it would probably be a good guess that it helped keep this from ever being widely released (of course the glut of movies like this didn't help either) If you can find this movie its worth taking 75 minutes to give it a shot (though look for it under the name Prime Time). Odds are you won't remember it in the morning but you will get some laughs out of it. (Probably of interest to no one: The DVD I saw appears to have been made from an unmasked print which frequently allows lights, microphones and other goodies to be seen on the edges of the screen.)",
         "this made me laugh soooooooooo many times. this genre has only a few worthwhile entries and this is without a doubt one of them. politicaly incorrect humor that never stops and i mean never it jabs everything. only a few lulls but mostly pure classic comedy that will offend some but make others burst with laughter. the funny scenes are not just chuckles but roars.",
         "Some unknown source has interrupted all television transmissions around the world. In place of the regular broadcasts, a lineup of extremely tasteless programs and commercials have been substituted. Oddly, despite a cast of dozens, few known names appear in the film: a young Harry Shearer and Kinky Friedman are probably the best known (though maybe in the 1970s some of these people were better known and I am just too young). I loved some of the skits: the retroactive abortion, frontier gynecologist, Bad Lucas, and the midget sheriff. Many others got a smile or chuckle out of me. And the very idea of just having short little sketches was perhaps before its time -- today's ADHD folks love \"Robot Chicken\", which is not unlike this movie. Not every sketch is funny, and maybe some will appeal more to some people than others... but overall, not bad. Worth a look.",
         "This short film is a hilarious compilation of skits spoofing 70s era television and commercials, tweaking racial stereotypes, consumerism, and American prudishness. Its premise is that television broadcasts in American and other countries get interrupted by a series of increasingly offensive commercials and television shows. Nudity, profanity, and all around bad taste are on this evening's schedule. This movie is of its time, violating many of the tenets of political correctness that mute modern comedy. Spoofs on Apartheid South Africa and \"Tran Puerto Rico Airlines\" are particularly notable examples. Although some may find these skits offensive, they make one nostalgic for a time when satire and humor was more unbridled. Those who think that South Park and Judd Apatow movies are the height of ribald humor are in for a surprise.",
         "Series of parody skits skewer social topics and television commercials under the pretense of illegal television broadcasts by some unknown group. Some are quite funny while others don't survive the test of time. A few were licensed from National Lampoon. Some of the funniest are the parodies of the U.S. President and his chief arguing about the conspirators and actions to take. The ending is rather sardonic and poignant in light of Gorgeous Georgie and Doofus Dickie. Well produced and directed in spite of limited budget. Available as part of the Drive In 50-movie pack released by Mill Creek Entertainment. Unfortunately, the source print while complete was apparently turning or had lost color and the transfer has many extremely dark areas. But, the comedy doesn't suffer from such. These are similar to skits from the early years of Saturday Night Live.",
         "No, this isn't \"Kentucky Fried Movie\" or \"Tunnelvision\" (which I haven't seen in YEARS) but it's funny. A few misses and yeah, lots of dated material that, had I not grown up with some of these ads, I just would have found them amusing, not FUNNY. As I watched yesterday and finished up this morning, I could hear people saying, \"That's just not funny. That's sick. It's disgusting that someone would find THAT funny after all that's happened.\" etc. The hunting sequence in Austin really hit me that way. You know what? This movie isn't MEANT to be nice, polite and bland, it's meant to stab you in the funny bone and twist until you can't help but laugh. Making fun of the extreme is great humor. No, not everyone will appreciate it, but not everyone is supposed to. It's like REAL TV, if you don't like it, change the channel. Now, if I could only find \"Tunnelvision\" \"Grove Tube\" somewhere, my collection could be complete.",
         "Prime Time (American Raspberry) is extremely hilarious! I love all the skits and gags! It's a shame that hardly anyone knows about it and it's extremely hard to find. It's a very rare film, and you should try to find it. One night, an unknown source has interrupted all television around the world, and in it's place, some weird shows, commercials, and a sex telethon. There is news about aborting the fetus during it's 5th year of life. Ole Ben Lucas. Trans Puerto Rico, Poodles for Christ, The Charles Whitman Invitational. Manny's Nymphs, The S**theads, and much more! If you love spoofs, I highly recommend PRIME TIME (AMERICAN RASPBERRY)!!!",
         "If you're a fan of TV parody movies like \"The Groove Tube\" or \"Kentucky Fried Movie\" you'll love this film. It may not be the best of them (I gave it a 7) but if you're a fan of the genre, it's worth a look. Keep an eye out for a pre-\"Animal House\" Stephen Furst. It's very hard to find and is not available for purchase, but if you do happen to find it, you'll like it. WARNING: Not for all tastes.",
         "This one feels like an even-lower-budget and less funny cousin to Kentucky Fried Movie. This has a loose storyline of the government and military officials gathering to deal with the problem of some mysterious forces tampering with the airwaves and airing all sorts of parody commercials, skits and telethons. I probably would've loved this if I saw it when I was 12, but it's clearly intended for adults, and juvenile ones at that. There's some good tasteless laughs, but mostly pretty poorly paced sketches sometimes leave you guessing the punchline well before you see it. The shorter bits were the funnier ones. The LONG Charlie's Angel parody seems to go on forever since it's really a one-joke premise. Watch for brief appearances by folks like Harry Shearer and author/musician/politician Kinky Friedman."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Chartwell Films Ltd.",
         "Warner Brothers"
      ],
      "summaries": ["Some unknown source has interrupted all television transmissions around the world. In place of the regular broadcasts, a lineup of extremely tasteless programs and commercials have been substituted. Included in the mix are such show as The Shitheads, The Charles Whitman Invitational, and commercials for a number of improbable products."],
      "budget": 50000
   },
   "movielensId": 107289,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-09-12",
      "dvdReleaseDate": null,
      "directors": ["Bradley R. Swirnoff"],
      "runtime": 75,
      "movieId": 107289,
      "title": "American Raspberry",
      "mpaa": "",
      "actors": [
         "Joanna Cassidy",
         "Warren Oates",
         "Harry Shearer",
         "Susan Doukas"
      ],
      "imdbMovieId": "0162854",
      "originalTitle": "American Raspberry",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Some unknown source has interrupted all television transmissions around the world. In place of the regular broadcasts, a lineup of extremely tasteless programs and commercials have been substituted. Included in the mix are such show as The Shitheads, The Charles Whitman Invitational, and commercials for a number of improbable products.",
      "tmdbMovieId": 77161,
      "avgRating": 0,
      "releaseYear": "1977",
      "numRatings": 0,
      "posterPath": "/dvbsuGpCJjXJDJbzC4pMMzEsJzE.jpg"
   }
}