{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cult horror",
            "id": 156324
         },
         {
            "name": "found footage",
            "id": 163053
         }
      ],
      "imdb_id": "tt3104078",
      "video": false,
      "title": "WNUF Halloween Special",
      "recommendations": [
         83913,
         27548,
         45937,
         251733,
         85646,
         90164,
         233734,
         78250,
         30385,
         171703,
         130165,
         84372,
         85024,
         187801,
         78253,
         144696,
         58250,
         155706,
         28128,
         55952
      ],
      "backdrop_path": "/aQMcpFHZGWMU8p4wUzxZ4WnvBAB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Frank Stewart",
               "gender": 0,
               "credit_id": "52fe4d87c3a368484e1ee075",
               "name": "Paul Fahrenkopf",
               "profile_path": null,
               "id": 79807,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ms. Kim",
               "gender": 1,
               "credit_id": "52fe4d87c3a368484e1ee079",
               "name": "Patricia Mizen",
               "profile_path": "/lKdiVcoeIGbuEwd0V2VFl5ZpaoA.jpg",
               "id": 207085,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "WNUF Announcer (voice)",
               "gender": 0,
               "credit_id": "59f74f66c3a368049a0002a4",
               "name": "Aaron Henkin",
               "profile_path": null,
               "id": 1914431,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Veronica Stanze",
               "gender": 0,
               "credit_id": "59f74f74c3a368047d00024d",
               "name": "Nicolette le Faye",
               "profile_path": null,
               "id": 1350438,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Deborah Merritt",
               "gender": 0,
               "credit_id": "59f74f8292514131ca00028a",
               "name": "Leanna Chamish",
               "profile_path": null,
               "id": 99590,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Gavin Gordon",
               "gender": 0,
               "credit_id": "59f74fa2c3a368047d000285",
               "name": "Richard Cutting",
               "profile_path": "/svHF9EyniMg89GApJQ97szqqu4l.jpg",
               "id": 1688103,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Dr. Louis Berger",
               "gender": 0,
               "credit_id": "59f74fb192514132120002bb",
               "name": "Brian St. August",
               "profile_path": null,
               "id": 1914433,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Claire Berger",
               "gender": 0,
               "credit_id": "59f74fc092514131ca0002e7",
               "name": "Helenmary Ball",
               "profile_path": null,
               "id": 1350440,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Father Joseph Matheson",
               "gender": 0,
               "credit_id": "59f74fd692514132040002cb",
               "name": "Robert Long II",
               "profile_path": null,
               "id": 1762914,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Donna Miles",
               "gender": 0,
               "credit_id": "59f74fe592514131fc000338",
               "name": "Sabrina Taylor-Smith",
               "profile_path": null,
               "id": 1350441,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Angela Harris",
               "gender": 1,
               "credit_id": "59f75022925141321200034f",
               "name": "Kendra North",
               "profile_path": "/yasVXywCM1x7ZEtDw8e1LyKYObb.jpg",
               "id": 1355786,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d87c3a368484e1ee071",
               "name": "Chris LaMartina",
               "profile_path": null,
               "id": 1194636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59f74ecf92514131ec000178",
               "name": "Chris LaMartina",
               "profile_path": null,
               "id": 1194636,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59f74ef2c3a368047d0001a7",
               "name": "Chris LaMartina",
               "profile_path": null,
               "id": 1194636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59f74effc3a368047d0001b9",
               "name": "Jimmy George",
               "profile_path": null,
               "id": 1350452,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59f74f0fc3a36804b90001db",
               "name": "Chris LaMartina",
               "profile_path": null,
               "id": 1194636,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59f74f1592514132120001f0",
               "name": "Chris LaMartina",
               "profile_path": null,
               "id": 1194636,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59f74f2292514131ca0001fc",
               "name": "A.g. Sherman",
               "profile_path": null,
               "id": 1914430,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59f74f33c3a36804ca000211",
               "name": "Marla Parker",
               "profile_path": null,
               "id": 1350454,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.958668,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 210842,
      "vote_count": 10,
      "budget": 0,
      "overview": "Originally broadcast live on October 31, 1987, the \"WNUF Halloween Special\" is a stunning expose of terrifying supernatural activity that unfolded at the infamous Webber House, the site of ghastly murders.  Local television personality Frank Stewart leads a group of paranormal investigators including Catholic exorcist, Father Joseph Matheson and the prolific husband-and-wife team Louis and Claire Berger. Together, the experts explore the darkest corners of the supposedly haunted Webber House, trying to prove the existence of the demonic entities within.  Did they find the horrific truth or simply put superstitious rumors to rest?  Compiled from the highest quality source material available, this trailer is for the first official release the program has received since its initial broadcast.",
      "similar": [
         23827,
         46146,
         41436,
         50698,
         50357,
         72571,
         134366,
         38358,
         38410,
         8329,
         496,
         2667,
         620,
         298312,
         452507,
         256274,
         242606,
         77949,
         11031,
         7191
      ],
      "original_title": "WNUF Halloween Special",
      "runtime": 83,
      "poster_path": "/5SFXptDKCoOB6GFPsRlnESgcoIP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Midnight Crew Studios",
         "id": 29264,
         "origin_country": ""
      }],
      "release_date": "2013-10-23",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Chris LaMartina",
         "James Branscome"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Chris LaMartina",
         "Jimmy George"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3104078/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI1OTMzNzc3M15BMl5BanBnXkFtZTgwNzkxNzI1MDE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Fahrenkopf, Aaron Henkin, Nicolette le Faye | See full cast and crew »"],
      "reviews": [
         "It saddens me I am the first person to write about this movie. I guess I'm not really too sure how I even found out about it. Unfortunately for me, this is not a movie you want to have even heard of before experiencing it. It's available on VHS or DVD, get it on VHS if you have a working VHS player, as getting this on DVD is kinda pointless. I told my wife I found an old VHS tape someone had recorded in the 80's and made copies of, and we were gonna watch it for Halloween. This movie by far is the most believable 'found footage' movie I've ever seen. There were times I thought it was an actual recording from the 80's, and I knew about the movie. The VHS quality, the terrible commercials, the bad acting, and there are no credits to be found in the movie. The entire movie she kept asking me, is it real or is this one of those Blair Witch movies? I played dumb, and said I don't know, I found it online. The movie itself isn't anything spectacular, I rate it so high mostly for the fact there is no other 'found footage' movie this believable. It will be a hard movie to ever become a 'cult' movie just for the fact that once you know its's a movie; it definitely ruins the experience somewhat. My plan is to hang on to this treasure till I have kids, and tell them my parents recorded this in the 80's from TV on a VCR tape (kids won't even know what VHS tapes are then). This movie will for sure be in my Halloween viewing collection every year, and I hope to get more people to see it, as it's virtually unknown. The movie was made dirt cheap as well, and is an inspiration for people interested in making movies; as it shows a clever gimmick can go a long way.",
         "This is a film that in theory sounds really cool, and is actually executed in a well done way, but just doesn't work. It's the kind of thing that would work as a creepy pasta you would read online, but it doesn't have enough entertainment to be a movie. The biggest issue here is just how much horror we get. The movie is supposed to look like an old VHS tape that contains a recording of an old 80s/90s broadcast of a live haunted house investigation. They really nail the feeling of nostalgia when you watch this. It really feels like a real old tape. But the issue is that they focus too much on that. We get these really well done commercials that at first are funny just because of how they really seem like an 80s/90s commercial, but the movie keeps cutting to these commercials over and over. The joke really starts to pound you over the head to the point where it essentially ruins the film. I want to see the strange events occurring in the live broadcast, not these well done but unfunny commercials. We occasionally get somebody fast forwarding through the commercials which is funny to see, but I really feel like the movie needed to fast forward through the commercials a lot more. It certainly is more of a comedy than a horror. The horror aspect is okay, but it can be ruined by the comedy, which is a problem that I find happens very often with comedy/horror films. They are two genres that are EXTREMELY difficult to mix and turn out well, yet so many independent film makers try to do it with horrible results. Just because Evil Dead 2 did it, doesn't mean any movie can. This film kind of makes it work, but it's not perfect. I think the films ending gives it a bit more of a boost though, because it's kind of cool. In the end, I think the concept to this is great, and it does work as a film that is trying to show that old nostalgic VHS tape style, but it just isn't entertaining enough. Maybe it would work if you showed someone this and told them it was real just to see their reactions, but other than that, it kind of falls flat.",
         "\"WNUF Halloween Special\" is one of the many \"found footage\" movies that have cropped up in the last decade. \"Supposedly\" this special was aired in the late 80's on a local UHF station. Afterwards, all known copies were destroyed and the event was forgotten about, until now (Blah blah blah, you know the gist of these things) Basically a news reporter, a paranormal investigator husband and wife team (along with their cat) and a priest, seek to unravel the rumored haunting of a local house where a son killed his parents after being told to do so by ghosts that he communicated with via a Ouija board. Surprisingly the film is very authentic, looking exactly like a 3rd or 4th generation VHS tape, complete with \"modern for the time\" commercials with varying degrees of cheese. And while not too terribly frightening (to me at least), it does build atmosphere, which a lot of \"found footage\" films are sorely lacking. Definitely worth a viewing",
         "The WNUF Halloween Special has one of the coolest concept I've seen in a long time. In the late '80s a live news broadcast holds a séance in an abandoned house where several murders had occurred years earlier.....and then terrible horror movie thing start to happen. The cool part is that this story is presented as though a person had taped it when it aired live, and someone found it years later. The movie's creator actually put a few copies in thrift shops hoping someone would buy it and spread the word about a creepy VHS tape they found, unfortunately, none have turned up yet. Anyone that ever bought old second hand tapes of random movies or watched TV that had been recorded on a VHS and liked seeing the old commercials and TV bumpers would likely find something to enjoy in this film. This unique presentation is one of the films main selling points. It does a great job replicating an actual local news station from the 1980s. It has the correct kind of tape damage and decay you would expect and even has some really funny (and incredibly stupid) commercials for fictional local businesses. A lot of the time period pieces overdo the clothes and pop culture references to showcase the decade it takes place in, but the WNUF Halloween Special is surprisingly restrained and realistic with it's style. It's a little difficult to gage how good the acting actually is because most of the characters are news presenters using their overly chipper television personas, which are intentionally awkward and bad, but the moments where something happens and they do break character are well acted. It comes across as genuine concern and shock. The only other characters are paranormal investigators who are also putting on a show for the cameras and some locals being interviewed who are acting stupid for the cameras. There's also a dentist who hates candy and shows up several times. It's all pretty believable, and there's nothing that would take you out of the movie. People shouldn't be mistaken in thinking this a straight forward horror movie. It's definitely a horror comedy that pokes fun at bad local TV and knows how silly it is at times, but it doesn't shy away from some darker moments too. Overall it's a really great watch and a fun movie for horror fans. A lot of films are doing similar things with found footage and what-not, but this film does a fantastic job using the format and goes all out to create a believable story. This would be the perfect movie to get and have some friends come over and watch it under the pretense that it's a real taped special you found at a yard- sale or something, so you can freak them out. I really encourage that you seek it out.",
         "I can't believe more people aren't praising this film. Its great, silly fun, doesn't work as a horror film that well, but its still entertaining and even hilarious at times. The commercials....someone was complaining about the commercials, I guess you had to be around at that time in some podunk town to understand how brilliant of a recreation this is. Somebody knows that time really well. The music, even the fonts, were all ridiculously of their time. This is the kind of local programming that really doesn't exist much at all (if at all) anymore. I felt like i was watching Channel 36 from Atlanta waiting for \"Movie Macabre\" to come on. They could have amped up the scares a bit, made it really spooky, but i still think this is one of the more brilliant takes on the whole \"found footage\" bit. Certainly the most humorous. I have to think this film was loads of fun to make.",
         "Complete with fake TV ads, The WNUF Halloween Special really, really nails the low budget, awkward nature that an actual live TV special of the late 1980's might have had. Unfortunately, I found it a little TOO authentic. After a while, it genuinely feels like the whole point of this \"movie\" is to string you along to sit through the next commercial break. They're good fake commercials, don't get me wrong, but just like real TV, there's only so many \"we'll find out what that was when we come back after this commercial\" cliffhangers you can take before it starts to get frustrating. Which feeds in to a larger problem: there's not much that actually happens, here. Characters are almost non-existent, there's no real narrative to follow, there's very little setup and there's barely any payoff. Again, it all feels incredibly realistic in that regard. This kind of show, if it actually existed, would not be concerned with a traditional movie narrative, because it's just a crummy live broadcast on Halloween. But if what happens in this \"tape\" was actually real, it would also just be a highlight on Youtube of only the relevant parts, not the full 90 minute recording with all the commercials still left in (including half of the nightly news that aired prior to the special). It's not totally devoid of fun, of course. They play up the awkwardness of live TV, and how the host reacts to audience members or callers can get some laughs, but those moments are too few and too far between, nor do they really build towards anything. I admire what the WNUF Halloween Special is going for, but its slavish dedication to replicating even the worst aspects of television ended up making it kind of a bore. It's more entertaining on a conceptual level than it is when you're actually watching it. I'm sure there's people out there who are probably way in to something like this, but I don't think I am.",
         "This could've and should've been terrific. The filmmakers totally nail the look and feel of cheap, local 80's TV and waste it on a poorly acted and terribly crafted found-footage horror story that doesn't work in any way, start to finish. There are moments when I truly thought I was watching an old VHS tape which makes it all the more sad that nothing besides the commercials are very well thought out. The story is truly lame as are the actors. Some so over the top you wouldn't be wrong thinking you'd stumbled into a high school play. That said, if these guys were given another venue, Adult Swim comes to mind, and some decent performers, this stuff could be damn entertaining. Drop the Poughkeepsie Tapes angle and you've got the second coming of SCTV here."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Midnight Crew Studios"],
      "summaries": ["Originally broadcast live on October 31, 1987, the 'WNUF Halloween Special' is a stunning expose of terrifying supernatural activity that unfolded at the infamous Webber House, the site of ghastly murders. Local television personality Frank Stewart leads a group of paranormal investigators including Catholic exorcist, Father Joseph Matheson and the prolific husband-and-wife team Louis and Claire Berger. Together, the experts explore the darkest corners of the supposedly haunted Webber House, trying to prove the existence of the demonic entities within. Did they find the horrific truth or simply put superstitious rumors to rest?"],
      "budget": 0
   },
   "movielensId": 107612,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-10-23",
      "dvdReleaseDate": "2013-10-18",
      "directors": ["Chris LaMartina"],
      "runtime": 83,
      "movieId": 107612,
      "title": "WNUF Halloween Special",
      "mpaa": "",
      "actors": [
         "Paul Fahrenkopf",
         "Patricia Mizen",
         "Aaron Henkin",
         "Nicolette le Faye",
         "Leanna Chamish",
         "Richard Cutting",
         "Brian St. August",
         "Helenmary Ball",
         "Robert Long II",
         "Sabrina Taylor-Smith",
         "Kendra North"
      ],
      "imdbMovieId": "3104078",
      "originalTitle": "WNUF Halloween Special",
      "genres": [
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": ["u5iCF2Ltjlk"],
      "plotSummary": "Originally broadcast live on October 31, 1987, the \"WNUF Halloween Special\" is a stunning expose of terrifying supernatural activity that unfolded at the infamous Webber House, the site of ghastly murders.  Local television personality Frank Stewart leads a group of paranormal investigators including Catholic exorcist, Father Joseph Matheson and the prolific husband-and-wife team Louis and Claire Berger. Together, the experts explore the darkest corners of the supposedly haunted Webber House, trying to prove the existence of the demonic entities within.  Did they find the horrific truth or simply put superstitious rumors to rest?  Compiled from the highest quality source material available, this trailer is for the first official release the program has received since its initial broadcast.",
      "tmdbMovieId": 210842,
      "avgRating": 2.36364,
      "releaseYear": "2013",
      "numRatings": 11,
      "posterPath": "/5SFXptDKCoOB6GFPsRlnESgcoIP.jpg"
   }
}