{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0124621",
      "video": false,
      "title": "The Laughing Woman",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe49e1c3a36847f81ab7ad",
               "name": "Dagmar Lassander",
               "profile_path": "/3FAkdrwEpPW0ypLQp37EF5WXooU.jpg",
               "id": 46636,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr. Sayer",
               "gender": 2,
               "credit_id": "52fe49e1c3a36847f81ab7b1",
               "name": "Philippe Leroy",
               "profile_path": "/1LUvDUsO6mxUBVXSjuGbyKESzDI.jpg",
               "id": 25333,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Administrator",
               "gender": 0,
               "credit_id": "52fe49e1c3a36847f81ab7b9",
               "name": "Varo Soleri",
               "profile_path": null,
               "id": 1168849,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sayer's Secretary",
               "gender": 0,
               "credit_id": "52fe49e1c3a36847f81ab7bd",
               "name": "Maria Cumani Quasimodo",
               "profile_path": null,
               "id": 99792,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Streetwalker",
               "gender": 1,
               "credit_id": "52fe49e1c3a36847f81ab7c1",
               "name": "Mirella Pamphili",
               "profile_path": null,
               "id": 995741,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gida",
               "gender": 0,
               "credit_id": "54a7f4ec9251414d5b001b5c",
               "name": "Lorenza Guerrieri",
               "profile_path": null,
               "id": 31613,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49e1c3a36847f81ab7a9",
               "name": "Piero Schivazappa",
               "profile_path": null,
               "id": 128924,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "564a7bc8c3a3686024001263",
               "name": "Stelvio Cipriani",
               "profile_path": "/lMk2Iwbq2RcvCZd9UJw0QtT74VZ.jpg",
               "id": 29501,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57da11a1c3a36879eb000462",
               "name": "Paolo Levi",
               "profile_path": null,
               "id": 1088500,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57da11b4c3a36879e7000405",
               "name": "Piero Schivazappa",
               "profile_path": null,
               "id": 128924,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57da11bbc3a36879d9000486",
               "name": "Giuseppe Zaccariello",
               "profile_path": null,
               "id": 44985,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57da11c492514150d6000549",
               "name": "Giuseppe Zaccariello",
               "profile_path": null,
               "id": 44985,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57da11db92514150dd0004f3",
               "name": "Carlo Achilli",
               "profile_path": null,
               "id": 1679182,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57da11e392514150dd0004fb",
               "name": "Sante Achilli",
               "profile_path": null,
               "id": 1123363,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57da11eac3a36879eb000477",
               "name": "Carlo Reali",
               "profile_path": "/fc5LTUaduPG1U24UB7jqQgg12j6.jpg",
               "id": 44967,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57da11f3c3a36879dd0004d0",
               "name": "Francesco Cuppini",
               "profile_path": null,
               "id": 1024748,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57da11fa92514150d100048c",
               "name": "Enrico Sabbatini",
               "profile_path": null,
               "id": 14590,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57da1202c3a36879d9000498",
               "name": "Mario Morigi",
               "profile_path": null,
               "id": 1560818,
               "department": "Sound",
               "job": "Sound Mixer"
            },
            {
               "gender": 2,
               "credit_id": "57da120b92514150d100048f",
               "name": "Carlo Rambaldi",
               "profile_path": null,
               "id": 20504,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.471584,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 100812,
      "vote_count": 3,
      "budget": 0,
      "overview": "Beautiful PR woman Maria finds herself trapped in the home of the sinister and troubled Dr Sayer, where she is subjected to a series of increasingly bizarre, terrifying and degradating sex games. Sayer admits that he has murdered several women after the same ordeal, always killing them at the point of orgasm. But all is not what it seems, and this is revealed to be the fantasy of a troubled man. Sayer finds salvation in Maria and falls for her, only for her to turn the tables on him and ultimately reveal that she too is not what she seems.",
      "similar": [],
      "original_title": "Femina Ridens",
      "runtime": 86,
      "poster_path": "/8Bv3Z5mOTrrmvh9onLv78aSa7wb.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cemo Film",
         "id": 10475,
         "origin_country": ""
      }],
      "release_date": "1969-08-24",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Piero Schivazappa"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Paolo Levi",
         "Piero Schivazappa"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0124621/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NjU0MzA2NV5BMl5BanBnXkFtZTcwNDQ3ODgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Philippe Leroy, Dagmar Lassander, Lorenza Guerrieri | See full cast and crew »"],
      "reviews": [
         "'The Frightened Woman' is a wonderful slice of 60s sexploitation - stylish, erotic and camp to the nth degree! Fans of Jess Franco's non-horror movies like 'Succubus' and 'Sadisterotica', or Dallamano's underrated 'Venus In Furs' (aka 'The Devil In The Flesh') will eat this baby up! Philippe Leroy is well cast as Sayer, the rich, jaded sadist who likes to degrade women for kicks, and Dagmar Lassander (who some may remember from Fulci's so-so 'House By The Cemetery') is equally good as the inquisitive journalist who unexpectedly finds herself trapped in his vicious games. She surprises Sayer (and us) by subverting his tricks and tortures, and takes him on a journey that he could never have foreseen, and the ending may be slightly predictable, but is still worth waiting for. Like much of Franco's output from the same period, this movie is equals parts art and trash, with many psychedelic touches, some very effective, and others unintentionally hilarious. You either dig this era and these kinds of movies, or you don't. I do, and I loved it. An underrated movie that deserves a much larger audience.",
         "From today's point of view it is quite ridiculous to rate this film 18 (or X in the US). The film has a sexual, yet sublime erotic story to tell, but the pictures are rather innocent. Throughout the movie you feel and see the spirit of the late 60s and early 70s in the fashion, the dialogues and the typical experimental cinematography and lighting. And this is exactly the part that makes it worth seeing.",
         "It could not have come from a different country nor from a different time. This movie simply oozes psychedelia influenced late 60s Italian cinema. So, pseudo serious and sexually free. Sumptuous settings and dreamy music make this a visual and aural delight. Plus we get the lovely Dagmar Lassander, surely at her very best looking. The kinky goings on make for a wild ride and if the romps amidst the Mimosa towards the end seem overlong it is but another rather charming trait of the time. You were probably expected to split those few minutes between the screen and your girlfriend and it does of course herald a twist in the proceedings. It might have been better if Philippe Leroy didn't look quite so odd with his fraying red hair and twisted facial expression. He does well though and has many silent moments where Dagmar is cavorting and he has to show a mixture of love and hate. Not an ordinary narrative film by any means but for those who like that something different, this is certainly that.",
         "As with FOOTPRINTS (1975), I became aware of this one purely by accident: it was mentioned in a review of THE LIBERTINE (1969), which I researched when that film turned up on late-night Italian TV, as being in a similar vein; incidentally, I missed out on that screening of THE LIBERTINE (though I acquired it via the same channel later on) but did manage to watch the film by way of a rental of the English-dubbed R1 DVD during my sojourn in Hollywood in late 2005/early 2006. Actually, in view of the enthusiastic reviews for it, I was let down by THE LIBERTINE – being too light-hearted in nature for what was essentially a serious theme (the sado-masochistic relationship between a young couple)!; to be honest, for much of the time, I was afraid that THE FRIGHTENED WOMAN would go the exact same route…but was subsequently amply redeemed by a wicked (if not exactly unpredictable) final twist. The film concerns the freethinking social attitudes and dazzling creative arts prevalent in this era: an eminent philanthropist (Philippe Leroy) invites a female journalist (Dagmar Lassander) at his fashionable home for the week-end; however, it transpires that he’s a misogynist who distrusts all members of the opposite sex and would rather dominate (or even kill) them! Therefore, for the first half of the narrative, we see the heroine enduring pain and humiliation at Leroy’s hands (including being forced to make love to a dummy in his own image!)…until the tables are subtly, but unsurprisingly, turned: she not only emancipates herself from his control, but teaches him that Man and Woman can co-exist harmoniously – except that Lassander’s following her own personal agenda as well!! The leads are perfectly cast, and the film itself often darkly comic for those in the mood; furthermore, it’s greatly abetted by a typically effervescent “Euro-Cult” score (from the ever-reliable Stelvio Cipriani) and the imaginative – even outré – look (the giant structure depicting the lower section of the female form, with a steel-trap where its sexual organ should be, seems to emanate from Freud: incidentally, this prop figured prominently in stills I’d seen previously from THE FRIGHTENED WOMAN…but it barely registers in the film proper!). Other bizarre touches include the preposterous radio program “Sexual Aberrations And The Stars”, and an idyll at a castle belonging to Leroy’s family complete with secret passage through the wardrobe and a dwarfish manservant. One of the highlights, then, is easily Lassander’s erotic dance virtually in the nude – an episode which actually spearheads the ‘humanization’ of Leroy; eventually, the two characters have a ‘showdown’ in the latter’s pool – amusingly set to a Spaghetti Western-type theme! In the long run, for all its stylishness, the film emerges as inferior to the similar but much more extreme contemporaneous Japanese masterpiece by Yasuzo Masumura BLIND BEAST (1969). Finally, it’s worth noting that THE FRIGHTENED WOMAN was distributed in the U.S. by film-maker Radley Metzger’s company Audubon Films; he would even employ its production designer (Enrico Sabbatini) for his own CAMILLE 2000 (1969)! To get to the edition I watched: apart from the usual shortcomings in the English-dubbing department, the presentation here was further marred by a rather washed-out appearance and brief instances of distracting extraneous noise on the soundtrack! By the way, there seems to be some confusion with respect to the film’s running-time: its length given on various sources ranges anywhere from 84 to 108 minutes – all I can say, however, is that the copy I own ran for 87 minutes!",
         "If you need that instant buzz that only late 60s/early 70s Euro sex movies can give off, then look no further for you have just stumbled across the mother lode ! Subsequent TV director Schivazappa's exercise in psychedelic porn (of the soft core variety) may not generally be considered as a classic of its kind but it knocks many better known titles from the likes of Tinto Brass, Jess Franco and Joe D'Amato for a loop. Radley Metzger sure was hip to this way before anyone else when he picked up this marvelously twisted little number for US distribution through his company Audubon. Gorgeous cinematography (favouring symmetrical compositions) may elicit cries of 'pretentiousness' from those who swear by shoddy skin flicks shot in someone's backyard. Hey, as far as I'm concerned, it's their loss for this is one thrill ride of a movie with twists so, well, twisted that you may not even believe them after you have actually witnessed them on screen ! Dagmar Lassander (immortalized as the gone to seed landlady from Lucio Fulci's HOUSE BY THE CEMETERY) has never looked more exquisite than she does here, subtly portraying the innocent (?) researcher held hostage by mad medic Philippe Leroy (with all the art-house favorites to his name, you wonder whether he has the good humor to mention this one on his c.v.) as their initially violent 'relationship' turns to S&M-tinged love story. Nothing is what it seems however in this sick and imaginative gem of a movie with several truly erotic moments achieved with surprisingly minimal nudity. I for one was completely baffled and enchanted by the way Schivazappa chose to suggest oral sex during one scene (I'll let you find that one out for yourselves...) and Lassander's gauze-clad boogie to an impossibly groovy 60s tune should have become iconic in a way similar to the image of Sylvia Kristel reclining in that wicker chair in her EMMANUELLE days. You may not know this film just yet, but trust me, once seen you'll never forget it !!!",
         "I had a great time watching Femina Ridens a couple of mornings back, somewhat hungover. For most of the film its pretty much a two hander, showing the games and weird relationship of crazy doctor Philipe Leroy and stunning Dagmar Lassander. I'd seen her before in a couple of Fulci films dying gruesome deaths, but here she is young hip and beautiful. The film is pretty predictable and certainly mild on the exploitation front, but entertaining throughout owing too its marvellous colourful kitsch feel. The set design, music, lighting and cinematography are all classic late sixties Italian style, a surreal feast for the eyes and ears and though the general thread of the plot is not too difficult to foresee there are more than enough unusual events and memorably bizarre sights and sounds to keep things interesting throughout. Both leads are pretty good, and it bears repeating that Dagmar Lassander is really, really fine. The music, by Stelvo Cipriani is gnarly too, perfectly suited to the images. Director Pierro Schivazappa has come up with quite a cracker here, but its not perfect. Though very alluring, there's little substance here and the exploitation elements are about as mild as can be. I guess this gives it a sort of charm and innocence but I can't help thinking that the subject matter could have done with more sleaze, more threat, that sorta thing, especially since its pretty simple to figure whats going to happen. This is I suspect a bit pointless for stronger exploitation fans and certainly not for people wanting sex or much nudity. Its more of a light, fun pop art affair, lovable but insubstantial, like bubble bath. Recommended mainly for those fond of the 60's, Dagmar Lassander, or sweet set designs.",
         "Every once in a while us cult Euro freaks stumbled upon something that could genuinely be classified as a hidden gem. The Frightened Woman certainly falls into this category. Unlike many similar sexploitation films from the time, this Italian effort is pretty obscure and relatively unknown. Its recent DVD release has went some way to address this of course, and it's a very good thing too as this is a superior genre effort. In fact, I would have to say that it's one of the very best examples of Eurotica full stop. What differentiates this one from most others is in its very stylish look and feel. The set design is terrific throughout, with great décor and excellent use of colour and lighting. The cinematography is extremely good throughout which only accentuates things even more. It really feels like one of those glorious Italian movies from the period that combined psychedelia with pop art and a slice of surrealism. It means that this picture is very much a product of the time. This of course, is naturally a huge plus point and can be taken as a recommendation in itself. The story involves an S&M relationship between a rich misogynist and a captured woman. The film stars Dagmar Lassandar who is one of the unsung greats of Italian genre cinema. She starred in a number of great films from the likes of Mario Bava, Lucio Fulci, Ricardo Freda and Luciano Ercoli. This is undoubtedly her best role though. Her sex appeal is utilised very well throughout, peaking with a tremendous scene that can best be described as 'Lassandar's dance', where she grooves on down to some Europop in a glorious extended scene. The music throughout by Stelvio Cipriani is superior, some of the best he ever did. The Frightened Woman is an unconditional recommendation to all fans of cult Euro cinema of the psychedelic/pop art type. It's bizarre, effortlessly cool and sexy.",
         "Dr. Sayer(Philippe Leroy), a wealthy physician with psychological issues regarding the opposite sex, kidnaps an employee, Maria(Dagmar Lassander), a free-thinking liberal woman who believes men must be the ones \"fixed\" instead of females. Sayer retreats to his palatial estate, running Maria through a humiliating series of mind games, threatening to molest and kill her. Sayer's desire, it seems, is to dominate her body, mind and soul, making her his sexual slave, obeying his commands, adhering to his every wish and whim. After resistance, at first, Maria slowly teeters towards his objective, but has plans of her own..she says she wishes to help Sayer relinquish his sadistic behavior towards women, so that he could love and not feel such yearning desires to harm. It seems that Sayer has her under his grip, agreeing to certain rather embarrassing scenarios(..such as lotioning his toes, \"making love\" to a blow-up doll which is a recreation of himself, often spending time topless, and even getting hosed down when she slaps him hard across the face bringing blood from his nose)which almost break her, but something happens as the troubled doctor slowly falls in love with Maria..and through what appears to be a desperate attempt to end the madness, Maria gains an upper hand, toying with Sayer's lust for her body. More of a battle of wills, a kind of sexual warfare where it seems one is in charge when in fact the other truly has the upper hand. Through a great deal of the film, Sayer mistreats Maria, forcing her(..it seems)to submit to his series of psychological games of a sexual nature. Her attempts to escape fail because his home is such a well designed fortress..it's a typical European art deco kind of palace, fashioned and orchestrated by a man who has kept to this weekend retreat of his for quite a spell(..it features walls and doors opening at his command, with an area quarantined off for his \"victims\"). But, once Maria seemingly downs a bottle of pills as a result of her anguish at his hands, the tables are turned and she has him where she wants him. He finds that he actually craves her and Maria uses this to her advantage, playing hard to get when Sayer wishes to embrace and ravage her(..and, I could understand his frustration because she has this allure that can drive a man crazy) I felt the film works, ultimately, as a war cry for women, their empowerment and uprising against men who have the notion that they should always have control, sexually and mentally. The \"twist\" finalizes this ideal. I couldn't swallow Sayer's fate because of his rigorous cardiovascular activity and exercise regimen..we see how he develops his toned athletic figure, and how this regimen is part of the normal routine every weekend before the true mind games with his victim begin. If he is so well fit, and spends such time developing himself for the extracurricular activities which follow his regimen, how could he suffer the fate which follows his finalizing the deal with Maria at the end when she stops resisting his advances? Maria, he would later admit, is the first he's actually kidnapped; others from the past, call-girls, were paid for their services so that Sayer could feel the power of dominating a woman, even if it's all a fictitious charade brought about by a deeply troubled individual with an inability to connect with the opposite sex. The spontaneous decision to do so, to take a leap from the norm, costs him more than he could ever know. All this psycho-sexual sub-text is rather fascinating to see unravel, but Dagmar Lassander, such a yummy sex kitten, was my reason for enjoying it so..without her, I couldn't have liked it as much because she's vital as a victim worth striving to obtain. Perhaps the film's highlight, the delicious dance as Lassander, clothed in gauze(!), unravels the wardrobe exposing her breasts to a jazzy score..it's the kind of sexually seductive moment that makes your mouth water and forehead sweat. Dagmar Lassander must've been a joy for fashion designers because she wears those clothes so well..she has this kind of cool, a sophistication and screen presence along with her beauty and seductive powers, Dagmar transcends the part to create an iconic character which would define her career..even if the film isn't well known(..I found about through word of mouth). The provocative nature of the script and risqué subject matter might not appeal to certain crowds as it deals with sex(..and pain) in many different forms, the dialogue quite illustrative and elaborative. At times, I couldn't help but chuckle at Sayer's comments towards an imprisoned Maria, regarding how he enjoys making women suffer, and the thrill he gets at forcing them into a type of slavery(..in an attempt to make the words poetic, it all feels rather hokey). But, Dagmar is the real reason to see it, and the film, to me, works at it's best as a fetish film, a possible male fantasy with this seemingly prim and proper idealist, captured and held against her will, forced into a precarious situation, her fate possibly at the mercy of a complex and possibly dangerous masochist. Her submission, and how she reacts towards his aggressive behavior with her(..there are times where she unfolds to a wavering desire to embrace him, unveiling a possible attraction towards him which, in itself, might startle some who watch it)are among the most fascinating highlights of this exploitation feature. My other favorite scene, besides the dance, is the piano concerto with Sayer fondling Maria as she plays a soothing melody.",
         "A young journalist, kind of a tame 60's Euro version of a feminist, finds herself kidnapped by a deranged male artist. He shows her photographs of a number of a women he claims to have killed, and promises to do the same to her when he's finished having his way with her. She seems to develop a case of Stockholm syndrome and soon becomes his willing playmate. But at the end neither of the them turns out to be what they initially appear (to give you just a hint, this movie is alternatively called either \"The Frightened Woman\" and \"The Laughing Woman\"). The plot of this movie resembles both the earlier film \"The Collector\" and the later \"The Story of O\", but it is very different from either. It also somewhat resembles the contemporary Japanese \"pinku\" movies, but is much more tame. Like other Italian movies released by Radley Metzger's Audobon Films (i.e. \"La Matriarca)it kind of resembles one of Metzger's own films as well, but it is really its own unique creature. With the possible exception of Metzger's \"The Punishment of Anne\" (which I've never seen) this might be the best version of a B-and-D/S- and-M film. (Granted, that's not saying much). This movie works as a B-and-D fantasy because it really explores the relationship and the ever-shifting nature of power between the dominant and submissive partner, and also because, even more importantly, it STAYS at the level of fantasy. In America they are so nervous about this subject for some reason that it is actually illegal to tie someone up in a hardcore porno movie. This may not be such a bad thing though because in countries like France and Germany, which have no such compunctions, the introduction of a hardcore footage into a B-and-D plot creates a jarring realism so at odds with the psychosexual fantasy that the whole thing, far from being exciting and disturbing, is mostly just silly and stupid. (There are also, of course, plenty of people who actually live this \"lifestyle\", but the less said of them the better). The much more subtle, even tame approach really works here (for me). I especially enjoyed the pop-art set design and the kind of Freudian obsessions that were big in those days (i.e. one of the artists sculpture's looks like giant vagina dentata). The movie really doesn't get much more racy than Dagmar Lassender dancing around in an unraveling paper dress (but then again you ought to SEE Dagmar Lassender dance around in an unraveling paper dress), or more violent than some of the slide photographs the artist shows of his previous murder victims(which may not be genuine). I'm sure this arty and rather mild movie will disappoint both the serious porn addicts and the truly perverted S-and-M/bondage freaks, but for all of us curious (but not THAT curious) Euro movie fans it's a pretty decent way to go.",
         "Piero Schivazappa's \"Femina Ridens\" (aka. \"The Frightened Woman\"/\"The Laughing Woman\") of 1969 is a picturesque and rather bizarre Italian Sexploitation effort that combines sadomasochistic sleaze with a psychedelic art-house atmosphere. Both in terms of style and theme, the film strongly reminded me of another artsy European Exploitation highlight from the same year, Jess Franco's \"Venus in Furs\" (aka. \"Paroxismus\"). Although quite tame in explicitness, especially compared to the vast load of European Sleaze films from the early 70s, \"Femina Ridens\" is delightfully perverted and deranged, and a visually overwhelming piece of psychedelic atmosphere. The wonderful Dagmar Lassander plays Maria, a beautiful journalist with feminist views. One day, she gets kidnapped by the demented Dr. Sayer (Philippe Leroy), a rich and powerful man, who has a sort of paranoid misogyny which leads him to believe that the female species wants to exterminate the male, and who therefore delights in the degradation and fear of women. Sayer holds Maria hostage in his personal castle of demented tortures and humiliations, where he intends to make her his slave; while submitting her to all sorts of degradations, he also shows her pictures of women who had shared her fate, and whom he says he murdered during intercourse, at the point of orgasm. I spite of his cruelty and sadism, Maria grows a strange, Stockholm-Synrome-like fascination for her kidnapper... or does she? The film is highly surreal, sometimes like a fever-dream. Sayer's mansion alone holds a vast variety of bizarre items, and the entire film oozes a surreal atmosphere. Even though feminism may not be a usual trait of European cult-cinema, it was pretty obvious to me that Maria was going to turn the tables towards the end. The style is very peculiar, but supremely elegant, with a great cinematography, fantastic set-pieces and a wonderful musical score by Stelvio Cipriani that sometimes mixes the art-house atmosphere with archaic, Spaghetti-Western-like tunes. Dagmar Lassander is beautiful and fantastic as always, and Philippe Leroy seems to be predestined for the role of the narcissistic, misogynistic and perverted psychopath. Overall, \"Femina Ridens\" is definitely an unusual and innovative experience that is highly recommendable to fans of European cult-cinema. Definitely not for everyone, but not to be missed by fans of Italian Cult. My rating: 7.5/10"
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Cemo Film"],
      "summaries": ["A rich and sadistic man, who enjoys degrading women as part of elaborate S&M games, abducts a female journalist. She is subjected to his unpleasant games but soon begins subverting him."],
      "budget": 0
   },
   "movielensId": 107673,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1969-08-24",
      "dvdReleaseDate": null,
      "directors": ["Piero Schivazappa"],
      "runtime": 86,
      "movieId": 107673,
      "title": "The Laughing Woman",
      "mpaa": "",
      "actors": [
         "Dagmar Lassander",
         "Philippe Leroy",
         "Varo Soleri",
         "Maria Cumani Quasimodo",
         "Mirella Pamphili",
         "Lorenza Guerrieri"
      ],
      "imdbMovieId": "0124621",
      "originalTitle": "Femina Ridens",
      "genres": [
         "Romance",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["cIIHV3f0B2M"],
      "plotSummary": "Beautiful PR woman Maria finds herself trapped in the home of the sinister and troubled Dr Sayer, where she is subjected to a series of increasingly bizarre, terrifying and degradating sex games. Sayer admits that he has murdered several women after the same ordeal, always killing them at the point of orgasm. But all is not what it seems, and this is revealed to be the fantasy of a troubled man. Sayer finds salvation in Maria and falls for her, only for her to turn the tables on him and ultimately reveal that she too is not what she seems.",
      "tmdbMovieId": 100812,
      "avgRating": 3.11111,
      "releaseYear": "1969",
      "numRatings": 9,
      "posterPath": "/8Bv3Z5mOTrrmvh9onLv78aSa7wb.jpg"
   }
}