{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0097260",
      "video": false,
      "title": "Easy Wheels",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Bruce",
               "gender": 2,
               "credit_id": "52fe45e3c3a36847f80e02cf",
               "name": "Paul Le Mat",
               "profile_path": "/zdXz9llyKWBRojikxjvtCs3Jt3W.jpg",
               "id": 12406,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "She Wolf",
               "gender": 1,
               "credit_id": "52fe45e3c3a36847f80e02d3",
               "name": "Eileen Davidson",
               "profile_path": "/mHD6AtcW9kWrMIMg5g5qOE5IKv4.jpg",
               "id": 182038,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Wendy",
               "gender": 0,
               "credit_id": "52fe45e3c3a36847f80e02d7",
               "name": "Marjorie Bransfield",
               "profile_path": null,
               "id": 119119,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ace",
               "gender": 1,
               "credit_id": "52fe45e3c3a36847f80e02db",
               "name": "Theresa Randle",
               "profile_path": "/cbngAGNDoWK9vGoaENUhZQgd4J9.jpg",
               "id": 4604,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Reporter",
               "gender": 2,
               "credit_id": "52fe45e3c3a36847f80e02df",
               "name": "Barry Livingston",
               "profile_path": "/4a7hU3cJZb9ZXUuHQ3W2kejHbAN.jpg",
               "id": 75344,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Animal",
               "gender": 2,
               "credit_id": "52fe45e3c3a36847f80e02e3",
               "name": "Mark Holton",
               "profile_path": "/vQJ3iEDVhVOJX7biIbIG5R6QByq.jpg",
               "id": 44818,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Professor",
               "gender": 0,
               "credit_id": "58b90250c3a368664d005cdf",
               "name": "Jon Menick",
               "profile_path": null,
               "id": 1429569,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Candy",
               "gender": 1,
               "credit_id": "58b90261925141606f005cb3",
               "name": "Karen Russell",
               "profile_path": null,
               "id": 98563,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Tondaleo",
               "gender": 1,
               "credit_id": "58b9026d9251416077005d53",
               "name": "Roberta Vasquez",
               "profile_path": "/4CGhSrp7lZPH8XqzIaHrABrg3GH.jpg",
               "id": 104929,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Nick",
               "gender": 2,
               "credit_id": "58b90279925141609b005932",
               "name": "Robert Miano",
               "profile_path": "/sszrBivDN2Ry0I3vWY5k8CjxYdB.jpg",
               "id": 62715,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "58b90283c3a368668f004fa0",
               "name": "Ted Raimi",
               "profile_path": "/qwul2LI7FzzfypJvo7zth2vvwuR.jpg",
               "id": 11769,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Joe",
               "gender": 0,
               "credit_id": "58b9028e9251416077005dd6",
               "name": "Dan Hicks",
               "profile_path": "/p6UEdkL9oJGLRVkMgQtrKvJ3cCl.jpg",
               "id": 11750,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Tony Wolf",
               "gender": 2,
               "credit_id": "58b9029ac3a368666b00545e",
               "name": "Kevin Brophy",
               "profile_path": null,
               "id": 100618,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Preacher",
               "gender": 2,
               "credit_id": "58b902a5925141606b006018",
               "name": "Ben Stein",
               "profile_path": "/w0sjKYVV7BCK6SBpJy3KmogxLld.jpg",
               "id": 131667,
               "order": 13
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45e3c3a36847f80e02cb",
            "name": "David O'Malley",
            "profile_path": null,
            "id": 151096,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.462742,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41932,
      "vote_count": 4,
      "budget": 0,
      "overview": "A group of leather-clad bikers are on the trail of the female bikers who are stealing babies all over the state and selling them on the black market.",
      "similar": [],
      "original_title": "Easy Wheels",
      "runtime": 94,
      "poster_path": "/tuXpoVlTOSs2W3OuXEyKCMqoxon.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1989-01-01",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David O'Malley"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Ivan Raimi",
         "Sam Raimi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097260/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzOTQ4ODA1M15BMl5BanBnXkFtZTgwODE2ODk1MDE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Le Mat, Eileen Davidson, Marjorie Bransfield | See full cast and crew »"],
      "reviews": [
         "The reviews decrying this film seem to have genuinely missed the fact that it's a comedy. Sure, all of it is deadpan but really, a biker gang who do a great doo-wop Rock Of Ages? A guy whose mudwrestler girlfriend gets into laundromat machines after work? It's a comedy, folks. The reviewers complaining of the lack of action scenes or soft porn might as well level the same criticisms at Airplane. Indeed, Airplane's a good point of reference with the straight-faced humour, visual gags and touches of surrealism. It plays on many 'good guys seeking out the evil-doers' clichés, and simultaneously on fated-lovers clichés too. The funniest stuff is in the way it plays with gender role and 'wrong side of the tracks' stereotypes. The great and eminently quotable cheesy dialogue and the constant overloud leather-creak whenever anyone moves keep it relentlessly funny from start to finish. If you like the comic edge of Sam Raimi and Bruce Campbell's work in The Evil Dead you'll love this film. If, however, you thought Evil Dead was a straight zombie flick then you'll probably miss the point with this too.",
         "Easy Wheels is one of those great independent low-budget films. The movie is nararated from the point of view of a reporter who is rescued by the bikers from a car accident. The leader of the Bourne Losers Bruce (Paul Le Mat) and his buddies are looking for another group of bikers known as the The Woman of the Wolves who are being suspected of stealing babies and selling them on the black market. This movie I laughed throughout. Some younger viewers may not get all the jokes, but I think most adults will get the jokes. I recommend this movie to people who drive and/or like biker movies. I also recommend this film to people who like to laugh a lot. 10/10",
         "Is it a biker flick? Is it about boys and girls gone bad and the consequences? Nope...it is a deadpan, play it for straight comedy that will have you rolling with the dialog is not the basic premise. SPOILER: The whole concept of the biker girls stealing babies to have the females raised by wolves while the boys (useless) are sold on the black market and the male bikers quest for a truly good light beer should tip one off that they have entered a surreal world the Raimi brothers alone could create. The jail scene with the male bikers would be worth the price of admission alone to hear them try to pass themselves off as a traveling gospel group and then breaking out in a dynamite version of Rock of Ages! The girls are hot, the story a hoot. This is a classic for this type of film. What makes it even funnier is that all the performers go at it as if doing Shakespeare....dead serious! If you watched My Three Sons as a kid you might recognize Barry Livingston (Ernie the adopted son of the later years) as an reporter traveling with the male bikers. Pop the corn and settle back for a fun ride.",
         "Between Evil Dead 2 and Darkman, the Raimi brothers wrote this film. It is supposed to be a parody of those biker films playing at the drive-ins in the 60s - the Airplane! of biker flicks. The leader of the Bourne Losers Bruce (Paul Le Mat) and his buddies are looking for another group of bikers known as the The Woman of the Wolves, led by She Wolf (Eileen Davidson), who are being suspected of stealing babies and selling them on the black market. It's a comedy for fans of the Raimi's. The doo wop version of Rock of Ages made it all worthwhile. How do you know it's a parody? Easy, all the biker chicks look like they stepped out of Vogue.",
         "This is not your typical biker film. It is not your typical film period. The closest parallel would be the makers of Airplane or Police Squad do a biker film. The leader of the Bourne Losers biker gang, Bruce (Paul Le Mat) is often so eloquent that his buddies don't understand what he his saying. They are trying to stop the The Woman of the Wolves female biker gang whose leader, She Wolf, was raised by wolfs after her parents abandoned her is in the woods while being chased by the police. The Woman of the Wolves are stealing babies and selling them to the black market. Needless to say much trouble ensues and it is a field day for one liners, zingers and stuff you would not normally see bikers doing. Like a female biker beating a male biker after he took the baby she stole and she delivers the line \"Never take a baby from Candy\" while she also delivers a beating. Not a bad film for 1989 and it will make you laugh. Check it out if there is nothing else to rent at blockbuster, you need to fill out your Netflix queue or it is on cable.",
         "The baby stealing plot is really just a ruse for a movie about an all female motorcycle gang. The black leather clad ladies are all thin, attractive, and of average height. Certainly, capable of beating up an equal number of bigger, heavier men, including a bike joust. The ladies do have an edge, an endless supply of can bombs, with pull strings. So far, so good. I actually seek out this type of stuff. However, the movie is rather boring through out. The low budget compromised the highly edited (fake) action scenes. It should be noted, and not as a negative, that the movie is very tame as the women remain fully clothed, the violence is of a cartoon nature and the language is acceptable. I am suspicious of the honesty of the number of high votes for this film. Maybe they are just desperate for a biker chick movie and will like anything. I can accept that, but please watch the not boring Chopper Chicks in Zombietown instead.",
         "Not even Hell's Angels' wild women in hot leather could save this from burning rubber on the road! EASY WHEELS stands out okay as a satire of biker / exploitation movies, and not as stupid or sleazy as you'd expect from the late 60s. Still, I'm not gonna get all hyped up about smutty women who prove their sense of superiority over the male crowd, nor the tough men wanting sexual desires over the women. The movie seems told on two different points of view here, making this very incoherent. Are the producers really too afraid to make a true feminist biker flick? It worked well for SHE-DEVILS ON WHEELS, only on a sleaze state of mind. Biker movies, on the other hand, have seen their day, and although this appeared to have revived the genre a while back, it stales on anything new and original. Not bad, but this wasn't my can of beer. Look for Ben Stein as a church minister."
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": ["New Star Entertainment"],
      "summaries": ["A group of leather-clad bikers are on the trail of the female bikers who are stealing babies all over the state and selling them on the black market."],
      "budget": 0
   },
   "movielensId": 107860,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-01-01",
      "dvdReleaseDate": null,
      "directors": ["David O'Malley"],
      "runtime": 94,
      "movieId": 107860,
      "title": "Easy Wheels",
      "mpaa": "",
      "actors": [
         "Paul Le Mat",
         "Eileen Davidson",
         "Marjorie Bransfield",
         "Theresa Randle",
         "Barry Livingston",
         "Mark Holton",
         "Jon Menick",
         "Karen Russell",
         "Roberta Vasquez",
         "Robert Miano",
         "Ted Raimi",
         "Dan Hicks",
         "Kevin Brophy",
         "Ben Stein"
      ],
      "imdbMovieId": "0097260",
      "originalTitle": "Easy Wheels",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of leather-clad bikers are on the trail of the female bikers who are stealing babies all over the state and selling them on the black market.",
      "tmdbMovieId": 41932,
      "avgRating": 1.5,
      "releaseYear": "1989",
      "numRatings": 1,
      "posterPath": "/tuXpoVlTOSs2W3OuXEyKCMqoxon.jpg"
   }
}