{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "release from prison",
            "id": 3398
         },
         {
            "name": "iranian",
            "id": 178656
         },
         {
            "name": "kurdish",
            "id": 190066
         },
         {
            "name": "estranged",
            "id": 190069
         },
         {
            "name": "reconnect",
            "id": 190070
         }
      ],
      "imdb_id": "tt1850419",
      "video": false,
      "title": "Rhino Season",
      "recommendations": [
         76975,
         69510,
         95853
      ],
      "backdrop_path": "/bDQh7oSpHoOeNbnPPvH2aXBBoF8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sahel",
               "gender": 0,
               "credit_id": "52fe4ad4c3a36847f81e3e9f",
               "name": "Behrouz Vossoughi",
               "profile_path": "/85FDxjdPDZ3srtD2HHkDacDsA2K.jpg",
               "id": 169874,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mina",
               "gender": 1,
               "credit_id": "52fe4ad4c3a36847f81e3ea3",
               "name": "Monica Bellucci",
               "profile_path": "/nkrIGojQy6FNn9s5cfpiUAmLeNz.jpg",
               "id": 28782,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Akbar Rezai",
               "gender": 2,
               "credit_id": "52fe4ad4c3a36847f81e3ea7",
               "name": "Yılmaz Erdoğan",
               "profile_path": "/e16Q5H7nRGzLCUk8JQSpp5166ko.jpg",
               "id": 99314,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4ad4c3a36847f81e3eab",
               "name": "Caner Cindoruk",
               "profile_path": null,
               "id": 147628,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4ad4c3a36847f81e3eaf",
               "name": "Belcim Bilgin Erdogan",
               "profile_path": "/q8aUysv13XPnt8SBXR1JoKzrQkZ.jpg",
               "id": 225186,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Son",
               "gender": 2,
               "credit_id": "52fe4ad4c3a36847f81e3eb3",
               "name": "Arash Labaf",
               "profile_path": "/ureII0gCDLCR80vwAAWqJcMeawr.jpg",
               "id": 1091597,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4ad4c3a36847f81e3eb7",
               "name": "Ali Pourtash",
               "profile_path": null,
               "id": 110609,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Daughter",
               "gender": 1,
               "credit_id": "52fe4ad4c3a36847f81e3ebb",
               "name": "Beren Saat",
               "profile_path": "/gNVTEVoCjYqhdkKOId3umRmQ8SA.jpg",
               "id": 145499,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ad4c3a36847f81e3e9b",
               "name": "Bahman Ghobadi",
               "profile_path": "/s5RcPFMBPJXNGtMO6zMSFvWOHDL.jpg",
               "id": 54607,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "530e6e1b92514114460026f7",
               "name": "Valérie Loiseleux",
               "profile_path": null,
               "id": 234483,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.652893,
      "production_countries": [
         {
            "iso_3166_1": "TR",
            "name": "Turkey"
         },
         {
            "iso_3166_1": "IQ",
            "name": "Iraq"
         }
      ],
      "id": 110391,
      "vote_count": 13,
      "budget": 0,
      "overview": "Kurdish-Iranian poet Sahel has just been released from a thirty-year prison sentence in Iran. Now the one thing keeping him going is the thought of finding his wife, who thinks he's been dead for over twenty years.",
      "similar": [
         369709,
         369651,
         369648,
         257678,
         369655,
         369550,
         369704,
         369597,
         369606,
         369602,
         6075,
         783,
         60243,
         76493,
         252171,
         275601,
         314634,
         121824,
         2014,
         9469
      ],
      "original_title": "وەرزی کەرگەدەن ،",
      "runtime": 104,
      "poster_path": "/uRpEHF7kTidCaiUUskLyWpFKDrf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "فارسی",
            "iso_639_1": "fa"
         },
         {
            "name": "Türkçe",
            "iso_639_1": "tr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mij Film Co.",
            "id": 2440,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "BKM Film",
            "id": 15268,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Elmalma Marka Iletisim",
            "id": 84863,
            "origin_country": ""
         }
      ],
      "release_date": "2012-09-11",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bahman Ghobadi"],
      "runtime": 88,
      "synopsis": "After spending 30 years in an Iranian prison, a poet searches for his wife...",
      "writers": [],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt1850419/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwOTg4MzU3Nl5BMl5BanBnXkFtZTcwMzkzNzg1OA@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Behrouz Vossoughi, Monica Bellucci, Yilmaz Erdogan | See full cast and crew »"],
      "reviews": [
         "Presented by Martin Scorsese, 'Rhino Season' is the 6th full-length film by Bahman Ghobadi. Following his success with 'No One Knows About the Persian Cats' which earned him international recognition, Ghobadi's first non-Iranian production features an international cast. Old-timer Iranian Superstar, Behrouz Vosoughi returns to the screen after more than 20 years off the grid. He is joined by Italian Femme Fetale Monica Belucci, and a number of Prominent Turkish Actors and Actresses, namely Yilmaz Erdogan. Shot entirely in Turkey, the movie follows the ordeals of Sahel, a Kurdish-Iranian Poet, whose poems were misconstrued by the post-revolution regime of Iran as political, and landed him in Jail for 30 Years. After he is released from Jail, he travels to Turkey in search of his wife (played by Monicca Belucci) who is now remarried. It's loosely based on a true story, and the movie paints a realistic picture of a post-revolution Iran, in the hands of the vengeful servants of the Shah regime. Even Sahel's jail sentence is revealed to have had little to do with his poetry. The movie's primary language is Farsi, but there is little dialog going on altogether. Monica Belucci speaks a few lines of Farsi quite decently, but Yilmaz Erdogan doesn't do a great job. Obviously the reason behind his wasn't his Farsi-Speaking skills, but the fact that no Iranian actor hoping to keep his permission to act inside Iran, would ever consider doing a movie that depicts a half-naked Belucci. Behrouz Vosoughi's role has even less dialog, and mostly consists of smoking a cigarette in various gorgeous scenery. The locations were chosen brilliantly, and the camera work is exceptional. Several scenes in the movie are shot solely for the purpose of accompanying an off-camera poetry recital, and are perhaps of great appeal to poetry lovers. Other than that, the story unravels with a slow pace, and leaves the ending entirely up to the viewer. The acting is decent minus the Farsi accents, and the Soundtrack, while minimal, creates an appropriate atmosphere. If you enjoyed most of Ghobadi's work, you will enjoy this one too, but most people can agree that it's not his best. Nothing is particularly wrong with this movie, but nothing is particularly right either.",
         "There are so many fascinating and compelling aspects to this movie which I have now watched twice. First of all, it has nothing to do with Rhinos or indeed with Martin Scorcese. It says he presents the movie, whatever that means. He is no way involved with the directing of this movie which is directed by a man named Bahman Ghobadi who left his native Iran in 2010 and has never returned. This is a love-triangle, a husband and wife and a third party (the driver)centred not so much around the poetry of the husband but around the fixations of love of the driver for the wife and its consequences over a 30 year period. Ghobadi has publicly stated that if he were in the shoes of Sahel, he could not tell his wife he was still alive after 30 years if she believed him to be dead. This is a far more meaningful film than 'Argo' in reference to the 1979 Iranian Revolution and its aftermath but I do not think the film is really about that, it is not a political movie in any way though politics played its part in the storyline. You will want to watch the film more than once for sure - to ponder who is/was the father of the two young girls, did Sahel really sleep with one of them, how come Sahel could not recognize the man who was Mina's driver, the marvellous short scene when leeches were used to suck blood from Sahel and his associates, the prison sex scenes, the turtles scene, and what pact, if any, was horrifyingly agreed between Sahel and the driver towards the end. Bear in mind this that whereas 'Argo' was a Hollywood blockbuster produced with a huge budget,'Rhino Season' was not, an independent production on low budget and to such degree that none of the actors involved, including Monica Bellucci, were paid for their work. The participation in the film of Monica Bellucci and of the man who played Sahel is remarkable in itself. Sahel's Actor, Behrouz Vossoughi, is himself a man in exile for more than 30 years. He barely if ever speaks in this movie but his acting is evocative enough. I still wonder who Mina was meeting and the boy who rode the motor cycle, the same boy Sahel played a game with in the Cafe. It is not clear why the film is called 'Rhino Season' but there are clues throughout for the viewer to make up their own mind. Alas, Persian Cats and Turtles in two previous films is indicative of the mindset of a Director who loves animals more than people (so he apparently said anyway. 'Not without my Daughter' was a while back and 'A Separation' was another Iranian movie worthy of praise. This movie is something else. It is no blockbuster but it is beautifully filmed and directed, well acted and produced and in my opinion it is a mastercraft of a movie. It is such a pity that the movie has not been exposed to a wider audience. I do wonder who the movie is aimed at. Most people outside of Iran have perhaps never heard of the Iranian Poet Sahel Fauzan and know little if anything about the 1979 Iranian Revolution. Even if they have heard of him, they know nothing of his poetry and will not readily relate reference to the title 'Rhino Season'. People in Iran will not be able to watch it inside their own country. Perhaps only Muslims or anyone associated with Islamic culture will truly understand the ultimate message of the film. Yes, it is a slow, boring movie but that should not belie the fact that everything about this movie is of the highest standard and do not always judge a book by its cover.",
         "This is easily Ghobadi's best film--the metaphors and imagery pull together his other films into what is his masterwork. Very haunting, somewhat surreal-as the former prisoner tries to find his wife the events of his life are accompanied by metaphors from his poems brought to life. Bellucci is incredible. I never expected such a subdued and dignified performance from her. Perhaps one of the best scenes is when the young poet is tied up and tortured and a rain of turtles falls from the sky. Caner Cindoruk is also quite good as the young poet--and his rival and tormentor Yilmaz Erdogan is convincing as the man obsessed with his wife--despite his evil (he is the source for the poet's family's suffering), he manages to be both loathsome and sympathetic at the same time.",
         "When I first saw the trailer ,I thought it would be a great movie because the trailer was good and Martin Scorsese presents it and staring one of the hottest women in the world and also the Persian idol Behrouz Vosoughi gave me every reason to watch it ,Cinematography and set decoration was great ,it was technically good but the script was really weak ,Bahman Ghobadi proved that he is not a good screenwriter the movie was lack of pace ,he tried so much to make the movie look poetic which wasn't really good, the story was good but Ghobadi ruined the story by his primitive script and I don't really think the entire movie is based on a true story I believe Bahman Ghobadi must return to his previous method of filmmaking ,making semi-documentaries.he made great films like Turtles can fly and \"A time for drunken horse\" in that way SPOILER An Iranian-Kurdish poet is sentenced to 30 years in prison for writing poets against Islamic regime of Iran during 1979 revolution in Iran ,government tell his wife that he has been executed ,after 30 years He is realized and goes to find his wife",
         "IRANIAN CINEMA BRAIN DRAIN CONTINUES As the repressive political atmosphere in Iran gets worse and worse more and more top cinema talent is finding it impossible to work there and fleeing the Islamic Republic to seek sanctuary and freedom of expression in other countries. Kurdish Iranian director Bahman Ghobadi whose Kurdish language films won two top awards at San Sebastian in 2004 and 2006 (the latter banned in Iran) sealed his own fate with a film called \"Nobody Knows About Persian Cats\" which was shown at Cannes in 2009 and highly displeased the turbaned clerics back in Tehran. The topic was underground rock musicians in Iran trying to get passports to London so they could work freely. in exile Ghobsdi finally settled in Turkey where greatly depressed he started shopping around for a new film topic. The film he has finally finished with considerable Turkish assistance is another Kurdish theme and has the poetic title of \"Season of the Rhinoceros\" (Fasle Kargaran) officially now, \"Rhino Season\". The world premiere was held at the Toronto film festival in September. His new film didn't take any prizes at Toronto but generated intense press coverage marking one more notch on the Iranian filmmaker Brain Drain trail. \"Rhino Season\" was shot mostly in Turkey, where Bohman has set up shop, and surprisingly stars the outstanding Italian actress Monica Bellucci (47) partnering exiled Persian film legend of yesteryear, Behruz Voshoughi, 74, in the leading roles. Bellucci, Italy's biggest female star and glamorous sex symbol, had to learn Persian (Farsi) for the role but is an accomplished multiligual and says that was no problem. The main thing for her was the opportunity to work with a fantastic director like Ghobadi -- in a highly deglamourized role with the emphasis on acting! Unlike long established Iranian filmmakers Kiarostami (72) and Makhmalbaf (55) Ghobadi at 43 is barely known outside of Iran but two of his films, \"Turtles Can Fly\" (2004) and \"Half Moon\" (2006) won the top prize at the prestigious San Sebastian film festival in Spain. Ghobadi is an ethnic Kurd and both of these films were in his original Kurdish language --- already a problem as there is a militant Kurdish separatist movement in Iran. His followup to that was the hastily made underground study of Iranian underground musicians \"Nobody Knows About Persian Cats\" (Kasi az Gorbehaye Irani Khabar Nadareh) which was awarded a special jury prize at Cannes but was considered seditious by the Religious Police that run Iran, resulting in Ghobadi's defection and self imposed exile. Highly depressed because he could not go home and bouncing around Europe in Persian exile circles, he finally realized that he simply had to make another film \"to stay alive\". The result is another Kurdish topic involving the unjust 30 year incarceration of a Kurdish poet and the ten year imprisonment of his wife (Bellucci) in Tehran in the wake of the Islamic takeover. Believing her husband to be dead she has moved to Turkey with the very man who instigated their imprisonment. He was once her driver and long in love with her as well. When the Poet finally gets out twenty years later he goes to Istanbul to track her down ... with mixed results and tragic flashbacks. The poet is played by Behruz Vosoughi who was the most popular actor in Iran before the Revolution and has himself been absent from the screen for thirty years --an ironic parallel -- because he left Iran just before the Islamic takeover and took up residence in the US, hoping eventually to get into American films, but was only offered terrorist roles which he refused to accept. \"This is the role I have been waiting for all these years\", said Vosoughi. \"Rhino Season\" was produced by well known Turkish actor Yildiz Erdoğan and his alluring actress wife Belçim Bilgin Erdoğan. Yildiz has the third major role as the insidious driver/lover who engineered their imprisonment at the time of the Islamic revolution and Bilgin has an important supporting role. Bellucci's son in the film is played by pop singing international superstar Arash Labaf, who lives in Sweden but sings in Persian. Labaf who has a gigantic following in Eastern Europe and the Middle East had never been in a film before but is an old friend of director Ghobadi's. When Ghobadi offered him the part he said he couldn't turn down a chance to have such a beautiful \"mom\" as Monica Bellucci! All cast principles except Yildiz appeared in Toronto for the World Premier and again a week later when Rhino was screened at San Sebastian, the one place in Europe where Ghobadi is no stranger. \"Rhino Season\" was awarded a best cinematography prize in San Sebastian and then moved on to the BUSAN Film Festival in South Korea on October 6. There Ghobadi met with American director Martin Scorcese who announced plans to collaborate with the exiled Kurdish director on his next project, a film about Kurdish Iranian relations. In his Toronto press conference Ghobadi stated that he is not a political filmmaker and does not really have any interest in politics per-se but, when you make any film about Iranian society these days it inevitably takes on a political character. \"Rhino Season\" is in fact a film as poetic as it is political -- full of symbolic visuals relating to the poetry of the central protagonist which is a leit motif throughout. The title itself comes from one of the poems of the imprisoned poet, recited during the film by Bellucci in Farsi. Reflecting the mood of the film a dead Rhinoceros on a dreamlike desert plain dominates the official film poster. Ghorbadi also said that he hopes his work outside of Iran will inspire young people in Iran to demand more freedom. He is convinced that when the youth takes over there will be big changes.",
         "Made me join IMDb just to say if you have 97 minutes to stick with a slow burner that doesn't drag on and is perfectly balanced in all the characters , sit down to this. The scenes of hallucinatory/dreamy metaphors fit perfectly with the poetry (which I am looking for online) and the performances which relate reality to chaos perfectly. The story needs concentration though is worth effort and gives a raw and real yet still fantastical aspect to the rest of the film and the acting which is by itself very well filmed. It creates a subtle atmosphere of meditation, depression and insanity without overdoing any. A mix which binds humanity, irrelevant of politics. \"Only one living on the border will create a land\"",
         "While no one doubts the magnificent cinematography, there is much more about this brilliant masterpiece comparable to the works of great masters such as Angelopoulos. Although the movie events happen in Iran, they are all about universal themes such as love, jealousy, destruction and the desperate search to discover the meaning of the Being. The Iranian revolution and its destructive impact upon the society, the pandemic injustice that the revolution promised to end but did not and yet exacerbated, the hostile environment and its impact upon the afflicted families, are all depicted with rigor and with poetic images, rather than with cliché dialog and rhetoric. The movie manages to keep an appropriate pace letting the scenes find their desired depth and yet avoiding boredom, and the performances are brilliant. What more would you expect from a movie anyway than to show you innovative images and to share a new kind of experience with you, which you would have had to pay a great price to experience it first hand? A master piece 10/10.",
         "The movie is about a poet who was imprisoned for political reasons and when he was released, he tries to find his wife, Mina, in Instabul. The story itself is a very powerful story and the few lines that are used are supporting that atmosphere beautifully. Maybe it's because there are not much to say about it those things, and the persons keep their silence as a way to protect themselves from what had happened to them. The scenes and the shots are very realistic, and with the reading of the poem added over them, it gives a more poetic view on the cruel reality of the heroes. The unrealistic scenes, like the ones with the rhino, are nice, but some of them I couldn't see the meaning behind them. And there is a lot of symbolism in the film, so you have to keep watching and don't miss anything. To be honest, I didn't get the ending and some of the scenes, as they were back and forth and the ones at the ending too quick, like they were rushing the story to end. So 6 out of 10.",
         "It is obvious why Monica Bellucci was hired to play a prominent role in Bahman Ghobadi's latest flick. Local (middle-east) stars won't dare to show their skin in front of the camera, it may end in controversy like Lebanese skier caused controversy over topless photo during the Sochi winter Olympics. Though adding the major Italian star who is known very well to the world made the movie to strike stronger. I don't know I felt I knew this story well from somewhere. At least it looked very similar to other movies I had seen beside divergent characters. Like the movie 'Oldboy' this movie depicts an old man who was away for a long time who enters the familiar but changed society in search of his lost family. They say it was loosely based on the story of a real person, but I feel it is fiction because real people won't behave like the character from this movie. Anything might be possible, but this movie was lacking in either character or story development. The cinematography was awesome, it had a pleasant frame tone with greenish-gray. The director thought to bring more artistic effect by adding inappropriate scenes to the story. There are many scenes where viewers may respond in questions to those parts. In one of the scenes turtle rains and in another a wild rhino hit by a car. It goes on like that, like illusions during illustrate a person. It tells the story of a man who is affected by the 1979 Iranian revolution. Yeah, the same revolution that showed the movie 'Argo' but in a different perspective and character. Overall, it was not a movie that I was expecting from Bahman Ghobadi, but still it can be enjoyed by his fans.",
         "Considering the movie's cliché subject & slow pace of unfolding the story you can't expect it to be of such interest for a medium-class audience, This film can be favored more by critics or serious artistic intellectuals & as such is a visual poem. It contains lots of beautifully shot landscapes & indoor locations as well as pictorial metaphors that suitably accompanies the poetical nature of it, A good recommendation for audiences outside Iran as it seems to be made for this purpose. My Favorite Aspects (Contains Spoilers!) *You only realize the woman's real job at the final minutes of film! *Great artistic alteration of pictures by illuminated rain drops & high Contrast in lighting. *Intense & sometimes nervous sequences underwater although the slow pace does not allow you to fulfill these feelings!"
      ],
      "genres": [
         "Drama",
         "History",
         "Thriller"
      ],
      "productionCompanies": [
         "BKM Film",
         "Mij Film Co."
      ],
      "summaries": [
         "Sahel, a poet from the shah era, and Mina, daughter of a wealthy family, are in love. Also Mina's driver is in love with her, as the revolution approaches. The driver becomes a high rank revolutionary and with this power incarcerates the couple. Sahel for 30 years and Mina for 10 years. After 10 years Mina is released and asks for the whereabouts of Sahel. She is told that Sahel has died. Meanwhile, the driver proposes her to stay with him. They travel together to Istanbul. After a further 20 years passes, Sahel is released. Then, he begins the search for his old lover.",
         "Kurdish-Iranian poet Sahel has just been released from a thirty-year prison sentence in Iran. Now the one thing keeping him going is the thought of finding his wife, who thinks him dead for over twenty years."
      ],
      "budget": 0
   },
   "movielensId": 108132,
   "movielens": {
      "languages": [
         "English",
         "فارسی",
         "Türkçe"
      ],
      "releaseDate": "2012-09-11",
      "dvdReleaseDate": null,
      "directors": ["Bahman Ghobadi"],
      "runtime": 104,
      "movieId": 108132,
      "title": "Rhino Season",
      "mpaa": "",
      "actors": [
         "Behrouz Vossoughi",
         "Monica Bellucci",
         "Yılmaz Erdoğan",
         "Caner Cindoruk",
         "Belcim Bilgin Erdogan",
         "Arash Labaf",
         "Ali Pourtash",
         "Beren Saat"
      ],
      "imdbMovieId": "1850419",
      "originalTitle": "وەرزی کەرگەدەن ،",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["f03FuymXWBs"],
      "plotSummary": "Kurdish-Iranian poet Sahel has just been released from a thirty-year prison sentence in Iran. Now the one thing keeping him going is the thought of finding his wife, who thinks he's been dead for over twenty years.",
      "tmdbMovieId": 110391,
      "avgRating": 3.5625,
      "releaseYear": "2012",
      "numRatings": 8,
      "posterPath": "/uRpEHF7kTidCaiUUskLyWpFKDrf.jpg"
   }
}