{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "satan",
            "id": 10138
         }
      ],
      "imdb_id": "tt0082367",
      "video": false,
      "title": "Fear No Evil",
      "recommendations": [
         90888,
         92779,
         126793,
         89319
      ],
      "backdrop_path": "/dyRH0I0Ta4l9M11mbfb2rPbp8zz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Andrew Williams",
               "gender": 2,
               "credit_id": "52fe48e69251416c750b6edd",
               "name": "Stefan Arngrim",
               "profile_path": "/8KlWanFhowPl5quS4WlwChM0MjL.jpg",
               "id": 158489,
               "order": 0
            },
            {
               "cast_id": 25,
               "character": "Mikhail / Margaret Buchanan",
               "gender": 1,
               "credit_id": "576c1cc0c3a3683e47000ec1",
               "name": "Elizabeth Hoffman",
               "profile_path": "/2yXleo86syxrvvzsslYir6vYRCz.jpg",
               "id": 1219410,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gabrielle / Hulie",
               "gender": 0,
               "credit_id": "52fe48e69251416c750b6ee5",
               "name": "Kathleen Rowe McAllen",
               "profile_path": null,
               "id": 995591,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Father Daly",
               "gender": 2,
               "credit_id": "5762385f925141659500118f",
               "name": "Frank Birney",
               "profile_path": "/uRCpShq4P7isk7NNKVjigVuw4jZ.jpg",
               "id": 104060,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Tony",
               "gender": 0,
               "credit_id": "5762386bc3a36864af0012eb",
               "name": "Daniel Eden",
               "profile_path": null,
               "id": 1577541,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Rafael / Father Damon",
               "gender": 0,
               "credit_id": "5762387d92514165870010d4",
               "name": "John Holland",
               "profile_path": "/1ctCrOanIch8iCkoVu6jxOw08dh.jpg",
               "id": 126656,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Mr. Williams",
               "gender": 2,
               "credit_id": "5762388dc3a36864b7001160",
               "name": "Barry Cooper",
               "profile_path": null,
               "id": 1020420,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Mrs. Williams",
               "gender": 0,
               "credit_id": "57623896925141658e001081",
               "name": "Alice Sachs",
               "profile_path": null,
               "id": 1636605,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Mark",
               "gender": 0,
               "credit_id": "5762389f9251413d7400038a",
               "name": "Paul Haber",
               "profile_path": null,
               "id": 1636606,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Marie",
               "gender": 0,
               "credit_id": "576238a9c3a368581e00037a",
               "name": "Roslyn Gugino",
               "profile_path": null,
               "id": 1636607,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Lucifer",
               "gender": 0,
               "credit_id": "576238b2925141659500119e",
               "name": "Richard Jay Silverthorn",
               "profile_path": null,
               "id": 1636608,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "576237d9c3a36864b1001205",
               "name": "Frank LaLoggia",
               "profile_path": null,
               "id": 583023,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "576237f79251413d74000367",
               "name": "Frank LaLoggia",
               "profile_path": null,
               "id": 583023,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48e69251416c750b6ed9",
               "name": "Frank LaLoggia",
               "profile_path": null,
               "id": 583023,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "576237e39251416595001174",
               "name": "Donald P. Borchers",
               "profile_path": null,
               "id": 19172,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "576237ef9251413dd70003c6",
               "name": "Charles M. LaLoggia",
               "profile_path": null,
               "id": 1636601,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "576237fec3a36864af0012d8",
               "name": "Becky Morrison",
               "profile_path": null,
               "id": 1636602,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5762380bc3a36864b100120c",
               "name": "Carla Reynolds",
               "profile_path": null,
               "id": 106667,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5762381cc3a368581e000364",
               "name": "Frank LaLoggia",
               "profile_path": null,
               "id": 583023,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "576238319251413dd70003e4",
               "name": "David Spear",
               "profile_path": null,
               "id": 1146826,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57623838c3a36864ba001269",
               "name": "Fred Goodich",
               "profile_path": null,
               "id": 1636603,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5762383f92514165890010b7",
               "name": "Edna Ruth Paul",
               "profile_path": null,
               "id": 11470,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "576238469251413d74000378",
               "name": "Carl Zollo",
               "profile_path": null,
               "id": 1636604,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5762384d9251416595001188",
               "name": "Jacqueline Saint Anne",
               "profile_path": null,
               "id": 137193,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.452694,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 91817,
      "vote_count": 9,
      "budget": 840000,
      "overview": "High school student turns out to be personification of Lucifer. Two archangels in human form (as women) take him on.",
      "similar": [
         357096,
         74997,
         133805,
         238636,
         588,
         281957,
         6312,
         22033,
         3134,
         9373,
         979,
         8456,
         24,
         281,
         2652,
         55292,
         156022,
         395834,
         73861,
         10781
      ],
      "original_title": "Fear No Evil",
      "runtime": 99,
      "poster_path": "/t7MoviBlqlkAWjCWP375YGnqn9E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "LaLoggia Productions",
         "id": 43628,
         "origin_country": ""
      }],
      "release_date": "1981-01-19",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Alexandria High… class of '81 - All the students are going to hell, except Andrew… he sent them there!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Frank LaLoggia"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Frank LaLoggia"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082367/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NDQ5NDU5N15BMl5BanBnXkFtZTcwNDk0NzAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Stefan Arngrim, Elizabeth Hoffman, Kathleen Rowe McAllen | See full cast and crew »"],
      "reviews": [
         "Andrew is a brilliant teenage boy who does well in school but does not get along with his peers. His parents are frightened of him because he has exhibited disturbing behavior ever since he was born. When he starts having problems at school, people start dying. It turns out Andrew is Lucifer reincarnated and apparently doesn't know it. His old woman neighbor and his high school crush discover they are archangels on a mission to stop him. So this obviously has a silly and unoriginal plot. There are so many things wrong with this movie. The pacing and structure of the story is terrible. The acting is awful, especially by the 20-something actors playing the high school kids. And what annoying high school kids they are! There's a group of \"sassy\" girls called The Queen Bees (think The Pink Ladies) and an obnoxious perverted bully who smacks his girlfriend and mouths off to teachers. And then there's Andrew, who is quite an enigma. The movie may have benefited from being told through Andrew's perspective, because you never know what is going on with his character. One of the other bad things about this movie are the dated and cheesy animated \"laser beam\" effects that evoke laughter instead of horror. Also amusing is that the Apocalypse appears to only be happening on a very local level. But there are a few things about \"Fear No Evil\" that set it apart from the other \"satanic\" horror films of the late 70s/early 80s and make it worth checking-out. While some attempts at creating a creepy atmosphere fail, others are somewhat of a success. Especially of note is the opening sequence in a murky cavern with dangling animal bodies, a freaky possessed girl, and Lucifer himself. There's an unforgettable scene in the movie where the religious townspeople gather to watch an annual outdoor Passion play. The poor fellow playing Jesus literally gets crucified, and most of the people in the audience get attacked by a stigmata sign! Towards the end there are some zombies in the movie, beckoned by Andrew, and the make-up is great. There is also a scene where a gym teacher (who is apparently on speed) is encouraging aggressive dodgeball and, under the influence of Andrew's rage, accidentally kills one of his students by slamming a dodgeball into him! Another interesting feature of \"Fear no Evil\" is its treatment of gender and sexuality. The archangels are both played by women who claim to have been \"bonded\" together. Andrew is an effeminate boy and this does not go unnoticed by his jockier classmates. There is a shower sequence where Andrew gets sexually harassed by the school bully, who forces a kiss as a joke. Andrew turns the kiss into a violent makeout session! The two characters share a \"kiss\" again later in the movie in a more frightening/disturbing/hilarious scene. Also significant is the all-male nudity in the shower scene. While none of these men are particularly attractive, this sequence is rather cutting edge and controversial at a time when only female nudity was frequent in horror movies. Make no mistake, \"Fear No Evil\" is an average low-budget 80s horror movie. But it has tiny quirks and somewhat subversive sequences that, while somewhat random and out of place, successfully set it apart from other early 80s American horror movies. It also features a kickass late 70s/early 80s alt-rock soundtrack featuring Patti Smith, B-52s, Talking Heads, Sex Pistols, the Ramones, and a witty use of Boomtown Rats' \"I Don't Like Mondays.\" Recommended if you like movies about the devil, or if you are looking for an early 80s horror movie that was very different from its peers.",
         "FEAR NO EVIL was the first movie directed by Frank LaLoggia, who was in his early 20s when he made it. This alone should be reason enough to overlook the film's many faults, certainly when you consider that the story is ambitious, to say the least. And because of this, I actually give props to the film because it's not the all-out disaster everyone says it is. For a first film, it's at times surprisingly good. But the story and direction are, nonetheless, extremely murky. Some scenes are dreadful, like the shot of the front of the house which shows the passage of time and we see the house getting more dilapidated by the second. When the scene ends, the house looks like a tornado hit it but when we see inside the house, everything looks fine. Huh?!?! Moments like these, plus the unknown cast, who at times look like they're acting in a high school theater production, don't help much to create a solid, focused production. The ending was good but you saw it coming a mile away. I don't understand why this movie is so despised. It's probably due to the shower scene. Fan boys can't take moments like this, which are, oddly enough for a horror movie, too shocking for them. Oh the irony! In the end, FEAR NO EVIL is an adequate first movie made in the early 1980s. Like I already said above, it's not the worst horror movie ever made like so many have claimed it to be (see PLEDGE NIGHT!). But the director's ambitions exceeded his inexperience and the film's low budget.",
         "Since the gentleman who reviewed this film told most of the story (thankfully, so I wouldn't have to), I will just cut to the main points of my review and hopefully, this will help you. After reading many many reviews about this being a \"bad\" horror film, I went into this one with the idea that I was going to be expecting too much and be let down. But, to my own surprise, I was VERY satisfied with this film. The story of the battle between good and evil is told extremely well and I was very astonished about how glued I was to this story. But I did find a few things wrong/strange with this film: 1) Why didn't we get a story as to HOW Andrew became/is the Devil? In this movie he just IS... 2) Did his parents really know? Why wasn't more explained about his past? Like in the scene where he sacrifices his dog...why wasn't his motivation for that explained? 2) The homo-erotic subtext in this film was unexpected. The whole scene in the shower was not what I was expecting. And yes, many of these underground 80's films get away with the whole male frontal nudity! I've noticed that it other films like \"Basket Case\" and \"Pieces\" (And to contradict the reviewer above, some of those men were actually *very* attractive). I was very spooked by the whole scene on the beach during the play - that was done very well. But for me, the whole thing falls apart during the last 15 minutes of the film. And only because of how it was executed. They went too far on the cheesy f/x and though I understood the meaning behind it that no matter what happens good will always triumph over evil...but c'mon! When a great story is being told and then it switches to a zombie flick....? Sorry, but no. And the ending disappointed me, as well. I won't give it away, but when you think there's an explanation for the resolution, then you don't find one, it leaves a lot to be desired. Overall, this was great if you love religious thrillers like \"Stigmata\", but i wouldn't consider this a \"horror film\". I honestly give this 8 out of 10, so that should mean something. Check it out, you might like it.",
         "Teenager is the son of Satan and he's plotting a demonic uprising, while a teen girl and a local old woman are actually angels sent to stop him. Fear No Evil is an interesting oddity among the numerous teen horror flicks of the early 80's. For one, it's not a slasher movie. Fear No Evil is a low-budget, but well done throw back to the Gothic horror films of Hammer given a touch of the modern. The storyline is compelling, with some touches of nicely artistic direction from first time director Frank LaLoggia. Still, it's flawed by some awkward moments of silliness (death-by-dodge ball, shower make out) and some supporting performances that aren't as good as those of the leads. The best of the cast are Stefan Arngrim as our devilish villain and Elizabeth Hoffman as the elder angel desperate to stop him. Daniel Eden is also memorable as the school bully who gets a most crazy demise. Fear No Evil is a unique entry in the teen horror genre. Though it's not flawless, thanks to its low budget, it still has enough imagination to be a entertaining and memorable late night movie. ** 1/2 out of ****",
         "I am from Jefferson County, New York, where the film was shot. It was made at Boldt Castle in the St. Lawrence River, and nearby Alexandria Bay. The castle is ready-made for a horror film, which helps when the budget is as low as this. The film has some scary moments, however, and is fairly stylishly shot. The rock score will certainly date the movie, but, it is worth a watch.",
         "Angels Mikhail, Gabrielle and Rafael form a holy trinity living on Earth to defeat Satan, which they do as the film begins. Of course, he is born again in the 60s and, by the time 1981 rolls around, the Antichrist is a powerful handsome devil. Nah, just kidding. He is an Ian Curtis look-a-like high school geek named Andrew (Stefan Arngrim) who is looking to resurrect his army of the dead in order to rule the world or something. Of course, the reincarnated Angels are here to stop him with their glowing beams of light. I'm not really sure where I fall on FEAR NO EVIL. It is definitely ambitious for a low budget feature and falls into the M.S.U. (Makin' Stuff Up) genre perfectly. It is almost like director Frank LaLoggia had two half finished scripts and threw them together. I would recommend it just for the dodge-ball bit (watch the hyped up coach) and the bizarre scene at the end where the film's big bully gets his comeuppance by growing boobs. WTF??? The high school scenes are really funny, like LaLoggia had no sense at all how people behaved in school. One surprising thing is the soundtrack which features The Ramones, Sex Pistols, Patti Smith, Boomtown Rats and Talking Heads. I guess back then music rights weren't outrageous like they are today.",
         "Fear No Evil, the low budget debut from director Frank LaLoggia (Lady in White), is one strange little film: made during the golden age of the slasher but inspired by such films as The Omen, Carrie, and Night of the Living Dead, this offbeat oddity mixes rebellious teen shenanigans with biblical horror, throws in random homo-eroticism without a moment's notice (in the film's most memorable and unintentionally hilarious scene, a supposedly macho bully victimises Andrew in the boys shower by trying to engage him in a naked kiss, whilst cheered on by his enthusiastic pals�it makes A Nightmare on Elm Street 2's towel whipping seem perfectly reasonable), boasts a surprisingly good new wave/punk soundtrack (The Ramones, The Boomtown Rats, The Sex Pistols, Talking Heads), and culminates in a burst of dazzlingly crap visual effects that wouldn't have looked out of place at a Jean Michel Jarre concert. An undeniably ambitious project for a first-time director, the film features sincere performances, several well executed sequences (the rise of a horde of zombies is particularly effective), and one or two genuine 'WTF?' moments (a guy grows breasts for no discernible reason, and a church production of the Passion Play attracts massive crowds), but it simply doesn't work as a whole: the film changes tone a little too abruptly throughout; Stefan Arngrim is terrible as Andrew, Lucifer in human form, especially when he's hamming it up and howling like a banshee in his character's more demonic state; LaLoggia makes sure he gets his money's worth out of a smoke machine; and there are far too many boring scenes where very little of interest happens. 3.5 out of 10, generously rounded up for the decent tunes.",
         "Definitely weird but ultimately boring \"supernatural teen revenge\" flick gets its only thrills from the subversive sexuality running throughout the whole thing. The incarnation of Lucifer is an effeminate high schooler, his enemies are two male archangels reincarnated as pretty teenage girls, there are a few instances of male full frontal nudity and gay kissing, and one doomed bully grows supernatural breasts (after kissing the demonic boy). A creepy zombie attack livens things up a bit, but not much. The fact that this is a low budget flick is actually what made it more interesting to me, if the special effects had been phenomenal then it would have been even more boring. As it stands, it's just a slightly off-kilter retread through \"Carrie\"/\"Omen\" territory. Keep an eye out for the killer dodge ball!",
         "The high school scenes were filmed during the summer of 1980 at my old Junior High in Webster, NY. So naturally, we all went to the flick when it had a \"Special Preview\" in Webster in the spring of 1981. Yes, it was a mess. Yes, it is creepy in a few places, and VERY homo-erotic in others. As teenagers, we all left the theater scratching our heads. During the movie, however, we all had the chance to scream \"Hey, that's my old locker\" or \"So THAT is what the creepy boiler room looked like.\" The school itself was the stuff of nightmares: very old, dark, and forbidding when I was going there. Other than the old school showing up, this is a fairly muddled movie. LaLoggia came into his own seven years later with the Lady In White.",
         "\"Fear No Evil\" combines two of my favorite genres: Horror and Hannah-Barberra animation. I did not expect the film to turn into a cartoon in the last ten minutes, but apparently the producers couldn't get any real special effects wizzards for the final confrontation between Satan and God's angels, so they got the animators from \"The Wonder Twins.\" What starts as a bloody battle turns into mind-bogglingly bad laser beams that literally look like they were taken from a late 60's sci-fi film. The film then takes off into what one might call \"Xanadu\" territory,\" where the actors are no longer on film, and we see a series of lights flashing at the screen to crazy music. I guess the filmmakers were going for a \"2001\" type effect here, but what they got was a discount version of the old HBO animation they ran before movies in 1982. The film is a mixture of pretentious, poorly-acted, poorly-scripted, and shoddily directed discussions about heaven and hell, with some brilliant early 80's high school scenes, set to the music of the Sex Pistols, Talking Heads, and The Ramones. It makes you wonder how a director who is so completely out of touch with how to make an interesting horror film could assemble such a brilliant soundtrack. The high school scenes are worth the rental: all the guys look like they're 30, all the girls have giant afros and yellow satin jackets, and the teachers have tweed jackets. The one stoke of genius on director Frank LaLoggia's part is to have a number of scenes with \"general chatter,\" where people aren't really speaking any lines specific, but are just hubbub-ing very enthusiastically. The first time we see this LaLoggian touch is when baby Satan is born in 1963, and the proud father is handing out cigars to his buddy. They are babbling like a bunch of chimps, yet you cannot understand a word they're saying. It's amazing - you think they're speaking another language, it's just a lot of \"Heeeeey! Wheeeeaaaay! Yaaaahaaaa! Cigar, cigar, cigar, whoooooaaaa hoooooo!\" The next time is after a gym class, which apparently went so well that all the teens run into the locker room indecipherably yelling \"whoo-hoo, alllriiiiight, yeeeeeah, gimme that locker, whooooaaaa hoooooo!\" This unique touch of Frank LaLoggia, a trademark in all two of his films, truly gives weight to the credit \"A Frank LaLoggia Film\" that appears before the main title. It definitely is, Frank. It definitely is."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["LaLoggia Productions"],
      "summaries": ["High school student turns out to be personification of Lucifer. Two arch angels in human form (as women) take him on."],
      "budget": 840000
   },
   "movielensId": 108241,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-01-19",
      "dvdReleaseDate": null,
      "directors": ["Frank LaLoggia"],
      "runtime": 99,
      "movieId": 108241,
      "title": "Fear No Evil",
      "mpaa": "R",
      "actors": [
         "Stefan Arngrim",
         "Elizabeth Hoffman",
         "Kathleen Rowe McAllen",
         "Frank Birney",
         "Daniel Eden",
         "John Holland",
         "Barry Cooper",
         "Alice Sachs",
         "Paul Haber",
         "Roslyn Gugino",
         "Richard Jay Silverthorn"
      ],
      "imdbMovieId": "0082367",
      "originalTitle": "Fear No Evil",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "2cWKqmiM0AM",
         "ZBK3Hxrnu64"
      ],
      "plotSummary": "High school student turns out to be personification of Lucifer. Two archangels in human form (as women) take him on.",
      "tmdbMovieId": 91817,
      "avgRating": 2.25,
      "releaseYear": "1981",
      "numRatings": 4,
      "posterPath": "/t7MoviBlqlkAWjCWP375YGnqn9E.jpg"
   }
}