{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt1723642",
      "video": false,
      "title": "HOUBA! On the Trail of the Marsupilami",
      "recommendations": [
         80015,
         17350,
         182219,
         15587,
         133469,
         2395,
         252607,
         183836,
         33701,
         38277,
         325844,
         66129,
         13043,
         18955,
         35026,
         99770,
         31203,
         2899,
         21435,
         248507
      ],
      "backdrop_path": "/pHZS0Gf9bqZcyJMYgU0Fc2y6qE4.jpg",
      "revenue": 48600000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Dan Geraldo",
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b3813",
               "name": "Alain Chabat",
               "profile_path": "/zR39m8iQ2OWn753WLwQ3oiH1qRc.jpg",
               "id": 4275,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Pablito Camaron",
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b3817",
               "name": "Jamel Debbouze",
               "profile_path": "/rnXlFlIAbCnQqQUyTdBCt7B0H5L.jpg",
               "id": 2408,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Hermoso",
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b381b",
               "name": "Fred Testot",
               "profile_path": "/5qnj1GlITIV97655jzn8oZC2GPP.jpg",
               "id": 84100,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Général Pochero",
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b381f",
               "name": "Lambert Wilson",
               "profile_path": "/jFkr2kuFfpzS1plfOlNJ6kURV6O.jpg",
               "id": 2192,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Caporal",
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b3823",
               "name": "Patrick Timsit",
               "profile_path": "/p429Z97XloHvHe2a4PEZPqBZNEi.jpg",
               "id": 41526,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Pétunia",
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b3827",
               "name": "Géraldine Nakache",
               "profile_path": "/mlJZWY6ZuCNklAeubVsv4ejJtNR.jpg",
               "id": 114953,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b3803",
               "name": "Alain Chabat",
               "profile_path": "/zR39m8iQ2OWn753WLwQ3oiH1qRc.jpg",
               "id": 4275,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b3809",
               "name": "Alain Chabat",
               "profile_path": "/zR39m8iQ2OWn753WLwQ3oiH1qRc.jpg",
               "id": 4275,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a04c3a36847f81b380f",
               "name": "Jeremy Doner",
               "profile_path": null,
               "id": 142983,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.204852,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 102207,
      "vote_count": 278,
      "budget": 50000000,
      "overview": "When reporter Dan Geraldo (Alain Chabat) arrives in Palombia to hunt for a scoop, he never suspects that he is about to make an incredible discovery... With his resourceful local guide Pablito (Jamel Debbouze), D an has one surprise after another during a thrilling adventure that allows him to bring the world some spectacular news: the Marsupilami, a mythical and mischievous animal, really does exist! You too will believe in furry tails!",
      "similar": [],
      "original_title": "Sur la Piste du Marsupilami",
      "runtime": 105,
      "poster_path": "/u4hF8kS8xcE500OUpefka1vHCSm.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/cv1vihTOJIIN4NPNYLcf5SxUS9Y.png",
            "name": "Pathé",
            "id": 7981,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         }
      ],
      "release_date": "2012-04-03",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alain Chabat"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Alain Chabat",
         "Jeremy Doner"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1723642/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTU0MzI0MDkwOV5BMl5BanBnXkFtZTgwNDg2MTAwMTE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Jamel Debbouze, Alain Chabat, Fred Testot | See full cast and crew »"],
      "reviews": [
         "We went to watch this movie with our two kids and it was really fun! If you like the comic books from Franquin, this movie relates very nicely to the humour that you find in them. Alain Chabat always manages to appeal to the small ones as well as to the oldest ones. The marsupilami looks really cute with its family and the situations are very funny with the actors over doing it sometimes, which obviously make the kids laugh like crazy at the cinema. For the adults, there are some references to certain movies and situation that are quite known in French journalism. If you want to have a good time with your family and not think too much this movie is made for you. Do not expect something very profound, but what you have seen in the trailer is what you will see on screen. So, enjoy an afternoon watching a real comic book on screen!",
         "I was curious after seeing the previews and there I sat as the theatre went dark and the show started on screen, thinking to myself \"I hope this does not suck\". I was very happy to see that not only had I not been fooled by the previews, but they actually represented the movie quite well. I laughed, I giggled and then I laughed and laughed again. If you go in expecting a great movie: this is not what it is! This is a beautiful light hearted comedy just like the comic strip was. True to its origins. I left the theatre feeling the same way I felt when I finished one of the comic strips: happy and content. @Alain Chabat: bravo! et merci pour tous ces rires. (which translates to \"thanks for all the laughs\")",
         "Chabat is mostly an acquired taste. He is a goofy light comedian. His movies are in line with the Zucker-Zucker-Abrahams movies. His humour is brave and absurd on a performance level, but ultimately it does not probe or bring any new meaning concerning the human condition. It's just fun. Frankin is a great and original french artist. His world is inhabited by very quirky misfits (Gaston Lagaffe), sometimes by heroic characters (Spirou and Fantasio). In interviews, Chabat has said he has wanted to do something based on Frankin for many years, but the rights to Spirou are all tied up. Then he found a loop hole. Don't go in expecting a straight up adaptation of one of the books, though parts of \"Le Nid Du Marsupilami\" are in there for sure, including the babies at the end. Chabat brings his own tone and spin on the subject, which probably won't please all the fans. He had the same trouble with Gosciny when he adapted \"Asterix Chez Cleopatre\". Despite that film's popularity and success, the creator of Asterix hated the Chabat touches and insisted on other film makers for the next instalments (all inferior). Marsupilami has some of the veneer of Frankin's world, through the art design, mostly. Much of Chabat's quirky humour is overlapped on the story. I got a great kick out of the South American dictator who is Celine Dion's #1 fan. The musical number towards the end is right up there for absurd comedy. The CGI is okay for what it is. Marsu is adorable. Some of the other effects are borderline for a film of its budget. The animatronic creatures are very good. Chabat's and DeBouze's performances are excellent. But Lambert Wilson really steals the show. My sons loved it. We are all fans of Didier, Asterix and Cleopatra, RRRrr and City of the Dead.",
         "Going in, I did not expect too much from this comedy - I'm a fan of Franquin's work and of the Marsupilami, and so I'm basically willing to give everything containing the speckled longtail at least a try, even if I had the impression this was more of a cash-grab than a homage. So, speaking as Marsupilamist - yep, the movie delivers, but, for my taste, there should have been even more scenes with the M. Jamel Debbouze and Alain Chabat are not bad at comedy (Debbouze is better here), but the M. stole every scene it was in. While one can argue if the CGI creation did justice to Franquin's style - it seemed a bit too fluffy - I can't deny that they hit many a sweet spot here, and some of the tail gags were really nice. I also appreciated the inclusion of lady M. and the nest, \"Le nid des Marsupilamis\" was and is my favourite M. comic. Apart from the M.s, the comedy suffers from uneven pacing and atmosphere. Many gags are announced from a mile away, and for readers of Franquin's works, some plot developments were too obvious. On the other hand, there were some really nice gags, and also some creative cinematography and visual gags. The whole prophecy scene was absolutely hilarious, one of the funniest scenes in recent comedies and a perfect spoof of an often misused plot device. The Celine Dion gags were cool at first, but the musical number went on for too long. And the villain was very weak; little tension here - on the other hand, this makes it safe to watch witch children, no frightening scenes. Overall, a so-so comedy which is elevated above mediocre by the inclusion of the Marsupilami.",
         "As with all comic adaptations to live action, there has to be made some sacrifices. I was pleasantly surprised to see how little they changed the Marsupilami. He is cute, funny and he is just like I would imagine the little fellow in real life. The story does not resemble anything really from the comics. Some new characters find the marsupilami. I would have loved to see Spirou and fantasio finding him, but I guess that would be too much to ask for. But then again people would bicker about them instead. All in all one of the better adaptations from comic to screen in recent years. It is funny, cute, adventurous and visually exciting.",
         "Pictures, images, make up are great but I really don't like the actors or even the digital representation of Marsupilami. The poor thing didn't deserve Alain Chabat or even worse with Jamel Debbouze. This is unfaithful for all Franquin's work to get such a nice little animal being screwed by these actors and producers. I appreciate the second roles like Patrick Timsit, Aïssa Maïga, Lambert Wilson or Liya Kebede. Lambert Wilson imitating Céline Dion is the only one great moment with this \"something\" of Freddy Mercury. Géraldine Nakache is also truly insupportable in this movie, it seems she needs to get some actor's comedy lessons. As for the humor Chabat or Debbouze, you will remain on their traditional not even french jokes, old and stale light far away from the so funny original dialog of Franquin.",
         "Well, i don't know if it's a bad movie or not. If you ask my 6 years old nephews, they didn't like it because it was complicated and not too really funny. I agree with them: the part about the prophecy isn't really clear and Chabat is boring when he tries to make laugh with private jokes (here, Celine Dion). In addition, there's too much useless characters thus too much thin stories. For example, Geraldine is maybe sweet but her character is transparent here. In fact, it's too scripted for a comedy. On the other hand, Chabat is a great actor and his portraying of this goofy reporter is fun. Debouze, Wilson are boring as usual but they are watchable as they stand for punching bag. Fred is excellent as a pseudo dictator and proves another time that he can play anyone. As for Marsu, the movie decides to film it in his native jungle. It's faithful to the comics and it's exotic. In conclusion, maybe it's a disappointment for those who waited a crazy frenzy as \"Gremlins\" but it's not a wasted time also."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Chez Wam",
         "Pathé",
         "TF1 Films Production"
      ],
      "summaries": ["When reporter Dan Geraldo (Alain Chabat) arrives in Palombia to hunt for a scoop, he never suspects that he is about to make an incredible discovery... With his resourceful local guide Pablito (Jamel Debbouze), Dan has one surprise after another during a thrilling adventure that allows him to bring the world some spectacular news: the Marsupilami, a mythical and mischievous animal, really does exist! You too will believe in furry tails!"],
      "budget": 0
   },
   "movielensId": 108237,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2012-04-03",
      "dvdReleaseDate": null,
      "directors": ["Alain Chabat"],
      "runtime": 105,
      "movieId": 108237,
      "title": "HOUBA! On the Trail of the Marsupilami",
      "mpaa": "PG-13",
      "actors": [
         "Alain Chabat",
         "Jamel Debbouze",
         "Fred Testot",
         "Lambert Wilson",
         "Patrick Timsit",
         "Géraldine Nakache"
      ],
      "imdbMovieId": "1723642",
      "originalTitle": "Sur la Piste du Marsupilami",
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When reporter Dan Geraldo (Alain Chabat) arrives in Palombia to hunt for a scoop, he never suspects that he is about to make an incredible discovery... With his resourceful local guide Pablito (Jamel Debbouze), D an has one surprise after another during a thrilling adventure that allows him to bring the world some spectacular news: the Marsupilami, a mythical and mischievous animal, really does exist! You too will believe in furry tails!",
      "tmdbMovieId": 102207,
      "avgRating": 2.86364,
      "releaseYear": "2012",
      "numRatings": 11,
      "posterPath": "/u4hF8kS8xcE500OUpefka1vHCSm.jpg"
   }
}