{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "radio announcer",
         "id": 188692
      }],
      "imdb_id": "tt0022635",
      "video": false,
      "title": "Are You Listening?",
      "recommendations": [],
      "backdrop_path": "/2cYAilaaLNXH7SfD4TBMLSg9mOO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Bill Grimes",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822561b",
               "name": "William Haines",
               "profile_path": "/lRgJ60XEhdpRAFgoAJHsZuV1y0i.jpg",
               "id": 150638,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Laura O'Neil",
               "gender": 1,
               "credit_id": "52fe4c42c3a36847f822561f",
               "name": "Madge Evans",
               "profile_path": "/fz1OHlZrxXWOEck7Ltd4VkJLsss.jpg",
               "id": 104728,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Larry Barnes",
               "gender": 1,
               "credit_id": "52fe4c42c3a36847f8225623",
               "name": "Anita Page",
               "profile_path": "/8nYNbVBg8G5aaryXsgzl4WC6Fdz.jpg",
               "id": 98012,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Alice Grimes",
               "gender": 1,
               "credit_id": "52fe4c42c3a36847f8225627",
               "name": "Karen Morley",
               "profile_path": "/t8WUPEuD1hhEx3O7GLUrfYO41aM.jpg",
               "id": 13354,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jack Clayton",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822562b",
               "name": "Neil Hamilton",
               "profile_path": "/zbSm4kPqVZM2JB6ph7eQsZVsnQP.jpg",
               "id": 27733,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Larry Barnes",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822562f",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "George Wagner",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f8225633",
               "name": "Jean Hersholt",
               "profile_path": "/47EWS9uYU5vx10cnyjtqVVDytnI.jpg",
               "id": 32138,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ted Russell",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f8225637",
               "name": "John Miljan",
               "profile_path": "/6C1k1y0gVOq3nSoBG29CJPJs1N1.jpg",
               "id": 90000,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Radio station sound effects man",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822563b",
               "name": "Hank Mann",
               "profile_path": "/nMqnAqvfisbXevq1Z54GdaN139Z.jpg",
               "id": 13856,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mr. Carson",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822563f",
               "name": "Murray Kinnell",
               "profile_path": "/l4xAQ3u7brxZCFFAx8jVG0iaNfm.jpg",
               "id": 120537,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Mrs. Peters",
               "gender": 1,
               "credit_id": "52fe4c42c3a36847f8225643",
               "name": "Ethel Griffies",
               "profile_path": "/m3pXmGCIlccqKUi9ERM1aiBNhTw.jpg",
               "id": 8232,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Pierce",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f8225647",
               "name": "Charley Grapewin",
               "profile_path": "/jUHnyU7byM0ajyrovvUXkWZnlAc.jpg",
               "id": 8517,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Fred",
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822564b",
               "name": "Lucien Littlefield",
               "profile_path": "/65jnSJmU2BC4Jrpg2Nfg6glU6wN.jpg",
               "id": 34574,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Performer entering radio station",
               "gender": 1,
               "credit_id": "52fe4c42c3a36847f822564f",
               "name": "Hattie McDaniel",
               "profile_path": "/y3QtJ1qZD7Ms0IAzRbgOunMp97h.jpg",
               "id": 11498,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Honey O'Neil",
               "gender": 1,
               "credit_id": "5512809bc3a3683f39009701",
               "name": "Joan Marsh",
               "profile_path": "/kQQPJu16vjkGhpvzWfwuaSaukcn.jpg",
               "id": 120542,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c42c3a36847f822560b",
               "name": "Harry Beaumont",
               "profile_path": "/mmnsbUDWefbtxStex4Lge86R7kq.jpg",
               "id": 145605,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c42c3a36847f8225611",
               "name": "Dwight Taylor",
               "profile_path": null,
               "id": 30171,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c42c3a36847f8225617",
               "name": "Dwight Taylor",
               "profile_path": null,
               "id": 30171,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.055313,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 161315,
      "vote_count": 0,
      "budget": 0,
      "overview": "WBLA is on the air, presenting the live music, the sudsy dramas and the sell-sell-sell of commercial interludes that keep consumers buying and sponsors smiling. But one sponsor, a producer of plumbing supplies, isn’t happy. So WBLA scriptwriter Bill Grimes is bounced from his job, setting in motion this movie’s turn from comedic to darkly tragic. William Haines, two years removed from being Tinseltown’s top male star, plays Grimes in a melodrama noted for its glimpses of live radio production and for a Depression-era ethos that includes peroxide cuties eager to land a job, a sugar daddy or both.",
      "similar": [
         268532,
         152040,
         293334,
         478310,
         291528
      ],
      "original_title": "Are You Listening?",
      "runtime": 73,
      "poster_path": "/k6txQ9U04qqgEzv8xvwIh3Wwg2N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1932-03-20",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Don't touch that dial.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Harry Beaumont"],
      "runtime": 73,
      "synopsis": null,
      "writers": [
         "Dwight Taylor",
         "J.P. McEvoy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0022635/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMjU0OTU1OV5BMl5BanBnXkFtZTYwODMxMzk5._V1_SY216_CR33,0,214,216_AL_.jpg",
      "actors": ["Stars: William Haines, Madge Evans, Anita Page | See full cast and crew »"],
      "reviews": [
         "In his final film for MGM, William Haines seems rather subdued here in a film that starts out as a romantic comedy/drama but then turns into a murder melodrama. If nothing else, this film proves that Haines could play it \"straight\" and not always fall back on his \"silly billy\" character. Haines plays a radio writer married (but separated) to a sullen and greedy woman (Karen Morley) while he romances a co-worker (Madge Evans). Morley will not give up her meal ticket and bleeds Haines of everything he's got. But after he loses his job, Morley goes berserk and is accidentally killed. In a subplot, Evans' roommate (Anita Page) who works at the radio station, takes in her kid sister (Joan Marsh) who goes wild in the big city and gets involved with older men (Jean Hersholt, Neil Hamilton). In a neat twist, the radio, which is at first seen as a mindless form of entertainment, spoofed via the hokey shows Haines writes, turns deadly as a ruthless newspaper man (John Miljan) uses the radio to persecute and hunt down Haines after the death of his wife. It all seems like a minor MGM film, but there are some interesting themes here. The ending is quite surprising. As always, Haines is terrific. Evans and Page are solid here as is Morley as the nasty wife. Co-stars include Wallace Ford, Hattie McDaniel, Ethel Griffies, Herman Bing, and Charley Grapewin.",
         "Although this film starts off like a typical Billy Haines comedy, it quickly becomes deadly serious. Haines plays a very unhappily married man, who finds himself with a very dead body on his hands & few plausible explanations. This gives him a chance to play a role quite different from his usual silly billys. Haines' character is a radioman and the scenes in and around the broadcasting studio are quite well done. An unusual number of lovely ladies can be found in support in this film: Anita Page, Madge Evans, Joan Marsh & Karen Morley. Jean Hersholt is also on hand to lend his grave presence to the proceedings. ARE YOU LISTENING? was made only two years after Haines was king of the Hollywood box office. But his days at MGM were growing short. The following year, 1933, would be his last at the studio. Today his movies are all but forgotten.",
         "It certainly was pre-code, wasn't it? More than the usual amount of girls getting out of the shower, girls standing around in their nighties. Pretty strong story and acting performances though. William Haines and friends work at a radio station, and that figures into the investigation when the un-expected happens. (Don't want to give too much away!) I think having lots of big names in this one helped - Madge Evans, Anita Paige, Neil Hamilton. I always loved Jean Hersholt. Even Hattie McDaniel in here. Ethel Griffies is Mrs. Peters. Country girl and her sisters move to the big city and the adventures they have! Was fun seeing the sound effect machines at the radio station. Reminded me of the Bob Hope films, where he works in radio and gets caught up in capers. Directed by Harry Beaumont, who had been around Hollywood since day one, just about! He had also directed Joan Crawford in her early stuff. This is a fun watch. Caught it on TCM.",
         "I've never seen Williams Haines play it so straight in a MGM drama. Here he's radio comedy writer Bill Grimes who is deeply in love with one of the players there, Laura O'Neill (Madge Evans). The problem is Haines is married to a woman who has lost complete interest in Haines with the exception of his monetary support. She doesn't care what he does personally as long as he brings home the bacon. Meanwhile, Laura is a pretty sensible girl, but her sisters are another story. Sally (Anita Page) is becoming quite the player in New York City nightlife via connections she makes at work - she's also got a job at the radio station. Into town comes baby sister Honey (Joan Marsh), and Laura is concerned that Sally will teach their baby sister her eat, drink, and be merry ways. The first half of the film thus has some heavy stuff going on, but it is lightened by the behind-the-scenes look at radio work in progress. Particularly amusing are the scenes with Grimes trying to get sound effects right such as him arguing with the props man that their avalanche does not sound like an avalanche or that the \"sick dog\" sound he is making is not right for the dog food commercial they need to make. Grimes loses his job after the comedy he writes begins to lose its edge, and things go downhill fast. Add an incidental shove that turns out to have deadly consequences, and you have quite a drama on your hands. Harry Beaumont did a good job of keeping this film moving without letting it get away from him. With things moving back and forth between Bill and Laura's romance, then to the radio station, then to Honey and Sally's partying with both the new and old money of the city, this thing could have turned into an incoherent mess in a hurry. Instead it all comes together quite nicely at the end with the individual pieces of the story holding your interest on their way to their joint conclusion. To see how well the MGM assembly line could craft a tale in the early 30's and to see William Haines hold his own in a serious role, give this one a try.",
         "This was a particularly enjoyable film for both the parts taking place in the radio studio and those taking place in the bachelorette apartment occupied by the three sisters. Additionally, Haines gave a totally convincing performance, both slightly comical and then quite serious, throughout the film. However, contributors should pay more attention to what they are watching or learn a bit more about old time Hollywood. The following are needed corrections to the comments of mark.waltz posted only within the last month: 1) Joan Marsh did not play the 'horrendous wife' he refers to; Karen Morley did. 2) Karen Morley did not play the 'girlfriend'; Madge Evans did. 3)\"Morley's\" (actually \"Evans's\") younger sister does NOT \"end up pregnant by a wealthy playboy\" (she has simply had sex with him a night or two before in the belief that marriage was in the cards,and is ashamed of herself); 4) Felix Bressart is NOT in the film; the contributor may have meant Herman Bing, but Bressart did not even arrive in the U.S. until seven years after this film had been issued! 5) Hattie \"McDaniels\" should be Hattie \"McDaniel\".",
         "Some Pre-Code Girly Imagery is on hand here as this rather Routine Drama is Enhanced by some Really-Cool looks inside the 1932 Radio Studio at the Machinations and Machinery, Technology and Radio-Art on Display that are Historic and Interesting. It is that Backdrop that sets this Apart from the Routine as the Radio is also used as a Tool to Track the Couple on the Lam. Notice how the Announcer on Air calls Him a Killer and not a Suspect or Alleged Killer, that is Important as a Snapshot of the Media in the Early Thirties and is Priceless. Slightly Above Average for the Aforementioned and is Certainly Worth a Watch in a Time Travel Cultural Context and the Production is Glossy and Slick. It's the Drama that is Pedestrian but it does have just Enough Entertainment Value to Pass as a Light-Weight Crime-Drama.",
         "\"Are You Listening\" was William Haines first role under his new \"featured player\" contract. This meant his name would now be billed below the film's title and it was a movie that had already been rejected by Robert Montgomery who was being promoted as the \"new William Haines\"!!! Even though still popular with the public the \"real\" William Haines' last films hadn't been up to his usual standard and he had even consented to a personal appearance tour to promote \"Get Rich Quick Wallingford\" - the type of publicity that he despised. I wouldn't say \"Are You Listening\" was a light hearted film turning suddenly dramatic two thirds way through. Even though Haines was the nominal star, initially the movie spotlighted nice girl Laura (Madge Evans) and the juggling act she had to perform to keep her two sisters in line. Wayward sister Sally (again, Anita Page turns in a solid performance but like Haines she was on a downward slide with MGM) is a party girl and kid sister Honey (Joan Marsh, who repeated her role in the next year's \"Daring Daughters\") is fast following in sister's footsteps. She gets her screen time in this episodic film as an innocent (with simply gobs of makeup!!) who really believes what caddish Neil Hamilton coos in her ear about getting married and meeting the folks etc!!! Wallace Ford has a small part as her patient boyfriend. Haines plays Bill Grimes, a radio gag writer who is in love with Laura but is tied to vicious shrew Alice who refuses to divorce him. And everyone has to take a backseat to Karen Morley who makes her every scene count as she spits out venom and makes Bill's every waking moment a misery. He finally makes the break after he loses his job (\"come back when you're funny again\") but Alice tracks him down to his seedy hotel room. There is a tussle and suddenly Bill, along with Laura, is on the run in a \"Bonnie and Clyde\" style chase and the film is over pretty quickly. I thought Haines looked handsome and fit in this movie which gives lie to the rumour that he was on the outer because he was ageing badly. Decorous Madge Evans was on the comeback trail, she had been a child star in the 19teens but was hoping to make her mark as a leading lady under Irving Thalberg's guidance and she did. Karen Morley had a similar intensity to Ann Dvorak and, like Ann, was not handled right by her studio. In fact her competition on the lot was Madge Evans!! but in 1932 she married director Charles Vidor and suddenly she saw coveted roles just slip through her fingers - a punishment as MGM thought she was getting too big for her boots!! Such a pity that she couldn't build on her terrific performance in \"Are You Listening\". Recommended.",
         "Is it possible to combine a soap opera, a send-up and a melodrama in one neat little package? That was no problem at MGM back in 1932. The sudsy part is devoted to three sisters, the \"good girl\" who's madly in love with a married man, the playgirl who stays out all night boozing and the wide-eyed kid who can't tell a marriage proposal from a con job. The satire is set at a radio station where the lovers, scriptwriter William Haines and actress Madge Evans, work with an inept sound effects man, a lovelorn crooner and mindless sponsors of ludicrous products. As for the melodrama, that's provided by Karen Morley as Haines' hellion of a wife who pays dearly for her continual nagging. Watch \"Are You Listening?\" and you'll realize how radically movies changed within the next few years.",
         "A romantic leading man that looks like your immigrant great-grandfather. Half a dozen bricks falling down a slide to give the impression of an avalanche. Plastic slabs hitting against a rock to emulate clapping. These are just a few of the fake radio effects that fooled audiences in the 1930's to think that they were listening to sophisticated people in sophisticated surroundings being glamorous. \"You're listening to a ventriloquist on the radio!\" someone tells his wife in Woody Allen's \"Radio Days\". That is pretty much the set-up here for a pre-code comedy/drama about a radio writer's personal soap opera that ends with him on the run for murder and how he becomes a media obsession for the ensuing bravado. William Haines, America's favorite happy-go-lucky dapper Dan of the early 30's, plays the unlucky lad with a horrendous wife (Joan Marsh) and a girlfriend (Karen Morley) who stands by him through thick and thin. Morley's younger gullible sister comes to town and ends up pregnant by a wealthy playboy (\"Batman's\" Neil Hamilton) who in one scene holds onto her while she is plastered, obviously caressing her breast. Of course, he has no intention of marrying her, so this leaves her in a jam. Haines' wife refuses to give him a divorce, so bitterly hateful that she blackmails him into attending a dinner party just to make a false impression on her guests. How these two ended up married is beyond comprehension, especially since they have no children. However, even in spite of how obvious it will all turn out, this is a fast-moving example of pre-code sin on the silver screen with such character actor notables as Felix Bressart, Jean Hersholt, Wallace Ford and even Hattie McDaniels (a one-line cameo) in support."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["A radio announcer accidentally kills his wife, then leads an on-air hunt for her killer."],
      "budget": 0
   },
   "movielensId": 108370,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-03-20",
      "dvdReleaseDate": null,
      "directors": ["Harry Beaumont"],
      "runtime": 73,
      "movieId": 108370,
      "title": "Are You Listening?",
      "mpaa": "",
      "actors": [
         "William Haines",
         "Madge Evans",
         "Anita Page",
         "Karen Morley",
         "Neil Hamilton",
         "Wallace Ford",
         "Jean Hersholt",
         "John Miljan",
         "Hank Mann",
         "Murray Kinnell",
         "Ethel Griffies",
         "Charley Grapewin",
         "Lucien Littlefield",
         "Hattie McDaniel",
         "Joan Marsh"
      ],
      "imdbMovieId": "0022635",
      "originalTitle": "Are You Listening?",
      "genres": [
         "Drama",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "WBLA is on the air, presenting the live music, the sudsy dramas and the sell-sell-sell of commercial interludes that keep consumers buying and sponsors smiling. But one sponsor, a producer of plumbing supplies, isn’t happy. So WBLA scriptwriter Bill Grimes is bounced from his job, setting in motion this movie’s turn from comedic to darkly tragic. William Haines, two years removed from being Tinseltown’s top male star, plays Grimes in a melodrama noted for its glimpses of live radio production and for a Depression-era ethos that includes peroxide cuties eager to land a job, a sugar daddy or both.",
      "tmdbMovieId": 161315,
      "avgRating": 3,
      "releaseYear": "1932",
      "numRatings": 1,
      "posterPath": "/k6txQ9U04qqgEzv8xvwIh3Wwg2N.jpg"
   }
}