{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0024360",
      "video": false,
      "title": "Murders in the Zoo",
      "recommendations": [
         122211,
         29324,
         95560,
         35911,
         84719,
         41027,
         41033,
         30345,
         15401,
         38468,
         23126,
         139324,
         28439,
         28305,
         76964,
         30230,
         59589,
         99545,
         59158,
         56147
      ],
      "backdrop_path": "/nZB9gA1qDdTjR3ef6rzayDYvHck.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Peter Yates (as Charlie Ruggles)",
               "gender": 2,
               "credit_id": "52fe470e9251416c91068955",
               "name": "Charles Ruggles",
               "profile_path": "/mYzf9Vq3rFizQwk5cXJBFSYAcJI.jpg",
               "id": 2436,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Eric Gorman",
               "gender": 2,
               "credit_id": "52fe470e9251416c91068959",
               "name": "Lionel Atwill",
               "profile_path": "/kZOpzski4M8SZLFNozaAgp7Gbgp.jpg",
               "id": 2495,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jerry Evans",
               "gender": 1,
               "credit_id": "52fe470e9251416c9106895d",
               "name": "Gail Patrick",
               "profile_path": "/slrbcxt2O7yoq5cZ6r9cdIAi3YB.jpg",
               "id": 98574,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Jack Woodford",
               "gender": 2,
               "credit_id": "52fe470e9251416c91068961",
               "name": "Randolph Scott",
               "profile_path": "/qM2DNQ7kI9oZqAYfhzgKaGURCnm.jpg",
               "id": 1009,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Evelyn Gorman",
               "gender": 1,
               "credit_id": "52fe470e9251416c91068965",
               "name": "Kathleen Burke",
               "profile_path": "/s8Yp7ByWW8toWVZlL7EswUFGVqp.jpg",
               "id": 29761,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Prof. G.A. Evans",
               "gender": 2,
               "credit_id": "52fe470e9251416c91068969",
               "name": "Harry Beresford",
               "profile_path": "/8xttgHd9pC8tzJywxEfCsscarjY.jpg",
               "id": 33005,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Roger Hewitt",
               "gender": 0,
               "credit_id": "52fe470e9251416c9106896d",
               "name": "John Lodge",
               "profile_path": "/dKLUrgJSkcq7iPGliG81xL8Fdrw.jpg",
               "id": 133470,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Banquet Guest (uncredited)",
               "gender": 1,
               "credit_id": "594798e69251417e4c01afc3",
               "name": "Jane Darwell",
               "profile_path": "/geGrMcqxcFtMKKJO36OFpVwZFFW.jpg",
               "id": 8515,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470e9251416c91068951",
               "name": "A. Edward Sutherland",
               "profile_path": null,
               "id": 89669,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57ed5bc39251416e02000f45",
               "name": "Philip Wylie",
               "profile_path": null,
               "id": 29757,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57ed5bca9251416ded000ff8",
               "name": "Seton I. Miller",
               "profile_path": null,
               "id": 67428,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57ed5bd3c3a36842bb001a0e",
               "name": "E. Lloyd Sheldon",
               "profile_path": null,
               "id": 105450,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "57ed5bdac3a3684240001a14",
               "name": "Rudolph G. Kopp",
               "profile_path": null,
               "id": 13337,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57ed5be1c3a36839f700740d",
               "name": "John Leipold",
               "profile_path": null,
               "id": 30256,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57ed5be69251416dfe000f41",
               "name": "Ernest Haller",
               "profile_path": null,
               "id": 2774,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.87501,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39311,
      "vote_count": 9,
      "budget": 0,
      "overview": "A crazed zoologist uses zoo animals to dispose of his wife's suitors.",
      "similar": [],
      "original_title": "Murders in the Zoo",
      "runtime": 62,
      "poster_path": "/lSdWjZmb5jc9PgxRoUA5BxDnfJ2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1933-03-31",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["A. Edward Sutherland"],
      "runtime": 62,
      "synopsis": null,
      "writers": [
         "Philip Wylie",
         "Seton I. Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024360/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTg3OTk0MzIxNF5BMl5BanBnXkFtZTcwOTQyODYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Charles Ruggles, Lionel Atwill, Gail Patrick | See full cast and crew »"],
      "reviews": [
         "Eric Gorman (Lionel Atwill) hunts down exotic wildlife for a zoo back in the States. He also has an intense jealous streak when it comes to men interacting with his wife (Kathleen Burke from THE horror film of the 30's, Island of Lost Souls). So jealous that he's more than willing to kill any man he deems a threat, and his weapons of choice are the animals that he has access to. This is a solid 30's horror picture with a unique storyline. It also has a pretty potent mean streak for a film of it's time, one scene involving an alligator pit coming immediately to mind. Lionel Atwill has an effective screen presence as the sinister Gorman. As murderous as he may be, I found it hard to root against the man. What can I say? I'm not remotely sympathetic towards philanderers. His idea to utilize animals as murder weapons is both one of convenience and a clever way to be free of incriminating evidence. The animal attacks, including an encounter with a large python, are intense and believable. My main qualm with the film is a problem that plagues many pictures of the era, that being the style of comic relief that was popular back then. The Peter Yates character is pretty annoying, and we're treated to a particularly absurd scene where he pops a lion on the head. Charlie Ruggles plays Yates, and he's about as unfunny as it gets. Why he has such a prevailing presence in an otherwise serious film is beyond me. The time taken up by his antics could have been used to further develop our main storyline. However, this is worth seeing. It's also well-paced, clocking in at just a little more than an hour in length.",
         "I am shocked,well, okay that word may be a bit strong, at a couple of the comments on here with regards to this film. This IS a great little horror gem that needs more press for its atmosphere and for the wonderful performance of Lionel Atwill. Atwill is amazing as a jealous millionaire/adventurer use to getting his way. The opening has Atwill, wife, and company in India and the Orient in search of wild animals for the Municipal Zoo, of which Atwill is a great benefactor. We soon see what kind of man Atwill is as he literally sews a man's lips shut and leaves him for dead in the wild, saying, \"He will never lie again, nor will he ever kiss another's woman.\" Atwill then goes back to camp, questioned by his wife where this man is saying he just fled. His wife asks if he said anything about where he was going and Atwill replies in his wonderfully droll, sardonic manner, \"He didn't say anything.\" It is this kind of black humour in Atwill's performance throughout the whole film that really helps this movie rise from some of its obvious flaws. Yeah, I know Charlie Ruggles got top billing for his comedic \"drunk\" routine. I rather liked it myself, but can see where it might get tiresome after awhile. Some of the other performers are very wooden including character actors like Harry Beresford and particularly John Lodge as yet another man trying to seduce(a fairly easy task given the promiscuous nature of Atwill's lovely wife)Kathleen Burke as Atwill's wife. Burke gives a decent performance but looks a whole lot better than she acts. A small concession this reviewer can live with. But the film belongs to Atwill all the way. As one reviwer noted earlier, his evil presence is in many ways comparable to Leslie Banks in The Most dangerous Game and Charles Laughton in The Island of the Lost Souls. Atwill is sadean to the point of complete lack of care for anyone but himself. The zoo is impressive and some of the best scenes are a dinner given amidst all the carnivorous cats and the bridge that goes over a pool of crocodiles. Also, watch for a great scene with Atwill and Randolph Scott where Atwill, holding the head of a mamba in a tissue, tries to prick Scott when he is not looking. Another gem of black humour. One big flaw is the mamba itself. It is a boa or a python. Cannot have everything. The MCA-Universal print is as clear as you will find. A great film with an even greater Atwill performance!",
         "A madman commits a series of MURDERS IN THE ZOO, hoping to punish his adulterous wife and her lovers. Sadly neglected, this dandy little thriller comes from a studio & director (Paramount, Edward Sutherland) more noted for their comedy films. It holds its own, however, and offers several visual shocks which should more than satisfy its audience. Especially noteworthy are the opening credits which humorously compares the human stars with various zoo beasts, and sweeps immediately into an initial scene of unusually fiendish ferocity. From this point on, the viewer is hooked... Lionel Atwill adds another portrait of evil to his gallery of grotesques, here playing a villain not only morally twisted but positively vile. The gentle, daffy humor of top-billed Charles Ruggles might seem out of place in other horror films, but here it is a welcome anodyne to Atwill's monstrosities. The rest of the cast - Randolph Scott, Gail Patrick, Kathleen Burke, Harry Beresford - do very well in roles that are really little more than supporting parts. Movie mavens will recognize an uncredited Jane Darwell as a society matron at the Zoo Supper.",
         "While not on the creepy level of Edgar Ulmer's \"The Black Cat\", this film shows that a studio OTHER THAN Universal was trying to make horror films in the early thirties. I will agree that Charlie Ruggles' tipsy clowning tends to diffuse the genuine horror of the situation, but this seems to almost have been a requirement of horror films of thirties, as this same type of character is found in \"Mystery of the Wax Museum\", and \"Doctor X\", both films starring Lionel Atwill. Maybe they just wanted to offset Atwill's natural creepiness, eh? At any rate, A big kudos to MCA/Universal for even releasing this film on home video, and for using one of the most beautiful prints I've ever seen! Now, if we can just get them to put out MURDER BY THE CLOCK...",
         "I first came across this film in a review in one of William Everson's compendiums of horror film classics. He spoke quite highly of it, but until tonight I never had seen it. MURDERS AT THE ZOO has the plus of Lionel Atwill as a big game hunter named Eric Gorman. He is quite an expert on deadly animals and brings them to the zoo in the city he lives in. But his wife Evelyn (Katherine Burke) has a way of attracting younger, and handsomer men to her attention. Atwill is fiendishly possessive and jealous, and proceeds to kill any man who is having an affair with his wife. But he uses his knowledge of the wild and animals (he later explains he loves animals because of their honesty regarding their feelings, including kill or be killed) to destroy these men. We first see him tying up and leaving a man in the jungle to be destroyed by man-eating tigers. But first he sews the man's lips together so he can't lie or kiss another man's wife (or call for help). A close-up of the man with bloodied, threaded face is briefly shown on camera. On the voyage back home from India Burke meets an American traveler played by John Lodge. Lodge and Burke begin an affair (which Atwill soon is aware of). Atwill pretends he is unaware of it, and invites Lodge to a dinner party (to raise funds for the zoo - this is the depression). At the party Lodge dies, the victim (apparently) of the bite of a green mamba snake that Atwill brought back from India which may have escaped from it's cage. The person that was responsible for the care of the new acquisition is Randolph Scott, here not in his normal western milieu but playing a reptile expert. Scott, with assistant and girl friend Gail Patrick, is struggling to create an anti-toxin for snake venom, particularly those of the deadly Mamba snakes. Atwill jumps to the conclusion that Scott has been criminally negligent regarding watching this deadly snake, and wishes to press charges against him. However, Burke is less willing to believe Scott is responsible, and soon is aware of who is responsible...which is not healthy for her. The use of a deadly snake for killing purposes goes back to Conan Doyle and \"The Adventure of the Speckled Band\" in the first collection of Sherlock Holmes short stories. But the character I found interesting here is Scott, the reptile man at the zoo. It is hard for us to realize but in the 1930s Americans were still fascinated by the world of zoos and aquariums and the people who searched for or dealt with rare animals. Frank Buck's book BRING 'EM BACK ALIVE described his adventures hunting and trapping dangerous animals (it was a big best seller). The career of Clyde Beatty, as an animal trapper specialist, was followed and led to his career as a circus entrepreneur. But another figure of interest in New York City (which apparently is the city in this film) was Raymond Ditmars, who was in charge of the reptiles in the city zoos and was a recognizable authority on snakes. It is probable that he is the basis for Scott's character (especially in searching for anti-toxins). Atwill gives one of his finest performances here, Gorman's fascination with animals being as important as his sexual insanity (hinted at by his weird, occasional smiling stares and Burke's obvious disgust at him). The acting is competent, particularly Scott and Patrick. There is this problem I find with the fans and opponents of poor Charley Ruggles. Playing an alcoholic reporter trying this last chance job as a publicist, Ruggles is drunk in a couple of scenes (not through the entire film), and has a very funny moment when he finds himself next to the missing green mamba snake - leading to a request for information that could only appear in such a film prior to the real enforcement of the code on movies. He plays a major role in finally bringing Atwill to book at the end. And his last appearance (although drunk) is a curious counterpoint to his Major Applegate in BRINGING UP BABY only four years later. I only have one real problem with this neat little movie - how did Atwill contrive to use his \"weapon\" without being observed by the people at the dinner? It never is really explained.",
         "There's a famous gag that a camel is a horse that was designed by a committee. Murders in the Zoo is a good, creepy early '30s thriller with one design flaw so wrong as to sink the whole thing. Every thriller has a little comic relief character. In this one it's the zoo's publicist who is afraid of animals. But somebody came up with the bright idea of casting Charlie Ruggles in this role. Now Ruggles is basically a one-note comic actor who inexplicably attained name-above-the-title stardom. And with his name in the cast, suddenly this supporting role became the starring role. You can see all the places where scenes were added or expanded to give the character more screen time. But he is still just the comic relief--he is not involved in any way with any major development in the storyline. He could be excised completely and never be missed. Randolph Scott is the hero and Lionel Atwill the villain, and both acquit themselves admirably. But every few minutes the forward movement of the story comes to a screeching halt while we are treated to the antics of the \"star\", and so the poor camel never quite gets his gait. The film has some genuinely classic \"horror movie\" moments, but it would be so very much better with a reliable character man providing the \"comic relief\" instead of making this relatively insignificant role into a star turn (for ANY star).",
         "\"Murders in the Zoo\" is a hugely entertaining little B-movie. The pacing is so fast and the content so varied, it seems unlikely that the intention was really to horrify. A very deliberate juxtaposition of slapstick comedy and horror lends the film a lot of energy. One could recommend it for Charlie Ruggles' amusing character alone. The scenes suggesting violence really are amazing for the period; they make one grateful that the film was not made only one year later, when these scenes would have been forbidden by 'The Code'. There is also a fascinating timely reference in the dialogue: the Lionel Atwill character says to another--\"You're one of the few lucky people who still have some money left\"--reflecting the film's period, in one of the worst years of The Depression. Atwill is a very successful villain, while Ruggles and Patrick make good impressions as well. This was, unfortunately, before Randolph Scott learned to act, although he certainly has the look of the handsome hero. And watch for an unbilled Jane Darwell at the zoo fund-raising dinner. Not a 30s horror masterpiece, but a definitely worth seeking out.",
         "It starts improbably with lions in a South East Asian jungle and Lionel Atwill sewing up the mouth of his wife's latest lover, leaving him to die helplessly. Not nice! And it gets even better, in what is a delicious hour and a minute from Paramount in their wonder period of 1930/4. A tale of insane jealousy leading to murders and in what passes for that now endangered species, a zoo, although obviously backlots and back projections abound in a rather darkly atmospheric mix. The main characters run true to typecast: Randolph Scott as the clever handsome good guy with ever-grinning Gail Patrick as his clever and loyal sidekick, Charles Ruggles as the well-meaning bumbling buffoon and Atwill as the manic sex fiend (hmm�). This was probably his best ever performance � witness his wide-eyed and frantic lust for his wife after he'd killed another of her boyfriends. Although just how it was done is still a mystery to me. Atwill was eaten up by jealousy but was eventually eaten up by alligators � how poignant! Years ago my then little daughter and I loved this one and it still holds up well as a wicked little suspense film, lovely and creaky, full of horrid humour and a cast who looked as though they enjoyed themselves making it.",
         "I'd recorded this on Chiller a long time ago and just got around to watching it tonight. This is a really good little piece of work. Dr. Gorman's insane jealousy drives him to murder anyone he suspects of trying to take his wife away from him. While on safari he stitches a suspected rival's lips together and abandons him in the jungle. Returning to the states, he dispatches one potential rival with snake venom. When his much younger wife gets wise to him he feeds her to the alligators (interestingly enough, the zoo has just a simple wooden bridge over the pit where they live). Eventually his misdeeds catch up with him. In a very effective scene Gorman turns a bunch of lions loose to stop the police who are pursuing him. He then runs, soon pursued by the lions, and finds safety in an animal cage. Wouldn't you just know it! He forgets that the cage he's found shelter in houses a huge snake, and what you expect to happen does. The chase scene is surprising in that there's no pulsing music to emphasize the action. The ringing of an alarm bell, the roar of the lions, and very effectively used silence when Gorman is being pursued are more effective than any music that could have been used. First and foremost, this looks great. The print is crisp and sharp. The sets are elaborate- these were probably standing sets on the Paramount lot that were redressed for the film. It's handsomely photographed by Ernest Haller, who you might remember for a somewhat more upscale film a few years later. You may have seen it: GONE WITH THE WIND. It's made clear from get-go that Gorman is the killer. Lionel Atwill always played the bad guy. Take a few minutes on IMDb and check out his tragic life story. Charlie Ruggles was a very popular actor at the time. He gets top billing as a booze addled loser who gets a job doing public relations for the zoo. To my thinking his part could have been eliminated completely, but he doesn't do a huge lot of damage.",
         "This is a good pre-code example of a horror film that must have shocked audiences in the early '30s and still carries enough punch to find favor with today's horror addicts. LIONEL ATWILL is at his wickedest as a cold-blooded owner of a zoo full of wild animals, everything from snakes to panthers. The story starts overseas with him doing an unusual sewing job on one of his victims after catching him kissing his wife, then switches to their return on a ship where his wife is fearful that a young man who has taken a shine to her (JOHN LODGE) will be his next victim. Atwill catches them having an intimate chat and we know he's found a man he must eliminate in a cruel way. It goes on in this fashion with the criminal getting away with murder until a clever lab technician (RANDOLPH SCOTT) and his assistant (GAIL PATRICK) are able to turn the tables on him. TCM features a good print of this little thriller, way ahead of its time in some of its subject matter, a film that any fan of Lionel Atwill's kind of villainy will want to catch. And incidentally, Randolph Scott and Gail Patrick are excellent in good supporting roles. Only drawback is the \"comic relief\" given to CHARLES RUGGLES who gives his weak material a good try but becomes more of an annoyance than anything else in the role of the zoo's new publicity agent."
      ],
      "genres": [
         "Horror",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Eric Gorman returns with his wife Evelyn from a trip to the Orient collecting zoo animals, having killed a member of his expedition who happened one day to kiss Mrs. Gorman. On board ship Evelyn meets Roger Hewitt, who falls in love with her. After delivering his animals to the zoo, Gorman plots a way to dispose of Hewitt using one of his latest specimens, then continues using the zoo's non-human residents to do his beastly work.",
         "A monomaniacal zoologist is pathologically jealous of his beautiful but unfaithful wife Evelyn and will not stop short of murder to keep her."
      ],
      "budget": 0
   },
   "movielensId": 108360,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1933-03-31",
      "dvdReleaseDate": "2009-10-28",
      "directors": ["A. Edward Sutherland"],
      "runtime": 62,
      "movieId": 108360,
      "title": "Murders in the Zoo",
      "mpaa": "",
      "actors": [
         "Charles Ruggles",
         "Lionel Atwill",
         "Gail Patrick",
         "Randolph Scott",
         "Kathleen Burke",
         "Harry Beresford",
         "John Lodge",
         "Jane Darwell"
      ],
      "imdbMovieId": "0024360",
      "originalTitle": "Murders in the Zoo",
      "genres": [
         "Crime",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A crazed zoologist uses zoo animals to dispose of his wife's suitors.",
      "tmdbMovieId": 39311,
      "avgRating": 2.25,
      "releaseYear": "1933",
      "numRatings": 4,
      "posterPath": "/lSdWjZmb5jc9PgxRoUA5BxDnfJ2.jpg"
   }
}