{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "greece",
            "id": 1200
         },
         {
            "name": "older woman younger man relationship",
            "id": 157799
         }
      ],
      "imdb_id": "tt0070068",
      "video": false,
      "title": "40 Carats",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ann Stanley",
               "gender": 1,
               "credit_id": "52fe4603c3a36847f80e75bb",
               "name": "Liv Ullmann",
               "profile_path": "/5u8fikv8ANDx5FJhLtvhZmBZtRa.jpg",
               "id": 11916,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Peter Latham",
               "gender": 2,
               "credit_id": "52fe4603c3a36847f80e75bf",
               "name": "Edward Albert",
               "profile_path": "/x5eV2vwDUOR2rA1mzYJ2fhnX28H.jpg",
               "id": 41218,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Billy Boylan",
               "gender": 2,
               "credit_id": "52fe4603c3a36847f80e75c3",
               "name": "Gene Kelly",
               "profile_path": "/xbQZidMyhviuLmI1h8cJoJ7F1LV.jpg",
               "id": 13294,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Maud Ericson",
               "gender": 1,
               "credit_id": "52fe4603c3a36847f80e75cd",
               "name": "Binnie Barnes",
               "profile_path": "/xdiLC7ICCk6LgzKuHQbQ2FpHuBk.jpg",
               "id": 80237,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Trina Stanley",
               "gender": 1,
               "credit_id": "52fe4603c3a36847f80e75d1",
               "name": "Deborah Raffin",
               "profile_path": "/aH0szm0XkxCpNSEndihvKJUGVZg.jpg",
               "id": 87120,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "J.D. Rogers",
               "gender": 2,
               "credit_id": "52fe4603c3a36847f80e75d5",
               "name": "Billy Green Bush",
               "profile_path": "/2SRq2WbO2YNGYHGp6hb0Bu8ef.jpg",
               "id": 35090,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Gabriella",
               "gender": 1,
               "credit_id": "5a4892c4c3a36818fb00d430",
               "name": "Claudia Jennings",
               "profile_path": "/eicX3cmq3EnnAC59CDO9dSl8ySU.jpg",
               "id": 45469,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Mrs. Margie Margolin",
               "gender": 1,
               "credit_id": "5a4893cf0e0a26489500e846",
               "name": "Nancy Walker",
               "profile_path": "/93RuE8xoIMmuWQ4H4qsql1gGiw7.jpg",
               "id": 47503,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Mr. Latham",
               "gender": 2,
               "credit_id": "5a4893dd925141031700d6c3",
               "name": "Don Porter",
               "profile_path": "/6ZICq6pp1CCyplymj3gMoa3ktvL.jpg",
               "id": 94294,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Mrs. Latham",
               "gender": 1,
               "credit_id": "5a4893ec925141031100e35a",
               "name": "Rosemary Murphy",
               "profile_path": "/mNrRc207chuOUgNizM0cmTfwDxP.jpg",
               "id": 8492,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Mrs. Adams",
               "gender": 1,
               "credit_id": "5a4893f8925141031700d6cb",
               "name": "Natalie Schafer",
               "profile_path": "/hOrXYR4RmpFFwRjv4h9ayeTSt9N.jpg",
               "id": 7643,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Arthur Forbes",
               "gender": 2,
               "credit_id": "5a489418925141030e00dfc4",
               "name": "Sam Chew Jr.",
               "profile_path": null,
               "id": 105622,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Polly",
               "gender": 0,
               "credit_id": "5a4894260e0a26489200e29c",
               "name": "Brooke Palance",
               "profile_path": null,
               "id": 160589,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4603c3a36847f80e75b7",
               "name": "Milton Katselas",
               "profile_path": null,
               "id": 213341,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4603c3a36847f80e75c9",
               "name": "Leonard Gershe",
               "profile_path": null,
               "id": 218437,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58f9348e92514122180016c6",
               "name": "M.J. Frankovich",
               "profile_path": "/72g1p035ipyZaV3NglZFgtRkaey.jpg",
               "id": 1293412,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58f93497c3a3683949001646",
               "name": "Michel Legrand",
               "profile_path": "/ewYlyU0UvONnt7jjHhaSXCKVHVa.jpg",
               "id": 10934,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58f9349ec3a368396b001549",
               "name": "Charles Lang",
               "profile_path": "/1k74XckQqxOwdPYvhvhEdZ9jl4l.jpg",
               "id": 3148,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58f934a892514122570015de",
               "name": "David E. Blewitt",
               "profile_path": null,
               "id": 8863,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58f934b1c3a3683923001448",
               "name": "Robert Clatworthy",
               "profile_path": null,
               "id": 7306,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58f934bac3a36839d8001625",
               "name": "George James Hopkins",
               "profile_path": null,
               "id": 4126,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5a4894470e0a26489200e2b9",
               "name": "Julie Pitkanen",
               "profile_path": null,
               "id": 1371069,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.937057,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42456,
      "vote_count": 2,
      "budget": 0,
      "overview": "A forty year old woman who was vacationing in Greece meets a twenty-two year old, who was also on vacation. They spend the night together and she leaves him while he was sleeping. She then returns to New York and she is stunned to learn that her daughter's boyfriend is him. He then pursues her, and she is uncertain of what to do.",
      "similar": [
         132344,
         8346,
         37247,
         1966,
         11631,
         8055,
         2395,
         10604,
         13486,
         23049,
         24122,
         320588,
         43316,
         174321,
         4193,
         41280,
         53039,
         10582,
         345001,
         3784
      ],
      "original_title": "40 Carats",
      "runtime": 110,
      "poster_path": "/6Ncdm2AFQ7izCHsMPSMXZyI2bdN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Frankovich Productions",
            "id": 2102,
            "origin_country": ""
         }
      ],
      "release_date": "1973-06-28",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "She's a divorcee. She's forty. She's engaged... to a younger man.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Milton Katselas"],
      "runtime": 110,
      "synopsis": "40 carats is a diamond in the rough .... which centers around a 40's woman who goes on vacation in Greece finds love with a much younger man then abandons him to go back to her life in New York. However, she quickly finds out that her daughter is dating the same guy she left in Greece making for some awkward humorous and embarrassing moments . 40 Carats is not ha ha funny but the subtle adult humor in which it was handled makes it very funny. By todays standard, ullman would have just been passed of as silly sex starved cougar and the young male( albert) a stupid eye candy figure head. But 40 carats doesn't insult the audiences intelligence which would have been easy to do at that time. Instead it takes an intelligent and often funny look into age, gender double standards that still exist to this day to some extent. Gene kelly is so- so as Ullman's ex but the chemistry between liv Ullman and Edward Albert is what stands out. If you are into witty comedies with a dramatic flair 40 Carrats is definitely for you",
      "writers": [
         "Jay Presson Allen",
         "Pierre Barillet"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070068/",
      "coverLink": null,
      "actors": [
         "Liv Ullmann",
         "Edward Albert",
         "Gene Kelly"
      ],
      "reviews": [
         "\"40 Carats\" - a light and cheerful comedy is the only comedy I've seen Liv Ullmann in. She plays Ann Stanley, forty years old Manhattan Real Estate agent divorcée who lives with her mother and 16 years old daughter. On her vacation in Greece, she meets 22 years old Peter Latham (Edward Albert), and they spend the night together. Ann quietly disappears into the early morning hours, leaving him with the memories of the night and nothing else - no address or telephone number. Peter later returns to New York, where one evening he arrives to pick up a date for the evening. Guess, who his date's mother is? What follows is, IMO, funny and charming romantic comedy with wonderful supporting performances from Gene Kelly (as Ann's first annoying husband), Binnie Barnes and Deborah Raffin. I've read some comments that Liv was miscast and was not comfortable playing such a light comedy after all the profound and tragic characters she had played for Bergman. I don't think so. For me, one of the most memorable scenes of the film is the one after Liv (Ann) returns home from her vacation and is asked what Greece was like? Ann turns to face a camera, smiles, and says, \"Greece glows under the sun\" - but it is her face, her smile, her eyes that glow. If ever the saying, the eyes are the soul's mirror, is true, it is about Liv's eyes. There are kindness, tenderness, strength, and something even more attractive than beauty itself in them - the goodness of her soul. \"40 Carats\" was a very pleasant surprise for me. I hope that it will be released on DVD soon and become available for all admirers of Liv Ullmann and of funny and clever romantic comedies.",
         "In her usual intense style, Liv Ullmann gives a likable performance as \"40 something\" Ann Stanley. While vacationing in Greece, Ann has a chance meeting with \"20 something\" Peter Latham, endearingly played by Edward Albert. Much to Peter's disappointment, Ann quietly disappears in the early morning hours, leaving him with little more than a one night stand. Peter later returns home to New York, where one evening, as he arrives to pick up a date, his date's mother appears at the door and it is none other than Ann Stanley, his one night stand from Greece. This chance meeting sets the scene for some very awkward moments and great comedy. I've never found myself rooting for a \"May-December\" romance so enthusiastically. Gene Kelly, Binnie Barnes and Deborah Raffin are wonderful in their supporting roles. \"40 Carats\" is one of those films that was such a pleasant surprise for me and I've never understood why it has been so overlooked. Give it a chance. I think you'll really enjoy it.",
         "\"40 Carats\" is a surprisingly good movie. While Ullmann and Albert have little chemistry together, they nevertheless make a sweet pair, because they are both enormously appealing individually. Gene Kelly adds a few nice moments and leads a likable supporting cast. The film is slightly overlong but more mature than you might think.",
         "Based on a hit Broadway play that won a Tony Award for Julie Harris, 40 CARATS is a comedy about a 40-ish woman who is pursued by a 22-year-old man. Liv Ullmann, looking very pretty, stars as the New York City realtor who meets the young man (Edward Albert) while on vacation in Greece. By coincidence (and a big one) he meets her again when he shows up for a blind date with her daughter (Deborah Raffin). It turns out he's from a wealthy family which interests Ullmann's swinging mother (Binnie Barnes). Into this mix are Ullmann's first husband (Gene Kelly), her secretary (Nancy Walker), a hick from Texas (Billy Green Bush), a customer (Natalie Schafer), and Albert's parents (Don Porter, Rosemary Murphy). The plot revolves around the machinations and misconceptions of who is dating who and is it proper for Ullmann to marry a much younger man. Ullmann is good as the \"middle-aged\" woman. Albert is sort of creepy. Kelly is annoying as is Green Bush. Walker gets in a few zingers. Raffin is a blank. But in her final film appearance the 70-year-old Binnie Barnes (looking decades younger) steals every scene she's in as a swinging grandmother who's always borrowing Raffin's clothes and can't wait to hit the dance floor. This role was played by Glenda Farrell on Broadway.",
         "This a breezy comedy based on a hit Broadway play and one of the few worthwhile comic tales depicting the relationship between a younger man and an older woman. While on holidays, visiting Greece, a divorced real estate agent encounters by chance a vital young man, and they have a brief romantic interlude. She leaves him while he is sleeping and escapes back to New York. Regaining the cherrished stability she has conquered as a lady executive, she settles down on her lovely apartment where she lives with her daughter and her mother. Until - very much in the fashion of every Broadway farce there is - they receive an unexpected visitor. Peter Latham, the man our main character had an affair with while in Greece. But now, he is introduced as a friend of her daughter's. After constant bickering, they decide to get married, but will their relationship last? '40 Carats' is a light, entertaining and cheerful movie, filled with beautiful, rich people whose vain problems serve as the basis for an plot. The characters have social status written all over their foreheads and their reaction to the plot's major complications are clever one-liners encouraged by greek drinks and the prospect of a happy, happy ending. The film does not attempt to be deep, for it's subject is a rather delicate one - the producers were aiming for time-filling entertainment and they really did it. But this film suffers mostly from the miscasting of Liv Ullmann, Ingmar Bergman's norwegian muse. No matter how versatile the wonderful Ms. Ullmann can be, she is a rather indelible case of typecasting - used to play such profound characters whose heartaches and emotional flaws we can relate to, she seems uncomfortable portraying a futile woman whose psyche isn't that complex, after all. The one scene in which her character really makes the transition between a woman caught in a whirlwind of happenings and a woman whose pain is overwhelmingly intense, nevertheless, is a cinematic gem. In this scene she confronts her future in laws. Another highlight of the film is Michel Legrand's beautiful soundtrack that includes the love theme 'In Every Corner Of The World', and Gene Kelly's performance as Liv Ullmann's annoying first husband. All in all, this is a movie whose delicate subject provokes a barrier that keeps it from being a great film, but is, nevertheless, sheer cinematic delight.",
         "Thought provoking, eye-brow raising and VERY funny in all the right places! Long before Demi Moore walked out hand-in-hand, in Public, with Ashton Kutcher, this film went \"public\" with the possibility that a younger man, (who was strong, handsome and had both his own business and LOT of money already in his pocket!), could find an older woman, (who wasn't broken down or bitter about life!), attractive, desirable and worth \"fighting for\"! The romance between Peter Latham and Ann Stanley, (played with sensitivity and subtle humor by both Edward Albert, Jr., and Liv Ullman respectively), begins one dusky night in Greece and culminates after he accidentally finds her again in New York. Ann had originally gone to Greece for a bit of a \"final fling\" before she felt \"compelled by societal convention\" to settle into \"matron-hood\", (that time in life after having been a Wife and Mother, and now, with her marriage over, and her daughter grown; she was no longer \"on the market\" as it were for any of the \"usual\" things that most men supposedly wanted out of a woman... So, she'd just \"concentrate\" on running her own Interior Design business and \"forget\" about \"Love\" ever coming into her life again...) However, Peter's feelings were a bit bruised when he woke up the next morning after their romantic tryst, alone and went looking for Ann, thinking that he and she had just begun a wonderful relationship. Realizing that he'd been (essentially), sexually \"used\" by Ann, he chalked the night up to a \"wonderful fling\" that he'd just have to \"get over\". The real mayhem begins (again!), when Ann's daughter comes home one evening and announces that she's got a date with a friend of a friend.... And, yes... The man who shows up to go on the blind date with Ann's daughter is the man that Mom already got to \"know\"! Peter! Subtext and double entendres play out in a scene that is both hilarious, squirm-worthy and exciting all at the same time when Peter wants to know why Ann behaved \"so cowardly\" in regards to the way she left him in Greece. Peter wants to know why Ann would be so Puritanically inclined now that she's back in the \"real world\", and sets out to win her love all over again! Liv Ullman, (formerly directed by the legendary Ingmar Bergman!), is a most unlikely \"cougar\", and Edward Albert, Jr. a most decidedly un-cub-like \"cub\" in this priceless gem of a film. Everyone is of legal age, which only begs the question, \"Was society ever so truly closed-minded?\" The answer, sadly is, they still are! The only real problem with the film, here, is that it's NOT readily available anywhere!",
         "While vacationing in Greece, a 40-year old woman (Liv Ullman) has a one-night fling with a 22-year old (Edward Albert). She returns home to New York and meets him again when - surprise! - he comes to date her teenage daughter. I loved this movie when I first saw it in 1973; I was young and thought it was blissfully romantic. Watching the movie now with a more mature eye, I find it silly and off-putting. Ullman is stiff and bland and doesn't inspire lust in the slightest. Albert is sincere but sometimes creepy and pushy and there's no chemistry between them. His undying love for her seems juvenile and gee, what are the odds that he'd turn up a world away as her daughter's date? In an annoying subplot, Gene Kelly gives a hammy and embarrassing performance as Ullman's former husband. And I found it disturbing that the 17-year old daughter is paired romantically with a 43-year old man and the family is thrilled for her. *shudder* The movie, based on a Broadway play, looks and sounds very stagy with artificial, phony dialogue and there is a laughable go-go dancing scene that definitely dates the film. Not recommended.",
         "When I was 20 and first read this story I loved it. Then I saw the movie and was charmed by Liv Ullman, Edward Albert, and the rest of the cast. (Binnie Barnes was a Ziegfield Girl! Gene Kelly dances the twist!) Now, over 30 years later, I have watched it more times than I can count. OK, so you know the story from the plot synopsis. Whoever says there is no chemistry between the two leads doesn't have the same nervous system that I have. However, there is one glaring problem: for a 40-year-old woman to be interested in a 22-year-old, he must be a pretty incredible and \"mature\" guy. But Albert's character consistently descends into childish argument and even name-calling when Ullman disappoints him. (\"You don't know what you want.\" and \"You are a silly, helpless woman...\") This would be an unbeatable romance if there was more depth to his character and more development of their relationship. It's not chemistry that's missing, it's any evidence of true intimacy. And that is a flaw of the script, not the casting. Still, with a \"willing suspension of disbelief\", it is a charming romance and a chance to see Liv Ullman be happy.",
         "Beautiful 36, no\u0085 38, no\u0085 39, no\u0085 40-year-old Liv Ullmann (as Ann Stanley) from Norway originally is driving through gorgeous Greece when her car overheats. Along comes handsome 22-year-old Edward Albert (as Peter Latham) from Pittsburgh, USA on a motorcycle. Believing herself too old to ride a motor bike, Ms. Ullmann instead strips down to her underwear for a swim with Mr. Albert. One thing leads to another and they have sex on the beach. Perhaps feeling a little old and out of sorts after the act, Ullmann leaves Albert while he sleeps... Back home in New York, guess who arrives to pick up Ullmann's daughter for a date? At first this seemed like it was going to be a drama, but it's obviously a comedy by the time Ullmann and Albert meet in New York. It probably would have been funnier if a woman more experienced in situation comedy played Ullmann's part, but the film does garner some chuckles. Although Albert does look like the younger of the two, the age difference seems more like ten than twenty years. Ullmann appears closer to Albert's age than she does to ex-husband Gene Kelly (as Billy Boylan). Respected elder Binnie Barnes (as Maud Ericson) does well in her last feature. ****** 40 Carats (6/28/73) Milton Katselas ~ Liv Ullmann, Edward Albert, Gene Kelly, Binnie Barnes",
         "After \"Butterflies are Free\" and \"40 carats\" it seems a mystery that Edward Albert Jr didn't continue to make such good films. This film is what \"The Graduate\" should have been, a sympathetic study of inter-generational relationships.",
         "As a 40-ish divorcée courting a 22-year-old man, Liv Ullmann (beautiful Norwegian actress in only her second American film) looks like a deer caught in the headlights. She's much too shaky and insecure to warm up to, and her scenes with Edward Albert have no romantic lift (this isn't all Liv's fault, Albert pushes his moments with her in a creepy way, coming off like an overripe gigolo). The good supporting cast includes Binnie Barnes and Deborah Raffin; Gene Kelly is lively playing Liv's ex-husband, although he is forced to go-go dance (such were the times). A wan, somewhat exhausted piece of fluff from the play by Pierre Barillet and Jean-Pierre Grédy. *1/2 from ****",
         "After all that sturm und drang for Ingmar Bergman, Liv Ullmann tackled a comedy, Forty Carats, based on the hit Broadway play. It originally starred Julie Harris (succeeded by June Allyson, Joan Fontaine and Zsa Zsa Gabor), with Gretchen Corbett as her daughter, and Glenda Farrell as her mother. It later became a summer stock vehicle for actresses such as Lana Turner, Ginger Rogers, June Lockhart, and others. Forty year old Norwegian-American divorcée Ann Stanley (Ullmann) is a successful real estate broker. She lives with her mother (Binnie Barnes) and her daughter (Deborah Raffin). Ann's ex-husband is an actor, Billy Boylan (Gene Kelly) and she hasn't had any romance since their breakup. While in Greece, she meets a 22-year-old young man, Peter Latham (Edward Albert) and the two sleep together on the beach one night. Embarrassed, Ann leaves without saying goodbye. When she meets him again in New York, he still wants to be with her. Ann is not able to deal with the age difference, and her mother wants her to take up with a wealthy southerner who is after her, J.D. Rogers. When it was to be directed by William Wyler, many top stars, such as Audrey Hepburn and Elizabeth Taylor, were up for the role. For me, Liv Ullmann, as likable, lovely, and beautiful as she is here, was not quite right for this role. For one thing, I had trouble understanding her English. For another, she is not adept at comedy. They say a great comedian can do drama but not vice versa. Also, there was not much chemistry between Ullmann and Albert. Both he and Deborah Raffin died too young. Albert only a year after his father. He is very good and at the peak of his career here. The stunning Deborah Raffin is a good Trina. This was Binnie Barnes' last film, and she and Raffin played well off one another. Gene Kelly was over the top. I think this could have been directed with a stronger hand. Nowadays, 40-year-old women sometimes do date younger men so it's not such a big deal, and Ullmann looked like 40-year-olds look today, meaning she looked younger than what we used to think of as 40. This is a sweet film about the heart wanting what the heart wants, and that love can sneak up on you when you least expect it under less than ideal conditions.",
         "I do love this little film. I also think Edward Albert is the only actor is this film who isn't overacting. Or miscast. I could watch this film all day, just to watch Edward. He has to be about the most beautiful young man ever put on the planet. In this film he is charming and a complete breath of fresh air, however quaint that may sound. The premise of a woman old enough to be the man's mother become romantically involved was BIG at the time. When the scene is relaxed and the acting natural, it's a lovely film to watch. In scenes of awkward overacting, Edward stands out as a natural, his uniqueness, talent and intelligence radiate from his face. I am not so sure of the comedy rating of this film. It's actually quite serious part of the time. I wish he had been given more excellent parts to play throughout his career.",
         "I first saw this movie when I was in high school in the 70's. I love old movies and have an extensive DVD library. This movie takes me back to high school memories. I took a movie class in high school and this was the first movie I ever saw with this actress. I collect all kinds of movies and this one will soon be in my collection. This is my first writing of any comment on movies that I have seen or would like to see. I saw an article in a book about Liv Ullman and got to thinking of movies I have seen her in in the past. 40 carats was one of them. I just wanted to say thanks for the opportunity to let me write to you and tell you this.",
         "Where to begin? Pretty much everything about this movie is absolutely dreadful. The plot is a shallow fairy-tale with the most improbable twists and turns, and its central theme - that where true loves reigns, age difference simply does not matter - is just plain silly. By way of proof we have a recent high school graduate fall in love with and marry a 43 year old multi-millionaire from Tulsa, Oklahoma, and 40 year old Liv Ullmann fall in love and marry 22 year old Edward Albert, by coincidence the son of another multi-millionaire. All of that is bad enough, but what really put me off is the way Ullmann - an obviously sensitive and intelligent woman - is shown as being overcome and indeed pushed around by a creepy guy with no personality who grabs at her to \"help her undress\" and is just generally obnoxious in his self-satisfied smugness. Ullmann looks attractive enough to make her a plausible love object for a 22 year-old, but the other way around? Goodness! Her acting is at least better than that of the rest of the cast, which is really not saying much. To round it all off Gene Kelly gives a hammy performance as Ullmann's ex-husband. So - terrible on every level: plot, acting, message. Zero stars if that option were available.",
         "Liv Ullman, lovely in a series of chic early-'70s outfits, is not quite right for the cougar part played memorably onstage by Julie Harris (and Lauren Bacall on tour). She never relaxes, she doesn't look like she's having fun, and the chemistry between her and Edward Albert, as the 22- year-old she falls into bed with, is hardly overwhelming. The miscasting doesn't end there, with Gene Kelly rather creepy as the weak but loving ex-husband who sets things right for the mismatched couple; not for the first time, he seems more in love with himself than anyone around him, and it's embarrassing to watch his character try and pass himself off as 40. Some good character actors hang around and do what they can to make the stage machinery work-- Binnie Barnes, Don Porter, Nancy Walker--and there's some picturesque Greek location filming, and a pretty Michel Legrand theme. But the stage-rhythm dialog doesn't resonate, the outcome's never in doubt, and Liv looks like she'd be much happier being miserable in an Ingmar Bergman opus."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures",
         "Frankovich Productions"
      ],
      "summaries": [
         "Forty year old Norwegian-American divorcée Ann Stanley owns her own Manhattan based real estate agency specializing in upscale Manhattan apartments. She lives with her seventeen year old daughter Trina Stanley, and her mother, Maud Ericson, who acts more the teenager than Trina. Largely because of her uptight and regimented attitude, Ann has had no love in her life since divorcing her ex-husband, character actor Billy Boylan, an irresponsible man who she still loves as a friend and who she sees whenever he is in town between acting jobs and whenever he needs money from her. Ann's uptight attitude seems to have softened slightly ever since returning from a trip to Greece with Maud. What she has not told anyone is that her softened attitude is from a romantic one night only liaison with a young American man she met by happenstance by an out of the way Greek beach, he who tried to get her to be more carefree, if only for that one night. Purely by coincidence, she meets that man again in New York. He is twenty-two year old Peter Latham, a steel heir who is an acquaintance of Trina's. While Ann's family and friends encourage her to pursue a relationship with a wealthy southern gentleman client named J.D. Rogers, Peter pursues Ann behind the scenes, while Maud believes Peter wants to court Trina. Peter is falling in love with Ann. Although she admits she is flattered by Peter's declaration, Ann may not be able to get over the difference in their ages, regardless of what she may be feeling about him. If she can let go of that repressed attitude, she may give herself the opportunity to examine if she truly does have romantic feelings for Peter, and what to do about them if they do exist. Dealing with an issue with Trina, discussing Billy's own life with him, and meeting Peter's friends and family may give Ann some insight into the matter.",
         "A forty year old woman who was vacationing in Greece meets a twenty-two year old, who was also on vacation. They spend the night together and she leaves him while he was sleeping. She then returns to New York and she is stunned to learn that her daughter's boyfriend is him. He then pursues her, and she is uncertain of what to do."
      ],
      "budget": 0
   },
   "movielensId": 108658,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-06-28",
      "dvdReleaseDate": null,
      "directors": ["Milton Katselas"],
      "runtime": 110,
      "movieId": 108658,
      "title": "40 Carats",
      "mpaa": "",
      "actors": [
         "Liv Ullmann",
         "Edward Albert",
         "Gene Kelly",
         "Binnie Barnes",
         "Deborah Raffin",
         "Billy Green Bush",
         "Claudia Jennings",
         "Nancy Walker",
         "Don Porter",
         "Rosemary Murphy",
         "Natalie Schafer",
         "Sam Chew Jr.",
         "Brooke Palance"
      ],
      "imdbMovieId": "0070068",
      "originalTitle": "40 Carats",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["KkqHlZ4z3oY"],
      "plotSummary": "A forty year old woman who was vacationing in Greece meets a twenty-two year old, who was also on vacation. They spend the night together and she leaves him while he was sleeping. She then returns to New York and she is stunned to learn that her daughter's boyfriend is him. He then pursues her, and she is uncertain of what to do.",
      "tmdbMovieId": 42456,
      "avgRating": 5,
      "releaseYear": "1973",
      "numRatings": 1,
      "posterPath": "/6Ncdm2AFQ7izCHsMPSMXZyI2bdN.jpg"
   }
}