{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1347508",
      "video": false,
      "title": "America",
      "recommendations": [],
      "backdrop_path": "/okV6yqFV5XF28jiPnJZHKf1Aa0s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "America",
               "gender": 0,
               "credit_id": "52fe443ac3a368484e016f0b",
               "name": "Philip Johnson",
               "profile_path": null,
               "id": 1012155,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Dr. Maureen Brennan",
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016f0f",
               "name": "Rosie O'Donnell",
               "profile_path": "/76ZWoNK1Fr6gmJUH1zhEBMsT9DT.jpg",
               "id": 12929,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mrs. Harper",
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016f13",
               "name": "Ruby Dee",
               "profile_path": "/hadVr5kdeqlorRmjaMhHAutTbAm.jpg",
               "id": 15532,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Brooklyn",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016f1b",
               "name": "Jade Yorker",
               "profile_path": "/4r68bJfIHuPn2SbhaFigSV0zlQ.jpg",
               "id": 59011,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Reggie Harper",
               "gender": 2,
               "credit_id": "53e9aed1c3a3680ec4000795",
               "name": "Tim Rhoze",
               "profile_path": "/jFqWxa3tihTRU5ero9Y0e3MF81x.jpg",
               "id": 1226519,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016ef5",
               "name": "Yves Simoneau",
               "profile_path": null,
               "id": 74566,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016efb",
               "name": "Joyce Eliason",
               "profile_path": null,
               "id": 27147,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016f01",
               "name": "Rosie O'Donnell",
               "profile_path": "/76ZWoNK1Fr6gmJUH1zhEBMsT9DT.jpg",
               "id": 12929,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe443ac3a368484e016f07",
               "name": "E.R. Frank",
               "profile_path": null,
               "id": 1012154,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.982765,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22264,
      "vote_count": 2,
      "budget": 0,
      "overview": "In \"America,\" Dr. Maureen Brennan, a psychiatrist at a youth treatment center, encounters her newest patient, a bi-racial boy named America. Through their sessions, Dr. Brennan helps America come to terms with his roller-coaster life, which began when he was taken by authorities from his crack-addicted mother, and placed into foster care as an infant. The short time of stability in his life occurred when America lived with Mrs. Harper, the elderly nanny to one of his foster families. Later reunited with his mother, she soon abandons America and he is again placed into foster care. Lagging behind in school and full of anger, America retreats further away from society after years of sexual abuse. After attempting suicide, America is placed in a treatment center where Dr. Brennan helps him open up about his painful past and discover the support and courage he needs to get his life back on track.",
      "similar": [],
      "original_title": "America",
      "runtime": null,
      "poster_path": "/hbLZy6m2VkuoGG3BCNVS4zpN9xt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2009-01-01",
      "vote_average": 2.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yves Simoneau"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Joyce Eliason",
         "Rosie O'Donnell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1347508/",
      "coverLink": null,
      "actors": [
         "Philip Johnson",
         "Rosie O'Donnell",
         "Ruby Dee"
      ],
      "reviews": [
         "I just came from an advance screening (this film will air on Lifetime on 2/28/09) and recommend this film highly. This film follows the story of America, a 17-year-old boy who was part of the foster-care system, but now is housed in a state-run residential facility. Rosie O'Donnell plays the counselor who tries to break through America's walls enough for him to trust her with the secret burden he carries. Rosie's performance was understated and brilliant and Ruby Dee is magnificent as Mrs. Harper, the grandmotherly source of the little bit of love that America has ever known. The other residents of the facility also turn in wonderful performances-- archetypes but not stereotypes. The young man cast as America had never acted before. After seeing dozens of young actors, Rosie found him in a diner TWO DAYS before principal photography was set to begin. What a find. Though the horrors of America's past are telegraphed early via dissociative flashes of memory and images of Mount Everest (America's 'quiet place'), sickened gasps could still be heard in the audience as the events unfold, and most of the crowd had shed tears before the closing credits rolled. If you have any association with the foster-care system, you MUST see this film. If you are unaware of the statistics, the epilogue of the film will educate you-- and break your heart. I smell Emmys.",
         "America was the name of this older teen in the foster care system. This movie was very powerful as you could see via the flashbacks that America had been loved at one point in his young life and longed for love again deep down though he acted like he didn't care about anything. Why don't more people foster kids I wonder? So many horror stories in the news are about horrific events done to and by foster kids. And so many TV shows show the negative side of it as well. My husband and I fostered our daughter before she was available for adoption. And yes we took a chance that we may lose her. But it was worth it. She needed love then when she was a foster kid as well as now. I hope more people watch this movie and gain some empathy for the kids that need our love and support.",
         "This aired on TV, and I merely found myself interested in the unusual title. I looked it up once I saw it in the listings a few hours before it came on, and I hoped it was good once I read up on it a little. It is. The opening and closing monologues are cheesy, and it can be corny here and there, but other than that, this is marvelous. I've never really had a problem with Rosie O'Donnell; well, not as big of one as everyone else seems to. She's not that much of an actor(she's fine here, though), no, but neither are many of the current big Hollywood stars. And fortunately, in this, she is not irritating. Every other performance is impressive, particularly the lead(how was this kid undiscovered?), who is *amazing*. The characters are all well-written and credible. I was very glad to find this immensely psychologically accurate and realistic. This is a genuinely sweet, very emotional and effective drama. It is intense whenever it goes for such. The music is great and fitting. There is some humor in this, a bit of it black comedy. This has surprisingly well-done editing and cinematography; it stops short of being flashy, and works well. There is a lot of disturbing content and occasional violence in this. I recommend this to anyone who wants a believable story of the often tragic lives of foster kids. 9/10",
         "America is an insightful docu-drama about the foster care system in America. A well-thought script, and a well-executed film. America is a troubled kid, living in a foster care. He was introverted, and hid his emotions from everyone. And he kept mum when asked, and showed no emotions when perused. He needed somebody he can trust for him to be open about himself, and that is proved hard to do. However, he was lucky as he had a counselor who tried to befriend him. Yes, it was not easy, but even the toughest of steel can be mold. He began to be open about himself, and letting the counselor knew of his past. Of the sexual abuse he was subjected to, of the betrayal of his 'protectors', and of the tragedy that caused his dad's life. All told in absolute beauty. The retrospectives images were being shown, and one would be hard-pressed not to be sympathetic of him. A great performance by all the characters, especially Rosie O'Donnell. She projected a very convincing counselor, with a heart of gold. The film ends with a phrase; 2 out of 10 of the kids in foster won't make it once they are out of it. They are either in prison or dead. A very brutal statistic, and a statistic not to be taken lightly. We can make a change, and it must start now!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Sony Pictures Studios"],
      "summaries": ["In \"America,\" Dr. Maureen Brennan, a psychiatrist at a youth treatment center, encounters her newest patient, a bi-racial boy named America. Through their sessions, Dr. Brennan helps America come to terms with his roller-coaster life, which began when he was taken by authorities from his crack-addicted mother, and placed into foster care as an infant. The short time of stability in his life occurred when America lived with Mrs. Harper, the elderly nanny to one of his foster families. Later reunited with his mother, she soon abandons America and he is again placed into foster care. Lagging behind in school and full of anger, America retreats further away from society after years of sexual abuse. After attempting suicide, America is placed in a treatment center where Dr. Brennan helps him open up about his painful past and discover the support and courage he needs to get his life back on track."],
      "budget": 0
   },
   "movielensId": 108672,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": null,
      "directors": ["Yves Simoneau"],
      "runtime": 0,
      "movieId": 108672,
      "title": "America",
      "mpaa": "",
      "actors": [
         "Philip Johnson",
         "Rosie O'Donnell",
         "Ruby Dee",
         "Jade Yorker",
         "Tim Rhoze"
      ],
      "imdbMovieId": "1347508",
      "originalTitle": "America",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "In \"America,\" Dr. Maureen Brennan, a psychiatrist at a youth treatment center, encounters her newest patient, a bi-racial boy named America. Through their sessions, Dr. Brennan helps America come to terms with his roller-coaster life, which began when he was taken by authorities from his crack-addicted mother, and placed into foster care as an infant. The short time of stability in his life occurred when America lived with Mrs. Harper, the elderly nanny to one of his foster families. Later reunited with his mother, she soon abandons America and he is again placed into foster care. Lagging behind in school and full of anger, America retreats further away from society after years of sexual abuse. After attempting suicide, America is placed in a treatment center where Dr. Brennan helps him open up about his painful past and discover the support and courage he needs to get his life back on track.",
      "tmdbMovieId": 22264,
      "avgRating": 3,
      "releaseYear": "2009",
      "numRatings": 2,
      "posterPath": "/hbLZy6m2VkuoGG3BCNVS4zpN9xt.jpg"
   }
}