{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "surfing",
            "id": 5349
         },
         {
            "name": "sport",
            "id": 6075
         }
      ],
      "imdb_id": "tt1714833",
      "video": false,
      "title": "Drift",
      "recommendations": [
         54415,
         380856,
         178946,
         26306,
         346684,
         60270,
         292022,
         353125,
         246011,
         327385,
         244536,
         291155,
         54985,
         278990,
         23703,
         269026,
         42626,
         267433,
         214218,
         96246
      ],
      "backdrop_path": "/soQabvqiZSqvycVkEgXoZi0OiTu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "JB",
               "gender": 2,
               "credit_id": "52fe4c3cc3a368484e1ae225",
               "name": "Sam Worthington",
               "profile_path": "/9XzAE3ZnCnazub4xrSY8YBN7sNq.jpg",
               "id": 65731,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jimmy Kelly",
               "gender": 2,
               "credit_id": "52fe4c3cc3a368484e1ae229",
               "name": "Xavier Samuel",
               "profile_path": "/wvRmKI24GbAT3LJf0JihCEq3rMs.jpg",
               "id": 109438,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lani",
               "gender": 1,
               "credit_id": "52fe4c3cc3a368484e1ae22d",
               "name": "Lesley-Ann Brandt",
               "profile_path": "/6Yc7kQRUt9h8Agh2LNJAbi7l69c.jpg",
               "id": 515875,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Young Andy Kelly",
               "gender": 2,
               "credit_id": "52fe4c3cc3a368484e1ae231",
               "name": "Sean Keenan",
               "profile_path": null,
               "id": 962109,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Kat Kelly",
               "gender": 1,
               "credit_id": "52fe4c3cc3a368484e1ae235",
               "name": "Robyn Malcolm",
               "profile_path": "/2uA4eYHrV1zwlbJBz0KCEaRDOTk.jpg",
               "id": 125938,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Andy Kelly",
               "gender": 0,
               "credit_id": "52fe4c3cc3a368484e1ae239",
               "name": "Myles Pollard",
               "profile_path": "/2QpPExPYMqkMvjOTUbkNis1IlND.jpg",
               "id": 190856,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gus",
               "gender": 0,
               "credit_id": "52fe4c3cc3a368484e1ae23d",
               "name": "Aaron Glenane",
               "profile_path": "/ggkDaQnKXWDbcMpdQzIVLotvX9y.jpg",
               "id": 1203030,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c3cc3a368484e1ae21b",
               "name": "Morgan O'Neill",
               "profile_path": "/jERjQ7tNtGgVfiPm6TFLufNPrWL.jpg",
               "id": 75753,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c3cc3a368484e1ae221",
               "name": "Ben Nott",
               "profile_path": "/jGXE8fASkWF4XZO0XNiJaaObu9j.jpg",
               "id": 1107980,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55191f06c3a3682aa8000d09",
               "name": "Morgan O'Neill",
               "profile_path": "/jERjQ7tNtGgVfiPm6TFLufNPrWL.jpg",
               "id": 75753,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 7.259348,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 137968,
      "vote_count": 72,
      "budget": 11000000,
      "overview": "In the 70s two brothers battle killer waves, conservative society and ruthless bikers to kick-start the modern surf industry.",
      "similar": [
         9655,
         9291,
         22881,
         8923,
         2300,
         10637,
         43959,
         323677,
         10474,
         9563,
         2323,
         86130,
         13416,
         5925,
         1374,
         612,
         9390,
         8456,
         70,
         73
      ],
      "original_title": "Drift",
      "runtime": 113,
      "poster_path": "/ovqcCkgRDhbzGhpm2ih0afdUTJt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "World Wide Productions",
         "id": 1286,
         "origin_country": ""
      }],
      "release_date": "2013-05-02",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Two Brothers. One Dream. No Rules.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": [
         "Ben Nott",
         "Morgan O'Neill"
      ],
      "runtime": 113,
      "synopsis": "In the early 1960s the broke and fatherless Fisher family drift across the southern coast of Australia looking for a place they can call home. Jimmy nearly drowns in an accident and becomes withdrawn from the traumatic experience. Elder brother Andy fights to protect Jimmy from tough local kids while their mother, Anna, fights to put food on the table. Andy and Jimmy are inspired by a local surf photographer, JB to create their own surf gear. After struggling to gain acceptance by the local surf community, the two brothers then struggle to realize their dream: building a lifestyle and business out of the sport they love.",
      "writers": [
         "Tim Duffy",
         "Morgan O'Neill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1714833/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNzMxNjg0Ml5BMl5BanBnXkFtZTcwOTM0OTU5OQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Myles Pollard, Xavier Samuel, Sam Worthington | See full cast and crew »"],
      "reviews": [
         "There's been plenty of surf films and documentaries over the years, and if you're a surfer or surfing fan, no doubt you've seen them all. Drift is the latest surf film paying tribute to and giving us a glimpse into the Australian surf life when popular surf brands were just beginning. Set in Western Australia in the early 1970's, Drift is the story of surfer brothers Andy and Jimmy Kelly (Myles Pollard and Xavier Samuel). Andy is dissatisfied with working long hours at the local mill, while trying to keep younger brother Jimmy from a life of crime. With help from their mother Kat (Robyn Malcolm), and childhood friend Gus (Aaron Glenane), they start a surf shop in their backyard garage, making custom-made wetsuits and new surfboards. Along the way they meet and get inspiration from surfer photographer/filmmaker JB (Sam Worthington) and his Hawaiian friend Lani (Lesley-Ann Brandt). Their success and hard work comes at a price though as they deal with members of the community who are not ready for their innovative ideas and trouble from a violent bikie gang. The acting is fine all round. Myles Pollard, who also co-produced the film, is solid as the responsible older brother. Xavier Samuel, in one of his best performances, brings charisma and energy to his role. Sam Worthington is excellent. He is perfect as the free-spirited hippie. He seemed to enjoy this role more than some of his recent work and it was wonderful to see him in an Aussie film again. The film does a great job of bringing the 70's back to life. You gotta love JB's colourful bus and the classic kombi vans! The surfing photography is exciting and breathtaking, and the cinematography by Geoffrey Hall is simply beautiful. The soundtrack, a mix of 70's classics and more recent tunes, really adds to the cool laid back vibe. Directed by Ben Nott and Morgan O'Neill, Drift is well-paced and there's a lovely balance between the surfing scenes and the dramas of everyday life. I honestly would've loved to have seen a few more surfing scenes. And even if you're not interested in surfing, this honest Australian film will inspire and engage. The cast and crew looked like they had fun making this film and it shows. A snapshot into the Aussie surf life, it was a highly enjoyable and upbeat movie experience.",
         "Wow! Volunteered for CinefestOz and ended up being able to stay and watch the movie premiere! The opening scene creates an unexpected tension with the mother and the young brothers heading off in darkness. They drive and drive and end up at overlooking what appears to be the Margaret River beach and its seems like their fate lies in the region. It not easy fitting into a tight knit community and the boys find it difficult though they find do find a friend who's pretty good at fixing up boards. Cut to years later, with surfing still a big part in the life of the Kelly brothers, though Andy now works at the mill while younger brother Jimmy gets in with the wrong crowd. Poor Mum spends lots of time drinking tea or coffee at the sewing machine! JB is a surf photographer who drifts into the area and sets up camp overlooking the spectacular coastline. He is accompanied by Lani who both the boys begin to fall for. The movie coasts along at a slow pace mixing awesome surf photography interspersed with the drama unfolding to the final surf competition and showdown with the baddies, bank and promoter, and coming back to the beginning of the story when Jimmy saves Andy from drowning but the roles are reversed. The scenery in the film is breath taking and showcases the Margaret River region, including Augusta, Bunker Bay and Yallingup as places with pristine ocean and natural beauty. Like Red Dog, this will be an iconic Australian movie, honoring mates sharing waves, and the sentimental Aussie battler. From the speeches at the premiere, it is like a dream to the directors who have created something they are obviously stoked and proud of.",
         "Totally entertaining. We all know modern day culture even the surfer culture so I'll not expound on that. Just the surfing shots in this film make it a 10. Actng is excellent. At the beginning you're told: this is based on actual events, and it isn't hard to see why. We live in a world today where evil abounds... there are some good as well as bad choices in this film. Hopefully the viewers will comprehend the better decisions and if challenged in their life with such... will make the right choices. One can put all aside and just enjoy the surfing; which makes one want to leave the cities and live the life of the GREAT outdoors!",
         "this honest look at surfing and living in the 70's is not to be missed and you don't need to be a surfer to enjoy this classic piece of Australian cinema. beautifully shot from the land and in the ocean it draws you into the world of these two brother that are as different as chalk and cheese. but both love to surf. sam worthington plays a drifter hippy who become part of there lives.bring a women with him to add fuel to there little world. but it there love of surfing and doing a job you love not a job you have too do that make the movie so enjoyable. and it not a surf movie that dies the minute it leaves the beach, you follow these guys in and out of the water with as much interest. an all round great film that made me long for the beach and a simpler time.if you want to see a good Australian drama that not just made for TV check it out.",
         "I can't stop watching all these surfing films. I'm a huge fan of Chasing Mavericks and this was up to standard! It wasn't as good as Chasing Mavericks, but still really good, the old Hippie-Flower-Power thing is making it even better. The choice of actors/actresses was fantastic, Sam Worthington, Xavier Samuel and Lesley-Ann Brandt, just to mentions a few - did a really good job. This movie gave both joy and emotional moments and the contents were perfect. This movie is for a person who's in to surfing, and who likes the sixties. The film begins with black and white color effect, which shows us the past and then switches to color when they are grownup. Like I said the story is really interesting, and it gets even more interesting when you know it has happened! I recommend almost anyone to watch it, and especially you who've seen \"Chasing Mavericks\"!",
         "are you ready for this because i feel this will become a future cult classic if not a box office hit although it does have potential to get money and get critical reception.i was surprised when i saw this film running in Karachi Pakistan so i decided to catch the film today,believe me i am not into surfing or sports but this is quite possibly the best film i have seen. Plot: set in 1970s 2 brothers living in Australia who deals with a lot of problems with gang members,cops in their way but got big dreams to be kings in surf business. I've seen a different poster here saying this involved Zack Snyder which is totally wrong ,its was just a mistake i guess,there are films like blue crush & chasing mavericks I've seen good reviews about them still looking forward to seeing them drift is no other its similar concept but the approach took by the writers & the team of this film is shown through the second half of the film which lead to the satisfying climax.they shot it so well plus when legendary Panavision camera is with you what more you need. the cast is new but i really liked Myles Pollard & Lesley-Ann Brandt,there are also some scenes missing from the film i think because some IMDb pictures show it clearly,anyway this film is not only for surf fans but it can become anyones favorite,it does not need critical reception at all audience will decide that, a fine story is presented here,makes me want to explore more of this genre,its a treat for Australian cinema lovers my rating is 10/10 Drift 2013 goes in my list of personal favorite movies of the year for me , i totally recommend this film",
         "Drift is a breezy Australian surfing film that doesn't break any new ground or take too many chances but the surfing scenes are spectacularly photographed and the performances are as colourful as the scenery. Like many local films, it is extremely well made and acted with professionalism, even when the story isn't revolutionary. The opening scenes in the Sixties are filmed in black and white. This is a fine visual touch, recalling Oz the Great and Powerful, because when the film forwards past the childhood of its central characters Andy and Jimmy and enters the 1970s, the film explodes with vivid colours being cast over a giant wave. Riding this enormous wave is Jimmy (Xavier Samuel). Jimmy and his brother Andy (Myles Pollard) moved from Sydney to Margaret River in Western Australia with their mother Kat (Robyn Malcolm) to start a new life together. Andy works long hours in a timber mill, while his brother rides hard in professional surfing competitions. Seeing the lousy treatment of the older folks of the mill, Andy decides to quit his job and help start a surf shop with his brother, selling surfing gear like boards and wetsuits. This is at a time just prior to when surfing competitions started awarding serious prize money. Andy is angered to discover that Jimmy has done a small time job for some local bikie crims and urges him to return any stolen material. Yet these bikie thugs refuse to leave their friends alone and one of them becomes involved in drugs. Sam Worthington (Avatar, Clash of the Titans) plays a hippie surfer named JB, who befriends both the boys. JB's Hawaiian hippie friend Lani (Lesley-Ann Brandt) also takes a romantic shine to Andy. Beneath its sunny exterior, the film is about the relationship of these two brothers and poses the question of whether a hobby makes for a satisfying and financially sustainable living. The film has more than sand between its ears, realising that a compromise has to be made when it comes to approaching sport as an occupation. This is reflected by JB, who has the film's funniest and smartest line: \"Its Darwinian man. We adapt, we survive.\" It would be impolite to say that the story by Morgan O'Neill exists merely to showcase the surfing because there is more narrative than just sun. It's more of a question of the familiarity of many individual story elements. This is very much a rerun of the underdog story: the little business that could, faced against impossible odds like evil bikies and a stuffy bank manager. The bikies are a blessing and a curse for the film. They're total caricatures but also helpful in providing some danger to the script through some flat spots, where it feels as though there could be more risk involved. The bikies handout a few thuggish beatings and there is a drug subplot, which gives the film a grittier shade in contrast to lightweight, jovial tone and relaxed, pleasant performances. The film even retreats to that plot line where a contest is handily giving out a large monetary prize so that the little people can save the farm. Are these contests deliberately organised around places of low socioeconomics and general lucklessness? The organisers must have prior knowledge of people's banking woes, such is their convenience. I also couldn't see the necessity of the romance between the Lani and Andy. Lani serves to ties the global relations between Australian and the US neatly (in a perfectly square ending) but any potential conflict between the brothers never eventuates over her. What many people will see the film for are the stunning, exciting and beautiful surfing sequences, which are filmed by Rick Rifici and Rick Jakovich: two highly experienced and talented water cinematographers. Filmed with great width, there are some gorgeous and hair-raising waves showcased here. The actors in the film performed some of the surfing, while real surfers were employed as stunt doubles too. An interesting fact is that despite how vivid and colourful the film is, it was actually filmed in winter so that the waves would be bigger and therefore more dramatic. They're a huge part of a great looking movie so that even when the pacing slumps or the story seems corny, it's never been so easy to dive into the surf.",
         "Big surf, cool 70's vibe. Give this movie a chance, make popcorn and have a beer. Excellent surf photography, beautiful, rough coastline of Australia. You will enjoy this film if you remember the big boards and OP board shorts. Goes slow but gets better just like the waves!. There are great scenes where old style cameras and wetsuits are used. The actors are good, you will recognize one of the actors from the film 'Clash of the Titans'! The plot could use some help but the feel of the film is very hippie style. There is a few drug scenes but they didn't mess that up too bad. The surfing is definitely the best. Real pros in every scene with old boards used for the film to keep it true to the time. Enjoy dude!",
         "Expectations for the lowish-budget Aussie surfing film Drift were not pitched overly high. My local cinema's synopsis of the story about two brothers who 'spend their youth searching for the perfect wave�(dreaming) of a world where they can surf to live and live to surf' I pretty much felt sure what I was letting myself in for. But the film delivered more than was promised. The film has a lively start, with the brothers as young children arriving fortuitously at the Western Australian surf town which would become their home after the cross-continent drive from Sydney where their mother had executed a tense midnight flit for the three of them to escape their drunken brute of a father. The action quickly fast forwards to their young adulthood as they lead a laid back if dead-end lifestyle before realising they can make surfboards better than those commercially available, moulding them in the garage at their home as their seamstress mother starts fashioning custom-made wetsuits. Their ambitions to expand are constantly thwarted by a lack of funds, the myopic tendencies of the town's old world conservative bank manager and the unwanted attentions of the local constabulary suspicious of their motives and lifestyle. Matters are complicated by a feud with the local bikie-gang � also the town's drug suppliers. A talented, itinerant and very hirsute surf filmmaker, a slightly unconvincing Sam Worthington, arrives on the scene in his bus-come-home with an attractive Hawaiian companion befriending the brothers and giving them much needed support in their constant battles with the bikies and encouragement in their enterprises. The main characterisations within the film were well drawn. Myles Pollard gave a stand-out performance as the elder brother, Andy, whose drive and business acumen didn't impinge upon his enjoyment of the more flippant things in life. The younger, rather wayward and unreliable brother Jimmy was nicely played by Xavier Samuel with roguish charm. Their mutual attraction and rivalry for the Hawaiian girl was subtly underplayed. The story swept along at a good pace and remained surprisingly fresh and original until the film's showdown. In debt to the bikies after becoming unwittingly involved in a drug deal by an accomplice, the boys desperately need cash they don't have. But as luck would have it, there is an upcoming major surf competition on the horizon. If only this could be won and the cash prize used to get them out of trouble� Jimmy, the more talented surfer, has gone walkabout so it falls to Andy to register as a wild-card entrant and save both their dreams and business � as well as his unbroken legs. From that point onwards, we were in rather familiar territory. This is a small scale film, well aware of its limitations which on the whole punched nicely above its weight. It portrayed a dark side to the sleepy coastal town to a degree I had not expected. Cinematography from Geoffrey Hall was first rate capturing the beauty and awesome power of the surf. There is enough good surfing action to please the aficionados but not at the expense of developing story and characters. A sporadic glam-rock soundtrack was insufficient, possibly the result of budget restraints.",
         "Drift (2013) Drift is an Australian film based loosely on true events of two brothers during the 1970s and the birth and rise of the surf industry in Western Australia. Determined to escape a life of factory work and petty crime, Andy (Myles Pollard) and his wayward surf prodigy younger brother Jimmy (Xavier Samuel) decide to start their own surfing brand called 'Drift', which produces custom wetsuits and new shorter surfboards. Initially the business creates some excitement amongst the local surfing community, but the challenges of living in a conservative town begin to hinder their growth. They must overcome pressure from the local police, banks and even a gang of drug dealing bikers. It's surprising to also see 'Avatar' and 'Terminator: Salvation' star, Sam Worthington play a hippy drifter in a supporting role, who is supposed to represent the era's anti-establishment vibe. A lot of people are reluctant to watch Australian films as they are viewed by many as cheap and 'crap'. I had a similar view many years ago, but if you actually give them a chance, you will be surprised how many quality films have been made and don't receive the attention they deserve. Australia has produced an abundance of surfing movies and documentaries over the years, with its rich culture and history in contributing to the industry. This is the first time that I am aware of a movie focusing on the involvement in Western Australia however, as the attention is usually targeted along the east coast. This was a really pleasant surprise for me and has left me thinking about it for days after. Not that it was a mind blowing film, or one of the best Australian films made. Far from it. I just felt it was the perfect 'Aussie' film, compared to Baz Luhrmann's big budget flop 'Australia', which gave such a forced representation of the stereotypical Australian outback. Very different films I know, but this just seemed so real and authentic in contrast. Once again I hope I haven't hyped this up too much, but having entered into it with such little expectations, I really enjoyed it. Some of it is still pretty cheesy and the acting is a mixed bag. I thought the soundtrack was a standout featuring so many local bands, complementing the themes of the film. Considering the small budget the cinematography and camera work was superb. My Rating: 6.5/10 For more Movie and TV News, Reviews and Rumours go to: www.facebook.com/tvmovienews"
      ],
      "genres": [
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["World-Wide-Mind Films"],
      "summaries": ["In the 70s two brothers battle killer waves, conservative society and ruthless bikers to kick-start the modern surf industry."],
      "budget": 11000000
   },
   "movielensId": 108601,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-05-02",
      "dvdReleaseDate": null,
      "directors": [
         "Morgan O'Neill",
         "Ben Nott"
      ],
      "runtime": 113,
      "movieId": 108601,
      "title": "Drift",
      "mpaa": "R",
      "actors": [
         "Sam Worthington",
         "Xavier Samuel",
         "Lesley-Ann Brandt",
         "Sean Keenan",
         "Robyn Malcolm",
         "Myles Pollard",
         "Aaron Glenane"
      ],
      "imdbMovieId": "1714833",
      "originalTitle": "Drift",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["1w5Q3_qGp1Y"],
      "plotSummary": "In the 70s two brothers battle killer waves, conservative society and ruthless bikers to kick-start the modern surf industry.",
      "tmdbMovieId": 137968,
      "avgRating": 3.65,
      "releaseYear": "2013",
      "numRatings": 10,
      "posterPath": "/ovqcCkgRDhbzGhpm2ih0afdUTJt.jpg"
   }
}