{
   "tmdb": {
      "original_language": "nl",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "flanders",
            "id": 7722
         },
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "lgbt child",
            "id": 34333
         },
         {
            "name": "first love",
            "id": 157303
         }
      ],
      "imdb_id": "tt1625150",
      "video": false,
      "title": "North Sea Texas",
      "recommendations": [
         342,
         71208,
         24584,
         87380,
         4369,
         333968,
         12839,
         86549,
         26823,
         31978,
         132561,
         196446,
         248694,
         69746,
         224404,
         64631,
         158848,
         244063,
         103516,
         19375
      ],
      "backdrop_path": "/ev7aQyHCUlebr6MKjhVIQJeJK8l.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pim",
               "gender": 2,
               "credit_id": "52fe49e4c3a36847f81ac1b9",
               "name": "Jelle Florizoone",
               "profile_path": "/rtmYDeKlB91jYECVgVgTVJGk3tj.jpg",
               "id": 1026090,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gino",
               "gender": 2,
               "credit_id": "52fe49e4c3a36847f81ac1bd",
               "name": "Mathias Vergels",
               "profile_path": "/fV4hU38dVYsAL46fAmAWVauKzcb.jpg",
               "id": 1026091,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Yvette",
               "gender": 1,
               "credit_id": "52fe49e4c3a36847f81ac1c1",
               "name": "Eva van der Gucht",
               "profile_path": "/z8Vk9ND15Eo7Cs0wqXLHKFKX6lY.jpg",
               "id": 228589,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Zoltan",
               "gender": 0,
               "credit_id": "52fe49e4c3a36847f81ac1c5",
               "name": "Thomas Coumans",
               "profile_path": "/qX7IC8pL1ClzA4usz0y4CT20dWa.jpg",
               "id": 1026092,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Etienne",
               "gender": 0,
               "credit_id": "52fe49e4c3a36847f81ac1c9",
               "name": "Luk Wyns",
               "profile_path": "/3yvRJjp4HKxRzmK0SqMKL35fnUj.jpg",
               "id": 218933,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sabrina",
               "gender": 0,
               "credit_id": "52fe49e4c3a36847f81ac1cd",
               "name": "Nina Marie Kortekaas",
               "profile_path": null,
               "id": 1026093,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Marcella",
               "gender": 0,
               "credit_id": "52fe49e4c3a36847f81ac1d1",
               "name": "Katelijne Damen",
               "profile_path": null,
               "id": 233884,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49e4c3a36847f81ac1b5",
               "name": "Bavo Defurne",
               "profile_path": null,
               "id": 143510,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53618f3c0e0a2649bf000719",
               "name": "Yves Verbraeken",
               "profile_path": null,
               "id": 1315545,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53618f440e0a2649b80008e0",
               "name": "Bavo Defurne",
               "profile_path": null,
               "id": 143510,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53618f4f0e0a2649bf000720",
               "name": "André Sollie",
               "profile_path": null,
               "id": 1315546,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.99426,
      "production_countries": [{
         "iso_3166_1": "BE",
         "name": "Belgium"
      }],
      "id": 100898,
      "vote_count": 77,
      "budget": 0,
      "overview": "Pim lives in a run-down house in a dead-end street somewhere on the Flanders coast, together with his mother Yvette Bulteel. Life here smells of cold French fries, cheap cigarettes, vermouth and stale beer. Mother Yvette uses her friend Etienne, with his lousy grey Fiat, as a driver for the nights she has to “perform”.  As a kid Pim dreams of a better life, imagining princesses and beauty queens. But when Pim turns 16 he dreams of Gino, the handsome boy next door, instead. Ever since they were children there has been this tension between them. Now Gino is Pim’s motorcycling hero. Cold mockery, little humiliations and tiny bits of hope make up Pim’s life. No wonder he sometimes flees to his dream world.",
      "similar": [
         449176,
         26371,
         11421,
         184352,
         376867,
         398818,
         26280,
         26933,
         338189,
         12795,
         84892,
         24584,
         428493,
         413666,
         13193,
         380874,
         10938,
         377154,
         47643,
         1213
      ],
      "original_title": "Noordzee, Texas",
      "runtime": 96,
      "poster_path": "/bc24mpqkZs3rWA4fGmne1Zxa5fD.jpg",
      "spoken_languages": [{
         "name": "Nederlands",
         "iso_639_1": "nl"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Vlaams Audiovisueel Fonds",
            "id": 39515,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Indeed films",
            "id": 93110,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mollywood",
            "id": 22071,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eén",
            "id": 7610,
            "origin_country": ""
         }
      ],
      "release_date": "2011-03-16",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "A teenage boy's search for love finds him fixated on the boy next door.",
      "adult": false,
      "homepage": "http://www.noordzeetexas.be/",
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bavo Defurne"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "André Sollie",
         "Bavo Defurne"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt1625150/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjg3MjU0NjQ0MF5BMl5BanBnXkFtZTcwOTEwNjc1OA@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Van den Heuvel, Eva van der Gucht, Thomas Coumans | See full cast and crew »"],
      "reviews": [
         "This is the story of Pim, a quiet, reserved gay Belgian boy, from the age of about ten (my guess, although he may be as young as seven or eight) to 17. In some ways, it is yet another coming-out or coming-of-age story, but it is extraordinary in so many ways that I hesitate to put it in that or any other category. It is very beautiful (both esthetically and emotionally), extraordinarily well written, produced, photographed, directed and - especially - acted. It is so far above the typical gay movie in every measure of quality that it really belongs in a class all its own. Telling what the movie is about does it a disservice, because - although even the story is not typical - HOW it tells the story is even more important than the story itself. It is a very well made and well acted movie that really must be seen to be appreciated, but since this seems to be the first review, I'll give it a shot. Pim lives with his bawdy, busty, blonde, unmarried mother Yvette near the North Sea and the French border. She is a semi-professional singer and accordion-player who is not unkind but prefers partying to mothering. As a result of her haphazard parenting, Pim spends considerable time on his own, often sitting quietly at a table by himself in a seaside roadhouse named Texas (which gives the movie its title) while Yvette plays and parties with her friends. Yvette has a companion named Étienne who does not live with her but drives her to gigs in other towns, who tries to be friendly to Pim but whom Pim clearly dislikes. The elements of coming out in this move are not related to Pim, who seems to take being gay for granted, even as a child, and never shows any discomfort or uncertainty about it at all. Both his mother and Marcella, the (also single) mother of his two friends Gino and Sabrina, accept him as he is, although Marcella cares for him more than his mother does. Since Yvette is often away, Pim spends a lot of time at his friends' house - so much that Marcella treats him as if he is her own son, and Pim's most important relationship is with Gino. Gino is three years older than Pim, and as Pim approaches his 15th and Gino his 18th birthday, they become lovers. Their love scenes together are extraordinary in not being salacious or stereotyped or stale or shocking in even the slightest degree. They are tender yet passionate and very, very beautiful; and I never once thought, \"I've seen this before.\" In fact, I never thought that at any point in the movie; it was as if I were watching a movie about gay teenage love for the first time. Gino is the one who has trouble coming out, and eventually he moves to Dunkirk to live with a French girl. (Except when the actor playing Pim changes, the passage of time is not clear in this movie; and when Pim and Gino next meet, the only way we know it's two years later is that Gino mentions that Pim will be 17 soon.) Pim is devastated that Gino has abandoned him with no warning. The entry of a young Gypsy named Zoltan distracts Pim from his grief momentarily, until it becomes obvious Zoltan prefers Yvette. I'm making this wonderful movie sound trite and dull, so I'm going to quit trying to tell what it's about. In essence, it's about a gay boy who has a LOT more sense and inner strength and is a LOT more stable and self-aware than anybody around him, and how his strength and patience dramatically affect the course of his life. As I said in the beginning, this movie is so good in so many ways that I could write pages about how good it is. But I will limit my praise to the actor who plays the older (14-17-year-old) Pim and the director who encouraged him to give such a strong, courageous, subtle but stunning performance. I believe the actor (whose name is Jelle Florizoone) was around 15 when the movie was made, and although he had worked on TV a little, this seems to be his first movie. But that kid carried this whole movie (because Pim really IS the whole movie) as masterfully and as effortlessly as Brando carried On the Waterfront or A Streetcar Named Desire. He is amazing. Fortunately for those of us who don't know Dutch, there isn't much dialog, so reading subtitles rarely distracts from watching the movie. But Florizoone is so good with his face and with his body that he really doesn't need words to tell us what's going on, any more than Brando did. It would be a beautiful performance from any actor at any age, but the fact that he's 15 years old (when even great child actors start to falter) makes it even more impressive. I've learned not to predict future stardom for young actors who give extraordinarily powerful performances in gay movies, because it never happens. But if any teenager working in movies today deserves to become a big star, Jelle Florizoone does. And if any director deserves a chance to make any movie he wants to make any way he wants to make it, Bavo Defurne does.",
         "A wonderful film about growing up gay and straight: discovering who you are, what love might mean, and learning to deal through trial and error with the world around you. Set in a lower class neighborhood near the Belgian coast sometime around 1960, the story follows a boy, Pim, and two slightly older neighbor children Gino and Sabrina, from about the age of six or eight until their late teens. Neglected by a mother who dreams of being swept off to romantic places, the younger boy is more or less adopted by the mother of the two neighbor children. The film resonates with an affectionate realism that does not treat kids as wholly innocent or without personal resources. It deals on every level with knowing who you are, and then dealing honestly with yourself and with others. In the course of the film, the children discard childhood fantasies in favor of a reality that provides scope for realizing their dreams. The cast is outstanding. The performances of Ben Van den Heuvel and Jelle Florizoone (PIm); Nathan Naenen and Mathias Vergels (Gino); Noor Ben Tahouet, and Nina Marie Koortekaas (Sabrina) as the young / teen aged children are incredible, especially given the age of the actors. Eva van der Gucht and Katelijne Damen play the mothers, in difficult roles - the one flighty and negligent, the other tired and without illusions. The cinematography is superb. It catches both the poetic beauty of the coastal dunes and wet lands as well as the drab reality of lower class neighborhoods in Belgium, with a color sensitivity that is at once realistic and emotive. The movie could have easily settled into maudlin sentimentality or romantic excess, but steered a course through difficult subjects with a mixture of restraint and realistic optimism. Following the showing, every person I talked with found the movie exceptional. Highly recommended.",
         "I'm so glad I took a chance and watched this movie. It was a very sweet gay coming of age film. I think just about every gay man can relate to this movie, and remembers what it was like to have that first crush on someone. I liked the fact that there was no violence in this movie. No one gets bashed or bullied. And it even had a nice ending! The lead character (Pim) was really quite excellent in the role. I really enjoyed the fact that, often, he didn't even have to say much and could convey everything he was thinking with a look. I wish there were more movies like this one. The kind that you watch, and want to see more after it's over. Check it out. You won't regret it.",
         "The 'coming-of-age' genre is really too broad to describe North Sea Texas, the first feature film from Belgian Director Bavo Defurne. There have been many films which portray the highs and lows of adolescent gay love, but few which do so in a way which draws you into their world in such an imaginative and creative way. The awkward silences, deserted roads and the long empty beach are symbolic of the emotional isolation of \"dreamer\" Pim. His only refuge being the place where he feels acceptance and understanding is with his 'surrogate' family - single mother Marcella, her daughter Sabrina, and son Gino - the subject of his love. Jelle Floorizoone, (Pim) carries the film with incredible maturity and professionalism, helped by an excellent cast of characters who add to the film's charm and depth. Empathy with Pim comes naturally, and many will have been down a similar road - though clever twists keep you guessing and, just when you think you know what's coming around the corner, it takes an unexpected turn. As the boys grow older Gino drifts away from Pim, into the arms of a French girl, culminating in a confrontation of rage on an empty wind-swept beach. \"Sometimes people have to make choices\" is Gino's excuse, but when his mother is taken seriously ill, he returns to find Pim at her side. Sometimes it takes the love of an understanding mother, through a simple gesture, to show that her son's choice may not be the right one. Having first seen North Sea Texas in the cinema earlier this year, and now again on DVD, it's a film that warrants repeated viewings. Like a painting, North Sea Texas has many layers: the more you look the more you see, understand & appreciate. Emotional and uplifting, North Sea Texas is one of the most engaging & original films about adolescent gay love since Danish Director Lasse Nielsen's ground-breaking \"You Are Not Alone\". Included on the DVD is a short but excellent Premiere Featurette and film trailer. Running time 01:34:19, format 2.35:1, audio Dolby Digital 5.1",
         "North Sea Texas is a beautiful, well-crafted and well-shot film. Wow, its been a while since I've seen such an amazing, unadulterated romantic journey. I'm not gay but regardless I fell in love with this film so much that I sat down to write a review here. So the premise goes like this... Its about a boy named Pim (I'm not familiar with Dutch/Flemish culture but having seen a few of their films I think a lot of guys are named Pim) who is kind of an introvert, a dreamer, doesn't talk much and spends a lot of his time drawing the things he loves. Young Pim meets a guy nearby, Gino who is three years older than him and eventually falls in love with him. There is also Gino's sister Sabrina, who is the same age as Pim and their mother. Pim's mother, Yvette, on the other hand is a feckless woman who spends most of her time drinking, singing and playing accordion at a local bar. Her entertaining skills have taken over her motherhood skills and clearly Pim doesn't like it. Then there is Etienne, a friend of her who pretty much escorts her and hangs out by the house all the time and Pim isn't a fan of him either. These troubles cause him to hang out at his best friend Gino's place all the time; and also at a local drinking hole called Texas, after which the movie's named. Gino's mother treats Pim like family and understands the fact that he is not lucky to have Yvette as his mother. If a write more I might just end up telling the entire story and BTW I didn't spoil anything for you. I just loved this film. The acting of everyone in the film was so immaculate that you can just feel the emotions of each of the characters. Sexual Frustration and coming-out is what this film is all about and its all so evident in all the actors' faces that you don't need to look at the subtitles below. The cinematography is breath-taking as it captures the lovely locales of the coast of North Sea in between scenes without taking our mind off the plot. A special mention to actor, Jelle Florizoone, who did a fabulous job playing Pim. He was actually one of about 200 teenage boys who auditioned for the part of Pim, and was the immediate choice for the filmmakers. This is his first film as an actor. The entire film rests on the character, Pim and his life and he just makes the character come alive. The maudlin displays of emotion, the cheekiness of teenage love, the heartrending feelings of his first heart-break... Oh he was great! Just because its a gay-themed film doesn't mean straight people shouldn't watch it. It is an excellent film or rather journey of Pim which mesmerises us to 'live' the characters in the film. Its a refreshing break over films where the characters indulge in a sleaze-fest all along and then, at the end, realise that love was here all along. Its a must watch for everyone who is tired of watching cheesy films, having the same story-line, over and over again...",
         "If you are down, try this movie. It's excellent creation of time and space. The actors are all believable.and this movie should have gone to the Oscars instead ! It would be nominated for best soundtrack, best picture, best actors, best photography. Suited from 12 years old. No violence. Compare it with 'Get Real', and 'A beautiful Thing' but better. It give an excellent idea how gay's explore their world in the 1950-1960's in Belgium.",
         "This film is about a quiet and introverted young boy in Northern Belgium, who falls in love with the boy next door. \"North Sea, Texas\" is a slow moving film, but it captures your attention by its great story telling. The story has little dialog, but a lot is told between the lines. Every action and every facial expression tells more than a thousand words. For example, the film tells viewers that the town is underprivileged by minor details such as Gino's mother pouring sugar sachets into a jar, and Pim's mother wearing the same dress almost every time she goes out. Towards the ending, there are scenes open to interpretation, leaving viewers to discuss what really happens. \"North Sea, Texas\" is more of a film to feel and empathise. It is well made, and will touch your heart.",
         "What beautiful film about love in all its forms. Love found, love lost, love unrequited. Your heart goes out to the central character Pimm. He lives in a single parent household with his mother but she is far more interested in going out and socializing than giving him any attention. At one point she is going out and for dinner she just tells him to open a can of sardines.He becomes infatuated with the handsome slightly older boy next door and at one point even jumps at the opportunity to move in with his family when his mother runs off with a new man leaving him behind only to find out that the boy he loves has grown up and also moved out of town.It does tend to be slow but I thought the slow build up just adds to the story. The final ten minutes had me on the edge of my seat afraid of what was going to happen. If you don't cry as much as I did your not human.",
         "First things first, its photography is stunning and there are many memorable sequences for which I'm going to search lots of gifs. Apart from that it is obviously a film based on a book. And how can you tell? Because it is not your average gay movie packed with clichés and lame stories. It is a story about a gay boy (Pim) living with a negligent mother that is still trying to be young and free. The boy develops a crush on this neighbor (Gino) who looks a lot like Harold from \"Harold and Maude\". We witness how the relationship between Pim and Gino unfolds. But there is more to it, we can see the relationship between Pim and Gino's sister, who has a crush on him and with his mother, who is the mother figure he does not have at home. In a place where there are not a lot of opportunities Pim is trying to find his place and his silence fills a big void.",
         "If you go looking on netflix you will find there are dozens of gay themed movies. I ended up finding this dutch movie called North Sea Texas. You have a teenage boy named Pim. He has mother who is a singer and accordion player. She spends most of her time away from the house partying rather than raising her child. Pim spends most of his time at a neighbors house. This is where he meets a boy named Gino who he falls in love with. Pim likes to dream about things including drawing pictures of Gino. There are some loves scenes in this movie between Pim and Gino. There is some stuff you might object to. Some people may not like the idea of guys kissing. Otherwise this movie is pretty clean. There is no violence in this movie. This is an interesting movie about teenage boys who fall in love. This movie shows a gay teenager named Pim whois a lot stronger that most people. He isn't confused in any sort of way. Pim isn't afraid to express his feelings towards Gino. This is a movie worth watching. It's a lot different that your typical love story."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Indeed films",
         "Mollywood",
         "Eén"
      ],
      "summaries": [
         "Pim, the emotionally abandoned and affection-starved young gay son of a small seaside town's resident floozy, grows up dreaming intensely of a loving father who will someday come for him, but never does. Frequently home alone, Pim often spends time at a neighbor's house where another single mom and her two teenage children accept him matter-of-factly. As Pim is about to turn 15, he and neighbor boy Gino become each other's friend-with-benefits, entering a period of sexual awakening together. Life, however, is all about change, and while Gino (a couple years older) is ready to move on and move out, Pim is not, leaving Pim behind to carry on with his continuing crush for Gino (while Gino's sister Sabrina develops an unrequited crush for Pim).",
         "Sensitive fatherless Pim, a shy closet gay, grows up as utterly neglected son of Yvette, a hedonistic nightclub waitress at the Flemish North Sea coast. Pim finds solace with the hospitable neighbors, especially slightly older, cocky son Gino, who acts as his generous big brother and even enjoys experimenting sexually, camping in the dunes. Once a major, Gino takes a foxy girlfriend and a job, so he can move out, while his ever-jealous sister Sabrina tries to seduce Pim. Yvette takes in suave gypsy Zoltan, whose kindness and perfect body give Pim new hope, only to find he's his mother's lover. Pim now flees back to the neighbors, but Gino leaves and takes a girl as fiancée.",
         "A teenage boy's search for love finds him fixated on a boy who lives nearby."
      ],
      "budget": 0
   },
   "movielensId": 108791,
   "movielens": {
      "languages": ["Nederlands"],
      "releaseDate": "2011-03-16",
      "dvdReleaseDate": null,
      "directors": ["Bavo Defurne"],
      "runtime": 96,
      "movieId": 108791,
      "title": "North Sea Texas",
      "mpaa": "NR",
      "actors": [
         "Jelle Florizoone",
         "Mathias Vergels",
         "Eva van der Gucht",
         "Thomas Coumans",
         "Luk Wyns",
         "Nina Marie Kortekaas",
         "Katelijne Damen"
      ],
      "imdbMovieId": "1625150",
      "originalTitle": "Noordzee, Texas",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["NijFwKLxP4s"],
      "plotSummary": "Pim lives in a run-down house in a dead-end street somewhere on the Flanders coast, together with his mother Yvette Bulteel. Life here smells of cold French fries, cheap cigarettes, vermouth and stale beer. Mother Yvette uses her friend Etienne, with his lousy grey Fiat, as a driver for the nights she has to “perform”.  As a kid Pim dreams of a better life, imagining princesses and beauty queens. But when Pim turns 16 he dreams of Gino, the handsome boy next door, instead. Ever since they were children there has been this tension between them. Now Gino is Pim’s motorcycling hero. Cold mockery, little humiliations and tiny bits of hope make up Pim’s life. No wonder he sometimes flees to his dream world.",
      "tmdbMovieId": 100898,
      "avgRating": 3.44444,
      "releaseYear": "2011",
      "numRatings": 54,
      "posterPath": "/bc24mpqkZs3rWA4fGmne1Zxa5fD.jpg"
   }
}