{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sadistic",
            "id": 625
         },
         {
            "name": "grandfather",
            "id": 4412
         },
         {
            "name": "mansion",
            "id": 12545
         },
         {
            "name": "captive",
            "id": 15381
         },
         {
            "name": "molestation",
            "id": 33739
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "attic",
            "id": 155619
         },
         {
            "name": "grandmother",
            "id": 164039
         },
         {
            "name": "starving",
            "id": 181958
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt3074694",
      "video": false,
      "title": "Flowers in the Attic",
      "recommendations": [
         267793,
         333653,
         333658,
         65006,
         184915,
         226343,
         118898,
         429866,
         129014,
         194246,
         313563,
         130457,
         129425,
         112193,
         248927,
         365279,
         110551,
         129267,
         327558,
         102492
      ],
      "backdrop_path": "/oMLkfMbthvD6Uk04UdPas5dIy96.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Corrine Dollanganger",
               "gender": 1,
               "credit_id": "52fe4e59c3a36847f828b8b9",
               "name": "Heather Graham",
               "profile_path": "/rHIEhPAnZQn8BTbB1EVQ5ggEOX7.jpg",
               "id": 69122,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Olivia Foxworth",
               "gender": 1,
               "credit_id": "52fe4e59c3a36847f828b8bd",
               "name": "Ellen Burstyn",
               "profile_path": "/kxWFljG3JjJMbOMCLm0SkrPQjhf.jpg",
               "id": 9560,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Catherine 'Cathy' Dollanganger",
               "gender": 1,
               "credit_id": "52fe4e59c3a36847f828b8c1",
               "name": "Kiernan Shipka",
               "profile_path": "/k2nVQVHu3quZgQxkM0HGA1YuiVm.jpg",
               "id": 934289,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Christopher 'Chris' Dollanganger, Jr.",
               "gender": 2,
               "credit_id": "52fe4e59c3a36847f828b8cd",
               "name": "Mason Dye",
               "profile_path": "/c6suOVBIoyBqxapaBs8KmQlOIlq.jpg",
               "id": 1271473,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Bartholomew 'Bart' Winslow",
               "gender": 2,
               "credit_id": "52fe4e59c3a36847f828b8c5",
               "name": "Dylan Bruce",
               "profile_path": "/A5zSZwUpMas4SUyWS6r7swtt9mw.jpg",
               "id": 142206,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Carrie Dollanganger",
               "gender": 0,
               "credit_id": "52fe4e59c3a36847f828b8d1",
               "name": "Ava Telek",
               "profile_path": null,
               "id": 1271474,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Cory Dollanganger",
               "gender": 0,
               "credit_id": "52fe4e59c3a36847f828b8d5",
               "name": "Maxwell Kovach",
               "profile_path": null,
               "id": 1271482,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Christopher Dollanganger, Sr.",
               "gender": 2,
               "credit_id": "52fe4e59c3a36847f828b8c9",
               "name": "Chad Willett",
               "profile_path": "/8yfpgVDLuInVPlTyJa7BaQjgI3O.jpg",
               "id": 110472,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Malcolm Foxworth",
               "gender": 0,
               "credit_id": "58f70ba2c3a3684190008995",
               "name": "Beau Daniels",
               "profile_path": null,
               "id": 1585738,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "John Amos",
               "gender": 2,
               "credit_id": "58f70bd1c3a368416d008e85",
               "name": "Andrew Kavadas",
               "profile_path": "/mP9Vf1xBo0O3NSNdDb9x9jldRjE.jpg",
               "id": 1216568,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "58f70bbec3a368413b00909c",
               "name": "B.J. Harrison",
               "profile_path": "/wKQzk78i0nCdSASDFwma0z1tZsv.jpg",
               "id": 62716,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Police Officer",
               "gender": 2,
               "credit_id": "52fe4e59c3a36847f828b8d9",
               "name": "Ian Robison",
               "profile_path": "/5eyTDnE31SxTGCFUsT55eRd3ZLw.jpg",
               "id": 61546,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Female Guest",
               "gender": 0,
               "credit_id": "52fe4e59c3a36847f828b8dd",
               "name": "Laura Jaszcz",
               "profile_path": null,
               "id": 175776,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Family Member",
               "gender": 1,
               "credit_id": "52fe4e59c3a36847f828b8e1",
               "name": "Carolyn Adair",
               "profile_path": "/nq3wcdcgbQ5ThACNSfhPHQL7vc8.jpg",
               "id": 591210,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Police Officer",
               "gender": 0,
               "credit_id": "5859a40bc3a36806a7061d63",
               "name": "Ian Robinson",
               "profile_path": "/iEEG3pgpMYU1fb6z3FREkbUPp4r.jpg",
               "id": 1725448,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e59c3a36847f828b8a9",
               "name": "Deborah Chow",
               "profile_path": null,
               "id": 928830,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e59c3a36847f828b8b5",
               "name": "Virginia C. Andrews",
               "profile_path": null,
               "id": 1271472,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4e59c3a36847f828b8e7",
               "name": "Mario Grigorov",
               "profile_path": null,
               "id": 60557,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "540c2d620e0a262b40003f3e",
               "name": "Kayla Alpert",
               "profile_path": null,
               "id": 168383,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "540c2d460e0a26364000130a",
               "name": "Miroslaw Baszak",
               "profile_path": null,
               "id": 90690,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "540c2da3c3a36879a80036f3",
               "name": "Jamie Alain",
               "profile_path": null,
               "id": 1009265,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "540c2db4c3a36879a80036f8",
               "name": "James McAteer",
               "profile_path": null,
               "id": 6629,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "540c2f20c3a36879a5003694",
               "name": "Lyn Kelly",
               "profile_path": null,
               "id": 1323119,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 7.533951,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 236399,
      "vote_count": 127,
      "budget": 0,
      "overview": "After the sudden death of their father, four children face cruel treatment from their ruthless grandmother.",
      "similar": [
         27586,
         43923,
         3134,
         9813,
         527,
         2771,
         11236,
         10900,
         1919,
         248774,
         326359,
         10692,
         13551,
         26890,
         372411,
         18221,
         1382,
         340487,
         9787,
         8675
      ],
      "original_title": "Flowers in the Attic",
      "runtime": 90,
      "poster_path": "/w1ZkNHt9T4Kofqus8jrNj1N1qE1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cue the Dog Productions",
            "id": 19623,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Front Street Pictures",
            "id": 3958,
            "origin_country": ""
         },
         {
            "logo_path": "/6LVLYfZAEQfhJey0MGvhFXdDEK1.png",
            "name": "Lifetime",
            "id": 3431,
            "origin_country": "US"
         }
      ],
      "release_date": "2014-01-18",
      "vote_average": 6.3,
      "belongs_to_collection": {
         "backdrop_path": "/xbYuLpKmkYjlbchOnEYeBVVrJUa.jpg",
         "name": "Flowers in the Attic Collection",
         "id": 293981,
         "poster_path": "/d98HpD5u0xFk2comAq0I6F9zWNP.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Deborah Chow"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Kayla Alpert",
         "Virginia C. Andrews"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3074694/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4Nzk4MDk4MV5BMl5BanBnXkFtZTgwNjg5ODY5MDE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Heather Graham, Ellen Burstyn, Kiernan Shipka | See full cast and crew »"],
      "reviews": [
         "For those fans worried about the makers of this TV production not being faithful to the source material; this version is really wonderful. Featuring a beautiful, blond cast of talented actors, \"Flowers in the Attic\" makes the beloved Gothic novel come to life. With nice 1950's period detail, we follow the Dollanganger family to the sprawling Virginia mansion known as Foxworth Hall, a place filled with secrets and cruel deceptions. Four children will be hidden in an upstairs room by a selfish mother, determined to \"win back her father's love,\" and thus inherit the vast Foxworth fortune. But you all know the story; this book series is such a big part of the childhood memories of so many people. This new adaptation has it all; beautiful sets, top rate actors turning in frighteningly believable performances, and an intelligent script that shows absolute respect to the novel from 1979. It is obvious that everyone involved actually cared about what they were doing, which is rare for television movies, that so often look rushed and sloppily thrown together, just to meet a deadline. In other words, this movie has a heart. Veteran actress Ellen Buryston surprisingly lends the Grandmother a bit of a human side here, which in turn makes Corrine even more of an evil character. Not to say that the Grandmother isn't still terrifying; Buryston just gives her more depth. Heather Graham, usually known more for her beauty than her acting abilities, gives a surprisingly good performance as Corrine Foxworth; sweet, charming, selfish, and cruel; all at the same time. And later in the story, when she shows her true colors, it is quite frightening. She plays a great bitch. Cathy and Chris likewise were perfectly cast by two very talented young people. Cathy especially is multi-layered here, and she allows us to sympathize with her, without her acting too sweet, or innocent; here she is a \"real person,\" a girl that we can relate to. I can say that every major plot point of the novel was covered in this movie, except for one that I can remember; the passages in the novel where Chris lets Cory drink his blood, after the Grandmother has cut off their food supply, is sadly absent; sad because that is one of the most powerful images from the book, and shows just how much Chris loved his siblings. But every minute of it's short running time was used to maximum effect. At under 2 hours, we still get the feeling that the children are in that upstairs room for 2 years. And I have to say that this production has a gorgeous look to it as well. It must be mentioned too, that the controversial theme of incest is dealt with, and handled very tastefully; it is still shocking, but it never feels exploitative. I'm happy to say that this is a total success all around. If you are a fan of the novels, and haven't seen this movie version, i recommend that you give it a watch; I can't imagine anyone being disappointed with this one.",
         "My very first introduction to V.C. Andrews came when I was about 10 years old. My mother, usually very protective and conservative when it came to movies, actually let me watch a movie called \"Flowers in the Attic.\" It was kind of an \"I-think-you-can-handle-it; it'll-be-our-secret\" moment. :-) I really liked it, and even though as an adult I think it's actually pretty tame, that movie retains, for me, an element of the taboo and outrageous. A few years after that I read the book and realized how sanitized it actually was. I was so excited to learn that there was going to be a 2014 remake of \"FItA.\" However, I was a little nervous to learn that Lifetime was going to be the venue. After reading the book, I thought that the only TV station that could do it justice would be HBO, Showtime or Starz. So nonetheless, I excitedly awaited the premier of this on Lifetime, so much so that I waited until midnight to catch the replay (I was spending MLK weekend in a cabin with some girlfriends and a few guys that I couldn't convince to tune in for the 8pm showing!). After viewing it, I decided that it was neither better nor no worse than the 80s film. First of all, the Lifetime film was much closer to the novel, even down to small details like the picture of Hell in the room. Unlike the 80s film, in which the story took place in the present time (the 80s), the remake takes place in the correct time period, the 50s. This film succeeds in some places and fails in others. The good: Again, very close to the novel. The film is also beautifully shot with gorgeous 50s period costumes and dark, Gothic eerie-ness. Ellen Berstyn as \"The Grandmother,\" Olivia, was good. What's funny is she actually portrayed a three-dimensional character, as opposed to Louise Fletcher's 80s portrayal, which was more one-dimensional, but, to me, MUCH more evil and fun to hate. BUT when Ellen's Grandmother got nasty, she got NASTY very well! When a grown woman threatens a little kid and makes a fist, that's pretty disturbing! The actor who portrayed Chris was also good, or at least better than the one who portrayed the character in the original. The neutral: The lead actress who played Cathy (Kiernan Shipka) portrayed her completely differently than the one that played her in the 80s film (Kristy Swanson). Instead of a sweet, quiet and occasionally angry girl, we get a very 21-st century, kind but sarcastic hard @$$. This could be a good thing or a bad thing, depending on your taste and/or how you interpreted the book. The bad: Heather Graham is a gorgeous, sexy and talented actress. However, I can't help but feel that most of her talent must lie in comedy. She looked beautiful in the costumes, but I didn't care for her acting in this at all. And, well, this movie was kind of boring. Despite the producers actually showing some of the more tawdry details of the novels, I still felt that Lifetime held back. To me this was the opportunity to capture the craziness of the novel, and it just failed. I did enjoy this, but it wasn't any better than the original film, unfortunately. It was just a slightly different version.",
         "I have read the book, Flowers in the Attic. This is a Gothic type mystery where children were locked up in the attic not to be seen. V.C. Andrews was able to convey a dark and sinister atmosphere with Olivia Foxworth being a truly evil grandmother, showing them absolute contempt. Heather Graham portrays their mother, who becomes bored with her life and pursues a man who is supposedly their grandfather's attorney. She stays gone for long periods of time and brings back gifts which are supposed to compensate for her absence. Heather Graham is not right for this part. She comes across as rather vacant and bored, but does not project a sense of evil, which is well demonstrated in the novel. Ellen Burnstyn is an excellent actress and there is no doubt that she can barely tolerate her newly acquired grandchildren. She gives a fantastic performance. There are gaps in this movie and the viewer is left wondering exactly why the daughter of Foxworth was alienated from her family. Heather does not even come across as a mother, but more like a best friend to her children. But maybe that is the intended effect. She obviously is not interested or does not care about their well-being. Also in the book VC Andrews was able to convey a sense of anxiety and claustrophobia as the children feel suffocated from living in such close quarters with no freedom. You can feel their sense of doom and emotional deprivation, as they slowly realize that they are in a sort of prison and may never get out. The director, Chow does not give the viewer this feeling of doom. If there is a sense of frustration and anxiety with their surroundings, it is mild discontent compared to what the book shows. Without this psychological drama, it greatly diminishes the sense of doom, which Gothic novels are big on portraying. I would not watch this movie again. I had a hard time following it and in a way kind of boring.",
         "An idealized, idyllic and seemingly wealthy 1950s family of six is suddenly hit with great tragedy. Stripped of their material goods, the family must move into an isolated Gothic mansion. In Virginia, \"Foxworth Hall\" matriarch Ellen Burstyn (as Olivia) gives them a frosty welcome. She insists the \"four beautiful children with blonde hair and porcelain skin\" must live in the attic, because their ailing grandfather disapproves of their existence. Conniving mother Heather Graham (as Corrine Foxworth-Dollanganger) hopes to inherit her father's estate, but must keep her children a secret until the old man dies. Increasingly neglected in the attic, the eldest children struggle to care for the younger twins as skeletons fall out of the mansion's closets... Ending with awkward abruptness, this is the first in a series of \"Lifetime\" TV movies based on Virginia C. Andrews' popular stories. A previous feature film cut subplots involving incest from the story, but this version includes the incestuous feelings. The \"taboo\" subject was an important part of the original novel, but it doesn't translate well. When we first see two of the characters in question, they have clearly experienced the \"body changing\" developments latter referred to in the script. They talk about school and appear at a well-attended party (unlike the novel). Since sexual interest has begun, their attraction is more difficult to accept. In most school settings, the top physical condition of these two would not go unnoticed by most classmates... Attractively proportioned co-stars Kiernan Shipka (as Cathy) and Mason Dye (as Christopher) handle the leading roles better than expected. Still, when he gives her a cool \"punk\" hairstyle, we wonder who cuts and shaves Mr. Dye's always neatly trimmed hair. The young stars and director Deborah Chow excel in reaction shots. In the supporting roles, Ms. Graham and Ms. Burstyn are engaging. Graham's character is cast to the wind, unfortunately; to really impress, she needed a couple more scenes. Possibly at her own insistence, Burstyn's character is more fully realized; this actress brings something extra to the role and is more intuitive about the medium. The six producers had to be happy with art/set direction and Miroslaw Baszak's photography. ****** Flowers in the Attic (1/18/14) Deborah Chow ~ Kiernan Shipka, Mason Dye, Ellen Burstyn, Heather Graham",
         "Finally, a version of this movie we can all appreciate and love, am I right? The '87 version ain't got nothing on this. The acting was on point and the story actually stuck to the original narrative. Kiernan Shipka, of Man Men, captured the resilience and defiant nature of Cathy so perfectly, and professionally sprinkled her with desire and trust. She turned a character some would call spiteful and cruel into one that is brave, honest, loyal and true. Heather Graham made you hate Corrine and Ellen Burstyn added that sympathetic tone to the grandmother. The cast knew full well just how to portray these heavy characters without making it seem unreal. Anyone who is not familiar with the book already will want to read it as soon as this movie ends. The Lifetime network took one of the most beloved and tortured novels of all time and made it into a beautiful love story that even the most uptight zealot can appreciate. 8.3/10",
         "the movie is well played throughout. the cast is beautifully assembled. the story line is good and induces a theme of horror without any ghosts or supernatural element. the characters Cathy and Christopher are well played by the actors. the story revolves around a dysfunctional family after the death of the father. the mother moves them all to their grandparents whom they have never met. the four children are made to stay in an attic for nearly two years, while their mother moves on without them. it shows the struggles they undergo due to isolation and their learning of the truth and dealing with it. the isolation and its effect on the children is shown very carefully including the incest which was handled well..",
         "I just finished watching the premiere on Lifetime. I'm confused how the movie already has ratings. The original version got worse ratings on this site but was much better than this remake. The story is the same but the acting was awful. Ellen Burstyn was amazing as always but the rest of the cast was mediocre at best. I can overlook the children not being that great as I assume that they were newbies but I expected more from Heather Graham. They didn't do the original movie or the book justice. It was not worth watching or waiting for. Sorry that I wasted my time. I would recommend reading the book or seeing the original movie if you want the best version.",
         "I watched this movie because of the Emmy nomination Ellen Burstyn received for her performance, without any background knowledge and not having read the book (which I certainly am not going to do anytime soon). Boy was I in for a treat. The writing is about on par with your average Transformers movie (no disrespect for Michael Bay) with great lines like \"I'm going to make all of your dreams come true.\" etc. The performances range from OK (Burstyn and Shipka) to atrocious (Graham and whoever played to brother), though with this writing it's a wonder they did this well. However, the kicker is that this movie has, you guessed it, adolescent incest! From researching the book, this is apparently supposed to be sexy, though I can't possibly see how it could be anything other than extremely revolting. Please don't watch this movie, please.",
         "This is no way compares to the original.. It was like a watered down version that that just skimmed the surface of this great book. If you didn't read it or watch the original then you wouldn't understand some of the references and Heather Graham (whom i really enjoy) was miscast and her acting was under par for this role. Ellen Burstyn however played her part wonderfully and she was truly the only reason i continued to watch the film to the end..I wish i could've given this a better review as i loved the book and the original movie ..sadly when it comes to this remake i was completely underwhelmed and disappointed. Next time i hope they stick closer to the plot and not do as much rearranging.",
         "My wife who read the book many years ago was looking forward to this film adaptation. She informs me that the film was faithful to the book. As for me I probably not the target audience for this Lifetime Original Movie. Its mainly targeted at a female audience and despite the star casting of Ellen Burstyn, it has made for TV written all over it and the largely interior sets very much displays its low budget if glossy origins. The film is about a group of four children locked in an attic in the care of their stern and wicked grandmother while their glamorous mother (Heather Graham) tries to reconcile with her father and inherit his money. Over time the two older siblings embark on an incestuous relationship and discover that there mother has abandoned them and worse they are superfluous to her new life and they plan to escape. The film is plain, old fashioned, even a tad hammy. Burstyn imbues her character with some emotions and care towards her grandchildren but in the main she is a harridan. Graham starts of as the caring mother but over time she has entered her own glamorous world and you get the feeling she cares less about her kids. The younger children play their parts well, the older children did not convince. They did not look like kids locked up in an attic, malnourished, living in a troubled existence."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Cue the Dog Productions",
         "Front Street Pictures",
         "Side Street Post"
      ],
      "summaries": [
         "Based on V.C. Andrews' controversial cult-classic novel, \"Flowers in the Attic\" tells the story of the Dollanganger kids who, after the unexpected death of their father, are coerced to stay hidden in the attic of their ruthless grandmother.",
         "\"Flowers in the Attic\" weaves the twisted story of the Dollanganger kids who, after the unexpected death of their father, are asked by their mother Corrine to stay hidden in the attic of their wealthy grandparents' mansion so she can reclaim the family fortune. But as her visits begin to wane after she becomes involved with a new husband, the children endure unimaginable treatment at the hands of their ruthless grandmother Olivia Foxworth. As years go by and the eldest children Cathy and Christopher come of age, both emotionally and physically, their family's sordid past entraps them further as they look to each other for comfort.",
         "It's the 1950s. The upper middle class Dollangangers - father Christopher Sr., mother Corrine and their four children, teenagers Christopher Jr. and Cathy, and twin adolescents Cory and Carrie - love each other as a family should, although Cathy, who has a special bond with her father, doesn't like the fact that he is away at work so often, which will be even more so with his promotion. Their life changes when Christopher Sr. is killed in an accident. Christopher Sr. and Corrine perpetrated this upper middle class life for their children's sakes. Having lived largely on credit, Corrine, who has no money or job skills, goes searching for friends or relatives who may take them in for the short term. The one offer she receives is from her wealthy and religiously fanatical mother, Olivia, who the children did not even know existed. Upon their arrival at Olivia's house in Virginia, stern and angry Olivia tells the children that they are to stay in a locked room in an isolated section of the house as no one is to know they are there, even the household servants. Olivia will come once a day to bring them food for the day, and the children are to hide in the adjoining attic on the one day of the week the servants come to this section of the house to clean. Corrine tells them they are in hiding because she is estranged from her aged and ailing father, and needs to make amends with him so that he will reinherit her, before she tells him of their existence. This plan should take no more than a week. When a week passes and nothing has changed in the children's lives and their mother's visits become less frequent, the children learn from their mother the rest of the story and the reason for their grandmother's animosity toward them, especially toward Cathy and Christopher, who are coming into their sexual awakening. As time goes on and in their isolation from the rest of the world, the children's lives are affected by what looks to be their mother's burgeoning life outside of their captivity without any regard for them. Cathy and Christopher also become surrogate parents to the twins, and what Olivia predicts will happen may solely out of the circumstance the children are placed in the house rather than due to their heritage.",
         "After the unexpected death of their father, The Dollengangher children and their mother, Corrine, move to their grandmother's home. The grandmother locks them in a room and forces them to be hidden from the outside world. However, in that attic, The children discover their mother's darkest secrets.",
         "After the sudden death of their father, four children face cruel treatment from their ruthless grandmother."
      ],
      "budget": 0
   },
   "movielensId": 108797,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-01-18",
      "dvdReleaseDate": "2014-04-15",
      "directors": ["Deborah Chow"],
      "runtime": 90,
      "movieId": 108797,
      "title": "Flowers in the Attic",
      "mpaa": "PG-13",
      "actors": [
         "Heather Graham",
         "Ellen Burstyn",
         "Kiernan Shipka",
         "Mason Dye",
         "Dylan Bruce",
         "Ava Telek",
         "Maxwell Kovach",
         "Chad Willett",
         "Beau Daniels",
         "Andrew Kavadas",
         "B.J. Harrison",
         "Ian Robison",
         "Laura Jaszcz",
         "Carolyn Adair",
         "Ian Robinson"
      ],
      "imdbMovieId": "3074694",
      "originalTitle": "Flowers in the Attic",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["rHtU8ENFst4"],
      "plotSummary": "After the sudden death of their father, four children face cruel treatment from their ruthless grandmother.",
      "tmdbMovieId": 236399,
      "avgRating": 3,
      "releaseYear": "2014",
      "numRatings": 44,
      "posterPath": "/w1ZkNHt9T4Kofqus8jrNj1N1qE1.jpg"
   }
}