{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt1827528",
      "video": false,
      "title": "Harvest",
      "recommendations": [
         20116,
         19369,
         69746,
         31978,
         196446,
         43600,
         261776,
         81704,
         44495,
         294086,
         174372,
         47488,
         408422,
         322127,
         71208
      ],
      "backdrop_path": "/oqbWMqFSQtwNAN3o0lx1HfRUbVU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Marko",
               "gender": 2,
               "credit_id": "52fe49ebc3a368484e147453",
               "name": "Lukas Steltner",
               "profile_path": "/a2dKD6EcinDEr56RNTBRFwWN2jC.jpg",
               "id": 33985,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Jakob",
               "gender": 2,
               "credit_id": "52fe49ebc3a368484e147457",
               "name": "Kai Michael Müller",
               "profile_path": "/lIzOhlMxZeX1Fv4UKvhRUsfaL2e.jpg",
               "id": 5852,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49ebc3a368484e14744f",
            "name": "Benjamin Cantu",
            "profile_path": "/zUvSzt4TenyH0B8vI5dLQyMOtbE.jpg",
            "id": 592609,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.411915,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 79919,
      "vote_count": 16,
      "budget": 0,
      "overview": "Breathtaking in its subtle beauty, Harvest is an achingly romantic tale of an innocent but ever increasingly passionate affair that develops between two simple farmhands. Life on a farm is all that sullen teen Marco knows- leading a perfunctory and quiet life of working, going to school and avoiding the advances of girls. However, his self-imposed solitude ends when curly-haired Jakob, rejecting the banking world for farming, arrives to train on the farm. Although initially cautious and tentative with each other, it is soon obvious that the unspoken sexual tension is becoming increasingly hard to resist - something a spontaneous trip to Berlin. Proving that true love can blossom in even the most unlikely of places, Harvest is as rich and rewarding as it is heart-warming.",
      "similar": [],
      "original_title": "Stadt Land Fluss",
      "runtime": 88,
      "poster_path": "/tIb9zExKjPNy7C6c0uNUP6YHZ9t.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "TLA Releasing",
         "id": 328,
         "origin_country": ""
      }],
      "release_date": "2011-02-16",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Benjamin Cantu"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Benjamin Cantu"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt1827528/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE0MTY5NjQwMl5BMl5BanBnXkFtZTgwNjM1NTA2MDE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Lukas Steltner, Kai Michael Müller, Steven Baade | See full cast and crew »"],
      "reviews": [
         "I loved this movie. The first time Jacob and Marko sit in the abandoned car is one of the most beautiful scenes I have ever seen in any movie, and they hardly say a word; it's all in their eyes and in the way they move. Kai Michael Müller (Jacob) is especially appealing, but both guys are excellent. This movie is far more sensual than movies with nudity and sex (Harvest has none of either). I should give up trying to understand why other people don't like the same things I do. I can't imagine thinking this movie is slow or boring or dull. I watched it all the way through in one sitting because I simply couldn't break myself away from it. So much was happening that I didn't want to miss any of it. I've seen over a thousand movies in the past five years, and I could count on one hand the ones I've watched in one sitting. There is no violence in it at all, and only the very briefest flash of hostility from a passing stranger. Nearly everything that happens happens within and between the two lead characters; and even when it is difficult (as it is most of the time for Marko) it is always tender, never violent. Maybe that's why it bores people.",
         "\"Harvest\" is a minimalist docu-drama concerning life in a German farming community. Utterly realistic production that uses a cast of mostly non-professional actors, to show, without any silly pretensions, the lives of two guys who discover they have some deep emotions for each other, in the midst of a very unlikely environment. The look of the film is beautiful, in the same vein as the early works of Peter Weir, and the German countryside, filmed mostly in the early morning, seems to be shrouded in rays of sunlight. Marko decides to give up a career as a banker in the city, to pursue a career that will bring him closer to the land. Thus an uncomfortable friendship begins with Jakob, another young guy, training to be a farmer, but not really happy with the life. The tension builds as the two realize their feelings for each other go beyond friendship, but each is unsure of how the other is feeling. And in a rural setting like that, neither one wants to take the first step. When it finally happens, a world opens up for them both, as they steal a car and drive to Berlin, where they can be more comfortable to explore their emotions. The fact that two people can find each other in such an environment is a true miracle. \"Harvest\" is perhaps one of the only gay-themed films that is completely without pretensions, totally without those silly and insulting gay stereotypes. Also, this German film succeeds where the similar-themed \"Brokeback Mountain\" fails, in that it avoids the usual pitfall of ending in shame and tragedy. It is very nice to see a romantic story about a same-sex couple, where someone doesn't end up getting gay bashed or dying of AIDS or some crap. Yes, this one is totally devoid of that element. And in the end, we are left with an optimistic feeling that these two good guys found each other and that they are going to be OK because of it, rather then punished for their \"crime\" of caring for each other, like in the melodramatic \"Brokeback Mountain.\" Jakob and Marco are very real guys, and immensely likable. Films like this are very important, as they shatter old stereotypes of how gay people look and behave. I notice a lot of people did not like the film; they called it \"boring,\" and made fun of the farming element. Well I'm guessing that these people might be of the stereotype kind of gay men, who can only relate to nightclubs, drug taking and rampant sex between strangers. I think these people are a bit outdated. I highly recommend this amazing and lyrical film; it is truly unique. Just don't expect a theme song or any drag queens. Don't expect sex scenes either; you won't find it here. what you will find is a slice of real life.",
         "What a terrific film that blurs the boundary between documentary and fiction - the director used nonprofessional actors for all but the two leads. A very moving love story that happens to be between two young men - probably the most touching I've seen in a while, mainly because it is subtle and mostly told through glances and gestures. This is not a film about gay culture - it's about two people living/working in a traditional farming community who are faced with a growing attraction to each other and do end up coming together. Luckily no great drama/punishment ensues a la Brokeback. The leads have amazing chemistry - kudos to the director for the casting. It's probably too slow for most tastes, but for me, it was perfect and if anything too short.",
         "Movie is indeed going very slowly, but lack of plot means just a raw emotions which developed between two ordinary guys with ordinary lives and process of discovering them. Nothing else. Just enough. Final hug is most beautiful scene in my life, so full of meaning. It is like a crown to the slow paced movie that develops into nothing but one hug, two smiles, and probably, thumping of their hearts. Scenography is outstanding too, and I feel that this movie achieved what it wanted. It set a backdrop, and in the most special moment, they happened. In the best moment. No drama. No complications. Just a slow process of advancing from awkward moments to mutual understanding. Acting is really good, I felt like I am reliving those moments again.",
         "(( NOTE: 1-STAR added for high degree of location / setting authenticity which was captured ON FILM. Otherwise, Story...Acting...Camera Work would have been rated 5-STARS )) Described at many DVD sales sites as more of a Gay Romance....here at IMDb.com it is labeled a Drama. Neither of these descriptions is \"mostly\" correct....and for why, read on. In the Director's words, this is a film he calls \"The Farm\" (perhaps being titled \"Harvest\" is more marketable for American distribution). Also in Benjamin Cantu's own words, this is more a \"Documentary\" (at least, a semi-one), rather than a film falling completely in either of the 2 Genres mentioned above. Now, in order for you to relate more easily to this film and its location, think of it as being a take off on the United State's \"F\"uture \"F\"armers of \"A\"merica. ....BUT, here in this film, it is a story taking place on the far outskirts of Berlin, in an agricultural school established to intern / train the \"FFG\". Note that farm life and activities are quite realistically portrayed, right down to the actual use of farm machinery and the handling of animals (this is a working farm). Yes, there is a \"side story\" in which we are given scenes of the developing \"relationship\" between 2 young, male trainees (the only professional actors in this film; the many other persons you see being actual agricultural school students and their instructors). As for my general impression of the storyline, I find it one which transports us into a deeply agricultural environment....BUT does so somewhat \"aimlessly\". There are \"Shifts\" in plot directions and actions being shown us which seem to occur without meaning (aimlessness also exists within that \"personal relationship\" we are waiting to see develop). Dialog, by the writer / director's own admission, is often unscripted or improvisational, and there is much reliance upon \"looks\" and \"glances\" to get a point....or a feeling across to us. And as for what we are all waiting to see occur (due to the \"romantic sales pitch\" often given this movie), physical contact between the 2 leads is very slow in coming....and amounts to nothing other than upper body contact. Kissing scenes are particularly mishandled, due to poor camera angles and even worse use of lighting. Still, both of the Straight actors playing characters \"Marko and Jakob\", are fairly adept at portraying the qualms of \"coming out\" and facing up to a first affair. Kai-Michael Müller, as \"Jakob\", is particularly able at expressing such feelings. Lukas Steltner's \"Marko\", who we follow from film's beginning, is more stoic in nature (due likely to his character's more \"iffy\" family background). At best, I see this as an \"intermittently Gay\" film, which I will NOT be keeping in my Film Library for this Genre. ****",
         "I loved this movie...and I say that agreeing with other reviewers who say it was slow, focused too much on \"farming\", etc... However, it was acted to PERFECTION by the two main characters. Wow, these two are very talented and I don't know what their careers are like in Germany but it's rare to see such a beautiful performance...very reminiscent of Heath Ledger and Jake Gyllenhaal in \"Brokeback Mountain\", albeit not as complex. I always gauge a movie by how it lingers with me, and this film did just that. Kudos to these two actors... Lukas Steltner and Kai Michael Müller...a sweet, sweet movie for men who fall in love with men.",
         "What makes this different from other gay love stories is the setting: its natural depiction of rural life with scenes of farm school operations and the people behind it. Same sex love do exist even in these places. Another example of cinema-verite technique in filmmaking, quite subtle in style. Yes, the film is slow paced, but it is never boring. The attraction between the two apprentices is naturally developed. The long glances and yearning were only shown halfway thru the film and when it happens, it makes their love story more believable and satisfying. Great natural acting from by the two leads throughout. I especially like the piano interludes which play at the right moments. If you have the patience and allow yourself time to understand their story, then you might find it fulfilling as I did..",
         "\"Stadt Land Fluss\" is a German film from almost five years ago that runs for clearly under 90 minutes. It won an award at the German film festival here in Berlin in 2011, but sadly, while watching this I had to realize that all the popularity and acclaim this film received was really only because of the topic and not because it's a great, or even good, movie. The story is basically about a young man who stops his work as a banker apprentice and starts working on a farm. There he falls in love with another (male) farm worker and the two are facing the usual. Homophobia, doubts about sexuality, temptation by women, escape fantasies etc. There is nothing in here that was not included in other movies about this issue either. Or I should maybe say short films as gays are much more common in there than in the full feature film genre. The writer and director is Benjamin Cantu and judging from his work here I cannot say I am really sad that he has not worked on another film since 2011. The two lead actors Steltner and Müller aren't much better really and neither is having a career right now. The only one I kinda liked was the actress who played the woman working in the administration. He felt authentic and real and definitely elevated an otherwise entirely forgettable film. Nothing interesting happens is usually not a valid criticism, but it does apply if both character are so boring that you just cannot create a connection with them or care in the slightest about who they are and what they are doing. Really nothing of quality to watch here. The only thing I can approve of is that this film did not run for 100 or more minutes with the very little story it had to tell us. Not recommended.",
         "I quote this movie as an example to other films. There are other movies that maybe more visually appealing than this one, but in fact are much much worse than the Harvest. From the cinematographic point of view this movie is so wonderful! The character development, the whole underlying subtlety of their relationships, setting the scene, the dialogues etc everything is so beautifully done in this movie. You can show this movie in your cinema classes to portray the development of characters and love relationships. Too bad very few people see it the real value of this movie.",
         "It is known and understandable that German character is not a French or Spanish one, being sedate and tardy, but combination of \"sensitive\" topic and agricultural environment was apparently not the best idea to keep the film going. True, we obtained a rather good overview of rural economy in contemporary Germany, thoughts and goals of interns, etc., but its overall pace remained too slow, and even \"brighter\" moments were shown in a gray and hectic manner. There are very few creations I know where virtually-nothing-happening can be fascinating (e.g. The Station Agent). The main characters and performances are rather good, but there are lots of other, documentary-like figures, whose role and meaning is schematic. So are some scenes and events, particularly when a static locality movie become an insipid road movie. Well, as for the topic in question, I would recommend Freier Fall - much more versatile and concise. Stadt Land Fluss did not impress me much, although I liked the ending - at least 1 additional point for this."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Salzgeber & Company Medien"],
      "summaries": ["A drama that tracks the relationship between two young apprentices working on an agricultural complex south of Berlin."],
      "budget": 0
   },
   "movielensId": 108875,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2011-02-16",
      "dvdReleaseDate": null,
      "directors": ["Benjamin Cantu"],
      "runtime": 88,
      "movieId": 108875,
      "title": "Harvest",
      "mpaa": "",
      "actors": [
         "Lukas Steltner",
         "Kai Michael Müller"
      ],
      "imdbMovieId": "1827528",
      "originalTitle": "Stadt Land Fluss",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Breathtaking in its subtle beauty, Harvest is an achingly romantic tale of an innocent but ever increasingly passionate affair that develops between two simple farmhands. Life on a farm is all that sullen teen Marco knows- leading a perfunctory and quiet life of working, going to school and avoiding the advances of girls. However, his self-imposed solitude ends when curly-haired Jakob, rejecting the banking world for farming, arrives to train on the farm. Although initially cautious and tentative with each other, it is soon obvious that the unspoken sexual tension is becoming increasingly hard to resist - something a spontaneous trip to Berlin. Proving that true love can blossom in even the most unlikely of places, Harvest is as rich and rewarding as it is heart-warming.",
      "tmdbMovieId": 79919,
      "avgRating": 3.31818,
      "releaseYear": "2011",
      "numRatings": 11,
      "posterPath": "/2cNuwLcgpHesN6QR3i8xan5yjoD.jpg"
   }
}