{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "tokusatsu",
            "id": 12667
         },
         {
            "name": "kaiju",
            "id": 161791
         },
         {
            "name": "ultraman",
            "id": 203972
         }
      ],
      "imdb_id": "tt0060038",
      "video": false,
      "title": "Ultraman",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Capt. Toshio Muramatsu",
               "gender": 2,
               "credit_id": "57e8483dc3a368474300da07",
               "name": "Akiji Kobayashi",
               "profile_path": "/zaiiG4h2JTiQPVRnBwswwii3y80.jpg",
               "id": 119185,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Shin Hayata",
               "gender": 2,
               "credit_id": "57e8484cc3a3687c5c000c85",
               "name": "Susumu Kurobe",
               "profile_path": "/iMRdCBvpP7KPpb9EVNFWcAoEyL2.jpg",
               "id": 129509,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Daisuke Arashi",
               "gender": 0,
               "credit_id": "57e84864c3a368475d00c9e5",
               "name": "Sandayuu Dokumamushi",
               "profile_path": null,
               "id": 571716,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mitsuhiro Ide",
               "gender": 0,
               "credit_id": "57e84875c3a3687c5c000c92",
               "name": "Masanari Nihei",
               "profile_path": null,
               "id": 1239810,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Akiko Fuji",
               "gender": 1,
               "credit_id": "57e848839251412987016879",
               "name": "Hiroko Sakurai",
               "profile_path": "/74t3d8pIPfQuw6GQpKuQMa3JVLW.jpg",
               "id": 147417,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Professor Iwamoto",
               "gender": 2,
               "credit_id": "57e848949251410344000d0a",
               "name": "Akihiko Hirata",
               "profile_path": "/hfJ3M03wlP0lhXpPRejONiKXfg0.jpg",
               "id": 30568,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "The original Ultraman",
               "gender": 0,
               "credit_id": "57e848a4c3a368475d00c9f0",
               "name": "Bin Furuya",
               "profile_path": "/5q4JHvDo4AxFcemDCBbe7dQzx72.jpg",
               "id": 1073691,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57e8475292514102ed000c66",
               "name": "Hajime Tsuburaya",
               "profile_path": null,
               "id": 1685028,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57e8476192514102ed000c6f",
               "name": "Toshiaki Ichikawa",
               "profile_path": null,
               "id": 1685029,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57e8476f92514129870167dc",
               "name": "Masayoshi Sueyasu",
               "profile_path": null,
               "id": 1685030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57e8477bc3a368474300d99e",
               "name": "Kunio Miyauchi",
               "profile_path": null,
               "id": 1309510,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.001556,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 418029,
      "vote_count": 0,
      "budget": 0,
      "overview": "",
      "similar": [
         124905,
         39256,
         15767,
         15766,
         1680,
         19545,
         479363,
         1682,
         36243,
         7191,
         929,
         5876,
         15092,
         68726,
         305470,
         268896,
         293167,
         620,
         315011,
         1678
      ],
      "original_title": "ウルトラマン",
      "runtime": null,
      "poster_path": "/iiTRb7mDDYloyjOPd5UFhWrevfR.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "TOHO",
            "id": 51905,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tsuburaya Productions",
            "id": 5905,
            "origin_country": ""
         }
      ],
      "release_date": "1966-07-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hajime Tsuburaya"],
      "runtime": 79,
      "synopsis": null,
      "writers": ["Mamoru Sasaki"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0204714/",
      "coverLink": null,
      "actors": ["Stars: Akiji Kobayashi, Susumu Kurobe, Sandayû Dokumamushi | See full cast and crew »"],
      "reviews": [
         "In the time of Godzilla and Mothra, there was a weekly tv series that crossed the Oceans and landed in America. We know it as \"Ultra Man\" and I can tell you, this series was magic to the kids on my block. Back in the mid-sixties, a cigar company put out a cigar that was enclosed in a thin glass covering. Every child I know wanted that glass covering because it WAS the \"beta capsule\" that would summon \"Ultra Man\" to Earth to save the World from Giant Monsters who wanted to do nothing but destroy us!!!! The story sorta goes like this.... The \"Science Patrol\" was on a routine mission with Hyata who got into an accident. He was saved and given this \"beta capsule\" to hold up to the sun to call for Ultra Man to help them against these monsters that would be out to destroy us. (I know I'm missing stuff, but come on, I was five years old when I saw it!!!!) The thing about Ultra-Man was that he could only spend a few minutes on our planet before he lost his super power, so he HAD to defeat the monsters in a few minutes or die! Also, Hyata was not around when Ultra Man was either so that left some skepticism with his fellow Science Patrol Members..is Hyata..or isn't he? Drama! Sure -- you will see the zipper in the back of Ultra-Man's suit and the rubber Monsters are to die for...but please, have an imagination! This was cool stuff back then! And I am sure you'll laugh about it now. So go out and get a copy! I adored Ultra Man for the fight scenes of course, and for wondering if Ultra Man would make it back in time or his power would run out before saving the earth of these monsters. This, the original Ultra-Man is the grand-daddy of them all. This is fun, it's dated by this time, but still well worth watching if you can get a hold of it. Accept no imitations. Ultra-Man was our 60's weekly dose of \"Godzilla\".....with a heart and human. He was our karate kickin' superhero we all wanted to act out in play-time for fun.",
         "I don't know of any other character that arouses child's interest to watch and emulate a superhero like this one. It's somewhat cheezy by today's standard, but idea was good, and there was fire to every story. Ultraman is a space policeman who comes from M-78 galaxy. He comes to earth chasing after a space villain which looks like a dinosaur called Bemular, and by accident kills a member of Earth Defense Force named Hayata. Ultraman tells Hayata that he will give his life force to him so he can survive, and also gives Hayata the means to transform into Ultraman. Hayata works for Capt. Muramatsu and he has several colleagues who works with him to fight the kaijyu menace that appears around Japan. The attraction of the show is that every episode there's a new monster Ultraman has to eradicate, and these monsters are really cream of the crop of kaijyu kingdom. I'm still hoping that Toho will resurrect a dinosaur called Gomorah in one of its movies. Ultraman lasted for 28 episodes until he lost to a space dinosaur called Zetton and was summoned back to M-78 galaxy. Soon after, many more space policemen from M-78 galaxy arrived keeping the franchise live. Most recent probably is Ultraman Tiga which I think was made under license in Australia. This was the second series Eiji Tsuburaya (special effects director of the original Godzilla '54) produced after forming his own Tsuburaya production, and spawned many spin off series after which continues till this day.",
         "In 1966 Mr. Eiji Tsuburaya of Godzilla (Gojira-Japanese) fame created a Japanese version of Saturday morning cartoons mixed with Thursday night WWF style wrestling matches. He called it Urutoraman. We called it Ultraman! It crossed the Western pond (Pacific) in 1972 and made it's way across America (with Ted Turner's help) on almost every independent station across the US. The bulk of those stations are now either UPN or Fox Network stations. Here in the DC area it aired on WDCA TV-20 every afternoon at around 2:30 or 3pm. It was a mad rush in my neighborhood to get off the school bus and get to the TV before the title credits began. Anyway here's a synopsis of the first episode which will give you a formula to figure out how all other episodes (and 28+ spin-offs) would operate. Space Patrolman Shin Hayata (he was only known as Hayata in the English dubs) is on patrol high above the country of Japan, when he spies two UFOs in an apparent dogfight/chase. Hayata reports to his shift's radioman (er woman I mean) Akiko Fuji (she was only ever called Fuji in the English dubs). Fuji and Captain Mura listen intently as Hayata gives them his report. Hayata gets in the way of another \"Space Patrolman's\" spacecraft (a red orb) and the two crash into the Earth together, near a lake. The \"bad UFO\" (a blue orb) damaged by the red UFO crashes into the lake near Hayata and the red orb. Hayata is killed. Nearby there are several kids camping who witness the entire event. As they look on, the red orb rises and levitates Hayata's dead body \"aboard\". Inside the orb, the pilot tells Hayata's body, \"I am Ultraman from the galaxy, M-78\". He further apologizes to Hayata for taking the poor man's life and offers his own life energy in exchange for taking his. Ultraman also explains that their lives would be thereafter \"tied\" together, and that whenever Hayata needs his help, to call him with the Beta Capsule. A microphone looking thing with a grey and black body, red button and a strobe light that will call Ultraman. Ultraman is now permanently attached to the earth and can ever-after never return home. It was suspected by me and my friends that Ultraman would \"fly\" or orbit around the Earth until called, but we never confirmed this. Now the monster in the blue orb regains his strength and begins to surface just as the rest of Space Patrol arrives, to search for Hayata. They attack the monster but do it no harm, and the foul thing hides itself at the bottom of the lake. Mura and his seconds begin to search for Hayata with the campers help, but do not find him. As they give up, Ms. Fuji arrives in another spaceship carrying the S-1, a submarine. Mura asks her why she is here, and she explains that Hayata asked her to drop the sub off in the middle of the lake. At this time Hayata (motorboating his way to the middle of the lake) radios Mura and briefly explains about the monster, and how to attack it. Captain Mura, Fuji and the rest of the team will attack from the air as Hayata attacks from under the surface of the lake. During the battle, both Hayata, and his teammates score several hits on the monster (I think his name was Baragon a reuse of another TOHO monster). The attacks seem to do Baragon no ill, but merely serve to tick him off royally. Baragon scores a hit on the S-1 and spits it out of his toothy maw, several hundred yards away, then blasts it with his energy ray, bursting it into flames. Hayata is trapped and his teammates look on in horror as there is nothing they can do to help. Hayata muscles the hatch open just before the sub explodes and calls for Ultraman. A battle between Ultraman and Baragon ensues. The Space Patrol watch what happens. Ultraman at his current height (180 meters I think?) begins to weaken, and in a brilliant guess of deduction, Ide (the goofy team member) deduces that the blinking light on Ultraman's chest indicates his power is waning and that he will soon die. Ultraman only has 3 minutes of time to defeat all of his (and Earth's) enemies. He always triumphs about 3 seconds before he dies, and in some episodes does \"die\", kills the monster and, then he flies off into the outer atmosphere to \"recharge\". Thus is how Ultraman saves the day, everyday for a half-an-hour. Great stuff!!!! As earlier stated, he (Ultraman or Eiji, depends on how you look at it) spawned 28+ spin-offs including Ultra-7 which was also spread across the US by Ted Turner. Ultra-7 and all of Ultraman's brothers, sisters, parents, friends, and seconds have similar powers, and limits to their powers. Ultra-7 for example usually appears man-sized (most of his enemies start this way too) when he is small he can last in the Earth's atmosphere for a much longer time. I suspect the Ultraman could have done this too, but this \"refinement\" was only used on later shows with other \"Ultramen/women\". Usually at the end of U-7 the bad monster would \"grow\" and so would U-7 in order to fight him. U-7 also had a human 'symbiote' but the catalyst this time was not a Beta capsule but a pair of \"glasses\" that when donned would turn the human into U-7. Other \"Ultras\" include Utraman Tiga, Ultraman Gaia, Ultraman's mother and father even showed up in a few shows of the other Ultras, and an Ultra-King as well. You can search for Tsuburaya dot com on the net and get even more info. I hope this was helpful to you. Cheers....I mean HAH!!!! (HAH was Ultraman's \"karate yell\") CYA.",
         "I got this film at G-fest in 2006. I was excited, but I was hopelessly let down. I enjoyed the action, even though there were only three fights. The thing that I hated was how the movie was only 4 episodes of the series spliced together. That is stupid. I'm just glad that I wasn't some kid in the '60s and saved all my allowance to just go to the movie theater and see something I've already seen on TV. I really hated how they used scenes from the first episode, and they used them all, except for the fight between Bemular and Ultraman! That was the most important part of the show! Instead, Hayata kills Bemular with a missile. They made it seem like the Science Patrol could carry on very well without Ultraman. It was just a waste of time.",
         "Most comments here seem to be confusing this movie with the TV series it was based on. This IMDb entry is for the 1967 compilation movie, which I'll review right now . . . CHOUHEN KAIJUU EIGA: URUTORAMAN (TOP COMPILATION MONSTER MOVIE: ULTRAMAN) is a feature-length compilation of the 1966 Tsuburaya Productions TV series, ULTRAMAN: SPECIAL EFFECTS FANTASY SERIES (URUTORAMAN: KUUSOU TOKUSATSU SHIRIIZU), and is distributed by Toho Company Ltd. (it was paired with their then-latest tokusatsu movie KING KONG ESCAPES). This is one of the few times the Toho logo ever had its own fanfare at the beginning. The movie uses the same exact type of opening credits as its small screen counterpart. The episodes used for this film are Episode 1 (\"Ultra Operation No. 1\"), which features Bemular, Episode 8 (\"The Lawless Monster Zone\") featuring Red King, Chandrah, Maglar and the Sufran plant, and the two-parter Episodes 26 & 27 (\"His Monster Majesty\") featuring Gomora (and the Sufran plant again). The choice of episodes used for this film is quite good, and makes for a very entertaining film (especially since I really like both Red King and Gomora; I have Bandai's big toys of them!). Fans of Toho's kaijuu eiga (monster movies) will especially love this, as the special effects and action are crazy, colorful and pack lots of punch! Eiji Tsuburaya and his talented crew can truly entertain audiences with ULTRAMAN, no matter what size the screen is. Unfortunately, the fight scene between Ultraman and Bemular for Episode 1 was notably omitted, probably for time (the Science Patrol destroyed Bemular quite easily, using a new shot of a red explosion over the lake). Also, the ending doesn't have much of a resolution and is somewhat abrupt. These are the weakest parts of an otherwise entertaining and action-packed movie! Highly recommended!",
         "i have been looking for this TV show for ten years waiting for it to hit video or DVD. i remember the American version. the good guys base was a mountain side they had these cool space fighters. the person who was ultra man had a special crystal to transform into ultra man.it was a kick butt show i loved it and want to See more of it if anybody knows where i can find it please let me know. you can reach me at chrismclark2@yahoo.com thank you i think that they should of kept this show on the air cause it was good. not too many shows last but this one is a classic. i did not know about the different version of the show i only remember the one that i saw when i was little. maybe others like it too and they can bring it back to TV i would love that",
         "Read the other comments first. Okay, so my vote is biased. I'm another \"child of the '60s\" that loved this show in my young age. As a young child, this was pure comic-book, sci-fi stuff, and larger-than-life. A different reality than 'Star Trek' but just as cool in my book at the time. Looking back on the first episode as an adult - I can say that they did the best they could with the special effects and the budget they had. To say that it was usually a formula plot line would be redundant (but I'll say it anyway). IE most of the time, it's something like this: ***** BEGIN Plot line ***** Big monster arrives on earth from outer space or as a result of a mad scientist tinkering with earthly species. The Science Team & (member) Hayata (other spellings have been posted - and I'm no expert) try to get rid of monster. The team's efforts prove mostly fruitless (except in a few episodes) Ultraman (being summoned by Hayata) saves the day with alien gung-fu, special effects, and pyrotechnics in the last few minutes. ***** END Plot line ***** * Intersperse with Japanese humor (and sometimes their interpretation of American 'slapstick' and 'stooge' humor) and a *really* cute radio-girl. For example: In reference to the \"beta capsule\" device that Hayata uses to summon Ultraman, one funny scene I remember was that the science team was eating a meal: Monster appears (from outer space or somewhere), Hiyata runs outside (so as not to alert the rest of the team to his bi-identity), grabs what he thinks is the beta capsule, holds it over his head, says the 'magic words' - and nothing happens. He looks up to find he's holding up his dinner fork. (Funny on a couple of levels - looking back on it, shouldn't he have held a pair of chopsticks?) And yes, they had \"to be continued...\" episodes - throwbacks to stuff like the classic \"Tiger Woman\" serials that ran before the \"B\" movies of the '40's. \"cliffhangers\" - look it up, google it, wiki it, or whatever. This series also featured \"drama\" episodes that essentially went beyond its own genre - in at least one episode I can remember, the \"monster\" didn't really want to wind up on earth, it was despondent and lonely and lost and angry about being here - and Ultraman didn't really want to hurt it. It brought tears to my eyes back then - and I think it still might now. If you can find this original series somewhere (or even original episodes of it), it's worth seeing, even if only for world cinema history purposes. But I would suggest rather that you just grab whatever video or rental of this you can find, kick your shoes off, let your imagination run, watch it, and be a kid again. I give the entire series a 6 out of 10 (remember, I'm biased), although there are some episodes that I would still give a \"10\". The lowering-of-rating factor comes from the fact that (much of the time) the plot lines were very \"formula\". The raising-of-rating factor is due to several things - one of which was that for that time, the series portrayed some character interactions more realistically so than many other series of that (at the time) sci-fi genre. The monsters weren't always blindly rampaging, sometimes the humans defeated the monster rather than having Ultraman deal with it all (or at least aided him critically), and that characters in the show cared about each other - which you drama students should know 'brings the audience in'. \"Monster defeat methodology\" got creative on some occasions, and there are beautiful cinematographic shots in the series of some really cool historic places in Japan. If you've enjoyed old sci-fi novels, the Power Rangers, Transformers, Doc Savage, the old Tarzan serials, black-and-white episodes of Flash Gordon, or the old Batman TV series, the Green Hornet, or any \"hero-based kids TV show of the '50s through the '70s\", then I think you'll like this series very much. Enjoy."
      ],
      "genres": ["Sci-Fi"],
      "productionCompanies": [
         "Toho Company",
         "Tsuburaya Productions"
      ],
      "summaries": [
         "While investigating two glowing ball-like UFOs chasing each other, Science Patrol officer Hayata is killed when one of the UFOs accidentally crashes into the Mini-VTOL he rode. The being inside, a giant silver & red alien from the Land of Light in the Nebula M78, feels terrible for the accident he caused. So he makes it up to Hayata by combining his own life-force with that of the Earthman, thus bringing him back to life. He also gives him a marker-like device called the Beta Capsule, with which in times of crisis, Hayata secretly transforms into the giant alien, heretofore known as Ultraman! This movie is actually combined from favorite episodes of the popular 1966 series: Episode 1 (\"Ultra Operation No. 1\") featuring Bemular (with the climactic fight scene omitted), Episode 8 (\"The Lawless Monster Zone\") featuring Red King, Chandrah, Maglar and the Sufran plant, and the two-parter Episodes 26 & 27 (\"His Monster Majesty\") featuring Gomora.",
         "A feature-length compilation of episodes of the famous Japanese sci-fi TV series about a futuristic policeman who secretly transforms into a giant extraterrestrial savior."
      ],
      "budget": 0
   },
   "movielensId": 109287,
   "movielens": {
      "languages": [""],
      "releaseDate": "1967-07-21",
      "dvdReleaseDate": null,
      "directors": ["Hajime Tsuburaya"],
      "runtime": null,
      "movieId": 109287,
      "title": "Ultraman",
      "mpaa": null,
      "actors": [
         "Akiji Kobayashi",
         "Susumu Kurobe",
         "Sandayuu Dokumamushi",
         "Masanari Nihei",
         "Hiroko Sakurai",
         "Akihiko Hirata",
         "Bin Furuya"
      ],
      "imdbMovieId": "0204714",
      "originalTitle": "Ultraman",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 418029,
      "avgRating": 3,
      "releaseYear": "1967",
      "numRatings": 1,
      "posterPath": "/k0YJzGkxXjzgfUInvBoynEVFf9K.jpg"
   }
}