{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "comedian",
            "id": 3485
         },
         {
            "name": "stand-up comedy",
            "id": 9716
         },
         {
            "name": "live comedy",
            "id": 9961
         },
         {
            "name": "comedy",
            "id": 10267
         },
         {
            "name": "adult humor",
            "id": 11192
         }
      ],
      "imdb_id": "tt0377515",
      "video": false,
      "title": "Bill Maher: Victory Begins at Home",
      "recommendations": [
         17229,
         32482,
         21576,
         21578,
         64350,
         61880,
         21056
      ],
      "backdrop_path": "/jOe8sNcT05sO6gM6vJjJFdQ0Q5Q.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Bill Maher",
            "gender": 2,
            "credit_id": "52fe4420c3a368484e010cc1",
            "name": "Bill Maher",
            "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
            "id": 74086,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4420c3a368484e010cbd",
               "name": "John Moffitt",
               "profile_path": null,
               "id": 87671,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4420c3a368484e010cc7",
               "name": "Bill Maher",
               "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
               "id": 74086,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.647755,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21580,
      "vote_count": 3,
      "budget": 0,
      "overview": "Maher addresses contemporary political, social and cultural topics -- Iraq, President Bush and the so called Axis of Evil. The opinionated Maher said about Victory Begins at Home: \"We've heard everything about the War on Terrorism except what we can actually do to help win it. The government used to do that for us through propaganda (the positive kind) posters, so taking my cue from the great old posters of World War I and World War II ('Loose Lips Sink Ships,' 'Buy War Bonds,' 'Plant a Victory Garden,' etc.) I commissioned artists to paint the posters our government today should be putting out to help us win this war.\"",
      "similar": [
         416477,
         435126,
         35595,
         812,
         703,
         49013,
         16290,
         62206,
         270946,
         39377,
         23483,
         51828,
         289,
         947,
         67308,
         14564,
         34509,
         4543,
         200133,
         21575
      ],
      "original_title": "Bill Maher: Victory Begins at Home",
      "runtime": 60,
      "poster_path": "/zDKd3KvsnyY0Z9f74mDwQMfeM1J.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Moffitt-Lee Productions",
         "id": 12088,
         "origin_country": ""
      }],
      "release_date": "2003-01-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Moffitt"],
      "runtime": 60,
      "synopsis": null,
      "writers": ["Bill Maher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0377515/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MDcyOTMzM15BMl5BanBnXkFtZTcwMDIyMzQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bill Maher | See full cast and crew »"],
      "reviews": [
         "Released a mere couple months after President Bush declared that \"major combat operations in Iraq have ended\", Bill Maher brought his trademark (and well-placed) cynicism and poignancy to the stage. It was also intriguing in the presentation, aside from the stand-up material itself; at the time Maher had a book out with parodies of 40's and 50's public service posters warning people. These come up several times behind Maher, and they aren't distracting, they help to add to the points in his act. He talks about the War, Bush, sexuality, and what went down with the 2000 election- \"I (bleep) my wife\" was one of the more memorable bits. I don't remember the special as freshly as I do of Maher's recent I'm Swiss comedy special, but I do remember having as many laughs as with the latest one, maybe more so due to it not being as familiar (Maher had either just started or was going to start his 'Real Time' show, and most of the points made here are new for the time). But as an added bonus if you can get the film on DVD is extra footage of an off-beat, hilarious Q & A with Maher and the audience. Some of it really catches him off guard, which is ironic as he seems to always be on his feet with his attack on stage and on his shows.",
         "I'm surprised Bill didn't get sniped at some point considering how actual freedom of speech, in practice, is dwindling. Nevertheless, Bill once again points out how ridiculous and over-simplified politics have become, and not just in America and not just \"politicians\". Societies all over the world have distorted views on what's best for everybody. And equally important is the fact that I laughed my ass off. My only criticism would be that this is one man's opinion, but that's really more of a warning to viewers than a shot at the performer himself. About 80% valid argument, 20% Bill's inner-monologue. But after all, that's what a comedian does. Just as a side note: Stand up comedy takes more courage that most people can dream of mustering, but when someone can do it without a hand-mic, that's a true sign of comfort.",
         "My exposure to Bill Maher had been limited for ages and it was only over the last year that I started watching HBO's Real Time and having regular contact with Maher. I generally enjoy him as a host and comedian on this show but I do tend to find that he seeks out the extreme viewpoint on most issues and sticks to it and sometimes can kill a good discussion by just sweeping across everyone with his view whether it is reasoned or reasonable. You can probably see where I am going with this because, as a stand-up, he isn't part of a discussion - he is the discussion and I was very aware that his \"bits\" are the entire show and was not sure what I would get. What I got was mostly solid political comedy with good points presented with energy and a certain amount of insight and, when this happens, it is actually pretty good. Of course if you totally disagree with him then it will only anger you but for me mostly I was agreeing enough to be caught up and probably find it funnier than it actually was. The problems come when Maher tries to do more anger than he can convincingly deliver. Some comedians do \"anger\" really well and make an act out of it, Maher doesn't and when he gets more worked up his points become exaggerated and simplified because they are easier to shout. There are a couple of times he loses the audience and doesn't get a reaction and he accuses them of not agreeing with him whereas I think they do agree with him, but not in the simplistic and shouty way he just put his point across. Of course his politics are pretty far out in some regards and there are times you just wonder, even as a liberal, where on earth he managed to get that viewpoint but mostly he can carry it here. So an acquired taste but those that like Maher in other things will enjoy this show because it is barbed and cutting even if he is not hilarious as a comedian. When he tries to get \"worked up\" though he stumbles because, as much as he wants to come over as \"outraged\" the truth is that he goes away from insight and ends up shouting simplistic and badly structured stuff at the crowd, which loses them as often as it fires them up.",
         "Bill Maher has spent the last decade as the host of \"Real Time with Bill Maher\", but has also done stand-up comedy. \"Bill Maher: Victory Begins at Home\" is a recording of a 2003 concert in New York. His material centers mostly on the Iraq War, the 2000 election, and the problem with religion. He includes what he recommends as wartime posters for the 21st century. I don't always agree with everything that Maher says. On the subject of religion it would be better if he was equally tough on all religions. Nonetheless I like what he has to say about the screwed up aspects of US society. One might call Maher a less forceful version of George Carlin: an avowed atheist who pontificates on how f**ked up everything is. I should note that since this is a decade old, some of the topics have become obsolete. I'll be eager to start watching \"Real Time\" once it starts up again.",
         "I am torn. I LOVE the political commentary. I thought his mockup of \"patriotic\" posters was brilliant & inspired. Unfortunately, he does fall into the same trap he accuses others of -- \"lumping\". He lumps Muslims together. And granted this probably came out before we found out soldiers were torturing detainees or that some of them had nothing to do with anything related to Iraq-- but still -- his dismissal of the treatment in Guantanamo came off as altogether insensitive. And when it comes to his views on gender... he lumps ALL women together! I HATE and completely disagree with him on nearly everything he says about women! He does nothing but perpetuate and reiterate tired old stereotypes. Women love shiny rocks and don't care if children in Africa are losing limbs? Really? Does he know any women or is he just too busy getting \"pu$$y\" as he always talks about - to actually talk to women? He believes that ALL men are incapable of fidelity? That ALL men would prefer \"new\" over commitment? (or that he doesn't think some women could feel/act that way too?) ALL women's fantasies are not ever sexual, only romantic? (and even if that were true- he doesn't seem to believe/understand the socialization component or that it could change). He dismisses some woman trying to explain to him about having been given nothing but romance novels & books would affect you-- and he refuses to entertain the notion of some middle ground... where men and women individually (not biologically) could how much of sexuality and fantasy they wanted (some, all, none, etc.) His insistence on the seeing BIOLOGICAL differences in women's/men's behavior, thoughts and lifestyles is so tired and old I can't believe he can't see through the bullshit on this issue as he can on so many others (religion, government, etc.) So, first half was fantastic, second half made me angry."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Moffitt-Lee Productions"],
      "summaries": [
         "Comedian Bill Maher's Tony Award-nominated Broadway standup show, Bill Maher: Victory Begins at Home, will return to New York, July 17-19, 2003. The final performance at the Hudson Theatre (which is not technically a Broadway house though it's in the midtown theatre district) will be filmed live for HBO. In the show, Maher addresses contemporary political, social and cultural topics -- Iraq, President Bush and the so called Axis of Evil. The opinionated Maher said about Victory Begins at Home: \"We've heard everything about the War on Terrorism except what we can actually do to help win it. The government used to do that for us through propaganda (the positive kind) posters, so taking my cue from the great old posters of World War I and World War II ('Loose Lips Sink Ships,' 'Buy War Bonds,' 'Plant a Victory Garden,' etc.) I commissioned artists to paint the posters our government today should be putting out to help us win this war.\"",
         "Bill Maher stars in his sixth HBO stand-up special, premiering LIVE from the Hudson Theater in New York!"
      ],
      "budget": 0
   },
   "movielensId": 109542,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-01-01",
      "dvdReleaseDate": null,
      "directors": ["John Moffitt"],
      "runtime": 60,
      "movieId": 109542,
      "title": "Bill Maher: Victory Begins at Home",
      "mpaa": "",
      "actors": ["Bill Maher"],
      "imdbMovieId": "0377515",
      "originalTitle": "Bill Maher: Victory Begins at Home",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Maher addresses contemporary political, social and cultural topics -- Iraq, President Bush and the so called Axis of Evil. The opinionated Maher said about Victory Begins at Home: \"We've heard everything about the War on Terrorism except what we can actually do to help win it. The government used to do that for us through propaganda (the positive kind) posters, so taking my cue from the great old posters of World War I and World War II ('Loose Lips Sink Ships,' 'Buy War Bonds,' 'Plant a Victory Garden,' etc.) I commissioned artists to paint the posters our government today should be putting out to help us win this war.\"",
      "tmdbMovieId": 21580,
      "avgRating": 2.75,
      "releaseYear": "2003",
      "numRatings": 6,
      "posterPath": "/zDKd3KvsnyY0Z9f74mDwQMfeM1J.jpg"
   }
}