{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0150488",
      "video": false,
      "title": "B.U.S.T.E.D",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Terry",
               "gender": 0,
               "credit_id": "52fe4b6b9251416c75102259",
               "name": "Goldie",
               "profile_path": null,
               "id": 1123329,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe4b6b9251416c7510225d",
               "name": "Andrew Goth",
               "profile_path": "/iDeeG4GaJTinXgFB4tGfqDTI0Ur.jpg",
               "id": 136141,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bernie",
               "gender": 2,
               "credit_id": "52fe4b6b9251416c75102261",
               "name": "David Bowie",
               "profile_path": "/7OIa363iSLG43x9Sb9HojUANwbh.jpg",
               "id": 7487,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe4b6b9251416c75102265",
               "name": "Rachel Shelley",
               "profile_path": "/vLBKrTSy29mMkydZXOukmHfGbSI.jpg",
               "id": 80385,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 1,
               "credit_id": "53a7fb74c3a3687a34004fef",
               "name": "Alicya Eyo",
               "profile_path": "/wpVlSrurGxM5vhMuqqgBxiT1Rd5.jpg",
               "id": 1105084,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4b6b9251416c75102255",
            "name": "Andrew Goth",
            "profile_path": "/iDeeG4GaJTinXgFB4tGfqDTI0Ur.jpg",
            "id": 136141,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.659166,
      "production_countries": [],
      "id": 145926,
      "vote_count": 4,
      "budget": 0,
      "overview": "Everybody Loves Sunshine (released in the United States as B.U.S.T.E.D.), is a 1999 British independent film written and directed by Andrew Goth, and starring Rachel Shelley, David Bowie and Goldie.  In the Pepperhill Estate of Manchester, an ongoing battle rages between Triad gangs and street gangs. Gang leaders Ray (Andrew Goth) and Terry (Goldie), who are cousins and lifelong friends, always trusting and relying on each other, have been in prison. Ray doesn't want to be a gangsters anymore, having also fallen for Clare (Rachel Shelley). But Terry, driven by an obsession beyond friendship, is determined to make sure that Ray never leaves the gang. During their time in prison, the Triads have grown stronger and more daring, eventually killing a member ofTerry and Ray's gang. Revenge is called for and the gang turns to them for direction. Bernie (David Bowie) is the aging gangster who struggles to keep the peace.",
      "similar": [],
      "original_title": "Everybody Loves Sunshine",
      "runtime": 97,
      "poster_path": "/jTkoSTLLfit2bEkAQgu5OuJ5Ugf.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-03-20",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Goth"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Andrew Goth"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0150488/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNzkyODc3Nl5BMl5BanBnXkFtZTcwNTQ0MTMyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Rachel Shelley, Clint Dyer, David Baker | See full cast and crew »"],
      "reviews": [
         "Saw this just earlier on THRILLERMax, Cinemax's suspense channel. I surmise the depictions of the locales, the club scene and the character's backgrounds are as indigenous to Londoners as BOYS 'N' THE HOOD would be to people from Compton, and ONCE WERE WARRIORS would be to those folks struggling in the metropolitan slums of New Zealand's larger cities. That said, if you're not a fan of EASTENDERS, Guy Ritchie or British flicks in general, you'll find it rough going deciphering most of the dialogue, never mind the street slang. Writer/director/star Andrew Goth makes like a Brit Spike Lee with a much better body and a thicker accent, with his freshman tale of two former prison mates just released, (how they are related is not really made very clear; are they brothers in the familial sense, or just brothers in crime?), and the different paths they choose to take once they're out. Ray (Goth) wants to turn his life around and use his connections to do good in the neighborhood and help out some struggling dance troupe/musician mates, while Terry (Goldie) has been, is and always will be content to live the life of a 'G-man.' I'm not familiar with Goldie's history as a singer/musician, but I did recognize him from his role in the ensemble cast of SNATCH. I'm sure that Goth's playing it low-key was the choice he thought was right for Ray, and he does have a magnetic, physical presence that is undeniably compelling. But if his acting even equals what success I've read about him having as a musician, Goldie has quite a future ahead of him. He is as mesmerizing and terrifying in his psychopathic portrayal of an unhinged street thug as anything ever essayed on-screen by actors of the same mold, (think Ice-T), and manages to rip the movie out of Goth's muscular grip every time they appear in a scene together. Besides hungering for the one thing that he is willing to give to no one else: respect, Terry also has some kind of psychosexual obsession/fascination with his \"brother.\" Kind of makes you wonder if anything went down between them behind bars... Though I'm not an aficionado of the club scene or the music, the soundtrack was good, and definitely appropriate for the scenario. David Bowie's performance may seem stilted by comparison with the work he's done in other films, especially THE HUNGER and THE MAN WHO FELL TO EARTH, but then B.U.S.T.E.D. is not a showcase for him--it's allegedly Goth's baby, and I think he does a more-than-credible job with what little he's given to do. The movie overall could've used a trim in some places where it definitely moves too slowly. Violence junkies won't find nearly enough to hold their interest, though there's enough misogynistic vibe to turn off any potential female viewers, as the pathologically jealous Terry assaults and tortures Ray's new girlfriend, (the comely Rachel Shelley), and the grisly death of a central character and his young son are shocking enough, IMHO. The ending is meant to be a jaw-dropper, but it's curiously unsatisfying, especially since not nearly enough was made of the Ray/Terry relationship to warrant the gasps it was meant to elicit from the audience. Still, overall, it wasn't a bad start, and should Goth choose to give Hollywood a shot, he has shown that he has the basic knowledge (not to mention the looks) to attract some pretty serious attention. Ditto for Goldie, though I'm afraid that after this and SNATCH he could very well find himself typecast; all the more reason for him to keep his musical \"day job,\" just in case.",
         "I saw this on cable and was mesmerized. Then I tried looking up the title to buy the DVD but had a hard time. Even on IMDb its listed as Everybody Loves Sunshine instead of B.U.S.T.E.D. why? who knows. Anyway, Goldie rips the screen apart with his mean streak and doesn't stop. Very convincing. His character in Snatch not only looks so physically different but is the complete opposite. Good range. Bowie of course is Bowie, downplayed here but it never matters what he does, it's good. Goth has serious presence and the juxtaposition of his demeanor to the rest of the people around him is the perfect ingredient. Like I mentioned, I liked it enough to get the DVD. But the soundtrack is near impossible to find. At least for me.",
         "Would a reforming gangster really hang about with a chubby postman a gay dancer and a born again Christian youth worker?? I saw this last night and coudn't believe the car crash of a film this is! So bad it's chuckle some. The dance scenes were idiotic and the writer/director/star giving himself a sex scene was embarrassing.Can't really comment on the acting as i didn't witness any, Bowie wasn't bad though, seemed to have wandered in from a Guy Ritchie movie. Why did Goldie kidnap the love interest? Why was Bowie not the leader of the mob? How did Goldie kill a cop with a gun that had just run out of bullets,how?HOW?? Please don't let this \"artist\" make any more movies.",
         "Based in MANCHESTER not London: they are 2 totally different cities and cant be confused with each other. Revolves around the huge gang problems found in Manchester in a mock Lock, Stock.. style and also trying to emulate the panache of a Tarantino. The film fails at both though!It is worth a watch for an alterantive British movie although the mediocre cast could never have made the film great - especially equipped with one of the poorest scripts I've ever seen. Bizarre fact is that the films countryside shots were filmed on the Isle Of Man in the Irish Sea - even though Machester is surrounded by huge amounts of land identical to that found on the Isle Of Man!",
         "A slow crime drama with wasted potential, because it delves too much into current musical trends, hence two occasions in which we are forced to watch guys dance like pansies, and hence a couple of people from the music world in lead roles. Goldie is okay as the obligatory gangster movie psycho, if nothing than simply because of his Cro-Magnon appearance. Bowie, on the other hand, is ridiculously miscast as the leader of a gang of young blacks! Somehow I could never quite buy Goldie's far too extreme resentment of his cousin's girlfriend; somehow (homosexual) jealousy doesn't quite explain it enough. The end is also unsatisfactory: Bowie informs Goldie's cousin that the latter started the gang war and that Bowie's girlfriend was kidnapped and tortured, and then instead of seeing the cousin's reaction - and seeing the girlfriend, too, there's merely end-titles on the screen!",
         "A great first-time film for Andrew Goth which is sure to disappoint a lot of Americans who seem to be able to decipher Bostonese, but have a hard time with English... The dialogue is gritty street slang, and the locales are real - the dismal British version of the working-class inner-city, telling the story of two gang-lords freshly sprung from prison. Goldie and Andrew Goth are cousins/brothers (it's never quite explained fully) and Goldie is basically obsessed with Goth (in a psycho-sexual kind of way). So when Goth decides to ditch the gangsta scene and hooks up with beautiful girl, Goldie naturally goes nuts and starts killing people. Goth plays the part of the emotionally torn ex-gangsta well, trying to spend time redeeming himself at the local youth-club helping kids. The people there naturally distrust him at first for his former lifestyle, but they bond quickly enough to form a distinctly British version of a break-dance-troupe. Goldie is brilliant as a thug - he probably draws from what he's seen as a younger lad - and plays a psychotic looney quite well... almost a little too convincingly - it's interesting to see him be the one NOT interested in music. There is a sub-plot of Chinese gangs, which lends itself to some interest and is used to drive the plot, but is not explored quite enough. And then there's the presence of David Bowie, quite likely the reason people will rent this. He plays a cold, emotionless consiglieri and lawyer (homage to Godfather?) who keeps the gang's \"honest\" dealings, while blindly ignoring the murder and drug-pushing. Bowie plays the small but integral part brilliantly, in a very cold and sterile manner, proving his talent as an actor. The movie is a great view into the criminal underworld of England - sometimes not understandable to Yanks who look to the gloss and floss of gangsta-rap and New Jack City for their dose of so-called criminal reality. This is a real world that the characters live in, where the poor people live side by side with drug pushers and killers, trying to survive despite the carnage and crime. Highly recommended, but with a caveat - it isn't an Ice T rap video stretched out for 2 hours... This is decidedly British, with a lot of reference to their club, as well as inner-city culture, which differs greatly from the American version. Thus most of the movie will likely be undecipherable to American suburban white kids bred on MTV.",
         "What the....? Nonsense. Absolute nonsense. My roomate picked this movie out on a whim because I think he wanted to see David Bowie act (which he doesnt do well at all) and see some mindless violence (which there wasn't nearly enough of to keep you interested in a boring, barely understandable plot). First let me start off by saying that if you are not from Europe there's a good chance you are missing half of the dialogue in the movie which may explain why I was confused at times as to what was going on. Next.... what was up with the four guy dance troupe running a preschool and hanging with the gangstas? I wasn't even sure what kind of group they were until they actually performed later in the movie. Were they a band? Dancers? Nothing at all? They kind of just hung out at the preschool smoked joints when they got flustered and did some kind spin move every now and then. Ridiculous. I'm not even going to get into their performance later in the movie. David Bowie... he was a decent actor in the 80's. His perfromance in The Hunger was great and even his character in Labryinth was done well, but in this he sucks. Sucks bad. He plays the homosexual gang leader (i think) and displays no emotion, even when he's holding a dying friend in his arms trying to keep him alive he elicits nothing, nothing at all. Very wooden performance is the best way to describe it. Whoever edited the movie did a horrible job, it was never clear what happened to certain characters at certain points which just added to the confusion when you couldn't figure out what they were talking about. \"Got some sugarpuss?\" I think thats what I heard the main character say to a girl at one point but I don't know what that means. Food or sex? Didn't matter I guess. On a positive note, there were some darn cool cars in the movie and some of the music wasn't half bad when there wasn't ridiculous Color Me Badd dancing going on. And lastly the ending scene could have been very powerful if the rest of the movie had enough substance to back it up and get you into it. But it didn't. Skip it.",
         "Despite the low budget and often unfocused script, this gangster thriller from Andrew Goth proves to be quite absorbing. Notable for a fleeting appearance by David Bowie as a camp underworld villain who loves to say \"Sweet as a nut\" a lot, this is really a vehicle for Wolverhampton's Goldie, the best selling musician and now actor who looks like he was born to plays bad guys. It's an often violent affair with Goldie's character proving to be a little too terrifying, especially when he assaults gorgeous newcomer Rachel Shelley. Some memorable scenes: Goldie, his head framed almost in a religious aura; the Black Rain style face off with Chinese gangsters and a decent dance number near the movie's finale. Reminiscent of Danny Cannon's The Young Americans, this looks to be a suitable calling card for any Hollywood producer looking to hire Goth for an American project. No classic but try and stick with it as there are a few diamonds in the rough.",
         "Just briefly. The story is average, actually, two of them. The gangster story starts the movie, introducing us to the gang clashes between english and chinese gangs. One of the members wants out, to become involved in techno music. This movie is not about betrayal, but about obsession. The gang is not the old gangster type (Michael Caine type). These have a background in urban english techno clubs. Goldie is, naturally, excellent in this environment. The movie has good looks, the actors look cool, but some of the characters are undeveloped (Bowie has very little to do). The cars, which are kind of a trademark of the gang, look really good. The music is excellent. I am not a big fan of techno, but this was super. When those cars pool by, you hear great techno music, which follows them. The truth comes out at the very end, but I mean end. A little unorthodox way to wrap things up. And then you realize that there was no big stand-off, that you're not sure what happened (OK, you can guess, but not all). All in all, not bad, but not great either. Nix.",
         "What an awful, awful film. I saw a few years back, drawn by Goldie and Bowie, whose music I enjoy, the last time I've made that mistake. Bowie and Goldie, limited as actors but effective in the proper roles, did fine here, but rather than get a film which assigns them one note characters in order to better focus the viewer on the fact that the director is edgy, the writer is subtle, and the main actor has a great body, is a great dancer, and rivals Deniro in talent. All three are Andrew Goth, and all three sucked out loud, especially in scenes so irrelevant to the plot and narcissistic that they are painful to watch. For instance... Did you know the main character, Ray, played by Goth is an honorable thug, but also a greater dancer? Does he pursue a dancing career in the film or is the dancing otherwise relevant to the plot? You ask. No, but it's crucial that we have a long scene about him being a great dancer, just like we need a long scene to see that he can do a lot of pull ups, in order to understand that Nietzsche's Ubermensch walks the earth and is named Andrew Goth, I mean Ray. Oh yes, and the movie is about a couple friends released from prison, one determined to go straight and one who is a psycho. Comic mayhem ensues. The movie was memorably bad, which is an accomplishment I suppose, in an \"Ed Wood\" sort of way, since I've already forgotten so many mediocre films, but \"Busted\" aka \"Everybody Loves Sunshine\" has stuck with me, and even now recalling it, I have to shake the bad off my skin like so many wet slugs. Yuck!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "BV Films International",
         "Gothic Films",
         "IAC Holdings Ltd."
      ],
      "summaries": ["Two toughs from the wrong side of the tracks in Manchester, choose different paths when they are released from prison. The quiet Ray wants out of the 'gangsta' life and into the local music scene with his pals, while his brash, emotional partner Terry wants to dominate the city's criminal community. His strange fixation with Ray and his pathological need for respect that he cannot show to others in return, lead him to make some impulsive moves that result in violent death and tragedy for all concerned."],
      "budget": 0
   },
   "movielensId": 109522,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-03-20",
      "dvdReleaseDate": null,
      "directors": ["Andrew Goth"],
      "runtime": 97,
      "movieId": 109522,
      "title": "B.U.S.T.E.D",
      "mpaa": null,
      "actors": [
         "Goldie",
         "Andrew Goth",
         "David Bowie",
         "Rachel Shelley",
         "Alicya Eyo"
      ],
      "imdbMovieId": "0150488",
      "originalTitle": "Everybody Loves Sunshine",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Everybody Loves Sunshine (released in the United States as B.U.S.T.E.D.), is a 1999 British independent film written and directed by Andrew Goth, and starring Rachel Shelley, David Bowie and Goldie.  In the Pepperhill Estate of Manchester, an ongoing battle rages between Triad gangs and street gangs. Gang leaders Ray (Andrew Goth) and Terry (Goldie), who are cousins and lifelong friends, always trusting and relying on each other, have been in prison. Ray doesn't want to be a gangsters anymore, having also fallen for Clare (Rachel Shelley). But Terry, driven by an obsession beyond friendship, is determined to make sure that Ray never leaves the gang. During their time in prison, the Triads have grown stronger and more daring, eventually killing a member ofTerry and Ray's gang. Revenge is called for and the gang turns to them for direction. Bernie (David Bowie) is the aging gangster who struggles to keep the peace.",
      "tmdbMovieId": 145926,
      "avgRating": 2.5,
      "releaseYear": "1999",
      "numRatings": 1,
      "posterPath": "/jTkoSTLLfit2bEkAQgu5OuJ5Ugf.jpg"
   }
}