{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "ex-girlfriend",
            "id": 1595
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "musical",
            "id": 4344
         }
      ],
      "imdb_id": "tt0036882",
      "video": false,
      "title": "Great Freedom No. 7",
      "recommendations": [],
      "backdrop_path": "/nbKMcedGd9skKqfNvid9FZGASu4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hannes Kröger",
               "gender": 2,
               "credit_id": "52fe438a9251416c750146c9",
               "name": "Hans Albers",
               "profile_path": "/pblBTtgHt9jf0DzsxTKwKn1LTnI.jpg",
               "id": 2899,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gisa Häuptlein",
               "gender": 0,
               "credit_id": "52fe438a9251416c750146cd",
               "name": "Ilse Werner",
               "profile_path": null,
               "id": 65675,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Willem",
               "gender": 0,
               "credit_id": "52fe438a9251416c750146d1",
               "name": "Hans Söhnker",
               "profile_path": "/qjE8uzAwDmDMd8xJquF9Ivu9dTA.jpg",
               "id": 18546,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Anita",
               "gender": 1,
               "credit_id": "52fe438a9251416c750146d5",
               "name": "Hilde Hildebrand",
               "profile_path": "/n7rQBfOx6co1cZAVtwDSaUVpToB.jpg",
               "id": 65679,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Fiete",
               "gender": 2,
               "credit_id": "52fe438a9251416c75014703",
               "name": "Gustav Knuth",
               "profile_path": "/mVaZRIWxkWLWaYNin0lgnT9S14E.jpg",
               "id": 6254,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Jens",
               "gender": 2,
               "credit_id": "52fe438a9251416c75014707",
               "name": "Günther Lüders",
               "profile_path": "/w41oB8t03nFMII3G5XWRjZs9fsM.jpg",
               "id": 20883,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Gisa's mother",
               "gender": 0,
               "credit_id": "52fe438a9251416c7501470b",
               "name": "Ilse Fürstenberg",
               "profile_path": null,
               "id": 2914,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Karl",
               "gender": 2,
               "credit_id": "52fe438a9251416c7501470f",
               "name": "Helmut Käutner",
               "profile_path": "/yH9QOB55jFjMwGt3k5h6edO7wpi.jpg",
               "id": 26436,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 0,
               "credit_id": "56e5352dc3a3685a9e00673b",
               "name": "Ethel Reschke",
               "profile_path": null,
               "id": 46510,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 0,
               "credit_id": "5a9aa8c892514128af01cd6c",
               "name": "Maria Besendahl",
               "profile_path": "/iv4qhHMJoEGBReosCCC5qNcrMlM.jpg",
               "id": 22768,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 2,
               "credit_id": "5a9aa8efc3a3680b7d01f22e",
               "name": "Rudolf Koch-Riehl",
               "profile_path": null,
               "id": 47263,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe438a9251416c750146db",
               "name": "Richard Nicolas",
               "profile_path": null,
               "id": 65680,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe438a9251416c750146e1",
               "name": "Helmut Käutner",
               "profile_path": "/yH9QOB55jFjMwGt3k5h6edO7wpi.jpg",
               "id": 26436,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe438a9251416c750146e7",
               "name": "Helmut Käutner",
               "profile_path": "/yH9QOB55jFjMwGt3k5h6edO7wpi.jpg",
               "id": 26436,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe438a9251416c750146ed",
               "name": "Hans Tost",
               "profile_path": null,
               "id": 69933,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe438a9251416c750146f3",
               "name": "Werner Eisbrenner",
               "profile_path": null,
               "id": 38034,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe438a9251416c750146f9",
               "name": "Werner Krien",
               "profile_path": null,
               "id": 40987,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe438a9251416c750146ff",
               "name": "Anneliese Schönnenbeck",
               "profile_path": null,
               "id": 51367,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.354313,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 10574,
      "vote_count": 5,
      "budget": 0,
      "overview": "Singing sailor Hannes, who entertains the crowd in St. Pauli's Hippodrom, promises his dying brother to take care of his ex-girlfriend Gisa. Taking Gisa to Hamburg to live with him, Hannes slowly falls in love with her, but soon has to face Gisa's affection for Willem.",
      "similar": [
         334,
         858,
         745,
         4347,
         401,
         1365,
         1562,
         11631,
         425,
         8967,
         1374,
         8587,
         111,
         637,
         69,
         2288,
         244772,
         277216,
         11012,
         433
      ],
      "original_title": "Große Freiheit Nr. 7",
      "runtime": 109,
      "poster_path": "/vcapkXETq3HREw0yqXoFh6ur8bJ.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Terra-Filmkunst",
         "id": 4784,
         "origin_country": ""
      }],
      "release_date": "1944-12-15",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Helmut Käutner"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Helmut Käutner",
         "Richard Nicolas"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0036882/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzM5NTA4MTQ5MF5BMl5BanBnXkFtZTcwNDE0OTAzMQ@@._V1._CR20,57,276,401_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Hans Albers, Ilse Werner, Hans Söhnker | See full cast and crew »"],
      "reviews": [
         "In this poignant tale of Hamburg's Saint Pauli district, a former seaman, now a singer in a sailor's nightclub, opposes his girl's love for a dockworker. Directed by Helmut Kaeutner in 1943/44, this film enjoyed enormous postwar popularity in East and West Germany. Kaeutner makes a stunning use of the new Agfacolor material, and Hamburg never looked more mystical. The film was shot on location and Berlin, but after the air raids in both cities, completed in Prague. Goebbles didn't particularly like this film and didn't allow it to be shown in the Reich. Therefore, German audiences only got to see this movie after 1945. Hans Albers is brilliant, and for fans of him this movie is an absolute must. I personally must have seen this one 8 or 9 times already. The movie also features a couple of good songs, sung by Hans Albers. \"La Paloma\" is probably the most remembered tune of this film.",
         "As always going against the grain Käutner made another film that was not appreciated by Goebbels; this one was allowed showing only outside Germany. Main reason: German sailors and women do not act as shown in the film. From directing till script, from acting till (Agfa colour) photography this is a brilliant film, with everyone involved giving best of their talents. What we see is a compelling drama, well balanced, psychologically well conceived and at the same time a film that is great fun to watch over and over again. In this film there are only people and their lives who are not up to standard Nazi definition. There are also great songs, including the bitter \"Beim ersten Mal tut's noch weh'\", sung superbly by Hilde Hildebrandt. There is one minor distraction: Käutner is beside the mark with the dream sequence, with which we could have done without. On the other hand, who cares: this film is made from the heart. With Romanze in Moll and Unter den Brücken this is the best of Helmut Käutner.",
         "In Great Freedom no. 7 we are once again faced with an excellent piece of film work by the mid-century German master, Helmut Kautner. The story, as is common with his films, focuses on a love triangle and also uses sailors and their transitory way of life as a complication to this triangular arrangement as he does in Under the Bridges. He also reprises the theme of musicianship which he uses for characters in most of his films, from the composers in In Those Days and Romance in a Minor Key. As usual for Kautner, the film employs a more mobile and freewheeling camera. Zooms and pans are used to convey shifts in relationships, for example when Gisa is talking to her mother just before leaving the farm. Of particular note in this film is the dream sequence experienced by Hannes. Through this sequence Kautner explores the possibilities of manipulating colors, pushing the boundaries of the new technology. His use of form in this sequence is also worthy of discussion. The slanting angles and semi-realistic sets that he uses, especially when Hannes and Willem are fighting on the ship, are reminiscent of the German Impressionist films of three decades before. This application of an earlier film style is particularly well suited to the content of those scenes, as German expressionism was an attempt to externalize onto the environment the internal attitudes of the characters its modes and tropes lend themselves quite well to hallucinations and dream sequences. In this film Kautner once again presents a sort of timeless, a political Germany. Even though the film was produced under the grip of one of the most brutal regimes in history, and was a thorn in the side of Joseph Goebbels, there are no traces of the political climate of the day, let alone anything resembling propaganda. The characters exist in a Germany that is modern and recognizable, but is clearly not the Germany that the audience knows. This feature of Kautner's films during the war years seems to have been an attempt to remind people of their essential humanity, even among the horrors of war and the domination of a brutal government.",
         "I had gotten the VHS version sometimes back. It was a good print but soft focus transfer. It was transfered from pal version probably brightness turned down to bring out the colors. I later bought the DVD version. It was more sharper and brightness turned up a bit. I had gotten the story wrong I had thought Gisa ,played by Ilsa Werner actress also a singer who had participated in early TV in Nazi Germany also known for her whistling, was Hans brother daughter making her Hans niece but I got it cleared. In this picture she's shows her acting skills. I'm surprises that Kautner did't have a singing scene in this movie for her but shes was totally dramatic. Because of her participation in Wunsckonzert, by force, she was suspended for 1 year from acting in Germallywood. The story, Hans brother, Jan, dies. He promises took look after his girl friend Gisa.He goes to where she works, with her mother, and offers her his benefaction. Bored and wanting to sees St Pauli she takes the offer. He is rather unhappy because he'd like to go back to the sea but he can't.He sings at his girl friends night club call ,the Hypodrome. The Girl friends ,played by Hildt Hildabrandt, the Mae West of German cinema. His ship friends played by Gustav Knuth and Gunther Luthers, come off from the ship they work at the Padua.Well later on as Gisa is buying bear and food for Hans when he comes back from work. A ship mechanic notices her ,played by Hans Sohnker, and becomes interested in her .She later works at a shop selling ties so he makes his introductions to her by buying a tie. Behind Hans back she decides to go out with Wilhelm. Later on Hans finds out and they almost have a fight. They end up confronting each other at the hippodrome and end up in a fist fight. Gisa leaves Hans and a suggestive sex before marriage, after math, is shown. In the U.S.A at the time because of the production code such scene would not been allowed in American films.Hans wants to marry her but later finds out what happens. He ends up going back to the sea to work on the Padua. The Agfa color cinema photography was great. Even though I had trouble understanding what they were talking about the acting was excellent. Why did they have Gustave Knuths hair shaved?He was still lean ,later on he'd put on a few pounds in other movies,like Sissie series, in which he played Romy's father.This would encourage a sequel or what looks like a sequel in the fifties. Recently in Febuary this was shown at a film series in Harvard college,I think, for the first time with American subtitles. This is when i discovered why i was so drawn to the filmmaker Helmut Kautner. He did 2 American films for Universal in the late deifies.One i saw on American Movie Channel ,befor it went down hill. June Allisons last film in which she played a lead,Stranger in my arms, which was not about ordinary people. Available at German war films dot com"
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Terra-Filmkunst"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 109667,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1944-12-15",
      "dvdReleaseDate": null,
      "directors": ["Helmut Käutner"],
      "runtime": 109,
      "movieId": 109667,
      "title": "Great Freedom No. 7",
      "mpaa": "",
      "actors": [
         "Hans Albers",
         "Ilse Werner",
         "Hans Söhnker",
         "Hilde Hildebrand",
         "Gustav Knuth",
         "Günther Lüders",
         "Ilse Fürstenberg",
         "Helmut Käutner",
         "Ethel Reschke"
      ],
      "imdbMovieId": "0036882",
      "originalTitle": "Große Freiheit Nr. 7",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Singing sailor Hannes, who entertains the crowd in St. Pauli's Hippodrom, promises his dying brother to take care of his ex-girlfriend Gisa. Taking Gisa to Hamburg to live with him, Hannes slowly falls in love with her, but soon has to face Gisa's affection for Willem.",
      "tmdbMovieId": 10574,
      "avgRating": 3.5,
      "releaseYear": "1944",
      "numRatings": 2,
      "posterPath": "/vcapkXETq3HREw0yqXoFh6ur8bJ.jpg"
   }
}