{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "ninja",
            "id": 10278
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "strong language",
            "id": 18402
         },
         {
            "name": "adult animation",
            "id": 161919
         },
         {
            "name": "stick figures",
            "id": 209212
         }
      ],
      "imdb_id": "tt2312262",
      "video": false,
      "title": "Dick Figures: The Movie",
      "recommendations": [
         269026,
         150879,
         254251,
         16976,
         44267,
         46874,
         135832,
         30871,
         79133,
         72443,
         32163,
         259233,
         62843,
         25764,
         13586,
         239367,
         38047
      ],
      "backdrop_path": "/1RdDt9EueqHlzohjWyB3j4QKzg0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Red / Raccoon / Cpt. Crookygrin / Son-san / Mr. Dingleberry / Mama-san / Wife-san / Grandson-san / Japanese School Girl / 8-Bit Gelato Bene / Nep-Dawg / Jacques Bon / Zeus (voice)",
               "gender": 0,
               "credit_id": "52fe4df89251416c751471db",
               "name": "Ed Skudder",
               "profile_path": null,
               "id": 1208179,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Blue / Narrator / Trollz0r / Shaw (voice)",
               "gender": 0,
               "credit_id": "52fe4df89251416c751471df",
               "name": "Zack Keller",
               "profile_path": null,
               "id": 1208178,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lord Takagami (voice)",
               "gender": 0,
               "credit_id": "52fe4df89251416c751471e3",
               "name": "Eric Bauza",
               "profile_path": "/afOlsVPQxbtkom604MeCemjlwEV.jpg",
               "id": 89599,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lord Tourettes (voice)",
               "gender": 0,
               "credit_id": "52fe4df89251416c751471e7",
               "name": "Ben Tuller",
               "profile_path": null,
               "id": 1278144,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4df89251416c751471d1",
               "name": "Zack Keller",
               "profile_path": null,
               "id": 1208178,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4df89251416c751471d7",
               "name": "Ed Skudder",
               "profile_path": null,
               "id": 1208179,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53f7f93b0e0a267a72000935",
               "name": "Nick Butera",
               "profile_path": null,
               "id": 1355824,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53f7f9490e0a267a69000923",
               "name": "Andy Fiedler",
               "profile_path": null,
               "id": 1355825,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53f7f9580e0a267a6f0008cc",
               "name": "John Evershed",
               "profile_path": null,
               "id": 68881,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "554addc6c3a3685e55000c49",
               "name": "Miles Thompson",
               "profile_path": null,
               "id": 1460450,
               "department": "Crew",
               "job": "Thanks"
            },
            {
               "gender": 0,
               "credit_id": "554ae73092514146a5000ccf",
               "name": "Alex Butera",
               "profile_path": null,
               "id": 1464455,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "554ae73992514103d2000201",
               "name": "John Dusenberry",
               "profile_path": null,
               "id": 1464456,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "554ae742925141469c000c9d",
               "name": "Dan Forgione",
               "profile_path": null,
               "id": 1464457,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "554ae74b92514103d2000209",
               "name": "Brock Gallagher",
               "profile_path": null,
               "id": 1464458,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "554ae75dc3a3685e4e000d1a",
               "name": "Anna Hollingsworth",
               "profile_path": null,
               "id": 1464459,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "554ae780c3a3685e50000c90",
               "name": "Rafael Hurtado",
               "profile_path": null,
               "id": 1460507,
               "department": "Art",
               "job": "Background Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 1.032263,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 222671,
      "vote_count": 11,
      "budget": 313411,
      "overview": "Two best friends, Red and Blue, risk everything to find the greatest treasure of all time.",
      "similar": [
         429733,
         979,
         10090,
         141733,
         281957,
         4771,
         281,
         8067,
         6312,
         434873,
         30877,
         8012,
         948,
         395834,
         339692,
         357096,
         9093,
         7516,
         8363,
         4141
      ],
      "original_title": "Dick Figures: The Movie",
      "runtime": 73,
      "poster_path": "/7bhQTnufFYcCvVdHRfngekwLL3T.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mondo Media",
            "id": 18757,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Six Point Harness",
            "id": 5615,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Remochoso",
            "id": 30792,
            "origin_country": ""
         }
      ],
      "release_date": "2013-09-16",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Red and Blue and Awesome All Over!",
      "adult": false,
      "homepage": "http://www.mondomedia.com/shows/dick-figures-the-movie/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Zack Keller",
         "Ed Skudder"
      ],
      "runtime": 73,
      "synopsis": null,
      "writers": [
         "Zack Keller",
         "Ed Skudder"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2312262/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3NDk1NTUzNTJeQTJeQWpwZ15BbWU4MDYzMjAzMDAx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ed Skudder, Zack Keller, Eric Bauza | See full cast and crew »"],
      "reviews": [
         "Before this movie is watched it's important to remember what it is, namely a film geared at people familiar with the franchise. By producing the film independently it contains the same humour, animation and production quality as the web series, but in a refreshingly new form. There's some notably well put-together scenes and the film as a whole was generally enjoyable to watch. Turning a short web cartoon into a film could almost only go wrong but they have managed to pull it off. It would be great to see where the series goes next for the pair, but let's see how this film rides out for them.",
         "For those who have seen every single episode of the web series at least twice and have grown to really enjoy the series, will love this film adaptation. It has some really well animated and written scenes. The second time through watching I found myself pausing the movie and reading things in the background or on the walls; I found there were many throwbacks to old movies, video games and pop culture. The plot was a little jumpy from place to place, but this was blended in by the writing that is often found it the web series shorts. The action is great, the laughs are awesome, and the story is fun. This film adaptation is a great work and it will be interesting to see what happens to Red and Blue in the future.",
         "Well to be completely honest, Dick Figures The Movie was not the knee-slapper I expected it to be. There were a few funny moments but I never laughed very hard. BUT! The plot line and all of the action in the movie still made it one of the best Movies I've ever seen! I also loved how much detail there was in every scene compared to the show. I love how much Ed and Zach put into this movie and they did a fantastic job! I loved how some of the stuff in the movie comes from things that were said in the show. For Example in the episode where they play poker and tell manly stories, the Raccoon tells of how he slaughtered thousands of warriors with the great sword of destiny and how the sword was lost, which pretty much sets up the whole plot line of the movie! This movie was not as funny as I had expected unfortunately, but it was still one of the best movies I've ever seen and I really wish it had gone on the big screen. That would have been epic. I really did get my money's worth from the $30 i donated to help make the movie!",
         "\"Dick Figures: The Movie\" is a hilarious epic story about two friends named Red and Blue and their quest to recover the legendary Sword of Destiny. If you're looking for a great comedy, this is it. This movie has action, drama, and of course a hefty dose of raunchy humor. This is definitely not a kids' movie, as you might infer from the title. There is a lot of profanity, sexual references, violence, and more. Think \"South Park\" without the annoying voices. I recommend this for anyone who likes movies such as \"Pineapple Express\", \"Ted\", \"Dumb and Dumber\", \"Shaun of the Dead\", or others like that. It has some stoner humor like Pineapple Express, a cute talking animal like Ted, a hilarious epic road trip like Dumb and Dumber, and tons of action and one-liners like Shaun of the Dead. Some of the humor is related to the original web-series, so you'll get more out of it if you watch some Dick Figures episodes first. They are all free on YouTube. Bottom line: if you haven't seen it, check it out!",
         "Zack Keller and Ed Skudder have, after setting up a Kickstarter campaign, and lots of hard work, finally released the long awaited \"Dick Figures:The Movie\" for fans of the web series. Compared the the Mondo web series \"dick figures\" on Youtube, it has an improved animation style. The backgrounds are more detailed, helping make the surroundings feel more lively. The fight scenes in this film are excellently animated, and fans will definitely not be disappointed by these. The film however does have some shortcomings. The writing style is reminiscent of the web series, and while the type of humor works well for short animations on Youtube, it is less suited for an animation with a 72 minute running time. However, it did have its fair share of funny moments, and some might even make you laugh. The main characters of the web series, namely Red and Blue, do have some more depth to them, as compared to the web series. Blue in particular grows as an individual throughout the events of the movie. The conflict between the two also makes their relationship seem more dynamic, as opposed to static, as it is in the web series. While a static relationship is more suited for a short web series, a dynamic one is much better suited for a film, and this is one of the areas where it really shines. To conclude, the film has its ups and downs. The fighting scenes (the car chase scene in Paris in particular) have been animated very well, and are very entertaining. The conflict between Red and Blue adds some much needed depth. However, it still has the feel of a web series, due to slapstick humor, flat background characters, and it being slightly too random at times. At times, it feels like they bit off more than they could chew.",
         "\"Prepare yourself. For STICK FIGURES. And RACCOONS. And NINJAS. And EXPLOSIONS. And LOVE. And HATE. Two friends will risk it all to find the greatest treasure of all time.\" I have been eagerly awaiting this movies premier since it was first announced. This movie was made for the fans, (funded) by the fans, and they didn't disappoint. I've been a big fan of the series since I discovered it halfway through season 1. While some movie adaptations stray from the series on which they are based, Dick Figures: The Movie keeps what made the series so great, then turns things like the animation and action up to 11. I think a big part of this is that they went with crowd sourcing, raised the movie, and produced all in house with complete creative control, rather than being at the mercy of some big Hollywood studio. There was some great action sequences, lots of laughs including some gut busting hilarity in the Paris restaurant scenes. At the same time, Ed and Zack have taken the opportunity to not only bump up the animation, action, comedy, and explosions but also give more depth to the characters. We get to learn more about Raccoon, and we see a softer side of Pink that literally confirms that she loves Blue. We also learn how Red and Blue's friendship came to be, the strain that gets put on it, and ultimately the greater appreciation they have for it. Red (eventually) shows that he really does care, and Blue finally has his day. There are some genuinely touching moments that really make you feel for the characters. Then of course, there's the Easter Eggs. After watching it the first time or three, it's worth watching it again and pausing to check out all of the neat pop culture references and references to the series as a whole. For example, have a good look in Blue's room, especially the bookshelf. This was such an awesome movie, and does the fans proud. If you're a fan of the series you owe it to yourself to buy or rent it. If you're not familiar with the series but enjoy action, explosions, and wacky, colorful characters, check it out.",
         "Alright, I'll admit I was a tad bit skeptical when I first heard about DF, but after I watched it, I found it so hilarious that I decided to see the movie. It is a very enjoyable film, a 9/10 stars if I may say so myself. One of the things I really enjoyed about this film was the plot. It never felt like Red or Blue ever used an utterly stupid solution to their problems, and many of the conflicts they face were beyond incredible. Also, it doesn't stray far from the series at all! Most films based on a series forgets the point of the series, but this one looks like it could've been an episode. The thing that really got me was the lesson of the film. While most films with the \"friendship is important\" morale seem overused, this one really does it right. Seriously, it really moved me how Red finally started to see how much trouble he was causing Blue by being such a jerk, when Blue literally devoted his life to taking care of him. This is a must-see for fans of the series, or just someone that needs a fun movie with action, romance, comedy, and drama!",
         "Despicable Me 2- 3/4 Monsters University- on its own it's a great film, which is why I give it a 4/4. That being said, it's not as memorable as other Pixar films. Cloudy 2- 2/4 Epic- 2.5/4 Escape from planet earth- awful in every aspect, 1/4 Dick figures: the movie? This has been a bad year for animated flicks and this has probably been the highlight of them all. Great film that should be released in the theaters everywhere. It would have a better chance of getting an Oscar nod but eh, it's all right. Its fine the way it is. a youtube movie. That may be changed when Frozen comes out though. A very memorable and heartfelt adventure, even if it's short and a little campy at times. 4/4",
         "It has taken some time till I was able to watch the movie. Nevertheless, it was absolutely awesome. It were the ridicoulus puns and the small details which made the movie for me. Basics which (luckily) were taken over from the series. It took me a lot longer than the 73:50 min to watch the film and not only to get more b00ze, but also to constantly pause the movie. A lot of stuff is going on in the background if you take note. Just for example the stuff (Books, Movies, Games) Blue has in his rack in the beginning of the movie: Fang Angels (Twigay), A Melody Of Myth & Magic, War Soldiers, Companion Cube, The Pretty Good Gatsby, Arry Potuh & The Banger In Yo Mouf, Duke Of Fancy, Adventures Of Bloser - just to name what I can gather in short time. A lot of references to pop culture and to fans of the series. I had a lot more fun watching this movie than in tons of high grossing Hollywood flicks. There are so many awesome and original things in this movie that I will gladly watch it numerous times. I sincerely hope that this movie will be a good example and will bring creativity back to my movie \"lunch\". 'Cause Hollywood cannot satisfy my hunger with the twentieth installation of basically the same movie. If you want some examples of the humour, take these. If you are a fan of Batman: http://www.youtube.com/watch?v=I6Dh-yE029U If you are a fan of Call Of Duty: http://www.youtube.com/watch? v=Ly3OTtXdJEg If you are a fan of Star Trek and Arnold Schwarzenegger (i.e. Terminator, Kindergarten Cop) http://www.youtube.com/watch? v=nJZXcsVvjUI Just goes to show, that Ed Skudder and Zack Keller have lots in store for everyone. I can't wait for more from the both and the team. On a sidenote: Alex and Lindsay Small-Butera are credited as \"Character Animators\". Those two are behind \"Baman and Piderman\". If you enjoy Dick Figures, you might also enjoy this: http://www.youtube.com/watch?v=KyvZ04KKhFY",
         "It has taken some time till I was able to watch the movie. Nevertheless, it was absolutely awesome. It were the ridicoulus puns and the small details which made the movie for me. Basics which (luckily) were taken over from the series. It took me a lot longer than the 73:50 min to watch the film and not only to get more b00ze, but also to constantly pause the movie. A lot of stuff is going on in the background if you take note. Just for example the stuff (Books, Movies, Games) Blue has in his rack in the beginning of the movie: Fang Angels (Twigay), A Melody Of Myth & Magic, War Soldiers, Companion Cube, The Pretty Good Gatsby, Arry Potuh & The Banger In Yo Mouf, Duke Of Fancy, Adventures Of Bloser - just to name what I can gather in short time. A lot of references to pop culture and to fans of the series. I had a lot more fun watching this movie than in tons of high grossing Hollywood flicks. There are so many awesome and original things in this movie that I will gladly watch it numerous times. I sincerely hope that this movie will be a good example and will bring creativity back to my movie \"lunch\". 'Cause Hollywood cannot satisfy my hunger with the twentieth installation of basically the same movie. If you want some examples of the humour, take these. If you are a fan of Batman: http://www.youtube.com/watch?v=I6Dh-yE029U If you are a fan of Call Of Duty: http://www.youtube.com/watch? v=Ly3OTtXdJEg If you are a fan of Star Trek and Arnold Schwarzenegger (i.e. Terminator, Kindergarten Cop) http://www.youtube.com/watch? v=nJZXcsVvjUI Just goes to show, that Ed Skudder and Zack Keller have lots in store for everyone. I can't wait for more from the both and the team. On a sidenote: Alex and Lindsay Small-Butera are credited as \"Character Animators\". Those two are behind \"Baman and Piderman\". If you enjoy Dick Figures, you might also enjoy this: http://www.youtube.com/watch?v=KyvZ04KKhFY"
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Mondo Media",
         "Remochoso",
         "Six Point Harness"
      ],
      "summaries": ["Two best friends, Red and Blue, risk everything to find the greatest treasure of all time."],
      "budget": 313411
   },
   "movielensId": 109776,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "日本語"
      ],
      "releaseDate": "2013-09-16",
      "dvdReleaseDate": null,
      "directors": [
         "Zack Keller",
         "Ed Skudder"
      ],
      "runtime": 73,
      "movieId": 109776,
      "title": "Dick Figures: The Movie",
      "mpaa": "",
      "actors": [
         "Ed Skudder",
         "Zack Keller",
         "Eric Bauza",
         "Ben Tuller"
      ],
      "imdbMovieId": "2312262",
      "originalTitle": "Dick Figures: The Movie",
      "genres": [
         "Animation",
         "Comedy",
         "Adventure"
      ],
      "youtubeTrailerIds": ["H0poVodH4Vo"],
      "plotSummary": "Two best friends, Red and Blue, risk everything to find the greatest treasure of all time.",
      "tmdbMovieId": 222671,
      "avgRating": 3.2,
      "releaseYear": "2013",
      "numRatings": 5,
      "posterPath": "/7bhQTnufFYcCvVdHRfngekwLL3T.jpg"
   }
}