{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0459744",
      "video": false,
      "title": "Ashura",
      "recommendations": [],
      "backdrop_path": "/zcpSTW1iDQPOGBxOYK4ChjfNiEI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tsubaki",
               "gender": 1,
               "credit_id": "52fe46bfc3a36847f81101ab",
               "name": "Rie Miyazawa",
               "profile_path": "/2yfL6f9Epxf3FL2diu3w4YHGSQR.jpg",
               "id": 72494,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Izumo",
               "gender": 0,
               "credit_id": "52fe46bfc3a36847f81101af",
               "name": "Somegorô Ichikawa",
               "profile_path": null,
               "id": 588612,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Bizan",
               "gender": 1,
               "credit_id": "52fe46c0c3a36847f81101dd",
               "name": "Kanako Higuchi",
               "profile_path": "/cwJX9kHtFUIPx93qOaF9FY9HVOq.jpg",
               "id": 70210,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Jaku Abe",
               "gender": 2,
               "credit_id": "52fe46c0c3a36847f81101e1",
               "name": "Atsuro Watabe",
               "profile_path": "/x7c0ANsVV7QVxXtGR31t4rbny73.jpg",
               "id": 46624,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Nanboku Tsuruya IV",
               "gender": 2,
               "credit_id": "52fe46c0c3a36847f81101e5",
               "name": "Fumiyo Kohinata",
               "profile_path": "/nUugr8JH1cmGRPcMFvSQibShojz.jpg",
               "id": 58449,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Nobuyuki Kuninari",
               "gender": 0,
               "credit_id": "52fe46c0c3a36847f81101e9",
               "name": "Takashi Naito",
               "profile_path": "/ljbNlt6v9a7E9uvnph2qAJ6ba55.jpg",
               "id": 19590,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Yachi",
               "gender": 0,
               "credit_id": "55eb2dec9251413e3500af84",
               "name": "Erika Sawajiri",
               "profile_path": "/wmctC6fOyH5UmbPFJxXExIiuRBn.jpg",
               "id": 52806,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Magotaro",
               "gender": 0,
               "credit_id": "55eb2dfcc3a3682c6200b7df",
               "name": "Yukijiro Hotaru",
               "profile_path": null,
               "id": 133656,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Emishi",
               "gender": 1,
               "credit_id": "55eb2e089251413e3a00b39e",
               "name": "Hanae Kan",
               "profile_path": "/yyYZLqWZRN5LFlxBGyHNEkZpi1l.jpg",
               "id": 25652,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Takiji",
               "gender": 2,
               "credit_id": "55eb2e19c3a3682c5f00b94f",
               "name": "Sarutoki Minagawa",
               "profile_path": "/cI56cVLrJO62SMH1ceTrA5DtQqy.jpg",
               "id": 1180452,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Hyozo",
               "gender": 2,
               "credit_id": "55eb2e2bc3a3682c6400a375",
               "name": "Koji Okura",
               "profile_path": "/pcOri4I8CoXXp7RthdjvpAYT6Vf.jpg",
               "id": 151093,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Oiran",
               "gender": 0,
               "credit_id": "55eb2e7bc3a3682c5d00c325",
               "name": "Kumiko Tsuchiya",
               "profile_path": null,
               "id": 1267679,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "",
               "gender": 2,
               "credit_id": "55eb2e869251413e3500afa2",
               "name": "Tatsuo Yamada",
               "profile_path": null,
               "id": 555296,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46bfc3a36847f81101b5",
               "name": "Yojiro Takita",
               "profile_path": null,
               "id": 76936,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46bfc3a36847f81101bb",
               "name": "Kazuki Nakashima",
               "profile_path": null,
               "id": 109196,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c0c3a36847f81101c1",
               "name": "Sei Kawaguchi",
               "profile_path": null,
               "id": 1133642,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c0c3a36847f81101c7",
               "name": "Masashi Todayama",
               "profile_path": null,
               "id": 93514,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c0c3a36847f81101cd",
               "name": "Shuji Miyajima",
               "profile_path": null,
               "id": 1132425,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46c0c3a36847f81101d3",
               "name": "Yoko Kanno",
               "profile_path": null,
               "id": 186,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46c0c3a36847f81101d9",
               "name": "Katsumi Yanagijima",
               "profile_path": null,
               "id": 4998,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.764729,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 45384,
      "vote_count": 5,
      "budget": 0,
      "overview": "Adapted from the successful play, the film takes place in the 19th Japan where a war between demons and their slayers is fought. Izumo, an Kabuki actor with a demon-slaying past, meets and falls in love with Tsubaki. However, something is not right as mysterious marks appear on her body as time progresses. At the same time, it is announced that Ashura, the queen of all demons, will be resurrected and bring destruction to the universe.",
      "similar": [],
      "original_title": "阿修羅城の瞳",
      "runtime": 119,
      "poster_path": "/6z5Ujhv3C9J43kIVhbUOYfjBlpC.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shochiku Company",
            "id": 4641,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eisei Gekijo",
            "id": 9177,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nippon Television Network Corporation (NTV)",
            "id": 6755,
            "origin_country": ""
         }
      ],
      "release_date": "2005-01-01",
      "vote_average": 4.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yôjirô Takita"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Sei Kawaguchi",
         "Kazuki Nakashima"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0459744/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzYyNTc0NzQ2MF5BMl5BanBnXkFtZTcwMzc5MzY0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Somegorô Ichikawa, Rie Miyazawa, Kanako Higuchi | See full cast and crew »"],
      "reviews": [
         "Set in Japan, Ashura is the story of Demons taking over the earth. The premise is far more complicated, but the arching storyline should not be forgotten. Japan is in turmoil, with Demons occupying human form roaming the lands. Generally speaking Demons look and act like humans, but are evil. The Japanese word they use is not just demons, but rather the classical form of 'ogre' which is a mythological creature of some historic stature. We're talking about creatures that would appear more like gods than simple ugly child-eating monsters. However in human form all that remains is the green eyes and green teeth, which appear when put under any sort of stress. In order to save the world from Demons there are Demon-slayers. Trained and skilled warriors who can spot and defeat most every kind of demon, and who guard the passage-way between the realm of hell and that of the real world. These are the basic premises. The story begins with a festival in a local town. Amid these festivities, 3 men ride in, dressed in all black, seemingly intent on doing harm. The villagers run, excepting those which are demonic in nature, who turn green-eyed and try to kill them. The Demon-Slayers end up killing off the majority of the demons. From here the story gets interesting. The whole essence of the story begins when at the gate to hell a fortune-telling demon appears before the 3 gate-keepers, revealing the arrival of Ashura. With it, comes the end of the reign of man, and begins the reign of demons. Ashura however requires some form of birthing process, the first step of which occurred during the opening battle, but which won't be revealed to you until you see the film. The 3 demon-slayers are a wise old man, a powerful yet unprincipled man, and a skilled and compassionate warrior. Immediately you can see the split between them, the old man wanting to stop the demons, the powerful one wanting to bend them to his increasing ego maniacal wishes and the third looking to stop the second. Along the way he meets a woman who he begins to take fancy to, and believes himself to have a special relationship with. She in turn is a brigand who is good-natured, sought after by authorities. When the two finally meet face to face, he places his hand on her shoulder, and suddenly she is scathed by a mark on her shoulder. Needless to say, the mark is not a good sign. What ensues is a battle for earth, a battle between both good and evil, as it should be, but also between good and good itself. The point for me of this film became something other than what I thought it would. I came in thinking it would either be a fast-paced action style film with demons, or a horror film with macabre evil and foul creatures the likes of which would be seen in Ringu and Ju-on. I was however mistaken in the best possible way. The story it seemed to me is an adaptation of a very old Japanese play, and it plays itself out as such, combining the essentially action driven adrenaline scenes with a great concept, an amazing narrative, and a style which makes you compelled to think rather than just sit wallowing in gore. Many scenes are painted with luxurious dialogue between two characters the likes of which will never be seen in a Hollywood film. It becomes a practically theatrical experience which takes your breath away. The film makes use of some immaculate scenery and camera-work comparable to many great Samurai films of our days, but adding to it a well-thought and classical plot. With great acting, great music, and thoroughly stunning scenes, its a must watch in my book. That being said, it does need the disclaimer that it is not for everyone. Its not cheap thrills horror, its not balls to the wall action. Its a horror style play thats been filmed. It has very much to say and takes the time to do so, flying in the face of the conventional one-liners. Like Japanese plays, the exchanges between the characters can last for many minutes before they come together for a quick yet marvelous battle scene. If you can enjoy such a thing, this is a masterpiece. If your idea of a good film is slasher flicks with little plot and excessive nudity, then you can easily watch something else. Overall, this film to me is a unique and amazing one, which keeps you riveted and amused. it has good writing, good acting, and good direction. It is all in all a solidly great film.",
         "Japan is in serious trouble. Demons have infested Edo, taking possession of earthly forms and bending them to their unholy will. On top of that, the rebirth of Ashura, Queen of the demons, is nigh. The only thing that stands against this grave threat are the Demon Wardens, a fearsome group of warriors, who might just be as bad as the demons themselves. Izumo is a retired Demon Warden, who five years ago, took up theater instead of Demon Slaying after accidentally killing a innocent child (In a battle that's strangely reminiscent of the bar scene from Dusk till Dawn). One night by a chance encounter he meets a beautiful and mysterious woman named Tsubaki. Their fortunes intertwine (literally) and they are bound by fate to be lovers and enemies. If you think this sounds like your typical Japanese Fantasy/Swordplay epic, you'd be wrong. In fact, there's nothing typical about Ashura. It is a hodge-podge of many different genre's of film. Those just mentioned, as well as a comedy, drama, and romance. Director Yojiro Takita (Onmyoji) juggles the genre's fairly respectfully (Although, the comedy seems forced in some scenes) and the end result is a ridiculous, but really fun popcorn movie. To be sure, there are flaws in the film. Some of the humor seems contrived, and out of place. And the acting isn't the greatest. But seriously, do you watch Fantasy/Swordplay/Comedy films for the great acting performances?? No, we watch them for the action and the crazy CG visuals, all of which Ashura has in Spades. Not to be misleading, the film is not all action, but it is spaced out generously enough with lots of swordplay and buckets of green blood to keep the average viewer happy. Bottom line; the films has it's faults and is not a martial arts epic, but it doesn't try to be and it features interesting visuals and good swordplay action. The reason the film worked for me is that it never takes itself too seriously and if the viewer does the same, their sure to be delighted by this fun and silly swordplay fantasy action flick. My Rating 7 out of 10. Fun popcorn movie.",
         "I went to see Ashura as 2005 Fantasia Festival Kickoff. Man, that was one cool kick off. The director was supposed to be in Montreal for the Canadian premiere, but due to health reasons, he's still in Japan...oh lord I hope he gets better and makes plenty of other movies. The plot is pretty simple, but somewhat original...the demons are roaming in Edo in Japan and Swordsmans called \"Demon Wardens\" are slaying them and fearing the rebirth of Ashura, the demon goddess who's sleeping and supposedly is very kick-ass. It brings us to Izumo...some kind of elite swordsman called \"Demon Slayer\" and his buddy Jaku who's the typical violent jealous asshole... Seems boring? Well now it thickens.... Izumo took his retirement from killing demons since he slayed a young kid on the \"impression\" that he was the demon, he never knew, but he did killed her. So Izumo went on with his life and recycled himself in Kabuki theater. In a boat joyride on a nice night, Izumo spots a girl hiding on a bridge and it changes his life and restart to slay demons...for the good cause, the cause of love...and damn...the guy knows how to handle a sword and to pull an entertaining massacre. Izumo carries the movie as far as playing goes...he is the total package...he knows how to fight(hell yeah he knows), he's witty, he's intelligent and he has that grit. You never have to yell :\"NO IZUMO, IT'S A TRAP\" The guy already knows it he has that common sense. He's really the perfect hero. As far as cinematography goes, the esthetics are pretty interesting. It's by far, the movie that looks the most like a manga. It's creamed full of special effects and nothing, at all cost will prevent this movie to look realistic...it's pretty amazing. Lots of colours an \"unreal\" photography, other than that...it's pretty straightforward...but like I said, the main character is carrying the movie A must see, a tale lead by masterful hands",
         "'Ashura-jô no hitomi'takes place in the Japan of some centuries ago. Demons have infested Edo, the main city, taking human form and being hard to recognize. That's why they have the Demons Wardens, the guys who hunt and kill the demons to bring some peace to Edo.Even being a necessary job, being a Demon Warden is not easy, since you need to have a lot of cold blood and a sixth sense to recognize demons. Izumo is a charming and well known Kabuki actor with a demon-slaying past. He eventually meets the mysterious girl Tsubaki and falls in love with her. The problem that neither he or Tsubaki knows, is that she is a demon, the reincarnation of Ashura, the Queen of all the demons. And as the mysterious mark in Tsubaki's body increases her size, more strange things starts to happen to her. To make things harder, Jaku, who was Demon Warden working with Izumi, is corrupted by Bizan, a demon lady who is a kind of Ashura's advisory and follower. 'Ashura-jô no hitomi' looks an incredible movie for it's reviews, but I need to be honest and say that I expected a little more excitement from it. (It's is not that the movie is terrible or anything like that, I thought it was fun and I liked some actors and actresses, I just thought it would be FANTASTIC.) Some of the special effects (specially the first ones in the demons eyes and mouths)were bad, but you can forget that when you see the charming Izumo Wakuraba trying to get Tsubaki's heart. Ps: I think this is the first Japanese movie I see a sex scene. Ps2: Even enjoying the acting of the actor Somegoro Ichikawa as the character Izumo Wakuraba, I found his looks a little odd, looking he did plastic, botox and lip collagen. Can someone who is familiarized with the actor Somegoro, send me a PM telling me if he did those procedures or not?",
         "The movie only enter the cinema in Indonesia this year (2007), two years after it's official release, and after many illegal DVD's had found its way to the public. Apparently the popularity of the illegal DVD's lead to the release into the theaters, with still public coming to watch. The movie is a great epic, bringing Japanese culture into your house in an exiting way. In a sometimes humorist way, the story is told about a theater writer who writes a story for his theater, since the regular Kabuki theater plays is something he finds boring. At first, the audience might be a little bit confused about which story we are following, but when the story unfolds, we see that the love between a male human and a female demon leads to a great story for a new Kabuki theater piece. The audience is left in the dark if this is a story that is supposed to really have happened in Japanese traditions and mythology, but that doesn't matter. The way the story is told with a love for theater, expression, vivid colors, humor and tragedy, makes this a great ride on the roller-coaster of Japanese cinema as well as theater. Let yourself go completely when you watch this movie, try to see it in a cinema instead of on your television at home. One critical point though: the soundtrack is sometimes a little bit annoying. Though most of it is great music, there are a few moments in the movie that I think they should have chosen some more dramatic music. But maybe the fact that the story contains moments of humor made the director choose for lighter moments in music as well.",
         "Unbeatable, baleful, and sinister Ashura, Queen of the Demons, has a plan to dominate this world. The Japanese film \"The Eyes of Ashura's Castle\" is set in the chaotic nineteenth century Edo (later Tokyo) where humans, demons, and evil spirits coexist. The Demon Wardens, a secret society, is beating invincible undead in the city. In the midst of the war between human beings and demons, Ashura's assistant Bizan notifies demon slayers about the rebirth of the impregnable queen Ashura in Edo. The story revolves around the ghostly, heartrending love relationship between dandy Kabuki actor Wakuraba Izumo and a beautiful thief named Tsubaki. He is a former star demon slayer, and she is graceful and fierce. While developing their romance, they cross a border between this world and the next, which triggers a disastrous outcome. Ultimately, their love and fate unfold by insinuating a common memory of the past that is the dramatic relationship between killing and being killed. Professional Kabuki actor Somegoro Ichikawa plays Wakuraba Izumo. He is the scion of the most famous Kabuki families whose tradition is much respected by many and recognized as one of the chief Japanese traditional art forms. His skillful and flamboyant swordplay is admirable. Rie Miyazawa, a popular Japanese actress, plays the mysteriously attractive yet ferocious Tsubaki. Directed by Academy Award winning film director Yojiro Takita, \"The Eyes of Ashura's Castle\" features a timeless range of cultural references to Japanese popular culture from romanticized eighteenth century Kabuki theater and its playwright Tsuruya Namboku IV's ghost stories to contemporary playful video games and computer graphics. Besides, the film skillfully adds exhilarating zombies with kimono costumes to Japanese pop music. A psychedelic mixture of old and new epitomizes the richness of Japanese popular culture. The prologue is particularly an eerie collection of some Japanese myths and ethereal symbols. For instance, a fireball is approaching to Edo while Emish, an ominous demon, is singing a parody of children's tune, \"Toryanse.\" Further, signposts for ogres such as bridges, borders, and twilight are effectively employed. A ghost emerges at the edge of a bridge connecting this world and the next. Additionally, seas, rivers, and mountains demarcate the two worlds. Finally, the opening scene is twilight, which is a brief period of ambiguous time. It is a time of transformation from one being to another. Indeed, the times of uncertainty are chances for ethereal beings that are roaming around the human world. Furthermore, a parody of legendary horror playwright Tsuruya Namboku IV (1755-1829) plays a crucial role to unite the whole eclectic Japanese national and cultural symbols: Kabuki theater, Izumo's crimson thread magic, Tokubei's giant frog, stylized actions, and the undying Japanese ghost story, \"Oiwa.\" Namboku produced many ghost stories for Kabuki plays, and also wrote about Tokubei's story. These cultural references from the early nineteenth century add an exotic character to the film. Consequently, the story unfurls a series of Namboku's fantastically weird tales, which include comedy, apparitions, love, tragedy, and disgust. A dreadful opening and a wonderful ending are key components of his story. Blurring this world and the next in the film, Namboku says 'which world you live in, the world has its own paradise.' The poignant story, where the lovers cannot fulfill their love in this world, clearly follows Namboku's traditional Kabuki taste. Overall, the film is entertaining and worthwhile watching.",
         "Underneath the dense green glop of computer graphics there gleamed the astounding art and skill of Ichikawa Somegoro. Alas: it got lost in all the goo. The scenes of Old Edo -- with the courtesan, drifting on the Sumida, rehearsing and acting in the Nakamura-za -- were all exciting and engaging, taking you back to an interesting and rich era. The action on the Kabuki stage, in which Somegoro excels and excites, was more enriching than any of the absurd high jinks that followed. The skill, the energy in the audience, the colors of the sets, were far more satisfying than all the nonsense that took over plot and performance. What a wasted opportunity! One of the best kabuki actors alive, and he gets lost in the dreck."
      ],
      "genres": [
         "Action",
         "Fantasy"
      ],
      "productionCompanies": [
         "Eisei Gekijo",
         "Imagica",
         "Nippon Television Network (NTV)"
      ],
      "summaries": ["Adapted from the successful play, the film takes place in the 19th Japan where a war between demons and their slayers is fought. Izumo, an Kabuki actor with a demon-slaying past, meets and falls in love with Tsubaki. However, something is not right as mysterious marks appear on her body as time progresses. At the same time, it is announced that Ashura, the queen of all demons, will be resurrected and bring destruction to the universe."],
      "budget": 0
   },
   "movielensId": 109790,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2005-01-01",
      "dvdReleaseDate": null,
      "directors": ["Yojiro Takita"],
      "runtime": 119,
      "movieId": 109790,
      "title": "Ashura",
      "mpaa": "",
      "actors": [
         "Rie Miyazawa",
         "Somegorô Ichikawa",
         "Kanako Higuchi",
         "Atsuro Watabe",
         "Fumiyo Kohinata",
         "Takashi Naito",
         "Erika Sawajiri",
         "Yukijiro Hotaru",
         "Hanae Kan",
         "Sarutoki Minagawa",
         "Koji Okura",
         "Kumiko Tsuchiya",
         "Tatsuo Yamada"
      ],
      "imdbMovieId": "0459744",
      "originalTitle": "阿修羅城の瞳",
      "genres": [
         "Fantasy",
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["lK6-6sWEKoE"],
      "plotSummary": "Adapted from the successful play, the film takes place in the 19th Japan where a war between demons and their slayers is fought. Izumo, an Kabuki actor with a demon-slaying past, meets and falls in love with Tsubaki. However, something is not right as mysterious marks appear on her body as time progresses. At the same time, it is announced that Ashura, the queen of all demons, will be resurrected and bring destruction to the universe.",
      "tmdbMovieId": 45384,
      "avgRating": 2.85714,
      "releaseYear": "2005",
      "numRatings": 7,
      "posterPath": "/6z5Ujhv3C9J43kIVhbUOYfjBlpC.jpg"
   }
}