{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "satire",
            "id": 8201
         },
         {
            "name": "spelling bee",
            "id": 11146
         },
         {
            "name": "estranged father",
            "id": 161194
         },
         {
            "name": "unlikely friendship",
            "id": 167982
         },
         {
            "name": "anger issues",
            "id": 215292
         }
      ],
      "imdb_id": "tt2170299",
      "video": false,
      "title": "Bad Words",
      "recommendations": [
         239678,
         113148,
         209244,
         157360,
         59968,
         180296,
         227300,
         109443,
         284296,
         209189,
         115283,
         244772,
         201086,
         82532,
         249923,
         16991,
         237756,
         74387,
         15373,
         209247
      ],
      "backdrop_path": "/sxoszo9dKm77ItG1jB2WOEhbQDN.jpg",
      "revenue": 7800000,
      "reviews": [{
         "author": "Reno",
         "id": "559d7665c3a3686591000330",
         "content": "> Good lie, bad words and ugly truth.\r\n\r\nI thought it was Cliff Curtis' movie because that's whom I saw in one of the posters. Anyway, it's Jason Bateman's movie, which is also his first directional venture. A refreshing theme because only a very few movies were made based on the spelling bee contest, but this one was a bit messed up story narration. Most of the narrative looked so pale and dull. It is supposed to be an exciting storytelling with blistering pace.\r\n\r\nYou know, stories in the movies happen with a backdrop of the reasons. Like a piece of uninteresting wood carved into a something that attracts everybody. Some movie holds it till the end to reveal that beauty in the form of a twist, but some won't mind explaining it along the way. In this movie, what they had for the twist was lifeless, boring one, more like a cliché from the older days flick.\r\n\r\nThe boy from the movie 'Jack and Jill' was decent. I felt some material in the movie was inappropriate regarding a minor in one of the lead roles. But I know the title clearly suggests it is only for adults. Understandable that the writer wanted to give something new, but he could not get it right. Maybe lacked to bring some interesting and inspiring elements. What surprised me was, it was not either for commercial benefit nor a fine art piece.\r\n\r\nAll the way I knew something was not clinching and finally found out the approach to portray the main character in the negative mode had to do with something. They wanted the viewers to go against him and well, they got it in a way. Interestingly the screenplay was from the 'Black List' which was untouched for almost 10 years. Unfortunately Bateman decided to give it a try and the result is,... Here I'm with not satisfied fully, but okay-okay movie for being at least something different.\r\n\r\n6/10",
         "url": "https://www.themoviedb.org/review/559d7665c3a3686591000330"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Guy Trilby",
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6bdd",
               "name": "Jason Bateman",
               "profile_path": "/ttzLpjvcLkvXyyTBpjmZw11tjlr.jpg",
               "id": 23532,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Jenny Widgeon",
               "gender": 1,
               "credit_id": "52fe4d64c3a368484e1e6be9",
               "name": "Kathryn Hahn",
               "profile_path": "/9sVllAKfEls3SJD3GoPm2JEZoa5.jpg",
               "id": 17696,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Chaitainya",
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6bed",
               "name": "Rohan Chand",
               "profile_path": "/6lTLuGmxXUmGZ2hN1Obz1alc1rt.jpg",
               "id": 935701,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Bowman",
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6be5",
               "name": "Philip Baker Hall",
               "profile_path": "/eH7GrivSuLEvhJL85qPkhNvg3E7.jpg",
               "id": 4492,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Dr. Bernice Deagan",
               "gender": 1,
               "credit_id": "52fe4d64c3a368484e1e6be1",
               "name": "Allison Janney",
               "profile_path": "/cDcB8mKP1GiIeoM3Qe7GIucs0iv.jpg",
               "id": 19,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pete Fowler",
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6bf1",
               "name": "Ben Falcone",
               "profile_path": "/abhsMUOZKyAGPK3uZPdf3UQ5MuZ.jpg",
               "id": 170820,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Proctor at Spelling Bee",
               "gender": 0,
               "credit_id": "59b2f5d5c3a3682cc80a566d",
               "name": "Steve Witting",
               "profile_path": "/vHjidfH9Hx2k1CVcXAuARIQamYf.jpg",
               "id": 152864,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Irene",
               "gender": 1,
               "credit_id": "52fe4d64c3a368484e1e6bf9",
               "name": "Beth Grant",
               "profile_path": "/zAT9GvzJE0ytL3C36L461cgKI9p.jpg",
               "id": 5151,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Ingrid",
               "gender": 1,
               "credit_id": "52fe4d64c3a368484e1e6bf5",
               "name": "Patricia Belcher",
               "profile_path": "/dbbOF0P2h8qJ0fktNzMj4rmztP3.jpg",
               "id": 56358,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Eric Tai's Mother",
               "gender": 1,
               "credit_id": "59b2f59bc3a3682e6404f1f3",
               "name": "Rachael Harris",
               "profile_path": "/wrmz6aTM7aFYmd1I12rGWjDtoaf.jpg",
               "id": 46074,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jeremy 'FBI Agent'",
               "gender": 0,
               "credit_id": "52fe4d64c3a368484e1e6c05",
               "name": "Greg Cromer",
               "profile_path": "/t209XYLmYyRgY0l40PZVvNN5Hw4.jpg",
               "id": 128013,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Braden Aftergood",
               "gender": 2,
               "credit_id": "5a592402c3a3686c30002473",
               "name": "Matthew Zhang",
               "profile_path": "/jA6nBXgCkB6HPFzAwdZQ1loPIDh.jpg",
               "id": 1520456,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6bd3",
               "name": "Jason Bateman",
               "profile_path": "/ttzLpjvcLkvXyyTBpjmZw11tjlr.jpg",
               "id": 23532,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d64c3a368484e1e6bd9",
               "name": "Andrew Dodge",
               "profile_path": null,
               "id": 1192897,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 7.644802,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 209403,
      "vote_count": 381,
      "budget": 9500000,
      "overview": "A misanthropic man sets out to exact revenge on his estranged father, by finding a loophole and attempting to win the National Spelling Bee as an adult. Figuring it would destroy his father, and everything he's worked so hard for as head of the Spelling Bee Championship Organization, Guy Trilby (Jason Bateman) eventually discovers winning isn't necessary for revenge, and that friendship is a blessing not a curse.",
      "similar": [
         533,
         86130,
         56339,
         161545,
         23050,
         207021,
         169864,
         16636,
         40987,
         184149,
         26930,
         42688,
         288694,
         266451,
         24225,
         358761,
         135394,
         35199,
         57722,
         44671
      ],
      "original_title": "Bad Words",
      "runtime": 89,
      "poster_path": "/w0carH29kLHzgL3RVuynMWfNkmb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Darko Entertainment",
            "id": 12622,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aggregate Film",
            "id": 25975,
            "origin_country": ""
         }
      ],
      "release_date": "2013-09-06",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The end justifies the means",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jason Bateman"],
      "runtime": 89,
      "synopsis": "The top of a large trophy depicts a bumble bee triumphantly holding up a torch overlooks an auditorium alive with activity. Parents and their children undergoing last minute preparations for the Big Day: The 15h Annual Regional Spelling Bee in Columbus, Ohio. Students practicing words, parents fixing their childrens collars or giving last minute pep talks all being watched by Guy Trilby (Jason Bateman) as he stands by the complementary food table listening to classical music. A parent lumbers over and asks Guy which child hes there to support but Guy tells him that he's not here to support anyone. Confused, the parent asks Guy if hes the Host of the Spelling Bee. Guy claims he's the Winner and gets on stage with the children. A heavy set child asks Guy why hes on the stage and Guy callously replies its because the boys chair was screaming for help. Help. He's so heavy. Help. Before the competition can begin, the elderly host comments that the seats are only for competitors Outside the school, Guy is told his is ineligible to compete by the Principal but Guy fires back that the rules only state that the participates must not have graduated the 8th grade by the date of the Spelling Bee which he hasn't. The Principal points out that Guy also needs to be sponsored by a Nationally recognized media service enter Guys sponsor, Jenny Widgeon (Katheryn Hahn), a writer for the online paper The Click and Scroll. Jenny threatens to file a law suit to prevent the competition of continuing without Guys participation. The Principal expresses his disgust but allows Guy to participate. Guy 40, single and employed as a proof-reader of manufacturer warranties explains that a few weeks ago he stepped away from his routine in order to do this whole thing because his feelings were hurt. And maybe, as he bursts out of the school with the trophy in hand and a mob of parents in hot pursuit, he didn't think this through. He slides across the front of Jenny's car and the pair drive away as the parents assault the car. Jenny puts down the in-flight meal tray of Guy's seat and places a tape recorder. They're on route to the National Spelling Bee competition and Jenny reminds them of their arrangement: Guy has to answer one question for every round of the tournament he advances through in exchange for her sponsorship. Guy sarcastically rolls his eyes but Jenny, unhappy with the paltry answers shes been given thus far, wants to know: why is Guy so hell bent in pissing off parents and crushing the dreams of children by entering this competition? He doesn't answer and, frustrated, Jenny storms off to the bathroom. Jenny's barely gone when a small Indian boy in the seat in front turns around to stare at Guy. The little boy introduces himself as Chaitainya (Rohan Chand) and happily exclaims that he's also a participant in the National Spelling Bee. Guy disinterested tells \"Chai\" (his nickname) to point his little curry hole towards the front of plane or hell tell the stewardesses that he heard Chai's back ticking. Chai laughs before (unprompted) explaining that his parents are in first class but made him sit in economy because it builds character. Undeterred by Guys disinterest, Chai asks what Guys winning word was. Guy claims he cant remember before sarcastically confessing auto-fellatio. Chai is confused, unfamiliar with the word, and asks for the origin. Guy: Loneliness and the lady who just went to the bathroom can tell you all about that. Guy and Jenny arrive at the office of Bernice Deagan (Allison Janney), the Director of the National Spelling Bee. Deagan expresses her disgust at Guy's antics pointing out that his presence is a disgrace that she has not witnessed in the twenty years in which she has been in charge of the event. She claims that to get where she is, she worked hard and with integrity. Guy points out that she doesn't know him or why he's here but deflects when she demands an answer. She tells him he's in the wrong place to work out his childhood traumas but Guy simply replies that he'll be out of her hair in three days when he wins. She presents Guy with his accommodations and hands him his participation ID expressing the regret of Dr. Bowman for not being there to wrap the lanyard around Guy's throat. Guy asks if Dr. Bowman is too busy doing something more pleasurable to another man's throat but Deagan responds that Dr. Bowman is in the middle of a media training seminar because its the first year the National Spelling Bee will be televised nationally. Guy feigns shock and heads to his hotel. Guy reflects on the fact that he had every opportunity to stop what he was doing to quit and not turn this into a big deal but confesses that it would have taken the lessons that hed never been taught growing up. At the hotel, children walk around with their parents. Guy snags his room key and heads to the elevator. The doors start to close when Chai, luggage in hand, races through just making it in as the doors shut. He excitedly points out that they're both on floor too but Guy shrugs him off. No time for Shwarma. Chai continues to pester Guy asking for Guys favorite word until Guy is forced to say shut the fuck up and walks away, yelling at him all the way to his room the hotels storage closet. The receptionist tells Guy that his accommodations are special and that the hotel is completely booked out. I don't have a bathroom, Guy complains. Yea. His reputation precedes him it seems. Guy calmly asks where he should put his piss and shit but receives no response instead, he heads off to the bar. Jenny joins him and laughs that Deagan is sending him a message. Jenny asks about Guys parents but Guy tells her to screw off so he can drink in peace. Jenny takes his choice of words to mean that Guy would like to have sex with her. Again. Guy looks at her, amused, and says first of all, you're welcome. He asks if screwing off sounds good and tells her all she has to do is ask nicely. The two have sex in Guy's storage closet of a room. As he thrusts, Jenny keeps repeating \"Don't Look At Me!\" Guy tries to screw her without looking at her but accidentally makes eye contact illiciting another scream of \"DON'T LOOK AT ME.\" They finish up and Jenny dresses in a hurry, clearly regretting the entire encounter. After she leaves, Guy notices her panties lie crumpled in a corner of the room. He picks them up and slips them in his pocket when there's a knock at the door. Guy comments that Jenny should take better care to grab her panties before she leaves when he looks down and realizes its Chai. Chai asks Guy if Guy can open a jar of minibar pretzels. Guy takes the jar and closes the door on Chai opening up a few minutes later with the open jar and asking about Chai's parents. Chai tells him that his parents are staying in another hotel and that he studied so hard he missed room service. Guy brushes past Chai and goes straight for the minibar. Chai introduces Guy to his friend Todd Chai's book of words and their origins that he studies from nightly. Guy thinks that makes sense, grabs some booze and starts drinking. Chai asks if Fuck is Guy's favorite word and Guy tells him that it's up there. Guy pushes Chai to swear and doesn't stop until Chai says motherfucker. Guy calls him a weirdo and continues drinking. Chai wakes up Guy who passed out Chai's chair. He leaves the room a minute before Chai's father leaves the elevator and meets up with Jenny. They walk and talk on their way to the competition and Guy is about to return her panties when she explains he's been placed next to an expert speller: the child of two previous winners. As they pass the receptionist's desk, Guy plops a plastic bag on the desk for the woman: a plastic bag full of his shit. Deagan hands the randomized list of words for the round to the MC and angrily tells him that this year he should properly enunciate the words. Guy finds his seat among the children as a reporter introduces Dr. Bill Bowman (Philip Baker Hall) the President of the Golden Quill National Spelling Bee. As the first competitor goes up, Guy introduces himself to the boy sitting next to him but the boy responds that his father told him not to talk to the unemployed bum trying to take the money I deserve. Guy processes this before saying that he understands why his father is angry and hands the boy Jenny's panties. \"Can you do me a favor and return these to your mother? She left these in my room last night. I'd do it myself but your father's here and I don't want to tip the nest. Good luck with that divorce though, they can be quite messy.\" The host calls the boy up to the podium, still holding Jenny's panties and processing what Guy said about his mother. Glancing over at his parents, he struggles with his word and misspells it eliminating him from the competition. He storms off the stage and shoves the panties into his mothers handas Jenny watches, cringing at how her panties were used by Guy. Guy is called up for his word, which he spells correctly. As the reporter and Dr. Bowman discuss the situation, Dr. Bowman exclaims that they are currently going through the process of plugging up the loop holes so that no more stunts like this can ever occur. In Deagan's office, a host of angry parents ridicule her for allowing Guy to participate in the competition. She assures them that if Guy makes it to the finals she will step down as director immediately. Back at the hotel, Guy downs nips from the minibar. Jenny offhandedly asks Guy what the grammatical significance of Why run from fire ants? Guy thinks and points out that every vowel is there in order backwards. She asks if there are any words in the English language that have every vowel in order and Guy immediately responds with facetious. Jenny tells Guy that those questions were from a test that is given to children who could potentially be geniuses which his eighth grade assessments confirmed before he dropped out. Guy flips through the papers but tosses them aside; disinterested. He points out that his father was never around as a kid so he never had guidance or direction. Jenny asks who his father is since it could be a genetic gift and Guy confirms it didn't come from his mother a woman who hated education so much that when he entered, ironically enough, his first spelling bee she burned his favorite dictionary. Jenny asks if that is why Guy is here, to get back at his dead mother. He responds that she has bigger issues since she needs to be blindfolded to get off during sex. She swears she wont let him near her vagina even if she were offered a million dollars but a few moments later shes giving him a rim job in the shower. Guy laughs: \"I get it now. Don't look at me.\" Guy leaves her room and sees Chai sitting on the floor outside his room. He asks the boy if he got locked out of his own room but Chai was just waiting to see if Guy would like to get dinner. Guy agrees and they go to the hotel restaurant. Chai happily exclaims that he enjoys the competition and doesn't care about winning; just having fun. Before Guy can respond one of the competitors mothers (Rachel Harris) comes up to them and tells Guy he is an insult to everyone who worked hard to get to the competition calling him nothing more than an asshole. Guy tells her that Chai is a child and that he doesn't speak like that in front of the boy but that she can take her potty mouth, locate her preteen cocksucker son, shove him up that old blown out sock of a vagina, and go back to whatever shit kicking town you came from. He continues to insult her vagina and then tells her Good night. He tells Chai they should go have some fun. The pair kick off the night by running into a supermarket and stealing a live lobster. They proceed to run around town, hitting up several bars and performing pranks on locals before doing donuts in a nearby parking lot with Jenny's rental car. After, they wash their hands in a nearby bathroom when a businessman enters, texting on his blackberry. Guy and Chai stifle giggles as the man goes into a stall. A few moments pass before the man stumbles out with his pants around his ankles and the lobsters claw around his junk. At a local dive bar, Jenny meets with a former boyfriend, a Bureau employee, and gets a background check on Guy Trilby. The ex-boyfriend makes awkward advances while she reads the papers realizing why Guy is in the National Spelling Bee in the first place. Guy takes Chai out to get chilidogs and milk shakes. Chai says that he's happy they are friends and Guy laughs. He tells Chai that he's always been a loner and when he was little his mother would always take him along, avoiding paying rent, so he never ended up with a lot of friends. He tells Chai that even if Chai never makes any more friends, he'll be fine just like Guy. Chai gives Guy a toy car he stole from the Super Market when they stole the lobster, pointing out that: \"toys aren't fun to play with if you don't have friends to share them with.\" Guy repays Chai's kindness by hiring a hooker to show Chai her tits. They return to the hotel and when Chai enters his room, his father is waiting. On the bus to the competition the next morning, Jenny asks if they can make time after today's round to talk not mentioning the background check. In her office, Deagan alters the days list so that Guy is given an extraordinarily hard word, and once again insults the host by telling him that he should speak English when he reads the words. Guy tells the girl he is now sitting next to that she might have dropped a hair clip on the ground when she stands up to check, he rips open a ketchup packet and pours it out on the girls chair. She complains that she couldn't see it but Guy tells her not to mind its time to celebrate: shes now a woman. The girl doesn't understand what hes saying but Guy tells her that she had her period all over the back of her pants. She gets nervous about the situation and, as the host calls her name several times, she runs out of the auditorium in embarrassment. Guy is called up to the podium after and the host pauses, horrified at the word he must now read out loud: Floccinaucinihilipilification. Guy asks him to repeat it, processing the word before slowly spelling it correctly! He smiles at Deagan and returns to his seat. The number of competitors dwindles until Guy and Chai are among the finalists. The angry mob returns to Deagan's office demanding her head (or just her resignation). She refuses until the host arrives with the tampered USB flash drive and points out she unfairly manipulated the competition so that Guy would get the hardest words: a violation of the conditions of the National Spelling Bee. The parents are horrified that Guy is still in the competition despite these measures having been taken. The host smirks at Deagan and tells her that while Guy may be an unlikeable asshole, he still deserves a fair chance. \"You're done\", he says. \"Did I enunciate that correctly?\" Guy returns to the hotel and receives a message from the receptionist. He is surprised to see it is from Dr. Bowman. Meeting by a duck pond, Dr. Bowman confesses that, when he was younger, he had a wild time often coming to the precipice of making life altering mistakes. Each time, with no guidance of his own, he was able to turn around and walk away from those mistakes to make something of himself. He tells Guy that he's approaching an abyss of his own and assures him that if he continues further in the competition he will not be able to live with what he did to all those children. Guy retorts that it's a nice threat, but Dr. Bowman simply says Losers lose, Mr. Trilby. Dr. Bowman walks away after confirming that he thinks Guy is nothing more than a loser but Guy tells him that he's not going to lose. Swinging by a gas station to pick up a few Playboys for Chai, Guy walks up to his room when Jenny arrives eager to talk about her discovery. He brushes past her, all he wants to do is give the kid his porn and ice cream and then go to sleep. Jenny gets upset that Guy can't even fake interest in talking despite the way their relationship has been going. She calls him a prick and leaves him on his own. As he reaches Chai's room, he sees the door ajar and talking from within. Chai's father reminds Chai that while Chai must keep Guy close for the competitive advantage, he must not get too close as Guy is still the enemy and that he should keep Guy close so that Guy wont be able to bring himself to beat Chai when the time comes. Chai says he knows the plan when Guy bursts in, angry. Guy reveals he heard everything and tells Chai that he makes him sick. Chai insists that they're really friends but Guy calls him a liar. But Guy, we ARE friends you showed me my first boobs! Chai's father is instantly confused but Guy reiterates that Chai is a liar. Guy tosses the toy car onto the floor and stomps it before storming out. Later that evening, the receptionist calls Chai's room to tell him that his father will pick him up in the lobby to take him out for ice cream. Chair leaves the room and, as he does, Guy sneaks in. Chai arrives at the lobby and waits, confused, before returning to the room and finding Todd his spelling binder missing. Noticing a bright orange light in the window, Chai draws closer pulling apart the shades to reveal Guy in the courtyard: burning Todd and giving Chai the finger. Chai bursts into tears of anguish at the sight of his notebook on fire. A few hours later, when hes sure Guy is asleep, Chai calls the police to report that Guy has abducted and possibly raped a young woman. He watches as two police officers burst into Guys room and drag him out violently. Jenny gets Guy out of jail and insists that they talk about what shes found. She confesses that she knows his father is Dr. Bowman and Guy congratulates her she's a better reporter than he thought. Guy tells her that his mother told him on her deathbed who his father was and how to find him. Bowman had been a traveling encyclopedia salesman and his mother was a waitress; after a one night stand, she got pregnant, told Bowman and Bowman took off. Pissed at Bowman and angry at the loss of his mother, Guy decided to embarrass Bowman and his precious spelling competition. Jenny asks Guy if Bowman knows who Guy is. Not a clue. But he will once its over. The finals get underway speller after speller is eliminated. When Guy is called up his word is slubberdegullion. Before he can start spelling, the mother he insulted at the hotel restaurant calls out Perfect, I know what that means a dirty, wretched slob just like you. The host turns towards her and says that if she keeps talking, she will be asked to leave. Outraged, she screams that the host should ask Guy to leave security offers come and escort her from the room as her outburst escalates into profanities on national television. The entire crowd begins chanting Kick him out, kick him out over and over forcing Bowman to take the mic and tell them that they are on national television and should show the competition the respect it deserves that he deserves. He tosses the mic to the floor and Guy responds in kind by spelling the word correctly and taking his seat. The third to last speller is eliminated and now its just Guy and Chai. Guy is called up first and given his word: Parisology. Guy looks out at the crowd, taking them in. He spells slowly and deliberately looking right at Bowman as he purposely misspells the word. Everyone begins clapping in excitement but the Host interrupts to remind them: because its the final two, Guy will stay on stage until Chai spells his word correctly if Chai messes up his word, Guy will get another chance to win. Guy sits down and tells Chai hes done but Chai insists that they are still friends and misspells his word to prove it. Guy is dumbfounded and gets up to the mic, misspells his word again and tells Chai that its his game to win. Chai refuses telling Guy that if this is the only way to prove they are friends then its what hell do. Guy tells him to stop wasting his time turning to Chai's parents in the audience to complement them on what a lying piece of shit their son is. He goes up to take the mic and misspell his next word when Chai gets up and growls I did not lie! kicking Guy straight in the balls. The collective audience gasps in surprise. Guy breathes in you can add violent to the list. Gandhi would be proud. Dr. Bowman rushes to the stage as Chai picks up a chair and declares I was born in Cleveland, Ohio! swinging for Guy but knocking Dr. Bowman off the stage instead. A commercial interruption. Public access tv messages float by as the Host, officials and Dr. Bowman decide on how to proceed. Dr. Bowman addresses the audience because the contestants behavior was equally egregious, neither will be disqualified. They will each be given 1 more round of words and the winner will then be decided. Chai goes up first and his father stands up, begging the boy not to embarrass him or his mother any further. Guy realizes that if he doesn't think fast, this could drag on further. When the host reads out Chai's word, Guy immediately says Come on kid, easiest word in the world and misspells it. Chai retorts that Guy missed a letter, and spells it correctly. Dr. Bowman laughs triumphant BOTH contestants can now be disqualified on the grounds of cheating. But the host quickly points out that because Guy was purposefully misspelling the word and Chai corrected him, Chai wasn't receiving help and STILL spelled the word correctly. Bowman declares Chai the winner and Guy walks off the stage and towards the exit of the auditorium. As he leaves Chai insists that he wants to split the winnings with Guy because they're friends, but Guy smiles and gives the kid the finger and leaves. In his hotel room, Guy sees the supply list hanging on the wall and decides to write down his story in a letter for Bowman - explaining who he is, how he got there and why he did what he did (bookending the narration of the film). He and Jenny check out, smiling having patched up their differences. On the way out of the hotel, he passes Dr. Bowman and hands Bowman the letter but Bowman rips it in two. What could you have to write that I would be interested in reading? Guy frowns and responds: The bit about me being your son. He takes Jennys hand and walks away. As he leaves, Bowman stoops down to pick up the letter. On a plane home, Bowman has the taped letter in his hand and reads it over the last line explaining that the note wasn't about blame, it was just an explanation and a request for understanding. Guy signs off Yours, literally Guy Trilby. Sometime later, Chai leaves school and a pair of bullies knock his stuff to the floor. As they cycle away, an unmarked Crowne Victoria pulls up in front of the school with Guy in the drivers seat. Chai asks how Guy got the car and Guy tells him that he won it at a police auction with his half of the winnings. He offers the kid a ride and puts a siren on the roof. Together, they drive after the bullies on their bikes cheering as they do it. The End.",
      "writers": ["Andrew Dodge"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2170299/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwNTg0NzQ1NF5BMl5BanBnXkFtZTgwMDQ5OTMwMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Bateman, Kathryn Hahn, Allison Janney | See full cast and crew »"],
      "reviews": [
         "This is indeed racist and it's also misogynistic. Does this mean that a movie with those qualities can't be funny? The movie knows it's racist and (wow this word is overused lately) misogynistic . It's also extremely funny. If you know you can't see past certain things like that then I suggest you don't watch this movie. It's mean and and very crude and hilarious. I was actually ashamed that I laughed at some of the jokes as I consider myself to be a good person but they are so shamelessly delivered by Bateman I just couldn't help myself. Young Rohan Chand was very likable and held his own with Bateman who knows first hand about what it takes to be a child actor. Turn off your media forced judgment and just enjoy the movie. Even assholes can be funny.",
         "It's very rare that I find myself lost in the narrative, characters and the comedy that I forget altogether that I am watching a movie intent on criticizing it. Jason Bateman's (Horrible Bosses, Up In the Air) directorial debut Bad Words did just that�allow me to lose myself to laugh so hard with such shocking moments that I almost forgot I had to review the film. Bad Words is a short, sweet and unexpectedly dark comedy with instances of pure vulgarity and vileness that is at the same time, heartwarming�yes, you read that right. For one, Bad Words was the first ever straight-up comedy I have ever experienced at TIFF. Of course, so many movies have heavy comedic instances, but I can assure you, Bad Words will have you laughing so hard, that at times, you'll find it hard to hear the next bit of dialogue (I'm warning you from experience). The film opens with unexplained genius Guy Trilby (Jason Bateman) entering himself in a regional spelling bee, with a brief flashback explaining how he has been able to register legally. From the moment the movie starts, Bateman has the audience in tears and on the floor laughing, winning the regional bee sending him off to the national bee, in hot pursuit of all the angry parents and students who he beat at the regionals. Once Bateman makes it to the super bowl of spelling bees, The Golden Quill, along with his travelling documenting reporter (Kathryn Hahn, We're The Millers), hilarity and vulgarity ensue. The mystery behind Trilby's anger with the world, constant bitterness and his obsession with winning the bee is at the centre of the film, along with his inability to allow anyone get close enough for him to care, drive the narrative. The blend of Bateman's dark direction and stylistic choices, along with screenwriter Andrew Dodge's fiercely morbid dialogue allow for the experience to be natural and so unexpected. I have no idea if either Bateman or Dodge were inspired at all with the work of Bobcat Goldthwait (World's Greatest Dad, God Bless America) and his darkly satirical body of work, but if I was told that was another addition to that list of black comedy, I would not doubt it. The envelope is constantly being pushed in Bad Words. Each character Trilby interacts with, whether it be for an extended period of time, or just shortly, Bateman nails each and every scene with a natural sense of arrogance. Trilby's scenes with \"slumdog\" (Rohan Chand), a lonely prostitute on the street, or a victimized man going to a washroom stall, are some of the best in the film. Bateman undoubtedly has a keen eye for comedy. Rude, crude and sometimes completely uncalled for, Bad Words was a pleasant change of pace during TIFF and surely one of the most memorable comedies of the year. Expect Bad Words in a theatre near you. And the only thing bad about it, is how much you will find yourself laughing at the most inappropriate things, da*#it! Night Film Reviews: 7.5/10 Stars",
         "Thank you to Jason Bateman and all involved in making this film. It is sad that movies like this are such a rarity . We live in a world of idealism and of the studios putting out all of their god awful PG-13 movies or just plain god awful movies with solely profit in mind. It is such a treat to have a movie that is not politically correct, and done well. Nobody takes any risks. How can everyone stand for all of this sanitized entertainment. Bateman was great like he always is, this movie is hilarious!! To say this movie is racist is to say you have no brain, there was no hate in this movie. Jokes and stereotyping is not hate. People just love to ruin good entertainment for others. Thank you for this movie!!!! We are lucky to get 1 movie a year that is as good as this.",
         "The storyline allowed for a lot of funny moments and the movie definitely ran with it. It was hilarious and didn't stray from the plot to include any unneeded jokes (this is what draws me away from most comedies). The child, Chaitanya (Rohan Chand), was innocent and cute enough to provide a nice contrast to the unscrupulous Guy (Jason Bateman). With some heartwarming moments, this movie is more than just a rude comedy. The comedy is raunchy and vulgar though so it definitely takes a certain sense of humor to enjoy (sad to say that it is mine lol). Also, a little predictable, but that doesn't take away from the movie too much.",
         "I was blown away by the surprisingly low \"6.7\" current rating on IMDb. My theory: The easily offended were easily offended (perhaps the movie should have been called \"Bad Words\"). (Some of my favorite comedies: Dumb & Dumber, Super Troopers, and Tommy Boy). Jason Bateman stared in, and directed, this \"tightly\" constructed DARK adult comedy. There was not a wasted second or single \"slow\" moment in the entire 89 minutes. Everything was dead-on: The originality of the storyline, the casting, the acting, the timing, the tone, and THE KID!... I've never been a big fan of the \"cute, heart-strings-pulling, kid\" cliché, but you don't have to be to appreciate this kid - he takes NOTHING away from the dark humor, and only adds substantially to the film in every way. His authenticity and interaction with Bateman's character is as good as it gets (Roeper compared Bateman's spot-on apathy to Bill Murray's, and I couldn't agree more - you could just as easily picture Murray working his magic with the same degree of unflappability, esp. opposite such a contrastingly upbeat kid). Bateman is an unassuming Rock Star that let's his talents do the talking, and I'm looking forward to the next film he directs and leads.",
         "I feel compelled to review this because I believe some took this movie too personally, and thus rated it poorly. If you are easily offended, you might be shocked or uncomfortable on several occasions. If you understand this is an artistic work of fiction, or if you like dark, sinister comedy, you can laugh at how this movie relentlessly pummels you with awkward moments. My advice is to cast away your moral standings in reality, and try see this movie from another perspective. To be vague, it turns out there's a method to the madness towards the end. And for me, the underlying message made it worthwhile. Jason Bateman was incredibly convincing in this role!",
         "I'm pleased to report that I loved this movie, even though I expected to hate it. Based on the previews, I expected that this movie would be dull and creepy with formulaic, humorless, jokes. However, it was interesting, funny, and not that creepy. Jason Bateman pulled off the near impossible task of being a jerk when dealing with small children while keeping the tone funny, rather than offensive. Even the inherently creepy parts were more funny than creepy. Jason Bateman's inappropriate interactions with most of the child actors were inappropriate in juvenile ways, and the juvenile humor worked! Even the inappropriate interactions with co-star Rohan Chand were sufficiently funny that the creepiness didn't hurt the movie. Bad Words proves the comedic rule that: Mean or offensive jokes are acceptable if sufficiently funny.",
         "With a premise and character right in his wheelhouse, first time director and star Jason Bateman takes a script that could've been undermined by its clichés in the hands of a lesser talent and delivers an almost-winner with 'Bad Words'. On paper, Guy Trilby is one of the most unlikeable protagonists in recent film history, but Bateman is so skillful at these kinds of characters that you find yourself liking him despite your self. Talented co-star Kathryn Hahn provides a nice foil, and newcomer Rohan Chand is a dazzling breath of unpretentious fresh air as Guy's rival and eventual protégé. Though it never quite gels into something special, 'Bad Words' is a solid directorial debut for Bateman, and I look forward to seeing what he does next.",
         "Out of the gate, Jason Bateman's Guy Trilby cracks up the audience with his offensive humor and irreverent attitude toward everyone and everything around him (even his sole ally, reporter Jenny Widgeon (Kathryn Hahn), who capably plays a role likely too small by intention, allowing Trilby freedom to run amok). It isn't until much later that we learn his motivations, but they are largely irrelevant and contribute little to the value of this film. Bateman has proved before that his career renaissance, so to speak, is not strictly married to the \"nice guy\" we met in Arrested Development and revisited in Horrible Bosses; he has shown us in a variety of roles that he can play a bona fide jerk (see for examples his pleasantly unexpected appearance and performance in State of Play). But here, he takes this over the top. His rhetoric is rarely, if ever, appropriate to the given situation. Nearly every other character is adversarial, giving Trilby plenty of opportunity to offend and delight us. Even Trilby's sole attempt at magnanimity comes only when he feels he has accomplished his vindictive end, and in itself turns into a raucous, belligerent spectacle as he attempts to throw the spelling bee and allow his tenuous junior friend to win, while the boy wants the honor on his own well-earned merits. Despite his crass approach to everyone and everything around him, Bateman's Trilby is someone you can't help but like; this is certainly in no small part due to Bateman's overall likability as a person and an actor. You don't root for him, per se, but you certainly enjoy him. He was perfectly cast. Past roles hinted at this side of his acting chops, but here he takes you by complete surprise. See this film; you'll enjoy that surprise and the ride - it is non-stop and well worth the price of a movie ticket. Fast-paced, witty, offensive. If you enjoyed Seth MacFarlane's Ted, you'll love Bad Words.",
         "I agreed with every word of Don Carl's review except the subject \"Bateman is \"Murray-esque\". The film was very well written, paced, and shot. I enjoyed all of it thoroughly and am shocked by the low ratings it's received. I do not feel Bateman is \"Murray-esque\" but having seen Murray in St. Vincent I will say this movie was everything that movie should have been. I dislike St. Vincent because it didn't have enough depth and was not nearly as clever as Bad Words. This film easily makes it on my list of favorites. I think I might watch it again with friends."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Aggregate Films",
         "Darko Entertainment",
         "Digital Image Associates"
      ],
      "summaries": [
         "An adult, who has been a school dropout, finds a loophole in the regulations and participates in the largest spelling bee in the USA, The Golden Quill. His aim is to take revenge for something done to him in the past.",
         "A spelling bee loser sets out to exact revenge by finding a loophole and attempting to win as an adult."
      ],
      "budget": 9500000
   },
   "movielensId": 109895,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-09-06",
      "dvdReleaseDate": "2014-07-08",
      "directors": ["Jason Bateman"],
      "runtime": 89,
      "movieId": 109895,
      "title": "Bad Words",
      "mpaa": "R",
      "actors": [
         "Jason Bateman",
         "Kathryn Hahn",
         "Rohan Chand",
         "Philip Baker Hall",
         "Allison Janney",
         "Ben Falcone",
         "Steve Witting",
         "Beth Grant",
         "Patricia Belcher",
         "Rachael Harris",
         "Greg Cromer",
         "Matthew Zhang"
      ],
      "imdbMovieId": "2170299",
      "originalTitle": "Bad Words",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "pWibxfADyRc",
         "RDIiE56j-_w",
         "NMO7sBxE-4Q",
         "eHCjbOEhjOo"
      ],
      "plotSummary": "A misanthropic man sets out to exact revenge on his estranged father, by finding a loophole and attempting to win the National Spelling Bee as an adult. Figuring it would destroy his father, and everything he's worked so hard for as head of the Spelling Bee Championship Organization, Guy Trilby (Jason Bateman) eventually discovers winning isn't necessary for revenge, and that friendship is a blessing not a curse.",
      "tmdbMovieId": 209403,
      "avgRating": 3.33245,
      "releaseYear": "2013",
      "numRatings": 379,
      "posterPath": "/cEnpV3XLvgTp3eVXhY2eyQKZk4r.jpg"
   }
}