{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "mouse",
            "id": 2161
         },
         {
            "name": "concert",
            "id": 6029
         },
         {
            "name": "tom and jerry",
            "id": 155655
         },
         {
            "name": "piano",
            "id": 207592
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0039251",
      "video": false,
      "title": "The Cat Concerto",
      "recommendations": [
         46852,
         40144,
         90912,
         83765,
         39887,
         39920,
         40033,
         73632,
         40232,
         40235,
         53220,
         53217,
         53211,
         74098,
         53854,
         74961,
         134758,
         40164,
         68630,
         53210
      ],
      "backdrop_path": "/o0xOISG35JiTF479tU0hDr3JYvD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbd7",
               "name": "William Hanna",
               "profile_path": "/3rCaagU4QRi0JJhcdbUGKoqEWtG.jpg",
               "id": 13620,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbdd",
               "name": "William Hanna",
               "profile_path": "/3rCaagU4QRi0JJhcdbUGKoqEWtG.jpg",
               "id": 13620,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbe3",
               "name": "Joseph Barbera",
               "profile_path": "/A8Lorvx5HirKefQWmhftWGO5VI4.jpg",
               "id": 13594,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbe9",
               "name": "Joseph Barbera",
               "profile_path": "/A8Lorvx5HirKefQWmhftWGO5VI4.jpg",
               "id": 13594,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbef",
               "name": "Fred Quimby",
               "profile_path": "/effVGbjftsaInCdYWgvL7CgGwMl.jpg",
               "id": 137486,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47369251416c9106dbf5",
               "name": "Scott Bradley",
               "profile_path": "/nth9xgkmnqfzm2gswSsbfhAnNrf.jpg",
               "id": 137562,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.534634,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39853,
      "vote_count": 41,
      "budget": 0,
      "overview": "Tom enters from stage left in white tie and tails, sits at the piano, gets his focus as the orchestra in the pit beneath him warms up, and begins to play Liszt's \"Hungarian Rhapsody.\" Unbeknownst to Tom and the audience, Jerry is asleep across several of the high-note keys inside the instrument, so Tom's playing eventually wakes him. Jerry is pummeled by hammers, bounced by wires, and squeezed by Tom as the cat tries to play the concerto while dispensing with Jerry. Jerry's defensive antics add to the brio of the program and answer Tom with Jerry's own skillful musical attack. By the concerto's end, the duet leaves only one animal standing for the audience's applause.",
      "similar": [
         10340,
         10112,
         12092,
         525,
         11360,
         6477,
         10137,
         11319,
         326359,
         4978,
         20722,
         1791,
         5698,
         13576,
         13246,
         31135,
         461955,
         25623,
         11949,
         464
      ],
      "original_title": "The Cat Concerto",
      "runtime": 8,
      "poster_path": "/aZMvSCQWuh4Wf6meBIoQqvZ5UNH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1947-04-25",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Joseph Barbera",
         "William Hanna"
      ],
      "runtime": 8,
      "synopsis": null,
      "writers": [
         "William Hanna",
         "Joseph Barbera"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0039251/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1Mjc3MTg1OV5BMl5BanBnXkFtZTcwNDQyMDQ1MQ@@._V1_SY317_CR67,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "Tom, complete with a tuxedo, is a pianist performing a concerto (Hungarian Rhapsody #2) for the audience. Things are going well until Jerry, peacefully asleep inside the piano, is rudely woken up. The rest of the cartoon slows various ways these two guys torment each other. The amazing thing was that no matter what happened, the concerto kept on going and sounded great. In fact, you could probably turn your head away from the television and just enjoy the concert! Unlike most of the stories, this one revolved just around one object (a piano) but the sight gags were all good and the more I think about it, extremely clever and I can see how it won an Oscar.",
         "Tom is playing Hungarian Rhapsody #2 for an audience, but when he wakes up Jerry, he must maintain his perfect piano playing abilities while contending with the mouse. I know there was a controversy between this short and the WB's Looney Tune short \"Rhapsody Rabbit\" (which is a funny short as well and the similarities are a lot), but I feel that this Tom and Jerry short is the clear winner. It is damn near pitch perfect and one of the best Tom and jerry cartoon shorts of all time. And rightfully so. The classic tune meets classic animation. This award winning cartoon can be found on disc one of the Spotlight collection DVD of \"Tom & Jerry\" My Grade: A+",
         "Cartoon studios have been blending animation with music probably since the start of animation. Particularly classical and also jazz. Every major studio has done at least a few cartoons where the animation is done to the beat of the music. This is one of the best of the MGM efforts. One of the few times when my sympathies have been with Tom more than with Jerry. While Rhapsody With Rivets is the best short to blend classical with animation (Sliphorn King of Polaroo was tops for jazz!), this cartoon, with several other Tom and Jerry shorts, does very well indeed and won an Oscar. Highly recommended.",
         "Tom flawlessly performs a Liszt piano concerto despite simultaneously engaging in the usual Tom and Jerry antics. Lifted above the usual high standard of the Fred Quimby produced series by the flawless melding of action and music",
         "* Spoiler warning - you may do yourself harm watching this cartoon * I have been doing a complete analysis of The Cat Concerto as part of my PhD work and I have spent 100 hours on it. You may think me mad but I still burst out laughing when I see one of the single frames as I step through them. Scott Bradley's arrangement of Liszt's 2nd Hungarian Rhapsody (piano duet, played by Bradley and John Crown, head of Piano at University of Southern California) makes an excellent canvas for Muse, Barge & Spence to animate. There are more comic gems in this 7 minute cartoon than all the latter-day comedy features put together. Truly wonderful. If you get the chance to watch the cartoon frame by frame on a computer, do so, but I disclaim any responsibility for asphyxia or self-harm from rolling on the floor. Top marks.",
         "In a departure from the usual household mayhem, Tom stars as a classical concert pianist. Dressed in a tailcoat and hammering out Hungarian Rhapsody Number 2 (which you might recognize as the tune played by Daffy and Donald in Who Framed Roger Rabbit) he is bothered by Jerry, who just happens to live inside the piano. Cue loads of tricks played on poor Tom, who is desperately managing to stay in tune as Jerry runs amok. This cartoon actually won an Academy Award back in the day and it's easy to see why. The editing and timing are dead on, as is the imagination. A lot of laughs to be had here and one of the best Tom and Jerry shorts.",
         "Having studied piano for years, I can really appreciate the effort to make it look like Tom is really playing this piece, and the wonderful effort to make the action fit the music only adds to the enjoyment. Perfect 10.",
         "This is a wonderful wedding of music and cartoon action, brought off flawlessly with panache and great slapstick humor. The scissors gag alone is enough to put this one in the hall of fame. This short very much deserved the Oscar it won; it ranks among the best cartoons ever made, bar none.",
         "I'm 20 years old and I'm still crazy for \"Tom And Jerry\".This is not just a \"Tom And Jerry\"cartoon,this is the greatest cartton ever made.All cartoonist should see this classic to learn how to create a great cartoon.Everithing is at his best:the music,the settings and of course there is Tom.Is impossible you don't fall in love with Tom.If I had to rate this cartoon 1-10,I certanly would give 10000.",
         "It doesn't matter how many times you see it, it will still bring tears of laughter to the eyes! A perfect blend of classical music and the chaos that only Jerry Mouse could ever wreak on Tom's efforts as a classical pianist... The only other cartoon that comes close is Bugs Bunny's \"What's Opera, Doc?\" Cat Concerto is simply, the funiest, greatest, best cartoon ever made. Enjoy!! Over, and over and over again!"
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family",
         "Music"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Tom enters from stage left in white tie and tails, sits at the piano, gets his focus as the orchestra in the pit beneath him warms up, and begins to play Liszt's \"Hungarian Rhapsody.\" Unbeknownst to Tom and the audience, Jerry is asleep across several of the low-note keys inside the instrument, so Tom's playing eventually wakes him. Jerry is pummeled by hammers, bounced by wires, and squeezed by Tom as the cat tries to play the concerto while dispensing with Jerry. Jerry's defensive antics add to the brio of the program and answer Tom with Jerry's own skillful musical attack. By the concerto's end, the duet leaves only one animal standing for the audience's applause.",
         "Jerry is determined to disrupt Tom's concert while Tom fights him with the piano without missing a single note."
      ],
      "budget": 0
   },
   "movielensId": 109953,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1947-04-25",
      "dvdReleaseDate": null,
      "directors": [
         "William Hanna",
         "Joseph Barbera"
      ],
      "runtime": 8,
      "movieId": 109953,
      "title": "The Cat Concerto",
      "mpaa": "NR",
      "actors": [""],
      "imdbMovieId": "0039251",
      "originalTitle": "The Cat Concerto",
      "genres": [
         "Animation",
         "Comedy"
      ],
      "youtubeTrailerIds": ["YQred-1IDHc"],
      "plotSummary": "Tom enters from stage left in white tie and tails, sits at the piano, gets his focus as the orchestra in the pit beneath him warms up, and begins to play Liszt's \"Hungarian Rhapsody.\" Unbeknownst to Tom and the audience, Jerry is asleep across several of the high-note keys inside the instrument, so Tom's playing eventually wakes him. Jerry is pummeled by hammers, bounced by wires, and squeezed by Tom as the cat tries to play the concerto while dispensing with Jerry. Jerry's defensive antics add to the brio of the program and answer Tom with Jerry's own skillful musical attack. By the concerto's end, the duet leaves only one animal standing for the audience's applause.",
      "tmdbMovieId": 39853,
      "avgRating": 3.45455,
      "releaseYear": "1947",
      "numRatings": 33,
      "posterPath": "/aZMvSCQWuh4Wf6meBIoQqvZ5UNH.jpg"
   }
}