{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "homophobia",
            "id": 1013
         },
         {
            "name": "law",
            "id": 3703
         },
         {
            "name": "african american",
            "id": 11243
         },
         {
            "name": "gay son",
            "id": 12342
         },
         {
            "name": "bronx",
            "id": 161307
         },
         {
            "name": "criminal defence lawyer",
            "id": 177453
         }
      ],
      "imdb_id": "tt0135166",
      "video": false,
      "title": "Blind Faith",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Charles Williams",
               "gender": 2,
               "credit_id": "52fe4e89c3a36847f8296ecb",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "John Williams",
               "gender": 2,
               "credit_id": "52fe4e89c3a36847f8296ecf",
               "name": "Courtney B. Vance",
               "profile_path": "/fscE874yHp4aeLLhMFD66OwYQt0.jpg",
               "id": 24047,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Eddie Williams",
               "gender": 2,
               "credit_id": "52fe4e89c3a36847f8296ed3",
               "name": "Kadeem Hardison",
               "profile_path": "/aCuoYn6GdVqZyy35JmqaY6TS9bO.jpg",
               "id": 66554,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Charlie Williams",
               "gender": 0,
               "credit_id": "52fe4e89c3a36847f8296ed7",
               "name": "Garland Whitt",
               "profile_path": "/jFZR5cuEBHMqNGGGJtrU0w1hCqk.jpg",
               "id": 59570,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Carol Williams",
               "gender": 1,
               "credit_id": "52fe4e89c3a36847f8296edb",
               "name": "Lonette McKee",
               "profile_path": "/yBHA5X3AZKHOtex7chwo2mQQ5Vr.jpg",
               "id": 62127,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4e89c3a36847f8296ec7",
               "name": "Frank Military",
               "profile_path": null,
               "id": 40053,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4e89c3a36847f8296ee1",
               "name": "Ernest R. Dickerson",
               "profile_path": "/2plWyKruDXgk6GQI9ex8lieymoK.jpg",
               "id": 15521,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.602315,
      "production_countries": [],
      "id": 238972,
      "vote_count": 2,
      "budget": 0,
      "overview": "in 1957 an African-American criminal lawyer (Courtney B. Vance) defends his nephew, who faces the death penalty for murdering a white boy. Charles S. Dutton, Kadeem Hardison, Garland Whitt and Lonette McKee costar in this drama of racial and social tensions.",
      "similar": [
         377154,
         184352,
         376867,
         383526,
         338189,
         11000,
         382475,
         152584,
         26280,
         10806,
         400547,
         160165,
         291869,
         11703,
         31225,
         258034,
         4369,
         105526,
         222918,
         296029
      ],
      "original_title": "Blind Faith",
      "runtime": 122,
      "poster_path": "/sxGvxi7GOabMVJGjYBPlUXVum78.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Showtime Films",
         "id": 5861,
         "origin_country": ""
      }],
      "release_date": "1998-11-23",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "What would you be willing to sacrifice to keep your family secrets?",
      "adult": false,
      "homepage": "http://www.sho.com/sho/movies/titles/97913/blind-faith#/index",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ernest R. Dickerson"],
      "runtime": 122,
      "synopsis": null,
      "writers": ["Frank Military"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0135166/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4OTQzOTI3MF5BMl5BanBnXkFtZTcwNzE2ODAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Courtney B. Vance, Charles S. Dutton, Kadeem Hardison | See full cast and crew »"],
      "reviews": [
         "Yes, this was a film I had always wanted to see, but failed to do so initially. When I finally got my chance to do so, I finally realized all that I had missed. This story, actually set in 1957 New York, revolved around the Williamses, a middle-class African-American family. The eldest brother, Charles (Charles S. Dutton), was an NYPD Officer with aspirations to become New York's first-ever Negro police sergeant. The middle brother, John (Courtney B. Vance), was an attorney from whose vantage point this story is narrated. The youngest brother, Eddie (Kadeem Hardison), is a jazz musician. However, that is where the similarities halt. Charles, married with three children, is a by-the-book, strict father whose actions and interest in his job and overt willingness to belong to the white establishment, at even the cost of his own family, take on the squalid decorum of a white man's black man, overshadowing whatever actual compassion he may have. John is the aptly-placed middle brother who is loyal to Charles, yet somewhat torn by his devotion to Charles and the variances of his younger brother, Eddie, the free-thinking, spirited, open-minded individual who easily sees Charles for who and all he really is in ways John cannot--and actually, at first, refuses to. It is Eddie, coincidentally, who turns the tide for the family's--and the film's--complexion with his revelating disclosure about all that has happened and why. When Charles, Jr. (Garland Whitt, who was also featured alongside Denzel Washington in \"The Hurricane\") is arrested for a murder he was actually glad to have committed (we learn the reason why as the story unfolds), Charles Sr. becomes more committed to going along with the NYPD conspiracy behind the truth of the murder rather than being more of a father and standing up for his son as a real father would--and should. When no other attorney will take the case of defending Charles Jr., John decides to risk his practice by defending his nephew. Invariably, it is Charles Sr.'s wife, Carol (Lonette McKee, in one of the finest, strongest and courageous performances ever given by an African-American woman on celluloid EVER!!!!) who takes the stronger stand and rises to the occasion to stand up to her selfish, broodish husband to be, as the mother, THE parent to her son that Charles Sr., as a father, is not!!!!!! I can realize why this movie did not get the attention it rightfully deserved: it is a true slice of African-American life that black folks are too afraid to acknowledge about themselves on screen. To me, this movie spoke more loudly of true black family values than Soul Food did (and did well). Even today, Black America is too ashamed, frightened and embarrassed to openly realize and see sexual and gender minorities (of which I am one, as a transgendered black woman) as part of their reality, at times conveniently hiding out behind the guise of religion as an excuse of not having to deal with many issues (besides this one) openly. Although set in the late 1950s, this story is very real and still so very true today even in this new millennium we are now living in. This movie, concurrently, shows us through each of the three brothers, what we at times choose how we would like to be (Dutton), what we would wish to be (Vance) and how great we as people really are and can truly be (Hardison). As for Ms. McKee, she embodies the rock-solid strength of true, unconditional love--a real mother in every sense of the word. I would recommend this film to any one who wants to take a hard, cold yet true concurrent look of how a family should and should not be in a way that embodies yet discourages family dysfunction at the same time. Also of importance is how much conformity and not taking a proper stand when a true stand is needed can cost even our loved ones.",
         "I imagine that Blind Faith was blocked from mass circulation. It's not because it was made for TV or bad acting, directing or film-making. It may have been blocked due to its highly charged content. It says that black family members choose to relate to white world in different ways that may generate conflict within our families. How this theme was handled by writer, Frank Military, and director, Ernest R. Dickerson reveals a side of black life too incendiary to be popularized. The title refers to how some blacks so believe in white definitions of what's good, pure and noble that we strive for that to our own detriment. Few films explore this theme and this one does so in ways that threatens global racial hegemony. How would blacks change if they could see themselves divided by racial sentiments derived from hegemonic white culture? Many would not be comfortable with such change. An eighteen year old youth is charged with murdering a white youth. One presumes racial injustice will emerge but the story takes a different turn. Initially produced for Showtime television, it enjoyed a limited theatrical run in 1998, but no one I know has ever heard of Blind Faith. Still, it impressively was nominated for several Independent Spirit Awards and should have won many, but such films rarely win awards. I may not have seen it had I not been flipping cable TV channels, and landed on the Sundance station. Oh, what a lucky flip that was! Dramatic acting and directing are superb, despite a made-for-TV format stamping its sketchily structured mark on this film. An intimate black cultural presence is evoked through well selected casting with portrayals by some of America's best and most popular actors like Charles Dutton, Lonette McKee, Kadeem Hardison, and featuring Courtney B. Vance, as defense attorney and narrator, who recently appears with Denzel Washington in The Preacher' s Wife. There are great performances by Joel Gordon and Garland Whitt who play the most controversial roles. Notable were highly credible European American roles played by Dan Lett, Aron Tager, Shawn Lawrence and Peter MacNeill. Add to this volatile mix the savvy subtly of a director like Dickerson. He's paid his cinematic dues with John Sayles on The Brother From Another Planet and with Spike Lee on six of his projects including Malcolm X. Such hot cultural credentials would have drawn a huge black audience had the film been properly promoted and distributed. The trial of Charles Williams Jr. occurs during the fight for black liberty prior to the Civil Rights movement when our only hope was the diligent genius of a few black lawyers. Black men were supposed to know their place or pay the penalty of death for actual or imagined crimes against whites. One anticipates the usual lynching, but is stunned as the plot reveals why a black boy and his people face a murder charge. Less about the boy's trial and more about three brothers, one of whom, Charles Williams (Charles Dutton), is the boy's father, the central focus of racially gendered tension is established between the boy's father and uncle who is his lawyer. Both the tension and action emanating from estranged brothers throws them into a conflict that opens wounds, thereby offering a chance at reunion and redemption. Will an opportune healing be achieved? The film's answer is not revealed. Many will shudder at its capacity to demonstrate how black men can succeed and fail in their racially plagued quest for humanity when white world robs them daily of their masculine self-esteem. For that reason alone, the loss of this film to the masses is a great one and one needs no conspiracy theory to explain how films like this, and similar ones, like Sankofa, by Haile Gerima, routinely are not selected for mass circulation. This happens because blacks may now enjoy access to the media, but ultimately, whitened people almost unilaterally decide what will be circulated and promoted. (See my essay, No Black Public Sphere in White Public Space, Transforming Anthropology. 8(1&2): 111-128). Among those who overlooked it, Blind Faith may have been too blatantly honest about the harsh effect of racism on black families or too clear about the racism-driven rise of homophobia in the black community. Black responses to sexual minorities typically are formulated on the white side and in anti-black terms: being a sexual minority in the heterosexual black community is often seen as undermining black struggles against racism. Despite the incredible work of Marlon Riggs whose last film, Black Is...Black Ain't explored how black sexual and gender minorities are grounded in black cultural idioms and commitment, and yet even among those who love them most, such blacks generally are considered to be shamefully and dangerously playing into the white man's hands. Another theme is that despite success, a black man's achievement of whiteness can be impugned by his association with so-called deviants. But the film does not stop there; it crashes forward by questioning black masculinity. The triumph of love among black men secures no victory over evil, however. Evil is not displaced onto whites, most who behave as friends or allies in this film. Evil is located within the black family and operates within self-denigrating spaces mapped out by the failure of black love and affiliation. But locating evil in black families is not done to blame the victim. Rather, it makes us reflect on our taken for granted embodiment of racism. We are compelled to notice how we aim to change ourselves in vain efforts to live as whites would have us to live. Accommodating the imposed standards of whiteness in ways preferable to European Americans is often not accomplished without paying the price of one's soul. Exploration of evil is accomplished without anyone standing on a soap-box. Blind Faith's dramatic quality, passionate intensity and analytical depth reminds me of a comparable film: Karim Ainouz's Madame Satã (2002), another 'must see.'",
         "In a way, it is easy to see why a movie like Blind Faith was lost in the shuffle; a period piece with an all Black cast that deals with racism. On the other hand, it's hard to imagine why no one has heard of a film this good. It was directed by Ernest Dickerson, long time cinematographer for Spike Lee, and it stars recognizable names, Charles S. Dutton, Courtney B. Vance, Kadeem Hardison and Lonette McKee. The film was produced for Showtime television, had a very limited theatrical run in 1998 and was nominated for several Independent Spirit Awards. I didn't see the film until 1999, when it played at a Film Festival in St. Louis. When I read the cast list and saw who directed it, my jaw dropped. How had this film escaped my radar? I was even further shocked when I saw it. It is (along with Being John Malkovich and Boys Don't Cry) one of the three best films I've seen in 1999 and one of the most powerful films I've seen since Uli Edel's Last Exit to Brooklyn, ten years ago. The film is the story of a young Black boy named Charles Jr., a cop's son, accused of murdering a young white boy in civil rights era New York City. He confesses to the crime and refuses to do anything in his own defense, which his uncle John, who is also his lawyer, can't understand. The boy has no history of violence or crime and was basically a quiet unassuming kid.In spite of the lack of cooperation from Charles Jr., John mounts a defense, even though the prosecution seems to have an open and shut case and is pushing for the death penalty. To give away more would be as big a crime as revealing the plot twists at the climax of The Sixth Sense or Fight Club. What makes this movie so great is its subtlety and its realism. The Black characters are not saints and the white characters are not demons. Movies like this tend to sacrifice their power to sentimentality by making the minority characters into martyrs and heroes that are beyond reproach. Also, this film makes us like the white characters, so that when their racism finally shows, it is all the more shocking.Frank Military's script pulls off the difficult task of making us care about a story we think we've seen before, and then lets us know that we haven't seen it before. This movie is so much more powerful than preachy, Hollywood stuff, like Ghosts of Mississippi, that it eclipses those films completely. This is a hard hitting story of race and justice that all Americans need to see.",
         "It's difficult to understand the mentality of the film industry when it comes to content that deals with bigotry and race. While trash like like \"The Hurricane\" get wide distribution, quality films like \"Blind Faith\" are ignored. I caught this movie early in the morning on a Sunday on a cable movie station, it was really the only thing on. Lucky me. The movie was so powerful I was amazed I'd never heard of it, not an advertisement, review, nothing. The basic plot consists of a black accused of murdering a white and caught up in the legal system of the pre-Civil Rights era. Now that plot line is about as old as they come--well trod territory done with excellence in \"To Kill A Mockingbird\" and with ugly stupidity in \"The Hurricane\". But this movie gives us more and better than most legal oriented films of any kind. The film centers on an African-American lawyer, solidly acted by Courtney Vance, defending his nephew who steadfastly refuses to explain the circumstances behind the charge. This serves to explain the lawyer's relationship with his two brothers, one a policeman and father of the accused, and the other, a ne'er-do-well jazz musician. Charles S. Dutton is outstanding as the police officer, tormented and conflicted when his son is accused of murder. He's worked hard and long to achieve his success and status, and it's compelling to watch his rage at seeing all he's built teetering on the edge of a precipice. Courtney B. Vance puts in a fine performance as the lawyer, who is barely able to control his emotions through much of the film. His despair, confusion and anger cause him to periodically lash out, often to the detriment of his own cause. Kadeem Hardison, not a great actor to begin with, muddles through as the jazz musician other brother, a really unnecessary addition, but it serves as an excuse to listen to some really fine music, so perhaps that's reason enough for his inclusion. But for the most part, these are actual characters with nuance and depth, real people caught in a complex situation, not cardboard heroes with cardboard virtues who mouth inane slogans. In one scene the black lawyer coaches a witness to lie on the stand, to commit perjury, out of desperation. In another, the judge upbraids him after he yells at a witness, concluding with \"remember your place.\" The judge could easily be referring to the courtroom and his role as lawyer, or is it a racist comment, as the character takes it to be? The ambiguity enriches the movie, allowing the viewer to think, to ponder the circumstances. The white characters are not evil, they come off mostly as people just trying to do their jobs the best they can. The legal aspect of the movie is very well done too--no torturing the legal system with ridiculous departures from real process, or inane speeches that would be instantly ruled out of order in a real courtroom. The resolution, and a very compelling one it is, doesn't give anybody an easy out--it doesn't allow the viewer to just sit back and feel self satisfied, or blather on about a racist leviathan. It forces one to think about the nature of bigotry and prejudice. I won't say more, since to do so would give away the stellar climax. Perhaps the only flaw is the voice over at the end that explains what happens after the story essentially ends. It's needless and kind of silly, and really only detracts from what is a great film. It's as if the film makers don't trust themselves enough to totally follow through with the ambiguity with which they've left the viewers. It's unfortunate, but a common sin in Hollywood.",
         "I think this film could teach all people, including Black, White & Gay folk.... what hate is about and what it can cause society as well as family.... I would love to see this film brought back and put into theaters... I had the privilege of working on the Canadian Casting. Even after reading the script, I knew right away that it would make a great film. I was blown away and brought to tears when I actually saw it on the big screen. I was so disappointed when it disappeared after only a short time. I tell people about this film all the time. It's a shame that it hasn't been advertised more. To date, this is my favorite film. Juli Ann Kay, CSA / CDC Juli-Ann Kay Casting Toronto, Ontario",
         "I saw this movie today never having heard about it before. What a gift to have found it. That being said, I decided to look up some additional info about it's background and cast. I came across this message board and felt compelled to comment. While this is on the surface a racial, sexual orientation, legal drama I found it to be much more universal than that. I am a married white heterosexual woman and the theme that I came away with is how destructive negativity and hatred are and how beautiful love and acceptance can be on every level. Negativity and hatred affect us all from a soul level right to our global community. While love and positivity has the opposite profound ability to bring warmth and light into our lives. I was so moved by the end of the movie and the narrators last words about living a life dedicated to change. After the recent loss of my own son I too now live a life full of purpose. That purpose being to bring about a change of love and positivity to my own life and those within the greater community. Change on the grand scale is a slow process because belief comes from experience and patience is a requirement. But,once one feels the effects of such a change it is our greatest desire to highlight and make obvious the powers of love, acceptance and positive action for each and every soul on our planet regardless of our differences.",
         "Good solid film. Thank you cable television for having this on. Sometimes the unexpected happens and this is one of those films. To my disappointment I never heard of it before. So it took a few years since it was produced for me to find it. And now that I found it I really hope it it released on DVD. It is a good solid film - the script is dynamite, the cast is great - many wonderful actors - the acting also solid - there are a few weaknesses in the film, mostly because the director lost a bit of control but not enough to prevent anyone from watching this film. I could not out guess the script - which for me is always a good sign. Twists and turns, realism and clarity, I don't want to give away the plot in any form if you haven't seen it. This film is well worthwhile for everyone to watch. Enough of the junk Tyler Perry feeds the public - this is a good film about being black in America, being in a black family in the New York area in the 1950s. Thank you for making the film.",
         "very intense drama about an upcoming black family in the late 40s, who's life gets out of control as the eldest son turns out to have murdered an Irish boy. pace of the story, characters and the difficult topic as well as a professional film-making crew and excellent actors make this movie a super secret tip! this is not the invention of the wheel, but oh how much i enjoyed that movie. please read other user comments for further info; in my opinion this film is a real candy for those of you who like off-cinema and art-house productions. i also wonder why no one seems to have seen this movie, lets IMDb look a little weak. Themes in this film: family (values, suppression, violence), racism, inequality in societies concerning race or sexuality (esp. homosexuality).",
         "Of all the dozens of excellent films I have in my collection on VHS, this remains the film I would most like to see transferred to DVD. What a gem! When I originally purchased it without knowing a thing about it, I was slightly intrigued by the fact that the synopsis on the video box makes the film sound like a gritty suspense thriller, one of my favorite genres. The plot sounded interesting � a young black student is accused of murdering a while teen in NYC during the 1950's. OK, sounds like an intriguing piece of drama, I'll take it. So I took it home and was utterly blown away. One plot twist after another, fantastic acting, and a surprise theme about homophobia (which turns out to be the main point of the film) kept me riveted to my seat for the entire film. The story was believable, the drama intense, and the ending heartbreaking. I kept thinking about this film for days after I'd seen it, and since then I have lent my VHS to a half dozen friends, all of who were as emotionally effected by its sincerity as I was. This minor masterpiece, which sadly seems to be quite obscure, is a piece of drama that I would not hesitate to recommend to anyone. If you can manage to find it anywhere, rent it, purchase it, copy it, or steal it. You won't be sorry.",
         "***SPOILERS*** Going out to Van Cordlandt Park in the Bronx one evening in the summer of 1957 to get some air Charile Williams Jr, Garland Whitt, ends up beaten within an inch of his life by a gang of Irish teenagers who claimed that he tried to mug one of them. In fact Charlie didn't mug young Pat Sullivan,Michael Longstaff, he murdered him. Charlie strangled Sullivan to death before his friends could get Charlie off him! With a 1st degree murder charge hanging over his head Charlie now faces the hot seat in Sing Sing prison if he's convicted. And in Charlie being black and his victim Pat Sullivan Irish and white that's an absolute certainty with the city of New York in danger of exploding into race riots if Charlie ends up getting off. The fact that Charlie signed a written confession to the crime he's charged with they, the court, might as well forgo a trail and send him straight to death row! It's Charlie's concerned pop Charles Williams, Charles Dutton, a NYPD policemen who gets his kid brother defense attorney John, Courtney B. Vance, to defend Charlie and somehow try to get the death penalty thrown out by showing that Charlie's killing of Pat Sulliavn was not as clear cut or cold blooded as it at first seemed to be. Facing a brick wall in trying to find evidence in Charlie's favor John does find an eye witness to the Sullivan murder and elderly black lady Mrs. Berry, Birdie M. Hale, who lived in an apartment overlooking Van Cordlandt Park when the killing took place. What shocks John in Mrs. Barry's testimony is her description of the shirt that Charlie was wearing that night: powder blue instead of the one he was arrested with deep red! Yet Mrs. Berry swears that that's, powder blue, the color of the shirt that Charlie was wearing! What was not known at the time is that two murders were committed in the park that night. One of Pat Sulliavn and another of a back teenager wearing a powder blue shirt just like the one that Mrs.Berry described! It'a almost by accident that law student Frank, Alex Krzis, who's helping john on the case mistakingly hands him over a murder report that took place at the park that night, July 5, 1957, of a young black teenager from Brooklyn named David Mercer, Joel Gordon. Mercer was murdered the very day or night in the very same place, Van Cortlandt Park, that Charlie was arrested for murdering Pat Sullivan! ***MAJOR SPOILERS*** John seeing that there's some connection to both Sullivan and Mercer's murders is socked to find out from his reefer smoking beatnik and saxophone playing brother, the black sheep in the Williams family, Eddie played by Kadeem Hardison that the two, Charlie and David, were secretly having an homosexual affair behind everyone's back! The fact that his son is gay is something that his policeman macho father Charles Williams had found out the night that Charlie was arrested and together with his fellow cops kept that hidden from the D.A's office. It's also a fact that Charlie killed Sullivan in self defense after he and his gang murdered Charlie's gay lover David and then tried to murder him as well! But to keep his son's gay lifestyle secret his father is more then willing to let Charlie Jr end up in the electric chair to keep that secret from his family friends and fellow policemen! Deeply disturbing as well as touching movie about innocence lost in the big city circa 1957 when in the mind of many, men and women, back then in one, man or woman, being gay was worse then death itself. Charlie himself was more then willing to get executed as a convicted cold blooded murderer rather then him admit that he killed only in self defense when attacked by a gang of white teenagers, who tried to murder him, because of his sexual preference. John trying to get Charlie to go public in court about the circumstances in his killing of Pat Sullivan got nowhere with him as well as his father Charles Williams who was steadfast in keeping his son's, who he was grooming to be a member of the NYPD, gay lifestyle secret. ***MAJOR MAJOR SPOILER***It was only when the end was near and Charlie was on his way to the execution chamber that his dad Charles Williams broke down and called on brother John to go public by telling the state governor and local D.A the extenuating circumstances surrounding Charlie's killing of Pat Sullivan. But by that time it was too late! Charlie Jr pulled off a Hermann Goering by cheating the hangman, or in this case electric chair, by hanging himself just hours before he was to be executed! That without Charlie knowing that he had a very good chance of having his pending execution suspended with the new evidence that his uncle John was about to make public!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Neufeld Rehme Productions",
         "Showtime Entertainment"
      ],
      "summaries": ["In 1957, black lawyer John Williams has to defend his nephew Charlie, who is accused of strangling a white boy to death. John doesn't believe Charlie did it, and although Charlie confesses, John wants to find out the real truth."],
      "budget": 0
   },
   "movielensId": 109912,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-11-23",
      "dvdReleaseDate": null,
      "directors": ["Ernest R. Dickerson"],
      "runtime": 122,
      "movieId": 109912,
      "title": "Blind Faith",
      "mpaa": "NR",
      "actors": [
         "Charles S. Dutton",
         "Courtney B. Vance",
         "Kadeem Hardison",
         "Garland Whitt",
         "Lonette McKee"
      ],
      "imdbMovieId": "0135166",
      "originalTitle": "Blind Faith",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "in 1957 an African-American criminal lawyer (Courtney B. Vance) defends his nephew, who faces the death penalty for murdering a white boy. Charles S. Dutton, Kadeem Hardison, Garland Whitt and Lonette McKee costar in this drama of racial and social tensions.",
      "tmdbMovieId": 238972,
      "avgRating": 3.25,
      "releaseYear": "1998",
      "numRatings": 2,
      "posterPath": "/sxGvxi7GOabMVJGjYBPlUXVum78.jpg"
   }
}