{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cowardice",
            "id": 7956
         },
         {
            "name": "bully",
            "id": 10624
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0013201",
      "video": false,
      "title": "Grandma's Boy",
      "recommendations": [
         111853,
         42238,
         163363,
         50916,
         22924,
         289732,
         30177,
         33444,
         21990
      ],
      "backdrop_path": "/knrLwBW61DEfyXnt4kEHCmLw09M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Grandma's Boy",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a099",
               "name": "Harold Lloyd",
               "profile_path": "/aE1pPjEoYOVeG9BtqoYkKePzgCd.jpg",
               "id": 88953,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "His Girl",
               "gender": 1,
               "credit_id": "52fe4447c3a368484e01a09d",
               "name": "Mildred Davis",
               "profile_path": "/zchyBt9IOats4aok2TM6ITygfRB.jpg",
               "id": 88954,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "His Grandma",
               "gender": 0,
               "credit_id": "52fe4447c3a368484e01a05f",
               "name": "Anna Townsend",
               "profile_path": null,
               "id": 88955,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "His Rival / Union General",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a063",
               "name": "Charles Stevenson",
               "profile_path": null,
               "id": 88956,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "The Rolling Stone",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a067",
               "name": "Dick Sutherland",
               "profile_path": null,
               "id": 88957,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sheriff of Dabney County",
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a06b",
               "name": "Noah Young",
               "profile_path": "/xReuE153sUJASBj0h6kPQb2qbbm.jpg",
               "id": 88958,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a071",
               "name": "Fred C. Newmeyer",
               "profile_path": null,
               "id": 143385,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a077",
               "name": "Hal Roach",
               "profile_path": "/6VQIciKwBUsoJGDBlnIMV2iS4Cm.jpg",
               "id": 33223,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a07d",
               "name": "Sam Taylor",
               "profile_path": "/pY9U3YTrPTZY68YF75nszT9WX7G.jpg",
               "id": 143561,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a083",
               "name": "Jean C. Havez",
               "profile_path": null,
               "id": 10518,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a089",
               "name": "H.M. Walker",
               "profile_path": null,
               "id": 131383,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a08f",
               "name": "Thomas J. Crizer",
               "profile_path": null,
               "id": 148404,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4447c3a368484e01a095",
               "name": "Harold Lloyd",
               "profile_path": "/aE1pPjEoYOVeG9BtqoYkKePzgCd.jpg",
               "id": 88953,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56b9867292514106a40016a6",
               "name": "Hal Roach",
               "profile_path": "/6VQIciKwBUsoJGDBlnIMV2iS4Cm.jpg",
               "id": 33223,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56b9867bc3a3681e68002445",
               "name": "Walter Lundin",
               "profile_path": null,
               "id": 1002959,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56b98682c3a3681e6800244c",
               "name": "Thomas J. Crizer",
               "profile_path": null,
               "id": 148404,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.6642,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22592,
      "vote_count": 10,
      "budget": 0,
      "overview": "Always the mama's boy, or in this case a grandma's boy, Sonny joins a posse after a tramp accused of robbery and murder. He is unable to conquer his cowardice until Grandma tells him of his grandfather, also a coward, who overcame his fears with the help of a magic amulet. With new courage (and the charm), Sonny captures the fugitive and becomes the hero of the day. [Written by Herman Seifer]",
      "similar": [
         460793,
         449176,
         74643,
         34584,
         857,
         19,
         13310,
         348,
         81003,
         62211,
         244772,
         258230,
         328425,
         41402,
         82023,
         455661,
         458663,
         251516,
         9662,
         1792
      ],
      "original_title": "Grandma's Boy",
      "runtime": 60,
      "poster_path": "/5pwLDukrLNU3h7yjGYB23iZCDez.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hal Roach Studios",
         "id": 2159,
         "origin_country": ""
      }],
      "release_date": "1922-09-03",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Where Laughter Reigns and Joy Pours!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Fred C. Newmeyer"],
      "runtime": 60,
      "synopsis": null,
      "writers": [
         "Hal Roach",
         "Sam Taylor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0013201/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NDM4OTU2NV5BMl5BanBnXkFtZTgwOTIzODYwMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Harold Lloyd, Mildred Davis, Anna Townsend | See full cast and crew »"],
      "reviews": [
         "About 20 years ago I was fortunate enough to see Harold Lloyd's first feature-length film, Grandma's Boy, at a public screening. I recall that it went over very well with the audience, that Harold was highly sympathetic in the lead role, and that I found the movie pleasant and engaging, with a stronger plot than some of Lloyd's later features. Now that I've rediscovered the film on DVD it's a pleasure to report that it holds up beautifully and, unlike some silent comedies, plays well on TV. Grandma's Boy is a richly atmospheric period piece that is sweet, funny, and suspenseful, and certainly ranks with Lloyd's best work. It's all the more impressive that this was his first attempt at a full-length feature, for it marks a genuine stylistic break with the sort of thing he'd been making up to this point. Unlike some of Harold's earlier, \"gag happy\" short comedies, this film offers a well structured story built around recognizable human beings who inhabit a basically realistic world. The story is more character-driven than gag-driven, and more relaxed in tempo than Lloyd's earlier films. Admittedly, some of the rural characters are a little cartoon-y, but they don't behave outlandishly or pick fights at the drop of a hat in order to get laughs. And while there are certainly plenty of laughs along the way, everything seems to unfold naturally, and nothing feels forced. Grandma's Boy is set in the sleepy rural village of Blossom Bend, which, we are told, is \"one of those slow towns where the Tuesday morning Express arrives Wednesday afternoon. If Monday's train gets out of the way.\" Except for a brief prologue and a flashback to the Civil War, the story takes place when the film was made, that is, in 1922, but in the sort of Town That Time Forgot that would have looked like a quaint throwback to some viewers even then. Harold plays a young man who lives with his grandmother, and is the kind of guy who would be called a wimp -- or worse -- nowadays. The prologue dramatizes Harold's lifelong reluctance to defend himself from bullies. He's a coward, he knows it, and he's miserable about it. On the other hand, Harold's grandmother is a peppery old lady who is not to be trifled with. (Anna Townsend plays this role, and she is wonderful). Grandma sympathizes with the boy's plight, yet also comes to realize that she has coddled him long enough, and that he must be tricked into finding the courage within himself. This movie paints a nostalgic picture of small town life that was never so simple in reality, but, like the story of Tom Sawyer, it holds the powerful appeal of life as we wish it was. Period charm is a major element of the film's strength, but in order to appreciate it fully a modern viewer needs a certain amount of historical perspective. For example: during one scene, when Harold is forced to wear his grandfather's ancient suit to a party, his embarrassment may be hard for some to understand. The other party-goers think he looks strange in his 19th century frock coat, but their own clothing looks just as odd to us as Harold's \"old-fashioned\" suit does to them, especially the leading lady's massive hair ribbon. (Did that thing look funny to some viewers, even in 1922? I'll bet the flappers thought so!) The film's best known sequence is a flashback to the Civil War, as Harold's Grandma tells him of his grandfather's exploits behind enemy lines. This is the funniest portion of Grandma's Boy, deliberately played in a \"heightened\" manner like a hokey stage melodrama. I was especially fascinated by the witch who helps Harold's grandfather triumph over his enemies; she wears heavy stage makeup, emotes like crazy, and looks like she must have a gingerbread house somewhere back in the woods. All of this wacky over-playing is acceptable, dramatically speaking, because we eventually learn that Grandma's story is, well, not entirely true. It's interesting that Lloyd and his colleagues took this approach to the Civil War sequence, but the reasons for doing so are not hard to imagine: when this film was made there were plenty of actual Civil War veterans still around, and the war and its aftermath lingered as a painful memory for many. Perhaps the filmmakers chose to treat the war scenes as jokey melodrama in order to make the material more palatable to contemporary audiences. A few years later, when Buster Keaton made The General, he chose to treat the war with almost documentary-like realism while dropping black comedy gags into the mix, and some critics of the day felt his approach was in poor taste. Lloyd's version of the war is quite different from Keaton's but still valid in its own way, and may well have influenced Keaton when he made his masterpiece. As memorable as the Civil War sequence is, the most gripping section of the film depicts Harold's transformation from coward to hero, as he manages to subdue a dangerous tramp who has been terrorizing the town. (The tramp is played by Dick Sutherland, an enormous actor with an unforgettable face.) This is a terrifically suspenseful sequence, alternately funny and thrilling, and it's followed by a deeply satisfying finale in which this lifelong sissy applies the lessons he learned in dealing with the tramp to the bully who has tormented him since boyhood. And don't miss the delightful closing gag! Grandma's Boy is a film that leaves the viewer with a warm glow, one of the best movies Harold Lloyd ever made, and one of the top comedies of the silent era.",
         "GRANDMA'S BOY is a terribly timid fellow until the old lady decides to instill some much needed courage into him. This sweetly poignant and very funny film started off as a two-reeler, but star Harold Lloyd, with the approval of producer Hal Roach, kept adding gags until the completed picture ran about an hour. Harold also wanted something else - to instill a serious element to the story and his character, an innovation new to American comedy films. He succeeded brilliantly, with the finished film a joy, blending the hilarious and the sentimental seamlessly. As always, Harold is a special treat to watch, his amazing athletic abilities made even more impressive by the fact that he was missing half of his right hand. The plot makes Harold deal with both a contemptible bully and a vicious tramp, giving our hero full opportunity for running, falling, leaping & almost endless fisticuffs, all of which he carries off with great skill and good humor. And just to show that his bag of tricks is not depleted Harold throws in an uproarious Civil War flashback to delight the viewer. Lovely Mildred Davis plays the girl of Harold's dreams. Charles Stevenson as the Rival and Dick Sutherland as the Tramp both make wonderful villains. Noah Young, who so often played the heavy in Harold's films, here has the relatively small role as the sheriff of Blossom Bend. Best of all is sweet elderly Anna Townsend, playing Harold's little darling of a grandma; whether attacking the Tramp with a broom or rejoicing at her grandson's newly found courage, she remains the heart of this very special movie. Anna Townsend would die the following year, 1923, at the age of 78. Robert Israel has composed an excellent film score which perfectly complements Harold's antics on the screen.",
         "Although the similarity of this plot to several other Lloyd films is obvious (thus preventing it from getting a rating of 10), this is still one of Harold Lloyd's best. What sets this apart from many comedies of the same era is that it is NOT jam-packed with laughs but takes a more leisurely pace and tells a sweet story. Our hero, Lloyd, is a wimp with little self-confidence. His loving grandmother gives him Grandpa's good luck charm--saying it will give him strength and courage. As a result he is able to help the town look for a dangerous desperado and in the process prove to his girl that he is indeed a man. Great cinematography, pacing and excellent laughs all work together to make this his best film up until that time. Plus, unlike most comedies of the time, this one is quite artistic and sweet.",
         "Another fun Lloyd movie, set in the standard small, rural town of silent movies. (I always wonder how close those were to reality.) Lloyd is endearing as a timid boy, and displays some fine acting as well as comic ability. Anna Townsend as Lloyd's grandma is refreshingly both tough and likeable, a bonus for the modern female viewer. Mildred Davis (Lloyd's future wife) doesn't have a huge part, but plays it well. (Though I wonder about the childlike clothes she wears; would anyone over 13 really have sported a massive hair bow in 1922?) The movie seems to have had great influence: the civil-war sequence must have been an inspiration for Keaton's \"The General\", and a flashback to Harold's boyhood shows how his distinctive bespectacled look even helped create Harry Potter. As usual, several good animal actors. There is one joke--having to do with a white family's black butler--that is in kind of questionable taste, but it could be construed as more of a comment on class than race. You'll enjoy watching this with your kids (or without!)",
         "GRANDMA'S BOY is among the first silent comedies that focus on characterization. It is also Lloyd's breakthrough picture which set him on the rank of Chaplin and Keaton and we can easily see why. It's full of tightly linked, ingenious gags( even where he put his hat would serve as a link to later action ). It also keeps some acrobatic movements that reminds us of Lloyd's 2 reeler days. It has a strong story line, and consistent plot development and delicate performance from Lloyd as well. The Grandpa's Civil war episode is truly funny.",
         "I think the best overall summary would be to call this a dramatic comedy. Harold Lloyd displays accomplished slapstick while at the same time being involved in the drama of catching a tramp causing a lot of problems for the town. An ongoing subplot involves the used-to-be school bully (now grown up) who continues to bully Harold and does his best to take his girl from him. It is not until Harold's grandma tells him about a special amulet that his grandfather used in the Civil War and got his courage from that he gets up the courage to take after the tramp and take on the bully. All of the action involves numerous slapstick antics that really make the movie. Yet, with all of that, the point still comes across that things don't give us courage and abilities. We get our courage to act from within ourselves. This movie reinforces that there were very good silent movies made and we can learn from them and have a lot of laughs at the same time.",
         "\"Grandma's Boy\" is an entertaining Harold Lloyd comedy that combines plenty of his usual slapstick antics with some thoughtful, if simple, ideas that add another dimension. Lloyd's character is more sympathetic than usual, and the story is funny, includes some good action, and is occasionally reflective. While it does not have any dazzling sequences (such as in \"Safety Last\"), it succeeds quite well on its own level. Lloyd gives a good performance as always, with his hapless but earnest character. The rest of the cast helps out as well. Charles Stevenson is suitably overbearing as Lloyd's rival, Mildred Davis is likable as his girlfriend, and Anna Townsend is believable as his grandmother, determined to help out her boy. The amusing story that she tells about Harold's grandfather is one of the highlights, and it is used quite well in the plot. The rest of the story is good as well, and all in all this is an enjoyable little feature.",
         "This was the last of the comedies I watched on the Kino DVD called \"The Harold Lloyd Collection\" and the first feature for this legendary silent comedian. This was different from his shorts I saw previously on the disc in that since this movie had a longer running time, we don't get to the gags right away and as a result, one really gets to know and identify more with Lloyd. Here, he lives with his grandma (a charming Anna Townsend) who has long protected him but now has to find a way for him to get courage. There's also his bully rival (Charles Stevenson) for Mildred Davis' hand and a Rolling Stone (Dick Sutherland), who terrorizes everyone in town, Harold has to contend with. I'll stop there and just say what a very funny and touching movie this was. The story is both well told-even with a Civil War flashback also involving Lloyd-and the gags just flow nicely from one sequence to another. And the way Harold overcomes his adversities was just refreshing to watch especially concerning his old bully rival. So on that note, I highly recommend Grandma's Boy.",
         "Harold Lloyd's first great feature pits him in his ideal homespun setting with a simple and archetypal plot in which the mild-mannered Boy gradually learns to overcome his cowardice - with the help of his loving grandmother - to become the toast of the town; in this respect, it predates the star's more celebrated THE FRESHMAN (1925) in being, above all, character-driven (with a dash of sentimentality). That said, perhaps the film's most hilarious scene is a typical one in which both Lloyd and his rival for the affections of leading lady Mildred Davis unwittingly mistake moth-balls from Lloyd's ancient costume (which had belonged to his grandfather) for sweets. It's climaxed, however, by three lengthy and impressive set-pieces: the Civil War feat of the hero's grandfather (also played by Lloyd and remarkably anticipating Keaton's THE GENERAL [1927]); the chase leading up to the capture of the town bully by the newly-brave Lloyd (brought about by the presence of a Zuni doll - more than 50 years before such an artifact would achieve immortality via the classic made-for-TV compendium TRILOGY OF TERROR [1975]!); and our hero's settling of accounts with his mean-spirited rival, which features some rather physical tussling for this kind of film. As ever with Lloyd, apart from providing the requisite attention to gag structure and the creation of atmosphere, the film results in being quite technically proficient.",
         "The second Harold Lloyd feature film, and the first made for that purpose, \"Grandma's Boy\" is a winning mixture of sentiment, action, and good humor showcasing what would be a key Lloyd theme, of confidence as a difference maker. We meet Harold as a frail, frightened youngster, wearing those signature round glasses even as a toddler and doing nothing when another toddler snatches his cookie. In grade school, we see him easy prey for even smaller boys. \"The boldest thing he ever did was to sing out loud in church,\" a title card tells us. But Harold is able to find courage when he most needs it, thanks to his grandmother and her \"charm of Zuni\" token that aided Harold's grandfather in the American Civil War. \"Grandma's Boy\" was made while Lloyd was still working under Hal Roach Studios, and you can see the stamp of Roach in its many gags, especially those involving animals. In one sequence, Harold's grandma (Anna Townsend) cleans up some boots for Harold to wear at a party, using goose grease. At the party, Harold finds his feet under constant licking assault by a quartet of kittens. Harold's suit was taken out of mothballs for the occasion, but the mothballs weren't taken out of the suit. These gags are inventive, often hilarious (watch Harold and his nemesis played by Charles Stevenson try to stare each other down after both mistaking the mothballs for candies), but it's the sentiment at the heart of the film, the part Lloyd pushed for over Roach's somewhat valid objections, which stick. The gags make you laugh, but the story made Lloyd's career. Lloyd's story approach is fresh and exciting, employing a pair of present-day challenges (Stevenson's bully and an even more nasty tramp who kills a jewelry-shop owner) as well as a flashback sequence where Harold's grandfather, using the same \"charm of Zuni\" later given to Harold, infiltrates and captures a Union headquarters. This last bit, running just six minutes, is a triumph of grand farce, with The grandfather knocking out soldiers and generals one by one through various improbable means. Lloyd plays the grandfather, too, with mutton-chop whiskers and square-rimmed glasses. Everything happens so quickly it becomes part of the joke, too perfect to be believed as we see it played out, with Harold's fellow Confederates sweeping in the second Harold knocks out the last foe. \"You're no soldier � you're a regiment!\" the Rebel commander proclaims. There are some minor defects. The killing of the jewelry-shop owner doesn't belong in a light comedy, and the party scene does run long, as do some moments featuring a crying Harold. But even Mildred Davis, an actress I find tediously thin in other Lloyd pictures, gives a good account of herself here, and the camera work throughout is amazingly sure-footed. I liked especially a scene where we watch Harold in a car chasing down the tramp from a shot behind Harold's shoulder. Director Fred C. Newmeyer, who this same year took a failed stab at making Roach's first \"Our Gang\" comedy, shows himself a better hand for launching Lloyd's feature-film career, keeping a furious pace that pauses for emotional moments at just the right intervals. \"Grandma's Boy\" shows you didn't need to be Chaplin to make a successful, ambitious comedy, as long as you had someone who knew how to connect with the audience while taking his pratfalls. In the 90-plus years since it was made, few have done so better than Lloyd does here."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Hal Roach Studios"],
      "summaries": [
         "Always the mama's boy, or in this case a grandma's boy, Sonny joins a posse after a tramp accused of robbery and murder. He is unable to conquer his cowardice until Grandma tells him of his grandfather, also a coward, who overcame his fears with the help of a magic amulet. With new courage (and the charm), Sonny captures the fugitive and becomes the hero of the day.",
         "Bespectacled Harold, who was basically born with his trademark horn rimmed glasses on his face, is a meek, cowardly man who has never thrown a punch in retaliation in his life, despite having ample cause to do so. He lives with his Granny, who looks after him more than he is her protector. He is in love with Mildred, whose affections he has to battle for with a bully, who will do anything to show up Harold in front of Mildred. Some actions by Granny to help Harold unwittingly don't help his cause. When the Sheriff deputizes a bunch of young men in an effort to apprehend a gun-toting murderous tramp on the loose, Harold, based on a story by Granny about how his Grandpa became a hero and due to a special idol she gives him, may truly become the man he wants to get Mildred's hand once and for all.",
         "Harold plays a backward, awkward, shy boy who is afraid of everything, including his own shadow. After a bully runs him off from the girl that he loves his Grandma tells him about a magic charm his Grandfather used to gain courage. After Harold begins carrying the charm he singlehandedly captures a killer and teaches the bully a lesson.",
         "A meek young man must find the courage within when a rogue tramp menaces his home town."
      ],
      "budget": 100000
   },
   "movielensId": 110048,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1922-09-03",
      "dvdReleaseDate": null,
      "directors": ["Fred C. Newmeyer"],
      "runtime": 60,
      "movieId": 110048,
      "title": "Grandma's Boy",
      "mpaa": "",
      "actors": [
         "Harold Lloyd",
         "Mildred Davis",
         "Anna Townsend",
         "Charles Stevenson",
         "Dick Sutherland",
         "Noah Young"
      ],
      "imdbMovieId": "0013201",
      "originalTitle": "Grandma's Boy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Always the mama's boy, or in this case a grandma's boy, Sonny joins a posse after a tramp accused of robbery and murder. He is unable to conquer his cowardice until Grandma tells him of his grandfather, also a coward, who overcame his fears with the help of a magic amulet. With new courage (and the charm), Sonny captures the fugitive and becomes the hero of the day. [Written by Herman Seifer]",
      "tmdbMovieId": 22592,
      "avgRating": 3.2,
      "releaseYear": "1922",
      "numRatings": 10,
      "posterPath": "/5pwLDukrLNU3h7yjGYB23iZCDez.jpg"
   }
}