{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "architect",
            "id": 2301
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "florence",
            "id": 8032
         },
         {
            "name": "fear",
            "id": 13073
         },
         {
            "name": "older man younger woman relationship",
            "id": 14669
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "unhappy",
            "id": 207441
         }
      ],
      "imdb_id": "tt0077373",
      "video": false,
      "title": "Stay as You Are",
      "recommendations": [],
      "backdrop_path": "/73an1zVauvu9qcfMvBatWQpNaxn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Giulio Marengo",
               "gender": 2,
               "credit_id": "52fe44699251416c9100fc8d",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Francesca",
               "gender": 1,
               "credit_id": "52fe44699251416c9100fc91",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Luisa Marengo",
               "gender": 1,
               "credit_id": "52fe44699251416c9100fc95",
               "name": "Mónica Randall",
               "profile_path": "/ArHblJ5GLNsMFS0dSM6GaYYVV2h.jpg",
               "id": 107781,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cecilia",
               "gender": 0,
               "credit_id": "52fe44699251416c9100fc99",
               "name": "Ania Pieroni",
               "profile_path": "/pf0b0ri181Nf1bNQV3ABK2yprtr.jpg",
               "id": 102012,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Lorenzo",
               "gender": 0,
               "credit_id": "543022040e0a26464c000a7a",
               "name": "Francisco Rabal",
               "profile_path": "/egKYgMjy749Fis3XZ4qrm8l9ltD.jpg",
               "id": 9768,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Ilaria Marengo",
               "gender": 0,
               "credit_id": "5430221c0e0a264643000a80",
               "name": "Barbara De Rossi",
               "profile_path": "/5pZtRwN1wm5Y1NpQqT3kwSqNRLh.jpg",
               "id": 100055,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44699251416c9100fc9f",
               "name": "Alberto Lattuada",
               "profile_path": "/dR6AK20kw2VSRkOrLOnGuYzp5el.jpg",
               "id": 146793,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5ab7631f925141395b017710",
               "name": "Alberto Lattuada",
               "profile_path": "/dR6AK20kw2VSRkOrLOnGuYzp5el.jpg",
               "id": 146793,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5ab7632f9251413955017916",
               "name": "Enrico Oldoini",
               "profile_path": null,
               "id": 120189,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5ab76335c3a3680a3e0188bb",
               "name": "Enrico Oldoini",
               "profile_path": null,
               "id": 120189,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5ab76344c3a3680a3e0188c7",
               "name": "Paolo Cavara",
               "profile_path": null,
               "id": 100336,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5ab763509251413967016bab",
               "name": "Sergio Montanari",
               "profile_path": null,
               "id": 32310,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ab7635b9251413955017932",
               "name": "José Luis Alcaine",
               "profile_path": null,
               "id": 4376,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ab7644b0e0a261fdf01a8c7",
               "name": "Giovanni Bertolucci",
               "profile_path": null,
               "id": 55759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5ab76457925141395e0177cd",
               "name": "Luigi Scaccianoce",
               "profile_path": null,
               "id": 95237,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5ab764630e0a261fdf01a8e9",
               "name": "Ennio Morricone",
               "profile_path": "/tlntfyflyEHgJTFjqIgg8P8UIx9.jpg",
               "id": 1259,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5ab764709251413964016ce0",
               "name": "Bona Nasalli-Rocca",
               "profile_path": null,
               "id": 1694147,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5ab764840e0a261fee018ced",
               "name": "Mario Tursi",
               "profile_path": null,
               "id": 1534645,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "5ab764909251413964016cf8",
               "name": "Daniela Puccini",
               "profile_path": null,
               "id": 1761815,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.489726,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 31214,
      "vote_count": 9,
      "budget": 0,
      "overview": "A May-December romance. Roué Giulio Marengo, a Roman landscape architect unhappy in his marriage, meets Francesca, a young and beautiful Florentine, and then learns she might be his daughter. He resolves to keep his hands off but can't seem to stay away, and she's eager for a lover who's a father figure.",
      "similar": [
         28468,
         12102,
         37265,
         36630,
         843,
         27066,
         283227,
         4507,
         69,
         244772,
         664,
         263472,
         18190,
         1259,
         19265,
         5767,
         9716,
         1586,
         258,
         24016
      ],
      "original_title": "Così come sei",
      "runtime": 109,
      "poster_path": "/ceC7R6l5ncOp0A8kEhNzqwofF20.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "P.C. Ales",
            "id": 5127,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "San Francisco Film",
            "id": 5128,
            "origin_country": ""
         }
      ],
      "release_date": "1978-09-14",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alberto Lattuada"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Paolo Cavara",
         "Enrico Oldoini"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0077373/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1ODIzNzQ5OF5BMl5BanBnXkFtZTgwNzc4NDE3NDE@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Marcello Mastroianni, Nastassja Kinski, Francisco Rabal | See full cast and crew »"],
      "reviews": [
         "\"Stay as You Are\" was Nastassja Kinski's fifth film following the 1975 Wim Wenders, \"The Wrong Move,\" a so-so 1976 \"To the Devil...a Daughter,\" and the two forgettable's: 1977 \"Only For Your Love\" and the 1978 \"Boarding School.\" It is an Italian film of the time with its own mores with respect to extra marital affairs - a repeated undercurrent in many Italian films. \"Stay as You Are\" follows an older man who is contemplating an affair with a young girl, Nastassja Kinski, who is the same age as his own daughter but with the complication that Nastassja may actually be his real daughter from an affair of twenty years ago. A good European director can finesse this sort of situation. Most American directors would be over their heads and would be fortunate if they could tread water because the subject would be taboo in the American market. The actor is the legendary Marcello Mastroianni who at the time would have been 54. In viewing her early films, it is hard to not conclude that Nastassja has a birth year of 1959 and not the claimed 1961 because of her physical development. Perhaps she was just precocious. That would have placed her at nineteen for this film. The next year would give us Roman Polanski's \"Tess\" and \"Stay as You Are\" was a good prelude because it showed that, even at her young age, Nastassja had the screen presence to carry movies on her own opposite one of the European super stars of the time. The VHS tape that I saw was dubbed into English with neither voices matching either Nastassja's or Mastroianni's actual voices. For me, it is better to watch a movie in its native language with English subtitles, unless the principal actors do their own dubbing. An awful example of English dubbing is the French movie \"La Femme Nikita.\" The voice is an integral part of an actor's screen presence, unless playing a mute like Nastassja did in \"The Wrong Move.\" Some actors always sound the same, movie after movie. Nastassja Kinski is able to change her voice, according to the the needs of her role. She is one of very few actresses who is fluent in multiple languages. In \"To the Devil...a Daughter\" it is English, \"The Blonde\" it is Italian, \"Moon in the Gutter\" it is French, \"Terminal Velocity\" there is a little Russian. The bulk of her movies are in English. \"Faraway, So Close\" there is both German and English. \"Paris, Texas\" has Nastassja in a convincing Texan accent in which one would be hard pressed to know from the voice that it is she. Marcello Mastroianni always seems to bring a signature vulnerability whose intensity varies with the role. These characters are usually thoughtful and contemplative with an edge of awkwardness. Another way of putting it, is that these roles usually have depth. In \"Stay as You Are\" Mastroianni is almost entirely reactive to Nastassja's character. At first, he pursues her, then she pursues him because she likes older man. Then it is back and forth. Nastassja has to carry the movie. Sometimes she is flighty and silly. Other times she is serious. Her physical beauty is easily matched by her acting talent. Her movements are fluid, sometimes discontinuous, and her face ever changing as appropriate to the situation. Nastassja Kinski is a great natural actress who makes everything look easy. Her performances are always intelligent with a screen savviness that can be mesmerizing. \"Stay as You Are\" is a tender romantic jewel that is difficult to find on VHS tape and expensive, if found. Along with \"The Wrong Move,\" it would benefit from a first class transfer onto DVD with commentaries from Wim Wenders and Nastassja Kinski. I would have to include both \"The Wrong Move\" and \"Stay as You Are\" in any list of her core set of movies. There is a region 2 DVD widescreen version that is playable on a computer DVD, but it is in Italian with no English subtitles. With its not unexpected symmetry, \"Stay as You Are\" and Nastassja Kinski is cinema magic.",
         "I was pleasantly surprised by this film because I had seen the low scores it had received from imdb. In fact, this was one of the more impressive love story films I have seen in a long time. The plot is essentially about a middle-aged man who gets tangled up with a 20-year old girl and finds that both of them have a hard time resisting the other. Soon after meeting, however, he discovers that he may actually be the girl's father! He struggles endlessly with this dilemma, but the temptation of romance and sex with a vibrant young woman is irresistable. It's a story that takes an interesting look at one of the most prevalent taboos in virtually all modern societies: incest. But it does so intelligently and unpredictably. The man is a protagonist: he struggles and suffers over the morality of his actions, but he is also human and in need of passion in his life (which he no longer gets from his wife). The girl might seem to be the victim, but she is not, at least not on the surface. She is excited by mature, wise men, and it's of little importance that he is old enough to be her father. As the romance intensifies, it's ridiculousness is magnified, but again it is done in very intelligent and subtle (and therefore realistic) ways. The mature and steady protagonist suddenly appears to be somewhat foolish. What will they ever talk about? What do they really have in common once they get out of their hotel bed? Yet he is too weak and desparate and lonely to do anything else. The immature girl is the one who begins to realize that the relationship has already peaked. In the end, the film is an excellently told tale about the mid-life crisis so many middle-aged men face. The incest part of the story, which may disgust the more puritanical types, is only an additional wrinkle to a very interesting and complex (but not uncommon) situation. A young Nastassja Kinski is convincing as the flighty but romantic 20-year old, and Marcello Mastroianni turns in another one of his great performances, solidifying my belief that he is one of the four or five greatest actors of all time.",
         "A middle-age man (Marcello Mastroanni) trapped in a loveless marriage with a cold, shrewish wife and pregnant teenage daughter meets a young university student (Natassia Kinski)who reminds him of a lover he had twenty years earlier. Turns out there's a good reason for this--she is the daughter of his now dead lover. The problem is, since her paternity is very uncertain, she might be his own daughter as well! Thus you have the hilarious spectacle of Mastroanni trying to unsuccessfully resist a very ripe and beautiful Kinski. This is the kind of movie that would have been crass and tasteless if made in America, but being set in Europe is merely quaint and corny (mostly due to the English dubbing). It resembles other European films like \"Appassionata\" and \"Beau Pere\", but might be a little more palatable since the man is at best only biologically the girl's father and the girl (and more importantly the actress playing her) is at least not an underage Lolita. It also resembles a lighter-toned \"Last Tango in Paris\" in that it has a lot of strange sex scenes, some of which might be pretty erotic (Mastroanni biting Kinski's beauteous bare rump) while others are pretty silly (Kinski serving Mastroanni a cup of her \"pee-pee\"). Most people then and now will probably see this film for Kinski's copious nude scenes. Keep in mind though they are not very well-paced--she spends the first half of the movie dressed and the second half almost perpetually naked. To tide you over though you also have the beautiful Ana Peironi (the \"Mother of Tears\" in Dario Argento's \"Inferno\", who really does make one want to cry) playing Kinski's promiscuous roommate. She has one of the funniest scenes where she strips off all her clothes in front of Mastroanni seconds after meeting him, all the while casually telling him how she doesn't like to sleep at the train station because of all \"the horny men\". (Well, no wonder!). Not for all tastes perhaps, but definitely recommended to fans of \"Eurotica\".",
         "\"Stay As You Are\" deals with a man who is attracted to a young girl, who finds out that she is the daughter of a prior lover (now dead), and that he might be her father (we never find out either way). When Francesca finds out she might be her daughter, it doesn't phase her. The man who has raised her, she looks in a father-daughter way. Giulio, she looks as a lover. The fact that he might be her father has no bearing on her. Likewise, although Giulio has sex with Francesca, knowing that she might be his daughter, around the the girl he has raised, he respects the incest taboo. In no way is he sexually interested in his own daughter. Francesca just walks into his life, then he learns that he might be her father. \"Time\" magazine said all love stories have something keeping the lovers apart. Parents, class, money, etc. In this case, I don't think it was the incest taboo. Just that Francesca cannot see herself living with Giulio. I think he she had seen them as living together forever, she would have worked on it, taboo or no taboo.",
         "I watched that movie in Italian and I hardly could ask for the way in that language. So I more or less had to guess the plot albeit it was not too much of an effort given the complexity of it ;) 17 years old female (Nastassja Kinski) falls in love with a 50 years old who could be her father. Eventually he turns out to indeed be her father. To me the all time most graceful and beautiful (insert all other thinkable positive attributes appropriate for describing a goddess here) picture of a female appearance was in that scene when he was watering some plants in his house and then she came in smilingly saying Ciao.",
         "Nicely executed soap opera of middle-aged architect Marcello Mastroianni loving the criminally gorgeous seventeen-year-old Nastassja Kinski before ultimately breaking up. Of course, nothing in life is simple. Years ago, Mastroianni had an affair with Kinski's mother and the possibility exists that she is his real daughter. Oh, to hold thee lightly on a gentle knee and print on thy soft cheek a parent's kiss! But Incest be damned. Instead, he spends one night making savage love to her before they both realize this May-December business renders it all pointless. The direction is functional. Alberto Lattuada has one artistic shot of two bright orange rowing shells emerging from under a dull stone bridge and forming striking geometric patterns, but then he goes and ruins it with clichés. Mastroianni is wandering with a camera around one of Florence's tourist spots. The movie camera pans around until it fixes on some feature of the landscape -- some swans, a statue in a ruined state -- then we hear a camera shutter click and the picture freezes. This happens half a dozen repetitive times for reasons known only to the director, or maybe nobody at all. At a horse race, the animals pound along in slow motion. Ho hum. The musical score is mostly electronic, or tinny violins, and is more irritating than constructive. The best part of the film comes from the two principals. Of Kinski it must be said that her features and figure are almost too flawless. There isn't a single angle that doesn't flatter her and make her look desirable in the most sensual way. The curious thing is that -- well, there is a photo of her in the arms of her compellingly ugly father, Klaus, in which she can't be more than a few years old. She stares at the camera with a dark gaze that's already arresting. Now she's middle aged and STILL looks like the perfectly featured middle-aged woman! Dancing around the flat in the nude, she makes Mastroianni bite her plump rear cheek. Okay. One or two nude scenes resembling soft-core porn. But she is, after all, just a wanton kid at heart. She plays disgusting tricks on Mastroianni and nags him to take her to night clubs when all the poor guy wants to do is sleep. Mastroianni is fiftyish and his age shows. He's no longer the lost young journalist of \"La Dolce Vita\" but he's still handsome. I can forgive him his handsomeness because he's so superior at projecting emotions that we ordinary men can identify with -- doubt, pathos, guilt. The merest of Mastroianni's resigned shrugs gets the job done. Cary Grant was handsome too, but he won me over with his ability to show bemusement and mock indignation. Unfortunately, the film is dubbed, and not well. Mastroianni is given the mellifluous baritone of a radio actor or the guy who does voiceovers in TV commercials. Kinski has the breathless piping voice of an adolescent and it sounds like whoever did her dubbing had a difficult time with it because the effort shows. Better if Kinski had dubbed herself. Hers has a distinctive deep nasal quality that we've all learned to associate with her appearance on screen.",
         "I saw this movie a few years ago and have forgotten most of it. However, there was a scene that stuck out and has haunted me ever since. The scene where the girl pees in a cup and makes tricks the man into drinking it. She thinks this is really funny and makes him bite her butt. Yeah, that is one of the oddest sex scenes I have ever seen and it's the only thing I remember about this movie."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "San Francisco Film",
         "Producciones Cinematográficas Ales S.A."
      ],
      "summaries": ["A May-December romance. Roué Giulio Marengo, a Roman landscape architect unhappy in his marriage, meets Francesca, a young and beautiful Florentine, and then learns she might be his daughter. He resolves to keep his hands off but can't seem to stay away, and she's eager for a lover who's a father figure. He's happy to be a kid, so he tries to find out who her father is; his wife knows something is up; his daughter, who's Francesca's age and is pregnant, encourages the affair. Should he tell Francesca his fears that it might be incest? If he tells her and she doesn't care, what next? And what of his wife, who still wants to be married? Francesca takes control."],
      "budget": 0
   },
   "movielensId": 110052,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1978-09-14",
      "dvdReleaseDate": null,
      "directors": ["Alberto Lattuada"],
      "runtime": 109,
      "movieId": 110052,
      "title": "Stay as You Are",
      "mpaa": "R",
      "actors": [
         "Marcello Mastroianni",
         "Nastassja Kinski",
         "Mónica Randall",
         "Ania Pieroni",
         "Francisco Rabal",
         "Barbara De Rossi"
      ],
      "imdbMovieId": "0077373",
      "originalTitle": "Così come sei",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A May-December romance. Roué Giulio Marengo, a Roman landscape architect unhappy in his marriage, meets Francesca, a young and beautiful Florentine, and then learns she might be his daughter. He resolves to keep his hands off but can't seem to stay away, and she's eager for a lover who's a father figure.",
      "tmdbMovieId": 31214,
      "avgRating": 3.2,
      "releaseYear": "1978",
      "numRatings": 5,
      "posterPath": "/ceC7R6l5ncOp0A8kEhNzqwofF20.jpg"
   }
}