{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "asteroid",
            "id": 1423
         },
         {
            "name": "slime",
            "id": 3092
         },
         {
            "name": "space",
            "id": 9882
         }
      ],
      "imdb_id": "tt0064393",
      "video": false,
      "title": "The Green Slime",
      "recommendations": [
         52203,
         84230,
         2097,
         26854,
         113566,
         31024,
         36338,
         85236,
         172908,
         53949,
         64976,
         3144,
         16321,
         55080,
         42712,
         90360,
         122677,
         60781,
         215332,
         43248
      ],
      "backdrop_path": "/6wPEe3mui3PSBd2zY3wkrmYTaV4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Commander Jack Rankin",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e07187f",
               "name": "Robert Horton",
               "profile_path": "/1HQqaszKILzBBVIgHGZIipv1nnT.jpg",
               "id": 103492,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Dr. Lisa Benson",
               "gender": 1,
               "credit_id": "52fe45d5c3a368484e071883",
               "name": "Luciana Paluzzi",
               "profile_path": "/wm2kQjIeg0wAfE4SYA9LqUu3fwA.jpg",
               "id": 9921,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Commander Vince Elliott",
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e071887",
               "name": "Richard Jaeckel",
               "profile_path": "/pTTfCxMxjBvxkcemCBwNqEiHXce.jpg",
               "id": 58423,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "General Jonathan B. Thompson",
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e07188b",
               "name": "Bud Widom",
               "profile_path": null,
               "id": 103494,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Dr. Hans Halvorsen",
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e07189b",
               "name": "Ted Gunther",
               "profile_path": null,
               "id": 141086,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Lt. Curtis",
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e07189f",
               "name": "David Yorston",
               "profile_path": null,
               "id": 141087,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Capt. Martin",
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e0718a3",
               "name": "Robert Dunham",
               "profile_path": null,
               "id": 141088,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Cordier",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718a7",
               "name": "Gary Randolf",
               "profile_path": null,
               "id": 141089,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Lt. Morris, Rocket Pilot",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718ab",
               "name": "Jack Morrisey",
               "profile_path": null,
               "id": 21814,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Technician",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718b3",
               "name": "Eugene Vince",
               "profile_path": null,
               "id": 141091,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Technician",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718b7",
               "name": "Don Plante",
               "profile_path": null,
               "id": 141092,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718bb",
               "name": "Linda Hardisty",
               "profile_path": null,
               "id": 141093,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Michaels",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718bf",
               "name": "Richard Hylland",
               "profile_path": null,
               "id": 141094,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718c3",
               "name": "Kathy Horan",
               "profile_path": null,
               "id": 141095,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e0718c7",
               "name": "Ann Ault",
               "profile_path": null,
               "id": 141096,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e071857",
               "name": "Kinji Fukasaku",
               "profile_path": "/2gQZxy5oZ0UJJDFjaKBGuOMLwfu.jpg",
               "id": 31074,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e07185d",
               "name": "Kinji Fukasaku",
               "profile_path": "/2gQZxy5oZ0UJJDFjaKBGuOMLwfu.jpg",
               "id": 31074,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e071863",
               "name": "Tom Rowe",
               "profile_path": null,
               "id": 63669,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e071869",
               "name": "Charles Sinclair",
               "profile_path": null,
               "id": 103486,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d5c3a368484e07186f",
               "name": "Walter Manley",
               "profile_path": null,
               "id": 103487,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e071891",
               "name": "Ivan Reiner",
               "profile_path": null,
               "id": 101124,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45d5c3a368484e071897",
               "name": "Ivan Reiner",
               "profile_path": null,
               "id": 101124,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5717c8809251412b37001708",
               "name": "Charles Fox",
               "profile_path": null,
               "id": 50239,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5717c898c3a3686d30001c53",
               "name": "Toshiaki Tsushima",
               "profile_path": null,
               "id": 103489,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57f3f67d9251417fd7000bc3",
               "name": "Katsuhiko Taguchi",
               "profile_path": null,
               "id": 1323492,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 2.980119,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 29290,
      "vote_count": 23,
      "budget": 0,
      "overview": "A giant asteroid is heading toward Earth so some astronauts disembark from a nearby space station to blow it up. The mission is successful, and they return to the station unknowingly bringing back a gooey green substance that mutates into one-eyed tentacled monsters that feed off electricity. Soon the station is crawling with them, and people are being zapped left and right!",
      "similar": [
         157336,
         274870,
         95,
         286217,
         395992,
         2103,
         1891,
         568,
         563,
         62,
         698,
         348,
         126889,
         330459,
         49047,
         2900,
         15493,
         2067,
         19995,
         1892
      ],
      "original_title": "The Green Slime",
      "runtime": 90,
      "poster_path": "/rZa1XF1yQYhhA4CXLTs6Lc07t1I.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ram Films Inc.",
            "id": 6175,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Southern Cross Feature Film Company",
            "id": 6176,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1968-12-19",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "The Green Slime are coming!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kinji Fukasaku"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Bill Finger",
         "Ivan Reiner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064393/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMDc0NjEwNl5BMl5BanBnXkFtZTcwODEwNjEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Horton, Luciana Paluzzi, Richard Jaeckel | See full cast and crew »"],
      "reviews": [
         "I agree that this movie is now entertaining on a bad movie level, but those who say it had to be made as a joke are dead wrong. This came out in a time before America (and particularly American kids) became so f--king \"sophisticated\". I saw this as a 10 year-old on the big screen when it was released; all us kids were thrilled by the adventure and did NOT laugh. It's a shame that kids today are denied the chance to experience this kind of innocent, totally unsophisticated fun in a theater. You can be smug about how \"cheesy\" these kinds of movies were, and how much more \"sophisticated\" we all are now, but on the flip side we didn't have things like school massacres back then, did we?",
         "Fun, fast-moving, funky sci-fi action for \"Thunderbirds\" fans. US B-Grade stars meet slimy Japanese-style men-in-monster-suit Aliens with reproductive blood who, having infiltrated a space-station and captured the interest of a new-lifeform-discovering scientist proceed to electrocute half the crew. Funky colour schemes, futuristic 1960s-style discotheques, kooky camera angles and a crazy Blaxploitation-style theme song combine to create a groovy film, man. Better acting than \"Space: 1999\".",
         "You have to love a sci-fi movie that: 1) Is a Japanese-produced product featuring a mostly-Anglo cast (saves on dubbing cost). 2) Has equivalent special effects of any given \"Godzilla\" movie. 3) Has Italian bombshells named \"Sheila Benson\". 4) Gives you slime creatures that look like Sigmund the Sea Monster. 5) Has a mad doctor (isn't that a pre-requisite for these movies? Thought so.). 6) Has one of the all-time coolest title songs I have ever heard in my entire natural life. If you watch \"The Green Slime\", just think: if Jaeckel had brought the rest of his \"Dirty Dozen\" cronies along with him, the Green Slime would never have stood a chance. Oh well.... Seven stars. By the way, does anyone know where to get this movie's soundtrack? I have GOT to get that song....",
         "There isn't a single Japanese actor in this big-budget Japanese produced sci-fi drama, but the special effects are a dead give-away. A wandering astroid (code named `Flora') is on a collision course with Earth. Richard Jackel and Robert Horton lead a team which places atomic bombs on the astroid to blow it up. They succeed, but they unwittingly bring back an alien fungus to their wheel-shaped space station. The fungus grows into man-sized monsters which multiply rapidly and overrun the space station. Jackel and Horton are forced to set aside their romantic rivalry over Luciana Paluzzi (`Thunderball') while they battle the creatures. Blazing laser guns abound in a desperate battle with the unstoppable monsters! The astronauts even don spacesuits and jet-packs for a battle on the space station's hull. All this in glorious color AND wide screen. Wow! Sure, this sounds great but . . . well, these guys didn't know what they were doing. Or did they? `The Green Slime' looks more like a clever satire of sci-fi movies than an ineptly made film. The odds against all the side-splitting humor in this movie happening by accident must be astronomical. The potato-shaped monster suits are hysterical. The miniatures of the rockets are so tiny the camera can barely focus on them. The dialogue sounds like perfect parodies of sci-fi's most treasured clichés. (Example: The doctor rushes up to soldiers as their about to attack a slim monster. `Stop, don't kill it!' he pleads. `This is a magnificent discovery, and we must do everything possible to SAVE it!' -- and he says it in a perfect imitation of Richard Nixon.) When the heroes' rocket tries to outrun an atomic blast, Robert Horton orders the pilot to increase thrust. But the G-forces are already so strong, the pilot can't lift his hand to reach the throttle. Macho Robert jumps up, walks to the pilot's chair, and pushes the throttle himself! `The Green Slime' is so full of scenes like this that it should be re-released as `National Lampoon's Space Adventure'. And just wait until you hear the Jimmy Hendrix sound-alike title theme, a psychedelic rock tune. Its was even released on 45 rpm! (That's kinda like a CD, for those of you too young to remember.) Rent the movie, call your friends, and mix up a batch of lime Jello as a snack. This is MST3K squared.",
         "I have a special attachment to this film: I was stationed in the Air Force in Japan in 1968 when this was filmed. Most of the cast (with the exception of course of the \"name\" actors) were U.S. Military personnel or dependents. Bud Widom was an announcer on Armed Forces Radio in Tokyo, and Ann Ault (nurse) directed our theater group (The Kanto Players). She directed me as Dr. Bradley in \"The Man Who Came to Dinner\". Ann also had a a great voice and appeared as a headliner at the Tokyo Hilton. For the earlier comment, Green Slime HAS been shown on MS3TK. It was, I think, made for it, even though MS3TK was just a dream at the time.",
         "You have GOT to see this movie to believe it. The music is better (or cheesier) than Austin Powers (Whammy bar electric guitars twang along while a pretentious singer who sounds like Elvis on Ludes wails \"Green SLIME! Green Slime!\") Richard Jaeckal (of The Dirty Dozen fame) is unintentionally hilarious as the space station Rambo. He grits his teeth every time the camera is on him (no exaggeration!) But the stars of this movie have to be the one-piece, rubber suited, one-eyed monsters with the electric touch. I saw this when I was 15, and I still remember laughing at them, and at the space station hanging on its wires, burning in space (The flames and smoke RISE UP...in space, get it?) All in all, a spectacularly bad movie...so bad its great.",
         "i just got this film on VHS through an auction and greatly enjoyed it! it's nowhere near as bad as it's reputation. it IS technically limited and even unintentionally funny in parts, but a lot of the story was very much ahead of it's time and inspired. it's like a typical 1950s space monster b-movie on steroids. after watching it, i couldn't believe just how much of this film's story mirrors that in alien. the film DOES use \"godzilla grade\" models and space ships, but it also has some REALLY nice sets that embarrass those in many more well known films with typical surplus radio parts and a few blinking lights. as much as i always hated those fake looking models in godzilla films, here they're forgivable because at least this story makes sense. for what this film lacks in production values and sheer suspension of disbelief, it more than makes up for with conviction and originality. the ending has to be seen to be believed, it is EXTREMELY action packed. this is my new #2 \"old school sci fi\" favorite only after forbidden planet. it's THAT GOOD! don't believe this film's low score. it's funny and campy at times true, but it's also clever, sincere and action packed too. you've NEVER seen a pre 1970 sci-fi film that goes where this one does. it humbles many a predecessor with it's scope and originality. i had a blast watching this one and by the end, had given it the respect it deserves for it's ambition and OBVIOUS inspiration on Alien. this film really tries hard to be a blockbuster and totally surprised me by how close it came to pulling it off. hopefully, more people well schooled in just how bad typical 1950s American sci-fi films were, using little more than stock footage for SFX at times, will see this film and give it the respect it deserves for creating EVERYTHING in it from scratch and using new ideas of it's own. i think there are a lot of 7+ votes out there that just haven't had the chance to see this film. i give it a 9 for effort and entertainment value.",
         "Oh, man....I finished watching this movie a couple of hours ago and I'm still laughing hysterically when I think about it. This movie is so bad that it becomes an undeniable must for everyone who's into bad cinema. The worst possible cinema actually, this is stuff like Edward D. Wood made it. Of course, I still respect the efforts that cast and crew put into this but you can't help but roll over the floor and laugh. This is Japanese SciFi cult ( even though they used American actors, they STILL dubbed it...badly ) coming to you straight out of the era when cinema actually had evoluated a lot. But The Green Slime didn't join this trend. Prepare yourself for some amateurish cinema, yet made with a lot of love and passion for the genre. The story is about a blob of green mucus coming straight from outer space. It got here as an uninvited visitor when some heroes destroyed an asteroide. By the way...forget about Armageddon !! The Green Slime really shows you how to blow up an big block of rock. The mucus has the ability to build itself up to green one-eyed midgets with an elephant trunk and they make adorable noises. I assure you, one look at them and you're immediately sold...these little critters stole my heart. Naturally, they don't come with good intentions !! They go after everything that is human and they suck up energy...how ? Don't bother to ask yourself that question...The \"scriptwriters\" didn't bother neither. In between, all the inevitable clichés aren't forgotten. So, as you can see, the special effects and costumes are next to none but it sure doesn't stop there ! Don't forget the space-station and rockets on wires, the cardboard sets and the acting that is really Oscar worthy. *cough*cough* Finally, They're are the small but highly memorable and hilarious little aspects about it. For example, the theme song is terrific !! You'll feel the urge to buy the single of that asap since it's sooooo catchy. And a very honorable mention goes out to Robert Horton's haircut. Heck, I would give this movie a rating 10 out of 10 if only for his flawless head of hair. No matter how many helmets he puts on and off ... no matter how many dangerous stunts he has to perform, his hair remains perfectly combed all the time. Truly a haircut you can set your clock to !",
         "Robert Horton was on the downslide and poor Richard Jaeckel was stuck in one more film unworthy of his talents. Luciana Paluzzi....well, with neither talent nor anywhere to slide, I guess she belongs in this movie. It's bright, loud and brassy and everything in the space station screams of the 1960's, including the theme song which has to be the most unusual ever tacked on to a sci-fi film. The color process they used (is it Technicolor?) is so unreal that the whole thing reminds me of a comic book. Watch \"Danger,Diabolik\" and you'll get that same feeling. Bile greens and mucous yellows.....ugh. The story line is not much but the special effects, frankly, may be better than some of that period. This was made before fx came into their own, so be a little forgiving. The monsters are not very well conceived and they are soooo slow moving. Just watch this one for the fun of it and try to forget how embarrassed the actors must have been mouthing those lines, wearing those outfits and running around in cardboard sets while being pursued (very slowly) by a bunch of green Jello. What a hoot!!",
         "Some worthless trivia to bestow. This is the very first movie ever to be shown on Mystery Science Theater 3000. Boy when you watch it you can see why. This movie screams to be made fun of. I know other people have made list reviews. Well, here's another one. It's more or less general thoughts on the movie. -very wooden acting. Robert Horton and Richard Jackel seem to be having a contest going on about who's the stiffer actor. The guys in the monsters suits are more lively than these guys. -Oh the monsters. I like these guys. They look like something that was designed by eight year olds. Assuming that was the target audience. For rubber Japanese monsters I thought they were fairly cool. Of course I'm a sucker for goofy aliens. They move awfully slow to be scary though. -All the sets look like cardboard. Who knows, maybe they are. -All the models seem as if they were made out of clearance sale craft supplies. The wires they were on even look cheap. -the title song ROCKS! I've had it stuck in my head for the past few days. Imagine the looks I get in Wal-Mart buying milk singing \"The green sliiiiimmmmmme. The green slliiiimmmeeeee.\" I need to find a copy of that song. It's better than the whole movie. Funny, goofy B movie. Yet another I recommend for a 'bad movie night.'"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Lun Film",
         "Metro-Goldwyn-Mayer (MGM)",
         "Ram Films Inc."
      ],
      "summaries": ["A giant asteroid is heading toward Earth so some astronauts disembark from a nearby space station to blow it up. The mission is successful, and they return to the station unknowingly bringing back a gooey green substance that mutates into one-eyed tentacled monsters that feed off electricity. Soon the station is crawling with them, and people are being zapped left and right!"],
      "budget": 0
   },
   "movielensId": 110181,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1968-12-19",
      "dvdReleaseDate": "2010-12-17",
      "directors": [
         "Kinji Fukasaku",
         "Katsuhiko Taguchi"
      ],
      "runtime": 90,
      "movieId": 110181,
      "title": "The Green Slime",
      "mpaa": "G",
      "actors": [
         "Robert Horton",
         "Luciana Paluzzi",
         "Richard Jaeckel",
         "Bud Widom",
         "Ted Gunther",
         "David Yorston",
         "Robert Dunham",
         "Gary Randolf",
         "Jack Morrisey",
         "Eugene Vince",
         "Don Plante",
         "Linda Hardisty",
         "Richard Hylland",
         "Kathy Horan",
         "Ann Ault"
      ],
      "imdbMovieId": "0064393",
      "originalTitle": "The Green Slime",
      "genres": [
         "Science Fiction",
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "TuINXUOB3Kw",
         "cpTBv9Icx0w"
      ],
      "plotSummary": "A giant asteroid is heading toward Earth so some astronauts disembark from a nearby space station to blow it up. The mission is successful, and they return to the station unknowingly bringing back a gooey green substance that mutates into one-eyed tentacled monsters that feed off electricity. Soon the station is crawling with them, and people are being zapped left and right!",
      "tmdbMovieId": 29290,
      "avgRating": 2.29167,
      "releaseYear": "1968",
      "numRatings": 12,
      "posterPath": "/rZa1XF1yQYhhA4CXLTs6Lc07t1I.jpg"
   }
}