{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt1854568",
      "video": false,
      "title": "Our Paradise",
      "recommendations": [
         185016,
         132561,
         199310,
         345001,
         61980,
         261776,
         365126,
         77616,
         31978,
         179246,
         177656,
         330007,
         35054,
         230268,
         41425,
         287855,
         65831,
         373111,
         151693,
         44282
      ],
      "backdrop_path": "/hVQY1KDmYAgSMFPuKNmxDHa2z6N.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Vassili",
               "gender": 2,
               "credit_id": "52fe4a289251416c750dfa37",
               "name": "Stéphane Rideau",
               "profile_path": "/7Ac5MHZVXcGIFOKU70nWRcA4DYx.jpg",
               "id": 49859,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Angelo",
               "gender": 0,
               "credit_id": "52fe4a289251416c750dfa3b",
               "name": "Dimitri Durdaine",
               "profile_path": null,
               "id": 1027790,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe4a289251416c750dfa3f",
               "name": "Béatrice Dalle",
               "profile_path": "/vWWWIf2FBVhTwQ4wzumYuLIvXVy.jpg",
               "id": 4813,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Victor",
               "gender": 0,
               "credit_id": "52fe4a289251416c750dfa43",
               "name": "Didier Flamand",
               "profile_path": "/cPMcoI8tBJlVU9B1XiuV27AhvtN.jpg",
               "id": 35077,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "La mère d'Anna",
               "gender": 1,
               "credit_id": "52fe4a289251416c750dfa47",
               "name": "Raymonde Bronstein",
               "profile_path": "/g3KnfRX8oOs7HmQRcyi2E4opBN8.jpg",
               "id": 1027791,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a289251416c750dfa2d",
               "name": "Gaël Morel",
               "profile_path": "/zl4IaGnSDlgw2a9BYYvEe875sSt.jpg",
               "id": 49855,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a289251416c750dfa33",
               "name": "Paulo Branco",
               "profile_path": "/8kbzoASh1fsk47JOHxSfcZssAyD.jpg",
               "id": 5268,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a289251416c750dfa4d",
               "name": "Gaël Morel",
               "profile_path": "/zl4IaGnSDlgw2a9BYYvEe875sSt.jpg",
               "id": 49855,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.357955,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 99119,
      "vote_count": 13,
      "budget": 0,
      "overview": "Vassili is an aged prostitute with killer instincts. He finds an unconscious young man in the Forest of Boulogne and takes him home. Now lovers and accomplices, the two men become a couple in prostitution and steal from their clients. And yet, menaces of retaliation leave the couple with no choice but to escape from Paris. The runaway begins...",
      "similar": [],
      "original_title": "Notre Paradis",
      "runtime": 96,
      "poster_path": "/5xMv0kCXxhKNgNNyKBQe7Fj51g7.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Alfama Films",
         "id": 3061,
         "origin_country": ""
      }],
      "release_date": "2011-09-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Gaël Morel"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Gaël Morel"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1854568/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyMzI2MTU3OV5BMl5BanBnXkFtZTgwOTYyNTQyMTE@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Stéphane Rideau, Dimitri Durdaine, Béatrice Dalle | See full cast and crew »"],
      "reviews": [
         "I enjoyed this movie a lot more than I expected to based on other online reviews. There is a good bit of nudity, but not a lot more of Dimitri Durdaine than anybody else, and (in contrast to at least two others, including Stéphane Rideau) none of him that would qualify as \"full frontal\" - \"full side\" is more like it, and even those rarely show much except skin. Some other reviews give the impression that he almost never wears clothes and that the camera examines every square inch of his body, neither of which is true at all. What there IS more of in this movie than most is naked middle-aged and older men, which may bother some people but delights me. Except for Durdaine, all of the naked men in this movie have pot bellies, including Rideau (who's getting comfortably close to middle age himself), which is wonderfully refreshing in an age when only bronzed and hairless gym bodies under 30 ever appear in American gay movies (Can we say BOR-ing?). Now that nudity's out of the way... There's something I like a lot about Gaël Morel's movies, but I'm not sure what it is. There's something very natural or unpretentious about them, something familiar and almost comforting, regardless of the subject matter. I feel like I'm among friends when I watch his movies. They FEEL good in some mysterious way comparable movies by other directors don't. He has an eye and a style and a language that are quite distinctive but not easy to define; whatever it is, I like it. Don't let the crime element fool you: Our Paradise is above all else a love story. Vassili (Rideau), a rough, surly, aging hustler who is already in the habit of killing johns who offend him (and many do, since he's getting old and out of shape), finds a kid (Durdaine) beaten unconscious in a cruising park in Paris, takes him home and cares for him. Because the kid looks like an angel and has an angel tattoo in the lower right corner of his abdomen, and since he won't tell his name, Vassili tries \"Angel\" in various languages; the kid likes Angelo best, so that's who he is from then on. And from then on he is devoted to Vassili. Nothing that happens (and a lot does) shakes his devotion, and that devotion is the heart of this movie. Angelo is not stupid or a masochist; he doesn't relate to Vassili as slave to master, cub to bear, boy to daddy, or any of the other gay May-December stereotypes. He simply loves Vassili. When Vassili sees that Angelo really does love him and has no desire to find somebody his own age, he relaxes and begins to trust the relationship too. It's lovely. All of their interactions, including several beautiful sex scenes, reinforce the growing strength of their relationship. None of the sex is gratuitous (whatever that means) or forced. The backdrop for this sweet and tender romance, of course, are Vassili's increasingly rough tricks (since he's no longer young and hot, he has to do kinkier stuff to stay in business), which are depicted in pretty graphic detail, and his habit of killing johns who make wisecracks about his age. Angelo tries to get him to stop the killing, but it becomes obvious he won't, so rather than leave Vassili Angelo stays with him and occasionally helps. It's really not much different from Bonnie and Clyde, Butch Cassidy and the Sundance Kid, or any of countless other mainstream movies about criminal couples... EXCEPT: this is France, so even the murders are civilized, and (Thank God!) guns never play any part in the movie. (What a relief not once to hear the sound of a gun being fired!) There are no chases, no near escapes, no explosions, none of the noisy, overwrought melodrama that stuffs Hollywood crime movies like fat in a goose's liver. This is a quiet movie, a civilized movie, an intelligent movie. Every murder makes sense because we see them from Vassili's point of view. From the outside he may look like a psychopath, but we see the human being more than the crime; we see a man who is as gentle as a lamb with the (surprisingly many) people he loves and who wipes out the ones who make him unhappy. He's just doing what most of us would LIKE to do. Even toward the end, when his motives for killing expand, there remains something about everything he does that just feels RIGHT for that character. He does it because he has to. He does it because the ones he kills need to be killed. He has his own moral code, and within that code everything he does is perfectly consistent. I will emphasize again that Our Paradise is above all a love story, a sweet and surprising love story between a very young man and another nearly twice his age. This movie is about as unconventional as a movie can be - it follows no stereotypes of any genre, and yet it's somehow even more comfortable and familiar than stereotypes are; it's like a gift from an old friend. I don't know of anybody but Morel who can pull off a feat like this with what seems like no effort at all.",
         "This film is about a middle aged male prostitute befriending a young rival by chance. They become romantic and business partners, with unexpected results. \"Notre Paradis\" is am unexpectedly dark film. The film synopsis doesn't tell you what exactly happens in the plot, so i was surprised to see the recurrent dark incidents. Vassili is egging and getting less desirable in the superficial world. Angelo is young and handsome, but we know nothing about his past, which is likely a scarred one. They both need each other to survive. They look for their paradise, no matter what the cost is. The ending is a somewhat Hollywood ending, but i find it not as satisfying as it takes away the dark edge of the plot. It is still a thought provoking film. What price would we pay to live our dream?",
         "I had high hopes for this movie, especially when, surprisingly, early in the film we see Stéphane Rideau as a somewhat slovenly, out-of-shape hustler. His benign and enigmatic smile is perfect for this role. This is more complicated than a love story, and much more complicated, emotionally and psychologically, than a mere thriller. It's an ambitious story that doesn't quite make the grade. It's impossible to go much further without spoilers, and I do believe this is a movie that doesn't deserve spoilers. Other reviewers' citations about who is nude when and where and how and which sex acts are performed aren't fair either. This movie is better than that, or at least it aspires to be. The photography and editing is clinical and detached and very much at odds with a sentimental and somewhat hokey soundtrack. The music used in one violent scene was so overly-melodramatic I found myself wondering if it was a reference to some old movie. It might have been, but I really think it was just bad stock music, and it seemed like a misstep for such an accomplished director. There are other missteps as well, but the movie is eminently watchable, especially for gay men. It is not Gael Morel's best work by far, but if you like this and haven't seen his other movies, you will want to.",
         "OK, a gay-entered crime story involving aging prostitute and gorgeous young hustler is refreshingly different BUT you gotta hate this psychotic serial killer and his beautiful boyfriend despite efforts to make this tragedy a storybook love story. I wanted to see these guys get what was coming to them in the worst damn way, but the ending is both confusing and disappointing. Did the cute couple kill the young boy's mother or were those sounds of passion the boy heard? It seems no one lived happily ever after in PARADISE. The hustling, prostitution, and violence in this movie pretty much accurately reflects the real deal in the male sex trade all over the world. The acting is good but the story does not reveal what motivates the killer to kill without hesitation or guilt. Was he raped or abused as a child? The story lacks depth to help us understand what's going on with this lunatic. The editing is also jarring. When the action jumps to the French woman and her kid I wasn't sure if this was the same movie or some faulty videotaping. The abrupt ending makes the movie seem incomplete.",
         "I first saw this film at Inside Out in Toronto. It was amazingly sexy, if not often nasty. I enjoyed the frequent nudity by young, angelic Dimitri Durdaine throughout the film (to date, his only credit here on IMDb.) The story was shocking. I wasn't quite sure what motivated Vassili, the slightly older male prostitute killer to kill some of his clients, besides perhaps an unbelievably short temper after receiving mild insults from clients unhappy with his age. If there were other reasons motivating him to kill, the script never mentioned them. The film is polished and beautiful to watch. At its core, it seems to be a sexy exploration of intergenerational relationships between gay men and the violent consequences of exploitation. The affair between Vassili and Angelo is one such relationship - a 33 year old hustler and a 19 year old hustler. You combine that with the older male johns going after the young hustlers, not to mention the older former john of Vassili named Victor and his much younger/30-something live-in lover, and the intergenerational theme becomes obvious. Vassili's relationship with young Angelo (Durdaine) is the only tender and loving coupling on display. Vassili's violence is perhaps the symbolic end result of all this exploitation and fleeting lust. How else can an ageing hustler react to all this crap except to lash out with violence against those who no longer want him the way they used to? If you watch this simply as a lovely exploration of youthful beauty (and there is a lot of it on display) and the violent consequences of exploitation, you will enjoy it. Again, Durdaine is stunning in this, no more than 19 or 20, the perfect twink, and he spends most of the movie naked, including a strangely erotic scene in which a kind and older (yet again) gay male doctor shoves a camera tube up Durdaine's ass during a health examination in order to probe the young lad's inner rectum, ostensibly to search for damage from a possible rape. Instead, he finds his insides as 'smooth as silk' to look at. Not only do we get to probe every inch of Durdaine's exterior, we also get a peek inside him as well. Thankfully, Stephane Rideau, still cute as hell, also shows everything off, but far less than Durdaine. In truth, the movie spends as much time exploiting its subjects as it does lamenting that exploitation and the consequences of it (as evidenced through the metaphor of violence.) In that sense, the film doesn't judge the old for lusting after the young; in fact, it revels in it. All in all, this is one sexy, dirty little adventure with A-quality male nudity on display throughout, as well as a titillating story about the consequences of exploitation. 5 out of 10 for the story, but 10 out of 10 for the eye candy.",
         "A kind of soap or soap-and-splash opera, with well played moments (like at the beginning Jean-Christophe Bouvet flamboyantly enjoying his vinyl record). Maybe engaged by moments of soft porn, the movie doesn't step back to consider its characters, let alone have them think themselves about what they are doing. Since it involves murder, there's a problem. The title may want to suggest that the central characters are Rimbaud and Verlaine, but the artificial paradise here is a pill at bedtime. The younger, Angelo, is there to be dressed or undressed, and gives no indication he knows or doesn't care what his partner is up to. Stéphane Rideau (the elder Vassili), with a hint of gut, can't be an éphèbe anymore, but he seems to know his business as a prostitute and what roles he can now play, so it is very hard to know why he isn't able to deal with older clients. The child, young Vassili (a genetic conundrum the name), does have a better sense of the plights he is in than anyone else.",
         "Even in a relatively free country, approaching prostitution and hedonism within sexual minorities is a challenge, how to remain below porn and above hypocrisy. To a large extent, Notre paradis has managed it under depiction, but at the expense of smooth and well-grounded plot. The viewers get no explanations to several moments happened in the past, and the inclusion of Anna's family splits the script in two in an awkward manner, paving the way for trivial, yet expected ending. The performances, however, are memorable and vigorous, creating a kind of uneasiness and letting you ponder on and over \"indecent\" matters... One thing is clear: one must be an open-minded person to watch this film. The visual can be pretty, but the background and apprehensions never are.",
         "Still, is rare to find a good gay theme film with crime and thriller taste, well I think \"Our Paradise\" nailed it. Interesting romance, stabbing scene, sex, and emotion mixed well. The only lack was the ending. A little bit to illogical. There are dream come true but other doesn't. This film none of that. The part still bothering me that Vassili did every psychopathic symptoms for love or personal pleasure. Vassili (played by Stéphane Rideau) is an mature gay hustler with killing instinct, triggered if he get mad or insulted. But, look like everything change when found young hustler almost beaten to dead Angelo. He took care of him and eventually they felt in love. Another killed by Vassili intended to secure they're needed fulfill and paradise came true. The last killing was mostly intended the lust for money. My focus still on Vassili psychopathic behavior. I don't really know it was personal issue or love. But, love really expensive and can't be bought by money, but is worth it when they end up in jail? If it is, I don't see any paradise.",
         "Even if two hours of looking at Stéphane Rideau stark naked might be a pleasant prospect, this film has very little else to offer. The ageing prostitute Vassilli (Rideau) quickly and surprisingly meets the younger second half of this murderous couple (Durdaine/Angelo) in the cruising grounds of Bois de Boulogne, Paris. The film follows their sex encounters with clients that they kill afterwards for a few euros. After a few sex scenes (whose value added to the movie is a mystery), they decide to run from Paris. They kill another client, a few more sex scenes, and they're caught, and the film finishes. The whole film feels hasty, pointless, more of an erotic fantasy than a real story. It's a pity, from a director that actually made some very consistent films.",
         "This film is Hitchcock from beginning to end but with a French twist to give it an extra bit of fizz. The ending, however, was a misfire and since I am a writer myself I wrote an alternative ending which works for me and I think would work for the film. My ending is about love - the four men involved fall for each other and live happily ever after. The real ending is as Hollywood as Hollywood can get and for a French film that is a bit odd. Still, the more I think about the film the more I am really taken by how strong the characters are and how difficult their circumstances. Let's face it, we all see rough times, even dark times, and the two leads in this film are thrown into some pretty choppy seas."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Alfama Films",
         "Rhône-Alpes Cinéma",
         "Région Rhône-Alpes"
      ],
      "summaries": ["Vassili is an aged prostitute with killer instincts. He finds an unconscious young man in the Forest of Boulogne and takes him home. Now lovers and accomplices, the two men become a couple in prostitution and steal from their clients. And yet, menaces of retaliation leave the couple with no choice but to escape from Paris. The runaway begins..."],
      "budget": 600000
   },
   "movielensId": 110235,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2011-09-28",
      "dvdReleaseDate": null,
      "directors": ["Gaël Morel"],
      "runtime": 96,
      "movieId": 110235,
      "title": "Our Paradise",
      "mpaa": null,
      "actors": [
         "Stéphane Rideau",
         "Dimitri Durdaine",
         "Béatrice Dalle",
         "Didier Flamand",
         "Raymonde Bronstein"
      ],
      "imdbMovieId": "1854568",
      "originalTitle": "Notre Paradis",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["jkTfoXW5vH0"],
      "plotSummary": "Vassili is an aged prostitute with killer instincts. He finds an unconscious young man in the Forest of Boulogne and takes him home. Now lovers and accomplices, the two men become a couple in prostitution and steal from their clients. And yet, menaces of retaliation leave the couple with no choice but to escape from Paris. The runaway begins...",
      "tmdbMovieId": 99119,
      "avgRating": 3.25,
      "releaseYear": "2011",
      "numRatings": 8,
      "posterPath": "/5xMv0kCXxhKNgNNyKBQe7Fj51g7.jpg"
   }
}