{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "haunted house",
         "id": 3358
      }],
      "imdb_id": "tt0102007",
      "video": false,
      "title": "The Haunted",
      "recommendations": [
         31448,
         3288,
         117904,
         36983,
         21927,
         30345,
         20321,
         34734,
         114726,
         86215,
         38499
      ],
      "backdrop_path": "/kqYnbAuXrvqmgD1Kd5rVG2U7CkN.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "OzDrDj",
         "id": "55517088c3a3687f63007f89",
         "content": "OMG, I remember watching this movie around the time of it's release. I had nightmares for weeks after. Perhaps now showing its age a little, but overall a good story, and made all the more terrifying as it is based on a true story. \r\nIt is so hard to find a Truly good Horror movie and in my opinion, this doesn't dissapoint.",
         "url": "https://www.themoviedb.org/review/55517088c3a3687f63007f89"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Janet Smurl",
               "gender": 1,
               "credit_id": "52fe4793c3a36847f813d0cb",
               "name": "Sally Kirkland",
               "profile_path": "/bAjUA08z6k8FZ3bu5QWcMWWVdMQ.jpg",
               "id": 12134,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jack Smurl",
               "gender": 0,
               "credit_id": "52fe4793c3a36847f813d0cf",
               "name": "Jeffrey DeMunn",
               "profile_path": "/n47DHl1RFfSEKUvL0MKGKwrL71S.jpg",
               "id": 12645,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe4793c3a36847f813d0d3",
               "name": "Louise Latham",
               "profile_path": "/eEWubDJHN9YwfEdUAbJm4moyqjj.jpg",
               "id": 6932,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Cora Miller",
               "gender": 1,
               "credit_id": "52fe4793c3a36847f813d0db",
               "name": "Joyce Van Patten",
               "profile_path": "/wEUXn5Zgz88SZlTLZPrecfxGFOO.jpg",
               "id": 14108,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "John",
               "gender": 2,
               "credit_id": "5871429ac3a3684f1d00d198",
               "name": "George Wallace",
               "profile_path": "/1BpqYsnqAwCOEz1HX4jbNxUHoQU.jpg",
               "id": 1273694,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ed Warren",
               "gender": 2,
               "credit_id": "58dfc78cc3a3683d2a00a227",
               "name": "Stephen Markle",
               "profile_path": null,
               "id": 173827,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Lorraine Warren",
               "gender": 0,
               "credit_id": "58dfc7979251415e7f00a7ca",
               "name": "Diane Baker",
               "profile_path": "/vnCHQAyRIxr3JQjhAUzivIfRDB.jpg",
               "id": 6930,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dorie",
               "gender": 1,
               "credit_id": "58dfc7a0c3a3683d3e00af41",
               "name": "Cassie Yates",
               "profile_path": "/wgPUqXA8uwMWqXaqADqpjIyL7QV.jpg",
               "id": 47457,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Katie",
               "gender": 1,
               "credit_id": "58dfc7a99251415e7f00a7d6",
               "name": "Allison Barron",
               "profile_path": null,
               "id": 92841,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Colleen",
               "gender": 0,
               "credit_id": "58dfc7b49251415e4400ad67",
               "name": "Krista Murphy",
               "profile_path": null,
               "id": 1388248,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Shawn",
               "gender": 1,
               "credit_id": "58dfc7bec3a3683d3500a9ef",
               "name": "Ashley Bank",
               "profile_path": null,
               "id": 94494,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Father Larson",
               "gender": 2,
               "credit_id": "58dfc7d69251415e3600a700",
               "name": "John O'Leary",
               "profile_path": "/4DWRI16denoba5UJkwJ7jh4fH6Q.jpg",
               "id": 53552,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "58dfc81c9251415e5f00aa36",
               "name": "William O'Connell",
               "profile_path": null,
               "id": 15969,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4793c3a36847f813d0c7",
               "name": "Robert Mandel",
               "profile_path": null,
               "id": 43786,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a7b47cdc3a3687b5400c769",
               "name": "Robert Curran",
               "profile_path": null,
               "id": 222304,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a7b47df0e0a26021f00d18b",
               "name": "Jack Smurl",
               "profile_path": null,
               "id": 1974244,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a7b47ef9251411c5800bb6b",
               "name": "Janet Smurl",
               "profile_path": null,
               "id": 1974245,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a7b48259251411c5800bba7",
               "name": "Daniel Schneider",
               "profile_path": null,
               "id": 1344280,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.559546,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49396,
      "vote_count": 13,
      "budget": 0,
      "overview": "When the Smurl family moves into a duplex, they find out it's haunted.",
      "similar": [
         2655,
         288158,
         102283,
         381032,
         243688,
         91586,
         201085,
         452507,
         77949,
         380124,
         305615,
         259392,
         11618,
         620,
         50497,
         609,
         416160,
         423536,
         11601,
         23827
      ],
      "original_title": "The Haunted",
      "runtime": 100,
      "poster_path": "/bHTj8O71vOzRu3uq3y7skHkvIO1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "20th Television",
            "id": 21659,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "FNM Films",
            "id": 3398,
            "origin_country": ""
         }
      ],
      "release_date": "1991-05-06",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Mandel"],
      "runtime": 88,
      "synopsis": "This creepy and scary story centers around The Smurl family of Pittston, Pennsylvania. After they move to a duplex, they begin experiencing strange things. Dark shadows move about the house. Mrs Smurl hears her mother in law calling her name only to find out later that she was not calling her. A black stain on the wall keeps reappearing after being cleaned and painted over and a foul smell lingers. Weird noises awaken them in the night and invisible hands caress Mrs Smurl while she's sleeping. But things begin to get worse. They begin to experience physical attacks by the invisible entity. When they try to get away from the house, they notice the black shadow had followed them. They realized that no matter where they go this thing will follow. When the attacks begin to get out of control, they contact The Warren family but will the renowned psychics be able to get rid of the evil presence that intends on destroying them?",
      "writers": [
         "Robert Curran",
         "Jack Smurl"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102007/",
      "coverLink": null,
      "actors": ["Stars: Sally Kirkland, Jeffrey DeMunn, Louise Latham | See full cast and crew »"],
      "reviews": [
         "I'm a horror movie buff (if you've read my other comments you'll know) and since i watch a lot of these i find it increasing harder to get scared which is why i welcomed this little beauty because it seriously sh*t me up! This is because the movie doesn't just give you a CGI ghost and tell you what it wants and why, instead it plays on the unknown which is the scariest thing. The low budget means the effects are no match to Hollywood blockbusters but just the shadow of black fire appearing in kitchen makes up for this because after all the simple things can have a better impact. Another scary factor is that even after the family have the ghosts exorcised and move house the shadow STILL follows them where-ever they go and considering this was based on a true story it's frightening to think this could happen to you!!! The most of the actors do an OK job playing the terrified family with the exception of the dad, he doesn't look bothered about what's going on even after he's been raped by the demon! This will interest people who love the supernatural but sceptics will obviously say it's crap. But i think it's a great film and everyone should see it, but not on your own in the dark on Halloween like i did ha! ha!",
         "I was born and raised in Wilkes-Barre, PA. I was in high school when this was going on. There was a story in the local papers like everyday. It was so weird. Some believed the Smurls and some, of course, did not. Personally, I believed them for the most part. Why would anyone subject themselves with the kind of ridicule they had to endure? Not to mention my personal experiences with the supernatural (which are stories within themselves). This movie may not be a very good movie (however, I wouldn't say it was bad either), but it was frightening to me, because I was relatively close to the true story. One of my best friends lives in West Pittston, in fact the next street over from where the Smurls once lived. Although I didn't know the Smurls personally, my friend did. She used to be good friends with the oldest daughter and went to high school with her. My friend had told me stories about their house that she remembered from before it became public knowledge. She had been over the house many a time. She claims to have witnessed some strange goings on there, however nothing major. Some strange things even allegedly went on at her house after she was over there. As to how much truth there is to the Smurls' claims, I don't really know. As far as the movie is concerned, it's not great, but not half bad for a TV movie. It was spooky whether or not one was close to the actual events or not. As I've heard many Northeast Pennsylvanians complain about how they mispronounced Wilkes-Barre; that is one thing that makes me squirm probably more than anything else in the film. I realize for people living anywhere else, they would not know..but if your making a film revolving around any city, you'd think the filmmakers would make an effort to get it right. I've heard people from the area pronounce it different ways, but not \"Wilkes-Bar\"! \"Wilkes-BERRY\" (most common) or Wilkes-Bear-Ah..even Wilkes-BEAR. It may seem trivial, but it's rather cringeworthy to the natives of the area. And the set they used; they made it look like some 'happy-swell-meadows' neighborhood. It looks nothing like that...it's much more urban. All the houses are close together. I do realize that having room to shoot is a factor in making a movie, but this was way more suburban than it was. There was one night just a few years ago, I drove past the old Smurl house to show some out of area friends. That night after I got home, the lamp in the room I was staying in at my parents house just started flickering out of nowhere. My father checked it out but found nothing wrong with the lamp or the circuit. Qhite bizarre. One thing that sticks in my mind about this movie is the fact that they had the same pattern of sheets that I do!!! Freaky!!!! Overall, this movie was far from a great ghost story flick, but it was spooky, and I may only feel that way, because I was in that area when these things were allegedly happening. That's why I say, \"I guess you had to be there\".",
         "A fantastic and atmospheric horror film which relies more on psychological terror than special effects and typical hollywood formulaic scares. It's based on a true story which was investigated by the Warrens and made into a pretty convincing book. Though the movie is obviously \"toned down\" for tv, the horror grows from an expertly directed series of scenes which portray a strengthening tension and increasing level of stress in the characters who are plagued by terrible circumstances. It's well done. A good friend o mine was actually one of the Warren's students, and I've dealt with them professionally in the past, so I can assure you they're not kooks. For example, they are high on the list of people law enforcement uses to advise on crimes of an extraordinary nature. This is serious business... and trust me, you see this film, you'll rest a bit uneasy that night! Cheers!",
         "The Haunted is probably the only tv movie that wasn't terrible. In fact, it's one of my favourite movies, period. The plot is simple (and TRUE). The Smurl family movies into a duplex on chase street, and strange things start happening (a hammer disappears, dripping water, whispering etc.), and the family disregards it as nothing. And it is nothing compared to what happens later on. The main focus of the haunting activity is Janet (played by Sally Kirkland), who is looked at funny after she voices her theory that there may be ghosts in the house. Once they learn (from demonologists Ed and Lorraine Warren) that 3 spirits and a demon infest their house, that's when the real terror begins, and at the risk of revealing too much, I'll stop there. I first saw this movie when it came out in 1991, and it scared the hell out of me (I was only 10 at the time), but for years I was waiting for it to come back on tv. when it finally did, I still loved it. This is a movie I wish they'd air on tv more often, and I still can't wait till it comes on again. Don't be expecting a big budget House on Haunted Hill or The Haunting remake with this one though, it moves more along the lines of The Changeling, The Blair Witch Project, and the original The Haunting. By that i mean, you rarely 'see' the visitors, but just mostly the things they do. This is an effective horror method that's hardly used, but believe me, it works. Unless you're into garbage like Urban Legend, you should find The Haunted an excellent movie, with good acting, and great scares.",
         "I have seen this movie many times and its a good one!It has good acting,great chills,thrills and it is hard to believe that happened.I recommend all ghost and horror fans to rent this!I enjoyed it and I think you will to!",
         "It is easy to dismiss a film simply because it is made for television, and therefore must be toned down. This film, however, succeeds where most otherwise fail by playing on a psychological level and not pandering to cheap and unconvincing TV-budget effects. There are a couple of silly moments, particularly a scene where the father is raped by the invading spirit manifesting itself as a fat drag-queen type, but this can be forgiven. There are many other truly chilling moments, such as just prior to the rape scene when the couple hear noises in their bed, and two scenes (at the beginning and end, when the family move into new houses) when the mother, Janet, hears her mother calling her name three times, only to realise that it is the spirit. Not perfect, nothing is, but it works.",
         "The Haunted starts with a load of scrolling text that claims the film is based on true events blah, blah, blah you know the sort of thing. It's 'Halloween 1955' & Janet Smurl (Sally Kirkland) remembers her childhood & the spooky stories that surround a house in her town. Jump forward to 'August 1975', Janet & her husband Jack (Jeffrey DeMunn) their two young daughters & Jack's Mum & Dad Mary (Louise Latham) & John (George Wallace) move into that very same house. At first things go well except for a few minor harmless unexplained occurrences. Now jump forward to 'March 1985' when the real trouble begins, Janet has had a further two daughters but things take a sinister turn for the worse. Janet begins to hear voices, she sees a ghost, electrical fires & all sorts of paranormal phenomena that gradually gets more & more threatening. The Smurl's seek help from the Church but they refuse to perform an exorcism, then they turn to psychic detectives & finally the press in a desperate attempt to rid their house of the ghosts & stop the family from being driven apart. Directed by Robert Mandel I thought The Haunted was a dull supernatural horror film. The script by Darrah Cloud is based on a book co-written by Janet & Jack Smurl (probably the real ones!) & offers nothing new or exciting to the haunted house horror sub-genre, one of my least favourite type's of horror films. I've always found these type's of films really dull & predictable, I mean people hearing sinister voices, things opening & closing on their own, lights exploding & lots of boring melodramatics involving the break down of a family unit, it's all here, it hardly gets the pulse racing & The Haunted does nothing to distinguish itself from loads of other boring haunted house tales. The origins of the ghosts are almost left totally unexplained as is the throwaway line that puberty (the two daughters grow up which is why it takes 10 years before the serious stuff starts to kick in) in someway gives the spirits their powers & you can't help but feel if they had just moved it would have saved a lot of trouble & emotional anguish on their parts! Having said that I suppose on a certain level it's watchable, the character's are OK, it moves along at a sedate pace but it's never excruciatingly boring & the supernatural activity is not too overblown or silly. The Haunted does what it sets out to do I suppose, it's far from the best or most exciting film ever but I've seen worse & I can't really criticize any specific part of it other than personally didn't really like it. Average at best. Director Mandel turns in a really lifeless film, it's bland, forgettable, flat, does not have one single scary scene in it & lacks any sort of atmosphere. The house chosen is just so ordinary & the film never builds or sustains any sort of tension or threat. The Haunted feels more like a family drama/soap opera as much as it does a horror, since I was hoping for a horror I can't say anything else other than I was disappointed by it. Technically this made-for-TV film lives up to that billing, the whole film feels & looks like the cheap TV film that it most definitely is. It's competently made & that's the best thing I say say about it, just don't expect a visual treat! The acting was decent enough but I don't particularly remember anyone from it in either a positive or negative way. The Haunted is an adequate ghost film, it didn't do anything for me but I will concede that maybe there is an audience for a film such as this out there, somewhere. If you like dull soap opera melodramatics in your films then The Haunted is for you, if however you like decent horror, atmosphere, scares & a bit of excitement then I suggest that The Haunted most definitely isn't for you.",
         "I loved the movie. It was scary, not overdone in terms of special effects, and had what I believe to be a strong element of truth. The actors who portrayed the family were believable and likable, which added to the possibility that hauntings may actually occur, and that they might actually occur to nice, normal people. This possibility actually increases the \"creep-factor,\" because if it can happen to that nice, all-American devoutly Catholic family, it can happen to anyone! On the negative side, though, I don't put as much stock in the self-proclaimed demonologist duo, the Warrens, as some (what with all that unfortunate Amityville-being-a-hoax business). Their involvement in the case makes me think \"hoax.\" But the film itself was worthwhile and good for a nice scare--regardless of whether or not it was a hoax.",
         "Fairly good acting with well done special effects and a very good story. The story is about 3 (spirits/ghosts) and 1 demon trying to break up a family. The story claims to be fact based except for a few time frames. You need to see the end of the movie and read the follow up notes to understand what happens where the film leaves off. If you where expecting the Poltergeist you will not find anything quite that intense, but fact is stranger than fiction, and this is based on fact. You may have trouble sleeping after seeing this one.",
         "Straight-to-TV, inspired by true events hokum� well that's what I thought I was getting myself into. However this dramatised case is a surprisingly eerie, bizarre and downplayed supernatural case that can get under our skin because the actual performances (the Smurls family) are sympathetically portrayed. The normal plot mechanics of the haunted house sub-genre are evident, and the atmosphere isn't particularly striking as it hangs there. You might think that if you see one, you've seen them all. But the predictable material does get more compelling further down the track, before coming to an unfulfilled abrupt conclusion that wraps it up. Everything (from the performances to the script) is done straight-face, with very little in the way of hysteria and humour. Patchy, but it works for most part. It heavily relies on story and mood, than say big special effects and lashing thrills. Although there's something just spooky about those reappearing spirit manifestations. Sally Kirkland and Jeffery DeMunn are capably good in the lead roles of Janet and Jack Smurl. Robert Mandel's crisply well-judged direction and Richard Bellis' hovering score added to the above-average production. I see plenty of jabs about the slow, ponderous pace, but I didn't feel it was that sluggish. Far from it. Slow, but not dull."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "FNM Films",
         "20th Television"
      ],
      "summaries": [
         "The Smurl family move into their new home on Chase Street only to find that it is plagued with three spirits and a demon. The demon wants to destroy their family and they are constantly desperate until they find the Warren family to get rid of them.",
         "When the Smurl family moves into a duplex, they find out its haunted."
      ],
      "budget": 0
   },
   "movielensId": 110225,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-05-06",
      "dvdReleaseDate": null,
      "directors": ["Robert Mandel"],
      "runtime": 100,
      "movieId": 110225,
      "title": "The Haunted",
      "mpaa": null,
      "actors": [
         "Sally Kirkland",
         "Jeffrey DeMunn",
         "Louise Latham",
         "Joyce Van Patten",
         "George Wallace",
         "Stephen Markle",
         "Diane Baker",
         "Cassie Yates",
         "Allison Barron",
         "Krista Murphy",
         "Ashley Bank",
         "John O'Leary",
         "William O'Connell"
      ],
      "imdbMovieId": "0102007",
      "originalTitle": "The Haunted",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "When the Smurl family moves into a duplex, they find out it's haunted.",
      "tmdbMovieId": 49396,
      "avgRating": 2.78571,
      "releaseYear": "1991",
      "numRatings": 7,
      "posterPath": "/bHTj8O71vOzRu3uq3y7skHkvIO1.jpg"
   }
}