{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1998367",
      "video": false,
      "title": "Trailer Park Jesus",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mary",
               "gender": 1,
               "credit_id": "52fe4ef99251416c75168d6d",
               "name": "Shanna Forrestall",
               "profile_path": "/3obLXjztke735vaes6XAdP0o1P8.jpg",
               "id": 120251,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Luke",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d71",
               "name": "Brent Henry",
               "profile_path": null,
               "id": 932106,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sara",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d75",
               "name": "Danie Coleman",
               "profile_path": null,
               "id": 1264311,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe4ef99251416c75168d79",
               "name": "Michael Dardant",
               "profile_path": null,
               "id": 1264312,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jessie",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d7d",
               "name": "Garrett Smith",
               "profile_path": null,
               "id": 1264313,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Candice",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d81",
               "name": "Kara Mann",
               "profile_path": null,
               "id": 1264314,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Maya",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d85",
               "name": "Casey McMurray",
               "profile_path": null,
               "id": 1264315,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Biker Dude",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d89",
               "name": "Burton Tedesco",
               "profile_path": null,
               "id": 1264316,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Doobs",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d8d",
               "name": "Zac Cino",
               "profile_path": null,
               "id": 1264317,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Hope",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d91",
               "name": "Holly Ladnier",
               "profile_path": null,
               "id": 578750,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Tiffany",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d95",
               "name": "Mandi Turner",
               "profile_path": null,
               "id": 1264318,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Grandpa",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d99",
               "name": "Kim Collins",
               "profile_path": "/jDLFUKnTXv2pPo3Mv3JRnOXATv.jpg",
               "id": 1044195,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Jezebel",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168d9d",
               "name": "Chantal Koerner",
               "profile_path": null,
               "id": 1009374,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Rose Marie",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168da1",
               "name": "Rebecca Elizabeth Hollingsworth",
               "profile_path": null,
               "id": 1264319,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Sarah with an 'H'",
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168da5",
               "name": "Nikki May",
               "profile_path": null,
               "id": 1264321,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168dab",
               "name": "Sean Gerowin",
               "profile_path": null,
               "id": 1264323,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ef99251416c75168db1",
               "name": "Sean Gerowin",
               "profile_path": null,
               "id": 1264323,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.416773,
      "production_countries": [],
      "id": 229613,
      "vote_count": 2,
      "budget": 0,
      "overview": "Jessie deals with a bad breakup, by purchasing a sheet of acid to share with his friends back home in Missouri. He hopes this will erase the bad memory of his college girlfriend, delivering the heartbreaking news to him, during sex. Departing New Orleans, Jessie detours onto Route 61, seeking a change of routine from the monotony of the Interstate. Unexpectedly, his engine fails at a forgotten trailer park in Cleveland, Mississippi. Fearful he's about to be harmed by bikers, Jessie exchanges hits of L.S.D. for safe passage home. During the ebb and flow of the day, Jessie experiences the extraordinary in the pedestrian, whilst resurrecting the lives of many. Inspired by a true misadventure.",
      "similar": [],
      "original_title": "Trailer Park Jesus",
      "runtime": 80,
      "poster_path": "/ktkwjcTILxegaT7xfHm6Pr3qdC7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-03-30",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "When a college student becomes stranded at a trailer park in rural Mississippi, he bargains his way home with a sheet of L.S.D.",
      "adult": false,
      "homepage": "http://www.trailerparkjesus.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sean Gerowin"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Sean Gerowin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1998367/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2Mjc0NzE5N15BMl5BanBnXkFtZTcwODgyMTg3OA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Shanna Forrestall, Brent Phillip Henry, Danie Coleman | See full cast and crew »"],
      "reviews": [
         "Fun upbeat comedy with quirky characters, trippy visuals and a delicious plot will delight your senses. High production value, superb direction and pain staking attention to detail make this feel like a true major/independent film and not an ultra-low budget movie which was shot for pennies. Comedy is a tough thing to pull off. The actors do a good job of developing archetypal characters without going over the top--avoiding a real danger--destroying the believability of the narrative. I laughed out loud several times and was invested in finding out what would become of each character. Give this movie a chance to you into a fan--you won't be disappointed.",
         "I had the pleasure of seeing this film at a private screening and enjoyed it immensely. Those who know, know that they know and will be kept on the edge of one's seat with anticipation of the proceeding antics. The characters are just that (characters), and the music throughout the film takes you along for a fun trip. The writers and director took a face first approach starting off with a blissful scene that leaves you feeling deeply for the lead character. Anyone, who as a youth, has taken a road trip should know how quickly it can turn into an adventure. I think the subject matter and theme presented is often avoided as it's not easy to portray such that the viewer might connect to that type of experience. As such, the film will potentially give you a flash back...if you \"know\" what I mean.",
         "Trailer Park Jesus by Sean Gerowin (Let's Rob the Cheese Shop) is an 80-minute light-hearted romantic comedy set in present-day rural Mississippi, although at times you feel as though you've been transported back 20 years. When New Orleans college student Jessie (Garrett Smith) makes an unexpected detour on his way home to Missouri he becomes immersed in a culture that must have been as alien to him as the transition from the Show-Me State to the Big Easy. These serendipitous encounters prove to reinforce his belief in love while serving as a conduit of enlightenment for the park residents. The screenplay was inspired by true events and is believable without much willing suspension of disbelief. The menagerie of characters epitomize quirk and camaraderie, with Mary (Shanna Forrestall) seeming to have the most sense of the motley cast, as well as the most experience as an actor. What's most impressive is the ease of storyline flow, enabling the viewer to effortlessly enter the lives of lovable misfits who soon experiences their own epiphanies. Also praiseworthy is the cinematography and location selection. And while the audio is not the strongest technical aspect of the film, the computer graphics frolic gracefully while the few and selective jump cuts, sparse but appropriate aged filter hues, and artfully racked focus is reminiscent of works by Terry Gilliam (Fear and Loathing in Las Vegas) and David Lynch (Wild at Heart, Twin Peaks). A bit more time could have been spent on editing consistency, but the overall feelings evoked were hit home by the solid directing of such an ensemble of character studies.",
         "I thought this movie was hilarious, due to the fact that it IS so true to life. I have been around each and every one of these characters, in my own life time at some point or another, living in Reseda, California:) Hell, when Jerry Garcia was alive, this WAS the scene at every Grateful Dead show across the USA! Ahhh I miss those days and this film brought me back. I also love ice cream, a little more than I did before seeing it:) I cant wait to see the unseen bloopers. Well done cast and writers:) Faye Graham New Orleans La",
         "From the outset, this indie film captures the viewer's attention, and doesn't let it go until the credits roll. Full of quirky twists and turns, the plot is compelling and original. Even the special effects, though obviously working within a limited budget, are well done and add a lot to the \"trippy\" feel of the flick. Though there is definitely some \"porn-quality\" acting every once in awhile, as a whole the acting is mature, believable, and interesting. The occasional flat, uninspired delivery is more than made up for by the strong performance of the leads,and is certainly forgivable, understandable, and not without precedent(think of Kevin Smith's early films). Tipping its hat to \"Easy Rider\"explicitly several times in the dialogue, the film also does so thematically, playing with the creative and sometimes dangerous clash that happens when one segment of society comes into contact with another. Though the film is a comedy (and a funny one), there is also a not-so-funny visual treatment of life in poverty-stricken rural America, and one walks away from the film with a better understanding of what it might be like to grow up in an American subculture where watching dogs hump is the only entertainment available, and where violence and lack of education are the norm. Having a good time playing with stereotypes, the film also helps the viewer move beyond them, making sympathetic characters out of individuals who started out as one-dimensional and easy to dismiss. Well worth the 90 minutes!",
         "I had the pleasure of attending a viewing of this film recently and had a great time. From start to finish, there were lots of laughs, excellent character development, a great dialog, as well as some impressive editing work and special effects. I particularly enjoyed the characters Paul and Luke, a zany pair of friends that meet the main character Jesse at a gas station after his car brakes down in Cleveland, Mississippi. Paul and Luke promise to make sure Jesse makes it to the bus depot so he can take the next bus out of town, but what ensues is a hilarious scene where the trailer park turns into an all out trip-fest. TPJ leaves the viewer feeling they have seen a film that translates the true vision of the writer/director. Not operating at the behest of a big budget studio, this film isn't scared to poke fun at some of the stereotypes of rural trailer park life, recreational drug use, or invoke the religious aspect. With film technology more accessible than ever these days, it's great to see that companies like Backyard Shed can retain the creative indie spirit while also making a high quality production. I won't be surprised to see this one winning a few more film festival awards before all is said and done!",
         "Trailer Park Jesus is freaking awesome!!!!! I loved the characters, the editing, the effects and the story-line. They did a fabulous job putting this together, i was pretty surprised actually. I think they did an AWESOME job creating the LSD trip with all the visuals and silliness. A genuinely good-hearted film that made me want to get all my friends together to trip out! I was cracking up the whole entire time, i loved it! Lots of moments where you catch yourself cracking up laughing out loud. It was super unconventional and silly and one of the best quirky movies I've seen in a while. I wish these guys would spew out some more films!!!!!!!!!!!! I would say this movie is beyond worth the hour and a half out of your life!",
         "Hearst all thou who doth like to laugh. Director Sean Gerowin has callest us to viewest his latest vision. His latest tome for the people. A film for all the faithful flock. Trailer Park Jesus is a film about Him. For He has risen. And with Him cometh a good times, paint, sparkles, beach weddings, and animated aquatic friends. Our story begins with Jessie of New Orleans traveling along the highways and byways of the American South to reunite with the tribe of his homeland. Along the way, however, the prophet Jessie falls victim to the plight of auto malfunction. Malfunction caused in part by wayward peers engaged in misguided worship. When Jessie is threatened by a Southern tribe member with an imposing visage, he turns to the comfort of Sara (without an \"h\"), proclaimed cousin of all and foe of a few. It is Sara, namesake of the Biblical wife of the prophet Abraham, and here friend of Jessie, who supports Jessie and helps him when he is most in need. With the aid of a few other members of the Southern tribe, Jessie is promised assistance to a caravan back to his own homeland. In order to receive safe passage from the Southern tribe, however, Jessie must provide mental openness in the form of fish. And despite his warning for caution and the knowledge that too much fish can lead to tragedy, the Southern tribe bask in Jessie's teachings, becoming true followers of the faith. For they are those who needed a spark and a prophet to enter their midst. Their's had become a life of despair and Jessie's teachings opened them to ideas and celebration they had only dreamed of. Or perhaps had once, but lost in the mire of their desperate surroundings. Then, from the teachings of Jessie and the visions of the people, the Savior appeared. A Savior who carries paradise and a wine cooler, who baptizes ultimate fighters and smokes cigarettes, and who is the only one who can truly lead the people of the Southern tribe from their meager surroundings to a life of glory, fame, and salvation. Unfortunately for Jessie, however, as the people embrace the Savior and bask in their new-found teachings, Jessie realizes time is ticking on his ability for safe passage back to his own tribal homeland. Jessie struggles with the notion that the people do not want their new prophet to leave their tribe, especially Sara, his foremost supporter and the foundation of his ministry. Yet Jessie remains stalwart his plan to rejoin his own tribe and return to his homeland. For the ties to family and his homeland are stronger than those to his new flock, although the beautiful Sara does provide his last temptation. He blessed them with Jessie and Jessie blessed them with fish. The Book tells us a fish dinner for the masses never runs out. Trailer Park Jesus provides the masses with laughs, odd situations, and even odder characters that likewise never run out. This is a letter of Jordi to the Romans. Quick synopsis: Mix Cheech and Chong drug humor from south of the border with the Canadian background of Trailer Park Boys from north of the border, throw in some southern stereotypes and religious allegory, and you have Sean Gerowin's latest, Trailer Park Jesus. From the two films of his that I have seen, Gerowin, a director from New Orleans, likes putting characters in crazy situations and forcing them to escape using their own wit and wisdom, especially when situations get vastly out of hand, often thanks to the misuse of some chemical enhancements. Here, a young college student is forced to bargain his way out of rural Mississippi using only a sheet of LSD. When the LSD proves stronger than he imagined and the locals embrace the mind-altering drug, hilarious hijinks ensue.",
         "Trailer Park Jesus is a wonderfully irreverent film. This movie doesn't go out and try to offend anybody, it is just a fun ride littered with catchy one-liners and fairly descent acting. It is based on a 'true misadventure', which is a witty way of saying that somebody lived through this chaos. I will compare this film to other drug induced cult classics. There is a Jesus character that is giving and bears a striking resemblance to the conventional Jesus but this Jesus is the 'Trailer Park Jesus.' As opposed to turning water into wine, Trailer Park Jesus turns water into wine cooler. Trailer Park Jesus starts in New Orleans where the main character, Jessie, is about to embark upon a road trip from New Orleans, where he goes to college, to his hometown in Missouri. His plan is to entertain some of his high school buddies with some little fish decorated stickers laced in LSD. Just like almost anybody in his situation, he gets into his stash before leaving New Orleans and shares it with a couple of cute, but kind-of air-headed co-eds. This will come back to get him. When Jessie takes off on his trip home, things start to go wrong. His cell phone and car break down in the middle of nowhere. He finds himself off the interstate in a little redneck, po-dunk town. Everybody in this town is related, or so it seems, and of course they all live in a trailer park. Jessie is stranded with his car broken down and no phone in a town that offers little in the way of help. There is a convenience store, a bus station and the trailer park. He starts to meet the colorful cast of characters from this little town and barters his way into getting his car towed and a ride for himself to the bus station by trading hits of acid. The bus doesn't leave for hours and pretty soon he is in the trailer park with his new friends, selling his acid piece by piece and pretty soon everybody in the trailer park is in a fish fried frenzy. What can go wrong goes wrong but of course everything works out. The characters are hilarious. They fit their roles and everybody puts in a very strong performance that all help to make this movie the best future cult classic to come out of New Orleans this year. There are very lovely visual effects and the city of New Orleans is well represented in montage form with a nice sprinkling of local music, the likes of Country Fried and other local artists. The sound is terrific throughout the film and that is a testament to the talent of the filmmakers, as is the cinematography and layout of the story. This was a low budget film but you wouldn't know it by watching it. Trailer Park Jesus is very well made. With blatant disregard for authority and grandmothers, this clever film provides viewers ages 17-69 with a mind explosion for 90 minutes. Dazed and Confused did it in the 90's about the 70's featuring herb as the special guest. This was done again in the 90's about the 90's when Maui Wowie had a feature roll in Half-baked. Trailer Park Jesus puts two hits of strong acid on the tip of your tongue and drags you through the trailer park on the edge of your seat. Writer/director Sean Gerowin does a great job of keeping the atmosphere light and enjoyable while still somewhat practical. The characters are very entertaining and as far as I know, would fit right in to a trailer park somewhere in the Bible belt. Michael Dardant brings the most back woods character, Paul, alive with a terrific accent and well timed punch lines. He also juggles fire. Brent Henry plays Paul's running buddy/wrestler, Luke, and he slips into character as easy as skipping bail. Holly Rochelle is a natural and fits right into the trailer way of life. Danie Colman is the cute love interest of Jessie. There always has to be 'the girl.' Time is the true villain in this film but time's sidekick is Shanna Forstall. She plays a mean bitch. She does it well. Jessie is so easy to relate to and root for, candidly played by Garrett Smith. Trailer Park Jesus is sweeping the world off of its feet and into a lawn chair and I recommend that you grab a 4-pack of Bartle and James' wine coolers and check this one out. It's fun; it's inventive with great character development and ties everything together wonderfully. This is the 'don't miss comedy of the year.' Not only will fans enjoy the feature length film, but the filmmakers provide the fans with so much more. You can follow Jesus on twitter under @tp_jesus and enjoy witty banter that flows like the Mississippi River. There are Apostle Kits available that contain goodies and swag for the true believers. This film may not start any religions but it is developing a cult following and we can expect to see more from these film makers as they work very well together and continue to work together. We have all been blessed with this divine film so let us all rejoice and celebrate Trailer Park Jesus.",
         "I was invited to a private screening of this film and went. I'm not a film buff and typically would have skipped something like this. Boy, was I ever glad I attended! This is a fun, delightful, laugh-out-loud story that reveals more just after you suspect what might happen next. It's sort of Hitchcock-ian that way...you anticipate and then are rewarded with almost but not-quite being right. The soundtrack rocks. The camera work is brilliant. The characters and their actions are spot-on. Having been in somewhat similar situations, this based-on-a-true adventure rings honestly. I can't wait to bring my friends to a public screening. Bravo!!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Backyard Shed Films"],
      "summaries": [
         "Jessie deals with a bad breakup, by purchasing a sheet of acid to share with his friends back home in Missouri. He hopes this will erase the bad memory of his college girlfriend, delivering the heartbreaking news to him, during sex. Departing New Orleans, Jessie detours onto Route 61, seeking a change of routine from the monotony of the Interstate. Unexpectedly, his engine fails at a forgotten trailer park in Cleveland, Mississippi. Fearful he's about to be harmed by bikers, Jessie exchanges hits of L.S.D. for safe passage home. During the ebb and flow of the day, Jessie experiences the extraordinary in the pedestrian, whilst resurrecting the lives of many. Inspired by a true misadventure.",
         "When a college student becomes stranded at a trailer park in rural Mississippi, he bargains his way home with a sheet of L.S.D."
      ],
      "budget": 0
   },
   "movielensId": 110354,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-03-30",
      "dvdReleaseDate": null,
      "directors": ["Sean Gerowin"],
      "runtime": 80,
      "movieId": 110354,
      "title": "Trailer Park Jesus",
      "mpaa": "",
      "actors": [
         "Shanna Forrestall",
         "Brent Henry",
         "Danie Coleman",
         "Michael Dardant",
         "Garrett Smith",
         "Kara Mann",
         "Casey McMurray",
         "Burton Tedesco",
         "Zac Cino",
         "Holly Ladnier",
         "Mandi Turner",
         "Kim Collins",
         "Chantal Koerner",
         "Rebecca Elizabeth Hollingsworth",
         "Nikki May"
      ],
      "imdbMovieId": "1998367",
      "originalTitle": "Trailer Park Jesus",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["F4dmKYJ0qNA"],
      "plotSummary": "Jessie deals with a bad breakup, by purchasing a sheet of acid to share with his friends back home in Missouri. He hopes this will erase the bad memory of his college girlfriend, delivering the heartbreaking news to him, during sex. Departing New Orleans, Jessie detours onto Route 61, seeking a change of routine from the monotony of the Interstate. Unexpectedly, his engine fails at a forgotten trailer park in Cleveland, Mississippi. Fearful he's about to be harmed by bikers, Jessie exchanges hits of L.S.D. for safe passage home. During the ebb and flow of the day, Jessie experiences the extraordinary in the pedestrian, whilst resurrecting the lives of many. Inspired by a true misadventure.",
      "tmdbMovieId": 229613,
      "avgRating": 0,
      "releaseYear": "2012",
      "numRatings": 0,
      "posterPath": "/ktkwjcTILxegaT7xfHm6Pr3qdC7.jpg"
   }
}