{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "d-day",
            "id": 9156
         },
         {
            "name": "hedgerow",
            "id": 231134
         }
      ],
      "imdb_id": "tt0042282",
      "video": false,
      "title": "Breakthrough",
      "recommendations": [],
      "backdrop_path": "/g1f3AiSXiiIirhMVGM5ETmBPUw4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Capt. Tom Hale",
               "gender": 2,
               "credit_id": "52fe463cc3a368484e0859fd",
               "name": "David Brian",
               "profile_path": "/e0BICAGCXRtTksyOm8Np0TZfMST.jpg",
               "id": 16016,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lt. Joe Mallory",
               "gender": 2,
               "credit_id": "52fe463cc3a368484e085a01",
               "name": "John Agar",
               "profile_path": "/9fKJvICRu2KS6Q70R7plPUkCkTY.jpg",
               "id": 103071,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sgt. Pete Bell",
               "gender": 2,
               "credit_id": "52fe463cc3a368484e085a05",
               "name": "Frank Lovejoy",
               "profile_path": "/54lyen5kzZ7xehjCVR6dJxe3qRo.jpg",
               "id": 81179,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cpl. Danny Dominick",
               "gender": 2,
               "credit_id": "52fe463cc3a368484e085a09",
               "name": "William Campbell",
               "profile_path": "/9msspDde4Vu8Q8KwreQkGT7Iu44.jpg",
               "id": 15699,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Pvt. Edward P. Rojeck",
               "gender": 2,
               "credit_id": "52fe463cc3a368484e085a0d",
               "name": "Paul Picerni",
               "profile_path": "/gKafN24wJ5zfdmxhud0fe9GVcTI.jpg",
               "id": 78309,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Pvt. Frank Finley",
               "gender": 0,
               "credit_id": "52fe463cc3a368484e085a11",
               "name": "Greg McClure",
               "profile_path": "/5KP5cgZRS5vOJw4V1kXUjHRh4oq.jpg",
               "id": 130376,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pvt. 'Four-Eff' Nelson",
               "gender": 0,
               "credit_id": "52fe463cc3a368484e085a15",
               "name": "Richard Monahan",
               "profile_path": null,
               "id": 137580,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe463cc3a368484e0859f9",
               "name": "Lewis Seiler",
               "profile_path": null,
               "id": 84641,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe463cc3a368484e085a1b",
               "name": "Joseph Breen",
               "profile_path": null,
               "id": 196157,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe463cc3a368484e085a21",
               "name": "Bernard Girard",
               "profile_path": null,
               "id": 153669,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe463cc3a368484e085a27",
               "name": "Ted Sherdeman",
               "profile_path": null,
               "id": 68089,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "War",
         "id": 10752
      }],
      "popularity": 0.11947,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 60908,
      "vote_count": 2,
      "budget": 0,
      "overview": "Filmed with the full cooperation of the U.S. Army, Breakthrough is a lean, no-nonsense war film set during the 1944 invasion of the continent.",
      "similar": [
         11202,
         857,
         16121,
         8266,
         374720,
         399790,
         783,
         9289,
         16869,
         2253,
         5925,
         853,
         409,
         424,
         205596,
         14574,
         11046,
         228150,
         227306,
         676
      ],
      "original_title": "Breakthrough",
      "runtime": 91,
      "poster_path": "/yF8O85jm6zoTlhrRDiQb7r1peuz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1950-11-17",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "You'll Cheer...the Battlin' Bozos of Company \"B\"!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lewis Seiler"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Joseph Breen",
         "Bernard Girard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042282/",
      "coverLink": null,
      "actors": [
         "David Brian",
         "John Agar",
         "Frank Lovejoy"
      ],
      "reviews": [
         "Solid war picture with capable cast - Bryan the grim company commander, Agar the aggressive junior officer, Lovejoy the good-natured noncom who also serves as the film's narrator. \"Breakthrough\" offers the usual cliches and too much stock footage, but its combat sequences are well done and the story never drags.",
         "1944. 2nd Lt Joe Mallory, fresh out of Officer Candidate School, takes command of a veteran platoon of the US 1st Infantry Division. The company commander, Captain Tom Hale, is the former commander of the platoon and a tough taskmaster. Luckily Mallory has a very capable and experienced platoon sergeant, Pete Bell. The allies will soon invade Nazi-occupied France and Mallory's leadership abilities will be tested to the limit. Good, realistic WW2 drama. A good study in infantry platoon tactics and army life in general, especially the human side of war. No false heroics, no implausible action - gritty and believable. While it is accurate and has some good action scenes, not incredibly profound. Doesn't really add anything to the annuls of war movies. Quite entertaining though.",
         "Like most of Agar's early movies, the surrounding cast were of sufficient quality to hide, and even carry, Mr. Shirley Temple. The WW2 period featured is one that is usually skipped over, despite the importance and difficulty of that time. The Allies were under pressure from a well organised defence, taking full advantage of the local terrain, this is all well communicated by this movie. Lovejoy, as the cagey experienced Sgt., is a marvel to watch, as his character does for his Lt., so he does for Agar, a wonderful fusion of living the role. A worthy entry for any war movie buff",
         "John Agar is the green second lieutenant, David Brian is his company commander, and Frank Lovejoy is the avuncular top sergeant herding the platoon through the hedgerows of Normandy after landing on the beach in 1944. Agar is passable. Brian has the John Wayne role of the tough, distant taskmaster who secretly knows every man in the platoon by his first name but will never admit it. Lovejoy is not the most expressive actor who ever lived but he's always likable. As for the men in the platoon, let's see. (1) A good-natured Southern redneck who cries when his dog is killed. (2) A tough kid from the streets of Chicago. (3) A goofy looking comedian who impersonates movie stars. (4) An ambitious corporal who thinks of nothing but running for Congress when it's all over. (5) The older, pipe-smoking family man who is a reassuring presence. (6) A dim-witted muscle man who avoid noxious foods and women, either of which might drain him of his élan. (7) The kid with glasses, too young to vote. (7) The Jewish kid from the Bronx who shares his salami with the others. There is a good deal of banter -- there always is -- but no serious conflict among the men. Brian's company commander is hard on everyone but he has a heart of, well, not gold but not stone either. The banter is absolutely terrible, all forced gaiety. The writers seem to know quite a bit about Army protocol and equipment but nothing about producing a screenplay. The usual girls show up improbably from time to time. Two scenes do stand out, though, amidst the dross. In the first one, a German tanks is trundling implacably along a sunken road between the hedge rows. The platoon has nothing to stop its advance. But William Campbell, already wounded, climbs aboard the tank from the rear and destroys it with a grenade. The others shout at him, telling him to jump off before the Panzer blows, and Campbell cries out, \"I can't! I ain't got no LEGS.\" The second scene provides the climax. Brian is relieved of command of the company and booted upstairs with a promotion to major. Both he and his superiors know he's not needed at staff, but he's pustular with tension and is about to pop. He turns the company over to Agar, along with his own silver first-lieutenant's bar. It doesn't sound like much, I know, but it's played well, almost entirely without sentiment. It might be worth adding that the advance through the hedgerows was as difficult and costly as it was, not just because of the terrain but because the German withdrawal was so skillfully managed. The Germans would hold out against the advancing Allies until the last minute, but before leaving their shell holes and trenches they would have them zeroed in for mortar fire -- hole by hole. They left mines at the bottom of some of them.",
         "****SPOILERS**** Superior WWII movie that covers the fighting of a rifle company of the 1st, The Big Red One, US Infantry Division from the beaches of Normandy into Northen France in the late spring and early summer of 1944. The rifle company breaking out of the Normandy beachhead then fought its way through the bloody and vicious battles of the hedgerows in the Normandy countryside to finally to the outskirts of the French town Saint-Lo. It was the breakout at Saint-Lo that in the end put the Germans forces to flight right out of France. Lead by its company commander Captain Tom Hale, David Brian, the rifle company got pinned down in the hedgerows that made it's use of amour or tank and artillery support as well as air power totally useless. It was the close quarters combat that started to slowly grind down Capt. Hale's men with reinforcements or replacements slow in coming. It's Capt. Hale's second in command Lt. Joe Mallory, John Agar, and the company's top kick sergeant Pete Bell, Frank Lovejoy, who kept the men together in the fighting even though Captain Hale, after three years of combat experience, started showing signs of not only battle fatigue but mental deterioration. Trying to distance himself from the men under his command Capt. Hale thought that would isolate him from knowing about themselves and their friends and families back home when any were killed or wounded. All these pent up feeling started to get to Capt. Hale leaving him a wreck of a man by the time his company was to participate in the final breakout at the French strategic town of Saint-Lo. It's then that Captain Hale was relieved of his command and kicked upstairs to Divisional Headquarters with Let. Mallory taking over. Let. Mallory in the end didn't let the now almost committable Capt. Hale down in the bitter fighting that was to come. But at the same time he realized what Capt. Hale meant by not getting too close to him men. It can do more damage to a company commander then a direct his from a German 88. Great combat scenes many taken from actual US Army combat photographers make the film \"Breakout\" one of the best and most honest, there's no phony Hollywood wartime heroics here, movie about WWII in how it was really fought. The movie has those watching it feel as if they were part of US Army rifle company in the movie that fought in it.",
         "A very good film dealing with the emotional stress and personal sacrifices of men in training for the D-Day Invasion of June 6, 1944. David Brian gives one of his best performances ever as the head of the unit. He is a very conflicted person-tough on the men under his command, but certainly being able to show compassion when one of his men is killed. The other performances are just as good with John Agar, as the high school English teacher,seeming to be picked on by the Brian character, not knowing that the latter is planning to have him replace him. Ironically, this teacher of English uses the term good when he should have said well. The town scene in France was well-played out; it proved that you always had to be on your guard."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "1944. 2nd Lt Joe Mallory, fresh out of Officer Candidate School, takes command of a veteran platoon of the US 1st Infantry Division. The company commander, Captain Tom Hale, is the former commander of the platoon and a tough taskmaster. Luckily Mallory has a very capable and experienced platoon sergeant, Pete Bell. The allies will soon invade Nazi-occupied France and Mallory's leadership abilities will be tested to the limit.",
         "An American infantry unit, from its pre-invasion training to combat in Europe."
      ],
      "budget": 0
   },
   "movielensId": 110690,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-11-17",
      "dvdReleaseDate": null,
      "directors": ["Lewis Seiler"],
      "runtime": 91,
      "movieId": 110690,
      "title": "Breakthrough",
      "mpaa": "",
      "actors": [
         "David Brian",
         "John Agar",
         "Frank Lovejoy",
         "William Campbell",
         "Paul Picerni",
         "Greg McClure",
         "Richard Monahan"
      ],
      "imdbMovieId": "0042282",
      "originalTitle": "Breakthrough",
      "genres": ["War"],
      "youtubeTrailerIds": [],
      "plotSummary": "Filmed with the full cooperation of the U.S. Army, Breakthrough is a lean, no-nonsense war film set during the 1944 invasion of the continent.",
      "tmdbMovieId": 60908,
      "avgRating": 4,
      "releaseYear": "1950",
      "numRatings": 1,
      "posterPath": "/yF8O85jm6zoTlhrRDiQb7r1peuz.jpg"
   }
}