{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0419142",
      "video": false,
      "title": "Slavoj Žižek: The Reality of the Virtual",
      "recommendations": [
         24234,
         73241
      ],
      "backdrop_path": "/sTo86KZyMd2fJVlyGZNd1v53Id2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "52fe47b7c3a368484e0d5b8f",
            "name": "Slavoj Žižek",
            "profile_path": "/mZ367xuAf7GO3Hir6pjTUNc4D1E.jpg",
            "id": 112200,
            "order": 0
         }],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47b7c3a368484e0d5b95",
            "name": "Ben Wright",
            "profile_path": "/tZNIdYR7rtzhj0aBOafrU4XmhQ2.jpg",
            "id": 71781,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.160794,
      "production_countries": [],
      "id": 69054,
      "vote_count": 3,
      "budget": 11,
      "overview": "In this tour de force filmed lecture, Slavoj Žižek lucidly and compellingly reflects on belief - which takes him from Father Christmas to democracy - and on the various forms that belief takes, drawing on Lacanian categories of thought. In a radical dismissal of todays so called post-political era, he mobilizes the paradox of universal truth urging us to dare to enact the impossible. It is a characteristic virtuoso performance, moving promiscuously from subject to subject but keeping the larger argument in view.",
      "similar": [],
      "original_title": "Slavoj Žižek: The Reality of the Virtual",
      "runtime": 71,
      "poster_path": "/gko0OCDK3JL45chkpBlg4aEUmlx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2004-03-23",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A cinematic experience of Žižek's interpretations of reality and virtual reality.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Ben Wright"],
      "runtime": 71,
      "synopsis": null,
      "writers": ["Slavoj Zizek"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0419142/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODc0MDEyMDEwN15BMl5BanBnXkFtZTcwMTQwNjk5Mw@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Slavoj Zizek | See full cast and crew »"],
      "reviews": [
         "To try and go into everything that philosopher/psycho-analyst/movie-critic Slavoj Zizek discusses in The Reality of the Virtual could possibly take much too long to fit into this comment. All I can say is that as far as \"modern\" philosophers go, Zizek is quickly becoming someone I will always take a chance to check out, be it in a documentary or in book form (only Welcome to the Desert of the Real has caught my eye as of yet, but I hope to read others soon). If you've already seen The Pervert's Guide to Cinema you may already know what Zizek is getting at with many of his viewpoints: about the levels of reality that there are involving social interaction, politics, ethics, class struggles, inherent double standards. This time, however, there isn't so much of the sexual side to it all (not that Freud isn't brought up more than once in the lecture), so much as there is a discourse on the \"real-real\", about what constitutes reality combined with 'imagined reality' (sort of face-value reality that may have truth even if it's not a deep truth) and 'symbolic reality' (the structures of capitalism, or rather modernity), into something that is very complex. By the end of the lecture, some things have still flown over my head (the many facets of modernity will need a second viewing, as will the whole aspect of universality), but much of it will stick with me, as with any great thinker, in getting me to reevaluate facets in society and political structures and even certain films (i.e. Short Cuts and Love & Death) I haven't gotten to think of yet. And, one crucial point, Zizek is extremely engaging as a speaker, and despite (or maybe because of) the direction of the camera being limited to only a few angels separated by fade-outs, it's all up to him to be on the spot all the time. Which is actually just as well, as the other film titled Zizek! overloaded with the visuals to sort of compensate for trying to be simple in capturing such an animated man with so many gesticulations and passion for his subject matter. As with any philosopher, unless if you're especially well-versed in the subject, once or twice you may need to rewind just a bit to re-watch something (there's one part regarding Dostoyevsky and God that's remarkable), but it's worth it. Rarely does one get a chance to view someone like Zizek so straightforward in presentation as this, but Reality of the Virtual is one of those chances, and is a treat for fans and newcomers ready with an open mind- and a chocolate laxative.",
         "This is not a movie or a documentary but a book on DVD. If you've read Zizek's books, you already know everything that is delivered in this filmed lecture. You can guess ahead of time which examples Zizek will provide to illustrate certain points, and you know where every argument is going. But at the same time, you can't really say that this DVD replaces Zizek's books. Zizek has written over 20 books, and this DVD is approx. 70 minutes (if I remember correctly); ideas are simplified, important details are neglected and in the end, you really only touch the surface. As usual, Zizek is highly entertaining. But this has everything to do with Zizek himself, and nothing to do with the filmmaker or the film itself. Poor exercise in 'filmmaking'."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Ben Wright Film Productions"],
      "summaries": ["In this tour de force filmed lecture, Slavoj Zizek lucidly and compellingly reflects on belief - which takes him from Father Christmas to democracy - and on the various forms that belief takes, drawing on Lacanian categories of thought. In a radical dismissal of todays so called post-political era, he mobilizes the paradox of universal truth urging us to dare to enact the impossible. It is a characteristic virtuoso performance, moving promiscuously from subject to subject but keeping the larger argument in view. Based at Ljubliana University, Slavoj Zizek's main body of work includes Welcome to the Desert of the Real and, most recently, The Puppet and the Dwarf: The Perverse Core of Christianity."],
      "budget": 7000
   },
   "movielensId": 111031,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-03-23",
      "dvdReleaseDate": null,
      "directors": ["Ben Wright"],
      "runtime": 71,
      "movieId": 111031,
      "title": "Slavoj Žižek: The Reality of the Virtual",
      "mpaa": null,
      "actors": ["Slavoj Žižek"],
      "imdbMovieId": "0419142",
      "originalTitle": "Slavoj Žižek: The Reality of the Virtual",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["KdpudWL5i68"],
      "plotSummary": "In this tour de force filmed lecture, Slavoj Žižek lucidly and compellingly reflects on belief - which takes him from Father Christmas to democracy - and on the various forms that belief takes, drawing on Lacanian categories of thought. In a radical dismissal of todays so called post-political era, he mobilizes the paradox of universal truth urging us to dare to enact the impossible. It is a characteristic virtuoso performance, moving promiscuously from subject to subject but keeping the larger argument in view.",
      "tmdbMovieId": 69054,
      "avgRating": 3,
      "releaseYear": "2004",
      "numRatings": 7,
      "posterPath": "/gko0OCDK3JL45chkpBlg4aEUmlx.jpg"
   }
}