{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "countryside",
            "id": 548
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "young girl",
            "id": 18252
         },
         {
            "name": "childhood",
            "id": 157955
         },
         {
            "name": "home alone",
            "id": 169826
         },
         {
            "name": "1980s",
            "id": 208289
         }
      ],
      "imdb_id": "tt1342378",
      "video": false,
      "title": "The Girl",
      "recommendations": [
         264214,
         352869,
         123413,
         188264,
         387380,
         165181,
         207381,
         300927,
         431711,
         128765,
         153798,
         429320,
         258781,
         134718,
         327546,
         262713,
         365490,
         188724,
         53716,
         229069
      ],
      "backdrop_path": "/yAXW7vGhbfYTm6JKXew7JMvzzdc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "The Girl",
               "gender": 0,
               "credit_id": "52fe44fb9251416c91023711",
               "name": "Blanca Engström",
               "profile_path": "/v2di0VkjKJuZPmokPjWoXWndTyg.jpg",
               "id": 111341,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "The Father",
               "gender": 2,
               "credit_id": "52fe44fb9251416c91023715",
               "name": "Shanti Roney",
               "profile_path": "/ti21d61B3kNV0QZCJHsviad79jR.jpg",
               "id": 11044,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "The Mother",
               "gender": 1,
               "credit_id": "52fe44fb9251416c91023719",
               "name": "Annika Hallin",
               "profile_path": "/xvbhvw0Zt8SCNXVApudzZfd6X2p.jpg",
               "id": 79270,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Gunnar",
               "gender": 2,
               "credit_id": "52fe44fb9251416c91023725",
               "name": "Leif Andrée",
               "profile_path": "/4dn3zU9vQ6JwwIyJvPUQiqWlfc9.jpg",
               "id": 93239,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Petter",
               "gender": 0,
               "credit_id": "52fe44fb9251416c9102371d",
               "name": "Calle Lindqvist",
               "profile_path": null,
               "id": 111342,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe44fb9251416c91023721",
               "name": "Tova Magnusson",
               "profile_path": null,
               "id": 111343,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Elisabeth",
               "gender": 1,
               "credit_id": "52fe44fb9251416c91023729",
               "name": "Maria Langhammer",
               "profile_path": null,
               "id": 64974,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c91023707",
               "name": "Fredrik Edfeldt",
               "profile_path": null,
               "id": 110054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fb9251416c9102370d",
               "name": "Karin Arrhenius",
               "profile_path": null,
               "id": 110055,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "545fbedfc3a3686e490024bb",
               "name": "Hoyte van Hoytema",
               "profile_path": "/dT5fWu3M9qJQlE5rItpSGUUOMC0.jpg",
               "id": 74401,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.833251,
      "production_countries": [{
         "iso_3166_1": "SE",
         "name": "Sweden"
      }],
      "id": 33091,
      "vote_count": 16,
      "budget": 0,
      "overview": "Story of a ten-year-old girl left alone in her house in the summer of 1981.",
      "similar": [
         398818,
         772,
         9714,
         44683,
         16614,
         9779,
         14748,
         438634,
         281007,
         13649,
         9571,
         13990,
         39227,
         19688,
         4927,
         350060,
         19209,
         33766,
         255476,
         13617
      ],
      "original_title": "Flickan",
      "runtime": 95,
      "poster_path": "/3HG7gAfYHBWvdmNWrmYmoxcNPJZ.jpg",
      "spoken_languages": [{
         "name": "svenska",
         "iso_639_1": "sv"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Acne Film",
         "id": 5351,
         "origin_country": ""
      }],
      "release_date": "2009-02-10",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fredrik Edfeldt"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Karin Arrhenius"],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt1342378/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjg4NTYwOTY2NV5BMl5BanBnXkFtZTcwNDQwMTIzNA@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Blanca Engström, Shanti Roney, Annika Hallin | See full cast and crew »"],
      "reviews": [
         "Days before a family leaves for a long stay in Africa they receive a call from the organisation they are staying with telling them their youngest child is too young to come. When they find an aunt willing to take care of her they decide to leave anyway and so the child is left with her aunt. The aunt has plans of her own and less feeling for responsibility than she should have though and so the kid is quickly left alone. And with that starts a tale of a 9 year old girl living on a farm, having to deal with life on her own for summer. Starting from this baseline it can't be surprising that things are going to be difficult. What follows is her tale, her coming to age too quickly and her intense loneliness. It is filmed in a slow way with many long shots and a handful of light moments to make sure it doesn't become a tearjerker altogether. The film rolls on with a steady pace and is completely carried by the appearance of the little girl who despite of her age manages to be the character she is supposed to be. It's not like the adult actors are doing badly, it's just that she is doing better, or at least far better than what might expect from a kid. All in all, an amazing and depressing piece of film which can only make one want to beat some common sense into some people - in this case the aunt of the child. Amazingly good stuff, 8 out of 10 kids damaged",
         "In 50 yrs. of films, I think this is the first film I've ever seen that gives the viewer such in-depth experience watching the day to day life of a 10 yr. old girl. The extraordinary Ponette has a four yr old subject and hones in on one other overriding topic- death- as understood by the 4 yr. old. But The Girl has no focus on any one subject other than its heroine; it documents her day to day life as she, through accident(others') and intention(hers), is left at home to fend for herself during a significant stretch of her 10th summer. While resourceful and independent,this thin pale redhead is also emotionally walled off from the world. She watches, and you watch her watch.Her wanderings around her rural small town Swedish environs- teach her both the negative 'lessons' of cruel peers and weak adults, and the joys possible with kind strangers and simple friends. While not a children's film, it would be excellent for family viewing and discussion.",
         "The girl on the cover of the DVD \"The Girl\" looks like my conception of an old friend's description of the way some people are treated, \"like a red-headed step-child.\" Also the wonderful actress Blanca Engström, who inhabits the flesh of the film's central focus looks like my daughter's best kindergarten friend. Except the \"Girl\" of the film is given very little to smile about, unlike my daughter's little friend. The girl's parents are on a mission to Africa ostensibly for humanitarian reasons but in reality because as the mother states, \"I can't stand living in this cramped little world.\" And when, the parents learn that their daughter is too you to join them and her brother, they abandon her to an aunt who can't even take care and responsibility of herself. The Girl cleverly manages to rid herself of the aunt and her partying friends. After I've watched and love an under-the-radar film like this I try to figure out how I found it and in this case I have very little idea. The cinematographer handled the camera in \"Let the Right One In\" which I loved, but I doubt that's how I found this. I'm grateful for Netflix letting me find these obscure films and for having such a vast selection so easily accessible. These are great times for cinephiles. \"The Girl\" is a film about the power of silence, of observation, and the wisdom of some people, children included. The girl is wise enough to dispatch her careless aunt, to hide her situation from those adults who mighty impose on her and could disrupt her learning and her ability to discover, for herself, how the world works. The friends her age, she finds, are as thoughtless and cruel as the adults she is subjected to. Yet she pushes on, totally alone at times into the adventure she has helped create, without remorse. This is the kind of cinema we don't get from Gollywood. This could have been made into a complete tear-jerker. But it is not, even though I did cry at the end. What a beautiful and insightful movie.",
         "Very cool movie. \"The Girl\" (2009) should be required viewing for all film and video production students. Each shot is a creative tapestry of composition, light, and shadow. Fredrick Edfeldt's acting-for-the camera direction is inspired and Blanca Engstrom gives the perfect nuanced and underplayed performance needed to match the pace and tone of his film. But the real star of this remarkable film is Swiss cinematographer Hoyte Van Hoytema, who has since been the Director of Photography for \"Interstellar\" (2014). The film is worth a second watch just to appreciate each carefully composed shot. I've never seen anyone do it better, even breaking the 180 rule several times in the service of underscoring the girl's increasingly disoriented drift from reality. It is not an entirely original story. There are many of the creepy elements from \"Tideland\" (2005) and some from \"The Little Girl Who Lives Down the Lane\" (1976), but \"The Girl\" is much more naturalistic and gentle than those two films. It could also be considered a placid \"Alice In Wonderland\", subtly off-kilter with Louis Carroll's illogic replaced by the mundane but equally disturbing logic of the modern adult world. Then again, what do I know? I'm only a child.",
         "While probably not the worst film about childhood ever made as one poster said..I agree that just a quasi cinema-verite style is not enough to make a person become emotionally connected to the film. Parts of the film, especially when she hangs with the young boy reminded me of \"My Girl\" , but without the humor or pathos... Among many other stronger serious films about children abandoned and feigning for themselves...watch \"Forbidden Games\" ..or the more contemporary film, \"Nobody Knows\" (Japan-2004) And the list goes on... There are too many films that portray abandonment issues of childhood better. While a pretty film with an attractive (in a child-like sense) heroine, this film will be ultimately forgettable. The director avoids any serious issues and presents an almost idyllic childhood experience, which never actually gives the viewer the dynamic tension needed to make this a memorable film experience. Spoilers: The only thing near to a sense of peril or endangerment (and the examples are really not even that) in the film is the taunting and stripping of the boy, and his unfortunate fall in the barn. Even then, the boy is just momentarily embarrassed, and recovers from the fall with no more than a broken leg or ankle. I kept waiting for a punch line that never came. The obnoxious neighbor teen and her friend didn't go anywhere, and I half expected the neighbor father when in the house alone with the girl (esp. while she was taking a bath) to allude to maybe a more malevolent outcome. but no...the girl just bounces from one scene to another seemingly without a care in the world. I DO understand that themes may be quietly understated and the main theme of the film was the girl's transition from pure child into the world of adulthood (symbolized by the tadpole turning into an adult frog and escaping its confinement) But did the film have to do it is such a ho-hum way? While some will call this a \"slice of life\" film...It is more a slice of stale Wonder Bread."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Acne Film",
         "Film i Väst"
      ],
      "summaries": ["Story of a nine-and-a-half year old girl left alone in Sweden while her family is in Africa during the summer of 1981."],
      "budget": 0
   },
   "movielensId": 111115,
   "movielens": {
      "languages": ["svenska"],
      "releaseDate": "2009-02-10",
      "dvdReleaseDate": "2010-11-30",
      "directors": ["Fredrik Edfeldt"],
      "runtime": 95,
      "movieId": 111115,
      "title": "The Girl",
      "mpaa": "",
      "actors": [
         "Blanca Engström",
         "Shanti Roney",
         "Annika Hallin",
         "Leif Andrée",
         "Calle Lindqvist",
         "Tova Magnusson",
         "Maria Langhammer"
      ],
      "imdbMovieId": "1342378",
      "originalTitle": "Flickan",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["kG6VWHnDAxI"],
      "plotSummary": "Story of a ten-year-old girl left alone in her house in the summer of 1981.",
      "tmdbMovieId": 33091,
      "avgRating": 3.34615,
      "releaseYear": "2009",
      "numRatings": 13,
      "posterPath": "/3HG7gAfYHBWvdmNWrmYmoxcNPJZ.jpg"
   }
}