{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "motor sport",
            "id": 9571
         },
         {
            "name": "motorcycle",
            "id": 14735
         }
      ],
      "imdb_id": "tt0065989",
      "video": false,
      "title": "Little Fauss and Big Halsy",
      "recommendations": [],
      "backdrop_path": "/is1jXJyRXvF1FD8rfHkd09tenxy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Big Halsy",
               "gender": 2,
               "credit_id": "52fe4699c3a36847f81079c5",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Little Fauss",
               "gender": 2,
               "credit_id": "52fe4699c3a36847f81079c9",
               "name": "Michael J. Pollard",
               "profile_path": "/pZzGaBrDi27Ve7X4BCzslgt2mZi.jpg",
               "id": 6451,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rita Nebraska",
               "gender": 1,
               "credit_id": "52fe4699c3a36847f81079cd",
               "name": "Lauren Hutton",
               "profile_path": "/kYJFTG1On90T9eLJZ0pE56LC781.jpg",
               "id": 27964,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Seally Fauss (as Noah Beery)",
               "gender": 2,
               "credit_id": "52fe4699c3a36847f81079dd",
               "name": "Noah Beery, Jr.",
               "profile_path": "/dgKPU1Vbq0UiwkT2UyCicpbPEMf.jpg",
               "id": 30297,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "'Mom' Fauss",
               "gender": 1,
               "credit_id": "52fe4699c3a36847f81079e1",
               "name": "Lucille Benson",
               "profile_path": "/rgf9wB5Q3XrZoeO11tuf6NkGMk8.jpg",
               "id": 12430,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4699c3a36847f81079d3",
               "name": "Sidney J. Furie",
               "profile_path": "/mGzfybmbXz06h5aUxW3frPtvaLH.jpg",
               "id": 64508,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4699c3a36847f81079d9",
               "name": "Charles Eastman",
               "profile_path": null,
               "id": 131311,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.11912,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44721,
      "vote_count": 8,
      "budget": 0,
      "overview": "A comedy/drama about an unlikely pair who share a passion for motocross. Robert Redford is the womanising but shallow star while in the end the unlikely Little Faus (Micheal J.Pollard) shows that depth can count.",
      "similar": [
         61979,
         9659,
         71676,
         5925,
         2503,
         18487,
         97367,
         36648,
         20526,
         2252,
         1948,
         681,
         699,
         714,
         260514,
         238636,
         82690,
         109689,
         9718,
         1885
      ],
      "original_title": "Little Fauss and Big Halsy",
      "runtime": 99,
      "poster_path": "/fm0uhbKy4dYr2CdpU6qk8S7zxtq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Furie Productions",
            "id": 14111,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alfran Productions",
            "id": 10211,
            "origin_country": ""
         }
      ],
      "release_date": "1970-10-21",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Little Fauss and Big Halsy are not your father's heroes",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney J. Furie"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Charles Eastman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0065989/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3Nzc4NDgxNV5BMl5BanBnXkFtZTYwMDY0Nzg5._V1_.jpg",
      "actors": ["Stars: Robert Redford, Michael J. Pollard, Lauren Hutton | See full cast and crew »"],
      "reviews": [
         "ROBERT REDFORD plays 'hunk' Halsy Knox, who demands and receives everything he desires except his self-respect. A God-given talent at motocross racing becomes his albatross in his quest to achieve what he believes is his destiny. Along the way are numerous characters of this hobby/religion's entourage including a gear-head named 'Little' (MICHAEL J. POLLARD). They all accommodate his every whim based on his good looks, charm and 'somewhat winning' first impression. It's not until later that an observant witness realizes that he has been duped by a 'con-man without a con' in Halsy's mission to nowhere. Lots of motorcycle racing action and 60's introspective brings this one up to cult status. Redford is absolutely gorgeous in his appearance/role as a cad. Seems one-half the film has him bare chested! A goodly amount of nudity abounds (full-frontal LAUREN HUTTON, etc.) and if '70's film-liberalism disturbs you then I recommend Olsen twins films. A GREAT soundtrack with songs by JOHNNY CASH and the TENNESSEE THREE, & CARL PERKINS! Some of the music was written by BOB Dylan. Filmed on location in Antelope Valley, Ca, Sonoma County, Ca and Sears Point Raceway in San Francisco. Postscript: \"I have seen this film about ten times now and it ALWAYS leaves me thinking about it for days. RR chews up the scenery and gives a bravura performance as Halsy as he stretches his interpretation of the cad to subtle brilliance!\"",
         "I like Redford as an actor and he made this film before he started polishing his image and playing it safe. To hear this film is one of his least favorites, I suggest he should sit down and screen INDECENT PROPOSAL, SNEAKERS, that terrible thing with Debra Winger and Darryl Hannah, the almost unwatchable THE CASTLE, and the cure for insomnia, LIONS FOR LAMBS. Redford's Halsy Knox is like the male version of the shallow pretty girl who skates by on looks, charm, and minimal talent. And he plays it to the hilt with great effect. Pollard is the perfect counterpoint and it's fun to watch how Redford's character keeps reeling back in despite betraying him on all levels. This film belongs in the same group as DOWNHILL RACER, THE CANDIDATE, and TELL THEM WILLIE BOY IS HERE - all good, if not big box office movies.",
         "If you've ever been on a motorcycle racing circuit or been around other real life circuits with those of the egotistical boaster class, you will love this movie. On both the motorcycle racing circuit and in business, I've met Halsey Knox; well, not really but a true to life, full blown, likeness thereof. Having not really been a fan of motorcycle racing, but a fan of the scene, I immediately can identify with those of the \"Halsey\" genre, who not only know everything and been everywhere, but are the best and foremost authority on nearly every subject, let alone get all the women and nearly always screw up everyone's life around them by capturing the heart mind and soul of the unsuspecting and then \"use\" that person for what can be accomplished for the host. Robert Redford plays the part like a pro. And poor unsuspecting Little Fauss is literally taken by the style and non-chalaunt attitude of Halsey. The two team up and when Fauss finally wakes up to the reality of being used by a bluffer and boaster, he finds the nerve to move on and locate success on his own. Definitely a classic and no wonder Robert Redford didn't like the part, after all who wants to be seen as a loser with an egotistical \"know it all\" attitude, except of course for the part where he \"gets all the women\" :o)",
         "As a 17 year old Arizona motorcycle racer, I had the privilege of working as an extra/ stuntman on the racing scenes in this movie, so I'm somewhat biased about the quality of this feature. It IS schmaltzy and VERY early 70s in its content and cinematography, but it paints a GREAT picture of what it was like to race motorcycles in the early days of American motor sports (back when no one but the Europeans EVER won anything!). Before Supercross, before motor sport superheroes when us folks that rode motorcycles were known as LESS than desirable, and no one ever called us athletes. So, from a historical perspective, or just to see ME as a 17 year old tearing around a couple dirt tracks and out on a desert run aboard a hot Yamaha, I feel this movie can't be beat. It'll never take the place of such greats as On Any Sunday or On Any Sunday 2, but it's still a worthwhile 99 minutes of lighthearted flashbacks for anyone that lived through those times, or those that wish they had. Oh, and Robert Redford wasn't too bad either... John in AZ",
         "This was a great movie if you were a kid growing up around motorcycle racing. I was just 14 when this movie came out. I went to the theater to see it because I had heard it was about motorcycle racing. It was great! It captured the eccentric attitude of racers in general and was really very accurate as to the characters one could find in AMA racing. \"On Any Sunday\"! We would trailer our bikes all over the northeast to any race we could find. Enduros, motocross, flat-track, scrambles... whatever was going on, we'd go! Change tires, fenders, or what ever we needed to do to the bikes and take off. Great movie and great times! when you were involved with the racing scene, you got to know the other regulars that would show up at the various races and there were the personalities found in the movie. Every one knew a Halsey! Most of us were more Fauss, however. we were more interested in riding and tuning than partying and chasing skirts! This movie is one of the only movies I actually searched for and purchased just so I would have it as the years go by.",
         "Robert Redford and Michael J, Pollard give good performances in this character study of two opposites who form an alliance as motorcycle racers down South, Lauren Hutton is the girl who comes between them. Nothing great, but watchable, and a rare chance to see Redford as a heavy.",
         "I too was growing up in the 60's and 70's (still growing) and remember this particular movie with a certain fondness. Mainly for the motorcycles and characters portrayed in it. All of us know Little and Halsy in some form or other...I don't usually go to all the trouble of trying to dig up old stuff. Normally, you can find most of the old movies you need at any number of sources. However, this film is proving very difficult to find. Personally, I liked the movie and have been looking for a copy for years. Generally, I don't look for mind expanding symbolism or intelligence in any movie, I'm just satisfied with the entertainment factor...If anyone has a copy out there, let me know if you would like to sell it...",
         "Around six weeks ago or so,a friend of mine gave me a very interesting challenge,which was to try and hunt down four very rare films that he had been searching after for a good while.Whilst three of the titles seem like ones that I'll have to do a little bit more searching for,I was surprised,when I decided to have a quick search round on Ebay,and I found that this pretty entertaining Grindhouse drama (with Robert Redford!)was being sold on an auction that was about to end in 5 minutes. The plot: Taking part in one of his first dirt bike races,Little Fauss meets dirt bike playboy Big Halsy,whose footsteps he would secretly like to follow in,thanks to Halsy always having a girl on his arm and a winning smile on his face.Despite his parents voicing their concerns over him hanging out with an \"outlaw\",Fauss agrees to a plan which will hopefully make him and Halsy very rich,with him serving as Halsy's mechanic and Halsy impersonating Fauss by wearing his biker costume. Although things at first go smoothly for the both of them,Little Fauss starts to develop some feelings for Halsy's latest girlfriend. View on the film: As the first credits appeared on the film,I was thrilled to hear Johnny Cash deliver a toe-tapping tune that was specially written for this very fun film.For the dirt bike scenes,director Sidney J. Furie (who has also directed the under rated British Horror Doctor Bloods Coffin) gives them a good amount of dirt and sand,which gives the scenes a low budget rawness. Whilst the first half of this very entertaining Grindhouse film mostly focuses on the bike races,the second half suddenly turns into a really great Road Movie,and although the change of gears in the films style is pretty abrupt,the performances from Robert Redford and Michael J. Pollard make sure that the film never stops being fun.For his performance,Robert Redford shows a wonderful amount of charm playing Halsy,as Fauss and Halsy's latest girlfriend are initially left dazzled by his charisma. With Redford playing the outlaw,Pollard cleverly shows the nervousness that Fauss at first experiences when he enters the \"outside\" world,which Pollard shows slowly changes,from Fauss being an admire of the way Halsy lives his life,to him almost not being able to stand the very site of him.",
         "Saw this in the drive-in back in '71 and thought it was pretty good! Saw it again on Speedvisions \"Lost Drive-in\" some time ago but some of the scenes were \"edited for TV\". I don't believe it was ever released on video...too bad!",
         "\"Little Fauss and Big Halsy\" qualifies as an allegorical work of sheer genius. \"Ipcress File\" director Sidney J. Furie and \"All-American Boy\" scenarist George Eastman appropriate the animal fable about the tortoise and the hare. Cocksure, extroverted, ladies man Halsy Knox (Robert Redford of \"The Sting\") is the hare and shy, bespectacled, introvert Little Fauss (Michael J. Pollard of \"Bonnie & Clyde\") is the tortoise. Together, they make a memorable pair of opposites who hit the road on the motorcycle dirt bike circuit. Ironically, neither Redford nor Pollard liked each other. \"Little Fauss and Big Halsy\" essentially is a story about losers, but each of them is a genuine character. The scenic, sun-blasted, settings are atmospheric and the cast convincing, especially Lauren Hutton and her Lady Godiva act. Little and Halsy hate each other, and they refuse to believe that they need each other. Noah Beery Jr. is splendid as Pollard's father who has nothing but contempt for Halsy. The Johnny Cash songs are fantastic as is Carl Perkins' jukebox tune about a woman used and abused. Recently, I located a full-frame bootleg copy of this public domain classic. The scene near the beginning when Halsy nonchalantly strolls obliviously across the race track as scores of bikers narrowly avoid hitting him is terrific. This movie is so neat and symbolic that it serves as a commentary on mankind. Redford delivers a spectacular performance and looks a Cosmo centerfold boy. He spends half of his time stripped to the waist with sunglasses and looking virile. This is the kind of movie that looks tailored made for Burt Reynolds, except the Eastman script teems with interesting characters rather that broad comedy. \"Little Fauss and Big Halsy\" is probably Redford's most stylist performance since \"Butch Cassidty.\""
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Alfran Productions",
         "Furie Productions",
         "Paramount Pictures"
      ],
      "summaries": ["A story of two motorcycle racers, the inept, unsuspecting Little Faus (Micheal J.Pollard) and the opportunistic, womanizing Halsey Knox (Redford)"],
      "budget": 0
   },
   "movielensId": 111105,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1970-10-21",
      "dvdReleaseDate": null,
      "directors": ["Sidney J. Furie"],
      "runtime": 99,
      "movieId": 111105,
      "title": "Little Fauss and Big Halsy",
      "mpaa": "",
      "actors": [
         "Robert Redford",
         "Michael J. Pollard",
         "Lauren Hutton",
         "Noah Beery",
         " Jr.",
         "Lucille Benson"
      ],
      "imdbMovieId": "0065989",
      "originalTitle": "Little Fauss and Big Halsy",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["Sn1AMf7j9cM"],
      "plotSummary": "A comedy/drama about an unlikely pair who share a passion for motocross. Robert Redford is the womanising but shallow star while in the end the unlikely Little Faus (Micheal J.Pollard) shows that depth can count.",
      "tmdbMovieId": 44721,
      "avgRating": 3.1,
      "releaseYear": "1970",
      "numRatings": 5,
      "posterPath": "/f82F3yzBvyy9PJVEETd02GMlFVU.jpg"
   }
}