{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "strike",
         "id": 4112
      }],
      "imdb_id": "tt0084843",
      "video": false,
      "title": "Une Chambre en Ville",
      "recommendations": [
         88395,
         107295,
         66473,
         87202,
         128401,
         78078,
         39318,
         43892,
         28360,
         159673,
         49863,
         40575,
         173747,
         53516,
         72368,
         322603,
         81443,
         51470,
         43898,
         53405
      ],
      "backdrop_path": "/btkBECVK3zWimoYvi3XfNIBe5sP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Édith",
               "gender": 1,
               "credit_id": "52fe43b7c3a36847f806a223",
               "name": "Dominique Sanda",
               "profile_path": "/qNLSPZshmNb5j63iCwiKLd10JPI.jpg",
               "id": 24590,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "François Guilbaud",
               "gender": 2,
               "credit_id": "52fe43b7c3a36847f806a227",
               "name": "Richard Berry",
               "profile_path": "/5StfjUYCE89Jpi4qjALDguXl3CQ.jpg",
               "id": 35896,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Edmond Leroyer",
               "gender": 2,
               "credit_id": "52fe43b7c3a36847f806a22b",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Violette Pelletier",
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a22f",
               "name": "Fabienne Guyon",
               "profile_path": null,
               "id": 35897,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Madame Pelletier",
               "gender": 1,
               "credit_id": "52fe43b7c3a36847f806a233",
               "name": "Anna Gaylor",
               "profile_path": "/pvbhwxXzFYqc5fNfGGv4jqiLTJm.jpg",
               "id": 34989,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Dambiel",
               "gender": 2,
               "credit_id": "52fe43b7c3a36847f806a237",
               "name": "Jean-François Stévenin",
               "profile_path": "/82NUI5wvm0viU6U9PzGyRNLlnk5.jpg",
               "id": 6304,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Margot Langlois",
               "gender": 1,
               "credit_id": "52fe43b7c3a36847f806a253",
               "name": "Danielle Darrieux",
               "profile_path": "/4o6Wjfx4ahEr1ldLLZ0aEF3OTkP.jpg",
               "id": 236016,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a20d",
               "name": "Jacques Demy",
               "profile_path": "/7f4Rg6B6HXM8gybOVVLWKYK2Bqw.jpg",
               "id": 24882,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b7c3a36847f806a213",
               "name": "Michel Colombier",
               "profile_path": null,
               "id": 35838,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a219",
               "name": "Jean Penzer",
               "profile_path": null,
               "id": 34907,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a21f",
               "name": "Jacques Demy",
               "profile_path": "/7f4Rg6B6HXM8gybOVVLWKYK2Bqw.jpg",
               "id": 24882,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a23d",
               "name": "Christine Gouze-Rénal",
               "profile_path": null,
               "id": 36517,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a243",
               "name": "Bernard Evein",
               "profile_path": null,
               "id": 24296,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a249",
               "name": "Rosalie Varda",
               "profile_path": null,
               "id": 36518,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b7c3a36847f806a24f",
               "name": "Gérard Lamps",
               "profile_path": null,
               "id": 28686,
               "department": "Sound",
               "job": "Sound Engineer"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.470976,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 4269,
      "vote_count": 12,
      "budget": 0,
      "overview": "Set against the backdrop of an increasingly violent strike, a worker falls in love with the middle-class daughter of his landlady.",
      "similar": [
         83995,
         21612,
         4553,
         424,
         3082,
         252,
         783,
         51092,
         274479,
         101299,
         16,
         71,
         36801,
         9828,
         10393,
         56780,
         148,
         16367,
         26638,
         10410
      ],
      "original_title": "Une Chambre en Ville",
      "runtime": 90,
      "poster_path": "/dMVZhgTR7eHU06PztskevR6tKpF.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Progefi",
         "id": 1613,
         "origin_country": ""
      }],
      "release_date": "1982-10-27",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jacques Demy"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Jacques Demy"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0084843/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NzA5OTM2NV5BMl5BanBnXkFtZTYwNDU2Mjg5._V1_.jpg",
      "actors": ["Stars: Dominique Sanda, Danielle Darrieux, Richard Berry | See full cast and crew »"],
      "reviews": [
         "'Une chambre en ville' was thoroughly underrated from the start. In 1982 audiences no longer favoured tragic movies. BUT WHY? A generation earlier television had strongly reduced the audience of the cinemas. But television had NOT changed the taste. Video had a more profound influence. Take a standard situation. A group is watching a video which may evoke strong emotions in some of the spectators. Suddenly another catches the remote control, rewinds the movie and makes some comment (e.g., 'Girls should never have such a coiffure'). Repeated exposure to experiences of this kind may reduce the capacity for becoming emotionally aroused by movies. - Note that this is a recent development. It is easy to assemble a list of 100 very tragic movies produced 1935-1965, which at that time were highly appreciated by the average film-goer. I am even convinced that the average film-goer of this period would have loved contemporary movies such as 'Stormy Weather' (by Solveig Anspach) and 'Les diables' (by Christophe Ruggia). If your aim is not emotional experience, you are likely to be disappointed by 'Une chambre en ville', despite its excellent merits. But please note that my review is one-sided and might be misleading. I intend to say much about the music, and shall reduce all other aspects to the bare minimum. What is the plot? Workers are striking. During a demonstration one of them (Francois) is shot by the police. He dies in the arms of his beloved (Edith). But only one day earlier he had abandoned his pregnant girlfriend (Violette), because he had met a very beautiful over-class girl. Francois and Edith were immediately overwhelmed by genuine and reciprocal passion. Even among film musicals it is infrequent that every line is sung. Hence, it is natural to compare 'Une chambre en ville' with 'Les parapluis de Chèrbourg'. Jacques Demy directed both. But different composers (Michel Colombier and Michel Legrand) wrote the music. I think both got the manuscript most suitable for their specific talent. The music of 'Une chambre' differs from that of 'Les parapluis' foremost in three respects. Without ceasing to be real film music, it is more introverted, and it is closer to opera music. But the largest difference is the director's relation to the singers. Whenever two persons sing simultaneously in 'Les parapluis', you can clearly perceive the words of each. Also, simultaneous singing never transgresses the kind of dialogues that may be found in purely spoken theatre. By contrast, 'Une chambre' contains a real duet: the loving couple sings the same text together in parallel sixths; a device clearly borrowed from the opera. - - - To avoid misunderstanding as regards my next point: numerous great composers have borrowed melodies or other things from each other. Borrowing is not a fault if the borrowed thing is used for new purposes. Since 'Une chambre' finishes with a love scene in which one of the couple dies, it is not far-fetched to associate to Wagner's 'Tristan and Isolde'. During the final scene of the movie the main musical theme is presented for the fourth time, and this time with new accompanying melodies played by the orchestra. Rightly or wrongly, I think that these melodies are to some extent inspired by Wagner's opera (bar 63-73 of the overture). Any competent musical conductor would tell the singers to take some impression of the mood of the text. But the soundtrack of 'Les parapluis' never differs much from a neutral performance. Hence, it is hardly possible to decide whether or not Jacques Demy actually directed the singers before the soundtrack was made. But in 'Une chambre' it could hardly be more manifest that Demy has devoted as much direction to the singers as to the actors seen on the screen. From Violette's singing voice alone, no one could mistake her distress when Francois abandons her, and her feeling of being treated unjust when Francois tries to excuse his behaviour. - - - Suppose you do not understand French, and that you are listening to the soundtracks of both movies without seeing the pictures. You will nevertheless have a fair chance of correctly perceiving the emotions of many scenes of 'Une chambre'. You will be much less successful with 'Les parapluis'.",
         "Could be a sequence, although dealing with a different story, to Jacques Demy's Les Parapluies de Cherbourg. All the dialogues are sung by the excellent vocal team gathered once more by the director (see also Les Demoiselles de Rochefort, Peau d'Ane). Musical style this time completely different, by competent Michel Colombier, provides fluent and dramatic tension all over. Who is going to make such well-finished films from now on?",
         "Like \"Les Parapluies de Cherbourg\" a wholly sung opera and like \"Lola\" wholly set in Jacques Demy's native city of Nantes, even using several shots of that palatial shopping arcade again. For much of the time, however, the camera gives us a proletarian Nantes of graffiti-scarred back alleys, barricaded works whose employees are out on strike and squares full of detritus. No prettily painted streets emptied of people and cars, but a working town full of tension, shot in sombre tones often tinged with blue. Twice we see riot cops who after breaking into fierce song break up demonstrations with batons and gas, leaving victims behind. One fatality is the chief protagonist, the shipyard fitter and toolmaker François (Richard Berry) whose room gives the film its title. On the street where this occurs we see at the top the cathedral and at the foot the prefecture. One a symbol of ebbing church power, for this drama shows few signs of Catholic faith or morals, and the other standing for state power, incarnated in the lines of identical armoured police decanted from identical vans with menacing sirens. As well as the brooding corporate violence of police and unionists, individuals flare into moments of savagery. Edmond (Michel Piccoli), the erratic owner of the TV shop, after applying a hot soldering iron to his wayward wife Édith (Dominique Sanda), threatens first his innocent mother-in-law Madame Langlois (Danièle Darrieux) and then his wife with a razor, before finally and fatally using it on himself. The unbalanced wife draws a pistol on him and later uses it on herself. Madame Langlois, François' landlady, favours the strikers but not violence and instead stays sozzled throughout. A dark tale, with only occasional flashes of love to penetrate the blackness. Violette (Fabienne Guyon), the teenage shopgirl François makes pregnant and abandons, has the unconditional love of her mother (Anna Gaylor), while François has unquestioning support from his loyal workmate (Jean-François Stévenin). As for the fierce love that suddenly erupts between François and Édith after she picks him up in the street by opening her coat, this seems more operatic than real, a grand passion unlikely to survive the cold light of many dawns. Top acting honours go to the two leading ladies. As Madame Langlois, the widow of a colonel and daughter of a baron who never leaves her elegant flat, Danièle Darrieux exhibits immense presence in the face of many challenges but is never far from her bottle of chilled white wine and sometimes, so silly of me, knocking over a footstool. Outperforming her, and at the peak of her womanly beauty, Dominique Sanda plays her daughter Édith as an over-the-top character who for almost all of the film is wearing either a fur coat with nothing under it or just nothing. As mother-daughter relationships go, this one may amuse at times but underneath carries many layers of pain. Michel Piccoli is even further over the top as Édith's husband, voluntarily immured in his shop and unable to satisfy the rampant sexuality of his wife, who has turned to part-time prostitution for kicks. The singing, a continuous récitative without arias that is mostly dubbed, is made deliberately unshowy, as are the unsustained melodies by Michel Colombier and the unpoetic lyrics by Demy himself. All done with care to keep music and words unobtrusive, so that they complement the images rather than overpower them, fit the place and theme, illuminate the feelings of the characters and move the plot along. Set in the year 1955, when Demy was in his early twenties, the look and the artefacts of the time seem perfectly chosen. Even the taunting chant of the strikers \"police, milice\" is redolent of the era, comparing the republic's admittedly tough cops to the hated fascist paramilitaries of the Vichy régime abolished only eleven years earlier. Everybody who has loved \"Lola\", \"Les Parapluies de Cherbourg\" or \"Les Demoiselles de Rochefort\" should see this film immediately. Everybody else should be aware that it is opera sung to lyrics where, as soon as you adapt to the magical way of marrying song and image to convey emotions and enrich the narrative, you will be hooked. Underneath the sometimes gritty surface is the skeleton of a fairy tale, the sort of story Demy loved which speaks to something deep in humans.",
         "Nantes 1955, is the setting for this rarely seen film by Jacques Demy, one of French directors most influenced by the American musicals of his youth. This film followed two other innovative films by M. Demy, \"The Umbrellas of Cherbourg\" and \"The Young Girls of Rochefort\", both surprising creations of a man who understood how to combine drama and music with good results. On this picture, M. Demy had a new collaborator, Michel Colombier, a talented musician on his own. Michel Legrand, the composer of the two previous efforts, was not involved in this project, which could have used some of his wit and clear precision with the music of the production. It is nevertheless, a worthy try to combine all the elements behind the drama into a musical that was a departure from his first ventures into this artistic form. At heart, the film has all the elements to; make a statement of the conditions of the metal workers on strike and a domestic drama. Edith, a young married woman, trapped in a loveless marriage sees no way out of her situation. She resorts to picking up men as she roams the streets of Nantes naked under her fur coat. Francois Guilbaud, a striking metal worker, has found a room in the apartment of Margot Langlois an impoverished noblewoman with a drinking problem. Francois has been seeing Violette, a sales lady for the local department store. She is hopeful Francois will marry her as she finds their romance has left her pregnant. It is at this time Edith meets Francois during her nocturnal walk. It is clear to see why Edith falls for the handsome Francois, a sharp contrast with her jealous husband, Edmond Leroyer. The drama is complicated as all the elements in the tragedy converge toward a climactic finale. Dominique Sanda, at the height of her beauty, is marvelous as Edith. A young Richard Berry plays Francois with conviction. Danielle Darrieux, an exquisite classic actress, surprises with her role of Mme. Langlois. Michel Piccoli wearing a hideous reddish wig has some good moments as Edmond, the man who feels betrayed by the younger woman he married. Fabienne Guyon appears as Violette.",
         "Jacques Demy's Une chambre en ville (1982) is the very first film of the Musical genre that I've EVER viewed, and that's really saying a lot because I've literally viewed hundreds of films over the years, of many different types. It's not at all that I consciously tried to avoid musicals in any way. I guess that, somehow, I just never encountered one before. That said, I really didn't care for this film at all. I just had to turn it off after the first twenty minutes. My dislike, however, is not per se because Une chambre en ville is a musical, but more because of what type of musical it is. This film can perhaps best be called a Cinematic Opera, because literally every line spoken by the characters is a sung lyric from a song. Overall, I found that just to be very annoying, and even somewhat unbearable. Also, that every line of dialogue is sung gave the film a somewhat pretentious appearance, and truly blunted the drama of the storyline, at least in my opinion. I would, accordingly, feel compelled to classify it's artistic style as Unrealism of some sort, because, in the real world, people just don't sing their way through life. It's a shame too, because the storyline itself looked interesting, and could have amounted to a fairly decent dramatic production, of the storytelling type, had the musical element of the film been absent. I am certain that I would enjoy a film of the Musical genre much more where the dialogue was primarily just plainly spoken, but the storyline was strategically punctuated by musical interludes. I'm not saying at all that Une chambre en ville (1982) is a bad film in any way. The cinematography is great. The acting is actually pretty good. The storyline, as much of it that I saw, seemed fairly well developed. The music itself, absent the cinematic and dramatic context was not bad at all. It simply just boils down to the fact, I guess, that cinematic operas are just \"not my cup of tea\".",
         "Workers during a strike prepare and perform a demonstration, and two personal relations develop against this background. François (Richard Berry) abandons his pregnant girlfriend Violette (Fabienne Guyon, appropriately dressed in violet), and meets a very beautiful upper class girl, Edith (Dominique Sanda). This was my first experience with Jacques Demy, and I was immediately smitten. The backdrop recalls something like \"Les Miserables\", based on Demy's own witnessing of a shipyard strike, though the focus here is much more on the love triangle, and Francois Guilbard is not the tragic character that Jean Valjean is (in fact, Francois is kind of a rat). Musicals are not my favorite genre, but I think this was done right... every line sounds amazing, and it works to have it done without any speaking. The dark themes even hark back to classic operas more than the saccharine musicals of modern Hollywood. Where the plot may be less than perfect, it is made up for by the mere presence of such striking and talented actors. Unfortunately for Demy, many consider his best years 1961-1967, with the exception of \"Donkey Skin\" (1970) and completely disregard this film. Despite being nominated for nine Cesars (basically the French Oscars), it won none of them.",
         "Despite a reasonably varied output Jacques Demy is destined to be remembered by film buffs as the onlie begetter of The Umbrellas of Cherbourg and by admirers of Cole Porter, Larry Hart, Frank Loesser, Johnny Mercer etc as the William MacGonigall of lyricists, indeed Demy established something of a record in the number of banal lyrics he has committed to celluloid. Defenders will argue that in creating 'sung-through' musicals he was not looking for extractable hit songs (though in English translations two did emerge from Cherbourg). That first musical was bittersweet albeit brightly lit whereas this last entry is much more dark as reflected in the sombre reds and blues. Set against a strike it all ends in tears but along the way Danielle Darrieux, and Richard Berry weigh in with some fine work. Definitely watchable."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Progéfi",
         "TF1 Films Production",
         "Union Générale Cinématographique (UGC)"
      ],
      "summaries": ["A film musical in which every line is sung. The frame is about workers during a strike. They also prepare and perform a demonstration. Two personal relations develop against this background. François abandons his pregnant girlfriend Violette. She feels treated even more unjust when he tries to defend and excuse his behaviour. He had met a very beautiful over-class girl, Edith, and both were immediately overwhelmed by genuine and reciprocal passion. Edith lived in a very unsatisfactory marriage. She was the daughter of the widow from which François rented his room. Nevertheless, he met her in the street, where she just opened her fur coat and was starch naked under it. They will be together in great passion for just one night and day. At the demonstration François is shot by the police and dies in Edith's arms. - The music is closer to opera than in any other film musical by Jacques Demy. But the greatest difference is that he has devoted much more effort to the task of instructing the singers to reveal the psychic emotions of the text and events."],
      "budget": 0
   },
   "movielensId": 111407,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1982-10-27",
      "dvdReleaseDate": null,
      "directors": ["Jacques Demy"],
      "runtime": 90,
      "movieId": 111407,
      "title": "Une Chambre en Ville",
      "mpaa": "",
      "actors": [
         "Dominique Sanda",
         "Richard Berry",
         "Michel Piccoli",
         "Fabienne Guyon",
         "Anna Gaylor",
         "Jean-François Stévenin",
         "Danielle Darrieux"
      ],
      "imdbMovieId": "0084843",
      "originalTitle": "Une Chambre en Ville",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set against the backdrop of an increasingly violent strike, a worker falls in love with the middle-class daughter of his landlady.",
      "tmdbMovieId": 4269,
      "avgRating": 2.6,
      "releaseYear": "1982",
      "numRatings": 5,
      "posterPath": "/dMVZhgTR7eHU06PztskevR6tKpF.jpg"
   }
}