{
   "tmdb": {
      "original_language": "bn",
      "keywords": [],
      "imdb_id": "tt0087328",
      "video": false,
      "title": "The Home and the World",
      "recommendations": [],
      "backdrop_path": "/ppaTG0AUaEmW5MnhNNTdcQ8nZVM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Sandip Mukherjee (as Soumitra Chattopadhyay)",
               "gender": 2,
               "credit_id": "5728fd2092514172d80001f6",
               "name": "Soumitra Chatterjee",
               "profile_path": "/dUTWBl9fgzi2RuTNRYqImCUOf36.jpg",
               "id": 13752,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Nikhilesh Choudhury",
               "gender": 2,
               "credit_id": "5728fd2892514172d10001fd",
               "name": "Victor Banerjee",
               "profile_path": "/s19NsocK35S7RFs1vuS61tK3dET.jpg",
               "id": 78951,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Bimala Choudhury (as Swatilekha Chattopadhyay)",
               "gender": 1,
               "credit_id": "5728fd3292514172c300023d",
               "name": "Swatilekha Sengupta",
               "profile_path": "/cwhHmUdBaxjMxFW0UbBAQTY8JZH.jpg",
               "id": 1614828,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "The sister-in-law",
               "gender": 1,
               "credit_id": "5728fd3cc3a36815b8000247",
               "name": "Gopa Aich",
               "profile_path": "/7XxVfjSDUTWBtN2iKZtoksj9JcF.jpg",
               "id": 1614830,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Miss Gilby (as Jennifer Kapoor)",
               "gender": 1,
               "credit_id": "5728fd4ac3a36815a4000266",
               "name": "Jennifer Kendal",
               "profile_path": "/vzfZ9BOh7CeMBV74vZlC7JeblIf.jpg",
               "id": 1013092,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Headmaster",
               "gender": 2,
               "credit_id": "5728fd52c3a36815a7000248",
               "name": "Manoj Mitra",
               "profile_path": "/kxpSjqUMPnsY6BwGMmGQIgRtXUr.jpg",
               "id": 1614831,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Kulada (as Bimal Chattopadhyay)",
               "gender": 0,
               "credit_id": "5728fd5d92514172d4000218",
               "name": "Bimala Chatterjee",
               "profile_path": null,
               "id": 1614832,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Amulya",
               "gender": 0,
               "credit_id": "5728fd65c3a36815af000264",
               "name": "Indrapramit Roy",
               "profile_path": null,
               "id": 1614833,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ecc3a36847f80e25b1",
               "name": "Satyajit Ray",
               "profile_path": "/5OwiMtEHZGaTEnxr3lz9sNkHKro.jpg",
               "id": 12160,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5728fcc6c3a36815a7000234",
               "name": "Satyajit Ray",
               "profile_path": "/5OwiMtEHZGaTEnxr3lz9sNkHKro.jpg",
               "id": 12160,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5728fccd92514172ce000246",
               "name": "Rabindranath Tagore",
               "profile_path": "/6vS2zz3GlPktPh7iGSgkNca5GS0.jpg",
               "id": 1172911,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5728fcd792514172d80001ef",
               "name": "Satyajit Ray",
               "profile_path": "/5OwiMtEHZGaTEnxr3lz9sNkHKro.jpg",
               "id": 12160,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5728fcddc3a36815ac000281",
               "name": "Soumendu Roy",
               "profile_path": null,
               "id": 1100785,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5728fce5c3a36815a4000258",
               "name": "Dulal Dutta",
               "profile_path": null,
               "id": 12167,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5728fceec3a36815a700023a",
               "name": "Ashoke Bose",
               "profile_path": null,
               "id": 1274139,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.250634,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 42092,
      "vote_count": 3,
      "budget": 0,
      "overview": "When the movie opens, a woman is recalling the events that molded her perspective on the world. Years ago, her husband, a wealthy Western-educated landowner, challenged tradition by providing her with schooling, and inviting her out of the seclusion in which married women were kept, to the consternation of more conservative relatives. Meeting her husband's visiting friend from college, a leader of an economic rebellion against the British, she takes up his political cause, despite her husbands warnings. As the story progresses, the relationship between the woman and the visitor becomes more than platonic, and the political battles, pitting rich against poor and Hindu against Moslem, turn out not to be quite as simple as she had first thought.",
      "similar": [],
      "original_title": "Ghare-Baire",
      "runtime": 140,
      "poster_path": "/vEU1eKvWPzzdMAcwzXjsH69dKro.jpg",
      "spoken_languages": [{
         "name": "বাংলা",
         "iso_639_1": "bn"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "National Film Development Corporation of India (NFDC)",
         "id": 76348,
         "origin_country": ""
      }],
      "release_date": "1985-01-04",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Satyajit Ray"],
      "runtime": 140,
      "synopsis": null,
      "writers": [
         "Satyajit Ray",
         "Rabindranath Tagore"
      ],
      "originalLanguage": "Bengali",
      "imdbLink": "http://www.imdb.com/title/tt0087328/",
      "coverLink": null,
      "actors": ["Stars: Soumitra Chatterjee, Victor Banerjee, Swatilekha Sengupta | See full cast and crew »"],
      "reviews": [
         "The Home and The World is an excellent film by the great Bengali director Satyajit Ray. Based on a novel by Tagore, the drama focuses on the personal and political dilemmas faced by a wealthy Bengali woman in 1907 as her husband and his best friend vie for her affection and her political loyalties. Very few films successfully focus on the ethical complexities of social movement organizing (The Official Story, Matewan, and Mapantsula are rare exceptions; The Way We Were has some brilliant flashes along these lines, but then veers away from these themes all too quickly). We, the viewers, are initially drawn to the viewpoint of the charismatic political organizer, just as the protagonist is drawn to him and out of the restraints of traditional purdah. Far from painting the husband as a vile monster to revolt against, however, the husband encourages the increasing independence of the protagonist, and becomes the loving conscience of the film, even as it exposes the limitations of his apparent passivity. As the attraction between the protagonist and the organizer mounts, so does the tempo and the tension of the political struggles in the village. As the protagonist learns more and more about the world beyond the secluded part of her palatial home, we, the viewers, begin to understand more and more the complexity of the cross-cutting tensions between: England and India, modernism and tradition, Hindu and Muslim, rich and poor, men and women, leadership and rabble-rousing, means and ends, and love and infatuation. All this could have been ponderous or didactic, but it's decidedly not, and one of the wonders of the film is that the political issues are woven so deftly into the story of a believable unfolding love triangle. Most movies have a difficult time portraying any motivation for two characters to `fall' in love - this movie manages to portray changes in the relationships between all three main characters with such precision and intensity that I fully believed, and cared deeply, about each one. The acting is extraordinary, and the cinematography, as is usual in Ray's films, is breathtaking, subtly accentuating the movie's themes of liberation and loss, and the interplay between the two. Ray said his goal as a director was the same as Renoir's, to show that everyone has their reasons. As perhaps the most warmly compassionate of directors in all of world cinema, he succeeds brilliantly with this film.",
         "One doesn't expect anything other than excellence from the legendary Ray's work and 'Ghare Baire' (Home and the World) follows the same path. 'Based on the Nobel prize winner, Ranbindronath Tagore's novel, it focuses on the relationship of a woman with her husband and his best friend. Almost 10 years into her marriage, she is happy with her husband but craves for something more. Unlike many women of the time, her husband gives her complete freedom allowing her to live her life the way she wills. He himself is impressed by the British lifestyle and his his wife learn English. He's also very connected to his own Bengali route. Then enters his revolutionary and stubborn friend who is obsessed of having the country get rid of everything English. The husband and his friend have contradictory viewpoints. Yet, he welcomes his friend and never objects to his motivations, as long as he's within his limits. The wife is impressed and intrigued by his friend's political ambitions and is gradually drawn towards him (or he draws her towards him) until they embark in an affair and then the truth becomes more apparent...to everyone, but it's too late. Ray really takes his time to tell us the story, to let us get to know the characters and clearly display the relationships between them and explain the political situation. He does one hell of a job doing it. He shows the development of the wife's 'relationship' with the friend as her marriage becomes weaker while her husband is hauntingly passive yet trying to understand both his wife and his friend as he is the one who truly loves her and he tries to carry out his social obligations towards his people. We see that the wife learns more about the political dilemmas in the outside world but only from the friend's point of view. Then, as one reviewer, has pointed we are drawn into a web of dilemma's between England and India, modernism and tradition, Hindu and Muslim, rich and poor, men and women, leadership and rabble-rousing, greed and sacrifice, means and ends and love and infatuation. Master filmmaker that he is, Ray puts it all together in one of the most remarkable way that it does not deviate from the main plot. Ther performances are superb. Victor Bannerjee gives a very intense but subtle performance. In the end, one realizes that it is his character one feels most for. Contrastingly, though Soumitra Chatterjee is more vocal, he makes full use of his nonverbal language, hinting the character's deceitful intentions. Swatilekha Chatterjee plays a very difficult part with tremendous ease. She completely owns the role. Supporting cast are all very good. Ray also makes adequate use of the background score and the cinematography is wonderful. Watch for the camera angles and movement. Truly a mind-blowing film and I always thought that there aren't enough words that can do justice to describe the excellence of Ray's films. I've only made an attempt and I'm still far behind. Just watch it to see what I mean. Only those who appreciate real cinema will understand.",
         "Let me divide the discussion on the film into a few parts BACKGROUND AND ANECDOTES Ray had wanted to make a film out of this Tagore story for a long time, right from the 1960s but somehow the project kept getting delayed. Initially, Ray had casted Soumitra Chatterjee as Nikhil and wanted a young débutante to play the role of Sandip but later, in an example of inspired casting, he cast Soumitra as Sandip instead as he felt there was no one who could give the long, verbose speeches in chaste Bengali better than Soumitra (and Soumitra delivers as usual with a flawless performance but we'll come to that later). Victor Banerjee, who had earlier worked with Ray in Shatranj and Pikoo, made the grade as Nikhil THE PUBLIC OPINION ON THE FILM Even though Ghare Baire remains a strong Ray film, it does not enjoy the universal critical appreciation of the Apu Trilogy, Charulata, Aranyer Din Ratri, Kanchenjunga, Kapurush, Pikoo, Jalsaghar, Devi, Teen Kanya, Asani Sanket, etc. NOR does it enjoy the mass popularity of Goopi Gayen Bagha Bayen, Sonar Kella, Joi Baba Felunath, Abhijaan etc. It remains somewhat underrated and under discussed amongst all Ray's films- even more so than Ray's last 3 films (Ghanashatru, Shakha Proshakha and Agantuk) which even though weaker films by Ray's unusually lofty standards were at least much more accessible to the public being more recent THE FILM ****Mild spoilers ahead***** Ghare Baire is set in pre- Independence India and tells the story of a traditional but educated Bengali woman- married to a wealthy, liberal, westernized Zamindar of a Bengali village. Her daily sojourns are confined to the inner part of the house as a strange but true custom for married women in those days. Is it then just a coincidence that her state of living is also an allegory to India in those times- wanting to win freedom from its past. Hoewver, truth be told, her husband loves her and she's under no apparent stress due to her lifestyle and seems to have accepted it and thriving in it. Nikhil, her husband, is a calm, composed, pro feminist and liberal man who supports her wife's decision to learn English Classical music from a British Lady (an interesting cameo by Jeniffer Kendall whom we know as Violet Stoneham from 36 Chowringhee Lane). In their peaceful lives, enters a revolutionary named Sandip. Dark, brooding, idealist; Sandip was an old college friend of Nikhil and is now, the leader of the 'Swadeshi' movement or the 'Be Indian Buy Indian' movement and wants to extend his movement in Nikhil's village but Nikhil, being a pragmatic man, cannot allow this to happen because that would take away the livelihoods of many poor hawkers (paricularly Muslim) who get foreign made things CHEAPER than Indian substitutes and hence stand to lose their margins if forced to buy Indian raw materials for selling in the 'haat' (a village market) Another layer to this 'external' story is its 'internal' aspect that comprises Nikhil, Sandip and Bimala. Nikhil is the man of the world, Sandip represents an illusive Utopia as he is a die hard idealist and Bimala plays the woman who's torn between the two extremes- The Home (Nikhil) and the World (Sandip), Ghare and Baire. Smitten by Sandip's fiery speeches and his vision of an independent India as contrasted with her own husband Nikhil's ostensibly indifferent attitude to the freedom struggle, Bimala finds herself increasingly drawn to Sandip. Does Nikhil know or does he simply trust his wife too much and is a bit of an idealist himself? And does Sandip actually love Bimala or is he only using her as a tool to weaken Nikhil and subsequently, persuade Nikhil to let the Swadeshi movement enter his village and also to take her financial help to continue his movement? And what about Bimala? Then, when chaos erupts in the village due to the battle between the revolutionaries and the establishment, Sandip has to leave and Bimala's dreams are shattered as reality strikes. Then the small things become more apparent to her- like how Sandip always traveled by first class, how he always smoked imported cigarettes even though he was a proponent of Swadeshi himself. Then she remembers what Nikhil's first words to her about Sandip almost as a warning- \"That man is better to look at from a distance\". Isn't that true about mirages and ideals too? Aren't they too accompanied later by a sense of disillusionment? AFTERMATH Ultimately, 'Ghare Baire' is an extremely complex but rich story of idealism Vs. pragmatism that extends the concept to not only a Home i.e. a Bengali household (through the love triangle) but also to the World i.e. India during those times of strife and struggle (through the depiction of the revolution and the Swadeshi movement). In both cases, in the end, we did get freedom, but at what cost? Doesn't Nikhil's unfortunate death represent the millions of lives that were lost in our Freedom struggle and doesn't Sandip's escape represent the euphoria that quickly deserted us, just as we became independent Ray's mastery is evident behind every frame- Victor's monologue during dinner one night, Soumitra's several soul stirring speeches during the film and the wonderful cinematography (the last scene of Bimala morphing from a married woman to a widow is just awesome beyond words), Ghare Baire would represent the end of a phase in Ray's career as he suffered a heart attack while filming this and subsequently his output became less prolific (He only completed 3 more films and a telefilm in his last eight years). Also, this was the beginning of a change of style- from the ersthwile outdoor locations (Apu, Kanchenjunga, Aranyer Din Ratri, etc.) to the primarily 'set- driven' later films. 8/10 for me",
         "\"Dear me, I had no conception that the lower classes had such white skins.\" - Lord Curzon Set in the early 1900s, Satyajit Ray's \"The Home and the World\" features the recollections of Bimala Cloudhury (Swatilekha Chatterjee), the wife of Nikhilesh (Victor Banerjee), a wealthy Bengal merchant. As her spouse encourages her to adopt Western attitudes, Bimala begins to drift away from traditional social and religious values. By \"Home's\" second act, it becomes clear that Nikhilesh idolises India's British rulers, who, under the leadership of Lord Curzon, have begun partitioning the Muslim and Hindu populations of Bengal. Ironically, Nikhilesh's desires for Bimala to be \"reeducated\" have the opposite effect; she's drawn toward a leader of the Swadeshi, a nationalist movement. Indeed, Bimala becomes the movement's first female member. \"Home\" thus sketches an India in which forces have begun pulling in opposing directions. Throughout the film, traditional values vie with liberated modernism. This \"modernism\", ironically, is introduced via the \"primitive\" hand of British Imperialism, which is itself opposed by an Indian Nationalism whose progressivism not only masks reactionary elements, but points to the eventual disharmony between Hindus and Muslims. Slow, subtle, and set almost entirely indoors, \"The Home and the World\" heavily resembles the works of Luchuno Visconti. Like Visconti at his best, Ray's film portrays a society on the cusp of transformation. Bimala's plight, torn between two men, itself echoes the upheaval's of her nation. 8/10 � See \"North West Frontier\".",
         "The story is set in the first decade of the previous century. Bengal is to be partitioned into two states, a Hindu Bengal and a Muslim Bengal. Lord Curzon is the current Viceroy.The freedom movement is in it's nascent state and is being spearheaded by the upper class intelligentsia. British goods flood the market. There is a move on the part of the rebels to boycott imported goods.This on the other hand is likely to hit the poor since imported goods are cheaper and of better quality. The complex social and political situation is narrated by Ray through the medium of a bold and torrid love triangle triangle, bold for the year when the movie was released, bolder for the milieu in which the film is set and even by present standards of Indian cinema. The level of intimacy depicted is perhaps unprecedented in Indian cinema, since kissing on-screen still is likely to shock sections of the audience. India is a confluence of civilizations and Ray is an individual who embraces contradictory multiplicities. One of the opening images is of Bimala (played by Swatilekha Chatterjee), traditionally cloistered wife of the aristocrat Nikhil (Victor Banerjee), as she is tutored in Western vocal music by her teacher (Jennifer Kendall). Nikhil decides to liberate her from the traditional role of housewife and introduces her to ex college mate and firebrand freedom fighter Sandip (Soumitra Chatterjee), who is currently campaigning for Swadeshi, or the boycott of foreign manufactured goods. Ray clearly aims to portray the shallowness which underlies much revolutionary fervor. This is particularly evident in the ritualistic greeting of the Swadeshi-ists, which is artificial and comic. Bimala is completely infatuated with Sandip, till events disclose the duplicity and self serving motives which underlie his chest thumping patriotism. The film is not up to Ray's best. This is perhaps due to it's complexity and scope of ambition. Ray is not one to distort for the sake of simplification. He seeks here to portray some still continuing realities of India's multi religious and multi cultural society through the microcosm of a family living through a turbulent period of nascent nationalism. This is just before the appearance of Gandhi, when the serious business of confronting colonialism really started. Certainly cannot be missed.",
         "This film begins with a happily married Hindu couple. The husband is college educated and rich. His wife is very traditional and her entire world is the inside of her home. However, the husband pushes her to learn English and about the outside world and she reluctantly agrees. Later, an old college pal arrives. He is the head of a nationalistic \"buy Indian\" movement. While this husband is not entirely in agreement with the movement, he lets his wife learn more about this movement and its leader. She quickly falls under this stranger's spell and begins actively supporting him by selling her jewels to give the movement money. However laudable the cause seemed to be, over time it resulted in widespread persecution of the poor Muslims and as a result, Muslim reprisals. The once peaceful land is now in chaos and the wife finally realizes her new \"knight in shining armor\" is in fact, self-serving and unconcerned with the ensuing chaos! The stranger leaves town--leaving the very decent husband to try to restore order. While I found this movie historically interesting, there were a couple elements that left me a bit cold. First, the wife falling in love with the stranger seemed way too quick and difficult to believe--plus, I would have thought her husband would have said something sooner considering this man so often met with the wife alone. Second, the movie itself was also a bit cold and didn't hook me emotionally. A similar type of movie about the Muslim-Hindu violence decades later (when the country finally gained its independence) was EARTH, but it really managed to strike a much more emotional cord. So, in all, a decent and interesting film but not great."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["National Film Development Corporation of India (NFDC)"],
      "summaries": ["When the movie opens, a woman is recalling the events that molded her perspective on the world. Years ago, her husband, a wealthy Western-educated landowner, challenged tradition by providing her with schooling, and inviting her out of the seclusion in which married women were kept, to the consternation of more conservative relatives. Meeting her husband's visiting friend from college, a leader of an economic rebellion against the British, she takes up his political cause, despite her husbands warnings. As the story progresses, the relationship between the woman and the visitor becomes more than platonic, and the political battles, pitting rich against poor and Hindu against Moslem, turn out not to be quite as simple as she had first thought."],
      "budget": 0
   },
   "movielensId": 111401,
   "movielens": {
      "languages": ["বাংলা"],
      "releaseDate": "1985-01-04",
      "dvdReleaseDate": null,
      "directors": ["Satyajit Ray"],
      "runtime": 140,
      "movieId": 111401,
      "title": "The Home and the World",
      "mpaa": "",
      "actors": [
         "Soumitra Chatterjee",
         "Victor Banerjee",
         "Swatilekha Sengupta",
         "Gopa Aich",
         "Jennifer Kendal",
         "Manoj Mitra",
         "Bimala Chatterjee",
         "Indrapramit Roy"
      ],
      "imdbMovieId": "0087328",
      "originalTitle": "Ghare-Baire",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "When the movie opens, a woman is recalling the events that molded her perspective on the world. Years ago, her husband, a wealthy Western-educated landowner, challenged tradition by providing her with schooling, and inviting her out of the seclusion in which married women were kept, to the consternation of more conservative relatives. Meeting her husband's visiting friend from college, a leader of an economic rebellion against the British, she takes up his political cause, despite her husbands warnings. As the story progresses, the relationship between the woman and the visitor becomes more than platonic, and the political battles, pitting rich against poor and Hindu against Moslem, turn out not to be quite as simple as she had first thought.",
      "tmdbMovieId": 42092,
      "avgRating": 4.1,
      "releaseYear": "1985",
      "numRatings": 5,
      "posterPath": "/vEU1eKvWPzzdMAcwzXjsH69dKro.jpg"
   }
}