{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "deserted island",
            "id": 155746
         },
         {
            "name": "robinson crusoe",
            "id": 203102
         }
      ],
      "imdb_id": "tt0074849",
      "video": false,
      "title": "Man Friday",
      "recommendations": [
         13798,
         85556,
         18262,
         211085,
         34732
      ],
      "backdrop_path": "/nmJdoNYrv7CusYU98qRPMVrEWgG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Robinson Crusoe",
               "gender": 2,
               "credit_id": "52fe48d59251416c750b4c27",
               "name": "Peter O'Toole",
               "profile_path": "/7esSG4iZHueb5Nh8RBBhtRZLpom.jpg",
               "id": 11390,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Friday",
               "gender": 2,
               "credit_id": "52fe48d59251416c750b4c2b",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Carey",
               "gender": 0,
               "credit_id": "52fe48d59251416c750b4c2f",
               "name": "Peter Cellier",
               "profile_path": "/khiG54WhC7OL79PuSXUErKzRvVl.jpg",
               "id": 44419,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "McBain",
               "gender": 0,
               "credit_id": "52fe48d59251416c750b4c33",
               "name": "Christopher Cabot",
               "profile_path": null,
               "id": 1067329,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe48d59251416c750b4c37",
               "name": "Joel Fluellen",
               "profile_path": "/r8Vno7WxBENXDzbZMCkKX290ftb.jpg",
               "id": 86370,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Young Girl",
               "gender": 0,
               "credit_id": "55130995c3a36801bb003df0",
               "name": "Sam Seabrook",
               "profile_path": null,
               "id": 1445673,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Young Boy",
               "gender": 0,
               "credit_id": "551309a9c3a3683f3900a113",
               "name": "Stanley Bennett Clay",
               "profile_path": "/sWcYa01UK1kyVNlZr8EyhW63Mcm.jpg",
               "id": 1057896,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48d59251416c750b4c23",
               "name": "Jack Gold",
               "profile_path": null,
               "id": 70055,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55130ccdc3a3683e7f009e1a",
               "name": "David Korda",
               "profile_path": null,
               "id": 21242,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "55130d2792514104620004a0",
               "name": "David Korda",
               "profile_path": null,
               "id": 21242,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "55130cb6c3a3686195001a25",
               "name": "Gerald Green",
               "profile_path": null,
               "id": 1350049,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5513111692514104ab0019e2",
               "name": "Adrian Mitchell",
               "profile_path": null,
               "id": 217630,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5513112dc3a3681db201038f",
               "name": "Daniel Defoe",
               "profile_path": null,
               "id": 52588,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "57cf778892514134a3004a7e",
               "name": "Anne V. Coates",
               "profile_path": null,
               "id": 6346,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.616516,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 91471,
      "vote_count": 7,
      "budget": 0,
      "overview": "Englishman Robinson Crusoe, stranded alone on an island for years, is overjoyed to find a fellow man, a black islander whom he names Friday. But Crusoe cannot overcome the shackles of his own heritage and upbringing and is incapable of seeing Friday as anything other than a savage who needs Crusoe's brand of cultural and religious enlightenment. Friday attempts to share his own more generous and unashamed culture, but ultimately realizes that Crusoe can never see him as anything but an inferior being. With that awareness, Friday sets out to turn the tables on Crusoe.",
      "similar": [
         41953,
         5689,
         11210,
         8358,
         54979,
         115290,
         13888,
         810,
         578,
         597,
         87827,
         205775,
         285,
         337703,
         9960,
         347031,
         10488,
         27902,
         11968,
         17264
      ],
      "original_title": "Man Friday",
      "runtime": 115,
      "poster_path": "/9bqkMeV5IythLWYQTYLgd5CKnzt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Keep Films",
            "id": 3862,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ABC Entertainment",
            "id": 18742,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Incorporated Television Company (ITC)",
            "id": 15980,
            "origin_country": ""
         }
      ],
      "release_date": "1975-03-04",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Gold"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Daniel Defoe",
         "Adrian Mitchell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0074849/",
      "coverLink": null,
      "actors": [
         "Peter O'Toole",
         "Richard Roundtree",
         "Peter Cellier"
      ],
      "reviews": [
         "Shaft meets Lawrence of Arabia, what can i say? Brilliantly funny and still poignant.I agree with the previous reviewer with reference to the songs however 'we are going to fly' song with its cannon is quite charming.The story mainly concerns redressing the racism in the original texts however the religious aspects are at the forefront of the movie.The differences between the god fearing guilt ridden Christianity of the 18th century and the free spirited tribal beliefs of Friday.Moreover the dated religious beliefs look even more dated against the background of gospel religious practises. Questions of ownership 'what is mine?',punishment,education, money capitalism etc are all scrutinised. The moments that bond the film are the more touching areas where Friday and Crusoe have shared emotions and empathy.The final twist in the tale of the film is where Friday turns the gun on Crusoe and en slaves him.After they escape to the island of Friday Crusoe is rejected by the tribe after impassioned speech by Friday, again turning the original tale on its head. one of the main goofs in the film is where Crusoe is teaching Friday to say Master. Crusoe says marster in a very English ways whereas Friday replies master in a very American way oops this film is a must for DVD.",
         "Robinson Crusoe is an extremely important work of literature, being one of the very earliest novels ever written in the accepted \"novel\" form. However, it is also extraordinarily racist. To understand its racism, one has to consider the attitudes that prevailed at the time when the book was published. Were it written nowadays, it would probably be banned. Within its historical context, though, it is rightly hailed as a classic. The makers of this film have realised that there is a strong case to revise this essentially racist book, and have made encouragingly open-minded and thoughtful attempts to re-do the story for a multi-cultural audience. Man Friday is a reasonably engrossing story of how Crusoe, shipwrecked for years on a barren desert island, befriends a savage and names him \"Friday\". As time goes by, Crusoe attempts to change Friday into a good, decent Christian, but is shown to be more irrational and ignorant than the supposed savage. In the end, Friday proves himself to have a far more wise, perceptive and knowledgable personality than Crusoe. The film is hindered by a few mis-judgements. There was no need for the handful of songs that have somehow made it into the script. If those misplaced bouts of singing were removed, the end product would doubtless have been better. Also, the pacing is a bit erratic, and much time seems to be meaninglessly wasted over the course of the 115 minute duration. The point could've been made efficiently in 90 minutes, and audiences might have felt the moral of the story more sharply. However, all in all, this is a worthy film, well acted and thought-provoking throughout, and significant for its recognition that the source material needed to be revised.",
         "I discovered the film while switching through the channels and I had to keep watching it to the end because I was fascinated. First of all I was fascinated because I had no clue that the original story by Defoe is so full of racism. Then I noticed that this version is told from Friday's point of view which turns it into a whole different thing. The whole situation and Crusoe's behaviour now seems really absurd: The way he tries to rebuild his kind of England on a small island. He has a need to reproduce things which are completely unnecessary and useless in this surrounding. He also sticks to his old rules and schemes and is not able to adapt new attitudes to survive and to get by. First of all Crusoe is not willing to see Friday as a human being who has the same rights and the same possibilities as he has. He also believes that he himself might have more advantages threatening Friday and to let Friday work for him. Or maybe it is his deep belief that this is the only way to be and that he is in fact really fair and being nice to him. Crusoe is not able to see that there is no need to put his negative attitudes on Friday, his fear of God (he seems to struggle with God because he struggles with himself), his shame and the need to punish. He sees shame anywhere and he does not listen to Friday who can see clearly that there is no need for shame. Peter O'Toole is just perfect for portraying that ignorant Englishman who can be really nasty but at the same time the viewer feels sorry for him because he is trapped and torn inside. Richard Roundtree is great as Friday, being very natural and being relaxed and concentrated at the same time. He is made to be the more attractive one in that team. The film was done four years after his success with \"Shaft\" and you can find typical blaxploitation elements in it. Like other IMDb users said before: The songs are a bit disturbing but they cannot ruin a good film. The plot is a very good starting point for a philosophical discussion on how people can live together and what might be a good basis for an intact society.",
         "This film is the allegorical definition of the white/black dynamic. The scene where \"Friday\"(not his given name)-now in psychic trauma, is first renamed then trained to call Crusoe \"Master\" is an intentionally aggressive polemic. Which begins a relentless,psychological,cultural,political,economic rape and exploitation his fellow castaway. In a very abstract view it is also a love story. I think Robinson Crusoe actually is in love with \"Friday\". It contains both the historical problem and the future solution for this permanent incompatibility. This is a must see film. It cannot be critiqued for \"entertainment\" value alone. I wish it was available on DVD.",
         "I have not seen this in a long while, and it has not been released on VHS or DVD, but I remember it as in intelligent spoof of Robinson Crusoe. It is the same old story we all know, but it is told from the perspective of Friday, who, if I recall correctly, narrates the tale like a hip soul brother from the 1970's replete with a Jamaican accent. \"Broter, lemme tell ya, iss da story o dis dumb wite mon, who doan know his ahs from a coconut grove.\" That's not exactly what he said, but it is the gist of how things are told. Friday, Richard Roundtree, who had just finished three movies and one television series as Shaft, is a wealth of oneupsmanship over the not too bright Crusoe, played superbly by Peter O'Toole. This is a must watch and a keeper. Write ABC Entertainment. Tell them to get it out on DVD. I think that one of the problems with this film is that AVCO Embassy Pictures, which produced it with ABC, went out of business years ago. A choice film.",
         "I missed the start of this film on tv but managed to tune in to the story's events which appear to carry a strong social message based on prevalent ideas, prejudices and conflicts among people. It brings to mind the movie, Hawaii, in which the white man's ways and beliefs were supposed to transform the local inhabitants but as it turned out, the well-meaning visitors had much to learn from the island people's customs and beliefs. In a way it's a lesson for us all that we should respect cultural differences, customs and values. As the saying goes, There are many roads that lead to Rome. The episode of trying to spread their inventive wings and fly was great fun to watch and O'Toole's furry feet were a hilarious footnote to the scene. I regret some of the violence enacted but then those days were not always pleasant times. A happier ending would have been nice. On the other hand this film makes you stop and think. One can observe the conflict of intellect versus soul wisdom being played out. It's a film well worth seeing.",
         "I wasn't expecting much when I decided to take a look at this underrated film, one of Peter O'Toole's forgotten works. Well, I think it's great. The ideological consistency of this reinterpretation is definitely more welcome than a \"classic\" adaptation of Defoe's novel. What strikes me is the movie's relevance after all these years. It's amazing how little has changed from those days, when racism and slavery were widely accepted as \"normality\". I mean, the laws have changed of course, manners have improved - we live in the era of \"political correctness\" and all - but in terms of how we FEEL about the Other, nothing has changed, unfortunately. Robinson Crusoe is in fact the typical Englishman. This deep rooted idea of superiority still exists today, even if it doesn't manifest itself in the same ways.\"Man Friday\" makes a powerful statement about human nature, about man's failure to communicate, to understand and respect others. Various themes are explored, like religion, sexuality, freedom, xenophobia, capitalism, multiculturalism, moral relativism and so on. The movie succeeds in making some good points, sometimes with a great sense of humor, and sometimes with a tragic feel. Crusoe's relationship with Friday, its development and psychological implications are very interesting. Peter O'Toole is splendid as the nasty and arrogant Englishman, while being sympathetic to some extent due to his human frailty. Not even those funny-looking furry boots and outfits can diminish his aristocratic elegance, and it's a pleasure to listen to his beautifully spoken phrase. O'Toole's Crusoe has the tragic aura of a Shakespearean hero, and this superb performance is the movie's highlight. Roundtree also does a very good job. The absence of a remastered DVD transfer must be the only reason why \"Man Friday\" remains basically unknown, and that's a shame.",
         "This is one of those films with an intriguing concept that is ruined by poor execution. \"Man Friday\" is a revisionist take on the classic novel \"Robinson Crusoe\" told from the point of view of the castaway Englishman Crusoe's (Peter O'Toole) native companion/servant Friday (Richard Roundtree). Adapted from a stage play, this is basically a two-hander carried by O'Toole and Roundtree's performances. The duo's evolving relationship is obviously a metaphor for racism, slavery, colonialism, and capitalism. That part of the film works well, with Crusoe's more \"civilized\" Christian and English ways revealed as irrational and unnatural. The problem is that the filmmakers add all sorts of other nonsense, perhaps to broaden the film's appeal. Friday often breaks into his \"native\" songs, but he sings the lyrics in English and the music sounds too contemporary. There is a comical talking parrot. Worst of all is a sequence where Crusoe and Friday try to escape from the island by inventing all sorts of silly flying machines, with accompanying sound effects borrowed from an old \"Roadrunner\" cartoon. There are also some plotting problems. Crusoe is not properly introduced and Friday goes from being terrified of Crusoe to amiably calling him \"master\" way too quickly. Since director Jack Gold can't decide if this is a serious drama or a musical-comedy-adventure, it doesn't succeed as either. 4 out of 10.",
         "This half-baked version of the brilliant novel \"Robinson Crusoe,\" is ruined by shoddy production values, poor plotting and woeful dialogue. Peter O' Toole - one of the greatest actors of his generation - should have been offered a better film than \"Man Friday.\" Richard Roundtree (a flash in the pan) was making poor film after poor film. There may be some good photography but that can only compensate for so much.",
         "I watched this film expecting to see a Classic adventure. Having seen it I am not sure whether to classify it a comedy, a satire or an adventure. I find it difficult to understand what Peter O' Toole, such a formidable actor, is doing being involved with such nonsense. Mr. O' Toole as Crusoe often overacts against the whimsical antics of Mr. Roundtree as Man Friday. Quite frequently their acting remind one of the cavorting of a double act from Sunday night on the London Palladium. If you can excuse the actors, after all they tried to do the best with the material they had, what can one say with the production values. Here we have attempts to Hippyise the movie that fail simply because they are out of place and out of time. We have a failed attempt at controversy with Man Friday offering Crusoe homosexual services, this came out of the blue and implied that it was common practice at his tribe. 70's free love, all the rage in 1975 when the film was made, with Friday admitting that he may be a father but did not know to whom or how many. Half way through the film we have the laughable attempts of the pair to fly away from the island. Must have been inspired by the opening sequence of 'Those Magnificent Men in their Flying Machines'. It's really a blessing that Robinson Crusoe did not think of windsurfing away. The island looked so accommodating anyway that one wanders why they would ever want to leave it. Crusoe's house had so many conveniences that even today it would prove to be a very desirable residence. I have expected to catch a glimpse of his swimming pool. Peter O' Toole and Richard Roundtree do not convince in either their quiet moments or in the so called profound moments where they are discussing Religion, Civilisation and Life. Peter O' Toole often overacts and reminds one of Rod Steiger at his most extreme. Richard Roundree can not or does not make any attempts to drop his American accent, so Man Friday with an American accent?. There again, the ending leaves more questions about the plot unanswered....But I leave you to decide about this.",
         "A satellite view of the earth is the first camera shot of this film then it plunges down to the island on which Crusoe (O'Toole) is stranded.A quick and direct start to a film. Every now and again I expected John Cleese to be playing a piano on the beach.There is a scene when the two characters are on a podium after racing, it's straight out of Monty Python. There is definitely something about this film even though there are some cringe worthy singing scenes that, I think are a little ludicrous.It delves into religion, class,education, race, the idea of money and the general cultural relativism that exists between the proverbial \"savage\" and \"civilized\" man. Although people have said that Crusoe is the fool in this version, I do tend to see some sense in the things he does, like the need for money in order to keep a work ethic and a civilized notion of transaction of possessions.However his religious spin on everything is a little monotonous and self deceiving. He is put into context of his origin when some Brithish missionaries arrive on the island.He is actually not that bad a fellow at all. Friday (Rountree)is a bit of a hippy in this really and overly idealistic. Some where in the middle of the two characters is the sort of person you could live on a desert island with! I thought Crusoe's shooting himself was a wonderfully dark ending.",
         "Peter O'Toole and Richard Roundtree play off each other in this \"play\" played out on an island. The strong religious overtones preached by O'Toole are off putting and grinds the film to a halt at regular intervals. The fact that the natives speak in English, and O'Tool's island is stocked with all matter of modern conveniences, sends believability out the window. Throw in some truly grating songs and you can easily deduce why the movie failed miserably. After about an hour, when the slow pace doesn't improve, you will be tempted to reach for the fast forward button. I gave up entirely to save myself from further disappointment. - MERK"
      ],
      "genres": [
         "Drama",
         "Adventure"
      ],
      "productionCompanies": [
         "ABC Entertainment",
         "ITC Films",
         "Keep Films"
      ],
      "summaries": ["Englishman Robinson Crusoe, stranded alone on an island for years, is overjoyed to find a fellow man, a black islander whom he names Friday. But Crusoe cannot overcome the shackles of his own heritage and upbringing and is incapable of seeing Friday as anything other than a savage who needs Crusoe's brand of cultural and religious enlightenment. Friday attempts to share his own more generous and unashamed culture, but ultimately realizes that Crusoe can never see him as anything but an inferior being. With that awareness, Friday sets out to turn the tables on Crusoe."],
      "budget": 0
   },
   "movielensId": 111540,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-03-04",
      "dvdReleaseDate": null,
      "directors": ["Jack Gold"],
      "runtime": 115,
      "movieId": 111540,
      "title": "Man Friday",
      "mpaa": "PG",
      "actors": [
         "Peter O'Toole",
         "Richard Roundtree",
         "Peter Cellier",
         "Christopher Cabot",
         "Joel Fluellen",
         "Sam Seabrook",
         "Stanley Bennett Clay"
      ],
      "imdbMovieId": "0074849",
      "originalTitle": "Man Friday",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["rLBY4qUqOxg"],
      "plotSummary": "Englishman Robinson Crusoe, stranded alone on an island for years, is overjoyed to find a fellow man, a black islander whom he names Friday. But Crusoe cannot overcome the shackles of his own heritage and upbringing and is incapable of seeing Friday as anything other than a savage who needs Crusoe's brand of cultural and religious enlightenment. Friday attempts to share his own more generous and unashamed culture, but ultimately realizes that Crusoe can never see him as anything but an inferior being. With that awareness, Friday sets out to turn the tables on Crusoe.",
      "tmdbMovieId": 91471,
      "avgRating": 3.5,
      "releaseYear": "1975",
      "numRatings": 1,
      "posterPath": "/9bqkMeV5IythLWYQTYLgd5CKnzt.jpg"
   }
}