{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0278622",
      "video": false,
      "title": "Paying the Price: Killing the Children of Iraq",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.051636,
      "production_countries": [],
      "id": 391166,
      "vote_count": 1,
      "budget": 0,
      "overview": "An analysis of the effect of economic sanctions on Iraq.",
      "similar": [],
      "original_title": "Paying the Price: Killing the Children of Iraq",
      "runtime": 75,
      "poster_path": "/ulz6Ws7doN7aOEvmdfPv33B1AZA.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Alan Lowery",
         "John Pilger"
      ],
      "runtime": 75,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0278622/",
      "coverLink": null,
      "actors": ["Stars: Felicity Arbuthnot, Dennis Halliday, Jinan Ghalib Hussein | See full cast and crew »"],
      "reviews": [
         "Pilger's last documentary in Iraq before the outbreak of the second invasion looked at the effect of economic sanctions imposed by Western governments on the people and children of the country. The title refers to a remark by Madeleine Albright discussing the sanctions which have caused the deaths of half a million children in Iraq. When asked on US television if she considered this a price worth paying to keep Iraq from beginning another war, she answered \"It's a hard choice...but we think the price is worth it.\" The consequences of the sanctions, as uncovered by Pilger, saw many Iraqis denied or delay drugs and medicines, along with medical equipment, which saw their health, education and cultural life decline significantly with the poor and the young coming off worst of all. Several UN members, including Hans Von Sponeck and Dennis Halliday resigned as a result of this. The reason for the delays, chilling when heard in the aftermath of the Second Gulf War, was that the medicines and medical equipment could be used to make \"weapons of mass destruction\". This was also responsible for the largely hidden bombing campaign of the US and UK against the Iraqi people while Saddam and his cohorts lived in luxury at the whim of Western governments, eager to keep the dictator in power to look after their oil interests... Pilger presents his argument very powerfully, with a strong dependence on reliable sources including Amnesty reports, interviews and individual case studies which are the hallmarks of his work. However this has also been one of Pilger's most controversial documentaries, with much of his claims about Iraqi history and the effects of uranium contamination by US missiles being heavily disputed, particularly by Dr Eric Herring, who is listed as a contributor to the film. In spite of the controversy, \"Paying the Price\" is still a must-watch among Pilger documentaries as it makes the consequent actions of the US and UK all the more horrifying.",
         "This film is a documentary concerned with sanctions on Iraq. It is completely biased towards the Iraqi side, and I was glad to hear it, for once. An important film for anyone interested in media bias or human rights or politics in general. But be forewarned, it plays on human emotions and attempts to make the viewer feel guilty for their tacit acceptance of the situation. If you're a typical American you'll probably want to skip this, and be comforted by your more Ameri-centric local news channel."
      ],
      "genres": [
         "Documentary",
         "War"
      ],
      "productionCompanies": ["John Pilger"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 111546,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-01-01",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 75,
      "movieId": 111546,
      "title": "Paying the Price: Killing the Children of Iraq",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0278622",
      "originalTitle": "Paying the Price: Killing the Children of Iraq",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "An analysis of the effect of economic sanctions on Iraq.",
      "tmdbMovieId": 391166,
      "avgRating": 5,
      "releaseYear": "2000",
      "numRatings": 1,
      "posterPath": "/ulz6Ws7doN7aOEvmdfPv33B1AZA.jpg"
   }
}