{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2994646",
      "video": false,
      "title": "Black Coffee",
      "recommendations": [
         37964,
         17202,
         184098,
         15363,
         67660,
         222899
      ],
      "backdrop_path": "/fkucJKYZ3Va0dLzJGRiYWOxGQPU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Morgan",
               "gender": 1,
               "credit_id": "52fe4efec3a36847f82b5e9b",
               "name": "Gabrielle Dennis",
               "profile_path": "/p8afMWILP7PjRgQH64N1Q7jkMxY.jpg",
               "id": 124501,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Julian",
               "gender": 2,
               "credit_id": "52fe4efec3a36847f82b5e9f",
               "name": "Christian Keyes",
               "profile_path": "/j0g3a41uop0TRSkwn98QRk5h8fR.jpg",
               "id": 562922,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mita",
               "gender": 1,
               "credit_id": "52fe4efec3a36847f82b5ea3",
               "name": "Erica Hubbard",
               "profile_path": "/797m0IngFFBZM9EGNltSlpTNm3y.jpg",
               "id": 59180,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe4efec3a36847f82b5ea7",
               "name": "Darrin Dewitt Henson",
               "profile_path": null,
               "id": 1263719,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Nicole",
               "gender": 1,
               "credit_id": "5752a4b5c3a36852070023db",
               "name": "Brely Evans",
               "profile_path": "/qwx0WsKL808PIKsUqNk4dkGTRVN.jpg",
               "id": 589766,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Nate",
               "gender": 0,
               "credit_id": "52fe4efec3a36847f82b5eaf",
               "name": "Josh Ventura",
               "profile_path": "/h4iB8U8TAhDIHrPrOtA56CpamP7.jpg",
               "id": 1280398,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Duke",
               "gender": 0,
               "credit_id": "52fe4efec3a36847f82b5ebf",
               "name": "Richard Gallion",
               "profile_path": "/gIsZzf8JD6tWhJHPNvohjdiHEUS.jpg",
               "id": 592343,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Hill",
               "gender": 0,
               "credit_id": "52fe4efec3a36847f82b5ec3",
               "name": "Lamman Rucker",
               "profile_path": "/pmSGmxGNfb3DhxSsTb2deyNG5yE.jpg",
               "id": 1218183,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lia",
               "gender": 1,
               "credit_id": "52fe4efec3a36847f82b5ec7",
               "name": "Tiffany Hines",
               "profile_path": "/uVCupzUcZo9giuWy6q498WDz77l.jpg",
               "id": 1224085,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4efec3a36847f82b5eb5",
               "name": "Mark Harris",
               "profile_path": null,
               "id": 195781,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4efec3a36847f82b5ebb",
               "name": "Mark Harris",
               "profile_path": null,
               "id": 195781,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.34518,
      "production_countries": [],
      "id": 245175,
      "vote_count": 9,
      "budget": 0,
      "overview": "Robert picked the wrong time to meet his soul mate! After being fired from his own father's company, he feels like his luck has run out - until Morgan enters into his life.",
      "similar": [],
      "original_title": "Black Coffee",
      "runtime": 82,
      "poster_path": "/sYqbI2mymfD3CQC4qO32IdlTZ1W.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-01-10",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Harris"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Mark Harris"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2994646/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0OTgxMDQwNl5BMl5BanBnXkFtZTgwMzk2MTU4MDE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Darrin Dewitt Henson, Christian Keyes, Lamman Rucker | See full cast and crew »"],
      "reviews": [
         "Just caught the movie Black Coffee on BET tonight. I wasn't familiar with the director (Mark Harris) nor the two lead actors, and I have to admit my expectations were not high, as a matter of fact, the only thing I was expecting was to be changing the channel after about fifteen minutes. Well, let me just say, that as the final credits rolled by, I found myself having been pleasantly entertained. First, let me give you a synopsis of the film; Robert (the charming Darrin Dewitt Henson) is having a bad day. First he gets fired from the company his father started, by Nate (Josh Ventura), the man he brought in to resurrect the business. The cloudy day continues when Robert arrives at home only to find his gorgeous but vapid girlfriend of two years Mita (Erica Hubbard of BET's Let's Stay Together) is leaving him for another man. Robert's luck doesn't get any better when he later finds out that the man Mita is leaving him for, is none other than Nate. At his lowest ebb, no job, no woman, betrayed, Robert has a quick encounter with a beautiful woman named Morgan (the enticing Gabrielle Dennis) at his local bookstore. With a little push from his hustler cousin Julian (Christian Keyes), Robert arranges to meet Morgan, and after some initial hesitation, Morgan soon finds herself as attracted to Robert as he is to her. From this point, the film turns into a romantic comedy with Robert and Morgan going through the usual motions of falling in love, with several potholes in the road as expected. Where this movie falls short is in its ability to build up emotional conflict and drama. For example, one of those potholes the couple encounters is Morgan's ex- husband Hill (the versatile Lamman Rucker) who, unable to keep his wife from leaving, refuses to release a million dollar property to her unless she keeps away from other men. This, and Mita's attempt to come back into Robert's life should have provided ample conflict, but unfortunately, become merely a soft sub-plot. Now please understand me, I was not looking for Tyler Perry crack mama, sadistic husband, drag queen crazy aunts, type drama. What this film lacked were the stair steps that make us invest in the characters, and reveal how deep or shallow their love is. That being said, where Black Coffee does work is in its funny, witty dialog, charismatic, lovable characters, and an attractive cast, that makes this movie a pleasure to watch. Henson as Robert shows great chops as a leading man, and if this performance is any indication, he should be showing up in more films. Keyes as hustling, wise- cracking Julian steals the scenes he is in and Hubbard's Mita takes a role which could have been annoying but adds just the amount of sass to make her believable. The star of the movie for me is Dennis, who blends a mixture of sophistication and sexiness to her role that rivals any of the A-List girls such as Halle Berry or Kerry Washington. Director Mark Harris pulls everything together smoothly; reining in his actors so that there is no Perry-ish moments of over-acting, and allowing the movie to glide along at a steady, if not spectacular pace. Adam Lee's cinematography is as smooth and mellow as Harris' direction, allowing the actor's charm and attractiveness to be the film's finest special effect. While you're not going to be taken on the head-spinning roller coaster ride of most of today's romantic-comedies, just like Black Coffee, the film will stimulate and satisfy.",
         "Poor Robert (Darrin Dewitt Henson). First, his boss fires him, even though Robert's father actually started the company! It's a surprise. Then, when this handsome man gets home, his mercurial girlfriend declares that she is moving out, since no ring has appeared. It looks like a double whammy for Rob! His crazy, coffee seller cousin Julian (Christian Keyes) is there to help him adjust. But, sometimes things happen for the better. First, Robert can devote more time to his side business and true love, interior painting. His skill can transform office space into something magic. Then, at a secondhand bookstore, Robert spies a beautiful lady, Morgan (Gabrielle Dennis). Although he doesn't get a chance to introduce himself, SHE calls him soon, for she wants her office redecorated, as she is a lawyer. But, curiously, Gabby doesn't seem to want to respond to Robert's obvious interest. All too soon, Robert learns that her ex-husband may want her back and is messing with her mind. Then, Robert finds out that his ex-girlfriend is having an affair with his former boss. So, that's why he was fired! Will Robert be able to win Morgan's affections? Maybe so, as he hatches a brilliant idea in his mind! This movie, to some, has an obvious agenda. African Americans need to become small business owners in order to truly make the big bucks. Yes, this may be a great idea to ponder. But, even when the flick is most blatantly persuasive, there is still a nice romantic comedy at the core. We fans care most about this! The cast is nice, with Keyes, especially, very funny. Also, the setting, costumes, story and direction are quite capable, resulting in an enjoyable watch. If you love your romcoms, like me, pick this one, brew up some coffee and gobble some cookies, too.",
         "In this cute, little independent film, Darren Henson stars as Robert, an all around nice guy and painter who just got fired from his job.He soon gets dumped by his girlfriend, the clueless, gold digging Mita (Erica Hubbard), who leaves him for his boss. Robert is then convinced by his cousin Julian played by the gorgeous and very charming Christian Keyes to help him distribute coffee. The magic begins when he visits a book store and encounters the lovely Morgan (Gabrielle Dennis), a beautiful attorney who he falls for at first sight. For starters, Darren Henson and Gabrielle Dennis give good performances and have great chemistry. Their budding romance is endearing and they are truly a joy to watch. In addition, the sudden romance between Hill and Mita is charming and adorable. Opposites attract as Hill brings Mita down to earth while Mita helps Hill to open up more and have fun. Although they're cute together, it would've been nice to see Mita reach a level of independence on her own without being romantically linked to anyone. Although nothing new to the screen, \"Black Coffee\" is a good movie to watch. If you're in the mood for some decent acting and some cute romance, rent \"Black Coffee\". You won't be disappointed.",
         "I would like to start off by saying that this movie was very good because they took out it was a movie filled without stereotypes and ignorance. The movie really had me into the story with the concept of how people can love each other within their race. Which I completely enjoyed. However, the story felt really rushed and skipped to love too fast. Don't get me wrong I understand the money budget with making black films is not that large, but the movie should have taken its time and should have had bigger plot issues or twists. Honestly, I really enjoyed the movie also showing black owned businesses because we need more of those anyway. In conclusion, the movie was a thumbs up from me I love Darrin Henson and hope to see him in more movies as the main role, his acting was great and just don't try to rush a movie like this because I personally believe it could have had a more powerful impact.",
         "I rated this movie based on entertainment and the message it conveyed. Me and my wife watched the movie and enjoyed it. It was hard for the first 20 or so minutes due to the dialogue and scenes. Movies I can't relate to are hard for me to watch. But the message was clear to me what the writer wanted to bring to the audience. With that being said, this movie is for everyone. Also there is a scene at the bookstore where they had the book 'The Law of Attraction' in the background positioned purposely for the audience to see (knowledge rule of thirds). Knowing a little about film I can understand the critics in regards to the flow of the movie and lack of continuity. But I feel that is due to watching the film rather than watching the film so to say. This is a common habit of those who study all aspects of art of film. All in all 8 out of 10! A must watch for everyone. It demonstrates what we need more of, positive black films.",
         "Director, Mark Harris has taken another leap forward in his career with this latest addition of \"Black Coffee.\" The delicate balance of black relationships is hard to capture in an authentic and heart felt way for most filmmakers, but Mark's command of subtle nuance pulls it off brilliantly here. I am particularly impressed with the way the storyline remains entertaining and sexy without ever going \"raunchy\". I appreciate Marks level of sophistication and taste. Black Coffee is a great relationship film for anyone of any background and especially those brothers and sisters in the world looking for love today. Great insights into the minds of men and women. A must rent for date night.",
         "This was a bad movie. In the bookstore the camera rarely moved. The same establishing shot showing the door was used each time. That says the filmmaker was lazy. Same thing for every scene that takes place where the cousin was selling coffee. The scenes were long and talkie and they weren't funny or poignant. SO MUCH talking. Basic tenet in film is, \"show me, don't tell me.\" This was a high school film done with a better camera. It's telling when the editor is not listed on the IMDb page. The pacing coupled with the unnecessary long dialogue scenes just made it excruciating to watch. The writing for the characters was atrocious. In the 21st century a Black female confident in her abilities entrepreneur lawyer is going to let some man cock block her life? Not buying it. And our painter has to move in on the lawyer on the pick up mode from jump. Beautiful woman discount indeed. Clichéd and stereotypical. The soundtrack was sappy and not happening. Just a bad film all the way around.",
         "Am 'defended' by negative comments to this movie. I laughed all the way through this movie especially because of Mita. Her depiction of a blond really came out well. This is a well played out low budget movie that not only motivates but also encourages struggling entrepreneurs to keep on going with their hustle. From the start one expects hot romantic scenes which is not the case but still the chemistry is clear. The movie was however a bit short and even though there was a happy en ding to all the couples involved, the transition by Mita was not clearly illustrated. we needed to see Karma in her way of life to portray a lesson that punishes her way of life. Keep on the good work guys.",
         "This movie has been all over Facebook and Instagram, so I had to check it out and I must say that it was very nice to go to a movie about love without any wild sexual language and overtones. I read that i could take my children and so I took my daughter and she loved it! A nice way to a love story without the drama all. The characters were nice, positive people and I enjoyed them all, though I loved to hate the ex husbands character. I also happen to be a business owner and I thought it was nice to hear inspiring things about business and things like that. Great movie and other than one or two parts, I have nothing but great things to say about it. I hope my sisters in Texas get to see it too, i heard it was only in 4 cities.",
         "I loved this movie!! I thought this was an extremely good movie for anyone to see and I do mean anyone. It's romantic, funny, empowering and motivating, positive. So much that is touched on in this movie can be related to by practically everyone of us. I love a good romantic love story and this film gives me that and more. The humor in the film is great. The sound track is very very good. Some say other African Americans can't relate to this story or these characters. I say absolutely I CAN relate and many others I know can relate. This movie tells part of my story as well as that of many I know. Our story as African Americans, is not a simple black and white story it is a very colorful story with many different ridges and edges in it. We see few of our African American movies come to the screen with a positive message and image. It's a truth I am not proud of especially after viewing Black Coffee and seeing it be done and nonetheless in an independent film. Mark Harris and the cast did an amazing job! Go check it out especially my people in Chicago."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "1555 Filmworks",
         "Tri Destined Studios"
      ],
      "summaries": ["Robert (Henson) picked the wrong time to meet his soul mate! After being fired from his own father's company, he feels like his luck has run out - until Morgan (Dennis) enters into his life. Just as things start to heat up between them, trouble brews as Morgan's ex-husband (Rucker) vows to get her back and Robert's gold-digging ex-girlfriend (Hubbard) returns with an agenda of her own. With the help of his cousin (Keyes), Robert's about to find out how much good can come out of a bad situation in this charming romantic comedy that's good to the last drop."],
      "budget": 0
   },
   "movielensId": 111872,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-01-10",
      "dvdReleaseDate": "2014-04-08",
      "directors": ["Mark Harris"],
      "runtime": 82,
      "movieId": 111872,
      "title": "Black Coffee",
      "mpaa": "PG",
      "actors": [
         "Gabrielle Dennis",
         "Christian Keyes",
         "Erica Hubbard",
         "Darrin Dewitt Henson",
         "Brely Evans",
         "Josh Ventura",
         "Richard Gallion",
         "Lamman Rucker",
         "Tiffany Hines"
      ],
      "imdbMovieId": "2994646",
      "originalTitle": "Black Coffee",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["qxbdALNNc7k"],
      "plotSummary": "Robert picked the wrong time to meet his soul mate! After being fired from his own father's company, he feels like his luck has run out - until Morgan enters into his life.",
      "tmdbMovieId": 245175,
      "avgRating": 2.7,
      "releaseYear": "2014",
      "numRatings": 5,
      "posterPath": "/sYqbI2mymfD3CQC4qO32IdlTZ1W.jpg"
   }
}