{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt2481202",
      "video": false,
      "title": "Anita",
      "recommendations": [],
      "backdrop_path": "/pUoQ2vPKfezA5QY6bBCDCCgsaZq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4c059251416c910ed299",
            "name": "Freida Lee Mock",
            "profile_path": null,
            "id": 223825,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.458081,
      "production_countries": [],
      "id": 159137,
      "vote_count": 6,
      "budget": 0,
      "overview": "Anita tells the story about young, brilliant African American Anita Hill who accuses the Supreme Court nominee Clarence Thomas of unwanted sexual advances during explosive Senate Hearings in 1991 and ignites a political firestorm about sexual harassment, race, power and politics that resonates 20 years later today.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         858,
         141,
         634,
         3981,
         112160,
         394117,
         376867,
         437557,
         297762,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Anita",
      "runtime": 85,
      "poster_path": "/6zGvZKGvXP2dL2lnONRAkG4gvy3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-03-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Freida Lee Mock"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Freida Lee Mock"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2481202/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMzk1Njg1NF5BMl5BanBnXkFtZTgwOTE5MTQwMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "I remember Anita Hill's testimony before the Senate Judiciary Committee in 1991. (I almost wrote Hill's \"trial\" because that's what it felt like.) During it, she was asked questions by Senators that made her repeat and describe, again and again, Clarence Thomas's vulgar and grotesque treatment of her when she worked with him-- or, more to the point, worked for him. It's much harder to issue a complaint about a boss than a colleague. During the testimony, one of my sisters phoned me and said, \"I feel like I'm being sexually abused, exposed to this.\" She was right. The Senate put the whole country through an ordeal that was vile and, as it turned out, ignored: they confirmed Clarence Thomas anyway. Hill's impact was not ignored by the media, though, or the nation. This is a completely conventional documentary. I hesitate to offer a single criticism of it because Anita Hill is the subject, and she-- like so many civil rights activists before her-- is an inspiration throughout. Her calmness, her unflinching determination, and her intelligence shine through every stage of her story. The film interviews a variety of people, all of whom shed light on the way race and gender issues are mishandled in Washington, where all that seems to matter, in the end, is power.",
         "If you don't remember the Anita Hill story you should see this story. If you remember Anita Hill and the media around the story...you don't really know the story. Speaking truth to power is the sub-title and is the tale of her life story. Amazing how far our country has come since 1991, and how far it still has to go. Anita's bravery in standing up and telling the truth, being a good American and doing the right thing, when she had so much to lose is more than most of us would have the courage to do. From her childhood in Oklahoma, to Yale Law, to DC, and beyond this film by an Oscar Award Winner tells Anita's story beautifully and shows how much she gave up to tell the truth about Clarence Thomas. It's time to open our eyes. See it.",
         "I remember all the hoopla surrounding her back in 1991 when I was about a senior in high school. They concerned all the controversy on the senate hearings surrounding Anita Hill's accusations of sexual harassment toward Supreme Court nominee Clarence Thomas. It was fodder for late night television, such as making for some great skits on TV's \"Saturday Night Live\". All these senators sitting around asking some very intimate/personal questions on something that obviously made them a bit uncomfortable..?? LOL Well, anyway, this documentary goes into the FULL story of Anita, her family and professional background, as well as a full look at the behind the scenes of the whole situation in '91. Family, friends, colleagues, etc.. are interviewed, and we get to see a much different woman from the one who was tabloid-ized back in the day- one who really made a big step forward for all women in the work place. I really recommend all should check this movie out. It was a real eye-opener for me, and suspect it might just be for members of both sexes-?? And just a side-note: thanks to Clarence Thomas's recommendation- I actually saw a copy of \"Long Dong Silver\" (from the video store I was working at at the time) - and I give it TWO THINGS DOWN. LOL",
         "I vaguely recall the case. The coverage could hardly be missed. But all I really remember -- and what occupied the media so prominently -- was the pubic hair on the soft drink can and the expression \"Long Dong Silver.\" I don't know what was edited out of this film but as it stands it presents a fairly convincing case that Anita Hill was intelligent and honest. She has neither a ghetto nor a Southern accent and, practically speaking, that helps her. And she didn't make public appearances denouncing Thomas. The \"harassment\" was uncovered in the course of a routine FBI examination and she was called to testify. Clarence Thomas speaks without a regional accent too but his statements are far more forceful and inflammatory than hers. He denies outright that any such exchanges took place. And, unlike Hill, he \"plays the race card,\" as they say. \"This is a high tech lynching.\" I hate that phrase, but that's what he does. It's a trump card. It frightens people and they back off. It changes the structure of the inquiry from the work harassment of Anita Hill to a racist attack on Clarence Thomas. Nobody kisses Anita Hill's ring and some of the questions sound not only adversarial but actually hostile. \"Why did you wait so long to bring this up?\", is a reasonable enough query. But, \"Do you see yourself as a symbol of black womanhood and liberation?\", is a bit much. So is, \"Do you like the attention you're getting?\" So is, \"Are you a woman scorned?\" Of course her answer will be \"no,\" but it's the kind of question that gives the anti-Hill folks a handle to hang their dismissal on. She volunteered to take a polygraph test and passed. Four female witnesses supporting Hill waited in the wings to be called but were ignored. Female witnesses were called on Thomas' behalf. The judgment of the Judiciary Committee as to his being qualified were split, 7 to 7, and the nomination was sent to the Senate without any recommendation, which was rare. After the questionable exchanges and requests for dates, she accompanied Thomas to his next job and spent another two years working for him. She claims that it was in a field she wanted to work in, the exchanges had apparently ended, and she didn't have a job waiting anywhere else. Frankly, I don't care much about Thomas' having made some questionable remarks to her. A lot of men are raunchy and some raunchy men are clumsy in their jokes with women. But that exchange -- the one that people like me remember -- is a minor point. The attacks on Anita Hill continued after the investigation was closed. Thomas went on to become a Supreme Court Justice. Hill wound up at Oral Roberts University. Hill had become a tenured professor. Moves were made, according to her, to get her fired. When that didn't work, the Dean of the university began receiving threats. Years later, the wife of Clarence Thomas left a voice mail message for Hill, asking that Hill apologize for her testimony. Hill turned it over to the FBI who found it authentic. The impression left with the viewer is that the committee were anxious to discredit her, close the investigation quickly, and end the publicity. What actually went on between the two is unknowable. In my judgment, I don't find myself sobbing because of Anita Hill's mistreatment. If that's the worst problem one has at work -- a boss joking about pubic hair and asking you for dates -- it's not much of a problem. We've all had much worse. But Clarence Thomas has turned out to be a complete nonentity. He votes reliably in a predictable way and years passed without his ever asking a question from the bench. (That's not in itself a bad sign but it leaves us blind to his reasoning. Her academic career has been an unqualified success. After graduating as valedictorian from Morris High School, Hill enrolled at Oklahoma State University, receiving a bachelor's degree with honors, in psychology 1977. She went on to Yale Law School, obtaining her Juris Doctor degree with honors in 1980. After her penal servitude at Oral Roberts, she taught at Berkeley and is now at Brandeis University. Thomas' education is equally impressive. The film presents her as a heroine of epic stature, a sacrificial victim almost, in a patriarchal and conservative society. I don't. I see her as another woman who was addressed in questionable ways by a boss and testified about it without being anxious to do so. Personally I wish her testimony had had more impact. Thomas was a fan of Ayn Rand, which I'm not.",
         "Unfortunately, this movie tells only one side of the story so it really does not do justice to Anita Hill. I too, watched the proceedings and this movie does not tell it like it really happened. If you want to see a movie that degrades the senate and makes a monster out of Clarence Thomas without even an attempt at fairness or equality, then this is the movie for you. It is so biased that it was only believable by someone who was already convinced of Thomas' guilt. It was so biased that it came across as a work of fiction. As such, it is less than useless for telling the facts. Its a shame really, this story needs to be told properly. I can only imagine the courage it must have taken to stand before the senate and testify about this kind of thing. As my dad used to say \"if you want it screwed up, give it to the government... or Hollywood\""
      ],
      "genres": [
         "Documentary",
         "History"
      ],
      "productionCompanies": [],
      "summaries": [
         "ANITA tells the story about a young, brilliant African American Anita Hill who accuses the Supreme Court nominee Clarence Thomas of unwanted sexual advances during explosive Senate Hearings in 1991 and ignites a political firestorm about sexual harassment, race, power and politics that resonates 20 years later today. ANITA is a dramatic look at the consequences to a private citizen acting out of a civic duty to 'speak truth to power.' For the first time on film Anita Hills speaks about her experience in the Senate Hearings, her impact on issues of sexual harassment, workplace rights for women and men, social justice and equality. The film is about the empowerment of girls and women, and men, through the extraordinary story of Anita Hill.",
         "Against a backdrop of sex, politics, and race, ANITA reveals the intimate story of a woman who spoke truth to power. Directed by Academy Award®-winning filmmaker Freida Mock, the film is both a celebration of Anita Hill's legacy and a rare glimpse into her private life with friends and family, many of whom were by her side that fateful day 22 years ago. Anita Hill courageously speaks openly and intimately for the first time about her experiences that led her to testify before the Senate and the obstacles she faced in simply telling the truth. She also candidly discusses what happened to her life and work in the 22 years since.",
         "A profile of Anita Hill, the African-American lawyer who challenged Clarence Thomas' nomination to the US Supreme Court and thus exposed the problem of sexual harassment to the world."
      ],
      "budget": 0
   },
   "movielensId": 112338,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-03-25",
      "dvdReleaseDate": null,
      "directors": ["Freida Lee Mock"],
      "runtime": 85,
      "movieId": 112338,
      "title": "Anita",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "2481202",
      "originalTitle": "Anita",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["DGrWaCCVfq0"],
      "plotSummary": "Anita tells the story about young, brilliant African American Anita Hill who accuses the Supreme Court nominee Clarence Thomas of unwanted sexual advances during explosive Senate Hearings in 1991 and ignites a political firestorm about sexual harassment, race, power and politics that resonates 20 years later today.",
      "tmdbMovieId": 159137,
      "avgRating": 3.375,
      "releaseYear": "2013",
      "numRatings": 8,
      "posterPath": "/6zGvZKGvXP2dL2lnONRAkG4gvy3.jpg"
   }
}