{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1343113",
      "video": false,
      "title": "The Sunshine Boy",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "5799b426c3a3682d4f000a3c",
            "name": "Friðrik Þór Friðriksson",
            "profile_path": null,
            "id": 6759,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.083188,
      "production_countries": [],
      "id": 140783,
      "vote_count": 1,
      "budget": 0,
      "overview": "A Mother's Courage (aka The Sunshine Boy) is a moving, compassionate portrayal of a mother's desperate quest to understand the perplexing condition that controls her son. A journey through different countries, where every stop-over opens a new path into the depths of autism - and places her son in a strikingly different perspective as it reaches the end.",
      "similar": [],
      "original_title": "Sólskinsdrengurinn",
      "runtime": null,
      "poster_path": "/nWGn7jcsdOqyYiW2hi0vJ3oypt5.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2009-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iceland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Friðrik Þór Friðriksson"],
      "runtime": 103,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1343113/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwOTQwODU5N15BMl5BanBnXkFtZTgwNzczNjY2MDE@._V1_SY317_CR17,0,214,317_AL_.jpg",
      "actors": ["Stars: Margrét Dagmar Ericsdóttir, David G. Amaral, Simon Baron-Cohen | See full cast and crew »"],
      "reviews": ["THE SUNSHINE BOY is a feature length documentary from Iceland about autism. Narrated by Oscar-winner Kate Winslet, it reveals a lot of startling statistics. One out of every 150 children will be diagnosed with some form of autism; the illness is four times more prevalent in boys than in girls; and 80% of marriages between parents of autistic children end in divorce. These disturbing statistics are fairly common in most countries around the world. But the film also defuses some of the myths surrounding autism. Many sufferers are quite intelligent but are unable to express themselves or demonstrate their knowledge adequately. Directed by Fridrik Thor Fridriksson, the film follows Margaret Ericsdottir, a mother of Keli, her eleven-year-old autistic son, who is frustrated by the lack of treatment available in her native Iceland. Determined to discover as much as she can about this insidious affliction, her quest takes her to America and a number of experts and institutions that are working hard to perfect treatments to help sufferers. She also talks to a number of families with autistic children to find out more about how they cope. Her search eventually takes her to Austin Texas, where a program known as HALO (Helping Autism through Learning and Outreach) is having remarkable results. Also known as A Mother's Courage: Talking Back To Autism, this is a compassionate, at times heart-wrenching, and informative documentary that also offers a glimmer of hope and is a realistic counterpoint to Hollywood films like Rain Man. There is some unnecessary padding here, and the film could have been trimmed and still make its points effectively."],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Frontier Filmworks",
         "Klikk Production"
      ],
      "summaries": [
         "The Sunshine Boy is a moving, compassionate portrayal of a mother's desperate quest to understand the perplexing condition that controls her son. A journey through different countries, where every stop-over opens a new path into the depths of autism - and places her son in a strikingly different perspective as it reaches the end.",
         "The mother of an autistic child is determined not to accept the pessimistic prognosis for her son."
      ],
      "budget": 0
   },
   "movielensId": 112342,
   "movielens": {
      "languages": [""],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": null,
      "directors": ["Friðrik Þór Friðriksson"],
      "runtime": 0,
      "movieId": 112342,
      "title": "A Mother's Courage",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "1343113",
      "originalTitle": "A Mother's Courage",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A Mother's Courage (aka The Sunshine Boy) is a moving, compassionate portrayal of a mother's desperate quest to understand the perplexing condition that controls her son. A journey through different countries, where every stop-over opens a new path into the depths of autism - and places her son in a strikingly different perspective as it reaches the end.",
      "tmdbMovieId": 140783,
      "avgRating": 3.5,
      "releaseYear": "2009",
      "numRatings": 3,
      "posterPath": "/nWGn7jcsdOqyYiW2hi0vJ3oypt5.jpg"
   }
}