{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1633224",
      "video": false,
      "title": "Missing William",
      "recommendations": [],
      "backdrop_path": "/p6cU0QSaNPwZITuXzsE7C4vgzt1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "James Anderson",
               "gender": 2,
               "credit_id": "53160565c3a3681388000c74",
               "name": "Brandon Routh",
               "profile_path": "/uGPbPxlKAkbbUVq2sxuvkZpdThl.jpg",
               "id": 17271,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Abigail Leeds",
               "gender": 1,
               "credit_id": "53160571c3a36813a6000c8f",
               "name": "Courtney Ford",
               "profile_path": "/nsIzZ43BjySMnpJlEfOYKT3JHXa.jpg",
               "id": 76536,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jill",
               "gender": 1,
               "credit_id": "5316057bc3a368137b000cd5",
               "name": "Spencer Grammer",
               "profile_path": "/xLZHw2muESIS7zuWFM5yci6rXer.jpg",
               "id": 176823,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "William Leeds",
               "gender": 2,
               "credit_id": "53160585c3a3681388000c7a",
               "name": "Reid Scott",
               "profile_path": "/kBAeDUDA7XJRXFLGNALlpE5d3lA.jpg",
               "id": 81316,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "School Yard Player",
               "gender": 0,
               "credit_id": "53160599c3a36813c9000cc1",
               "name": "Meredith Prunty",
               "profile_path": "/hLElwqNOhm1EMcSxgjJT3lnYHn0.jpg",
               "id": 1298582,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Young Woman",
               "gender": 1,
               "credit_id": "531605a3c3a368136e000cd4",
               "name": "Sarah Nicklin",
               "profile_path": "/sasH0QdXqro68Eo5ljVci5kXGPF.jpg",
               "id": 98421,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Young James",
               "gender": 2,
               "credit_id": "57fa3e9d9251411fb3006e6d",
               "name": "Richard Meehan",
               "profile_path": null,
               "id": 1492565,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Bar Fly",
               "gender": 0,
               "credit_id": "531605b7c3a3681388000c7e",
               "name": "Suzanne Prunty",
               "profile_path": null,
               "id": 1298583,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Student",
               "gender": 0,
               "credit_id": "531605c3c3a368136e000cd8",
               "name": "Maeve Power",
               "profile_path": null,
               "id": 1298584,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Young Abby",
               "gender": 0,
               "credit_id": "531605cdc3a368137b000cde",
               "name": "Nikki Hovan",
               "profile_path": null,
               "id": 1298585,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "533a8a319251417dad005a5c",
               "name": "Alex Luna",
               "profile_path": null,
               "id": 1306273,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53160545c3a3681388000c71",
               "name": "Kenn MacRae",
               "profile_path": null,
               "id": 1223595,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53160554c3a36813c2000c84",
               "name": "Danny McKinnon",
               "profile_path": null,
               "id": 1225674,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "533a8927925141291000005d",
               "name": "Rajan Kamahl",
               "profile_path": null,
               "id": 990069,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "533a89519251417d9b005dbb",
               "name": "Brandon Cox",
               "profile_path": null,
               "id": 967417,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a89d05ac3a36863e7067047",
               "name": "Michael E. Phillips",
               "profile_path": null,
               "id": 566689,
               "department": "Crew",
               "job": "Post Production Consulting"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.200725,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 257974,
      "vote_count": 2,
      "budget": 0,
      "overview": "The story follows Abby, a thirty-something artist living in Rhode Island caring for her husband William after he's tragically injured in a bar fight. As she attempts to coax him back to health, James, her childhood sweetheart and unrequited love, attempts to coax her back into living life again herself. The complicated love triangle that ensues is touching, poignant, and concludes with a realization that's as profound as it is beautiful.",
      "similar": [],
      "original_title": "Missing William",
      "runtime": 91,
      "poster_path": "/x6TBgbHURtlJldgqVaAnmyPuspz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mirabelle Pictures",
            "id": 39708,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aloris Entertainment",
            "id": 73400,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "JLG Films",
            "id": 22811,
            "origin_country": ""
         }
      ],
      "release_date": "2014-03-07",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kenn MacRae"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Dan McKinnon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1633224/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAyMTA1NDE1NDFeQTJeQWpwZ15BbWU4MDg2NDM3MTIx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Brandon Routh, Spencer Grammer, Courtney Ford | See full cast and crew »"],
      "reviews": [
         "I am not sure if I should be writing a review or not. This is my first one, but I was fortunate enough to get an advance screening of this film at the Rhode Island International Film Festival and I can't wait until this film is released. The movie is extremely engaging and the emotional performances by all the lead actors are some of the best I have ever seen. I am a huge Superman fan and I can say that Brandon's performance in this film is the best pure acting he has ever done. I only found out later that the lead actress is his real life wife (she did an amazing job as well). The performances were so believable. But above all else, the ending absolutely blew me away. Can't wait to see it again!",
         "I only checked this movie out because Brandon Routh was in it and wanted to see his acting outside of Superman Returns and Arrow. It was a cute, little movie about a man named James who returns to small town from his childhood after he was laid off from his job. When he was a preteen, his mother took him and fled their home because his father was abusive towards his mother. They moved to a small town where James is bullied with no friends and he meets Abby who befriends them. They spend their childhood exploring the small town and hanging out with each other even sharing their first kiss together. When James' father shows up off scene and finds them and takes them away, James promised Abby that he would return one day. Many years later, James return to the small town where he meets Abby. He finds out that she is now an artist and engaged to a man named William. The night that Abby marries William, James meets Jill, a local gym instructor,at a local bar but her character is unnecessary, adds nothing to the plot, and probably only was added to give James someone when it is quite obvious that he is still in love with Abby to both Jill and William. A year after Abby and William married, they meet James at the same bar he met Jill to celebrate his birthday. When Abby and William arrive at the bar, a drunkard sexually harasses Abby. William jumps to her defense. When the drunkard refuses to back down and apologize, James sucker punches the drunkard down to the floor and the bar owner kicks the drunkard out. When the foursome leaves the bar, the drunkard is waiting for his revenge and ends up sucker punching William and knocking him to the ground and hitting his head on a steel truck ball. He is taken to the hospital bleeding and losing consciousness. The second half of the movies focuses on William now a mute and Abby who stops living her life and painting in order to take care of William because she feels guilty about what happens to him. The final few minutes of the movie takes a cute twist that strengthen a movie that is otherwise another generic love story. I enjoyed this movie. I enjoyed the cute love story between Abby and James as both children and adults and how powerful their bond is even though years of separation. It's a cute little romantic movie to waste a couple of hours watching. Routh was amazing and so was his co-star Courtney Ford as Abby. Great movie and cute romantic drama.",
         "Saw it on Netflix streaming movies. Based on the very few reviews and votes not many people have seen this movie. Brandon Routh, in my opinion, is one of the more under-appreciated actors. Here he is James Anderson, working as an offshore drilling engineer, but gets furloughed and heads back to Rhode Island where he grew up. He had not been back in maybe 20 years. We learn much all during the movie via flashbacks, and we see that as an 11 or 12 yr old James had a very close friend named Abby. They had lost touch but when he gets back home finds her in the midst of her art exhibit. We can sense that Jim and Abby are perfect for each other but she is engaged, soon to be married. Courtney Ford plays the adult Abigail Leeds and Reid Scott is William Leeds who she is marrying. Something bad happens, and the dynamics of all the relationships change. That includes Jim's now girlfriend Spencer Grammar (daughter of Kelsey Grammar) as Jill. SPOILERS: All of them were out at a night spot, celebrating, when a ride drunk grabs Abby's butt. He refuses to back down and Jim punches him out. A bit later, as they are walking outside away from the nightspot the drunk attacks, hits William, who falls and injures himself badly. Then most of the movie is Abby staying inside with William trying to rehabilitate him. He never speaks. Jim actually moves in the help Abby. Then the big twist ... we see in minor flashbacks that all the times Abby thought William was there, silent, he was not. He had actually died but she could not come to grips with that, until finally.",
         "I didn't know what to expect when I watched this film. At one point, I did have an idea of what was really happening but the story was so moving that I just let my theories go. Brandon and Courtney are great. I love the idea that love is forever. An amazing, beautiful film. *** SPOILER ALERT *** *** DO NOT READ PAST THIS LINE IF YOU DON'T WANT SPOILERS!!! ********** ********** ********* ********* ******* ******** ******** ********* * * * Okay, the pill bottle kind of gave itself away, esp when James * looked at the bottle and took a pill. Why would someone do that? * I figure it was some sort of anti-anxiety, calming medicine that * was safe enough for him to take since he was probably all mentally * drained from being there and helping Abbey. * * Then the scene with the milkman where the milkman just stared into * space caught my attention. I was like, \"Why would anyone be so rude * as to just stare at someone like that?\" I know it's possible, but * this second clue added to the first led me to believe that I was * going down a path where Abbey was hallucinating William. * * Then I saw the movie title again and I was like \"Yeah! That's it!\" * Still, I enjoyed the ride in this movie and will tell others about * it. It's very much the same idea as that ghost story with Bruce * Willis, but with a love theme."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Aloris Entertainment",
         "JL Films",
         "Mirabelle Pictures"
      ],
      "summaries": [
         "An artist ceases living a life of her own to care for her severely injured husband when a long-lost childhood friend attempts to help her find her own life again.",
         "Old love and new love collide when a tragic accident brings a woman's childhood sweetheart back into her life."
      ],
      "budget": 3000000
   },
   "movielensId": 112596,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-03-07",
      "dvdReleaseDate": null,
      "directors": ["Kenn MacRae"],
      "runtime": 91,
      "movieId": 112596,
      "title": "Missing William",
      "mpaa": "PG",
      "actors": [
         "Brandon Routh",
         "Courtney Ford",
         "Spencer Grammer",
         "Reid Scott",
         "Meredith Prunty",
         "Sarah Nicklin",
         "Richard Meehan",
         "Suzanne Prunty",
         "Maeve Power",
         "Nikki Hovan"
      ],
      "imdbMovieId": "1633224",
      "originalTitle": "Missing William",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["KlNpjiVYVPk"],
      "plotSummary": "The story follows Abby, a thirty-something artist living in Rhode Island caring for her husband William after he's tragically injured in a bar fight. As she attempts to coax him back to health, James, her childhood sweetheart and unrequited love, attempts to coax her back into living life again herself. The complicated love triangle that ensues is touching, poignant, and concludes with a realization that's as profound as it is beautiful.",
      "tmdbMovieId": 257974,
      "avgRating": 1.5,
      "releaseYear": "2014",
      "numRatings": 2,
      "posterPath": "/x6TBgbHURtlJldgqVaAnmyPuspz.jpg"
   }
}