{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "pedophilia",
            "id": 2337
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "lgbt teen",
            "id": 163037
         }
      ],
      "imdb_id": "tt0073839",
      "video": false,
      "title": "A Child in the Crowd",
      "recommendations": [
         63214,
         104089,
         76268,
         115502,
         36457,
         57702
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Child",
               "gender": 0,
               "credit_id": "591bb8b09251414a57001ebf",
               "name": "Jean François Cimino",
               "profile_path": null,
               "id": 1818420,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Paul (Teenager)",
               "gender": 0,
               "credit_id": "591bb8d1c3a368723d002636",
               "name": "César Chauveau",
               "profile_path": null,
               "id": 1499846,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "mother of Paul",
               "gender": 0,
               "credit_id": "591bb8e5925141485e0023c6",
               "name": "Annie Kovaks",
               "profile_path": null,
               "id": 1818421,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Micheline, enfant",
               "gender": 0,
               "credit_id": "591bb903c3a368774e002502",
               "name": "Cécile Cousseau",
               "profile_path": null,
               "id": 1818422,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Micheline, adolescente",
               "gender": 0,
               "credit_id": "591bb943c3a368799b0020e8",
               "name": "Claude Treille",
               "profile_path": null,
               "id": 1818423,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Father of Paul",
               "gender": 0,
               "credit_id": "591bb95dc3a368774e00255d",
               "name": "Jean Bertal",
               "profile_path": null,
               "id": 1818424,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "La grand-mère",
               "gender": 0,
               "credit_id": "591bb978925141482f002297",
               "name": "Gabrielle Sassoum",
               "profile_path": null,
               "id": 1818425,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "La maîtresse (as Raymonde Mauffroy)",
               "gender": 0,
               "credit_id": "591bb996c3a3687912001feb",
               "name": "Raymonde Badé-Mauffroy",
               "profile_path": null,
               "id": 1662235,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "School Director",
               "gender": 0,
               "credit_id": "591bb9b2c3a368774e0025aa",
               "name": "Jacques Benoît-Lévy",
               "profile_path": null,
               "id": 1818429,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Gilles",
               "gender": 0,
               "credit_id": "591bb9c5c3a36878fe001fea",
               "name": "Claude Cernay",
               "profile_path": null,
               "id": 1792612,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Laurent",
               "gender": 0,
               "credit_id": "591bb9efc3a3687a8e00211f",
               "name": "Jurgens Doeres",
               "profile_path": null,
               "id": 1273249,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Jacques",
               "gender": 0,
               "credit_id": "591bba02c3a368791200202c",
               "name": "Bernard Soufflet",
               "profile_path": null,
               "id": 1175254,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a9fc3a36847f81d8d5f",
               "name": "Gérard Blain",
               "profile_path": "/4FPyV9TENbClbiPv4UUikHXinKK.jpg",
               "id": 24298,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "598a1e8d925141370600ebb4",
               "name": "Gérard Blain",
               "profile_path": "/4FPyV9TENbClbiPv4UUikHXinKK.jpg",
               "id": 24298,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "598a1e95c3a36874ff019934",
               "name": "Michel Pérez",
               "profile_path": null,
               "id": 1866255,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.194078,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 108574,
      "vote_count": 3,
      "budget": 0,
      "overview": "Deserted by his father, and dislocated by the Second World War, Paul is a boy who wants affection and attention and cannot find it at home. For a while, he becomes the pet of some German soldiers, running errands for them. Later, he helps the Resistance, and when the Americans come to stay, he is really in his element with them.",
      "similar": [
         449176,
         184352,
         26280,
         383526,
         26933,
         338189,
         413666,
         17483,
         382475,
         380874,
         222918,
         47643,
         340684,
         10938,
         160165,
         377154,
         258034,
         26371,
         376867,
         4369
      ],
      "original_title": "Un enfant dans la foule",
      "runtime": 85,
      "poster_path": "/zfQGdzgcZ0hCPIg4BF6QMIITt9K.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Télépresse Films",
            "id": 33078,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cinépol",
            "id": 61617,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Renn Productions",
            "id": 82,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Société Française de Production (SFP)",
            "id": 6849,
            "origin_country": ""
         }
      ],
      "release_date": "1976-06-04",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gérard Blain"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Gérard Blain",
         "Michel Pérez"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0073839/",
      "coverLink": null,
      "actors": [
         "Jean François Cimino",
         "César Chauveau",
         "Annie Kovaks"
      ],
      "reviews": [
         "One of the mavericks of the French cinema ,Gerard Blain became famous with three great works ,two of which (\"Le Beau Serge\" \"Les Cousins\" )belonged to the Nouvelle Vague whereas the third one was one of the masterpieces of the old one (\"Voici Le Temps Des Assassins\"). The clues to his future as a director were not Claude Chabrol or Julien Duvivier though.His most notable influence in \"Un Infant Dans La Foule\" is arguably Robert Bresson.The amateurish acting of the actors who deliver their lines in a neutral voice ,a sense of ellipsis ,a voice over ,all that reminds you of Bresson. \"Un Infant Dans La Foule\" is arguably the great lost masterpiece of the French seventies ;it was nominated at Festival De Cannes but it was a commercial failure.Since Pialat's \"L'Enfance Nue\" (1968),nobody had made a so brutally honest movie .Blain,obsessed with personal pain ,made a complete artistic statement of great courage and even candor. It tells about a teenager's rejection by the community during the days of the German occupation.Dry-eyed,it tells of a mother who can't hear his boy knocking on her door,of painful growing-up .We follow the boy as he helps the Resistant fighters just to make his mum love him.We see him wandering the streets where he is the only one to take pity on a \"Femme Tondue\" (closely-cropped hair women,that was the populace did to women who slept with the enemy) as the allies come near Paris. Is the boy gay or does he have affairs with men because he can provide his family with food?It's impossible to answer in that context.We are beyond any moral and the boy's need for love is so intense he's looking for someone all along the movie.There is no hint at homosexuality,no risqué scene,all is suggested with an incredible sense of decency. In his absorbing memoirs \"J'Ai Oublié DE Vous Dire\" ,Jean-Claude Brialy ,who was Blain's co-star in \"Le Beau Serge\" and \"Les Cousins\" ,wrote that he was sexually assaulted as an adolescent and that his hatred for homosexuals was strong.In this film,it does not show: neither the teacher nor the young man are \"unkind\" people;actually they are \"neutral\". The ending is simple but this kind of simplicity is absolutely mind-boggling: Boy: They are looking for extras for a movie ;maybe they're going to take me.... Mother:What Film? Boy:\"Les Enfants Du Paradis\" On the street,the boy meets a man who asks him for a light.This man is Gérard Blain himself. Gérard Blain was an extra for \"Les Enfants Du Paradis\". A film crying to be watched.",
         "The story is only partly autobiographical according to the director, but it seems to have been true in all its important elements, as at least the following applies to both Gérard Blain and his creation Paul: a lonely boy, whose father had abandoned the family years before, and who gets on badly with his mother and only sibling (an elder sister), leaves school prematurely and finds himself, aged thirteen and a half in the summer of 1944, half-living on the streets of Paris; good-looking, he is soon embroiled in a series of short affairs with adults of both sexes until he receives an offer to be in a film. This is surely enough true story to explain the film's extraordinary emotional authenticity. The historical setting of the liberation of Paris provides a fortuitously excellent dramatic background to what one might expect from the foregoing to be a steamily sensational story, but is instead something much greater: a heart-wrenching story of an eminently lovable boy's unsuccessful quest for love, told with unfailing tenderness and honesty. I know of no other film which depicts nearly so well the emotional longings of the pubescent boy who for one reason or another is not getting the love he needs. Naturally satisfying his new sexual longings will become wrapped up in his quest for love, and it is only sound good sense that, allowed the freedom afforded to Paul by an uninterested family and the chaos of war, he will seek for love the way Paul does. Honest portrayal of this has become virtually impossible since the film was made due to the new hysteria surrounding pubescent sex. This doubtless explains why it is not receiving the acclaim it deserves, even though Blain leaves the sex underpinning some of Paul's emotional involvements to be inferred. Important truths are daringly exposed that are generally forgotten or misunderstood. The pubescent boy's new capacity for bonding with adults through sexual intimacy has historically often been his most natural and powerful means of survival until he can compete as an adult, and why disdain such a weapon? That the film is entirely non-judgmental about all involved in this is another indication of its obstinate honesty in the face of popular prejudice. An associated modern fiction the film refuses to indulge is that a boy like Paul and his various male special friends must be gay. Sexual orientation is simply not an issue in the film just as it generally has not been for boys of thirteen who have not been indoctrinated otherwise (as all are today). Like most men attracted to adolescent boys in the not-so-very-old days before this form of love was singled out for savage suppression, the men attracted to Paul are, excepting a presumably still unmarried young man, shown to be genuinely devoted to their wives and children, whose photos they show him without sense of conflict, and not therefore gay either. The story is tragic because Paul's quest for love is so relentlessly and undeservedly unsuccessful. Cursed with a brutally unfeeling mother who is the only real villain in the story, some of the most affecting scenes concern his touching and vain attempts to win her affection. The vicissitudes of war see off his German and American soldier lovers. An affectionate married teacher ends their liaison by frankly admitting circumstances don't allow him to give him the love he needs. The pathos of all this is greatly increased by Paul's tender disposition. Never does he react with anything but understanding to repeated rejection, nor does bitter experience diminish his own tenderness, most hauntingly captured when he alone does not join the baying crowd taunting a woman stripped naked and shaven-headed for having slept with a German, but instead gently puts his hand on her shoulder in a sign of compassion, surely one of cinema's greatest moments. Edmund Marlowe, author of Alexander's Choice, the quest for love of another boy this age, www.amazon.com/dp/1481222112"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Cinépol",
         "Renn Productions",
         "Société Française de Production (SFP)"
      ],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 112644,
   "movielens": {
      "languages": [
         "Deutsch",
         "Français",
         "English"
      ],
      "releaseDate": "1976-06-04",
      "dvdReleaseDate": null,
      "directors": ["Gérard Blain"],
      "runtime": 85,
      "movieId": 112644,
      "title": "A Child in the Crowd",
      "mpaa": null,
      "actors": [
         "Jean François Cimino",
         "César Chauveau",
         "Annie Kovaks",
         "Cécile Cousseau",
         "Claude Treille",
         "Jean Bertal",
         "Gabrielle Sassoum",
         "Raymonde Badé-Mauffroy",
         "Jacques Benoît-Lévy",
         "Claude Cernay",
         "Jurgens Doeres",
         "Bernard Soufflet"
      ],
      "imdbMovieId": "0073839",
      "originalTitle": "Un enfant dans la foule",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Deserted by his father, and dislocated by the Second World War, Paul is a boy who wants affection and attention and cannot find it at home. For a while, he becomes the pet of some German soldiers, running errands for them. Later, he helps the Resistance, and when the Americans come to stay, he is really in his element with them.",
      "tmdbMovieId": 108574,
      "avgRating": 3,
      "releaseYear": "1976",
      "numRatings": 1,
      "posterPath": "/zfQGdzgcZ0hCPIg4BF6QMIITt9K.jpg"
   }
}