{
   "tmdb": {
      "original_language": "pt",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0977642",
      "video": false,
      "title": "The Ballroom",
      "recommendations": [],
      "backdrop_path": "/zETAdNdhNFKbO9VJGeBH8YeWtwG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Álvaro",
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109bfd",
               "name": "Leonardo Villar",
               "profile_path": "/xgpNt8m8nnqG71CsFxeMEFTdq8e.jpg",
               "id": 230263,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe48c3c3a368484e109c01",
               "name": "Tônia Carrero",
               "profile_path": "/3VQLfEKttEI98MmdoOz3dQuQ9HG.jpg",
               "id": 1196268,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marici",
               "gender": 1,
               "credit_id": "52fe48c3c3a368484e109c05",
               "name": "Cássia Kis Magro",
               "profile_path": "/eEW4PWJE0XBPmbUr9kY2kyKmCU7.jpg",
               "id": 91706,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Elza",
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109c09",
               "name": "Betty Faria",
               "profile_path": "/1iDQySTDoYIJwYKbVVCvNFbjXNQ.jpg",
               "id": 974664,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Eudes",
               "gender": 2,
               "credit_id": "52fe48c3c3a368484e109c0d",
               "name": "Stepan Nercessian",
               "profile_path": "/xYvGftDr87YmCarLa7Q8E6RF1Y3.jpg",
               "id": 112110,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Bel",
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109c11",
               "name": "Maria Flor",
               "profile_path": "/rSiEGFgMfXPoBhxYJDdQKQF4iz6.jpg",
               "id": 129884,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Marquinhos",
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109c15",
               "name": "Paulo Vilhena",
               "profile_path": "/5w3YtpbLEF4wm2fKMpKUp6OPrab.jpg",
               "id": 92190,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ana",
               "gender": 0,
               "credit_id": "562905ab9251414ce1002127",
               "name": "Elza Soares",
               "profile_path": null,
               "id": 1399446,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Nice",
               "gender": 0,
               "credit_id": "5695bdea9251413f820007c9",
               "name": "Miriam Mehler",
               "profile_path": null,
               "id": 1562753,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Garçon Gilson",
               "gender": 2,
               "credit_id": "5a6b78460e0a2624450022fe",
               "name": "Marcos Cesana",
               "profile_path": "/5ej1imGsEIusFhSMUruEslr0cWz.jpg",
               "id": 129688,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Rita",
               "gender": 0,
               "credit_id": "5a6b785c0e0a26244b00225e",
               "name": "Clarisse Abujamra",
               "profile_path": "/dSmZU8mTwnoadU5ZLvHuvHxqYOR.jpg",
               "id": 1205106,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Ernesto",
               "gender": 0,
               "credit_id": "5a6b787ac3a36872db0021ed",
               "name": "Luiz Serra",
               "profile_path": "/vCBHXtXjxpyn4vGoXqQ0XoPYrVJ.jpg",
               "id": 1333859,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109bf9",
               "name": "Laís Bodanzky",
               "profile_path": "/rpmIBkGQCzCWzYn7ceWCy1WaD2.jpg",
               "id": 144808,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109c1b",
               "name": "Laís Bodanzky",
               "profile_path": "/rpmIBkGQCzCWzYn7ceWCy1WaD2.jpg",
               "id": 144808,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe48c3c3a368484e109c21",
               "name": "Luiz Bolognesi",
               "profile_path": null,
               "id": 144810,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "587804cf925141104a00c3ae",
               "name": "J. C. Violla",
               "profile_path": null,
               "id": 1737911,
               "department": "Crew",
               "job": "Choreographer"
            },
            {
               "gender": 0,
               "credit_id": "5878051bc3a36850f000ced3",
               "name": "Adriana Falcão",
               "profile_path": null,
               "id": 123765,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5905c469c3a3684ad701c4c7",
               "name": "Walter Carvalho",
               "profile_path": "/y7FAwZ5YBKvCjkNRMTMIksaG97r.jpg",
               "id": 10038,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.212248,
      "production_countries": [{
         "iso_3166_1": "BR",
         "name": "Brazil"
      }],
      "id": 74294,
      "vote_count": 4,
      "budget": 0,
      "overview": "An evening in an old time dance hall in Sao Paulo introduces us to local characters who reminisce about the past, wonder about the future, have fun, flirt, fight and, of course, dance. Its earthy humour and eternal themes of ageing, loneliness and desire is an antidote to grumpy old men and women everywhere.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         3981,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485
      ],
      "original_title": "Chega de Saudade",
      "runtime": 95,
      "poster_path": "/10gpwCoN3618604XJ2cVBcvRFsy.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2007-11-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Brazil",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Laís Bodanzky"],
      "runtime": 95,
      "synopsis": "Chega de Saudade conta numa única noite várias histórias vividas pelos freqüentadores de um salão de baile. Com muita música e dança, os acontecimentos fazem o espectador se sentir dentro da vida pulsante do baile. Circular como o salão, a trama gira em torno de Marici (Cássia Kiss), e Eudes (Stepan Nercessian), que vão junto ao baile. Marici faz amizade com Bel (Maria Flor), uma jovem estrangeira no salão, que namora o rapaz que cuida do som, Marquinhos (Paulo Vilhena). Eudes tira Bel para dançar, o que provoca reações diversas. Enquanto isso, Alice (Tônia Carrero) e Álvaro (Leonardo Villar) enfrentam as limitações da idade, sem abandonar o salão. E Elza (Betty Faria) chega excitada ao baile, cheia de expectativas e com uma amiga de primeira viagem a tira-colo - Nice (Mirian Mehler). As histórias se misturam com outras, não menos vibrantes. A libido de um par de dançarinos de tango quase transborda a tela; duas mulheres (a esposa e a amante) duelam pelo mesmo dançarino; um gordo dança sozinho; o garçom costura tudo, como quem usa linha e agulha. Sutil, empolgante e feminino, o filme, aos poucos, faz o espectador se sentir íntimo dos personagens e dentro do salão.",
      "writers": [
         "Laís Bodanzky",
         "Luiz Bolognesi"
      ],
      "originalLanguage": "Portuguese",
      "imdbLink": "http://www.imdb.com/title/tt0977642/",
      "coverLink": null,
      "actors": ["Stars: Leonardo Villar, Tônia Carrero, Cássia Kis Magro | See full cast and crew »"],
      "reviews": [
         "The scenery is an old-fashioned dance hall (\"gafieira\", as we call them in Brazil) that has seen better days. The people who go there are in search of a good time, socializing (and, why not, flirting), fond memories and the very special sort of human contact that ballroom-dancing can provide. Almost all of them are old-timers; those under 50 can be spotted across the room like a flashlight in the dark. We get to meet a bunch of easily recognizable characters: the old, grouchy former ballroom king who's got his foot in plaster (Leonardo Villar); the beautiful old lady slowly sliding into the foggy world of Alzheimer's disease (Tônia Carrero); the \"simpaticone\" charmer and his irresistible soft small talk (Stepan Nercessian); the roué ex-Don Juan who's become a pool of sarcasm (Luiz Serra); the aging beauty who fails to see she's lost her lure (Betty Faria); the shy spinster who still waits for male initiative (Cássia Kiss); the sensuous, mature tigress whose hot tango is the hors-d'oeuvre to vivid sexual pleasures (Clarisse Abujamra); the huge-bellied, sweaty fatso who dances the night away all by himself (Beno Bider)... Among all these old-timers, a very young, conflicted couple call attention: the frowning, overstressed ballroom sound technician (Paulo Vilhena) and his lovely starry-eyed girlfriend who's never been to a ballroom before (Maria Flor). Laís Bodanzky's second feature -- seven (!) years after her critical and box-office success \"Bicho de Sete Cabeças\" -- is a character study comedy influenced by Ettore Scola's and Robert Altman's ensemble pieces, especially Scola's \"Le Bal\" (1983) in its integration of music, dance and emotion, and \"La Cena\" (1998), as it also takes place in one single evening. No less than 10 writers have collaborated in the script, so it's no wonder the film seems a collage of sketches, with somewhat stereotyped characters. But there's still a sense of unity and roundness, thanks to Bodanzky's tight direction, Walter Carvallho's hand-held camera-work (which is so close to the actors' faces and bodies it can only be described as biopsy-like) and above all the strong performances by a dream cast of veterans. \"Chega de Saudade\" is a tribute to some of the most emblematic Brazilian film actors of all time, and the two newcomers -- Paulo Vilhena (a soap-opera ham who gives an unexpectedly fine, subtle performance) and the sensitive and lovely beyond words Maria Flor, with her knock-out smile and ebony eyes that can melt iron -- rise up to the occasion. There are no tricks in the actors' play; never before have sagging skins, receding hairlines, swollen feet, dried-up hands, double chins and big bellies been so ruthlessly photographed on screen. It takes a while to accept what old age and multiple face-lifts have done to some of the most beautiful Brazilian stars (especially to the one who, in her prime, was surely one of the world's most beautiful women, the now 85-year-old Tônia Carrero). There's no attempt to disguise their ravaged faces with special make-up or soft lighting, and seeing them in blunt, realistic proximity sometimes is a little awkward, as if we'd caught them naked. But soon we realize those zillion wrinkles and age spots have their own kind of beauty, and their talents have now a rich ripeness that only old age and decades of professional experience can bring. What a joy to see them sink their teeth in their roles! Even the cameos by Jorge Loredo, Marlene Silva or Selma Egrei bring fond memories and a sense of comforting familiarity: it's as if we're meeting dear old relatives we hadn't seen for a long time. The soundtrack is another big asset: there are some 20 vintage Brazilian songs in various genres (including samba, forró, choro, samba-canção, pop, etc) performed by a big band with singers Elza Soares -- her face unrecognizable after innumerable face-lifts and collagen injections, but still showing powerful lungs and infectious swing at 70 -- and Marku Ribas. There are also some vintage ballroom recordings, from an unspeakably kitsch pop version of Beethoven's \"Moonlight Sonata\" and Marvin Gaye's soul classic \"Let's Get It On\" to Norma Bengell's sultry rendition of \"C'est Si Bon\". Non-Portuguese-speaking audiences won't get the extra subtext that the lyrics of the Brazilian songs bring to each scene, but there will still be plenty to enjoy musically, anyway. Because of its setting, cast and soundtrack, \"Chega de Saudade\" may register more deeply with Brazilian viewers over 40 (or 50), but its characters and themes -- getting old and learning to dig it, fighting loneliness, yearning for close physical contact in old age, keeping the love door open, learning to treasure memories while preventing them from hampering the present -- are universal and easily identifiable by any audience. \"Chega de Saudade\" has got an earthy sense of humor and, even though some of the dialog is schematic and the script seems chopped and some characters are just rough sketches that begged for more screen time to fully \"exist\", it's thankfully devoid of cheap schmaltz. Recommended for those who enjoy ensemble acting, dancing, music, laughter...and it can probably work miracles for grumpy old heels.",
         "The task was not an easy one: making a movie that starts and ends in a ballroom for elders. Despite this big constraint, the movie achieves the target of depicting a parallel universe where elders can truly live the essence of life through a turmoil of emotions and feelings. There is no age for having fun, there is no age for love, for a flirt, for envy and defeat. The director manages to lead the audience through a journey inside the emotions of a \"Saturday night fever\" in a normal spot for normal people. The result comes out of a collage of human situations were each situation, taken one by one, may not mean a lot but the overall picture is seizing. Eventually, each character seems to live the night as if it were the life itself, without a tomorrow, without a life outside the ballroom. All it matters is dancing, and women that are not invited to dance suffer an unbearable defeat. The emotions in that ballroom are so simple and so breathtaking that next Saturday you will be more inclined to go out with your grandfather rather than with the people of you age. I found that the final poetry that Eudes plays to Marici at the end of the movie means a within the movie. I think that, eventually, everybody is in love with life and living true emotions is the way to stay alive. To do that, people is ready to lie, to betray and to pretend. But what after the ball?",
         "one of films who has the force to seduce. for histories of characters, for the small universe who reflects the nuances of life, for the old flavor of lost age, for music, for dance as tools of survive. a film precious for its delicate air. for the embroidery of lives, for precise manner to present, in few lines, the map of an existence, for the young couple and for the old don Alvaro, for the end and for the feeling of a kind of archaeological of director. sentimental, beautiful, fragment from lost universe, it is one of films who seduces, image by image the viewer who becomes part of a circle in which the past, the frustration, the love, the lovely memories are frame for a movie brilliant for its profound honesty."
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Gullane Filmes",
         "Buriti Filmes",
         "Arte France"
      ],
      "summaries": ["In an old-time dance hall (the \"gafieira\") in São Paulo, one evening is all it takes to meet different characters as they remember the past, live the present, wonder about the future, have fun, flirt, fight and, naturally, dance."],
      "budget": 0
   },
   "movielensId": 112871,
   "movielens": {
      "languages": [""],
      "releaseDate": "2007-11-25",
      "dvdReleaseDate": null,
      "directors": ["Laís Bodanzky"],
      "runtime": 95,
      "movieId": 112871,
      "title": "The Ballroom",
      "mpaa": null,
      "actors": [
         "Leonardo Villar",
         "Tônia Carrero",
         "Cássia Kis Magro",
         "Betty Faria",
         "Stepan Nercessian",
         "Maria Flor",
         "Paulo Vilhena",
         "Elza Soares",
         "Miriam Mehler",
         "Marcos Cesana",
         "Clarisse Abujamra",
         "Luiz Serra"
      ],
      "imdbMovieId": "0977642",
      "originalTitle": "Chega de Saudade",
      "genres": [
         "Drama",
         "Romance",
         "Music"
      ],
      "youtubeTrailerIds": ["hDU_NB2DvOs"],
      "plotSummary": "An evening in an old time dance hall in Sao Paulo introduces us to local characters who reminisce about the past, wonder about the future, have fun, flirt, fight and, of course, dance. Its earthy humour and eternal themes of ageing, loneliness and desire is an antidote to grumpy old men and women everywhere.",
      "tmdbMovieId": 74294,
      "avgRating": 3.75,
      "releaseYear": "2007",
      "numRatings": 2,
      "posterPath": "/10gpwCoN3618604XJ2cVBcvRFsy.jpg"
   }
}