{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spaceship",
            "id": 9831
         },
         {
            "name": "space adventure",
            "id": 195114
         },
         {
            "name": "rubber duck",
            "id": 205267
         }
      ],
      "imdb_id": "tt1954843",
      "video": false,
      "title": "Space Milkshake",
      "recommendations": [
         93030,
         32003,
         58728,
         35976,
         180323,
         124873,
         36531,
         71076,
         52477,
         60619,
         2464,
         225301,
         38389,
         16925,
         26978,
         58729,
         7177,
         47412,
         191094,
         80200
      ],
      "backdrop_path": "/WHgowcHmy1lXITLOGyS0oJANMa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Cpt. Anton Balvenie",
               "gender": 2,
               "credit_id": "52fe4cbec3a36847f823ceb3",
               "name": "Billy Boyd",
               "profile_path": "/nwNHDM67VYAb87sjSqYQVWaZKyK.jpg",
               "id": 1329,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lt. Tilda Gennaro",
               "gender": 1,
               "credit_id": "52fe4cbec3a36847f823ceab",
               "name": "Kristin Kreuk",
               "profile_path": "/dvlrKZ9kAi6EKysh13Nz5moc1as.jpg",
               "id": 55751,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Valentina",
               "gender": 1,
               "credit_id": "52fe4cbec3a36847f823ceaf",
               "name": "Amanda Tapping",
               "profile_path": "/sjBvf2qiDruwr5A1RLki8A7H6we.jpg",
               "id": 26087,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jimmy Anderson",
               "gender": 2,
               "credit_id": "52fe4cbec3a36847f823ceb7",
               "name": "Robin Dunne",
               "profile_path": "/933wsoMxTv9ovQxzX5U1Jie3nOs.jpg",
               "id": 43426,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gary (voice)",
               "gender": 2,
               "credit_id": "54d91debc3a3687ac200029c",
               "name": "George Takei",
               "profile_path": "/5eBSvAPy6DnWsMX61IlJyjUzCRJ.jpg",
               "id": 1752,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Wendi (voice)",
               "gender": 1,
               "credit_id": "54d91e7e9251410a470001e9",
               "name": "Amy Matysio",
               "profile_path": "/au9d1bdeFkpjs9OEVl2vKrCmf6z.jpg",
               "id": 62246,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ground Control (voice)",
               "gender": 0,
               "credit_id": "54d91e8d9251410a470001ec",
               "name": "Barry Lane",
               "profile_path": null,
               "id": 1425122,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cbec3a36847f823cea7",
               "name": "Armen Evrensel",
               "profile_path": null,
               "id": 1138433,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53b191aa0e0a26598000843d",
               "name": "Armen Evrensel",
               "profile_path": null,
               "id": 1138433,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.979882,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 167948,
      "vote_count": 18,
      "budget": 0,
      "overview": "Four low-ranking astronauts are stuck together on an orbital Sanitation Station after they bring a mysterious device aboard their ship and all life on Earth disappears. Little do they know they are about to come under attack by a mutating rubber duck named Gary, who wants to open a portal to his evil dimension and take over the Universe.",
      "similar": [
         348,
         126889,
         330459,
         15493,
         1891,
         1892,
         19995,
         118340,
         157336,
         228161,
         8077,
         274870,
         2103,
         27179,
         2067,
         563,
         602,
         2164,
         49849,
         9016
      ],
      "original_title": "Space Milkshake",
      "runtime": 85,
      "poster_path": "/vwfLuk7MFFzuPIoVEPdc8Sn2BGq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Foundation Features",
         "id": 12217,
         "origin_country": ""
      }],
      "release_date": "2012-10-26",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "We're ducked",
      "adult": false,
      "homepage": "http://spacemilkshake.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Armen Evrensel"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Armen Evrensel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1954843/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODc4NDA2MTAyNl5BMl5BanBnXkFtZTcwODA1NzEyOQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Kristin Kreuk, Amanda Tapping, George Takei | See full cast and crew »"],
      "reviews": [
         "This film completely passed my radar and I only came across it by accident. Some well-known actors in a film that draws on the same dead-pan humor and special effects as Red Dwarf. Kristin Kreuk looks great as usual. Amanda Tapping gives a good performance not too far removed from her character on Star Gate and, as expected, George Takei from Star Trek does a great voice for a very unusual visitor to the space station. Personally, I liked it. Just don't expect Star Wars - the budget wouldn't have stretched that far. Don't take it seriously and just go along for the ride. It's daft in places - but laugh-out loud in others. Worth a watch!",
         "In the not too distant future we find a crew of menial labor astronauts that crew a giant garbage space-station that is designed to clear debris from the orbital lanes of Earth. Soon after they recover a mysterious dimensional device, the crew discovers all life on Earth has ceased to exist and that they face an even greater crisis when a genetically mutated rubber duck terrorizes the station. Starring Amanda Tapping, Billy Boyd, Kristin Kreuk and Robin Dunne, Space Milkshake was the perfect ending to an already perfect day of science fiction at the inaugural Other Worlds Austin Sci-Fi festival. George Takei voices the rubber duck named Gary. I absolutely loved this film and loved that there is still such a thing as a lighthearted sci-fi comedy. It's refreshing to see space humor at the hands of smaller name actors and TV stars too. Sure George Takei is a household name and Billy Boyd was a hobbit, but trust me when I say that it does not cast one shadow on the chemistry between these actors. Boyd is comically eccentric as the Station's captain and fuels the blue-collar humor with his various quirks and idiosyncrasies. The fact that the film is set on a garbage space station only adds to the humor as the close proximity of the crew results in hilarious and often ridiculous scenarios. Ridiculous is actually the perfect word to describe this film but it's also just plain fun. It reminded me a lot of something like the Red Dwarf series only with more sci- fi references and shenanigans. George Takei is giant mutated rubber duck, what more could you possibly need to make you want to watch this movie? Its delightful fun for just less than 90 minutes, but it still retains an authentic feel to a futurist space story. The audience (*of sci-fi fans) was absolutely rolling in their seats at the various crew interactions and Billy Boyd's performance. I feel the need to add that asterisk in there just for good measure as your average movie-goer probably isn't going to find a hodgepodge of comedic science fiction very funny. The humor is probably on the same level as something as Hitchhiker's Guide to the Galaxy or the before mentioned Red Dwarf series, but whether you're a dedicated fan of those works or not, you're sure to at least crack a smile in Space Milkshake. Billy Boyd plays the Michael Scott of space albeit with more scenes of him barking orders in his underpants and squaring off with a giant mutated rubber duck. Read the full review and others like it on the Drive-in Zeppelin Website",
         "Enjoyable, pure and really simple. A very decent space comedy with well written characters, slightly above average actors with affordable dialogue, flowing plot and good enough photography. Office life in space and its routine-based timetable coupled with strained relationships and neurotic co-workers is even too credible. Taken for what it's worth and how much it was spent to make it deserves the viewer attention. It's not stellar nor incredibly funny but it would not hurt to see more movies made with this quality rather than boring and pretentious stuff that eventually costs triple this budget for half the entertaining value Space Milkshake can give.",
         "I hate spoof movies at the best of times, finding them extremely un-funny,(excepting the hilarious Shaun of the Dead), but this was really lame. I don't understand people drawing comparisons with Red Dwarf. This has none of the charm, and little of the humour that that has. I love Red Dwarf. I made an effort to see this film, as Billy Boyd mentioned it at a Comic Con that I attended. I can see why it died. He said it was made for we sci fi fans... and I can see how they thought it was... but it wasn't. Then again, I didn't like the re-make of The Hitch Hiker's Guide to the Galaxy, either. (Another show that I adored). Somehow this film just missed, like most supposed comedies of that ilk. It was like a lot of bad comedies... reminded me of Leslie Nielsen films... immature and unintelligent. OK maybe not that bad but, well... no. I think most sci fi fans are looking for their humour to be a bit more cerebral, or at least to be fresh and not spoofing other works. If I want slapstick, I go with WC Fields, and Laurel and Hardy. Rubber tentacles and rubber duckies don't do it for me. Nice try, and obviously some people liked it... I didn't. It was like that Uncle you have at dinner parties that keeps on going, thinking he's terribly witty, and laughing at his own jokes, never noticing that everybody else is bored to tears.",
         "a bit of a slapstick comedy set in space revolving around a space debris clearing station and its zany crew. Billy Boyd does an admirable job as Captain Anton, who is a cross between Shaun from Shaun of the Dead and Captain Mel from Firefly. Kruek is hot in her little space suit and ads some sex appeal. I didn't find Tapping to be that great, but she wasn't horrible, about the same for Dunne, who seemed to overact in parts. George Takei added some comedy relief as the voice of Gary, No stellar plot line here, just some slapstick space fun, decent enough for a quasi sci fi comedy. 5/10"
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Foundation Features",
         "Trilight Entertainment",
         "Empera Southpaw Productions"
      ],
      "summaries": ["Four blue collar astronauts who are stuck together on a Sanitation Station after they bring a mysterious device aboard their ship and all life on Earth disappears. Discovering what happened to civilization is only the first of many galactic-level crises the astronauts will have to face as they are about to come under attack by a mutating rubber duck named Gary, who wants to open a portal to his evil dimension and take over the Universe."],
      "budget": 0
   },
   "movielensId": 113218,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-10-26",
      "dvdReleaseDate": null,
      "directors": ["Armen Evrensel"],
      "runtime": 85,
      "movieId": 113218,
      "title": "Space Milkshake",
      "mpaa": "",
      "actors": [
         "Billy Boyd",
         "Kristin Kreuk",
         "Amanda Tapping",
         "Robin Dunne",
         "George Takei",
         "Amy Matysio",
         "Barry Lane"
      ],
      "imdbMovieId": "1954843",
      "originalTitle": "Space Milkshake",
      "genres": [
         "Science Fiction",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Four low-ranking astronauts are stuck together on an orbital Sanitation Station after they bring a mysterious device aboard their ship and all life on Earth disappears. Little do they know they are about to come under attack by a mutating rubber duck named Gary, who wants to open a portal to his evil dimension and take over the Universe.",
      "tmdbMovieId": 167948,
      "avgRating": 2.9,
      "releaseYear": "2012",
      "numRatings": 10,
      "posterPath": "/vwfLuk7MFFzuPIoVEPdc8Sn2BGq.jpg"
   }
}