{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1793223",
      "video": false,
      "title": "Free Samples",
      "recommendations": [
         123753,
         190638,
         45568
      ],
      "backdrop_path": "/c2TqJwO8kin2QcYNiDNthCLSKaR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jillian",
               "gender": 1,
               "credit_id": "52fe4a66c3a36847f81cbac3",
               "name": "Jess Weixler",
               "profile_path": "/tH6qsLYixRW4rQESu94cb2E1g0P.jpg",
               "id": 76999,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Tex",
               "gender": 2,
               "credit_id": "52fe4a66c3a36847f81cbac7",
               "name": "Jesse Eisenberg",
               "profile_path": "/c01G88eCpiLLmT4RIWGkr7nm31o.jpg",
               "id": 44735,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wally",
               "gender": 2,
               "credit_id": "52fe4a66c3a36847f81cbacb",
               "name": "Jason Ritter",
               "profile_path": "/tbhsO6zfHVTzDnGzkHhtBPI3OBp.jpg",
               "id": 50095,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Nancy",
               "gender": 1,
               "credit_id": "52fe4a66c3a36847f81cbacf",
               "name": "Halley Feiffer",
               "profile_path": "/55qE8oG18oJXDsbUxcvUDxitDI6.jpg",
               "id": 928396,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe4a66c3a36847f81cbad3",
               "name": "Keir O'Donnell",
               "profile_path": "/uGNKMREdVeNALjCFKjaPSgNIfNV.jpg",
               "id": 39213,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Paula",
               "gender": 1,
               "credit_id": "52fe4a66c3a36847f81cbad7",
               "name": "Jocelin Donahue",
               "profile_path": "/eQXBzPjo9K8MG9TVOoQDNoHEFwv.jpg",
               "id": 78804,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dana",
               "gender": 1,
               "credit_id": "52fe4a66c3a36847f81cbadb",
               "name": "Whitney Able",
               "profile_path": "/6y5KdwVTlB3o9ZGJ9iIoSCW850M.jpg",
               "id": 56677,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mr. Hightower",
               "gender": 2,
               "credit_id": "52fe4a66c3a36847f81cbae7",
               "name": "Matt Walsh",
               "profile_path": "/pHwLExdQGQYg8yNVSaF97TkMsoQ.jpg",
               "id": 59841,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Steel",
               "gender": 0,
               "credit_id": "52fe4a66c3a36847f81cbaeb",
               "name": "Craig Gellis",
               "profile_path": "/q0Af2eaH0S8uZa3ZjwTL72kd079.jpg",
               "id": 154829,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Neighbor",
               "gender": 1,
               "credit_id": "52fe4a66c3a36847f81cbaef",
               "name": "Suzy Nakamura",
               "profile_path": "/rymamRd9wzjZquxMBKWOkylD5wN.jpg",
               "id": 26998,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Peter",
               "gender": 0,
               "credit_id": "52fe4a66c3a36847f81cbaf7",
               "name": "Jordan Davis",
               "profile_path": null,
               "id": 1080162,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe4a66c3a36847f81cbafb",
               "name": "Tippi Hedren",
               "profile_path": "/5piyjLaNRESJZ2Q8comMEjXqZBW.jpg",
               "id": 6929,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Penny",
               "gender": 0,
               "credit_id": "5a55ad7b0e0a2607d101ea11",
               "name": "Jennifer June Ross",
               "profile_path": null,
               "id": 1106239,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Anna",
               "gender": 1,
               "credit_id": "5a55adb6c3a3685ed70201a4",
               "name": "Madison Leisle",
               "profile_path": "/t5DI68mBwPBP4R7lfGmMcw71eaO.jpg",
               "id": 1320470,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Richard Swinger",
               "gender": 2,
               "credit_id": "5a55adce9251417aa901c837",
               "name": "Joseph McKelheer",
               "profile_path": "/jFlXi4THkj0feUiRHdjPHEIULxK.jpg",
               "id": 65833,
               "order": 18
            },
            {
               "cast_id": 24,
               "character": "Larry",
               "gender": 2,
               "credit_id": "5a55adeb0e0a2607e401f3c9",
               "name": "Choice Skinner",
               "profile_path": "/b89EEGpwcJ1xYR9XiFVxioCaJh9.jpg",
               "id": 98812,
               "order": 19
            },
            {
               "cast_id": 25,
               "character": "Yani Perez",
               "gender": 2,
               "credit_id": "5a55ae04c3a3685ed70201db",
               "name": "Joe Nunez",
               "profile_path": "/3hLLN7YLZE9pzqWv7m92MXTUYgb.jpg",
               "id": 54696,
               "order": 20
            },
            {
               "cast_id": 26,
               "character": "Joe",
               "gender": 0,
               "credit_id": "5a55ae1b0e0a2607d101ea82",
               "name": "John Rosenfeld",
               "profile_path": null,
               "id": 1215375,
               "order": 21
            },
            {
               "cast_id": 27,
               "character": "Joel's Mother",
               "gender": 1,
               "credit_id": "5a55ae300e0a2607e401f40e",
               "name": "Angel Parker",
               "profile_path": "/w8SX3vb4fSxfIYDzpwUmtYAaXCx.jpg",
               "id": 1254399,
               "order": 22
            },
            {
               "cast_id": 28,
               "character": "Harvy",
               "gender": 2,
               "credit_id": "5a55ae52c3a3685ed702021e",
               "name": "Jeff Sloniker",
               "profile_path": null,
               "id": 565562,
               "order": 23
            },
            {
               "cast_id": 29,
               "character": "Patricia",
               "gender": 0,
               "credit_id": "5a55ae6cc3a3685ec701cca8",
               "name": "Abigail McFarlane",
               "profile_path": null,
               "id": 1794264,
               "order": 24
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a66c3a36847f81cbab9",
               "name": "Jay Gammill",
               "profile_path": null,
               "id": 1079597,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a66c3a36847f81cbabf",
               "name": "Jim Beggarly",
               "profile_path": null,
               "id": 1079598,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "59c1361c9251417d7d017154",
               "name": "Reed Morano",
               "profile_path": "/fXtvqRCPMDhXwvgc3V2oC4GT3AP.jpg",
               "id": 67356,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.654849,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 106337,
      "vote_count": 17,
      "budget": 0,
      "overview": "A Stanford law-school dropout named Jillian escapes to the anonymity of Los Angeles to figure out what she wants to do with her life, and on the day of her college boyfriend's birthday, she finds herself stuck running an ice cream truck fending off locals and oddball friends alike. This one day spent in a truck on the streets of Los Angeles will wake Jillian from her aimless daze and make her see that life doesn't stop just because you want it to.",
      "similar": [],
      "original_title": "Free Samples",
      "runtime": 80,
      "poster_path": "/71ysDywdEThj25QicqgaqIju7T0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-05-31",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Ever have one of those years?",
      "adult": false,
      "homepage": "https://www.facebook.com/FreeSamplesMovie",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jay Gammill"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Jim Beggarly"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1793223/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0NTIzMDgzNl5BMl5BanBnXkFtZTcwOTIzODQ0OQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jess Weixler, Jesse Eisenberg, Halley Feiffer | See full cast and crew »"],
      "reviews": [
         "Based in part on a worryingly low IMDb rating, I went into \"Free Samples\" with some hesitance, but to my surprise it ended up as the highlight of the Palo Alto International Film Festival for me in terms of sheer entertainment value. It reminded me a great deal of a Sundance favorite from a few years back, \"Smiley Face\" with Anna Faris, due both to its snarky but ultimately sweet sense of humor and the wonderfully expressive and funny things that lead actress Jess Weixler is able to so with her face and her delivery. It's the kind of quirky -- I think one may in fact be required by law to use that word when reviewing films like this -- comedy about not all that much that understandably will rub some viewers the wrong way, but it's executed with so much giddy confidence (especially for a first feature) that it had me from the first minute and held onto me for all of the rest. Director Jay Gammill mentioned at the Q&A that he's currently working on a second feature with the same screenwriter. I'm looking forward to it.",
         "This is one of those indie type films I'm actually glad I watched. It's very quirky, and had those moments that made you stop and think. When it started, I had my doubts, but Jesse Eisenberg helped pull me into the story. It's also got some 'laugh out Ioud' moments and some 'laugh out loud about a minute later' moments when you actually process the hilarity of some of the dialogue. The cast is cool.I love the emergence of Jason Ritter, I think he's more talented than people give him credit for. I enjoyed seeing Jesse Eisenberg in a different type role and seeing Tippi Hedren in it was pretty cool too. There was one scene where I thought the comedy didn't work very well, but that's typical of most movies, I guess. Gammill and Beggarly make a good team, not sure if they're working on other stuff together, but there's definitely a market for these types of movies.",
         "Free samples is what an indie movie should be: small, quirky interesting, more character than action - about real life rather than just imagination, and this is Free Samples. It's a film that requires little effort to enjoy but is full of little vignettes that leap off the screen. All in all, I for one enjoyed this more than many big budget movies: the characters have something to say, the comedy is nicely observed, the camera is tight (even semi-documentary), it's well edited and well shot with a great sense of slacker pace about it and it has a charm of its own. Seriously, a nice gentle comedy set sround one day of looking after an artificial ice-cream van (so free samples) with some vitriol in the exchanges - the whole thing come across as ten times more honest than most comedies and this is one I would warmly recommend.",
         "Jillian (Jess Weixler) has left Stanford law school and her boyfriend for a semester to try something new. Only she's no good at anything other than drinking. After a night of passout drinking, she has to give out free samples of ice cream from a food truck for a friend who is joining an intervention for her brother. She faces people with her acerbic wit and her pounding hangover. I love Jess Weixler's sardonic personality. And it works great especially in the first half with Jason Ritter. They have a fun combative conversation. It's not so much with Jesse Eisenberg. She has more chemistry with Ritter. The last half does stumble a little bit. Tippi Hedren is playing an interesting character but it's just too cliché. And when school friend Paula drops by, it hits that speed bump a little too hard. For that kind of coincidence, it could never maintain any believability.",
         "I wanted to like this movie. I am a fan of many of the actors in the film but the problem wasn't them but the characters they were portraying... I couldn't find anything to like about any of them... The characters all seemed like whiners to me... Oh my Dad is a big bad lawyer, my brother is an addict, I'm in a crappy band... I got a crappy cowboy hat! Why would you bother with the main character at all? Sure she is cute but she is also a mean bitch... She treats everyone like crap and then runs crying to someone else when she gets some bad news... Stay away... Time waster... 5 howls outta 10... ArrOOoo!",
         "This one-set Indy tries very hard to be sharp and mordant and timely. The trouble is that nothing about the characters or their situations rings true. The main set is an ice cream truck located in what looks like a borderline ghetto where the heroine must give away free samples of chocolate and vanilla, nothing else. The workers and everyone in the neighborhood seem to already know that the pseudo ice cream is horrible. So what are they really doing there? In what alternate universe would this actually happen? Apparently in the same universe where a self-absorbed Cali-blonde Stanford law student would be SHOCKED, SHOCKED I say, to learn that 5 years after she left home, her dad moved out and took up with a trophy bimbo. That evidently never happens in alternate universe Z, so of course it sends our heroine into a drunken tailspin where she must engage in contrived sardonic banter with every unlikely walk-on character who ambles by her pseudo ice cream truck. Sadly, none of these encounters feels more forced or contrived than the heroine's confrontation with her unwanted fiancée. After 90 minutes of this I yearned to get back to our universe where Cheech and Chong would have a very good business plan for that ice cream truck working the ghetto and where all their customers' curious demands for \"stamps\" would make sense.",
         "Pretty much, this film is about the wonderful, quirky Jess Weixler. When she acts opposite Tippi Hedren you see the full array of her facial expressions. The story doesn't move very fast, nor is there much of one, but if you like films like \"Juno\" then you should like this, although it's not in the same class as the aforementioned. The somewhat vacuous storyline and the rather dull setting, IE a bashed up ice cream van in a sub-urban parking lot are non-the-less brightened up by the excellent Jesse Weixler. If you like your movies full of action and special effects then forget this one.",
         "'Free Samples' is not a masterpiece, but it's a simple, understated spark of quirkiness and brilliance, without doubt. Not only is it hard not to like this film, it's hard not to like the sarcastic, drop-out Jillian, played by Jess Weixler, who gives a faultless, genuine performance. One thing I find great is how we know nothing about Jillian initially, but we gradually learn more and more as she sells more and more ice-cream through the day. Jesse Eisenberg gives another cool performance of his and the ever-wonderful Tippi Hedren gives a brilliant touch to this delight. This indie piece shows how so much can hit you throughout a day of serving chocolate or vanilla ice-cream samples. With subtle emotional input and very funny scenes, 'Free Samples' is a desert not to be turned down.",
         "This is the definition of a \"small\" film - no car chases, no guns, relatively little action, lots of talking but somehow moving and enjoyable. The humor is chuckle rather than laugh out loud but the film keeps moving and is never boring. Perhaps best watched at home rather than in a movie theater with minimal distractions. Good acting, even in the smallest of parts, is the mainstay of this movie and the direction is subtle and relatively invisible. The movie is about a 20 something who has hit a roadblock and has literally dropped out of the life she was living. A day spent running a mobile custard stand somehow jolts our 20 something back to life. If you don't need explosions and special effects to enjoy yourself, consider investing 80 minutes in this fine little film.",
         "Entertaining,and straightforward,this indie film had a successful run at the Tribeca Film Festival. Jay Gammill's directorial craft shines as he captures what a day in Jillian's (Jess Weixler)life is like, as she struggles to make sense of her personal issues, and her hangover, in an ice-cream truck. Jess Weixler manages to make Jillian, who's disdainful attitude often offends the customers, as well as her friends, likable. The sarcastic banter between Jillian and her,off beat, customers is part of what makes this film charming. Jesse Eisenberg is sweet and smooth as Jillian's potential love interest,Tex. Betty, wonderfully played by Tippi Hedren, is the real glue to this off beat comedy. Her story brings a lot of heart, and gives emotion, not only to herself, but to Jillian also. Free Samples is a solid start for Jay Gammill. This drama-comedy definitely serves up a delightful treat."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Film Harvest",
         "Sawhorse Productions"
      ],
      "summaries": [
         "A Stanford law-school dropout named Jillian escapes to the anonymity of Los Angeles to figure out what she wants to do with her life, and on the day of her college boyfriend's birthday, she finds herself stuck running an ice cream truck fending off locals and oddball friends alike. This one day spent in a truck on the streets of Los Angeles will wake Jillian from her aimless daze and make her see that life doesn't stop just because you want it to.",
         "A Stanford law-school dropout finds herself running her best friend's ice cream truck, fending off locals and oddball friends alike as she doles out free soft serve, and on the day of her fiance's birthday, Jillian finds herself being courted by a young man whom she barely remembers from the night before."
      ],
      "budget": 0
   },
   "movielensId": 113337,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-05-31",
      "dvdReleaseDate": "2013-10-29",
      "directors": ["Jay Gammill"],
      "runtime": 80,
      "movieId": 113337,
      "title": "Free Samples",
      "mpaa": "NR",
      "actors": [
         "Jess Weixler",
         "Jesse Eisenberg",
         "Jason Ritter",
         "Halley Feiffer",
         "Keir O'Donnell",
         "Jocelin Donahue",
         "Whitney Able",
         "Matt Walsh",
         "Craig Gellis",
         "Suzy Nakamura",
         "Jordan Davis",
         "Tippi Hedren",
         "Jennifer June Ross",
         "Madison Leisle",
         "Joseph McKelheer",
         "Choice Skinner",
         "Joe Nunez",
         "John Rosenfeld",
         "Angel Parker",
         "Jeff Sloniker",
         "Abigail McFarlane"
      ],
      "imdbMovieId": "1793223",
      "originalTitle": "Free Samples",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "nEfIndKDGtM",
         "3prmzzcYSY8"
      ],
      "plotSummary": "A Stanford law-school dropout named Jillian escapes to the anonymity of Los Angeles to figure out what she wants to do with her life, and on the day of her college boyfriend's birthday, she finds herself stuck running an ice cream truck fending off locals and oddball friends alike. This one day spent in a truck on the streets of Los Angeles will wake Jillian from her aimless daze and make her see that life doesn't stop just because you want it to.",
      "tmdbMovieId": 106337,
      "avgRating": 3.5625,
      "releaseYear": "2013",
      "numRatings": 8,
      "posterPath": "/71ysDywdEThj25QicqgaqIju7T0.jpg"
   }
}