{
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Karen McGann"],
      "runtime": 60,
      "synopsis": null,
      "writers": ["Max Hastings"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3564534/",
      "coverLink": null,
      "actors": ["Stars: Max Hastings, Clive Harris, John Horne | See full cast and crew »"],
      "reviews": ["Max Hastings, the writer and presenter, has a somewhat different take on the causes of World War I than Barbara Tuchman's. For her -- if I remember from so many years ago -- it was a catastrophe that befell everyone involved more or less by accident, a result of twisted histories of royal families, misinterpreted letters, and the like. Hastings places the primary blame on Germany. Hastings believes the war was necessary because, after all, what would have happened if Germany had won? It wouldn't have been the European Union. Germany had in 1913 the most progressive parliament in Europe, the Reichstag, but the monarch was Kaiser Wilhelm. In civil life, there was tolerance and old-age pensions for everyone. In foreign affairs, however, Wilhelm, while not a \"war monger like Hitler\", was all for military expansion and fancied himself a rule like his namesake, Caesar. (The title of Kaiser is derived from the title of Caesar, as is the title of Tsar. There were multiple claimants to the title. In a sense, Wilhelm was the last of the Caesars.) A weak man personally, he was head of the best army on the continent and expanded the big-gun navy until it threatened Britain's rule of the sea. Wilhelm, like just about everyone else, didn't think much about economics when he thought about war. He thought about soldiers, and he didn't realize that Germany was already a superpower without having fought any war at all. It's probably not necessary to go through the time line of the war's beginning. A Serbian nationalist assassinated Ferdinand of Austria-Hungary. Austria-Hungary is urged by Germany to invade Serbia and take it over. But Russia backs Serbia. (They were both Slavs. That sort of tribalism is what many wars are hinged upon.) But France has a treaty with Russia, so the French are drawn in. Britain sits back, hoping for the best, until there is no other choice but to commit itself. US industries make a fortune from the war until Germany provokes a declaration of war during its last year. (Some of this is mine, not Hastings'.) It's worth noting that Britain lost about 2% of its population in the war, Britain about the same, and France a bit more than 4%. Serbia lost between 11% and 18% of its total population. The US lost .13%. War and disease devastated Europe. Hastings himself is a tall, slope-shouldered, hulking sort of fellow with droopy features, sad eyes, and loose, ill-fitting clothes. I believe he may have the biggest feet I've ever seen on a human being. I kind of enjoyed watching him and listening to him. I'm not a historian so I don't get to criticize his position but he certainly pulls no punches, and he gets to interview half a dozen leading experts on the subject. For a far more detailed view, see Jonathan Lewis' TV miniseries."],
      "genres": [
         "Documentary",
         "History",
         "War"
      ],
      "productionCompanies": ["Blakeway Productions"],
      "summaries": ["Max Hastings, who himself worked on the landmark series Der große Krieg (1964) 50 years before, argues the case that his and many other ancestors did not die in vain in The First World War."],
      "budget": 0
   },
   "movielensId": 113470,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-02-25",
      "dvdReleaseDate": null,
      "directors": ["Karen McGann"],
      "runtime": 0,
      "movieId": 113470,
      "title": "Necessary War, The (2014)",
      "mpaa": null,
      "actors": [
         "Max Hastings",
         " Clive Harris",
         " John Horne"
      ],
      "imdbMovieId": "3564534",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 3.5,
      "releaseYear": "2014",
      "numRatings": 1,
      "posterPath": null
   }
}