{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1974254",
      "video": false,
      "title": "Far Out Isn't Far Enough: The Tomi Ungerer Story",
      "recommendations": [],
      "backdrop_path": "/hHPcTVeeLAqWrhqK8WmHZg3OpO9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4aa3c3a368484e15ef19",
               "name": "Tomi Ungerer",
               "profile_path": "/bRyUuhS2y1YCevhjhKtBVjfuOFR.jpg",
               "id": 130685,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4aa3c3a368484e15ef1d",
               "name": "Maurice Sendak",
               "profile_path": null,
               "id": 110564,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4aa3c3a368484e15ef21",
               "name": "Jules Feiffer",
               "profile_path": null,
               "id": 69051,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4aa3c3a368484e15ef25",
               "name": "Barney Rosset",
               "profile_path": null,
               "id": 45495,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aa3c3a368484e15ef0f",
               "name": "Brad Bernstein",
               "profile_path": null,
               "id": 1079373,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aa3c3a368484e15ef15",
               "name": "Brad Bernstein",
               "profile_path": null,
               "id": 1079373,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [],
      "popularity": 0.231801,
      "production_countries": [],
      "id": 124069,
      "vote_count": 4,
      "budget": 0,
      "overview": "Far Out Isn't Far Enough: The Tomi Ungerer Story depicts one man's wild, lifelong adventure of testing societal boundaries through his use of subversive art. This 98-minute film combines traditional documentary storytelling with original animation from over 70 years worth of art from the renegade children's book author and illustrator. Using a historical palette of 20th century events to paint an artist's epic yet controversial life story, this HD documentary film offers a feature-length retrospective of Ungerer's life and art, pondering the complexities and contradictions of a man who, armed with an acerbic wit, an accusing finger and a razor sharp pencil, gave visual representation to the revolutionary voices during one of the most tantalizing and dramatic periods in American history. Far Out Isn't Far Enough explores the circumstances of his meteoric rise and fall on American soil...",
      "similar": [],
      "original_title": "Far Out Isn't Far Enough: The Tomi Ungerer Story",
      "runtime": 98,
      "poster_path": "/eYzhxJXghdiirosLtT32a9d1yjV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-10-15",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.faroutthemovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brad Bernstein"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Brad Bernstein"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1974254/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5NDIwMTY2M15BMl5BanBnXkFtZTcwNDU3NzY0OQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Tomi Ungerer, Maurice Sendak, Jules Feiffer | See full cast and crew »"],
      "reviews": [
         "Frankly I had never heard of Tomi Ungerer, but I have seen the children's book illustrations at some point in my life. So this documentary was a real eye opener. The film covers his life from birth to present and the great influences he experienced living in war torn France, coming to New York City, and the sudden explosion of success and fame through his art. Then the fall due to his private art life being exposed. It's always educational and entertaining to see behind the 'marketing image' of the publishing business and find that successful people are really no different from the ordinary people. A delightful and insightful documentary!",
         "Enjoyable documentary about 1960s and 70s children's book author, creator of powerful, iconic anti-war and other political posters, and artist of erotica, often with a bondage or S+M theme. As diverse as this work is, it all shares Ungerer's trade mark dark sense of humor. The film follows his interesting life, from Childhood in Nazi occupied Alsatia, to his coming to America, his success as an illustrator, and then hugely as a children's book author, his politicalization and involvement with erotic, to the fateful moment when they all came together after he was attacked for his sexual drawings at a children's book convention, and was almost immediately black-listed. His books were taken out of libraries, publishers dropped him, publications (including the New York Times) refused to review his work. Much of the film is Ungerer himself, a very engaging interview subject, now in his 80s ruminating on everything; art, life, death, sex, politics, success and failure, children, fear. He is eccentric to be sure but in a way that feels very open and inviting. All that said, there's a lack of emotion for the great majority of the film. Also, I'm just slightly mistrustful of how complete a portrait the film actually is. Growing up in NYC I happened to know Ungerer's daughter when we both were about 10 years old. Yet there's no mention of her, or her mother in the film, which gives the distinct impression that Ungerer was a wild man bachelor until he met his later wife, with whom he moved to Canada, and then Ireland. It troubles me a bit that feels like such a through portrait and deals so much with children, sex, morality, and 'the swinging 60s,' there's no touching on what his 'first family' situation was like, or even that they existed.",
         "Far Out Isn't Far Enough: The Tomi Ungerer Story is excellent....see it! -------------- By David (Tex) Allen Columbia PA USA DavidRogerAllen@Hotmail.Com ----------- October 27, 2013 --------- This movie was just released on DVD, Region 1 (USA, etc.) and is very good...compare it to the excellent CRUMB 1996 and CONFESSIONS OF ROBERT CRUMB 1987 documentaries....also about a famous 1960's illustrator who left the USA...now lives in France, just like Tomi Ungerer! Ungerer is seen at age 81 with white hair, walking with cane. He is old and bent over, but still has a twinkle in his eye and a great sense of mischievous humor. The \"special features\" section shows an interchange he had with Jules Feiffer which is wonderful. \"Special Features\" on this video also show the late, great Maurice Sendak complaining about THE KING'S SPEECH \"Best Picture Academy Award\" movie.....also wonderful. This documentary is a treasure because Tomi Ungerer is a treasure. Buy a copy directly from FIRST RUN FEATURES in NYC to support them and increase their profits. They sell wonderful but lonely and not well publicized documentaries like this one, and have high costs and low income. Send money to them so they can keep up their great work! Also, get the CRUMB 1997 and THE CONFESSIONS OF ROBERT CRUMB 1987 videos used from Amazon.Com cheap....another great American artist who moved to France....he's still there! Thanks for reading this. TEX (David) Allen Columbia PA USA DavidRogerAllen@Hotmail.Com"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Corner of the Cave Media",
         "Far Out Films"
      ],
      "summaries": ["Far Out Isn't Far Enough: The Tomi Ungerer Story depicts one man's wild, lifelong adventure of testing societal boundaries through his use of subversive art. This 98-minute film combines traditional documentary storytelling with original animation from over 70 years worth of art from the renegade children's book author and illustrator. Using a historical palette of 20th century events to paint an artist's epic yet controversial life story, this HD documentary film offers a feature-length retrospective of Ungerer's life and art, pondering the complexities and contradictions of a man who, armed with an acerbic wit, an accusing finger and a razor sharp pencil, gave visual representation to the revolutionary voices during one of the most tantalizing and dramatic periods in American history. Far Out Isn't Far Enough explores the circumstances of his meteoric rise and fall on American soil, but also delves into Ungerer's formative years leading up to, and prolific years since, his time in America."],
      "budget": 0
   },
   "movielensId": 113466,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-10-15",
      "dvdReleaseDate": null,
      "directors": ["Brad Bernstein"],
      "runtime": 98,
      "movieId": 113466,
      "title": "Far Out Isn't Far Enough: The Tomi Ungerer Story",
      "mpaa": "NR",
      "actors": [
         "Tomi Ungerer",
         "Maurice Sendak",
         "Jules Feiffer",
         "Barney Rosset"
      ],
      "imdbMovieId": "1974254",
      "originalTitle": "Far Out Isn't Far Enough: The Tomi Ungerer Story",
      "genres": [""],
      "youtubeTrailerIds": ["uV-JA4jTu54"],
      "plotSummary": "Far Out Isn't Far Enough: The Tomi Ungerer Story depicts one man's wild, lifelong adventure of testing societal boundaries through his use of subversive art. This 98-minute film combines traditional documentary storytelling with original animation from over 70 years worth of art from the renegade children's book author and illustrator. Using a historical palette of 20th century events to paint an artist's epic yet controversial life story, this HD documentary film offers a feature-length retrospective of Ungerer's life and art, pondering the complexities and contradictions of a man who, armed with an acerbic wit, an accusing finger and a razor sharp pencil, gave visual representation to the revolutionary voices during one of the most tantalizing and dramatic periods in American history. Far Out Isn't Far Enough explores the circumstances of his meteoric rise and fall on American soil...",
      "tmdbMovieId": 124069,
      "avgRating": 3.5,
      "releaseYear": "2012",
      "numRatings": 2,
      "posterPath": "/eYzhxJXghdiirosLtT32a9d1yjV.jpg"
   }
}