{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nurse",
            "id": 428
         },
         {
            "name": "ax",
            "id": 3598
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "murder",
            "id": 9826
         }
      ],
      "imdb_id": "tt0034732",
      "video": false,
      "title": "Fingers at the Window",
      "recommendations": [],
      "backdrop_path": "/1xN7vM9OJKd59eGJuk4z3Ckqmgv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Oliver Duffy",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff05",
               "name": "Lew Ayres",
               "profile_path": "/8Z3YPfpxj5dR9jR5GGXWaoGmjAu.jpg",
               "id": 2007,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Edwina 'Eddie' Brown",
               "gender": 1,
               "credit_id": "52fe4701c3a368484e0aff09",
               "name": "Laraine Day",
               "profile_path": "/s9UHeBQF7VjzvDrvIgzNlBs7oCn.jpg",
               "id": 41245,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Cesar Ferrari, alias Dr. H. Santelle",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff0d",
               "name": "Basil Rathbone",
               "profile_path": "/grjsDNr7wt6E57Bf2GDg0yaBsRo.jpg",
               "id": 8727,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Dr. Cromwall",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff11",
               "name": "Walter Kingsford",
               "profile_path": "/hAyno19zK7ZCzESl6RSw1jbOjH3.jpg",
               "id": 33033,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Dr. Kurt Immelman",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff15",
               "name": "Miles Mander",
               "profile_path": "/bdpwtvVZjOgkaOXXA38tfYuiBT5.jpg",
               "id": 19329,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Police Inspector Gallagher",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff19",
               "name": "Charles D. Brown",
               "profile_path": "/tmJTiq9xHPa7vVEnE8t7wXMKbdD.jpg",
               "id": 13977,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Police Lieutenant Allison",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff1d",
               "name": "Cliff Clark",
               "profile_path": "/pSidj0mVZYQtXQzdszeTBgqGwj5.jpg",
               "id": 89728,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Police Lieutenant Schaeffer",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff21",
               "name": "James Flavin",
               "profile_path": "/quxPBveIsUgat0N8VePdsHpsQnq.jpg",
               "id": 3262,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Ogilvie - Reporter",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff25",
               "name": "Russell Gleason",
               "profile_path": "/9zNDEDH5AsQOgJF9vvGCYBHbLt4.jpg",
               "id": 240667,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Devlan - Reporter",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff29",
               "name": "William Tannen",
               "profile_path": null,
               "id": 29626,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Haguey - Reporter",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff2d",
               "name": "Mark Daniels",
               "profile_path": "/5ezYklem04uYOX8DDlpV9MFz9Sh.jpg",
               "id": 130375,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Krum - Reporter",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff31",
               "name": "Bert Roach",
               "profile_path": "/pbqOEk3wSPJH7XZWEUp1UkZ0cDP.jpg",
               "id": 29987,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Dr. Chandley - Speaker at the Conference",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff35",
               "name": "Russell Hicks",
               "profile_path": "/hRRM5ni87mxjlDV2G9jr4GCxFew.jpg",
               "id": 13969,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Fred F. Bixley",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff39",
               "name": "Charles Wagenheim",
               "profile_path": "/3JyR9PzxDOPIyOPtLGKCEXFm18c.jpg",
               "id": 26158,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Officer O'Garrity",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff3d",
               "name": "Robert Homans",
               "profile_path": "/qgFVZf4Tl9GLNhTLgrEdSWeBbgY.jpg",
               "id": 95311,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Young Reporter (uncredited)",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff41",
               "name": "Rand Brooks",
               "profile_path": "/oxgcE7ufnAOFPK3dM7Cpyc4PJMf.jpg",
               "id": 91217,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Psychiatrist at Lecture (uncredited)",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff45",
               "name": "Frank McLure",
               "profile_path": "/u6E8Ms5zQXg9LEr7lktIvhtMxjS.jpg",
               "id": 569144,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "Photographer (uncredited)",
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff49",
               "name": "Arthur O'Connell",
               "profile_path": "/rWoLpGwQlIZSiPIzJqE1yIMiDxr.jpg",
               "id": 857,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "Police Car #12 Driver (uncredited)",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff4d",
               "name": "Ray Teal",
               "profile_path": "/vddCtm4m8enym2C6QZ69eT3MUJo.jpg",
               "id": 93624,
               "order": 18
            },
            {
               "cast_id": 28,
               "character": "Citizen (uncredited)",
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0aff51",
               "name": "Joe Yule",
               "profile_path": "/AqVvow3oSoroV5VEwv5kRFCTk8p.jpg",
               "id": 1196675,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0afed7",
               "name": "Charles Lederer",
               "profile_path": null,
               "id": 4358,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0afedd",
               "name": "Rose Caylor",
               "profile_path": null,
               "id": 240666,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0afee3",
               "name": "Lawrence P. Bachmann",
               "profile_path": null,
               "id": 33030,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4701c3a368484e0afee9",
               "name": "Rose Caylor",
               "profile_path": null,
               "id": 240666,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0afeef",
               "name": "Irving Starr",
               "profile_path": null,
               "id": 131228,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0afef5",
               "name": "Bronislau Kaper",
               "profile_path": null,
               "id": 14861,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0afefb",
               "name": "Charles Lawton Jr.",
               "profile_path": null,
               "id": 18576,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4701c3a368484e0aff01",
               "name": "Harry Stradling Sr.",
               "profile_path": null,
               "id": 10537,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.538765,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 65210,
      "vote_count": 3,
      "budget": 0,
      "overview": "The City of Chicago is gripped by an Axe Murderer. The streets are empty at night as there has been six murders and six people have been caught, but they are lunatics. Only one person has lived to tell about it and that was Edwina, who is as dumb as a brick. If it were not for Oliver, she would be number seven. When there is a second attempt on Edwina, Oliver figures that the crimes are not random and that someone is hypnotizing these people to do his bidding, but the police and Edwina are skeptical.",
      "similar": [
         357096,
         15069,
         984,
         11423,
         8090,
         979,
         948,
         807,
         4771,
         75780,
         281,
         395834,
         281957,
         445954,
         25376,
         21484,
         3134,
         45569,
         10651,
         12143
      ],
      "original_title": "Fingers at the Window",
      "runtime": 80,
      "poster_path": "/aXfyWrHSBCGPDlIlciftUEN82hm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1942-04-22",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "DANGER AT NIGHTFALL ! ROMANCE AT DAYBREAK !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Lederer"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Rose Caylor",
         "Lawrence P. Bachmann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034732/",
      "coverLink": null,
      "actors": ["Stars: Lew Ayres, Laraine Day, Basil Rathbone | See full cast and crew »"],
      "reviews": [
         "Any story about an axe murderer on the loose has to be taken seriously--and this one is no exception, especially since it is given some film noir ambience in lighting, sets and photography--and has Basil Rathbone as the master mind of all the villainy. Laraine Day and Lew Ayres (usually cast in the Dr. Kildare series) are the stars of this well made B-film that played the lower half of double-bills when released in 1942. They both move capably through a story that mixes romance, humor and suspense--although much of what happens stretches credibility a bit. Attempts on Laraine Day's life provide a few genuine thrills in this somewhat creepy tale about an actor (Lew Ayres) and a society girl (Day) on the trail of a serial killer being masterminded by sinister Basil Rathbone who uses hypnotism to carry out his plans. Although a minor mystery, it has some chilling moments thanks to the intensity of Rathbone's acting and some atmospheric night scenes with the heroine being menaced and stalked on rainy streets by a killer. This is just one of the films discussed in my career article on LARAINE DAY that appears in the current Spring 2001 issue of FILMS OF THE GOLDEN AGE.",
         "For years this film used turn up often on television, but always at around three in the morning on \"The Late Late Show.\" I only saw it for the first time recently on video. To my surprise, this film was an enjoyable light comedy thriller. Lew Ayres is delightful as the actor who teams up with show girl Day to solve a series of axe murders. The scene where Ayres feigns insanity to get into the files at a mental hospital is price-less. Basil Rathbone is in top form as the shady doctor who orchestrates the murders. Its odd that this film being an MGM production with a good cast is almost never mentioned in books on horror films, while minor poverty row horrors from the same period have had gallons of ink written about them. The film did end with a few loose ends. Why does Rathbone choose an axe as the weapon for his subjects to kill his victims? Also, it is never made clear as to how he is able to control his subjects. Does he use hypnosis? Telepathy?",
         "Laraine Day and Lew Ayers always seemed to have great chemistry between them and this picture carries on that tradition. Ayers is an out of work actor who happens to see Day being followed by a man who is carrying an axe. He manages to save her and capture the would-be killer but it's obvious that there will be further attempts on her life. Ayers tries to solve the mystery of why she is being stalked and manages to get himself in trouble both with the law and with the mastermind of the killings. Basil Rathbone does his usual top job in a role that calls for someone who is both suave and has ice water in his veins. The cast is rounded out with many familiar faces of MGM contract players. All in all, a very good mystery with Ayers and Day providing just the right amount of light interplay.",
         "Lew Ayres and Laraine Day star in \"Fingers at the Window,\" a 1942 film which also stars Basil Rathbone. An ax murderer is killing people in Chicago, and the police don't have any leads. A young actor, Oliver Duffy (Ayres) suspects that a woman, Edwina (Day) is going to be attacked after he notices her being followed. Oliver attaches himself to her, sees some activity outside of her window, and also notices a problem with her door latch, as if someone was preparing it to break in. He tries to figure out why she has been singled out, but Edwina, being an airhead, can't come up with anything. Ayres and Day are delightful, having worked together so well in the \"Dr. Kildare\" series, and Rathbone is terrific as a distinguished doctor. This was Ayres' last film before the war, during which he served as a conscientious objector (he was a medic on the front lines), something very controversial at that time. MGM washed their hands of him and the \"Dr. Kildare\" series quickly became the \"Dr. Gillespie\" series. One of the first \"Dr. Gillespie\" films concerned a man who had lost a limb during the war - MGM was making a point. Ayres made one too, by winning an Oscar nomination for \"Johnny Belinda\" in 1948. \"Fingers at the Window\" is a little silly with some plot holes, but the cast makes it work. Despite its macabre subject matter, it's directed by Charles Lederer with a light touch to mine the humor. Enjoyable.",
         "This is a great little film and Lew Ayres is much under-rated as a leading man because of the Kildare series. he has a light touch that is only overpowered by the classic Basil Rathbone who gives even dross a great deal of class. Enjoy.",
         "A tidy, direct, edge-of-the seat romantic thriller. Ayres is good, as always, and Day is fine. The other star-billed player is a bit of cheat, as we don't see him till the final 15 minutes or so; but it's OK. This movie recalls \"The Cabinet of Dr. Caligari\" and presages \"North By northwest\": The supposedly crazy, or at least uninformed, people are the good guys; while the bad guy is the one looked up to by the general populace.",
         "Lew Ayres is an out-of-work actor who stumbles into a plot by the villainous Basil Rathbone to stir up a bunch of apparently random ax murders in Chicago. Actually there is madness in this method. Rathbone, a doctor himself, has assumed the identity of a famous neurosurgeon from Europe. There are only seven people in this country -- evidently all of them living in Chicago -- who can identify him as a phony. He hypnotizes (or something) people whose names he copied from a patient file in the hospital and sends them out on their lethal journeys. I don't want to get into this too deeply because (1) it would take too long to explain the details of the plot and (2) the ending has a couple of surprises in it. Lorraine Day, with whom I was desperately in love as a child, plays someone so dumb in this movie that she deserves a Darwinian Award for her survival. But nobody has ever gushed with surprise so sweetly. (Is that okay, Lorraine, dear?) Lew Ayres, in what is essentially a comic role, is a horse of a different color. He claims to be able to quote poetry. \"And all the while the night was haunted by her smile.\" I Googled this couplet to death and could find nothing, so I'm compelled to believe the writer, Rose Caylor, thought it up herself. It's in the tradition of Byron and the rest and in fact isn't bad. But then there are literary allusions sprinkled throughout the script. A reporter shouts out \"Curfew shall not ring tonight,\" from Rose Hardwick Thorpe's poem of the 1860s. And Ayres introduces himself with an Irish accent as Steven Daedalus, a character from James Joyce's \"Ulysses.\" There are probably other allusions that I missed. They're not important to the plot. They're just insider jokes. If you get them, great. If you miss them, nothing is lost. The Marx Brothers did it all the time. I imagine Rose Caylor as a relatively recent graduate of USC or someplace, majoring in English Literature, who decided to write a screenplay and had an agent who was cunning enough to sell it. That's rather neat. Nowadays, all the screenplays seem to be written by people with MBAs and follow a particular formula: If a movie made money, let's copy it. To hell with Steve Daedalus. The fourteen-year-olds won't get it. Smacks too much of homework. (Lorraine, sweetheart, wherever you are in plus time and minus space, I hope you don't think I'm being too harsh on the kids.) But, in sum, I have to say that without Rose Craylor's sometimes comic interjection, what we have here is a B movie from the early 1940s. Ax murderers are at large, and Ayres and Day uncover the method behind them. Both performers, and the little-seen Basil Rathbone, do what they're told. It works out okay.",
         "Fingers at the Window (1942) ** 1/2 (out of 4) An unemployed actor (Lew Ayres) bumps into a woman (Laraine Day) being chased by what he appears to be a madman. The two strike up a friendship and sure enough it turns out that a man carrying an axe was after her. Chicago is under terror from a notorious axe murderer but the two new friends start to investigate what's going on and it appears there's not just one killer. FINGERS AT THE WINDOW certainly isn't a masterpiece of the genre but there are enough good moments to make it worth viewing. The film not only centers in on the thriller genre but we get some laughs thrown in as well as a romantic subplot between the two stars and believe it or not it actually works. The romantic angle usually always kills these films but you can tell Ayres and Day are very comfortable together and they know how to play off one another. There's a lot of flirting going on and it's clear the two are having fun. I do think some of the comedy falls short but it doesn't hurt the film too much. Both Ayres and Day fit their roles quite nicely and they manage to pick this thing up and carry it to the finish line even when the screenplay gets a tad bit bogged down. Ayres is extremely fast moving and that wise guy attitude he brings to this actor character was fun. Basil Rathbone plays, you guess it, the doctor who is doing the experiments to get all the murders going. It should come as no shock but the actor has no trouble with the role and manages to be very believable as the bad guy. One of the best scenes happens early on when Day is being stalked by the man with the axe and we get to watch Ayres try to save her even when she doesn't want him. This scene takes place in the dark streets and then moves up to her apartment room and we actually get some nice suspense here. I think a tighter screenplay would have helped things and the ending doesn't work that effectively but overall this is a decent little picture well worth seeing.",
         "I hesitate to call this film a mystery, because the nature of the murders that are plaguing Chicago is known to the viewer from the very beginning. And although it has some traits common to noir, I found the tone of this film to be too light to firmly place it in that genre. Lew Ayres (as Oliver Duffy) plays an out of work actor who stumbles into a murder plot aimed at Laraine Day (Edwina Brown). She is rather kooky and he seems unable to string two serious lines together. With his help, they capture the axe murderer who attempts to end Laraine's day. Ayres develops a theory about the nature of the murders, but the police won't listen. They are buffaloed by the hypothesizing of a psychologist--a common theme in the 40s and 50s when audiences seemed intrigued by the mysteries of the human mind and the simple \"explanations\" that science seemed to offer. For a superior example of this, see \"The Bad Seed\" from 1956. Hitchcock liked to dabble in these kinds of stories, as in \"Spellbound\" in 1945. But this film does have some appeal. And Basil Rathbone, in his role, provides the intensity that was his hallmark.",
         "This is a swell little mystery thriller that reunites Lew Ayres and Laraine Day, who played Dr. Kildare and Nurse Lamont respectively in the Dr. Kildare series of movies (which were great, by the way). However, the characters they play here are much different. Ayres plays an easygoing actor turned amateur sleuth and Day plays a pretty, sweet airhead of a woman targeted by a killer or killers. Also starring is the legendary Basil Rathbone, who never did a bad job in a film in his career (prove me wrong!). This film is a great treat, especially for fans of the Dr. Kildare series and fans of Rathbone. The cast is pleasant and have lots of fun. The story is crisp and moves along at a nice pace. Director Charles Lederer smoothly juggles the mystery, humor, and romance. It's a real pleasure to find such underrated treasures as this."
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "The City of Chicago is gripped by an Axe Murderer. The streets are empty at night as there has been six murders and six people have been caught, but they are lunatics. Only one person has lived to tell about it and that was Edwina, who is as dumb as a brick. If it were not for Oliver, she would be number seven. When there is a second attempt on Edwina, Oliver figures that the crimes are not random and that someone is hypnotizing these people to do his bidding, but the police and Edwina are skeptical.",
         "Six people have been murdered with axes in Chicago and, in each case, the killer has been caught and found to be a raving lunatic. Oliver Duffy, an unemployed actor, sees a sinister figure following Edwin Brown and he escorts her safely home. Keeping a watch over her, he catches the sinister man who also turn out to be a lunatic carrying an axe. Duffy concludes that a master-mind is behind the killings, and when a newspaper offers a $25,000 reward, Duffy resolves to win it. High on the lists of his suspects is a stage musician Edwina once knew in Paris."
      ],
      "budget": 0
   },
   "movielensId": 113585,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-04-22",
      "dvdReleaseDate": null,
      "directors": ["Charles Lederer"],
      "runtime": 80,
      "movieId": 113585,
      "title": "Fingers at the Window",
      "mpaa": "",
      "actors": [
         "Lew Ayres",
         "Laraine Day",
         "Basil Rathbone",
         "Walter Kingsford",
         "Miles Mander",
         "Charles D. Brown",
         "Cliff Clark",
         "James Flavin",
         "Russell Gleason",
         "William Tannen",
         "Mark Daniels",
         "Bert Roach",
         "Russell Hicks",
         "Charles Wagenheim",
         "Robert Homans",
         "Rand Brooks",
         "Frank McLure",
         "Arthur O'Connell",
         "Ray Teal",
         "Joe Yule"
      ],
      "imdbMovieId": "0034732",
      "originalTitle": "Fingers at the Window",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["IDp5jMs2xtI"],
      "plotSummary": "The City of Chicago is gripped by an Axe Murderer. The streets are empty at night as there has been six murders and six people have been caught, but they are lunatics. Only one person has lived to tell about it and that was Edwina, who is as dumb as a brick. If it were not for Oliver, she would be number seven. When there is a second attempt on Edwina, Oliver figures that the crimes are not random and that someone is hypnotizing these people to do his bidding, but the police and Edwina are skeptical.",
      "tmdbMovieId": 65210,
      "avgRating": 2.33333,
      "releaseYear": "1942",
      "numRatings": 3,
      "posterPath": "/aXfyWrHSBCGPDlIlciftUEN82hm.jpg"
   }
}