{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "uncle",
            "id": 6464
         },
         {
            "name": "singer",
            "id": 10229
         }
      ],
      "imdb_id": "tt0035710",
      "video": false,
      "title": "Campus Rhythm",
      "recommendations": [],
      "backdrop_path": "/uXRZntHZd5k3TwwFy7mtUbNRAfB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joan Abbott, aka Susie Smith",
               "gender": 1,
               "credit_id": "52fe4a8ec3a36847f81d4d35",
               "name": "Gale Storm",
               "profile_path": "/tYG9NcEOnzkijqVn7ACg8FkbAT3.jpg",
               "id": 109721,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "'Scoop' Davis",
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d39",
               "name": "Johnny Downs",
               "profile_path": "/shVecyKb99iqayV3dhrQ5FYJnPM.jpg",
               "id": 131442,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Buzz O'Hara",
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d3d",
               "name": "Robert Lowery",
               "profile_path": "/r65u9YC65MWPw0Ni5nYf651iyOU.jpg",
               "id": 34117,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Harold",
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d41",
               "name": "Candy Candido",
               "profile_path": "/5tjykiBmPIrnpPfHALfOqgEY7Nh.jpg",
               "id": 61676,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Babs Marlow",
               "gender": 0,
               "credit_id": "52fe4a8ec3a36847f81d4d45",
               "name": "GeGe Pearson",
               "profile_path": null,
               "id": 213827,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Uncle William 'Willie' Aloysius Smith",
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d49",
               "name": "Douglas Leavitt",
               "profile_path": null,
               "id": 34349,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "J.P. Hartman",
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d4d",
               "name": "Herbert Heyes",
               "profile_path": "/tPVQAGw2F9rKQTR9PHIbggP4cBl.jpg",
               "id": 82836,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Police Sergeant",
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d51",
               "name": "Tom Kennedy",
               "profile_path": "/v8VboGHq2aUqYG3l3WBPsyxSyad.jpg",
               "id": 34324,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Susie Smith - Hartman's secretary",
               "gender": 0,
               "credit_id": "52fe4a8ec3a36847f81d4d55",
               "name": "Blossom Rock",
               "profile_path": "/znPSoNjE6zdDxXYOBnzbwXWGFos.jpg",
               "id": 125848,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Freshie, a Freshman",
               "gender": 0,
               "credit_id": "52fe4a8ec3a36847f81d4d59",
               "name": "Johnny Duncan",
               "profile_path": "/jAvRRG18dpICQuU60JWZ1XFTobK.jpg",
               "id": 1061015,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Cynthia Walker",
               "gender": 1,
               "credit_id": "52fe4a8ec3a36847f81d4d5d",
               "name": "Claudia Drake",
               "profile_path": "/trukTJkJUSo34fpzOXlLaOWwx2K.jpg",
               "id": 85994,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a8ec3a36847f81d4d63",
               "name": "Arthur Dreifuss",
               "profile_path": null,
               "id": 588449,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56e849c89251410917003427",
               "name": "Charles R. Marion",
               "profile_path": null,
               "id": 133433,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56e849d3925141091d0032ed",
               "name": "Ewart Adamson",
               "profile_path": null,
               "id": 144022,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56e849dd9251411352000a8d",
               "name": "Jack Palmer White",
               "profile_path": null,
               "id": 114341,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.074554,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 108010,
      "vote_count": 1,
      "budget": 0,
      "overview": "Radio singer Joan Abbott, known as the \"Crunchy-Wunchy Thrush\", does not want to renew her contract with the cereal sponsor, as she wants to go to college. But her guardian, her Uncle Willie signs the contract in order to pay off his own debts.  But this time Joan won't take no for an answer and enrolls under an assumed name.  When Joan goes missing, the radio institutes a search for Joan via a publicity stunt.",
      "similar": [
         10760,
         114150,
         325133,
         20453,
         11137,
         8469,
         9285,
         8277,
         8065,
         440021,
         12620,
         22970,
         2907,
         2758,
         37247,
         8835,
         52449,
         10193,
         5559,
         254470
      ],
      "original_title": "Campus Rhythm",
      "runtime": 63,
      "poster_path": "/zXWPxuteRZnW4E3xqH1rW0oy6Ot.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Monogram Pictures",
         "id": 4395,
         "origin_country": ""
      }],
      "release_date": "1943-11-19",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "GET HEP to a HIT!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Arthur Dreifuss"],
      "runtime": 63,
      "synopsis": null,
      "writers": [
         "Charles R. Marion",
         "Ewart Adamson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0035710/",
      "coverLink": null,
      "actors": [
         "Johnny Downs",
         "Gale Storm",
         "Robert Lowery"
      ],
      "reviews": [
         "Some folks are fussing about the plot. Sure, it's thin, but it is fun and the picture is a delight thanks to a fine cast headed by the effervescent, Miss Storm. One critic referred to her as a faux Shirley Temple. Nonsense. She was an adorable,talented, easy on the eyes individual and, in this picture, she is a lot of fun. Johnny Downs, a busy and talented man and, my favorite non-star star, Robert Lowery, is always enjoyable to watch. One thing on which we all agree is that Candy Candido is a helluva lot of fun. All in all, \"Campus Rhythm\" is totally enjoyable. Small budget, small studio, big enjoyment. P.S. They kept talking about a Rawley College. As a North Carolinian I was proud and happy thinking it was Raleigh. Oh,well!",
         "It's a Monogram musical with 6 songs in 63 minutes. I am almost at a loss at what else to tell you. Here I go.....teen singer Gale Storm has had enough of being 'The Crunchy Wunchy Thrush' which in those days meant 'radio show sponsor's singer' as opposed to today which means 'see your chemist for the right ointment'. Gale skips on her renewal and hotfoots it to minor rural college under an assumed name: Sally something. Upon arrival she is corralled into some fraternity house by 'Buzz\" played like Jungle Jim on holiday by look-alike Robert Lowery (BATMAN from the serial of 1943)..... and accosted by \"Scoop\" the campus newspaper dude. The only highlight are the songs by delightful vocal funnyman Johnny Candy Candido who is so hilarious and effervescent... as he is in every film he appeared in the 30s/40s..eg: ROBERTA and SOMETHING TO SING ABOUT. Gale Storm is as usual her 'older pert Shirley Temple' teen self... but the film is basically dull, simple and forgettable. Even the other three songs make no sense and are un memorable.. as opposed to forgettable. Some contrived farce scenes at the radio station with exasperated squabbling replacing wit are slightly amusing only for their energy and obvious placement in the trailer. I wish I could say more positive things but CAMPUS RHYTHM but I would be out of sync with myself.",
         "Gale Storm became famous in two hit television series of the 1950's, \"My Little Margie,\" and \"the Gale Storm Show\" Except for Lucille Ball, she probably did more 1/2 hour episodes (294 total) on national television than anybody other actress. Before hitting it big on television in the Summer of 1952, she had been a star in some thirty movies starting at age 18 in 1940. She seems to have been under contract to Monogram, one of the poorest film studios in the early 40's, but did work her way up to doing some movies for majors like Columbia and Universal in the late 40's. In the mid 50's, during the time of her television triumphs, she also had a half dozen or so hit records. I was born in the 50's and I was one of her television fans, although I got to watch her series mainly in reruns in the mornings in the early 1960's. This was the first movie I have seen her in and she is just as delightful as she is in her television series. The only difference is that she is ten years younger. Surprisingly, she plays a singer in this movie. It is strange that she didn't have a record contract until the 1950's, her voice is sweet and natural. With all the talent scouts in Hollywood, you would have thought that one would recognize her singing talents. Being a Monogram picture, its technical quality is not much above a 1950's television sit-com. However, it is pleasant enough and does provide lots of amusing moments. The plot is Gale Storm as a radio singer signed to Crunchy-Wunchy breakfast cereal. She wants to break away and go to college. One has to imagine that she really wanted to break her contract with Monogram Pictures. She escapes to a college, but Crunchy-Wunchy starts a national campaign to find her. Storm was born about two months before Judy Garland in 1922. I couldn't help thinking of her as a low-rent Judy Garland here. They're both cute, talented and energetic. Ge Ge Person and Candy Candido provide some nice comic relief.",
         "I always had a fondness for Gale Storm since I enjoyed her in the \"My Little Margie\" TV series in the early 1950's. I had never seen her movies till I just saw a few on TCM cable TV. Pretty, perky Gale is the only really good thing in this movie. This movie is a great example of \"suspension of disbelief.\" Gale's character is the top singer on U.S. radio, who flees radio and her contract to attend college under an alias (she wants to enjoy the life of an average college girl). Even though she is a RADIO star, it seems unbelievable that no one on campus would recognize/suspect who she is especially after it is announced that she is hiding in some unknown college under an alias! I wish to draw attention to one clever scene in this routine movie: how she foils her uncle's attempt to expose her and bring her back to radio. Humorous Uncle Willie (played to good effect by Douglas Leavitt ) follows a lead that she is at a certain college. He sneaks into the girl's gym to find her, but accidentally tears his pant-leg. Gale then comes across him and has him go into the empty girl's dressing room. She says she will return with a needle and thread to sew the pants, which he is to toss out the door when she returns. However, she tells on him to the gym instructor. He tosses out the pants and is about to be booked by the cops, but Gale pleads for him by making a deal with the cops that if he promises to leave town and never return, he won't be charged as a pervert to spare his family scandal.",
         "Johnny Downs (Scoop), Gale Storm (Joan), Robert Lowery (Buzz), Candy Candido (Harold), Ge-Ge Pearson (Babs), Doug Leavitt (Uncle Willie), Herbert Heyes (Hartman), Marie Blake (Susie), Johnny Duncan (freshman), Claudia Drake (Cynthia), and Tom Kennedy. Director: ARTHUR DREIFUSS. Screenplay: Charles R. Marion. Additional dialogue: Albert Beich, Frank Tarloff. Original story: Ewart Adamson, Jack White. Photography: Mack Stengler. Film editor: Richard Currier. Art director: David Milton. Music director: Edward J. Kay. Songs: \"Walking the Chalk Line\" by Jules Lohman, Louis Herscher; \"Swing Your Way Through College\" by Andy Iona Long, Louis Herscher; \"It's Great To Be a College Girl\" and \"College Sweetheart\", both by Louis Herscher. Additional music: Edward Cherkose. Production manager: Dick L'Estrange. Sound recording: Tom Lambert. Producer: Lindsley Parsons. Copyright 8 October 1943 by Monogram Pictures Corp. No recorded New York opening. U.S. release: 19 November 1943. Australian release through British Empire Films: 20 April 1944. 5,624 feet. 62 minutes. SYNOPSIS: She's Singing Her Way Through College. COMMENT: This Monogram musical has Gale Storm, but little else to recommend it. That else includes a few jokes, buried in a tot of talk (\"Since 1 was knee-high to a grasshopper\"; \"Say, you sing a swell song!\"); plus a female voice impersonator; plus of course some mildly melodic songs. Typically dull direction from Arthur Dreifuss is not calculated to improve the picture's overall appeal. As I say, that appeal rests almost entirely on Gale Storm. You either like her or you regard her with indifference. Fortunately for me (and this review), I really like her! Nonetheless, you would think FIVE writers could come up with something more amusing, exciting and colorful than this ho-hum pastiche!",
         "Gale Storm who was Monogram's musical star in the Forties stars for them in Campus Rhythm about a female vocalist who has her own radio program for Crunchy Wunchy Flakes. Gale has a longing to go to college, something like Miley Cyrus as Hannah Montana who wanted to have a normal high school experience. What she does is exchange identities with another girl and enrolls. Where she's being vigorously courted by Robert Lowery who leads a college swing band and is the big man on campus and also by Johnny Downs who runs the student newspaper. Between Gale's romantic life and the desire of Crunchy Wunchy cereal to get back their Crunchy Wunchy Girl you've got the sum and substance of Campus Rhythm. Nothing terribly special about Campus Rhythm. Those who remember and watched The Gale Storm Show of the Fifties might be interested in the film.",
         "Lively, attractive cast lift this ultra-cheapo to pretty good entertainment. Professional songbird Dorothy (Storm) tires of her radio program, taking off to college to enjoy the social life, instead. There she meets an engaging cast of characters, including the slightly befuddled Scoop (Downs), rubber-face Babs (Pearson), handsome Buzz (Lowery), and what-voice-comes-next Harold (Candido). While waiting in the wings is the catty Cynthia (Drake). Together, they're a sprightly mix. I'd forgotten what an engaging performer Gale Storm is, so it was nostalgic to renew the acquaintance. And where did novelty act Candido come from. His voice range is truly astonishing. No, there's nothing special about this Monogram production. Looks like they spent about 50-bucks on the sets, while the few exteriors appear to have been shot on studio grounds. Still, I would say they got more than their money's worth.",
         "Shown on Turner Classic Movies. So half the cast is thirty, playing college students, and the rest of the cast wasn't much younger. There are more musical numbers here than there is plot.... the typical college campus antics. A whole lot of singing in this shortie. Gale Storm is Joan Abbott, who is sick of her job, and for SOME reason, has to change her name and go back to college. Not quite sure why she needed to change her name... were people not allowed to quit their job in the 1940's ? They send \"uncle willie\" to track her down and bring her back, and we watch HIM while he watches HER exercise in the gymnasium... a little creepy. Then there's the voice gag, where Candy Candido's voice (that's a guy, not a chick) keeps going high and low, even multiple times in the same sentence. Might have been fun the first time, but the repetition gets annoying, especially when he signs \"Me, Myself, and I\". Directed by Arthur Dreifuss, who also directed Riot on the Sunset Strip, which is SO much more interesting, and is based on actual events in Los Angeles. Watch that one instead.",
         "I caught \"Campus Rhythm\" on Netflix, on a whim. I'd like my 63 minutes back, please. First, the plot is as old and tired as vaudeville; \"trite\" doesn't begin to cover it. Second, the actors all appear to be in their 30s or older, despite them supposedly being college students. The men are, almost invariably, creepy leches, and the audience is somehow supposed to find them charming. Everything is shot on sound stages or back-lots, which sucks any energy or life out of the film. Finally, the music, which is leaned-on heavily, is just dismal with some of the most cringe-worthy lyrics I've ever heard. There were a variety of composers involved but none of them were worthy of polishing Cole Porter's shoes. All that's left of the film is some okay visuals and a bad aftertaste."
      ],
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "productionCompanies": ["Monogram Pictures"],
      "summaries": ["Radio singer Joan Abbott, known as the \"Crunchy-Wunchy Thrush\", does not want to renew her contract with the cereal sponsor, as she wants to go to college. Her Uncle Willie signs it for her, however, as she is under age. Taking the name and credentials of Susie Smith, the secretary of her employer, Hartman, she disappears and enrolls at Rawley College. There she meets Buzz, leading a college band, and Scoop, running a college newspaper, who induces her to become a reporter. The Crunchy-Wunchy company institute a search for Joan via a publicity stunt, and Scoop assigns Joan to write an editorial against this kind of bad publicity. The Abernathy Products Company institutes a nation-wide contest to find the best college band, and Rawley College is entered, with Babs, the band's soloist, coached by Joan. Cynthia, girl friend of Buzz, is jealous of Joan, suspects she is the missing \"Crunchy-Wunchy Thrush\" and notifies Uncle Willie. The night of the nation-wide band-contest broadcast, Babs gets sick, Joan replaces her... and the Monogram musical formula-finale begins."],
      "budget": 0
   },
   "movielensId": 113524,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1943-11-19",
      "dvdReleaseDate": "2011-09-22",
      "directors": ["Arthur Dreifuss"],
      "runtime": 63,
      "movieId": 113524,
      "title": "Campus Rhythm",
      "mpaa": "",
      "actors": [
         "Gale Storm",
         "Johnny Downs",
         "Robert Lowery",
         "Candy Candido",
         "GeGe Pearson",
         "Douglas Leavitt",
         "Herbert Heyes",
         "Tom Kennedy",
         "Blossom Rock",
         "Johnny Duncan",
         "Claudia Drake"
      ],
      "imdbMovieId": "0035710",
      "originalTitle": "Campus Rhythm",
      "genres": [
         "Romance",
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Radio singer Joan Abbott, known as the \"Crunchy-Wunchy Thrush\", does not want to renew her contract with the cereal sponsor, as she wants to go to college. But her guardian, her Uncle Willie signs the contract in order to pay off his own debts.  But this time Joan won't take no for an answer and enrolls under an assumed name.  When Joan goes missing, the radio institutes a search for Joan via a publicity stunt.",
      "tmdbMovieId": 108010,
      "avgRating": 2,
      "releaseYear": "1943",
      "numRatings": 1,
      "posterPath": "/zXWPxuteRZnW4E3xqH1rW0oy6Ot.jpg"
   }
}