{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "explosive",
            "id": 1653
         },
         {
            "name": "mexican revolution",
            "id": 2940
         },
         {
            "name": "train",
            "id": 13008
         }
      ],
      "imdb_id": "tt0048983",
      "video": false,
      "title": "Bandido!",
      "recommendations": [],
      "backdrop_path": "/xhGXG2A7etSz3vfRs8QtDQ0GbMu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Wilson",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff879",
               "name": "Robert Mitchum",
               "profile_path": "/q8imDThRFNQnfyRxadlBrKzGp4u.jpg",
               "id": 10158,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lisa Kennedy",
               "gender": 1,
               "credit_id": "52fe4672c3a36847f80ff87d",
               "name": "Ursula Thiess",
               "profile_path": "/gDcNesmzYO2BrI88BOgY6snp1dA.jpg",
               "id": 130054,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Col. Escobar",
               "gender": 0,
               "credit_id": "52fe4672c3a36847f80ff881",
               "name": "Gilbert Roland",
               "profile_path": "/ofMih1UHoO2zXXbBhtxRLB66xev.jpg",
               "id": 29273,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kennedy",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff885",
               "name": "Zachary Scott",
               "profile_path": "/q9Lm9im3Z2gaHZ1hmDmI3TIEN3u.jpg",
               "id": 31551,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sebastian",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff88f",
               "name": "Rodolfo Acosta",
               "profile_path": "/m7lQ5rATvSUtamHOj6qtfZJGDHr.jpg",
               "id": 24827,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Gonzalez (as Jose Torvay)",
               "gender": 0,
               "credit_id": "52fe4672c3a36847f80ff893",
               "name": "José Torvay",
               "profile_path": "/A5s0VGXCnVQsym4QaZkwyh3psvc.jpg",
               "id": 30307,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gunther",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff897",
               "name": "Henry Brandon",
               "profile_path": "/xjkd8VhfGkYidjMiqJ4tjihLHsH.jpg",
               "id": 30553,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "McGhee",
               "gender": 0,
               "credit_id": "52fe4672c3a36847f80ff89b",
               "name": "Douglas Fowley",
               "profile_path": "/moXauEE9cDCaHGNkbgIMVqWZiY3.jpg",
               "id": 13298,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4672c3a36847f80ff875",
               "name": "Richard Fleischer",
               "profile_path": "/pChGBiYPxqPfozB7GlDFCIjCQxs.jpg",
               "id": 2087,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff88b",
               "name": "Earl Felton",
               "profile_path": null,
               "id": 2089,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57ebea0292514118c6000634",
               "name": "Max Steiner",
               "profile_path": null,
               "id": 3249,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 0.936107,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44022,
      "vote_count": 2,
      "budget": 0,
      "overview": "American arms dealer Kennedy hopes to make a killing by selling to the \"regulares\" in the 1916 Mexican revolution. American mercenary Wilson favors the rebel faction headed by Escobar, and they plot to hijack Kennedy's arms; but Wilson also has his eye on Kennedy's wife. Raids, counter-raids, and escapes follow in a veritable hail of bullets.",
      "similar": [
         17774,
         9654,
         121,
         5503,
         8487,
         956,
         8810,
         137094,
         26389,
         57201,
         72331,
         110415,
         479363,
         399035,
         12162,
         157841,
         424,
         37686,
         116149,
         392044
      ],
      "original_title": "Bandido!",
      "runtime": 92,
      "poster_path": "/lRTcBYFI0w7yIvy89iAkHISWzhU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "D.R.M. Productions",
            "id": 2117,
            "origin_country": ""
         }
      ],
      "release_date": "1956-09-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "THE CRY THAT ROCKED THE WORLD'S HOTTEST STRIP OF HELL!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Fleischer"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Earl Felton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048983/",
      "coverLink": null,
      "actors": [
         "Robert Mitchum",
         "Ursula Thiess",
         "Gilbert Roland"
      ],
      "reviews": [
         "Disliked by some, the United Artists release BANDIDO (1956) is a reasonably enjoyable semi-western. Produced by Robert L.Jacks it is a handsomely mounted adventure in early Cinemascope and DeLuxe color arrestingly photographed by the great Ernest Laszo. Based on a story by Earl Felton, who also wrote the screenplay, the buoyant direction was by Richard Fleischer. Although something of a stranger when it came to making westerns Fleischer delivers the goods here without any trouble. His evocation of the Mexican revolution in 1916 (curiously the same year when the director was born) is perfectly established from the very opening shot and the bracing narrative is adhered to throughout its 92 min. Without any reason Fleischer is something of an underrated picture maker! Yet, classics like \"Trapped\" (1949), \"Armored Car Robbery\" (1950),\"The Narrow Margin\" (1952), \"The Vikings\" (1958), \"Compulsion\" (1959) and \"Tora Tora,Tora\" (1970) assure his standing as one of Hollywood's master craftsmen. While BANDIDO doesn't reach the lofty heights of any of these titles it nevertheless is still a fairly engrossing slice of entertainment. With bullets whizzing all around him American adventurer and gun runner Wilson (Robert Mitchum) arrives literally into the thick of the Mexican revolution to offer his services to the rebel side. Together with the leader Escobar (Gilbert Roland) and his men they set out to steal a major shipment of guns and ammunition from American arms dealer Kennedy (Zachary Scott) - not to mention Mitch himself giving Mrs. Kennedy (Ursula Thiess) the glad eye in the bargain. The picture ends with the rebel side finally getting possession of the huge cache of arms and using them in a fierce battle with the Federal troops. Performances are generally good throughout and the picture maintains an engaging pace. Dressed in Panama hat and white suit Mitchum, on one of his favourite stomping grounds Mexico, is very likable in his usual somni-eyed fashion. But the picture belongs to the charismatic Gilbert Roland. As Escobar he is the quintessential rebel leader. It is a part he was born to play. Good too is Zachary Scott as Kennedy the ill-fated arms dealer. However, there is a problem with the casting of the female lead! Ursula Thiess, an actress of limited appeal and with a gossamer thin screen presence, is dull and flat in her portrayal of the unhappy and bored Mrs. Kennedy. Whatever possessed the Mitchum character to be attracted to her in the first place is anyone's guess. Adding to the atmosphere is the fine score by the legendary Max Steiner. On loan from Warners this would be the composer's one and only score for a United Artists picture. The main title is a turbulent and aggressive full orchestral piece which points up the struggle and resolve of the Mexican proletariat. Then there is a wonderful central theme heard in different guises in the film as the mood demands. One winning rendition has it hauntingly sung by a guitar playing revolutionary at night. There is also a spirited military march for the Federal troops and some terrific action cues in the familiar Steiner manner for the many battle sequences. That same year 1956 the great Steiner would conceive his brilliant masterwork for John Ford's monumental \"The Searchers\". Not an outstanding movie by any stretch of the imagination but BANDIDO remains a reasonably good stroke of entertainment played out by an attractive cast and nicely structured by its makers. Well worth a peek!",
         "The Mitchum Adventurer combines awareness and intelligence with a drawling, almost sleepy relaxation... Possibly the essential Mitchum is to be found in this standard action movie - Mitchum stands fearlessly on the balcony of 'Villa Hidalgo' hotel, with a glass of scotch in his hand, to observe the local war, and lob a few hand grenades at the side which is going to pay him less for his services as a gun-runner... Mitchum is clearly an adventurer by nature who prefers to make love than war... He does not set out with the intention of fighting in the Mexican civil war... but gets caught up in the struggle of Gilbert Roland and his rebels against the repressive Federales... Lisa Kennedy, the Thiess character, encounters him soon... and gradually comes to love his nonchalant... laid-back stance... (As usual, Mitchum radiates dignity, intelligence and quiet strength... ) There is an endless battle... followed by a bout of drink... followed by an assault on an ammunition train... followed by a chase across a swamp... followed by a confrontation between rebels and federal troops... and with hundreds of extras running through dust and dodging explosions while nothing much is actually happening... Gilbert Roland fares better at suggesting the turbulent emotions roiling beneath masculine bravado... His Escobar has a positive flaw: he's desperate for bullets and explosives... Robert Mitchum was far from being the man in the street, this movement towards increasing involvement made him the representative of the audience in a way that figures of more obviously heroic stature - Peck or Wayne or Gary Cooper - cannot be. His screen persona differed from theirs in its apparent accessibility, without losing the essentially heroic dimension of capacity for action, an ability to deal with situations as they arise...",
         "Robert Mitchum had a hand in producing Bandido, an independent production released by United Artists in 1956. It was supposed to be more of an existential type story about a mercenary during the Mexican Civil Wars of the teen years. What finally emerged was your run of the mill action adventure story with Mitchum mixing business with pleasure during the revolution. The business was arms, but the pleasure was Ursula Thiess. Thiess is married to Zachary Scott who finds money far more beautiful than Thiess if that's possible. He's looking to sell a large cache of arms to the government which certainly has the cash on hand. Mitchum however while he says he's detached from the politics does harbor a certain sympathy for the rebels who locally are headed by Gilbert Roland. The film was shot on location in Mexico and the two best things it has going for it are the beautiful location photography in Mexico and the performance of Gilbert Roland. Roland's a bit more intense in his role as the revolutionary chief than he normally is, but he still has that incredible charm working overtime for him. There are so many films where I find him the best thing in them. According to the Mitchum biography by Lee Server, he got himself in a bit of woman trouble while down there. Nothing new for Mitchum except for the fact it was his stand in who abused a young woman who thought it was Bob himself. When you have that kind of a reputation, trouble will seek you out even when you're completely innocent. It all worked out for Mitchum however. Ursula Thiess pretty much ended her career as actress with this film, she had married Robert Taylor a couple of years earlier and was now going to be a mother again. She had two children by her first marriage to German producer George Thiess, but now she was going to devote full time to the raising of Taylor's children. Bandido is your run of the mill action adventure story. One wonders though what Mitchum had in mind for the original plot.",
         "There is something fabulous in watching a \"B\" western movie which never really made headlines or money,and watching two great actors in Robert Mitchum and Gilbert Roland. The story line is standard,scenery average but you have two Hollywood stars doing what they did best. Very few of todays' \"stars\" have the personality or magnetism of Robert Mitchum and it is always a treat just to watch him on the screen.I watch these movies just to see these personalities jump out at you from the screen,and find very little satisfaction in watching many of todays' movies which lack everything,from direction,writing,and star power.One can only put up with special effects for a short while,this movie is back to the basics,enjoyable to while away a couple of hours and forget the troubles of the modern world.",
         "You can usually count on Richard Fleisher to deliver the goods, and here he does not disappoint. Robert Mitchum as an American soldier-0f-fortune gives a good performance. However, the always reliable Zachary Scott virtually steals the movie in the heavy role. The film was shot on location and that certainly adds to the fun. I recommend this film.",
         "This is a fun Robert Mitchum movie, with a little taste of the \"Magnificent Seven\". Mitchum plays an American adventurer who runs afoul of American gunrunner Zacary Scott. While attempting to steal the shipment of guns from Scott he becomes involved with Scotts wife as well as the noble cause of the revolution. He ultimately sees that the rebels get the guns. This movie is very enjoyable, with the always good performance of Gilbert Roland (as the rebel general) and several other recognizible Hispanic actors such as Rudy Hoyos. I haven't seen this movie shown on TV even on cable for years. I would definitely like to see it released on VHS. The movie has some pretty good action scenes so if you get a chance to see it, DO!",
         "I watched this movie for two reasons--Robert Mitchum and Zachary Scott. Now for anyone who loves classic Hollywood films, there's really no reason to explain in depth my reason to watch a Mitchum film--after all, he's Robert freakin' Mitchum--a wonderful actor who made everything (even crap) quite watchable. As for Zachary Scott, while he's far from a household name, I loved how slimy he could be--and when I read he was playing a guy who's selling guns to get rich during the Mexican Civil War of the 1910s, it sounded like a role PERFECTLY suited for him. Sadly, however, both actors were pretty limp here--particularly Scott. And, on top of that, the writing really was pretty sad. The film starts with Scott making a deal with the Federales (troops of the Mexican government). His wife (Ursula Thiess) obviously doesn't like him very much and seems to be biding her time with him. Robert Mitchum, another American, wanders in--apparently to scout out the situation. Soon, he leaves and walks right into a nearby battle between the Federales and the Revolutionaries. Now this part of the movie is really, really dumb. Seeing Mitchum casually strolling about the town with thousands of whizzing bullets flying about was really silly. How could he avoid the bullets?! I guess Mitchum must have been wearing bullet-repellent underwear. In a fit of boredom (or perhaps it was because the bullets broke his bottle of booze), Mitchum decides to stop merely watching the fighting from his balcony and tosses out a few grenades--endearing him to the Revolutionary leader (Gilbert Roland). A bit later, Mitchum and Roland hit on a scheme to kidnap Scott and his sultry little Wiener Schnitzel (Thiess). At this point, you'd think the film was going to improve following the dopey scene where Mitchum is taking a stroll through a war zone, but it actually will eventually lead to the film completely falling apart for me. Mitchum is supposed to be a self-centered mercenary....yet he throws it all away to spare Scott's wife from being killed. This made no sense at all, nor did Roland's decision NOT to shoot Mitchum in the face for doing this (in direct opposition to his orders). And the last portion of the film was pretty much all action and by then I was ready for the next film! By the way, while Miss Thiess is NOT a household name and only made a few American films, this German actress caught Robert Taylor's eye and they married--and remained married until his death in the late 1960s.",
         "I was very glad to find this great little movie on Youtube in full, as i had been wanting to see it for quite some time. Robert Mitchum gives an excellent performance as grenade toting adventurer Wilson and the action is satisfactory. The action comes in the form of a battle in a town near the beginning of the film which makes good use of rifles, cannons and Gattling gun and showcases Wilson tossing grenades into the town square and taking out a dozen guards. There is also another scene when Wilson and some other character escape from a prison and make their way through a jungle,which is quite unusual for a western. The film ends with a small shootout in which Wilson uses a Gattling gun to blow up several enemy soldiers. An excellent little film, but a tad too much dialogue. The scenery is beautiful and the film is beautifully photographed, shots of lush green jungles, rugged mountains and a beach will live long in your memory. I would really like to see this gem released onto DVD or shown on TV soon.",
         "How can a movie be this noisy and still put me to sleep? Is it the writing, which would have me believe: o An adventurer with seeming inexhaustible amounts of money would risk life and limb to GIVE away tons of arms and ammunition to `the revolution'? o That rebels would ride off and leave machine guns and light artillery pieces behind? o That Robert Mitchum, a prisoner scheduled to be shot, could hide two hand grenades in his jacket? o That Ursula Theiss, held hostage by seasoned rebels, would be allowed to keep a gun in her purse? Ursula Theiss (Mrs. Robert Taylor) is pretty, but her love scenes with Mitchum lack spark. Far better is the interplay between Mitchum and Gilbert Roland, as well as his scenes with Zachery Scott and José Torvay (Gonzalez). In fact Mitchum's scenes with practically everyone but Theiss are better than his with her. Not very smart when the plot devices hinge on the Mitchum / Theiss relationship. Dull, dull, dull, and LOUD!",
         "\"Bandido\" is a sort of western settled settled during the Mexican revolution leaded by Emiliano Zapata against the ruling of Porfirio Díaz in the early 20th century. Robert Mitchum is an American adventurer that makes his living by selling guns to the part that pays better who predictably turns for the just cause. The villain is the always reliable Zachary Scott, obviously in the \"wrong\" side, married to the amazingly beautiful but wooden Ursula Theiss who obviously too turns her affections to Mitchum. Gilbert Roland is a revolutionary leader who also goes for the guns for his cause. Though not a great film at all, \"Bandido\" is an entertaining adventure with a simple script, a rather fast development, impressive outdoor locations (mainly at the seashore), a good colourful photography, romance and well handled action sequences. Richard Fleischer was a daring all-terrain director who gave as such good products in different genres as \"Compulsion\", \"Soylent Green\", \"Blind Terror\", \"The Vikings\", \"Tora Tora Tora\", \"Ashanti\", \"The Boston Strangler\" or \"The Jazz Singer\" (1980). He tries his hand in westerns here and he gets an acceptable movie surely enjoyable for fans of the genre.",
         "In a distinguished career spanning over four decades, film director Richard Fleisher called the shots on a number of memorable, well-made movies. In the 1950s, he gained acclaim with his hard-nosed crime thrillers, among them \"Armored Car Robbery\" (1950), \"The Narrow Margin\" (1952), and \"Violent Saturday\" (1955). Later, he would turn to true-life crime with \"Compulsion\" (1959), \"The Boston Strangler\" (1968), and \"10 Rillington Place\" (1971). Many remember him for his ground-breaking sci-fi films, among them \"20,000 Leagues Under the Sea\" (1954), \"Fantastic Voyage\" (1966), and \"Soylent Green\" (1973). Fleisher also ventured with serviceable results into the realm of fantasy with the seminal Kirk Douglas & Tony Curtis saga \"The Vikings\" and then later teamed up with Arnold Schwarzenegger to helm \"Conan the Destroyer\" (1984) and \"Red Sonja\" (1985). Fleischer directed the Darryl F. Zanuck-produced World War II epic \"Tora, Tora, Tora\" (1970) long before Michael Bay's turgid, soap operatic \"Pearl Harbor,\" and he directed one of the more controversial biographies of the 1960s: \"Che!\" (1969) with Omar Sharif as the legendary Argentinian Communist revolutionary and guerrilla fighter Che Guevara and Jack Palance as Fidel Castro. Mind you, he has also made his share of turkeys: \"Doctor Doolittle\" (1967) with Rex Harrison and \"Mandingo' (1975) with James Mason. During those 40 years, Fleisher experimented with virtually every genre. He made one Biblical epic \"Barabbas\" (1961) and \"Amityville 3-D\" (1983). Interestingly, he is least remembered for his three westerns: \"Bandido\" (1956), \"These Thousand Hills\" (1959) and the Lee Marvin outlaw epic \"The Spikes Gang.\" Robert Mitchum plays Wilson, an American adventurer in a white linen beneath the Mexican border trying to arrange an arms deal between a trigger-happy Hispanic bandit colonel (Gilbert Roland of \"The Torch\") and another well-heeled gringo merchant Kennedy (Zachary Scott of \"Mildred Pierce\") who initially plans to sell his ordinance to the Mexican Army. Director Richard Fleisher helmed this atmospheric, 1916-circuit shoot'em up on actual Mexican revolutionary battle sites with extras who had served on both sides of the fracas and swapped lead with each other. Scenarist Earl Felton penned the exciting but occasionally contrived screenplay. Interestingly enough, \"Bandido\" qualified as the fourth collaboration between Fleischer and Felton. Earlier, they had worked together on Fleischer's hard-boiled crime thrillers. Compared with the westerns of the 1960s and the 1970s, \"Bandido\" is more noisy than bloodthirsty. Indeed, thousands of rounds of ammunition are expended, but you don't see blood-splattered bodies tumbling every which way as they would later in the films of Sam Peckinpah. Nevertheless, when this Mexican revolutionary melodrama came out in the 1950s, there weren't that many westerns of its kind being released. Indeed, Italian writer & director Sergio Corbucci drew inspiration from \"Bandido\" to make a couple of trendy Franco Nero spaghetti westerns: \"A Professional Gun\" (1968) and \"Companeros\" (1970). This type of spaghetti western became a sub-genre of its own during the 1960s and the 1970s. (Not only did Fleischer's \"Bandido\" inspire these Euro westerns, \"The Vikings\" had given rise to the short-lived Viking peplum movies such as \"Erik the Conqueror\" and \"Knives of the Avenger.\") Anyway, our money-hungry mercenary hero shows Escobar the bandit colonel how he can obtain the arms that he so desperately needs. Escobar and his peasant army commandeer the train that the Mexican government has provided Kennedy. At the same time, the villainous Gunther (gimlet-eyed Henry Brandon, best known for his treacherous Indian in the John Wayne epic \"The Searchers\"), the go-between Kennedy and the Mexican generals, suggests to Kennedy before the train falls into Escobar's hands, to send the Mexican revolutionaries on a wild goose chase to a sea-side villa where Gunther will arrange to have the soldiers rescue him. Gunther then escapes capture and heads off to warn the Mexican General about this turn of events. Instead, a wily Wilson convinces Escobar to hold Kennedy captive and send Kennedy's beautiful wife Lisa (German actress Ursula Thiess) with an escort to where the guns are stashed. Escobar is the kind of character who doesn't let people lie to him more than once. At the last minute, Wilson suspects that Kennedy has dispatched his wife and the revolutionaries on the wrong trail, so he rides after them. Wilson saves Lisa from being gunned down, but he puts himself at odds with Escobar who is only too willing to kill him. Eventually, Escobar's resourceful men capture Wilson and throw him in jail with Kennedy who realizes the error of his ways. At this point, Felton's screenplay gets a little too cute. When the bandits decide to execute Wilson, they allow him to take his jacket with him. Earlier in the action, our hero made a big deal out of the hand grenades that he kept in his suitcase with his linen, so it shouldn't come as a surprise that he uses a couple of hand grenades to break Kennedy and himself out of jail. They escape through a swamp and Kennedy grudgingly reveals the whereabouts of the ordinance. Predictably, when Kennedy bad mouths Wilson about his treachery, Escobar is nearby and learns what a nice guy that Wilson is and allows him to live. Kennedy dies in a blaze of gunfire and our heroes find the ordinance and save the day. The romantic subplot between amorous Wilson and Kennedy's unhappy wife generates few sparks and it's easy to see why Thiess' career foundered. Meanwhile, the camaraderie between Mitchum and Roland is first-rate, just the kind of stuff that Italian westerns who pay homage to. Later, Roland made several spaghetti westerns as a Mexican bandit type. If you can catch a letterboxed copy of \"Bandido,\" you can see some truly gorgeous scenery and camera work. Mitchum would later encore in a similarly themed western from the same era entitled \"The Wrath of God,\" where he would play another adventurer who lugged around a Thompson submachine gun in a suitcase rather than a pair of hand grenades.",
         "For not completely understandable reasons, the soldier-of-fortune Wilson (Robert Mitchum) is sentenced to be shot by his ex-friends, the Mexican revolutionaries. However, he escapes from jail using two hand grenades he has in his pockets! This is just the highlight of the many absurdities of the story of \"Bandido\". As a matter of fact, the Mexican revolutionaries look so incredibly stupid to suggest some racial prejudice against them. Fortunately, this is manifestly impossible, since the film-maker keeps showing himself totally sympathetic with the revolution, even too much. Some other outstanding examples of dumbness. The beautiful hostage Mrs. Kennedy has a gun in her purse, since nobody has searched her. The revolutionaries instantly trust the slimy arm dealer Kennedy (by the way, perhaps the nicest character in the movie), that tells them the weapons are hidden in a false place, where the federals are fixing an ambush. Later, the revolutionaries decide to whimsically shoot Wilson, the only one who can help them. However, in spite of the film-maker intentions, Wilson doesn't seem much smarter, either. He gets that Kennedy lies and is planning some trick. Why doesn't Wilson openly explain the situation to his friend Escobar? This little omission will cost him a death sentence. Later, when Wilson and Escobar make it up, they immediately ride to the hidden arsenal. Only, they are closely chased by a battalion of federals! Wouldn't it be better to leave behind the enemy, in the first place? Other major flaws of the movie are concerned with the action scenes. The revolutionaries on horse-back attack a train, defended by federals with machine guns. I say, isn't a train faster than horses? Don't the machine guns easily exterminate the chargers (it is well-known that these weapons caused the disappearance of the cavalry charges). And why the engine-driver suddenly stops the train? (To be pedantic, the horses should be exhausted and unable to charge, since they have run all the preceding night long.) At the end, Wilson and Escobar destroy in one shot the battalion of federals, making a boat full of dynamite explode. That is totally unrealistic. At the very best, the explosion would have killed Wilson and Escobar, as well. I'm sorry for my negative comments, since the director Fleischer is a solid professional, that made a number of very good noir-films in the early 1950s. Well, \"Bandido\" actually has a remarkable merit, the stunning beauty of the Mexican locations, enhanced by an accurate and stylish photography. There is some good wise-cracking dialog, as well. Unfortunately, the beauties of Mexico are not enough to make \"Bandido\" a recommendable movie.",
         "...and nobody seems to care too much.The political background is completely absent and boils down to the \"regular army\" against the \"rebels.Like in the good old Maximilian von Hasburg/Juarez days.Plus ça Change.. Enter Kennedy and his wife:he wants to sell ammunition to the Army ;his wife is some kind of bait;her husband\" pawns\" her when necessary . Enter Wilson:he sides with the rebels and of course he falls in love with... It's Mitchum's character ...nuff said Robert Mitchum does not seem to care a little bit about what happens in Mexico.His face remains impassive.As he tells Escobar \"I have fun and I make money\". A minor Fleischer,moderately entertaining.",
         "A fairly routine Western -- shot nicely in Mexico by Richard Fleischer and his crew. Mitchum is an observer of the Civil Wars during the early 1900s and manages to wangle a barge load of weapons for the good guys, in this instance the rebels, out of treacherous, avaricious Zachary Scott. Scott gets what's coming to him and Mitchum gives the guns away to rebel leader Gilbert Roland but gets Scott's admirable ex-wife anyhow. I got a little lost towards the middle. Well, anyone might find it a little confusing, what with Gilbert Roland and the rebels on one side, and Victor Junco (in a believable performance) and the Army on the other. The plot never makes it entirely clear which side is the more virtuous, although with the affable Gilbert Roland we can make a good guess. Also there's enough intrigue to confuse anyone. Who will Scott's wife, Ursula Thiess, finally cleave to. But again, with Mitchum, there isn't too much doubt. Several action scenes and some nice location shooting liven up a plot that doesn't come anywhere near gripping. At the end I was glad Mitchum hadn't been executed. Of course I didn't want the helpful and sympathetic priest killed either. Ursula Thiess I also wanted to see live, but only just barely, because I don't like seeing women plugged on screen. Otherwise -- how do you convey a shrug in print?"
      ],
      "genres": [
         "Action",
         "Adventure",
         "War",
         "Western"
      ],
      "productionCompanies": ["D.R.M. Productions"],
      "summaries": [
         "American arms dealer Kennedy hopes to make a killing by selling to the \"regulares\" in the 1916 Mexican revolution. American mercenary Wilson favors the rebel faction headed by Escobar, and they plot to hijack Kennedy's arms; but Wilson also has his eye on Kennedy's wife. Raids, counter-raids, and escapes follow in a veritable hail of bullets.",
         "An arms dealer and a mercenary cross swords during the 1916 Mexican revolution."
      ],
      "budget": 0
   },
   "movielensId": 113663,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-09-01",
      "dvdReleaseDate": null,
      "directors": ["Richard Fleischer"],
      "runtime": 92,
      "movieId": 113663,
      "title": "Bandido!",
      "mpaa": "",
      "actors": [
         "Robert Mitchum",
         "Ursula Thiess",
         "Gilbert Roland",
         "Zachary Scott",
         "Rodolfo Acosta",
         "José Torvay",
         "Henry Brandon",
         "Douglas Fowley"
      ],
      "imdbMovieId": "0048983",
      "originalTitle": "Bandido!",
      "genres": [
         "Action",
         "Western"
      ],
      "youtubeTrailerIds": ["jA6OGVlPStM"],
      "plotSummary": "American arms dealer Kennedy hopes to make a killing by selling to the \"regulares\" in the 1916 Mexican revolution. American mercenary Wilson favors the rebel faction headed by Escobar, and they plot to hijack Kennedy's arms; but Wilson also has his eye on Kennedy's wife. Raids, counter-raids, and escapes follow in a veritable hail of bullets.",
      "tmdbMovieId": 44022,
      "avgRating": 2.5,
      "releaseYear": "1956",
      "numRatings": 1,
      "posterPath": "/lRTcBYFI0w7yIvy89iAkHISWzhU.jpg"
   }
}