{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0112777",
      "video": false,
      "title": "Dadetown",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe494d9251416c910a8f01",
            "name": "Russ Hexter",
            "profile_path": null,
            "id": 932368,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.043336,
      "production_countries": [],
      "id": 85588,
      "vote_count": 1,
      "budget": 0,
      "overview": "Interviews in the Michael Moore/\"Roger and Me\" tradition examine life in small-town America, class conflicts and the collapse of an upstate New York community, Dadetown, when the town's once-prosperous factory, reduced to the manufacture of paper clips and staples, finally closes. Facing massive unemployment, the blue-collar Dadetown residents next find yuppies moving into town to staff the local division of a big computer outfit.",
      "similar": [],
      "original_title": "Dadetown",
      "runtime": 93,
      "poster_path": "/had64ANNvfBKFkoNgULqiyZDxOv.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1995-09-02",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Russ Hexter"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Russ Hexter",
         "John Housley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112777/",
      "coverLink": null,
      "actors": ["Stars: Jim Pryor, Stephen Beals, Fred Worrell | See full cast and crew »"],
      "reviews": [
         "I can't believe out of all the reviews no one has zeroed in on the same issue that makes this movie \"genius\" in my opinion. The film's release was timely in that it correlated with the 1996 Presidential Campaign. Dadetown, better than any other film of that era, succinctly sums up the opposed and at least juxtaposed worlds that the two candidates at the time, Bob Dole and Bill Clinton, presented as the future for America. In every way, the divided community of Dadetown represented the many talking points delivered by both candidates: Dole's WWII experience, the dignity of his service, All-American apple-pie values and the legacy of America's 20th century industrialization v/s Clinton and Gore's advocacy to advance the information age and its digitization of everything and to accept and successfully compete in a new global economy that was believed to deliver a greater American prosperity for the 21st century. Dadetown is one of many, but limited cultural markers of the late 20th century that successfully foreshadows the American cultural divide that we are still living with today. Dadetown was not widely distributed and because of that unfortunately, was not referenced in later and seminal works on American political culture such as John Sperling's \"The Great Divide: Retro vs. Metro America\" (2004).",
         "I was reading trough some of the comments and while some claim that characters are over the top I disagree. In fact I would be willing to bet that anyone who hasn't seen the movie and doesn't know they are watching a movie will not be able to detect that it is fake. It is undetectable, I don't care what anyone claims they noticed. A wonderful film. I actually felt sorry for the characters and loved the ending. That is to say the portion of the film before the credits. Renaming the town Parsons Park was genius. I was smiling and angry at the same time, and then the credits rolled...and my jaw dropped. I loved it, I give it a 10.",
         "\"Dadetown\", the first and sadly only film directed and co-written by Russ Hexter, is a pseudo-documentary which tells the story of a small, seemingly idyllic town whose residents are upended with the introduction of a high-tech company (and the influx of their highly educated workforce) while also dealing with the closure of a factory that had traditionally been the backbone of the town. The movie plays as a documentary - a documentary that we've seen before in movies such Barbara Koppel's \"American Dream\". As the film goes on, however, one senses that something's not all right in \"Dadetown\". Some of the \"residents\" seem to be a little too camera-ready and even a bit rehearsed. Events seem to happen awfully quickly and coincidentally. And the camera has a rather remarkable ability to always be in the right place at the right time...sometimes even two places at once. The viewer soon realizes that what they're looking at is not an actual documentary, but what seems to be a staged documentary. Remarkably well-done, more or less convincingly acted, and occasionally engrossing, but still...fake. Which brought up the question as I was watching this film...Why was it made? The movie, in a capsule, presents us the seemingly perfect All-American Small Town. A high-tech computer firm, API, decides to move their headquarters there (thanks in part to a generous tax break engineered by the de facto town leader for the past 34 years, Bill Parsons) and quickly a divide is formed between the employees of API and the locals who were there before them. The situation remains tense, but harmless until the other major employer of the town, \"Garman Metals\" begins laying off workers. Soon, many in the town begin blaming API and random acts of vandalism occur. Even more non-sensically, some of the metal workers decide to strike - a strange maneuver for a company looking to lay off workers anyway. The personalities and emotions that boil over due to these circumstances is what makes up the heart of this film. Unfortunately, because the film isn't real, it's hard to muster up a lot of energy or emotions for what's going on. Too many of the characters are either cliche's (the angry town workers who as things go bad seem to be unable to do much more than drink beer, hunt and blame minorities) or just a little too over the top (the spokesman for API is just not quite right and is one of the giveaways that the film isn't real) or just not diverse enough. That's not to say some of the characters aren't fascinating, most notably Bill Parsons, the sort of grandfatherly wise-man who seems to be single-handedly guiding the towns future, even from beyond his grave. Still, I wonder what Hexter's motivation was for making this film. As mentioned before, similar stories that were actually real events have already been told so he wasn't really shedding new light on anything we haven't seen before. The film itself doesn't seem to making an underlying point about anything in particular, other than change is inevitable. And the truth of the matter is that the course of events in the film are so predictable that it gets a little boring after a while. I have read that one of Hexter's motivations was to show how often documentarians can come into a situation as a supposed impartial observer, but actually have an impact in the events that occur. Certainly that's a worthwhile subject, but this film doesn't show that in any way. Everything that happened, the moving in of one company, the departure of another, the inevitable class distinctions and hardships, clearly would have happened in a town this size because they've been happening in towns across America for the past 20 years and a camera hasn't always been there to record it. In the end, however, one has to salute the audacity of Hexter to make this kind of film. There were times when Hexter could have made this film darker and more comedic, or put it in the realm of situations becoming more and more absurd as the film goes on (such as in Larry David's HBO Show). But he never wavers. He is going to play this straight until the very very end. And I must admit, even as the film continued on and I was 95% sure it was a farce, every now and then something would happen that I'd start to doubt myself and I'd think that maybe, just maybe, this is real. But alas, the credits role and that lingering 5% hope that you hadn't just wasted the past 90 minutes on a beautiful, brilliant, ambitious but ultimately pointless film, fade away as the \"written by\" and \"cast\" names roll by. In the end, this film seems to be a bit of an ego project for Russ Hexter...an almost \"I knew I could do it\" . Still, this is a fascinating film if just for its concept and the acting by the apparently all non-actors is remarkably good and usually quite convincing. Russ Hexter looks to have possessed a world of talent and a keen understanding of how documentaries, and just film in general, needs to and should look.",
         "This film tells the story of a small town that experiences the simultaneous decline of its principal industrial employer, a metal fabricating plant, and the rise of a high tech computer imaging company. The tensions created among the town populace and employees of the two companies make for a fascinating social and psychological account. It is, at times, a funny film and an emotional film. The BIG surprise for the viewer comes at the film's end as the credits begin to roll. What had appeared to be a bona fide documentary film turns out to be, well, a documentary film with credited actors! It caught this reviewer by total surprise as all of the interviews and the production style had 100 per cent documentary all over them. Director Russ Hexter has written and directed a minor film masterpiece. The fictional town of Dadetown is the back drop for telling the now all too common story of the decline of Rust Belt industries and the rise of silicon-based technology. It is an engrossing story and it is well presented and well told.",
         "I thought that I was really witnessing a true situation. The \"stuff' in the film could actually happen in real life and I think that was the creator's point.I have been around for quite a while and have seen this kind of emotion exhibited by the townspeople all too often in some of the strikes and job actions that have occurred. A good film, that I hope sends a message.",
         "After seeing this film,I was impressed with it's high level of emotion...after discovering it to be fiction, I was completely impressed with the director's ability to portray such a real story, even if it was \"fake\"",
         "After watching 15 minutes of this movie it becomes readily apparent that it is not a documentary, and its subjects not being real people but just actors. But in this fact, something can be learned by actors just how unreal they are in delivering lines. What is supposed to be poigant moments in a worker losing his job, instead becomes a futile attempt at sincerity. They are clearly actors. No emotion. No caring. Even the 2 camera shots, cutting and swoosh pans are easily seen as 'direction' and not 'moments captured' But it beats a poke in the eye with a sharp stick.",
         "This mock-umentry works on so many levels. How the director got such realistic performances from his myriad actors might probably be due to the reality that the film faces, i.e. the demise of the middle-class in America. Be afraid, be very afraid. But yuck it up at the same time. The film encourages us to laugh at the past, and move on. Also watch \"Wonderland\", a true documentry, that covers similar grounds.",
         "Very good movie, making a point of showing how whose on top today may not always be there. Recommended viewing SPOILER!!!! However, I was not aware of the true design of this movie, and was stunned at the closing credits. Felt like I had seen a serious Spinal Tap movie.",
         "I hated this movie. Five minutes in I realized it was a hoax. The acting was terrible, the lines were obviously scripted, and there were just too many cliches. You'd have to be really naive to go through the whole movie without noticing these clear signs of a poorly made mock-umentary."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Big Ol' Productions"],
      "summaries": ["Interviews in the Michael Moore/\"Roger and Me\" tradition examine life in small-town America, class conflicts and the collapse of an upstate New York community, Dadetown, when the town's once-prosperous factory, reduced to the manufacture of paper clips and staples, finally closes. Facing massive unemployment, the blue-collar Dadetown residents next find yuppies moving into town to staff the local division of a big computer outfit."],
      "budget": 0
   },
   "movielensId": 1138,
   "movielens": {
      "languages": [""],
      "releaseDate": "1995-09-02",
      "dvdReleaseDate": null,
      "directors": ["Russ Hexter"],
      "runtime": 93,
      "movieId": 1138,
      "title": "Dadetown",
      "mpaa": "NR",
      "actors": [""],
      "imdbMovieId": "0112777",
      "originalTitle": "Dadetown",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Interviews in the Michael Moore/\"Roger and Me\" tradition examine life in small-town America, class conflicts and the collapse of an upstate New York community, Dadetown, when the town's once-prosperous factory, reduced to the manufacture of paper clips and staples, finally closes. Facing massive unemployment, the blue-collar Dadetown residents next find yuppies moving into town to staff the local division of a big computer outfit.",
      "tmdbMovieId": 85588,
      "avgRating": 3.40909,
      "releaseYear": "1995",
      "numRatings": 55,
      "posterPath": "/had64ANNvfBKFkoNgULqiyZDxOv.jpg"
   }
}