{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ex-cop",
            "id": 8440
         },
         {
            "name": "bail bondsman",
            "id": 183979
         }
      ],
      "imdb_id": "tt0041278",
      "video": false,
      "title": "A Dangerous Profession",
      "recommendations": [
         26948,
         26666,
         26663,
         26220,
         27446
      ],
      "backdrop_path": "/dSLVpV4kPZ4x81kEj16YWO6aqgz.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5385c10a0e0a26144d00124b",
         "content": "Penal Code - 1096\r\n\r\nA Dangerous Profession is directed by Ted Tetzlaff and written by Warren Duff and Martin Rackin. It stars George Raft, Ella Raines, Pat O'Brien, Bill Williams and Jim Backus. Music is by Frederick Hollander and cinematography by Robert De Grasse.\r\n\r\nThe scene is set, it's Los Angeles and Police Lt. Nick Ferrone (Backus) explains to us with stentorian narration about the whiles of bail bond brokers. This story is concerned with one in particular, Vince Kane (Raft), a one time policeman who followed the lure of the coin into a partnership of a bail bonds operation. It's all going swimmingly well, he's making lots of cash, has gals eating out of his hand, but when a pretty face from his past turns up requesting a favour? Vince suddenly finds himself in a quagmire of murder, deceit and emotional discord.\r\n\r\nWhat cop ever reformed?\r\n\r\nShall we cut to the chase here? This is not a \"great\" film, though I do believe that it's very under seen and therefore the meagre internet ratings it has - and the lack of reviews for it - don't quite tell the whole story.\r\n\r\nThere's nothing particularly striking about the visual aspects here, De Grasse's photography occasionally falls in line with what film noir fans consider standard procedure, which has led a few critics to question the film's film noir status. This is all about Vince Kane and how he is thrust into a murky new world by a slinky femme, it may be a whodunit in essence, but the Vince and Lucy Brackett (Raines) axis is most assuredly noir.\r\n\r\nYou phony Gumshoe!\r\n\r\nAction is in short supply, leaving much of the piece in talky territory. There's a few zinger lines of dialogue in the mix, but mostly it's screen writing 101. Yet in spite of the mixed qualities on offer here, it's a film that Raft fans are sure to enjoy, because he's very much great value as the stoic but emotionally troubled Vince. In fact O'Brien turns in one of his better performances and Raines is pleasingly sultry, meaning the cast perform well up to scratch, even if the screenplay does them few favours.\r\n\r\nA mixed bag for sure, and hardly essential for fans of such cinematic fare, but there's just enough from the cast to make this one above average. 6/10",
         "url": "https://www.themoviedb.org/review/5385c10a0e0a26144d00124b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Vince Kane",
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e147",
               "name": "George Raft",
               "profile_path": "/orQya82STEGviY0ARuyo3AIt1Ud.jpg",
               "id": 3152,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Lucy Brackett",
               "gender": 1,
               "credit_id": "52fe4798c3a36847f813e14b",
               "name": "Ella Raines",
               "profile_path": "/afTfqyrJDcFpToQ7IIb2worWdMn.jpg",
               "id": 78052,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Joe Farley",
               "gender": 0,
               "credit_id": "52fe4798c3a36847f813e14f",
               "name": "Pat O’Brien",
               "profile_path": "/nRd6AufixcDcptqRSJwq1pTLArX.jpg",
               "id": 3155,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Claude Brackett",
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e153",
               "name": "Bill Williams",
               "profile_path": "/aiT5YrtT8w6S1Ujz4hSdDDNNHOR.jpg",
               "id": 96243,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Police Lt. Nick Ferrone / Narrator (as James Backus)",
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e157",
               "name": "Jim Backus",
               "profile_path": "/iBZLbwdnnT9pFnBIlBZPfT6n06b.jpg",
               "id": 2771,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Jerry McKay",
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e15b",
               "name": "Roland Winters",
               "profile_path": "/qYU5Z3pS6Ac9EK5fB68bamsJTmL.jpg",
               "id": 83822,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Elaine Storm",
               "gender": 0,
               "credit_id": "52fe4798c3a36847f813e15f",
               "name": "Betty Underwood",
               "profile_path": "/fWGF6vFsgXrCAWMZmX5QRKd5YIk.jpg",
               "id": 142347,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Roy Collins, aka Max Gibney",
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e163",
               "name": "Robert Gist",
               "profile_path": "/lOgVwXZIesDeNoRarvynXGFodXH.jpg",
               "id": 12504,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Matthew Dawson",
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e167",
               "name": "David Wolfe",
               "profile_path": null,
               "id": 90372,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e11f",
               "name": "Ted Tetzlaff",
               "profile_path": "/1jLw7iUJ5ywMfN8sjyaRwJPpFKq.jpg",
               "id": 4346,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e125",
               "name": "Warren Duff",
               "profile_path": null,
               "id": 10148,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e12b",
               "name": "Martin Rackin",
               "profile_path": null,
               "id": 50270,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e131",
               "name": "Robert Sparks",
               "profile_path": null,
               "id": 10149,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e137",
               "name": "Friedrich Hollaender",
               "profile_path": null,
               "id": 2916,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e13d",
               "name": "Robert De Grasse",
               "profile_path": null,
               "id": 33413,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4798c3a36847f813e143",
               "name": "Frederic Knudtson",
               "profile_path": null,
               "id": 12143,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 0.562122,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49503,
      "vote_count": 5,
      "budget": 0,
      "overview": "A cop-turned-bail bondsman gets involved in a murder investigation.",
      "similar": [
         281,
         412000,
         98357,
         8810,
         9355,
         2832,
         1571,
         2123,
         9271,
         9946,
         10538,
         9573,
         4234,
         2620,
         204082,
         411405,
         26269,
         13515,
         1440,
         26583
      ],
      "original_title": "A Dangerous Profession",
      "runtime": 79,
      "poster_path": "/htry9aEQYnOTO4430sCRPzatDIz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1949-12-10",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Thieves and Killers are my Clients!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ted Tetzlaff"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Martin Rackin",
         "Warren Duff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041278/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM3Mjk2Mzc0NV5BMl5BanBnXkFtZTgwMDM3OTMxNTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: George Raft, Ella Raines, Pat O'Brien | See full cast and crew »"],
      "reviews": [
         "A Dangerous Profession is a mildly diverting crime picture featuring a fine cast headed by veterans George Raft and Pat O'Brien, both of whom had seen better days by the time they appeared in this picture. Nor is the direction of the usually reliable Ted Tetzlaff up to his usual standard. This is the kind of small scale but not quite grade B movie that television was about to make obsolete, and as such an interesting historical footnote of a bygone era for those who care for such things.",
         "Although George Raft and Pat O'Brien share star billing in A Dangerous Profession, the film's action is mainly carried by Raft with O'Brien strictly in support. The two of them play bail bondsman, partners in a bail bond firm. But Raft has a professional and romantic past that get in the way here. Ella Raines with whom Raft had a fling while she was separated from husband Bill Williams comes to Raft for help with bail. Williams comes from a rich background, but his daddy squandered the family fortune and he's not up to a lifestyle change. Williams gets himself in with some crooks doing a little white collar crime and finds himself hung with a murder rap of the investigating detective. The plot starts out like a poor man's Casablanca with Raft like Bogart coming to the aid of his former love's husband whom he didn't know anything about. O'Brien who's not thinking with his hormones doesn't want the firm involved, but Raft insists. Later on Williams turns up dead himself and then Raft's old profession of police detective kicks in despite O'Brien warning him of an inherent conflict of interest. I wish we had seen a little more of Pat O'Brien, but A Dangerous Profession is a competently made noir film. Ella Raines does well as a combination of Lauren Bacall and Lizabeth Scott in her role as the woman that everyone can't resist. Jim Backus plays Raft's former partner as a cop and he's showing some versatility here that will surprise those who only know him as the inept Mr. Magoo and the rich Thurston Howell IV. One of the competently made noir films that Raft was doing in the later part of the Forties. His films would go considerably downhill shortly.",
         "A career police detective turned bail bondsman (George Raft) meets his ex-flame (Ella Raines) (he knows it's her because of the scent of the perfume that's in her and her husband's hotel room which he and detective Jim Backus search) in a fairly intricate story about her husband (Bill Williams) whose arrested for suspicion of killing a cop and then bailed out by Raft, against the wishes of his partner (Pat O'Brien). Why he's bailed out and who actually comes up with sufficient money to get him out of jail make for interesting viewing. As well, Ella Raines hits some of her more sultry looking scenes in this movie, which may not be the best movie she's ever been in, but still percolates along more than acceptably, especially when the real killer emerges as the sharp little film heads out of LA and into a convenient canyon.",
         "A Dangerous Profession is directed by Ted Tetzlaff and written by Warren Duff and Martin Rackin. It stars George Raft, Ella Raines, Pat O'Brien, Bill Williams and Jim Backus. Music is by Frederick Hollander and cinematography by Robert De Grasse. The scene is set, it's Los Angeles and Police Lt. Nick Ferrone (Backus) explains to us with stentorian narration about the whiles of bail bond brokers. This story is concerned with one in particular, Vince Kane (Raft), a one time policeman who followed the lure of the coin into a partnership of a bail bonds operation. It's all going swimmingly well, he's making lots of cash, has gals eating out of his hand, but when a pretty face from his past turns up requesting a favour? Vince suddenly finds himself in a quagmire of murder, deceit and emotional discord. What cop ever reformed? Shall we cut to the chase here? This is not a \"great\" film, though I do believe that it's very under seen and therefore the meagre internet ratings it has - and the lack of reviews for it - don't quite tell the whole story. There's nothing particularly striking about the visual aspects here, De Grasse's photography occasionally falls in line with what film noir fans consider standard procedure, which has led a few critics to question the film's film noir status. This is all about Vince Kane and how he is thrust into a murky new world by a slinky femme, it may be a whodunit in essence, but the Vince and Lucy Brackett (Raines) axis is most assuredly noir. You phony Gumshoe! Action is in short supply, leaving much of the piece in talky territory. There's a few zinger lines of dialogue in the mix, but mostly it's screen writing 101. Yet in spite of the mixed qualities on offer here, it's a film that Raft fans are sure to enjoy, because he's very much great value as the stoic but emotionally troubled Vince. In fact O'Brien turns in one of his better performances and Raines is pleasingly sultry, meaning the cast perform well up to scratch, even if the screenplay does them few favours. A mixed bag for sure, and hardly essential for fans of such cinematic fare, but there's just enough from the cast to make this one above average. 6/10",
         "George Raft, Ella Raines, Pat O'Brien, Jim Backus, and Bill Williams star in \"A Dangerous Profession,\" a 1949 film directed by Ted Tetzlaff. Vince Kane (Raft) is an ex-cop who now works as a bail bondsman with his friend Joe Farley (O'Brien). A detective, Nick Ferrone (Backus) arrests Claude Brackette (Williams) a suspect in a robbery during which a police officer was killed. Kane finds out that Brackette's wife is none other than his old girlfriend, Lucy (Raines). Lucy wants her husband out on bail. She believes he's innocent. The bail is set at $25,000, and she only has $4,000. Still angry over their breakup, and the fact that he didn't know she was married when they were together, Kane shows her the door. Then a mystery man gives Kane $12,000 toward the bail. Vince puts the company's money over the objection of his partner. Vince thinks that an associate of Brackette's, a nightclub owner, was the brains behind the robbery. Kane poses as a crook, something that his demeanor lends itself to, and blackmails McKay to see if he can find out if he's guilty. Fairly routine, with Raft his usual dapper and smooth self. This plot gets a little convoluted, probably due to edits. Not the best, but if you like Raft and the lovely Ella Raines, you'll enjoy it. Bill Williams played Kit Carson on TV and married to Barbara Hale, TV's Della Street on Perry Mason, for 46 years, until his death. He's the father of actor William Katt, and there's quite a resemblance.",
         "The cast is excellent, George Raft is very focused and on the mark, giving a good star performance. The basic idea of the film is good, involving the bail-bond business and all of its inherent potential for mischief, with cops, ex-cops, criminals, etc. But you just wonder if maybe Ted Tetzlaff the director might have been in over his head, or maybe lost interest in this production. The direction is generally poor, with the movement of actors being staged with seeming indifference at times. Ella Raines is not showcased by the producers or director in a star manner and her acting is just not very good in this one. She seems a bit sluggish at times. Ms. Raines having done a brilliant job on a number of classic movies, you really wonder what is going on with her here. I know she lived a long life and graciously accepted some interviews; it would be interesting to know if she ever mentioned the causes of her flat efforts in this. Its too bad because Raft shows up in all the scenes, sharp and ready to go. He just isn't given much to work with. Unfortunately \"A Dangerous Profession\" is pretty much a time waster but is competent in every respect except for the lackluster direction, and the puzzling results by Ella Raines.",
         "Bail bondsman George Raft gets in over his head when he bails out robbery suspect Bill Williams, the husband of an old girlfriend (Ella Raines). This puts him up against various factors on both sides of the law including a fellow former partner (Jim Backus, ultra-serious here) and officer Pat O'Brien. As he gets further involved in his ex-girlfriend's life and finds out information on Williams, the pieces of the puzzle get more puzzling, resulting in a murder. This is certainly watchable, if a sometimes dull film noir/mystery, the audience getting equally as confused as Raft as he tries to wrap everything up. The intro lesson on how the bondsman works is interesting, but perhaps a different case with more developed characters and less people involved in the first place. Still, lighting and shadows provide the right atmosphere, and Raft's detective work is appropriately seedy. One of the people whom Raft interviews slightly looks and very much sounds like Werner Klemperer of \"Hogan's Heroes\" even though he is not listed in the credits for this film.",
         "I wouldn't exactly call this a noir, although it is a hardboiled detective yarn. It reminded me of The Big Sleep mainly because of its rambling story line. Raft is no Bogart and Ella Raines is no Bacall. His stiff delivery gets tiring after you realize he really doesn't have anything interesting to say. Her sultriness falls far short of what's required for the role of bad girl. And her hair is incredibly awful. The photography was above par. When the character of Lucy is introduced in the story, you just see the back of her hat. Then there's a close-up, and well, it's just Ella Raines. The script is a lot of yak, some of it's kinda good, but it's still mainly a yakfest. I gave-up after 55 minutes.",
         "George Raft, Pat O'Brien, Ella Raines, Jim Backus...how can you go wrong? Warren Duff and Martin Rackin's screenplay is a total dud, being both boring and convoluted. Let's face it, bail bondsmen don't lead the most exciting lives, and this is an awfully long 79 minutes."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "Ex-policeman Vince Kane is a partner with Joe Farley as bail bond brokers, but retains his ties and friendship with the police and Detective Nick Ferrone. Ferrone picks up Claude Brackette, a brokerage clerk, as a suspect in the securities robbery in which a policeman was killed, and Kane goes with him when the detective searches Brackett's apartment, and Kane finds that Brackett's wife, Lucy, is his former sweetheart. She insists her husband is innocent and pleads with Kane to get him out on bail but she has only $4,000 of the $25,000 needed. A mysterious emissary puts up $12,000 and Kanes, over Farley's protest, makes up the rest from the company's money. Brackett is murdered after his release. For Lucy, Kane investigates and finds that Brackett had dealings with night club owner Jerry McKay and a hoodlum named Roy Collins. Suspecting McKay was in back of the robbery, Kane begins a campaign in which he himself behaves like a crook, and demands a heavy bride from McKay for his silence. Farley denounces this tactic, and is met by Kane for a payment also, or he will be branded in league with the crooks.",
         "LA ex-cop Vince Kane is a bail-bondsman who bails out the suspect of a securities bonds robbery but his client disappears, prompting Vince to investigate."
      ],
      "budget": 0
   },
   "movielensId": 113945,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-12-10",
      "dvdReleaseDate": "2013-04-23",
      "directors": ["Ted Tetzlaff"],
      "runtime": 79,
      "movieId": 113945,
      "title": "A Dangerous Profession",
      "mpaa": "",
      "actors": [
         "George Raft",
         "Ella Raines",
         "Pat O’Brien",
         "Bill Williams",
         "Jim Backus",
         "Roland Winters",
         "Betty Underwood",
         "Robert Gist",
         "David Wolfe"
      ],
      "imdbMovieId": "0041278",
      "originalTitle": "A Dangerous Profession",
      "genres": ["Crime"],
      "youtubeTrailerIds": [],
      "plotSummary": "A cop-turned-bail bondsman gets involved in a murder investigation.",
      "tmdbMovieId": 49503,
      "avgRating": 2.75,
      "releaseYear": "1949",
      "numRatings": 2,
      "posterPath": "/htry9aEQYnOTO4430sCRPzatDIz.jpg"
   }
}