{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "flirt",
            "id": 1486
         },
         {
            "name": "banker",
            "id": 3515
         },
         {
            "name": "transformation",
            "id": 4375
         },
         {
            "name": "great depression",
            "id": 5571
         },
         {
            "name": "womanizer",
            "id": 9094
         },
         {
            "name": "baron",
            "id": 9552
         },
         {
            "name": "secretary",
            "id": 11677
         },
         {
            "name": "pre-code",
            "id": 156764
         },
         {
            "name": "stenographer",
            "id": 191786
         },
         {
            "name": "night out",
            "id": 208973
         },
         {
            "name": "dictation",
            "id": 212884
         },
         {
            "name": "efficiency",
            "id": 240437
         }
      ],
      "imdb_id": "tt0021647",
      "video": false,
      "title": "Beauty and the Boss",
      "recommendations": [],
      "backdrop_path": "/icWX1ndiRah8Z0ZbEBnS9Dle2zL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Baron Josef von Ullrich",
               "gender": 2,
               "credit_id": "52fe4bd0c3a36847f8214ed5",
               "name": "Warren William",
               "profile_path": "/7SYBx7c5q9ftNtOSjEGBaIrjNJS.jpg",
               "id": 76974,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Susie Sachs",
               "gender": 1,
               "credit_id": "52fe4bd0c3a36847f8214ecd",
               "name": "Marian Marsh",
               "profile_path": "/rf77UMR8BxPPbf1XpepgVxeig4e.jpg",
               "id": 96740,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Ludwig Pfeffer Jr.",
               "gender": 2,
               "credit_id": "5419c6a00e0a266ef600048d",
               "name": "Charles Butterworth",
               "profile_path": "/gSkAFgaUCw0F7MKURMBmELslt5a.jpg",
               "id": 90380,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Olive 'Ollie' Frey",
               "gender": 1,
               "credit_id": "5419c6bcc3a3683f1d000441",
               "name": "Mary Doran",
               "profile_path": "/7DCEhoNQDsbVpHShPWBqXyPygPA.jpg",
               "id": 1016036,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Baron Paul von Ullrich",
               "gender": 2,
               "credit_id": "52fe4bd0c3a36847f8214ed1",
               "name": "David Manners",
               "profile_path": "/Q3BWV6cvANJcBq83WTaC48OuTL.jpg",
               "id": 2125,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Count Von Tolheim",
               "gender": 2,
               "credit_id": "5419c6ae0e0a266ee3000453",
               "name": "Frederick Kerr",
               "profile_path": null,
               "id": 29816,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Chappel",
               "gender": 2,
               "credit_id": "5419c6cac3a3683f17000404",
               "name": "Robert Greig",
               "profile_path": "/ze6PfVLC0AaaoKkwtrJtOLuZkWa.jpg",
               "id": 30262,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Girl in Bath Tub (uncredited)",
               "gender": 1,
               "credit_id": "5842a359c3a36876c00067bc",
               "name": "Yola d'Avril",
               "profile_path": "/oWIMKyeQSDNkSF1z9pimqepaPfV.jpg",
               "id": 1133401,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Hotel Manager (uncredited)",
               "gender": 2,
               "credit_id": "5a56cb4d9251417ab502ec66",
               "name": "Harry Holman",
               "profile_path": "/4J1Z6ndpZTDnSwKMIf6qAr5LfJz.jpg",
               "id": 124554,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Business Associate (uncredited)",
               "gender": 2,
               "credit_id": "5842a37ac3a36876b80074e6",
               "name": "Olaf Hytten",
               "profile_path": "/uCuFf8QMmSerIkvFlveQzFg7lr7.jpg",
               "id": 32192,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Ludwig's Girl (uncredited)",
               "gender": 1,
               "credit_id": "5842a3f99251417ed3006968",
               "name": "Polly Walters",
               "profile_path": null,
               "id": 128360,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Man in Elevator (uncredited)",
               "gender": 2,
               "credit_id": "5a56cb36c3a3685ebc02c7f3",
               "name": "Leo White",
               "profile_path": "/wzD5hXyaVXQol86cYGGp3SOzlaq.jpg",
               "id": 29274,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bd0c3a36847f8214ec9",
               "name": "Roy Del Ruth",
               "profile_path": "/vm5P5O0qcLYqhdPXw17U4CkBEsV.jpg",
               "id": 94218,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5419c65bc3a3683f11000469",
               "name": "Ladislas Fodor",
               "profile_path": null,
               "id": 45621,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "5419c687c3a3683f09000487",
               "name": "Joseph Jackson",
               "profile_path": null,
               "id": 128357,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "5a56cbb20e0a2607e4031c66",
               "name": "Earl Luick",
               "profile_path": null,
               "id": 14650,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5a56cbcd0e0a2607ec030aae",
               "name": "Barney McGill",
               "profile_path": null,
               "id": 96052,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.442753,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 118245,
      "vote_count": 1,
      "budget": 0,
      "overview": "An ultra-efficient Plain Jane secretary blossoms when she accompanies her boss on a business trip to Paris.",
      "similar": [
         34106,
         33680,
         11540,
         10765,
         12531,
         11030,
         43600,
         31511,
         27449,
         41843,
         2065,
         50073,
         109886,
         200594,
         4370,
         1773,
         160466,
         60430,
         163773,
         69729
      ],
      "original_title": "Beauty and the Boss",
      "runtime": 65,
      "poster_path": "/qhT5h1Mz0XnH4UCHWxTtUgu9zCG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71U7rE3nvZs3Fn7ztk8I9TATahT.png",
            "name": "The Vitaphone Corporation",
            "id": 9329,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1932-04-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Roy Del Ruth"],
      "runtime": 66,
      "synopsis": null,
      "writers": [
         "Ladislas Fodor",
         "Joseph Jackson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021647/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4ODA4NjA1N15BMl5BanBnXkFtZTcwMTQ1Mjk3Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Marian Marsh, David Manners, Warren William | See full cast and crew »"],
      "reviews": [
         "About a bank president who talks about putting a new rule into the company: \"all females must wear long sleeves and high necks\". Seems he is easily distracted by women, particularly his attractive and flirtatious secretary who he thinks is a \"playgirl\" rather than working girl, good for after hours only. He actually fires her - and she doesn't mind, 'cause she apparently agrees with this after hours concept, and becomes one of his new girlfriends (there seem to be many others too, judging by the office visits and phone calls from bathtubs he keeps getting). Soon a young waif arrives - hungry and oddly dressed in an outfit that includes black umbrella and flat black hat with a big white feather in it (why do these poor waif girls in old movies always seem to wear an odd feathered hat?). Well, seems she's an out-of-work stenographer looking to get hired - and turns out she's a whiz who loves work too, spending her free time toning her secretarial skills rather than dating men, she takes shorthand at 150 words a minute! He hires her on the spot since she's \"plain\" - seems even though she is clearly very pretty, he for some reason (like often seen in movies) can't see her beauty through the odd outfit. Well, she falls for him and soon blooms! This is a thoroughly entertaining, fast paced, fun-to-watch film with lots of amusing pre-code banter and top-notch performances adding to the mix - I loved it. Warren William, one of my favorite actors from this time period, is just perfect as the rather handsome but stiff \"girl crazy\" boss, and Marian Marsh as the waif (who I thought looked like Reese Witherspoon in the earlier scenes) is just SO cute and charming - I really enjoyed her performance. Cute scene where she gets \"taught\" by the previous secretary how to seduce a man via accidentally-on-purpose leaning against him, and she tries it out on the boss. Really excellent film.",
         "Warren William and Marian Marsh sparkle in this delicious Vitaphone production. Ms. Marsh handles the role of a dowdy but wise secretary with great aplomb, she's delightful! William (the star with two first names) is charming as the playboy baron with an amorous secretary on every phone line. Charles Butterworth adds to the fun with his usual hijinks. This one's a keeper!",
         "One of the very first boss falls for secretary films, but fresh, original, and wonderfully acted and scripted. Warren William is young but just as dapper and sophisticated as in later roles. I have never seen the female lead -- secretary -- before, but she is very pretty and a good comedic actress. One of the best parts is the way she keeps turning the tables on WW as the boss, first with super efficiency and later by doing what he commands, literally. It is set in Europe at the height of the worldwide depression, and it shows how well some of the rich -- those who were lucky enough not to be heavily invested in the preceding stock market mania -- were living, while others struggled. Seeing how people lived then, some 70 years ago, is always interesting.",
         "Although it betrays its theater-script origins in the rhythm of the performances and dialogue, this sparkling little formula comedy about a secretary who wins a rich Baron is chockablock with snappy retorts and racy rejoinders. Marian Marsh is adorable, charming and always convincing. The surprising candor of the script is refreshing: despite the free modern use of more explicit language, this depression-era tale leaves nothing to the imagination. Its honesty is surprising and heightens the humor of the gentle jokes. Watching scenes played out between Marsh and Warren William with such genuine engagement would be impossible in the modern era of frenetic jump-cutting. What a treat to see talented performers do such naughty and giggly scenes in a single take with hardly a cutaway or interruption in sight!",
         "THIS REVIEW CONTAINS GENERAL SPOILERS A wonderful pre-Code comedy, this is the kind of movie you can't help but watch with a delighted smile the whole way through. The under-known Warren William as usual plays the head of a large corporation, this time in Vienna. Also as usual, he is demanding, domineering, aggressive, and chauvanistic. He's an operator, and his success in charming women would make James Bond envious! The problem is, his secretary is so attractive he is unable to concentrate on his work. So he fires her and hires a plain-Jane to be his secretary instead (Marian Marsh). But the ploy backfires when Marsh blossoms into a beautiful, desirable woman. Her transformation and William's softening make up the bulk of the picture, and it is just a delight to behold. At one point the action shifts to Paris, and even though we stay in studio sets, the idea of Paris -- its feel, its magic, its charm -- has a palpable emotional effect on Marian Marsh, and on us. It's amazing how much you can feel Paris in this movie even though we never really see it! It comes through in the performances -- the way they talk about being there, the expressions of their faces in their reaction shots. BEAUTY AND THE BOSS (one of the great movie titles!) is based on a play yet feels cinematic and flowing. The story is very much an old-world story yet it hasn't really dated because the actors are so genuine. All in all, it's an excellent romantic comedy that will make you laugh out loud.",
         "No big stars in this one but still a very entertaining little film. Marsh and Doran are two women who go after Warren William in very different ways. Butterworth is good in his usual comic relief role. A charming and fast-moving movie.",
         "Beauty and the Boss was a delightful movie with some very subtle humor and frank interfacing between the competing beauties. The rapid dialog between the Count and his prospective secretary was a pleasure in wittiness and abstract humor. This movie promised a bright career. Marian Marsh was a beautiful young lady, but what struck me was a resemblance to a later actress, Jane Powell when she was of that age. It was a shame the studios did not hold on to her for better roles but I guess it was the depression and they were interested in churning out low budget movies and constantly showing new faces. Ms. Marsh did show considerable talent, artistically before the cameras, at quite a young age. Considering her young age it seems the studios could have been more understanding when they did not pick up her contract while they were having disagreements over a bad performing movie.",
         "Marian Marsh had a gorgeous doll like prettiness and in at least one of her films (the terrific \"Five Star Final\") proved she could act if given the chance. \"Beauty and the Boss\" seemed to be the last movie she made under contract to Warners, which shows they didn't take much time to groom and nurture her talent. Although it could have been titles such as \"Under 18\", \"Beauty and the Boss\" and \"Daring Daughters\" that kept discerning picture goers away. Baron Josef Von Ulrich (Warren William) is a banker who has the perfect solution for separating business from pleasure. Whenever a secretary starts to show too much allure, he simply fires her, gives her 6 months wages then begins an affair with her. His latest conquest, Miss Frey (Mary Doran) is proving very demanding so when Ulrich hires Susie Sachs (Marian Marsh) he is delighted. She has all the attributes he is looking for - plain of face, she describes herself as \"hungry and poor as a church mouse\" - plus her only interest is in efficiency and hard work. Marian Marsh is just adorable as Susie the \"human dynamo\" who within 5 minutes organises the Baron as he has never been organised before. She also manages to keep his mistresses at bay and his mind on the job. A trip to Paris and all the hard work is undone. Susie starts to feel there is more to life than just hard work and has an encounter with Miss Frey who tries to put her wise to all the tricks needed to hook a man (which Susie tries to use in a really sweet scene with the Baron). Susie's transformation is like Cinderella, when she steps out with Paul (David Manners) and Count Von Tolheim (the always good Frederic Kerr). Marian is absolutely radiant in a shimmering gown and with her blonde hair carefully marcelled. David Manners has another of his \"nothing\" roles. I have read he was never too keen on film acting and you can tell as he basically walks through his role. He has one scene where he confesses his love for Susie but you just know she wants a man of flesh and blood - a man like the Baron!!! Directed by Roy Del Ruth who was Warner's work horse director. His credits were outstanding - especially to a lover of pre-coders. \"Blonde Crazy\", \"The Maltese Falcon\", \"Blessed Event\", \"Employee's Entrance\", \"The Little Giant\" - only a fraction of the films he directed before the production code meanies stamped out the fun. Always at his best working within the framework of a big studio, once he left Warners, he then went to MGM where he was responsible for musicals like \"Born to Dance\" etc. Highly Recommended.",
         "...but you just can't help yourself. William is perfect here as an efficient German bank president and baron, totally consumed with business by day and with romancing the ladies -lots of them - at night. He only has problems when his two interests converge. This usually occurs because he has a beautiful secretary. His usual solution - to fire the secretary and get her out of his business life, and then make her one of his many mistresses. The baron tires of this repetitive problem, and vows that his next secretary will be a plain practical woman for whom he will have no attraction. So into his life walks Susie Sachs (Marian Marsh), \"the church mouse\". The cutest scene of the film is where Susie tricks her way into see the baron and tells him about the plight of her class -\"the mice\" - the unemployed and hungry. The baron is quite interested in her story. You see, he is not such a bad guy. It just never occurred to him that there might be a girl of her age in Germany more interested in a good meal than a diamond bracelet. He's never seen that side of life and therefore not given it much thought. He hires her, and she works out quite well for him until a business trip to Paris brings the Baron quite a few surprises. This film was really a delight with very good dialogue and animated performances. Charles Butterworth is really quite good as comic support in these early Warner Brothers talkies. He plays the baron's assistant who is constantly writing down instructions on his cuffs and seems to have no objections when he is told he will be working all night and won't be allowed time to eat. David Manners plays the baron's younger brother who sees the beauty in Susie even when she is playing the frump.",
         "While \"Beauty and the Boss\" isn't a total loss - no movie with Warren William and Charles Butterworth could be - it's darn close, and the fault, dear Brutus, lies with its leading lady, Marion Marsh. I'm a connoisseur of bad performances, and always held Wheeler Oakman's wooden acting in \"Lights of New York\" as the gold standard, but Marsh has taken the title in a first-round knockout. Either director Roy Del Ruth was too busy to direct Marsh or was deliberately trying to end her contract, but the decision to let her speak all her lines as rapidly and with as little inflection as possible was fatal. Every time she's on screen, she kills the picture with her lack of ability to act. Mary Doran, who plays the \"other woman\" is so far superior to her in terms of personality and intelligence that it's baffling how William's character throws her over for such a dimwit. I blame Del Ruth, ultimately. Any director who let Marsh get away with that performance -and- cuts away from Butterworth doing the tango is clearly having a bad time of it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["The Baron is a banker, in Vienna, who works at at very fast pace. He appreciates beautiful women, but fires the beautiful Miss Frey as he considers her a diversion to work. Susie sneaks into his office to apply for the job as the Baron's secretary. Since she is plain looking, as poor as a 'Church Mouse' and very fast at dictation, she gets the job. She keeps all the women away from the Baron so that he can concentrate on his work. In Paris, Miss Frey tells Susie the secret to being 'A Woman', and the little Church Mouse becomes a Lion."],
      "budget": 0
   },
   "movielensId": 113955,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-04-09",
      "dvdReleaseDate": "2010-04-21",
      "directors": ["Roy Del Ruth"],
      "runtime": 65,
      "movieId": 113955,
      "title": "Beauty and the Boss",
      "mpaa": "",
      "actors": [
         "Warren William",
         "Marian Marsh",
         "Charles Butterworth",
         "Mary Doran",
         "David Manners",
         "Frederick Kerr",
         "Robert Greig",
         "Yola d'Avril",
         "Harry Holman",
         "Olaf Hytten",
         "Polly Walters",
         "Leo White"
      ],
      "imdbMovieId": "0021647",
      "originalTitle": "Beauty and the Boss",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["_1O0iMgXyKE"],
      "plotSummary": "An ultra-efficient Plain Jane secretary blossoms when she accompanies her boss on a business trip to Paris.",
      "tmdbMovieId": 118245,
      "avgRating": 2.5,
      "releaseYear": "1932",
      "numRatings": 1,
      "posterPath": "/qhT5h1Mz0XnH4UCHWxTtUgu9zCG.jpg"
   }
}