{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0063348",
      "video": false,
      "title": "The Night They Raided Minsky's",
      "recommendations": [],
      "backdrop_path": "/yUmdtoY63sZieUmsIBAixB2ALtT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Raymond Paine",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3a7",
               "name": "Jason Robards",
               "profile_path": "/d5t554TsCjMvI9zwe7M5gNLvZeX.jpg",
               "id": 4765,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Rachel Schpitendavel",
               "gender": 1,
               "credit_id": "52fe460fc3a36847f80ea3c3",
               "name": "Britt Ekland",
               "profile_path": "/67A2sDUxAwCut7kt0Yvj5ydkQJT.jpg",
               "id": 10341,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Chick Williams",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3c7",
               "name": "Norman Wisdom",
               "profile_path": "/m1dq7C65PJhFwD5WQmaCdVDXpuO.jpg",
               "id": 76379,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Trim Houlihan",
               "gender": 0,
               "credit_id": "52fe460fc3a36847f80ea3cb",
               "name": "Forrest Tucker",
               "profile_path": "/yqdE1cqCXWhLTgIRHDgqHJMrJlY.jpg",
               "id": 41214,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Jacob Schpitendavel",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3cf",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Louis Minsky",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3d3",
               "name": "Joseph Wiseman",
               "profile_path": "/dh5BTlenUZIMHT7WwT0nGxvrPhx.jpg",
               "id": 9872,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Vance Fowler",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3d7",
               "name": "Denholm Elliott",
               "profile_path": "/oR6GnGecov6Mjg0cLasCawyz3mF.jpg",
               "id": 656,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Billy Minsky",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3db",
               "name": "Elliott Gould",
               "profile_path": "/bo5jSwWyFRsKVAkELT9n7AKQqMk.jpg",
               "id": 827,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Candy Butcher",
               "gender": 0,
               "credit_id": "52fe460fc3a36847f80ea3df",
               "name": "Jack Burns",
               "profile_path": "/cgOH9oGEXoid66lZI35Nqfqw6yK.jpg",
               "id": 68458,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Professor Spats",
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3e3",
               "name": "Bert Lahr",
               "profile_path": "/xGKDj0icXH1y0KFAJOKoue3oxj5.jpg",
               "id": 9069,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Scratch",
               "gender": 2,
               "credit_id": "54b45cd9c3a368210c003e1a",
               "name": "Eddie Lawrence",
               "profile_path": null,
               "id": 1053827,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3ad",
               "name": "William Friedkin",
               "profile_path": "/1iBd92izRHpkSH4hOhcUBmF2cv7.jpg",
               "id": 15175,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3b3",
               "name": "Arnold Schulman",
               "profile_path": null,
               "id": 19249,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe460fc3a36847f80ea3b9",
               "name": "Sidney Michaels",
               "profile_path": null,
               "id": 51314,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe460fc3a36847f80ea3bf",
               "name": "Norman Lear",
               "profile_path": "/nbVFnCZ223LDSxrgyDsGvIeIoDs.jpg",
               "id": 170497,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55a57ea7c3a36856b200013c",
               "name": "Rowland Barber",
               "profile_path": null,
               "id": 1487326,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "55a57ebbc3a36856ad00015e",
               "name": "George Justin",
               "profile_path": null,
               "id": 5259,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "55a57ec992514140be000128",
               "name": "Norman Lear",
               "profile_path": "/nbVFnCZ223LDSxrgyDsGvIeIoDs.jpg",
               "id": 170497,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55a57ed7c3a36856ba000129",
               "name": "Charles Strouse",
               "profile_path": null,
               "id": 6459,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55a57ee792514140b70000fc",
               "name": "Andrew Laszlo",
               "profile_path": null,
               "id": 2082,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55a57ef992514140b70000fe",
               "name": "Ralph Rosenblum",
               "profile_path": null,
               "id": 6848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55a57f06c3a36856b800011b",
               "name": "Pablo Ferro",
               "profile_path": null,
               "id": 1378368,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "55a57f1692514140be000139",
               "name": "Marion Dougherty",
               "profile_path": "/vHUj1WzotNrj9PTT6wJ1yhhULbD.jpg",
               "id": 3806,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5a20602a0e0a264cbe092597",
               "name": "Marguerite James",
               "profile_path": null,
               "id": 1705506,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.552142,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42648,
      "vote_count": 7,
      "budget": 0,
      "overview": "Rachel arrives in New York from her Amish community intent on becoming a dancer. Unfortunately Billy Minsky's Burlesque is hardly the place for her Dances From The Bible. But the show's comedian Raymond sees a way of wrong-footing the local do-gooders by announcing the new Paris sensation \"Mme Fifi\" and putting on Rachel's performance as the place is raided. All too complicated, the more so since her father is scouring the town for her and both Raymond and his straight-man Chick are falling for Rachel.",
      "similar": [],
      "original_title": "The Night They Raided Minsky's",
      "runtime": 99,
      "poster_path": "/bjL3HL4enDJSNdD65bmCXWaC8IU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tandem Productions",
         "id": 14982,
         "origin_country": ""
      }],
      "release_date": "1968-12-22",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["William Friedkin"],
      "runtime": 99,
      "synopsis": "Included throughout the film are various dances and routines actually used in the days of burlesque and they play as an important part in the movie as the actual plot itself. The story opens in 1925 with a young Amish girl, Rachel Schpitendavel ( Britt Ekland) arriving in New York City. Rachel has dreamed of being a dancer from the time she was a little girl much to the displeasure of her strict, religious father, Jacob Schpitendavel ( Harry Andrews). Rachel has run off to New York from her home in Pennsylvania to join the Minsky Burlesque show at the National Winter Garden Theater. Upon arriving at the theater she meets Professor Spats ( Bert Lahr) a retired performer. He takes her into the theater to see the show. Rachel is excited about the dancing she sees, but seems clueless about most of the sexual innuendo in the performance. Spats promises her that after the show he will introduce her to the cast and Mr. Minsky. Bill Minsky ( Elliott Gould), however, is having his own problems. Secretary for the Society for Decency, Vance Fowler ( Denholm Elliott) is writing letters complaining about the show's skimpy costumes, suggestive dancing and bawdy humor. So far, Fowler has not convinced the police department to shutdown the show, but the letters have been disturbing to Louis Minsky ( Joseph Wiseman), Bill's father. Louis owns the theater and leases it to Bill. He tells him he will not renew the lease when it expires next week. To continue the show Bill will have to buy the theater for $190,000. Bill tries to convince small time gangster and speakeasy owner Trim Houlihan ( Forrest Tucker) to become partners with him and give him the money. Though Trim is a big fan of burlesque, he declines to invest. Word of the situation soon reaches the cast including the comedy team of funnyman Chick Williams ( Norman Wisdom) and straight man Raymond Paine ( Jason Robards). Chick is a decent, dependable, short guy who can't get a girl to take a second look at him, while Raymond is a handsome, untrustworthy womanizer that every girl adores. When Spats introduces Rachel to them, Chick is immediately taken with her while Raymond is unimpressed with her dancing specialty: interpreting stories from the Bible. After returning to his dressing room, however, Raymond gets an idea to save the show. He proposes putting Rachel into the midnight performance billed as \"Madam Fifi\" from Paris and start a rumor that she is will be doing a daring new erotic dance. This should be enough for Fowler to convince the police to raid the place. However, when the police and press appear and find only Rachel dancing her innocent Bible stories, Fowler will be discredited and cease to be a problem. Bill Minsky approves of the plan, though Chick is concerned that Rachel will be humiliated. The cast takes Rachel, their newest member, to lunch where she meets Trim Houlihan. It is clear he is interested in her, so to distract him Chick and Raymond instigate an argument between Trim and the restaurant owner. While they fight, Chick, Raymond and Rachel slip out and go to a shop where they arrange for Rachel's costume. By this time Raymond is starting to get interested in Rachel himself, and slips out of the shop with her while Chick is bargaining with the owner over a fake snake for Rachel's Garden of Eden dance. Raymond takes Rachel back to his hotel room, but they are interrupted before much happens by Chick at the door pretending to deliver steamship tickets. When Raymond opens the door Chick sprays him with the hotel's fire hose. At the next performance Raymond gets his revenge by roughing Chick up. When Raymond gets back to his dressing room Trim is waiting for him and makes it clear he is to leave Rachel alone as Trim wants her for himself. Raymond reluctantly agrees and Trim leaves. When Chick gets back to the room Raymond makes up with him promising he will lay off Rachel, which is not much of a sacrifice given the threat from Trim. Between performances, however, Raymond breaks his promises to both and gets Rachel back to his room. This time, however, they are interrupted by Rachel's father who has come to take her home. When Rachel refuses he tells her he will be on the 1AM train back to Pennsylvania and if she is not with him he will disown her. He then leaves. Rachel is upset at first, but then brightens telling Raymond she will have a new life with him and be happy working as a dancer at Minsky's. Raymond is taken aback knowing that the dancing is all a sham and she will be losing her family for nothing. Raymond convinces Rachel to take a nap before her performance and leaves her at his room and heads for the theater. There he instructs Spats to get Rachel onto the 1AM train. Inside the theater Billy Minsky is concerned as the theater is packed and interest in Fifi's performance is at a fever pitch. He knows that he will need more than Rachel's Bible dancing to satisfy the crowd and talks dancer Mae Harris ( Gloria LeRoy) into putting on Rachel's French costume, though Mae is a bit perplexed about how she is to dance. Meanwhile Fowler and the police arrive to watch the show and see if the law is broken. In the middle of Chick and Raymond's performance Spats signals from off-stage and Raymond walks off leaving Chick to finish the act alone. Spats tell Raymond that Trim picked up Rachel and took her to his speakeasy with the idea of delivering her to the theater in time for her performance. Raymond immediately heads to the speakeasy to rescue Rachel. Chick follows and the two fight until Chick realizes that Raymond is genuinely concerned for Rachel. By this time Trim has appeared and they try to force him to let Rachel go, but even together they are no match for the brawny gangster and return to the theater bruised and without her. Trim does deliver Rachel to the theater in time and she is surprised to see Mae wearing her costume. At this point Billy Minisky confesses to her and Trim that the whole thing was a sham to embarrass Fowler. Rachel's father also arrives and when he sees her in a low-cut, sparkling evening gown Trim has given her, he calls her a whore. Something snaps in Rachel at this and when Fifi's cue is called she heads out on stage against the wishes of both Minsky and her father. Once she gets on stage she is at a loss about what to do, but tries some of the bumping and grinding moves shes seen the other girls dance. With the help of a sympathetic drummer giving her rolls and shots to her movements, she begins to improvise a routine. When she gets close to the wings, however, her father makes a grab for her and tears her dress along the leg. The crowd goes wild at this and Rachel tears the seam on the other side herself. With the crowd cheering her on she invents the art of striptease. Rachel unzips her dress and slides the straps off her shoulders so that it is only being held up by her hands. At this point she notices Raymond in the wings. Raymond, disgusted with himself for having turned the innocent Rachel into a stripper, has packed his suitcase and is leaving her and the show. Rachel calls his name and reaches out to him accidently letting the dress fall to the floor. She is clad only in her panties. At this Fowler signals the raid and Billy Minsky and Rachel are arrested. When Chick stands up for them, demanding to know why he hasn't been arrested, Fowler replies that Chick has not broken the law. Chick responds by squirting Fowler with seltzer and a general melee breaks out. It ends with the whole cast (with the exception of Raymond who has left) being arrested along with Rachel's father and Trim. As they emerge from the Theater to the press and the flash of cameras, we get the feeling they are considered more folk heros than criminals. Back in the theater the stage is littered with the remains of the show. Spats walks across the stage, picks up the seltzer bottle and puts it on a ladder, then leaves, turning out the lights. The credits roll.",
      "writers": [
         "Arnold Schulman",
         "Sidney Michaels"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063348/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjAyNDA1MDc3MF5BMl5BanBnXkFtZTcwMTgxOTM2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Robards, Britt Ekland, Norman Wisdom | See full cast and crew »"],
      "reviews": [
         "And I mean that most sincerely, this is one of the great films of the 1960s, charting the last days of the burlesque music-hall theatricals in America. The plot of the film is something of a mish-mash, mixing up Britt Ekland as an Amish runaway who finds herself onstage, with Denholm Elliot as a moralistic do-gooder trying to close down Minsky's theatre, but in truth, as with a large number of films of the period (see also The Pink Panther films), the plot is merely a convenience, a washing line upon which to hang a large number of characters, theatrical set-pieces and little illustrations of life in and around the theatrical world. A host of fine actors grace the screen, with Elliot Gould making an early appearance as Minsky jr, Harry Andrews as Ekland's glowering father, Joseph Wiseman as Minsky sr and most affectingly, Bert Lahr in his final screen performance. Even Ekland is OK, and it takes a lot to say that. But at the centre of it all are Jason Robards and Norman Wisdom as the theatre's chief comedy double-act. An odd pairing that works amazingly well, with Robards an effectively sleezy straight man (his seduction of Ekland is both funny and stomach churning). But if Robards is good, Wisdsom is fantastic, his comedic skills honed in England finally being given full rein (I enjoy a lot of his British films, but few of them really allow him full use of his abilities), and the song and dance routine and when he defines burlesque to Ekland rank as his finest on-screen moments. it's a bitter shame that the failure of this film and personal circumstances forced him to leave Hollywood, because with the right material he could have gone so much further. Truth is, if you have no sympathy for this sort of material, this will not change your mind. But for an utterly unique film, packed with beautiful little minutiae of theatrical life and a great mix of dark humour and bawdy comedy, this is really something to be cherished.",
         "Everyone may know William Friedkin for \"The French Connection\" and \"The Exorcist\", but this gem from before his heyday will always come to my mind. During the movie's first few minutes, you're not exactly sure where it's going, but then we meet Rachel Schpitendavel (Britt Ekland), an Amish woman who has just arrived in 1920's New York City. Not quite sure where to go in this bustling metropolis, she goes to Billy Minsky's Burlesque House. Of course, she doesn't know that burlesque involves some stuff that is perpetually anathema to the Amish lifestyle. But performer Raymond Paine (Jason Robards Jr) sees some real potential in her. Meanwhile, there are two forces at work against Rachel's potential success: her father has arrived in town to take her back to the farm, and the police are seeking to shut down the burlesque house. Overall, \"The Night They Raided Minsky's\" is one of those nostalgia pieces that always has something coming. Interestingly, it was also a debut and farewell: Elliott Gould made his film debut playing Billy Minsky, and Bert \"Cowardly Lion\" Lahr plays a role too (he actually died while they were filming). Maybe this movie's not a masterpiece, but it's truly got something for everyone. Cool.",
         "Why doesn't everybody just love this movie? It is one of most delightful comedies that I have ever seen. I saw it when it first came out in the cinema and watched it three times that first week and at least four times since. It is a very stylized movie, with an introductory narration right out of the 1920's. The style carries right through the film, with wonderful vaudeville routines. The \"girls\" are not particularly beautiful and are, by current standards a little overweight. Also they seem to be going through the motions with a variety of personalities. They do not have beautiful singing voices and they do not dance in perfect synchronization but nobody, especially them, seems to care. Burlesque is, after all, light entertainment. The comedy skits are very simple and unintelligent but they are performed with great panache. Sir Norman Wisdom (born 1915), the great British stage and screen clown of the Charlie Chaplin ilk, and Jason Robards Jr., the dapper Oscar-winning, American actor of the classic stage are the two central male characters and are both attracted to the beautiful Amish girl who has left home to dance stories from the Bible on stage. Wisdom is a master clown and can move in ways that are magically humorous. Burlesque has two meanings, with two spellings: - a humorous and provocative stage show featuring slapstick humour, comic skits, bawdy songs, striptease acts, and a scantily clad female chorus. (Burlesk) - an artistic composition, especially literary or dramatic, that, for the sake of laughter, vulgarizes lofty material or treats ordinary material with mock dignity. (Burlesque) The movie is a burlesque about burlesk. It also makes fun of religion, stage performances, censorship, prudery, friendship, business, fraud, crime, police, audience intelligence, class distinction, love, seduction, hypocrisy, etc. The mood is intense from start to finish, with several collages of scenes from the past and the movie's present. When I was not laughing out loud, I was laughing inside. The comedy on the stage is very elementary but the comedy in the story is often quite subtle and intelligent. Back to the initial question � I think that the movie may be too stylized for many people to enjoy, especially since the style has long been almost extinct. But if one accepts the style and allows oneself to become immersed in it and flow with it, the movie can be great.",
         "This film succeeds in both areas, comedy and nostalgia. It captures the period it portrays in wonderful fashion, with a very enthusiastic cast. I consider it one of the best cast movies I've ever seen, from the lead actors to the bit roles. Many classic burlesque routines are included, some of them done on the burlesque stage and some worked into the movie's dialogue. If you're in the mood for a comedy with a bit of feeling for another period in abundance, you can't do much better than this!",
         "This movie captures the time period so beautifully and is the only movie I've ever seen that does so with this genre, it must be accepted as exceptional. The cinematography is very good, the acting excellent, the story very good, and the music perfect. The final touches are real burlesque acts in their entirety, great side acts not part of the stage yet depicting burlesque, great tension (the Amish father, Minskys father, and the threat of closing the theater down for moral reasons), and most of all seeing the movie through the eyes of a titillated Amish virgin, create the kind of perfection rarely seen in cinema. I saw this movie 35 years ago and forgot about it. I just viewed it and realize it deserves to be recognized as exceptional. Not a discarded movie rarely seen on cable.",
         "I saw this with my family in Forest Hills in 1968, and I recall how at the time the film was advertised as Bert Lahr's last great performance because he was supposed to have a major role in this valentine to the late, great days of the Burlesque shows that Lahr came out of. It's true he appears in the film, and that he died while it was being made, but his part was cut to ribbons due to his death (obviously not enough of his role had been completed before he died, like John Candy in his last film and Spencer Tracy in his last film). But Lahr does have a final moment that always haunted me. More of that anon. The story (how true it is I can't answer) is how the tradition of the strip tease was created at the Minsky Burlesque House in New York City. The film follows the arrival of Britt Eckland (Rachel Schpitendavel) in Manhattan - she is an Amish girl who is running away from her way of life (and her stiff-necked father, Harry Andrews (Jacob Schpitendavel)). She accidentally meets Lahr (\"Professor Spats\"), who takes her to Minsky's to see if she can get a job there. The theater is run by Elliot Gould (Billy Minsky) who is the son of the owner Louis Minsky (Joseph Wiseman). Gould gives her some work, and she soon is being pursued by the two lead comedians in the show (Jason Robards - Raymond Paine; Norman Wisdon - Chick Williams). Robards makes the biggest impression on her - getting her into bed. In the meantime Gould is being annoyed by Denholm Elliot (Vance Fowler) who is head of a moral crusade organization. He's also under pressures from his father Louis, who disapproves of the sexual content of the burlesque shows. When Andrews shows up, he is full of righteous fury towards the evil city and the evil theater as well. Eckland is now a chorus girl. SPOILER COMING UP When a furious Andrews finds his daughter on stage in a \"skimpy\" costume, he rips off part of it in disgust in front of the bored audience. This causes the audience to take notice. Eckland notices this too, and starts continuing to rip off her costume. It is the invention of the strip tease - and Elliot, of course, sends a signal for a raid by the police. The film ends with most of the cast under arrest, except for Robards, who leaves with deep regrets (more in a moment) and Lahr. Lahr enters the empty theater after the arrests, picks up a prop from the stage floor, and walked off stage. And the movie ended. You'd have to see the film fully to understand that Lahr's final appearance, silent as it was, was moving. Professor Spats (for whatever remained of Lahr's part) was a fragment of the past of burlesque - a once great clown of the show when it was a family entertainment. His last moment on stage alone, with no audience to see him, marked the end of his era. Robards played his role with real enthusiasm, as a second-rate comic and singer (a burlesque \"Archie Rice\") who is also lecherous. He has some good numbers, including the tune I quote in the Summary Line. He does deflower Eckland, but in getting to know Eckland he also realizes she is out of her depth in the atmosphere of Minsky's. She really is a decent girl. He is opposed to her staying, and becoming part of the chorus line. And then comes her final act - inventing the strip tease. Robards is thoroughly ashamed of himself at the end, in helping bring this about. He leaves looking at Eckland as at a lost innocence. The show also includes a proper atmosphere for the burlesque theaters of the 1910 - 1930 period. Originally a junior partner to vaudeville, it degenerated into salacious jokes and bawdy skits (and sexually alluring acts like strip tease and fan dancing). The audiences were mostly unemployed types who were more frequently asleep in the audience than watching the stage. Some great talents did arise (Lahr, Abbott & Costello, Gypsy Rose Lee, Phil Silvers, Rags Ragland), but they were exceptions. It was end of the line entertainment, and it annoyed many people who were not fanatics like Denholm Elliot in the film. Mayor Fiorello LaGuardia did close down the New York burlesque theaters in the 1930s (so - they reopened in New Jersey). The film does recapture the spirit of that time, and that, with Robarts, and Lahr's farewell to the screen, is definitely worthwhile as a film to watch.",
         "The lights dim. The curtain goes up. The girls are on stage. The spot hits the tux-wearing tenor, silver haired and a little plump. \"I have a secret recipe / Concocted with much skill / And once you've tried my special dish / You'll never get your fill... \"Take ten terrific girls, but only nine costumes, and you're cooking up something grand...\" The Night They Raided Minsky's is a valentine to the long-gone burlesque houses of the Twenties. Naughty, bawdy and surprisingly innocent, filled with chorus girls who might generously be called a little past their prime, with plenty of belly work, with comedians and their second bananas, with pratfalls, seltzer bottles and song and dance acts. This Norman Lear/William Friedkin/Ralph Rosenblum movie has it all. It even has a story. Most of all, it has some great songs by Charles Strouse and Lee Adams, wonderful performances by Jason Robards and Norman Wisdom, and a collection of pungent characters played by the likes of Elliot Gould, Forrest Tucker, Bert Lahr, Harry Andrews, Joseph Wiseman, Jack Burns, Denholm Elliot and Dexter Maitland. And we're there when history is made, as Britt Ekland playing an innocent Amish girl from Smoketown, Pennsylvania, who longs to perform her Bible dances on stage, inadvertently invents the strip tease. Billy Minsky runs Minsky's Burlesque. Vance Fowler, secretary of New York's Society for the Suppression of Vice, is determined to close it down. Then Rachel Elizabeth Schpitendavel shows up. She's young. She's innocent. She's built. She catches the eye of headliner Raymond Paine (Jason Robards), a song, dance and straight man who works with his second banana, the small, mild and fall-down physical Chick Williams (Norman Wisdom). Paine wants Rachel to fall into his bed. Chick just falls for Rachel. Minsky's, however, is on the verge of closing. Then Raymond has an idea. They'll advertise a midnight show featuring Mademoiselle Fifi, \"the hottest little cooch artist in the world.\" When Fowler shows up with the cops, Fifi will be Rachel doing her Bible dances. Fowler will be a laughing stock and Minsky's will be saved. Now forget all that. What's important is the sweet nature of this burlesque gift. Most of the movie takes place backstage, on stage and in a near-by deli. It's a great, true deli, where we have bowls of half sours on the table and plenty of chunks of rye bread. (In that deli we'll watch Raymond nearly sweet talk a good looking woman at the next table into his bed, and then sweet talk her husband, who suddenly appears, into agreeing Raymond just gave them both a great compliment. Robards is as smooth as warm chicken fat.) Backstage is packed with sets, lights and half dressed chorus girls, but it's on stage where the goods are delivered...chorus girls who can barely dance but can jiggle with vigor and bump with oomph. Jason Robards and Norman Wisdom do wonderful work together. Robards is the wise-guy straight man to Wisdom's eternally innocent optimist. Their song and dance numbers really work. We'd expect this of Wisdom, who got started in English music halls and became one of Britain's great clowns. Robards, who was one of America's great stage actors, is almost as skilled. Their \"Perfect Gentleman\" number by rights should be a remembered classic. I don't know how Friedkin managed it, but the people in the audience look authentic, right down to their delighted reactions. The Night They Raided Minsky's also has a clever script. Says Raymond to Chick when the little guy wants some reassurance after meeting Rachel. \"You met a girl!\" says Raymond with a big smile. \"Ah, Chick, my boy, when it comes to girls you have three qualities that are far worse than being short and funny looking. You have the curse of the three D's. You are decent, devoted and dependable...good qualities in a dog, disastrous in a man!\" Charles Strouse scored the movie and, with Lee Adams, provided great songs. \"The Night They Raided Minsky's,\" \"Take Ten Terrific Girls\" and \"Perfect Gentleman\" establish more than anything else the good-natured, fast, harmlessly bawdy style of the movie. The Night They Raided Minsky's had a troubled parentage, with director William Friedkin disliking it and film editor Ralph Rosenblum claiming credit for everything good about it. There's more jump cutting than we need and perhaps a few too many historical clips. Still, we have potent nostalgia for things past that no one now is alive to remember. The movie carries Norman Lear's imprint at his best, and if Rosenblum and Friedkin want to arm wrestle over the movie, that's all right with me. Who cares who cut the paper lace for the valentine? I'm just happy we've got it. I'm ready for Dexter Maitland as the tenor to see us home... \"I have a secret recipe / Concocted with much skill / And once you've tried my special dish / You'll never get your fill... \"Take ten terrific girls, but only nine costumes, and you're cooking up something grand. \"Then add some funny men / And pepper with laughter./ It's hot and tasty I know. \"Then serve it piping hot and what have you got... A burlesque show!\"",
         "Following the 12 Norman Wisdom vehicles I watched during the course of the last 2 weeks, I decided to add to them his only American film. A nostalgic piece about vaudeville in New York's lower East Side in the 1920s, perhaps the film's single greatest asset is its remarkable recreation of that era; amazingly, the inspired transition from black-and-white photos of the period to the film itself seems to have been a happy accident which occurred during the editing process! The IMDb also noted that the film's preview was a disaster and that editor Ralph Rosenblum employed more than a year of his life to try and save it!; I have no idea how Friedkin's 'original' version looked like but the finished product is a very enjoyable film indeed, if somewhat shapeless (featuring too many 'girlie' shows, for instance, though the music by Charles Strouse is admirably 'of the period'): the plot concerns the goings-on in a second-rate (self-proclaimed \"The Poor Man's Follies\") burlesque theater whose lease is about to expire and the manager (Elliott Gould) - with the help of his two star comedians (Jason Robards and Wisdom) - has to devise a plan to hold on to his venue; the solution arrives in the shapely form of a naïve Midwestern girl (Britt Ekland), an aspiring dancer but whose debut performance is turned via a series of incidents into the first-ever striptease act! Friedkin managed to come up with a splendid cast: while Robards may be too stern for the 'leading man' figure (who falls for Ekland's ingénue), he's got some of the film's best lines; Ekland herself is delightful, particularly during the literally show-stopping climax; Wisdom's moving but unsentimental performance makes the most of his 'comic sidekick' role, emphasizing the character's humanity (realizing Ekland's inaptness at performing on stage, he patiently schools her) and feelings (he secretly loves her too but since Ekland prefers Robards herself, he's happy to leave her to his pal). The supporting cast, then, is a pure delight: Forrest Tucker (as a gangster with a share in the theater), Elliott Gould (playing, as already mentioned, the flustered but inexperienced manager who's entirely dependant on his star attractions), Joseph Wiseman (as Gould's bemused Jewish father, the owner of the theater who's intent on its foreclosure because he disapproves of the style of his son's shows!), Harry Andrews (sporting a wicked beard and exaggerated eye-brows to match as Ekland's Amish father, who arrives in New York in order to claim back his wayward daughter), Denholm Elliott (hilarious as a Vice Squad official whose presence at the theater is recurrent so as to fervently jot down all form of lewdness and general unwholesomeness he happens to notice going on, in preparation for an eventual Police raid...which, naturally happens on \"The Night They Invented Striptease\", as the film was alternately called!) and Bert Lahr (as, more or less, the Chorus to the narrative but whose role was considerably diminished because, sadly, he passed away in mid-production!). Perhaps the film's funniest moment is the confrontation scene between Wiseman and Andrews (with the former telling the latter that \"The only God who could tolerate me is the only one who could tolerate you!\"), after which their joint prayer for their children's souls is interrupted by the perpetually awkward Elliott, who's forced to accompany them but is clearly lost! Unfortunately, the film was recorded off what has to be the sloppiest channel on Cable TV; in fact, the screening froze at one point and the reception was subsequently lost for a brief instance!",
         "This can be a wonderful guilty pleasure, as it mixes a little (and I mean a little) skin, music hall numbers, traditional burlesque routines, a slightly salacious backstage story, and film-style slapstick. Jason Robards and Norman Wisdom are a very convincing comedy team, although Robards is a bit dark. Give the actor and the filmmakers credit for maintaining the character as a ruthless SOB and not trying to make this guy cute and lovable. You'll also see Bert Lahr (the Cowardly Lion) in his last film performance, which had to be truncated as he died during production (his role would have been more important and added a touch of surrealism). Also on hand is Elliott Gould, in pre-\"Bob, Carol, Ted & Alice\" days as a sweet schnook (and the title character), as well as Forrest Tucker as a gangster, Jack Burns as a candy butcher (that's the guy who sells the crummy boxes of candy that MIGHT have a watch in them--and if you believe that...,) Denholm Elliott (Indiana Jones' friend) as the guy who conducts the raid, as well as some real burlesque dancers and comics from the old days. Adams and Strouse, who wrote BYE BYE BIRDIE contribute a small group of peppy songs, including \"From Head To Toe You're A Gentleman\" a duet for Robards and Wisdom (the latter a beloved variety star in Britain) and the immortal production number, \"Take Ten Terrific Girls But Only Nine Costumes And You're Cooking Up Something Grand.\" Britt Ekland inadvertently invents the striptease (it's complicated, read the plot synopsis), but reliable rumor and legend is that the breasts on display belong to a double. Incidentally, the nudity here is about as extensive as in Titanic, so if your kids have already seen that, this will not corrupt them. The fact is the whole thing is a curiously innocent Mulligan stew of comedy and music, given its subject matter. Norman Lear wrote and produced in his pre-ALL IN THE FAMILY DAYS, and William Friedkin directed in his pre-FRENCH CONNECTION days. According to the book \"WHEN THE SHOOTING'S DONE THE CUTTING BEGINS\" by Ralph Rosenblum, the film's editor, Friedkin shot the film indifferently and left immediately. Rosenblum spent the best part of a year recutting the film with the blessing of United Artists production chief David Picker. Rosenblum uses a technique of editing in hokey old silent footage to indicate to the audience that no one is taking the story too seriously, which lifts the curse over some purple writing and acting. Also Rosenblum seems to have invented a trick of mixing authentic B&W archive footage with new footage printed in black and white, which suddenly switches to color. This is an exciting and startling effect the first couple of times, but it is a bit overplayed. Anyway, this film is better than you probably think it is, and better than it needs to be. Give it a look, it couldn't hurt.",
         "I will make this prediction NOW....that within 5 years we see THE NIGHT THEY RAIDED MINSKYS turned into a $100 per seat Broadway stage smash.......all the elements are there and like APPLAUSE or THE PRODUCERS one adds reworked or new songs and gives this bawdy burlesque treat a re tread. What this film is about, and the tawdry bump and grind style is a sitter for another go. Have another look at the film.......I'm right about this. Not a big success on first release, it eventually found an audience with THE PARTY, but somehow it is MINSKYS that is actually a better film and a more rewarding film. It was also Bert Lahr's final performance as he died during filming."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Tandem Productions"],
      "summaries": [
         "Rachel arrives in New York from her Amish community intent on becoming a dancer. Unfortunately Billy Minsky's Burlesque is hardly the place for her Dances From The Bible. But the show's comedian Raymond sees a way of wrong-footing the local do-gooders by announcing the new Paris sensation \"Mme Fifi\" and putting on Rachel's performance as the place is raided. All too complicated, the more so since her father is scouring the town for her and both Raymond and his straight-man Chick are falling for Rachel.",
         "1925. Not truly comprehending what she is doing, Rachel Schpitendavel leaves her Amish Pennsylvania home to head to the National Winter Garden Theater in New York City to become a dancer. The dances she wants to perform are reenactments of Bible stories. The National Wintergarden Theater she stumbles upon in the Lower East Side is owned by Louis Minsky, and houses his son Billy Minsky's revue, Minsky's Burlesque. She meets the show's headlining act, Raymond Paine and Chick Williams, both men who fall for her. While Chick wants to protect her both by showing her what burlesque really is and by getting her away from the show, Raymond believes she is the answer to one of Billy's biggest problems, namely Vance Fowler, who feels the show is amoral and wants it shut down. Without telling Rachel what it actually means, Raymond wants to advertise Rachel as Mlle. Fifi for the midnight show, her performance advertised as the stuff that has driven all of Paris wild by its lewdness. As Raymond anticipates that Fowler will call in the police to shut the show down, Fowler will be too embarrassed to ever step foot in the theater again when Rachel, as Mlle. Fifi, instead dances her straight-laced Bible dances. Raymond doesn't care that in the process Rachel may also get hurt. As midnight approaches, whether Rachel makes it to the stage will depend on the machinations of Raymond, Chick, Billy and Louis among others, but also includes Rachel's father, Jacob Schpitendavel, who has come to New York to find his daughter and take her home before she does anything against his Amish beliefs. If she does make it to the stage, Rachel herself may have some say in what she decides to do.",
         "A naive Amish young woman runs away from her home in Pennsylvania to New York City where she hopes to act in religious stage plays but ends up performing in Burlesque theatre."
      ],
      "budget": 3000000
   },
   "movielensId": 114455,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-12-22",
      "dvdReleaseDate": "2008-05-20",
      "directors": ["William Friedkin"],
      "runtime": 99,
      "movieId": 114455,
      "title": "The Night They Raided Minsky's",
      "mpaa": "",
      "actors": [
         "Jason Robards",
         "Britt Ekland",
         "Norman Wisdom",
         "Forrest Tucker",
         "Harry Andrews",
         "Joseph Wiseman",
         "Denholm Elliott",
         "Elliott Gould",
         "Jack Burns",
         "Bert Lahr",
         "Eddie Lawrence"
      ],
      "imdbMovieId": "0063348",
      "originalTitle": "The Night They Raided Minsky's",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Rachel arrives in New York from her Amish community intent on becoming a dancer. Unfortunately Billy Minsky's Burlesque is hardly the place for her Dances From The Bible. But the show's comedian Raymond sees a way of wrong-footing the local do-gooders by announcing the new Paris sensation \"Mme Fifi\" and putting on Rachel's performance as the place is raided. All too complicated, the more so since her father is scouring the town for her and both Raymond and his straight-man Chick are falling for Rachel.",
      "tmdbMovieId": 42648,
      "avgRating": 3.07143,
      "releaseYear": "1968",
      "numRatings": 7,
      "posterPath": "/bjL3HL4enDJSNdD65bmCXWaC8IU.jpg"
   }
}