{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0437123",
      "video": false,
      "title": "The Case of the Grinning Cat",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4ad8c3a368484e16a129",
            "name": "Chris Marker",
            "profile_path": "/b1DZhCEw14SKzCdfT8xmV4ZHpid.jpg",
            "id": 9956,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.123918,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 126141,
      "vote_count": 3,
      "budget": 0,
      "overview": "Paris 2002. Yellow cats appear on the walls. Chris Marker is looking for these mysterious cats and captures with his camera the political and international events of these last two years (war in Iraq...).",
      "similar": [],
      "original_title": "Chats perchés",
      "runtime": 59,
      "poster_path": "/Q6qqrsBgkoFhCS6YnFSVcRuUBT.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Les Films du Jeudi",
         "id": 54259,
         "origin_country": ""
      }],
      "release_date": "2004-12-05",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Chris Marker"],
      "runtime": 59,
      "synopsis": null,
      "writers": ["Chris Marker"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0437123/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4OTYyNTc1N15BMl5BanBnXkFtZTcwMjUwMTgyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Bertrand Cantat, Dieudonné, Léon Schwartzenberg | See full cast and crew »"],
      "reviews": [
         "Chris Markers sublime review of the millennium so far. His camera cuts across the streets of Paris, via the métro, via TV, via the internet. the trite of politicians, the noise of demonstration marches, the poignancy of funeral processions. via the subtle gaze of girls, and the mischievous gaze of M. Chat. These cuts, put together, provide a document of the previous 4 years, it's roots to the past, and a glimpse of its future. - to get the most out of this film it helps to know a bit about French current affairs. - note, out of interest, the many references to surrealists, and their cultural legacy.",
         "First off, I give this film the somewhat arbitrary rating of an \"8\" solely in comparison to other works by Marker (it is quite difficult to rate Marker's films in comparison to anybody else's work but his own -- which is unfortunate since no one has come along in the last fifty years who makes films on par with his -- if Lynch delved into nonfiction he might come close...). As a form of cinematic essay it is both provocative and meditative: \"Grinning Cat\" makes keen observations and provides insightful commentary on the current state of political activism and also plays with our expectations about non-fiction film-making, inviting contemplation on the ambiguity of reading visual culture. The film's structure feeds the viewer's interest while challenging our ability to readily take what we see as \"pure fact.\" The politically-oriented commentary is poetically delivered and is a much needed dose of analysis that those of us in North America are rarely given in more popular, didactically political fiction and nonfiction films. Like a piece o abstract art or thickly composed piece of literature, Marker's latest film deserves and requires a second, perhaps even a third, look. It's film for reflection and contemplation, and perhaps even a call to action.",
         "Saturday May 27, 7:00pm Northwest Film Forum Wednesday May 31, 9:30pm Northwest Film Forum \"It's a great asset in life, not to know what you're talking about.\" On the locks of Canal Saint-Martin one day appeared the image of a large yellow cat. Soon this feline with the toothy grin began popping up all over Paris. Chris Marker's 'Case of the Grinning Cat' documents his amusing journey into the Metro, through parks and over rooftops in search of the infamous 'chat', while protesters took to the streets against fascism in France and America. The cat slyly sneaks onto television news and into van Eyck's Marriage of Giovanni and Giovanna Arnolfini. In one hilarious 'non-cat' moment a pigeon turns into a man, but the cat is soon back, on postage stamps and in the Louvre. \"Just when you stop looking, there is a cat!\" Marker rambles through everyday Parisian life for a year or two using the loosest of threads, or whiskers, tying everything together with a delightfully dry, understated and ironic humor that could only be French. \" Faites la guerre de chats pas. \"",
         "I really hated this. Firstly, it was horribly shot - basically the editing and picture quality was comparable to a Handicam movie. The narration was infuriating and the concept incredibly muddled. In the end it was a documentary about almost nothing. Was it about war, urban subcultural memes or both? It ended up not really being about neither. Very disappointing. Thank god it was only one hour long. The extras on the DVD are even more depressingly pointless. I don't understand how this even made it to DVD."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Films du Jeudi, Les",
         "Arte France"
      ],
      "summaries": [
         "Monsieur Chat is a character (a yellow grinning cat) which appeared on Paris walls at the beginning of the years 2000. Following its steps, Chris Marker is depicting the very recent french history (elections, demonstrations, state scandals etc.) through the perceptive eye of this strange graffiti...",
         "Paris 2002. Yellow cats appears on the walls. Chris Marker is looking for these mysterious cats and captures with his camera the political and international events of these last two years (war in Iraq...)."
      ],
      "budget": 150000
   },
   "movielensId": 114652,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2004-12-05",
      "dvdReleaseDate": "2008-09-02",
      "directors": ["Chris Marker"],
      "runtime": 59,
      "movieId": 114652,
      "title": "The Case of the Grinning Cat",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0437123",
      "originalTitle": "Chats perchés",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Paris 2002. Yellow cats appear on the walls. Chris Marker is looking for these mysterious cats and captures with his camera the political and international events of these last two years (war in Iraq...).",
      "tmdbMovieId": 126141,
      "avgRating": 3.71429,
      "releaseYear": "2004",
      "numRatings": 7,
      "posterPath": "/Q6qqrsBgkoFhCS6YnFSVcRuUBT.jpg"
   }
}