{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sweden",
            "id": 1192
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "catholic church",
            "id": 157008
         }
      ],
      "imdb_id": "tt0071096",
      "video": false,
      "title": "The Abdication",
      "recommendations": [],
      "backdrop_path": "/31VjAjaf2cBZ6OnlCiaayqMOBrJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Cardinal Azzolino",
               "gender": 2,
               "credit_id": "56782619c3a368168900911f",
               "name": "Peter Finch",
               "profile_path": "/dQ7jYlTq05FckFujavbEba4rlQK.jpg",
               "id": 29903,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Queen Kristina",
               "gender": 1,
               "credit_id": "5678262892514179dd0090c4",
               "name": "Liv Ullmann",
               "profile_path": "/5u8fikv8ANDx5FJhLtvhZmBZtRa.jpg",
               "id": 11916,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Oxenstierna",
               "gender": 2,
               "credit_id": "56782635c3a3681689009121",
               "name": "Cyril Cusack",
               "profile_path": "/5d6OeKNqpRSMhwXd1FHV9KeX4WS.jpg",
               "id": 4973,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Altieri",
               "gender": 2,
               "credit_id": "5678265892514179e1009d34",
               "name": "Paul Rogers",
               "profile_path": "/eX7hsrhrHhJcfoMeP9d379kOo25.jpg",
               "id": 42840,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Cardinal Barberini",
               "gender": 2,
               "credit_id": "567826c692514179d2009649",
               "name": "Graham Crowden",
               "profile_path": "/wyGg5BXqE1N8oG1Ag82I3yHYQdW.jpg",
               "id": 10654,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "The Dwarf",
               "gender": 2,
               "credit_id": "567826d4c3a368168e009dcf",
               "name": "Michael Dunn",
               "profile_path": "/rE1KViH3RqarydmszxqJhTfEJ2X.jpg",
               "id": 16085,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Queen Mother",
               "gender": 1,
               "credit_id": "567826e2925141691a006060",
               "name": "Kathleen Byron",
               "profile_path": "/b3NOwSoBmHDZiYRLLO9c8t4VwJp.jpg",
               "id": 99905,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "567825e7c3a368167c0097da",
               "name": "Anthony Harvey",
               "profile_path": "/xFb61Oxx98u6xrSpbN0KZFrysWO.jpg",
               "id": 12009,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "567825f9c3a3681689009119",
               "name": "Ruth Wolff",
               "profile_path": null,
               "id": 200336,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "56782606c3a368167a009d2a",
               "name": "Ruth Wolff",
               "profile_path": null,
               "id": 1551933,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         }
      ],
      "popularity": 0.356124,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 15478,
      "vote_count": 2,
      "budget": 0,
      "overview": "Queen Christina of Sweden (1626-1689) abdicates and travels to Rome to embrace the Catholic church.",
      "similar": [
         462,
         640,
         769,
         5915,
         11202,
         45317,
         371638,
         363676,
         389015,
         407445,
         318846,
         396371,
         324786,
         323677,
         228970,
         274479,
         152532,
         300671,
         276907,
         152792
      ],
      "original_title": "The Abdication",
      "runtime": 103,
      "poster_path": "/cDpssbNpBud4RrLRDf7F3ftXFoe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1974-10-03",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "A woman with a profane love... for a man of God.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Harvey"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Ruth Wolff",
         "Ruth Wolff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0071096/",
      "coverLink": null,
      "actors": [
         "Peter Finch",
         "Liv Ullmann",
         "Cyril Cusack"
      ],
      "reviews": [
         "A film of suppressed emotions about suppressed sexuality, but more than that, about the nature of love and the power of giving oneself to another, and the tragedy of being unable to. This is a beautiful film, both in how it looks, and how it thinks, it is unrelentingly heartbreaking. Ullman is somehow mesmeric, you can't take your eyes off her, you feel her pain in all its rawness and wonder how one human being can endure so much. Finch's character is a support to hers, it is almost like you care for him only inasmuch as his actions affect her. This is a movie that will take your breath away, it is profoundly moving (I know what that sounds like but it is).",
         "This film was shown once on local TV in the early 1980s (but I was too young to watch it) and then fell completely off the radar in the interim; however, thanks to the God-sent overhaul that TCM UK has finally decided to give its long-decaying schedule of endlessly-repeated titles, I was able to finally catch up with it after some 25 odd years! Not because the film has any kind of reputation per se but its credentials are certainly impeccable and European History has always been one of my favorite subjects in school (and one in which I excelled in). The story of Sweden's Queen Christina had already been dealt with magnificently by Rouben Mamoulian in his eponymous 1933 film which had provided Greta Garbo with arguably her greatest role; this being made a good 40 permissive years later, the independent-minded Protestant monarch (Liv Ullmann) renounces her faith and throne to sneak into the Vatican and pour out her lesbian longings for a childhood friend onto a Roman Catholic Cardinal (Peter Finch) engaged to investigate her well-documented wanton ways and her newly-professed piety! The two stars, reunited a year after Ross Hunter's maligned 1973 musical version of LOST HORIZION, are practically the whole show here despite being surrounded by opulent sets and a cast of thespian notables: Cyril Cusack (as Christina's guardian), Graham Crowden (as a fellow Cardinal), Edward Underdown and Kathleen Byron (as, respectively, Christina's chivalrous father and embittered mother) and diminutive Michael Dunn (in his last film as Christina's enigmatic servant). Celebrated cinematographer Geoffrey Unsworth shoots the opening abdication scenes in moody candlelight, bathes the film in mist during Christina's childhood reminiscences and lends it a sunny look during her liberated passages; Nino Rota's music score is also appropriately sensitive or soaring according to the film's moods. Incidentally, another failed historical/religious charade featuring Liv Ullmann I would like to see is Michael Anderson's POPE JOAN (1972)\u0085who knows if TCM UK will likewise surprise me and provide the opportunity to catch up with it in the not-too-distant future?",
         "If you are to believe this variation of the life of Sweden's Queen Christina (Liv Ullman), you have to see her as the most sexually frustrated ruler of all time, a princess raised as a boy then crowned as Queen. She has romantic feelings for a female childhood friend yet lusts after several of the young men in her court as well. This story is told through her life after her abdication from the throne where she goes to the Vatican to meet with the Pope and tells her life story to a Cardinal (Peter Finch) in an effort to be permitted to convert to Catholisism. The film is never told through a historical perspective, simply through her lack of a sex life. She caresses the face of the beautiful woman she loves and rides away on her horse in anger after seeing the woman kissing a man she's also in lust with. Her female friend allows to watch her make love to that man who makes a pass at her the next day after confronting her about spying on them the night before. As you watch this, you realize that's all there is to this story, even if beautifully filmed, nothing but an effort to give a glimpse into the thoughts of what Garbo was possibly thinking in the 1933 version of Queen Christina's life. While Liv Ullman is certainly perfect for the role of Sweden's most famous ruler, she is not permitted to give an insight into anything other than her sexual frustration. There's nothing about what she did during her reign as Queen on a historical level, only a glimpse into the part of her life that should have remained secret. I really wanted to love this movie, but as I realized where the entire film was going, I realized why this was dismissed upon release and added to the legend of Ullman and Finch's other notorious teaming, the 1973 musical version of \"Lost Horizon\". I was truly embarrassed by Ullman's basically psychotic pass at Finch towards the end, the final straw for me in my opinion of the film as a whole.",
         "I saw this film in the Ford rubber tree plantation in Belterra close to Santarém in the Amazon in the second part of the 1970:s. Of what I can remember, there was a lot of forced horse-riding in the film, mostly by the beautiful, womanly Liv Ullman, who didn't had the slightest resemblance with the portrayed queen Kristina. Queen Kristina was known as almost ugly with a mans body, language and habits. Sitting there in the middle of the rain forest in a warm and humid provisional cinema, with the projector rattling amongst the onlookers, I wondered if the spectators understood anything of what they saw on the screen. A story that took place 350 years before and in a country of ice and snow. And me - who had read about the abdication in school, how the daughter to the king who had fought the catholic church, and died in the 30 year war, became a catholic - realized that there are ten thousand different ways to tell a story and this was not the one my historian teacher had told me .... or the one I had imagined!",
         "I will never forget my first impressions while watching this movie so many years ago on TV. I absolutely loved it!! I was riveted to the screen by this complicated and multi-faceted person in history who I had here-to-fore never heard about. This movie belongs right there with other historical classics produced from the 50's to the 70's. I still remember being absolutely fascinated by Liv Ullmann's performance. What a colorful character Queen Christina of Sweden was - but Liv Ullmann made her come alive with her portrayal of an OCD personality that gave me my first introduction into a disorder that I had previously never known about. I don't know if the real Christina had OCD or not, but that was what I remembered most about the movie. I would love to see it again.",
         "Though not as regal and alluring as Greta Garbo in her heavily fictionalized biography Queen Christina, Liv Ullmann gives us a different Christina. In The Abdication Liv Ullmann gives us a woman who is seized by her new religion, but her new religion doesn't know quite what to make of her. It's 1655 and this film kind of takes off where Garbo's Queen Christina ended. Liv's already abdicated and she's arrived at the Papal Court, traveling incognito with only her former dwarf jester Michael Dunn accompanying her. Eager and willing she arrives saying she's to be a servant of Roman Catholicism. Maybe in the next couple of centuries she would have been welcomed no questions asked. But this was the 17th century the age of the Reformation and Counter Reformation. Religion and politics blended so well in Europe the line was almost erased. We have to examine her to see if her conversion is sincere. So a dying Pope appoints Cardinal Decio Azzolini played by Peter Finch as a committee of one to examine her as to the truthfulness of her conversion. There have been many rumors about Queen Christina down the centuries. Her father Gustavus Adolphus brought her up as a ruling monarch to be meaning that a lot of what was considered strictly masculine in those times was open to her. She was educated and also learned the arts of war. Rumors then and now have said she was a lesbian. But other rumors have her and Cardinal Azzolini as lovers and these are the rumors dealt with here. Finch talks a lot about his temptations in those directions as well. Celibacy is a mighty taskmaster and then and now discreetly not followed. A lot of the scenes between Ullmann and Finch are what drags this film down somewhat. Just a lot blabbering dialog about religion. Some of the best scenes are the flashbacks that Ullmann narrates about her life. Cyril Cusack as Count Oxenstierna who ruled Sweden in her minority turns in a memorable performance. The atmosphere of 17th century Rome specifically the Vatican was well done also. The Abdication ain't good history, but passably good drama."
      ],
      "genres": [
         "Biography",
         "Drama",
         "History"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["Queen Christina of Sweden abdicates and travels to Rome to embrace the Catholic Church."],
      "budget": 0
   },
   "movielensId": 114638,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1974-10-03",
      "dvdReleaseDate": null,
      "directors": ["Anthony Harvey"],
      "runtime": 103,
      "movieId": 114638,
      "title": "The Abdication",
      "mpaa": "",
      "actors": [
         "Peter Finch",
         "Liv Ullmann",
         "Cyril Cusack",
         "Paul Rogers",
         "Graham Crowden",
         "Michael Dunn",
         "Kathleen Byron"
      ],
      "imdbMovieId": "0071096",
      "originalTitle": "The Abdication",
      "genres": [
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["jnb-1hEEg10"],
      "plotSummary": "Queen Christina of Sweden (1626-1689) abdicates and travels to Rome to embrace the Catholic church.",
      "tmdbMovieId": 15478,
      "avgRating": 3,
      "releaseYear": "1974",
      "numRatings": 1,
      "posterPath": "/cDpssbNpBud4RrLRDf7F3ftXFoe.jpg"
   }
}