{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1842356",
      "video": false,
      "title": "Entity",
      "recommendations": [
         187276,
         84293,
         41027,
         114635,
         126962,
         26293,
         213803,
         406582,
         118988,
         110372,
         86191,
         23281,
         84558,
         308017,
         147879,
         31991,
         296121,
         80837,
         119255,
         10256
      ],
      "backdrop_path": "/dpfeXJkLsGEfcjomKq86jG4QeyE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ruth Peacock",
               "gender": 1,
               "credit_id": "52fe4b81c3a368484e18c301",
               "name": "Dervla Kirwan",
               "profile_path": "/tX3qBpGrOEXfIxGyblronECUZQ4.jpg",
               "id": 95896,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kate Hansen",
               "gender": 1,
               "credit_id": "52fe4b81c3a368484e18c305",
               "name": "Charlotte Riley",
               "profile_path": "/pkiZKysfb0oXvaBBm6zWQkWSvVu.jpg",
               "id": 115679,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Yuri Levkov",
               "gender": 2,
               "credit_id": "52fe4b81c3a368484e18c309",
               "name": "Branko Tomovic",
               "profile_path": "/hQBTvwJyOUAvNH50pZa1RJ3bvSp.jpg",
               "id": 944548,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Tasha",
               "gender": 0,
               "credit_id": "52fe4b81c3a368484e18c30d",
               "name": "Claire Leatherbarrow",
               "profile_path": null,
               "id": 1270552,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b81c3a368484e18c2f7",
               "name": "Steve Stone",
               "profile_path": null,
               "id": 1164736,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b81c3a368484e18c2fd",
               "name": "Steve Stone",
               "profile_path": null,
               "id": 1164736,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.100458,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 131887,
      "vote_count": 15,
      "budget": 0,
      "overview": "In 1998, thirty four unidentified bodies were found in shallow graves in a remote Siberian forest. After subsequent investigations, no official explanation by the Russian authorities was ever offered about the circumstances of the deaths.",
      "similar": [],
      "original_title": "Entity",
      "runtime": 87,
      "poster_path": "/mcz6whZ00oNn0T6mZ480Y2DhKgO.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-10-24",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "We may forget the past, but it never forgets us.",
      "adult": false,
      "homepage": "http://www.facebook.com/Entitythemovie",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Stone"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Steve Stone"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1842356/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3MjY4NzIzNjVeQTJeQWpwZ15BbWU3MDI3OTAyMTg@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Dervla Kirwan, Charlotte Riley, Branko Tomovic | See full cast and crew »"],
      "reviews": [
         "I love scary movies and this was very scary! lots of jumps and the people in the film actually did sensible things which was a nice change. Acting is great - the main documentary girl looked really sincerely freaked out when all the bad things happened. I have no idea why this is rated so low, maybe people have been brainwashed into thinking a simple storyline in a freaky empty building in the middle of the Siberian forest is not complicated enough for a horror film? So if you like scary films that have normal people in them just getting into horrific situations through no real fault of their own, I recommend this film. Scary good.",
         "Saw this at the LIFF where it deservedly won Best Horror. The acting is really strong. Will be watching Charlotte Riley's future with interest. I hear she has already landed a lead female starring role opposite Tom Cruise. I feel the director has given a masterclass in making a low budget film look anything but. I enjoyed the psychological horror as am not a great fan of gore. Not as many jumps as the Paranormal Activity series. This stuck with me for some time afterwards like The Blair Witch Project did and provoked me to scurry off to google to research into the historical background given as fact in the film and whether it was based on stuff that really happened in The Cold War. For me this adds to the scare factor. The sound was impressively frightening and in the peaks of the film I had my hands over my ears and squinting through my eyes. Win for me.",
         "The movie follows a crew of British filmmakers lead by comrade Fake Accent through the Russian equivalent of the Blair Witch forest filmed in UK, so that they could shoot a shaky cam documentary about ghosts. At first the movie looks like it's going to tell a story about some real brutal Russian stuff - a serial killer like Chekotilo, or a story of some 90's Russian mafia massacre: these things were real and they did take place in forests like this, which would make the movie really scary and uncomfortable. But instead, the movie falls victim to all the Russian stereotypes you can imagine, including KGB, secret spy stuff, Luger pistols et cetera - I was surprised the crew wasn't attacked by bears on unicycles. It takes away from the story very much. But the movie still was somewhat interesting to watch, it creates atmosphere and tension, and the scenes which were supposed to be scary do look pretty scary.",
         "Interesting, isn't it, how some films divide opinion? I really liked this film. There's a decent back-story - in fact two decent back-stories, to be accurate. Good cast, with one or two established actors and a couple of decent new finds. There are a number of gripes about found footage - well, it's not a found footage film, it's actually a beautifully shot horror film, with a few bits of found footage, which imho fit very well to up the tension. I think one of the main 'difficulties', though not for me, is that that the director/writer Steve Stone hasn't fallen for the post-Saw generation of boy-pleasing gore films. This isn't a gore film. It's a horror film, and a really good one, at that. So if you are prepared to sit back, (if you can do that while spending much of the film on the edge of your seat), and watch a really fine film but with a low tits and gore count, then I recommend this film wholeheartedly.",
         "I saw this movie at the Grimmfest in Manchester-Stockport and must say that it's so much better than the trailer might even suggest. The crew of a psychic-themed TV series goes to investigate a mysterious site in the Russian forests where thirty-four dead bodies were dug up, they find themselves caught up in the aftermath of a government black-ops project that has left a massive abandoned research facility drowning in bad vibes, ghosts and residual nightmares. Steve Stone managed to create a very haunting, atmospheric and especially claustrophobic horror thriller that keeps you at the edge of your seat. I was also especially surprised by the brilliant performances of the actors, something you don't find very often in genre films. Dervla Kirwan plays psychic Ruth Peacock in a very subtle and beautifully understated way, Charlotte Riley is perfectly cast as the ambitious young TV host and Branko Tomovic who has his own darker reasons for bringing the British crew into the Siberian forest as the Russian character Yuri gives a wonderfully twisted, tormented and also emotional performance. I was also impressed with the locations, especially this huge overwhelming tunnel or industrial silo. Sadly, Steve Stone did not reveal where it was exactly shot at the following Q&A. And I also must stress the brilliant sound design which makes the whole Entity experience very frightening. The only small weak point in my opinion is the found footage style at times, just because we have seen it often enough by now. Had it come out a couple of years ago before Rec, VHS, etc it could have been the great inception of this style. But nonetheless British horror at its best! 9/10",
         "I am not usually a fan of modern horror films. Too much gore and not enough story. However, 'Entity' is a little more thoughtful than your average 'found footage' thriller. Nicely paced and shot, the film draws you in with good plot and good acting. I was particularly impressed with Branco Tomovic, who is very believable in his role as 'Yuri Levkov'. And from what I understand, 'Entity' was made on a very small budget, which is surprising considering the very professional look & feel of the film. This is Director Steve Stone's first feature film & I think he is definitely one to watch for the future.",
         "From the start, this films promises much. The initial sequence of 'found footage' is very creepy - unfortunately you will discover it's by far the creepiest thing in the film. The initial post-credits opening is also promising - great camera work, well judged soundtrack and characters talking like real people. Unfortunately nothing convincing develops from this and the whole documentary crew theme/psychic woman seems half hearted and a little forced. There ARE some potentially creepy locations used, but despite this, this film commits the cardinal sin - it's just not at all scary. A far superior treatment of a similar theme is Grave Encounters. It's not a bad film at all, it just seemed so close to having much greater potential, based on the great start and good ending twist. Just the middle 70 minutes, the bulk of the film were missing something...",
         "Writer/Director Steve Stone wades into the horror genre with a combination found footage/ghost hunting adventure in the vein of 'Grave Ecounters' and 'Death of a Ghost Hunter'. Much like previous ghost hunter films, the premise of 'Entity' takes a crew of television show paranormal investigators and sets them to the task of getting to the bottom of a grisly unsolved crime with occult undertones. Here the ghost hunting team is led by actress Dervla Kirwan as 'Ruth Peacock' a psychic sensitive capable of seeing and speaking with the dead. Along with a cameraman, the TV show's host, a generic technician and a local guide, Ruth spearheads an investigation into the discovery of more than thirty human corpses somewhere in the remote reaches of the Siberian forest. Dervla's 'Ruth Peacock' reveals through her interactions with the deceased flashes of their unjust deaths at the hands of ruthless killers, and the revelation the victims were together in the remote Russian wilderness for a more sinister purpose. Special effects throughout act one failed to impress or promote scares. The ghosts, rendered here by computer effects seemed too clean, and the psychic character's reaction to their presence and communication attempts was too generic within the genre standard for my tastes. The initial setting - the Siberian Forest - evinces within the viewer an isolated enough feel as we never see the vehicles our ghost hunters rode in on and thus are left to assume they had been already hiking for miles when the film began. Characterization up to this point is lacking, save for Dervla's 'Ruth' who is from the outset portrayed as extremely sensitive to the slightest paranormal disturbance and I suppose her expressions of uncertainty well enough convey a serious stirring of internal fear as she discovers the site of the mass grave. In the remaining four characters the film gives the standard overzealous for ratings and somewhat egotistical reality show host, her faithful, fearless cameraman, a filler character in the form of their jumpy tech support guy, and the standard unknown in the form of the Russian guide. None of the aforementioned really stand out nor is much development lent to their characters beyond expected dialog and behavior within the context of most similar films. Act two finds our ghost hunters on arrival at a truly creepy military industrial facility emanating nasty supernatural vibes psychic Ruth Peacock has followed from the forest like doom laden bread crumbs. She warns the others that the ominous abandoned place is related to the mass grave back in the forest clearing, that the group ought to turn back, but of course zealous reality TV show host presses everyone forward into darkness - she must be calling the shots and signing everyone's paychecks. As the group enters and explores the cavernous, long disused complex our psychic Ruth repeatedly cautions the others danger is growing yet just as obdurately, TV show host 'Kate Hansen' played by pretty Charlotte Riley, pushes her onward. I applaud the filmmaker for the indoor setting. The long dark corridors, empty holding cells and confusing staircases of the facility build nice tension and lend us a feeling of being on the verge of something terribly sinister just out frame or over the shoulder. The decaying labyrinthine structure is without doubt one of the more frightening interior locations in recent horror films. Eventually while exploring the facility a hostile paranormal force reveals itself, and the crew retreat to a control room type area despite the disappearance of one their number. TV host Kate just wants to review the footage they've captured so far, while psychic point girl Ruth has been \"overcharged\" by her run in with the violent entity and must rest. Meanwhile ... of course there must be a meanwhile, plot thread number two unfolds with Russian guide and psychic Ruth. While the rest of the plot was competent enough if not terribly original, writer Stone would have better served the overall effort by eliding this development. Of course foreshadowing of a sort revealed more was going on with Russian guide than met the eye, however his purpose in the plot turns out to be less than believable and ultimately serves only to keep everyone left alive from fleeing the bad place. Overall, 'Entity' is worth five stars out of ten simply for adding to and keeping the genre alive. It is not one of those annoying films filmed alone by one of the actors, although some of this type of film making is worked into a few scenes. What prevents this reviewer from freely praising 'Entity' however, is the overly complicated last minute grab for high drama made by the plot at the end of the film. Had the script focused on what it set out to be - an expedition into a darkly atmospheric haunted facility - without all the needless side plot and trapped in time trickery, the film it drives may have stood out among its like. As it stands for consideration, 'Entity' is a solid five out of ten star ghost hunting adventure led by a capable actress in Dervla Kerwin whose character's time on screen is the sole performance out of five with much of a heartbeat. One point subtracted for mostly wooden performances, some lackluster CGI haunts, and a needless side plot tacked on as an excuse for our heroes to be stuck in the bad place. A sudden blizzard would have better served the purpose considering the geographical setting. 'Entity' is worth a watch if you're into one or more of the real life reality ghost hunting shows, or you're fresh out of horror movies on your big list of fright flicks. It won't spellbind you with its horror movie awesomeness, but some horror is better than watching a chick flick with your significant other.",
         "Entity gets off on a very bad foot due to, of all things, a character with the worst fake Russian accent I've ever heard. My first thought was Jamie Lee Curtis' \"German\" accent (Swedish due to ignorance) in the train scene in Trading Places. This is even worse. That was meant to be funny, this isn't. \"Yuri\" sounds more like a German doing a bad Scottish accent. Turns out the actor who played him is a German raised in Serbia. If you can't find someone with a Russian accent, why set the film in Russia? They could have easily set this in Eastern Germany and claimed that the disappearances occurred in the DDR years. Or they could have rewritten the script so that our \"Russian\" was born in the UK of Russian parents and moved back to the motherland (this would also have explained his predilection for contacting a British TV show). Something, anything. Even using a guy with a straight-up English accent saying his name is Dmitri and he lives in Russia would have been a better choice. Although this may seem minor, it's not. I'd liken it to repeatedly seeing a gaffer in the background, or really bad CGI. It's either an easy fix or a poor production choice. At first it's funny, but each time Ivan speaks it makes it more difficult to take any of this seriously, leaving the makers of the film the only ones doing so; a fatal flaw in horror. This is not the only problem. The rest of the characters are dull and interchangeable; an hour in I didn't know which of the crew was who and I didn't care. I even couldn't remember Igor's name - or Boris, Sergei, whatever. They all read their lines like an automated phone message. I understand they're a paranormal TV show crew, but they act hardly shocked once shockingly spooky things begin happening, as if they've been on cases just like this before. Even when in grave danger, they're merely reading their lines, only displaying distress when they themselves are attacked. This idea has been done before. Some will criticize on that alone, but not me. However, you should be informed about what's been done with it before you do it. Where Grave Encounters succeeds (almost everything), this film fails. GE gave depth to its characters, making them lifelike and interesting. It managed to both have a lot of fun and extract terror from the idea of ghost hunters biting off far more than they can chew. GE is also downright frightening despite not having the advantage of switching POV that Entity has. Opportunities to scare are squandered by keeping the action distant and most of the ghosts only visible to the psychic. In short, a mandatory viewing of GE for the filmmakers would have been advised. While they're at it, The Hunt for Red October also may have helped them figure out how to handle the Russian accent problem. I stopped keeping track of the story once Vladimir started talking about his ex-girlfriend. Yes, I knew he \"vuz luking fod'r sumting\" early on so I figured it was a loved one. Whether he found her or not, I don't know, but Nikolai met some kind of ghost. Losing track of the plot didn't matter because there really isn't one. They walk around in a building and there's spirits of some kind. That's all you need to know. The film's greatest strength is the ability to keep a pretty tense atmosphere... although I wanted it to end, I found myself watching all the way through. Aside from that, some of the ghostly images are scary. Totally disposable supernatural horror that belongs in $1 bargain bins and free On Demand.",
         "Entity is a British horror movie written and directed by Steve Stone. It's a tight, claustrophobic film that relies on good acting, special effects that are genuinely disturbing and actually help reveal the story, and an ultra-creepy location. The plot is slim and characterisation is kept to a minimum as a small TV crew, consisting of Kate Hansen, played by Charlotte Riley, Matt, played by Rupert Hill and David, played by Oliver Jackson, with guest psychic Ruth Peacock, played by Dervla Kirwan, travel to a remote spot in Siberia in search of a paranormal story promised them by their host, Yuri, Branko Tomovic. They soon find a deserted industrial site, and as they explore the evil within, it begins to explore them. There can only be one winner. In a downbeat ending the ghost-hunters become ghosts and the ghosts become real in a way we've seen before in plenty of horror films yet if there's nothing startlingly original in Entity there is better than average-horror-film acting, especially from Dervla Kirwan and Charlotte Riley, a really eerie atmosphere throughout, and the disturbing reassurance that there's plenty of life left in the world of ghosts."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Nexus DNA",
         "EM Media"
      ],
      "summaries": ["In 1998, thirty four unidentified bodies were found in shallow graves in a remote Siberian forest. After subsequent investigations, no official explanation by the Russian authorities was ever offered about the circumstances of the deaths. The case was closed. In 2010, a small English TV crew from the show 'Darkest Secrets' set out for the Siberian forest. 'Darkest Secrets' focuses on revisiting the sites of unsolved crimes and they employ the gifts of a psychic whose extraordinary powers may help shed new light on cold cases. The last communication to their production office in London stated that they were approaching the Siberian region where the bodies were found. Nothing was heard from them again. 'Entity' is the story of what happened to them. The forest was only the beginning...."],
      "budget": 0
   },
   "movielensId": 114886,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-10-24",
      "dvdReleaseDate": "2013-06-11",
      "directors": ["Steve Stone"],
      "runtime": 87,
      "movieId": 114886,
      "title": "Entity",
      "mpaa": null,
      "actors": [
         "Dervla Kirwan",
         "Charlotte Riley",
         "Branko Tomovic",
         "Claire Leatherbarrow"
      ],
      "imdbMovieId": "1842356",
      "originalTitle": "Entity",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Zp40HGNkHi4"],
      "plotSummary": "In 1998, thirty four unidentified bodies were found in shallow graves in a remote Siberian forest. After subsequent investigations, no official explanation by the Russian authorities was ever offered about the circumstances of the deaths.",
      "tmdbMovieId": 131887,
      "avgRating": 3.30556,
      "releaseYear": "2012",
      "numRatings": 18,
      "posterPath": "/mcz6whZ00oNn0T6mZ480Y2DhKgO.jpg"
   }
}