{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "penguin",
            "id": 3028
         },
         {
            "name": "telecontrol",
            "id": 3029
         },
         {
            "name": "surrealism",
            "id": 9887
         },
         {
            "name": "betrayal",
            "id": 10085
         },
         {
            "name": "criminal",
            "id": 15009
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "jewel heist",
            "id": 155508
         },
         {
            "name": "claymation",
            "id": 197065
         },
         {
            "name": "wallace & gromit",
            "id": 210009
         },
         {
            "name": "very little dialogue",
            "id": 212412
         }
      ],
      "imdb_id": "tt0108598",
      "video": false,
      "title": "The Wrong Trousers",
      "recommendations": [
         532,
         530,
         14447,
         533,
         53210,
         13930,
         54825,
         11898,
         100246,
         14320,
         52971,
         13925,
         13933,
         10608,
         13927,
         13396,
         53211,
         84893,
         3063,
         678
      ],
      "backdrop_path": "/9tbJCIaQVg2cnUf26NwGMKDyqvh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Wallace",
            "gender": 2,
            "credit_id": "52fe424ec3a36847f8013e1d",
            "name": "Peter Sallis",
            "profile_path": "/8vMFK2SJFzQbtEIj4FU7adyhCGM.jpg",
            "id": 7317,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e19",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e23",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e29",
               "name": "Bob Baker",
               "profile_path": null,
               "id": 7315,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e2f",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013e35",
               "name": "Julian Nott",
               "profile_path": null,
               "id": 7657,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013e3b",
               "name": "Helen Garrard",
               "profile_path": null,
               "id": 937612,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e41",
               "name": "Peter Lord",
               "profile_path": "/fBaZLXX3rBwhSXvtplQEtvW7VS3.jpg",
               "id": 53304,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424ec3a36847f8013e47",
               "name": "Christopher Moll",
               "profile_path": null,
               "id": 937613,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e4d",
               "name": "Steve Box",
               "profile_path": null,
               "id": 7313,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "52fe424ec3a36847f8013e53",
               "name": "Nick Park",
               "profile_path": "/f7MzwTzd2Wu2JjL74R8t7ixVBLN.jpg",
               "id": 7314,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "56291a3d9251414cd50023b5",
               "name": "Peter Salmon",
               "profile_path": null,
               "id": 1246862,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "56291b33c3a368488c0027d9",
               "name": "Jack Stew",
               "profile_path": null,
               "id": 1393300,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "577d2cf69251415d9b000898",
               "name": "Brian Sibley",
               "profile_path": null,
               "id": 592816,
               "department": "Crew",
               "job": "Additional Writing"
            },
            {
               "gender": 2,
               "credit_id": "577d2d2fc3a36817fb00079a",
               "name": "David Sproxton",
               "profile_path": "/zVeJRzQaIvENbOUbhMgP4DkgK7W.jpg",
               "id": 53329,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "577d2e73c3a36817fb00081d",
               "name": "Peter Wignall",
               "profile_path": null,
               "id": 1405798,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "577d2e9c9251415d9800089a",
               "name": "Tony Willis",
               "profile_path": null,
               "id": 1401194,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "577d2ee69251415d9b000964",
               "name": "Tristan Oliver",
               "profile_path": null,
               "id": 53331,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "577d2f05c3a36817fb00084c",
               "name": "Dave Alex Riddett",
               "profile_path": null,
               "id": 1119834,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "577d2f2fc3a36817fb000868",
               "name": "Tamsin Parry",
               "profile_path": null,
               "id": 1120757,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "577d2fcfc3a36817e6000a4d",
               "name": "Jason Wheeler",
               "profile_path": null,
               "id": 24237,
               "department": "Editing",
               "job": "Editorial Services"
            },
            {
               "gender": 0,
               "credit_id": "577d2ffec3a36817e6000a5a",
               "name": "Nic Raine",
               "profile_path": null,
               "id": 557706,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "577d3054c3a36817e3000a0d",
               "name": "Simon Rhodes",
               "profile_path": null,
               "id": 1393351,
               "department": "Sound",
               "job": "Scoring Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.657242,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 531,
      "vote_count": 336,
      "budget": 0,
      "overview": "Gromit finds himself being pushed out of his room and home by a new lodger who is actually a ruthless criminal (and a small penguin). The penguin is planning a robbery and needs to use Wallace and his mechanical remote controlled trousers to pull off the raid. However, Gromit is wise to the penguin and comes to the rescue.",
      "similar": [
         10345,
         9598,
         1429,
         949,
         395990,
         532,
         36208,
         263109,
         530,
         12138,
         64689,
         11004,
         272878,
         471014,
         13377,
         70578,
         10063,
         10710,
         50838,
         47354
      ],
      "original_title": "The Wrong Trousers",
      "runtime": 30,
      "poster_path": "/O3fFWazkIL1QrmH5t9numsUgmR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ykJbf1z5qIreJrHWfnh1ev1alkD.png",
         "name": "Aardman Animations",
         "id": 297,
         "origin_country": "GB"
      }],
      "release_date": "1993-12-17",
      "vote_average": 7.6,
      "belongs_to_collection": {
         "backdrop_path": "/huyrvVKEKa9czUY89fnvaAVAtkX.jpg",
         "name": "Wallace & Gromit Collection",
         "id": 529,
         "poster_path": "/993pCCMO9g9RQUtNDxQgE1B330H.jpg"
      },
      "tagline": "Winner of the 1993 Academy Award for Best Animated Short.",
      "adult": false,
      "homepage": "http://www.wallaceandgromit.com/films/the-wrong-trousers",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Park"],
      "runtime": 30,
      "synopsis": "It's Gromit's birthday, and Wallace presents his friend with 2 gifts: a new dog collar, and a pair of ex-NASA 'Techno Trousers.' Needless to say, Gromit is hardly at all thrilled with these two gifts. While going over the bills, Wallace realizes that they're short on cash, and decides to rent out the spare bedroom. Gromit is surprised when a penguin shows up in answer to the sign out front. Gromit's day is made worse when the penguin decides to take his room instead of the extra bedroom. Wallace tries to make the best of it, trying to help Gromit redecorate the room. Gromit uses the techno-trousers to walk up the walls of the room and repaint the ceiling. As he does so, he notices the penguin watching from the doorway. Later on that evening, Gromit tries to sleep, but the penguin has the radio in his room playing loud music. Unable to cope, Gromit goes outside and to the doghouse out back. Waking up the next day, Gromit is then upstaged as the penguin tries to become overly-helpful, fetching Wallace's slippers and mail. Later on that evening, feeling unwanted, Gromit leaves, with Wallace unaware of his absence. Wallace wakes up for breakfast, only to find himself now wearing the techno-trousers, with it's control panel missing. The trousers then take off with him still attached, running all over town. Gromit meanwhile, is searching for a new apartment, when he sees a wanted poster for a black bird with a red glove on his head. The poster gives the bird's name as Feathers McGraw, and asks 'Have you seen this chicken?'",
      "writers": [
         "Nick Park",
         "Bob Baker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108598/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNjQxNzM0OV5BMl5BanBnXkFtZTcwMTQyNzAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Sallis | See full cast and crew »"],
      "reviews": [
         "Nick Park's hysterical plasticine duo Wallace and Gromit are back in this, their second outing, pitting themselves against the plotting penguine whose devious nature is taking advantage of Wallace's niavity. However, the ever suspicious Gromit is seeing through the Penguine's frosty exterior and sets out to uncover his secret scheming shadowy plan. The Wrong Trousers is the best so far from Peter Lord and Nick Park, putting even the outstanding Chicken Run and Close Shave in it's shadow. The characterisation is simply electrical. The ever suffering but mute Gromit and the clumsy well meaning Wallace muddle their way to stopping a truely outstanding criminal genius penguine (whose pesona is portrayed with such subtlety and effect that the cute bird becomes the very essence of evil). Park and Lord's pace and cinematography in this animation medium are truely world leading, climaxing in the mad mayhem of a train-set chase through their house. The plot is simple yet full of nuances and details (check out the headline's on Wallace's newspaper and the wall paper in Gromit's bedroom)raising this above even the best that that big studios can produce. A film almost without fault which pays homage to the greatest and most farciscal works of the great Ealing comedy era (there is something sinister happening but, it isn't that sinister really). Watch this film and let the quality and clarity of the humour seep into your soul. A true mile-stone of animation which deserved it's oscar like no other animation ever will.",
         "Wallace & Gromit: The Wrong Trousers (1993): Calling this delightful and hilarious Oscar-winning masterpiece (brought to us by Nick Park, co-director of \"Chicken Run,\" one of my all-time favorite films) the best claymation short ever is a lot like saying that someone just bought the best vehicle from a used car lot, so I'll go ahead and call this the best animated short ever, which it definitely is. No questions asked. It's brilliantly shot, paced, scripted, directed...to paraphrase Mary Poppins, it's practically perfect in every way. You can't help but fall in love with every single character on the screen, from our always-lovable cheese-loving inventor and his loyal canine companion to even the devious jewel-thieving penguin Feathers McGraw (the subject of the bestselling \"Have You Seen This Chicken?\" T-shirts). They are so well-rounded that Feathers nearly steals the show; it's impossible to keep a straight face at the sight of a penguin nervously wiping sweat from his brow, disguising himself as a chicken and firing a revolver, all while wearing the same stolid expression in his little peppercorn-black eyes. The wild train ride near the conclusion is a breathtaking segment that will never be topped by any other animation studio in this millennium or the next. I cannot recommend this work of genius enough. If you find anything whatsoever to dislike about it, I suggest seeking professional help immediately. Otherwise, pop this into your video or DVD player, put your feet up and watch this piece of animated history unfold before your very eyes. 10/10",
         "In order to help make ends meet Wallace decides to rent out their spare room. However the new lodger takes Gromit's room and puts him out in the dog house. Meanwhile Wallace continues work on a pair of remote controlled trousers. But is the new lodger as innocent a chicken as he appears? Wallace finds himself part of a major jewel robbery \u0096 can Gromit return in time to save him? The second of the adventures of Wallace & Gromit sees the animation greatly improve and the comedy oh so very sharp and funny. The basic plot is a little silly but very well crafted considering this is a short film \u0096 I wish many `proper' films had plots this clever and imaginative. It is also absolutely a wonder to watch \u0096 even when I wasn't laughing I was easily charmed by the wit and imagination of the whole thing. The animation is superb, Wallace is as good as ever and Gromit is much more fully developed and is easily the star. The penguin however threatens to steal the show as well as the jewel. How can a plastercine penguin with a glove on it's head that likes listening to organ music be threatening? Well it can \u0096 here he snaps his head round and stares with such menace that it's frightening! They all work well together but Gromit takes the film by a nose. With all those brain dead kids cartoons around on TV this should be treasured. Adults will love it as there is plenty of detail for them to enjoy and kids will totally fall for the rich comedy and well animated characters. A wonderful little gem.",
         "The best film of the Wallace and Gromit trilogy, and one of the greatest films, period. Nick Park and the animators at Aardman are some true talents and gifted storytellers. Nick Park has made some great clay stop motion cartoons before, such as Creature Comforts, but with The Wrong Trousers he really topped himself. The technical aspects of the movie are amazing. The noirish lighting, the attention to detail, the small jokes in the background, the camera compositions and the fluid animation (it doesn't have that herky-jerky look of most clay animated films) are awe-inspiring by themselves, but combined with such a witty story and appealing characters the result is something that truly deserves to be called a classic.",
         "This is a clever picture that gets better the more times you watch it. The attention to detail is amazing. It makes you wonder over and over again - How did they do that? I have this on DVD and enjoy taking time to check some segments out frame by frame to catch all the background details like book titles on the shelf and news paper headlines. It's enjoyable for youth and adults alike.",
         "This marvelous short won the Academy Award and is the best of the series, though all so far have been delightful! The praise heaped on Wallace and Gromit has been vast and well-deserved, so my additions are gilding the lily, but I'll still say something. The Wrong Trousers is funny, sad, insightful and just plain mad, frequently all at once. If there's any justice, they will remain in print in perpetuity. Most recommended.",
         "A prodigy of animation, \"The Wrong Trousers\" won the Oscar for best animated short. Nick Park is at fine shape here, as he displays not only the skill of his craft but also a narrative coherence and care that nearly overpasses the artistic talent. It's the advantage of stop-motion animation: each shot is carefully studied and considered, and the story moves forward having Gromit the dog as the main character, and he succeeds all the way in convincing us of his \"acting skills\", even though he doesn't say one word or make one sound. The film has a great plot: Wallace and Gromit are forced to let a room, and a grim penguin applies for it. Soon, the intruder takes over the house and replaces Gromit as Wallace's best friend. But there is more than meets the eye, and the rest of the story is too good to be spoiled. Constructing suspense to the very end, with hair-raising sequences until the last spectacular showdown and applying all the formulae that make a god movie, this is animation on the top of its game, and a great opportunity to see just how much you can raise the bar on claymation short features. Talent has never been so evident.",
         "This is a touching story . When Gromit found himself second to Wallace's affection I thought my heart would break . Poor Gromit , poor poor Gromit as he packs his bags and leaves the house my heart was breaking and the tears were flowing down my cheeks . Did I mention that Gromit is a plasticine dog in an animated movie ? No ? Believe me I'm not some bleeding heart animal loving do gooder - I'm a very prolific IMDb reviewer perhaps the most cynical one on this site and I was totally moved and entertained by this animated film . If I enjoyed it how can anyone else not enjoy it ? THE WRONG TROUSERS is the second and best of the Wallace & Gromit shorts . As with Nick Parks other work the animation where animals have idiosyncratic humanized personalities is superb but its the script co- written by Park and former DOCTOR WHO scriptwriter Bob Baker that is so enjoyable . The plotting and character interaction makes it touching and exciting and even this childless cynic enjoyed every single moment of it If you're a parent and are wondering how to keep the kids quiet for over an hour maybe you should show them an episode from the new DOCTOR WHO series followed by THE WRONG TROUSERS . If that doesn't work as family entertainment nothing will",
         "Together with 'Wallace & Gromit: A Close Shave' and 'Wallace & Gromit: A Grand Day Out' this is one of the funniest things I have seen. The clay animation looks great, the stories are very ingenious and the jokes are great. If you get a chance to see this, please do so. You will have a great time. I guess this one is the best from the three, although 'A Close Shave' comes close. You must see all three of them anyway, so it doesn't really matter.",
         "This was the second in a series of three short BBC programs featuring a man and his dog. With a full-length feature film that came out a dozen years later (just recently in 2005). Wallace & Gromit is now far better-known. But, to those of us who \"discovered\" W&G back in the mid-to-late '90s, they were a fun pair we enjoyed in these three 30-minute shows. \"The Wrong Trousers\" is best at the end with a very funny chase scene inside a toy train set. Earlier, Wallace, the inventor, is trying to invent a pair of remote-controlled trousers. He's a bit short on money so he rents out a room in house. The lodger prefer Gromit's room. Gromit is Wallace's pet dog. The dog is literally put out in the dog house, and is not happy about this. In a crazy series of events, the tenant - an evil penguin - gets Wallace inadvertently involved in a jewel heist and Gromit has to come to the rescue. It's very silly but the unique animated cinematography helps make this a winner."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Crime",
         "Family"
      ],
      "productionCompanies": [
         "Aardman Animations",
         "BBC Bristol",
         "Wallace & Gromit"
      ],
      "summaries": [
         "Plasticine animation of Wallace and Gromit, inventors of all manner of useful devices. Gromit (a dog) finds himself being pushed out of his room and home by a new lodger who is actually a ruthless criminal (and a small penguin). The penguin is planning a robbery and needs to use Wallace and his mechanical remote controlled trousers to pull off the raid. However, Gromit is wise to the penguin and comes to the rescue.",
         "Wallace is used by a criminal penguin in a robbery involving mechanical trousers."
      ],
      "budget": 0
   },
   "movielensId": 1148,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-12-17",
      "dvdReleaseDate": "2006-06-06",
      "directors": ["Nick Park"],
      "runtime": 30,
      "movieId": 1148,
      "title": "The Wrong Trousers",
      "mpaa": "NR",
      "actors": ["Peter Sallis"],
      "imdbMovieId": "0108598",
      "originalTitle": "The Wrong Trousers",
      "genres": [
         "Animation",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["t8T8bStabq0"],
      "plotSummary": "Gromit finds himself being pushed out of his room and home by a new lodger who is actually a ruthless criminal (and a small penguin). The penguin is planning a robbery and needs to use Wallace and his mechanical remote controlled trousers to pull off the raid. However, Gromit is wise to the penguin and comes to the rescue.",
      "tmdbMovieId": 531,
      "avgRating": 4.13139,
      "releaseYear": "1993",
      "numRatings": 17212,
      "posterPath": "/xT2NxRbqnTXYqoVQvKSmkLEm4lE.jpg"
   }
}