{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "charlie chan",
         "id": 159951
      }],
      "imdb_id": "tt0027441",
      "video": false,
      "title": "Charlie Chan at the Race Track",
      "recommendations": [
         38455,
         38460,
         25148,
         33386,
         38458,
         33391,
         28044,
         33393,
         33394,
         33389,
         38461,
         38457,
         38467,
         29328,
         33388,
         33390,
         33395,
         33392,
         38456,
         38470
      ],
      "backdrop_path": "/rs8hgJplmmxkQDw4vRcDgDykHMj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Charlie Chan",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a73",
               "name": "Warner Oland",
               "profile_path": "/cX2gRGvzR0aNcRJs5TSe7Mz2Rsi.jpg",
               "id": 13342,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Lee Chan",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a77",
               "name": "Keye Luke",
               "profile_path": "/sUW8C9x2ir0YTJ81GdiaDQpsx1a.jpg",
               "id": 16103,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Alice Fenton",
               "gender": 1,
               "credit_id": "52fe45139251416c91026a7b",
               "name": "Helen Wood",
               "profile_path": "/8nmu71o0obLt62EQsaX9panNCuh.jpg",
               "id": 120820,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Bruce Rogers",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a7f",
               "name": "Thomas Beck",
               "profile_path": "/15RRU4fwxF0RJ4JloC4YzERe0fE.jpg",
               "id": 120761,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "George Chester",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a83",
               "name": "Alan Dinehart",
               "profile_path": "/zItSFkXyFGu1MInFuLaKNvhooNr.jpg",
               "id": 34348,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Bagley",
               "gender": 0,
               "credit_id": "52fe45139251416c91026a87",
               "name": "Gavin Muir",
               "profile_path": "/i45ZsznjsFHTncfhfSsS7zMNBCC.jpg",
               "id": 42574,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Catherine Chester",
               "gender": 0,
               "credit_id": "52fe45139251416c91026a8b",
               "name": "Gloria Roy",
               "profile_path": "/aaF3ntpCY71g3GBOPfyuZwp72Vt.jpg",
               "id": 119903,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Warren Fenton",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a8f",
               "name": "Jonathan Hale",
               "profile_path": "/ajOXZDy3XsZkZ3OqsMBejg8BFXG.jpg",
               "id": 12502,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Denny Barton",
               "gender": 0,
               "credit_id": "52fe45139251416c91026a93",
               "name": "G.P. Huntley",
               "profile_path": "/heZ2zGeeh8EgH4MG5I6jLqGTvSg.jpg",
               "id": 120821,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Major Gordon Kent",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a97",
               "name": "George Irving",
               "profile_path": "/js2u7KGDeYSKf4eOrVQJxDPfaUP.jpg",
               "id": 13823,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Eddie Brill, Jockey",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a9b",
               "name": "Frank Coghlan Jr.",
               "profile_path": "/3oXHUQDk3rpvWnJpWfWNDD5hesl.jpg",
               "id": 120822,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "'Tip' Collins, Jockey",
               "gender": 2,
               "credit_id": "52fe45139251416c91026a9f",
               "name": "Frankie Darro",
               "profile_path": "/qyS85Cy29MPcWD2GKvMzjD10yhx.jpg",
               "id": 67370,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Mooney, Ship Cabin Steward",
               "gender": 2,
               "credit_id": "52fe45139251416c91026aa3",
               "name": "John Rogers",
               "profile_path": null,
               "id": 22605,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "'Streamline' Jones",
               "gender": 0,
               "credit_id": "52fe45139251416c91026aa7",
               "name": "John Henry Allen",
               "profile_path": null,
               "id": 120823,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Al Meers",
               "gender": 2,
               "credit_id": "52fe45139251416c91026aab",
               "name": "Harry Jans",
               "profile_path": null,
               "id": 120824,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Ship Captain",
               "gender": 2,
               "credit_id": "52fe45139251416c91026aaf",
               "name": "Sam Flint",
               "profile_path": "/6BZmlo6TKRYQORLq3VtaXW3Bmzn.jpg",
               "id": 120736,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Lefty",
               "gender": 2,
               "credit_id": "52fe45139251416c91026ab3",
               "name": "Paul Fix",
               "profile_path": "/5uySf96UVra95Ru24YvbjLuiBS5.jpg",
               "id": 8496,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Waiter on ship",
               "gender": 0,
               "credit_id": "52fe45139251416c91026ab7",
               "name": "Sidney Bracey",
               "profile_path": "/o72gF6HWbCBrm4wBZWgWiP6RYAK.jpg",
               "id": 80546,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe45139251416c91026abb",
               "name": "James Flavin",
               "profile_path": "/quxPBveIsUgat0N8VePdsHpsQnq.jpg",
               "id": 3262,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Lansing",
               "gender": 2,
               "credit_id": "52fe45139251416c91026abf",
               "name": "Selmer Jackson",
               "profile_path": "/uOXVCzDMWcCmzRAbJ8M23Axqg9I.jpg",
               "id": 105810,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45139251416c91026a63",
               "name": "H. Bruce Humberstone",
               "profile_path": "/mHdkYOkKMhIQgrcHmIglB8bwvzz.jpg",
               "id": 87700,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45139251416c91026a69",
               "name": "Earl Derr Biggers",
               "profile_path": null,
               "id": 120531,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe45139251416c91026a6f",
               "name": "Lou Breslow",
               "profile_path": null,
               "id": 34312,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "534530adc3a36825a00014c7",
               "name": "Robert Ellis",
               "profile_path": "/g2yuBzKRWpoiEKShpSZQh1UdXe4.jpg",
               "id": 29347,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "534530c7c3a368258900155b",
               "name": "Helen Logan",
               "profile_path": null,
               "id": 120464,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "534530dec3a36825b10014b3",
               "name": "Edward T. Lowe Jr.",
               "profile_path": null,
               "id": 30409,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "534530fac3a36825b10014ba",
               "name": "Saul Elkins",
               "profile_path": null,
               "id": 111417,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.367549,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33387,
      "vote_count": 11,
      "budget": 0,
      "overview": "When a friend of Charlie's is found kicked to death by his own race horse on board a Honolulu-bound liner, the detective discovers foul play and uncovers an international gambling ring.",
      "similar": [
         6037,
         33391,
         25148,
         33392,
         28044,
         66592,
         33394,
         29328,
         38458,
         38467,
         38472,
         38470,
         38457,
         33393,
         38464,
         47571,
         33708,
         55603,
         33388,
         38455
      ],
      "original_title": "Charlie Chan at the Race Track",
      "runtime": 70,
      "poster_path": "/oE1RQaF8nf8KrvnupZQdIXDD6rt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1936-08-14",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/9bE62qBanBFtoiIc9cXjk1xW3w.jpg",
         "name": "Charlie Chan (Warner Oland) Collection",
         "id": 38451,
         "poster_path": "/AjeNyhodinrMkNlAfZRkaYUIm79.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["H. Bruce Humberstone"],
      "runtime": 70,
      "synopsis": null,
      "writers": [
         "Robert Ellis",
         "Helen Logan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0027441/",
      "coverLink": null,
      "actors": ["Stars: Warner Oland, Keye Luke, Helen Wood | See full cast and crew »"],
      "reviews": [
         "I always enjoy the byplay between Charlie Chan and his kids. Warner Oland was more loving to them in the early Chans while Sidney Toler was more insulting (but not in a mean-spirited way.) In this episode, Oland lets Keye Luke get very involved in the case and Luke provides a number of laughs along the way. This was an interesting script and had a decent number of action scenes along with it during the 70 minutes. There are some inventive twists to the story, regarding the crooks, too. This is another Charlie Chan winner, and I am pleased to see it will be out on DVD in December.",
         "This film begins with Chan in Honolulu giving a forensics lecture to policemen. However, Lee Chan (Charlie's \"Number One Son\") interrupts to announce that \"the big race is about to begin and I've got a hot tip\"--at which point all the cops turn on the radio and begin cheering. Oddly, the race is being held in Australia and I find it hard to believe the people in Hawaii would care THAT much! Later, when the horse is on its way to the West Coast of the US, the ship with the horse is met by Charlie Chan since the man who raised the horse has been killed and he was a friend of Chan. Although it appears that he was kicked to death by his prize horse, Charlie quickly deduces that it was murder! It seems that a gambling syndicate is heavily involved in murder and mayhem in an attempt to make a huge haul at an upcoming race and it's up to Charlie to unravel it all and make sure the guilty pay. Compared to other Chan films, this one has a much better plot, though the plot has been used, in part, before. While complex, the plot is quite thrilling and does a lot to help the film. Additionally, the best of the Chan sidekicks, Number One Son ('Lee') is on hand to provide some comic relief and occasional assistance. Excellent acting, pacing and plot--this one is a triple crown winner of a B-movie.",
         "When favored race horse Avalanche loses a race due to his rider's foul, his owner Major Gordon Kent becomes suspicious, believing that a gambling syndicate may have been behind the rider's actions. Kent calls upon famed detective Charlie Chan (Warner Oland) for his involvement, and it's off to the races so to speak. Unfortunately Kent, who has come too close to identifying the conspiracy, winds up dead in Avalanche's stable aboard ship heading for Los Angeles. Number #1 Son Lee Chan (Keye Luke) signs on as a cabin boy for the cruise ship to legitimize his presence, and quickly joins his \"Pop\" in the investigation. Charlie relies on Lee a bit more than we've seen in prior films, trusting him to drop phony threatening letters to the principals introduced in the film, which include Kent's son in law George Chester, now Avalanche's owner; Warren Fenton, owner of rival horse Gallant Lad; and gambler Denny Barton. When a fire in the hold of the ship is deliberately set to cause confusion, horse trainer Bagley switches the two horses. The tip off comes from an unlikely source - stable boy Streamline Jones has a pet monkey that favors Gallant Lad, but causes Avalanche to react violently. The ever observant Oriental Detective picks up on this immediately, and schemes to reverse the animals to their rightful identities before the day of the Santa Juanita Handicap, their next scheduled race. With Avalance the faster horse, and Gallant Lad a 20 to 1 underdog, the brains behind the gambling syndicate hope to cash in big when their ringer winds up in the winner's circle. Adding to the intrigue, the race timekeeper who's part of the syndicate has a back up plan to insure Gallant Lad's victory. He rigs one of the timing devices at the three quarter mile mark with a dart which will be used on any lead horse ahead of Gallant Lad. The dart does in fact disrupt Avalanche's timing, but he goes on to win the race anyway. With the syndicate foiled, the only thing left to do is for Chan to expose the mastermind. This he does with his usual cool demeanor, even though it means exposing Major Kent's son in law - \"Truth sometimes like stab of cruel knife.\" Currently, \"Charlie Chan at the Racetrack\" appears to be the most highly regarded Chan film on the IMDb website. Allowing for personal preferences, I found it to be one of the better Chan entries, although I feel Warner Oland's adventures in London and Shanghai are more intriguing, along with Sidney Toler's portrayal in \"Murder Cruise\". As for Number #1 Son Lee, he breathlessly bursts onto the final scene with news for Charlie (after the case has been solved) - \"Hey Pop, I have another clue!\" Charlie wisely advises: \"Save for next case, please.\"",
         "The tragic story of Phar Lap the great Australian thoroughbred who was imported to the Northern Hemisphere and poisoned by gamblers seems to be the basis for this Charlie Chan film. It's a bit happier an ending for the horse Avalanche who is the focus of the investigation. Which starts in Charlie Chan At The Racetrack in Melbourne where Avalanche has just won the Melbourne Cup as did Phar Lap. Despite threats from a gambling syndicate, owner George Irving is bringing him to America to race at Santa Anita. On the ship bringing Avalanche and his stablemate Gallant Lad to America, Irving is kicked to death by his horse when he visited him in his shipboard stall. When the ship docks in Honolulu Warner Oland goes on board along with son Keye Luke to investigate. Oland establishes that the horse was not the guilty party pretty quickly, but the problem of the gamblers and whatever nefarious scheme they have in mind is still there. They've even got a backup plan which almost works when it is put into play. Let's say like the real life Phar Lap, Avalanche is a game horse with a great heart. Charlie Chan At The Racetrack is one of the best of Charlie Chan features. Other than the patronizing stereotypical portrait of the black groom the film holds up well for today's audiences.",
         "An interesting film with much in its favor, especially the team of Oland and Luke. I particularly like the scenes aboard ship en route from Honolulu to the mainland. Keye Luke has many funny scenes. A fair portion of the beginning of the film involves the other characters before Chan gets involved in the mystery. This makes it seem more like one of the Earl Derr Bigger's novels. This film makes a good double feature with the Marx Brothers' film, \"A Day At The Races\".",
         "Charlie Chan at the Race Track is a very solid entry in the series. In this one, one of Chan's old friends is killed on a ship sailing from Australia to Honolulu. The doctor rules the death an accident resulting from a kick to the head by his prize race horse. Chan notices some things that don't quite add up and is able to convince his superiors that the death was not an accident, but murder. Chan is soon caught up in a world of race horses and gambling syndicates as he looks for a killer. I really can't complain about much of anything. The plot here is interesting with enough twists and turns to keep you guessing until the very end. It helps that son Lee Chan is on hand to shine the light of suspicion on all of the characters at every opportunity. Speaking of Lee, Keye Luke is one of the real stars of this episode. Luke was never funnier than in Charlie Chan at the Race Track. Warner Oland is as solid as ever. He probably as more physical moments than in any Chan film I can remember, getting shot at twice and throwing a punch of his own. The supporting cast is generally quite good. I've gotten to where I could watch Jonathan Hale in just about anything - he's always good. The less said about the character Streamline, the better. The sets and costumes (high hats included) look nice, the cinematography sparkles, and the direction is snappy. Overall, a very solid effort.",
         "This 'Charlie Chan' movie, like so many others, picks a background for its 'usual' complicated murder mystery that's very attractive and familiar for a lot of people: horse racing. The scent of the stables, the sight of the 'noble animals', as Charlie calls them, the excitement of the race itself - that alone must be enormously stimulating for a big part of the audience. But, unfortunately, just like with prizefighting and so many other sports, along with horse racing many times comes - the gambling racket. Because there are millions at stake just for that great little moment when the first horse crosses the finishing line... And the great favorite of the season is 'Avalanche', who belongs to Charlie's old friend Major Kent. But, at the big Australian racing event, although he wins he is disqualified for a foul - which obviously was caused intentionally by his jockey. That makes Major Kent suspicious - and a few days later, during the sea voyage to the USA for the next big race, Kent is found dead, allegedly killed by his own horse's kicks; but Charlie Chan has got a different theory: murder! Of course, there are lots of suspects and strange events that make the plot twist more and more; and besides, a whole gambling ring is a VERY powerful enemy... Will Charlie, with the help of 'number one son' Lee (who provides us with some magnificently comical scenes here, first as a ship's steward and then as a laundry boy!), be able to track down the racketeers AND to find his friend's murderer? A great, suspenseful, intricate mystery, with NO lack of entertainment whatsoever!",
         "Charlie Chan's old friend is murdered after he threatens to break up a racehorse gambling ring. Charlie investigates and finds lots of suspicious characters involved. Seems like every one of the popular movie detectives from the '30s and '40s eventually had a case involving horse racing. This one mixes the horse racing backdrop with that of an ocean liner mystery. This is a lesser but still enjoyable entry in the series. Possibly the \"worst\" of the Oland Chan movies, which says a lot about how good the series was. Keye Luke is still great fun as \"Number One Son\" Lee. Unfortunately there is also a cowardly stablehand character named Streamline that will be pretty offensive to modern audiences. Thankfully, he's not in the movie a lot. All of the suspects in this one are slimy. It was hard guessing who the killer was because they all seemed capable of it.",
         "If you've read my title you'll know you're going to hear praise for this Chan entry. You should know this is the one Chan film I could watch over and over and never tire of it. The entire Chan series is great, but this entry is perfect in my view. Charlie's old friend Major Gordon Kent, former owner and promoter of champion race horse Avalanche, is killed after getting too close to a gambling syndicate responsible for his horse's defeat in its latest race. Chan is called in when Kent's ocean liner reaches port in Honolulu. What initially is believed to be an accidental death blamed on Avalanche stomping Kent to death is quickly proved to be murder by the clever Chan. As the ocean voyage continues on to Los Angeles, Chan (along with #1 son Lee) come aboard to try and solve the murder before the horse's next race in California. As Chan closes in on the killer (and the gambling syndicate) his life and the life of his son are put into jeopardy. Despite all this will Chan and son stop the syndicate's ultimate plan from succeeding, and will justice be found for Kent's murder? It all comes to a whirlwind conclusion as Chan finally solves the puzzle and figures out the many angles of this mystery. This entry is such a good one because it contains so many elements of my favorite Chan films. We have Chan and #1 son working as a team, a good portion of the story takes place on a passenger ship, the movie beginning in Honolulu but ending in another part of the world, there are more than one angles involved with the murder only playing a piece of the bigger puzzle, Gangsters, cool action sequences, a great cast and director, a romantic diversion... everything that I have liked about previous entries wrapped up into one, and neatly done as well. For my money, this is the gold of an already great film series. If you like Chan films, or great classic mystery movies from this era in Hollywood, watch this one!",
         "Charlie Chan (Warner Oland) and son Lee Chan (Keye Luke) become involved \"At the Race Track,\" from 1936. When a friend of Charlie's is murdered by his race horse on board ship, Charlie is asked to investigate when the ocean liner stops in Honolulu. Looking at the horse's stall, Charlie doubts the horse had anything to do with it -- this was a human's doing. His investigation continues, and Charlie and Lee board ship and travel to Santa Anita raceway to continue their investigation. He soon discovers fraud and a nefarious gambling ring, and he has to ferret out a murderer. This is a very lively and fun Charlie Chan, with Lee posing as an attendant on the ship to find the typewriter on which threatening notes were typed; and later, at a crucial point, he drives a Chinese laundry truck. Charlie, meanwhile, is shot in the leg and laid up for part of the film. Some excellent racing footage and beautiful horses are also shown. It's not perfect. A horse falls, and I absolutely hate seeing that. They would trip them with chicken wire, and it was quite cruel. The second and more egregious thing, particularly by today's standards but I think it might have been embarrassing even then, was the role of the black stable boy, done as a Stepinfetchit type character. Cringe-worthy. Frankly, I liked it much better when Mantan Moreland came on as Birmingham. First of all, he was hilarious, and secondly, he was treated as an equal. Yes, he had some scenes where he was supposedly afraid of his shadow, but it was better than what is in this film. Oland is a warmer Chan than Sidney Toler, though both brought a great deal to the role. There is something a little less intimidating about Oland. \"Charlie Chan at the Race Track\" is very enjoyable, somewhat reminiscent of the Sherlock Holmes story \"Silver Blaze\" -- so that's probably why the story is so good."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery",
         "Sport",
         "Thriller"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "While steaming from Honolulu to Los Angeles the owner of a prize racehorse headed for the Santa Anita Handicap is killed, apparently kicked to death by his stallion. Not so, deduces Charlie. Later he exposes efforts to fix a race at the famous track.",
         "When the favored horse unexpectedly loses an Australian race under suspicious circumstances, the sportsman-owner, a friend of Charlie's, returns to the States with the thoroughbred via steamship. After the millionaire is found kicked to death in the horse's stall, Chan investigates when the liner stops off in Honolulu and discovers evidence of foul play. When Charlie uncovers fraud involving other races in Los Angeles, he is able to expose an international gambling ring as well as the murderer.",
         "When a friend of Charlie's is found kicked to death by his own race horse on board a Honolulu-bound liner, the detective discovers foul play and uncovers an international gambling ring."
      ],
      "budget": 0
   },
   "movielensId": 115247,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-08-14",
      "dvdReleaseDate": "2006-12-05",
      "directors": ["H. Bruce Humberstone"],
      "runtime": 70,
      "movieId": 115247,
      "title": "Charlie Chan at the Race Track",
      "mpaa": "",
      "actors": [
         "Warner Oland",
         "Keye Luke",
         "Helen Wood",
         "Thomas Beck",
         "Alan Dinehart",
         "Gavin Muir",
         "Gloria Roy",
         "Jonathan Hale",
         "G.P. Huntley",
         "George Irving",
         "Frank Coghlan Jr.",
         "Frankie Darro",
         "John Rogers",
         "John Henry Allen",
         "Harry Jans",
         "Sam Flint",
         "Paul Fix",
         "Sidney Bracey",
         "James Flavin",
         "Selmer Jackson"
      ],
      "imdbMovieId": "0027441",
      "originalTitle": "Charlie Chan at the Race Track",
      "genres": [
         "Mystery",
         "Comedy",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When a friend of Charlie's is found kicked to death by his own race horse on board a Honolulu-bound liner, the detective discovers foul play and uncovers an international gambling ring.",
      "tmdbMovieId": 33387,
      "avgRating": 3,
      "releaseYear": "1936",
      "numRatings": 2,
      "posterPath": "/oE1RQaF8nf8KrvnupZQdIXDD6rt.jpg"
   }
}