{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0040427",
      "video": false,
      "title": "He Walked by Night",
      "recommendations": [
         21296,
         29998,
         36522,
         37482,
         47312,
         22924,
         20675,
         30624,
         41234,
         35006,
         28023,
         22342,
         38751,
         21336,
         18262,
         20362,
         61908,
         27999,
         43812,
         43191
      ],
      "backdrop_path": "/gKid6ohUtqZphz07N72VyP45cl8.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55699a4c9251416b04001549",
         "content": "Lone bandit evades police clutches.\r\n\r\nThis is a true story...\r\n\r\nIt's known to the Police Department of one of our largest cities as the most difficult homicide case in its experience. Principally because of the diabolical cleverness, intelligence and cunning of a completely unknown killer.....The record is set down here factually-as it happened. Only the names have been changed to protect the innocent.\r\n\r\nCracking little noir picture this one. Richard Baseheart is Davis Morgan, a cold and calculated thief and murderer. He is not only unknown to the police, but also to the Los Angeles underworld. Something which made him a terrifying ghost on the streets. Based on the real life case of cop-killer come thief Erwin Walker, who in 1946 struck terror into the heart of LA, He Walked By Night zips along at a frenetic pace but maintains all the darkness requisites of the Film Noir genre. Directed by Alfred Walker (aided by one uncredited Anthony Mann) and also starring Jack Webb (who used the piece as inspiration for the popular \"Dragnet\" TV series), the picture has excellent use of shadows and a brilliant finale down in the Los Angeles drainage system. Where the sound of guns and running feet is just ferocious. \r\n\r\nBaseheart is suitably chilling as a man coming unhinged by the day, whilst a home surgery sequence shows Baseheart to have had no small amount of ability. It's notable with Morgan's character that it's people he just doesn't like, there's a very telling scene with his dog that is sweet but at the same time saying so much about the man himself. This film reminded me very much of Edward Dmytryk's similarly fine 1952 film, The Sniper. So much so I'd say that as a double bill they be perfect for each other. With added plot worth in the form of early police forensics (check out the photo fit technique) and a largely unknown support cast adding a raw reality to proceedings, He Walked By Night comes highly recommended to fans of the Noir and Crime genres. 8/10",
         "url": "https://www.themoviedb.org/review/55699a4c9251416b04001549"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Roy Martin / Roy Morgan",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f85",
               "name": "Richard Basehart",
               "profile_path": "/EwbxGHlgK2nojHYGu5A3mpxFd2.jpg",
               "id": 5403,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Police Sgt. Marty Brennan",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f89",
               "name": "Scott Brady",
               "profile_path": "/2JlQcMIbISvcQjtO4iIB1yZSqwW.jpg",
               "id": 14847,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Police Captain Breen",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f8d",
               "name": "Roy Roberts",
               "profile_path": "/zKGk6q2As8QFkE4V0OHD3JmF4yA.jpg",
               "id": 19400,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Paul Reeves",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f91",
               "name": "Whit Bissell",
               "profile_path": "/aOe39nPJuZpGYGR3WuRo5PiYGwK.jpg",
               "id": 13786,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Police Sgt. Chuck Jones",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f95",
               "name": "James Cardwell",
               "profile_path": "/cH5FOr9Lyigsatz1Raa7iI5PfSv.jpg",
               "id": 104996,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Lee Whitey",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f99",
               "name": "Jack Webb",
               "profile_path": "/sSLkACb1nFagCycJKrS7r1Yk9z8.jpg",
               "id": 8634,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Narrator (voice) (uncredited)",
               "gender": 2,
               "credit_id": "52fe44879251416c91013f9d",
               "name": "Reed Hadley",
               "profile_path": "/rZDPiDU6RLPirjUYDo0K5Gf7Qyg.jpg",
               "id": 34046,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Pete Hammond",
               "gender": 2,
               "credit_id": "5950607b9251413127054972",
               "name": "Frank Cady",
               "profile_path": "/1st0r0fw1GfB7RRE7GJzbDkkP00.jpg",
               "id": 93622,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Dunning",
               "gender": 0,
               "credit_id": "5950608fc3a36832bd05449b",
               "name": "Thomas Browne Henry",
               "profile_path": "/2TVfKY4IcY9C7J8kXx3bCdCUVLX.jpg",
               "id": 82748,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Milk Customer",
               "gender": 1,
               "credit_id": "595060a6925141311f056231",
               "name": "Dorothy Adams",
               "profile_path": null,
               "id": 3346,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f4b",
               "name": "Alfred L. Werker",
               "profile_path": "/4B0LohF5Fj01lBPgqLKc7P1oJSr.jpg",
               "id": 81930,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f51",
               "name": "Anthony Mann",
               "profile_path": "/9uc4d2GGoHBRLeAqsZJpwJX4S8x.jpg",
               "id": 40199,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f57",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f5d",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f63",
               "name": "John C. Higgins",
               "profile_path": null,
               "id": 52589,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f69",
               "name": "Harry Essex",
               "profile_path": null,
               "id": 67686,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f6f",
               "name": "Bryan Foy",
               "profile_path": null,
               "id": 33019,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f75",
               "name": "Robert Kane",
               "profile_path": null,
               "id": 109709,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f7b",
               "name": "Leonid Raab",
               "profile_path": null,
               "id": 9102,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013f81",
               "name": "John Alton",
               "profile_path": "/2T1IJWguIJicQD2dw0SqzoVAYxa.jpg",
               "id": 96252,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c91013fa3",
               "name": "Alfred DeGaetano",
               "profile_path": null,
               "id": 103359,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.088287,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31556,
      "vote_count": 24,
      "budget": 0,
      "overview": "This film-noir piece, told in semi-documentary style, follows police on the hunt for a resourceful criminal who shoots and kills a cop.",
      "similar": [],
      "original_title": "He Walked by Night",
      "runtime": 79,
      "poster_path": "/f320FLY4I5A1MukCEuikMnwMdoh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bryan Foy Productions",
         "id": 5229,
         "origin_country": ""
      }],
      "release_date": "1948-11-24",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Savage TRUTH! Stronger than Fiction!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": [
         "Alfred L. Werker",
         "Anthony Mann"
      ],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Crane Wilbur",
         "Crane Wilbur"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040427/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MTc3MjU4Ml5BMl5BanBnXkFtZTcwMjYwMzQyMQ@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Basehart, Scott Brady, Roy Roberts | See full cast and crew »"],
      "reviews": [
         "Most hardcore film buffs probably don't know that \"He Walked By Night\" is one of the most influential and important movies ever made. Literally. It is an accurate account of the 1947 manhunt for the most cunning criminal in the history of the Los Angeles Police Department. \"He Walked By Night\" is a turning point in the detective movie, displaying the real-life police procedures used in searching for a criminal, which include teamwork and technology, and showing far more realistic characters than other flicks did. Other movies of this era showed phony, daring detectives engaging in shoot-em-ups with criminals while wooing a woman. \"He Walked By Night\" captures reality in a stark and startling way, with excellent black-and-white photography from John Alton. Though Scott Brady was probably too young (24) as the lead detective in this movie, his realistic performance is a welcomed relief from the over-the-top camp performances from actors in other detective movies, such as Dick Powell's in \"Murder My Sweet\" and Alan Ladd's in every one of his detective movies. The realistic technique of this movie was so innovative, that Jack Webb (who has his first good-sized role in this movie) used this technique in making his 1940s radio show \"Dragnet.\" When he brought \"Dragnet\" to television in 1951, the style of the show influenced countless other shows, launching realistic police drama in television. This realistic style is very noticeable in TV shows today, such as \"Law and Order,\" and \"NYPD Blue.\" As influential as \"He Walked By Night\" was, it is also a finely acted, finely directed, well-written, and intense police movie. It is being re-released on DVD under \"The Great Cops Movies,\" so don't miss it.",
         "I've seen this film two or three times, and I keep wondering Why did \"Roy\" do any of the things he did? What was his motivation? Strangely, we aren't even offered a guess by anyone in the film. Intrigued by the statement that the film is \"based on a true story,\" I did some research. Apparently the real-life Roy was named Erwin Walker -- aka \"Machine Gun\" Walker. Honest. Walker was indeed a World War II vet, a former Glendale PD radio dispatcher, and a brilliant student at Cal Tech. The true story is even better than the film: Walker wasn't killed by police, and managed to evade the death penalty with a plea of insanity. Better yet, he was subsequently released, and has lived, somewhere, among us. You can read a first-person account of Walker here (as long as the link remains good): http://www.epinions.com/content_3817054340 .",
         "HE WALKED BY NIGHT (1948) has such a raw, bare-bones feel to it, a real \"you are there\" aura. A cheerless loner (Cold as an ice bomb Richard Basehart) kills a policeman. The search of the killer begins. This little B-film has so many unforgetable scenes, they drive in one after the other. (The police picking up every vagrant in the city searching for the cop killer, the look on the targeted cop's wife's face when she gets the bad news) My favorite scene is one that does not move the plot along, but creates such an uncomfortable mood. In it, Basehart tries to fish a bullet out of his arm at his sink as his dog yaps and whines in the background. Well worth catching.",
         "Based on a true 1946 Hollywood Police Department case, \"He Walked By Night\" is an early attempt at a \"police procedural\" film. It has a semi-documentary look combined with many of the conventions of film noir (thanks partly to cinematographer John Alton). Many of the outside scenes were filmed in or around actual locations. Richard Basehart plays a loner who is well-versed in electronic technology, guns, and police procedures. He's able to stay one step ahead of the cops because his paranoia and attention to detail keep him in a constant state of alert. It's also helpful that he listens in with his police-band radio. For a time he confounds the Hollywood cops because he changes his modus operandi. He begins as a break-in artist who steals electronic equipment, but when he kills a suspicious young policeman and loses some of his tools, he turns to armed robbery of liquor stores. Nobody can find him because he travels through Los Angeles in its underground storm drains, where he has hidden stashes of guns and other survival equipment. We also follow the cops as they make use of whatever little information they're able to gather on Basehart's character, and slowly they do close in after several missed opportunities and track the killer into the storm drains, where the play of light and shadow really takes over. One of the cops in \"He Walked By Night\" is played by Jack Webb, and there's no question he got the inspiration for 'Dragnet\" from this film. For starters, \"He Walked By Night\" begins with a sky pan of Los Angeles and scenes of everyday Hollywood while the narrator gives a kind of \"this is the city\" speech. The police scenes are often very quotidian (sometimes to the point of being overly detailed), with cops tossing in small talk like \"how's the missus? glad to hear it\" before they ask other questions. Much of the pacing, attitude and overall feel of \"Dragnet,\" which began as a radio show a year after this film and then moved to TV in 1952, is already here. The final scene in Los Angeles' storm drains (\"seven hundred miles of hidden highways,\" according to the narrator) provides probably this film's most memorable images. Its set-up and execution are remarkably similar to Orson Wells being chased through the sewers of Vienna in Carol Reed's \"The Third Man,\" which was filmed a year later and likely inspired by \"He Walked By Night.\" And who knows, it might also have given a few ideas to the makers of \"Them\" a couple of years later when they revisited the L.A. storm drains with their giant ants. Ultimately, Basehart's character remains an enigma. We never learn that much about him. \"He Walked By Night\" isn't a great film, but it's an enjoyable look at postwar police work and primitive forensics.",
         "So, I have this film to thank for the series \"Dragnet.\" Certainly, \"Law & Order\" also had its start with this wonderful \"B\" movie. The production is quite good, with excellent performances, and great location filming. Many users have questioned this film's technique, implying it is hokey or cliché. That is certainly missing the point. THIS FILM STARTED the whole genre, in a way. And, keeping in mind that this was not produced by a major studio, I am quite satisfied with its quality. \"Film noir\"? Perhaps......although it shares the look, more than the concept of that genre. I recommend this film.",
         "Not as good as hyped, this film noir, however, is still interesting and suspenseful. It's full of good film noir photography with lots of nighttime shots with many shadows, not only outdoors but indoors and even in the Los Angeles sewer system! I recommended getting the Anthony Mann DVD pack so you get the best picture quality. With all that darkness, you need to see this on a good transfer. Mann is an uncredited director for this film, or at least a co-director. John Alton, the cinematographer who worked with him on a couple of other film noirs, did the camera-work and he was one of the best. Richard Basehart plays a convincing no-conscience killer. He as very interesting to watch all the way through. It also was entertaining to see a young Jack Webb play a forensics-type cop. This was his pre-Dragnet television show period but this was a good vehicle for his cop work. In fact, this movie even had a Dragnet feel to it with some kooky minor characters, such as the lady talking to the milkman/cop. This movie dragged a big in the middle but overall was entertaining enough to recommend, especially to film noir fans. Just make sure you see this with a good print.",
         "Wryly directed understated film is an example of Alfred Werker's underrated genius at its best. Basehart is magnificent as a crook who gets in over his head. Scott Brady and Roy Roberts are equally good in their roles. And the redoubtable Whit Bissell is on hands for a key supporting role.",
         "Richard Basehart shoots down an LAPD officer one night after the offduty patrolman stops him for some suspicious activity. The officer who paid with his life had every reason to be suspicious, Basehart was attempting to break into an electronics store. The shooting sets off a manhunt that takes more than a month. Captain Roy Roberts and Detective Scott Brady lead the investigation which takes both men into some unexpected places in trying to track down the culprit. This was Richard Basehart's breakthrough role in He Walked By Night. He plays a really diabolical stone cold killer in this one who apparently has no liking for humans. His only companion in the world is a dog. This clever little noir thriller is done in the documentary style that seemed to be in vogue after World War II. I'm also sure that the final chase scene through the storm drain must have inspired Carol Reed to put it in The Third Man where the idea got more notice. The lack of really big name stars gives this film a realistic approach. Look for Jack Webb in a supporting role as a police lab technician. I Don't doubt he got the idea for Dragnet from working on He Walked By Night.",
         "As related on http://www.adam-12.com/webb.htm ... - quote - In 1949, Jack landed the role of Lt. Lee Jones in the film \"He walked by Night.\" After meeting LAPD Sgt. Marty Wynn, a technical advisor for the show, Jack got the idea to develop Dragnet after being invited to review LAPD case files. - end quote - Several elements associated with _Dragnet_ appear already in _He Walked_: not only the stolid narration but also the devotion of time to routine and even futile work, the interviewing of oddballs, the explication of technology, and the incidental chit-chat about the family. One interesting point is that we never get to find out the killer's motive: even at the expense of the audience's aesthetic satisfaction, the killer's point of view is denied to us. The only lessons we can learn from the movie are the lessons that the police learn.",
         "This film was full of veteran actors, Richard Basehart,(Roy Martin/Roy Morgan; Scott Brady(Sgt.Marty Brennan) brother of former film star,Lawrence Tierney \"Dillinger\". Jack Webb, was very young and thin in this picture, he was married to Julie London who starred in the film,\"The Red House\" with Edward G. Robinson. Jack Webb used all the equipment they had in the 1948's and even had some good CSI theories as a Crime Lab expert. This 1948 keeps you spellbound and keeps you guessing throughout the entire picture. The black and white film makes it even more chilling and mysterious. View it if you can, you won't be sorry!"
      ],
      "genres": [
         "Crime",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Bryan Foy Productions"],
      "summaries": [
         "In the Post-World War II, in Los Angeles, a criminal shots and kills a police officer in the middle of the night. Without any leads, the chief of the LAPD assigns Sgt. Chuck Jones and Sgt. Marty Brennan to investigate the murder and apprehend the culprits. When the dealer of electronics devices, Paul Reeves, is caught selling a stolen projector, the police identifies the criminal, and connects him to other unsolved robberies. Using the witnesses of his heists, they draw their face, but the true identity of the smart and intelligent criminal is not disclosed. The perseverance of Sgt. Marty Brennan in his investigation gives a clue where he might live.",
         "When a police officer is gunned down by a man whom he had stopped to question, a city-wide dragnet fails to catch the shooter, leaving the police with only minor clues to go on. Later they discover that the same man has been selling stolen equipment through an electronics dealer, and they set a trap for him. But he shoots his way out of the trap and escapes. The police must piece together a description of the man's appearance and habits from witnesses and a few small clues, as they search untiringly for a dangerous and very resourceful criminal.",
         "This film-noir piece, told in semi-documentary style, follows police on the hunt for a resourceful criminal who shoots and kills a cop."
      ],
      "budget": 0
   },
   "movielensId": 1152,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-11-24",
      "dvdReleaseDate": "2003-06-24",
      "directors": [
         "Alfred L. Werker",
         "Anthony Mann"
      ],
      "runtime": 79,
      "movieId": 1152,
      "title": "He Walked by Night",
      "mpaa": "NR",
      "actors": [
         "Richard Basehart",
         "Scott Brady",
         "Roy Roberts",
         "Whit Bissell",
         "James Cardwell",
         "Jack Webb",
         "Reed Hadley",
         "Frank Cady",
         "Thomas Browne Henry",
         "Dorothy Adams"
      ],
      "imdbMovieId": "0040427",
      "originalTitle": "He Walked by Night",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["nwoZmxmgkbw"],
      "plotSummary": "This film-noir piece, told in semi-documentary style, follows police on the hunt for a resourceful criminal who shoots and kills a cop.",
      "tmdbMovieId": 31556,
      "avgRating": 3.46448,
      "releaseYear": "1948",
      "numRatings": 183,
      "posterPath": "/f320FLY4I5A1MukCEuikMnwMdoh.jpg"
   }
}