{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "psychiatrist",
            "id": 15106
         }
      ],
      "imdb_id": "tt0058977",
      "video": false,
      "title": "Blindfold",
      "recommendations": [],
      "backdrop_path": "/unNlipZJXL7xD9umhsxzTzrSw0B.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Bartholomew Snow",
               "gender": 2,
               "credit_id": "52fe4cdbc3a36847f8241d0b",
               "name": "Rock Hudson",
               "profile_path": "/reiGa8Kj40Mg9A23Emg6tp9qkm.jpg",
               "id": 18735,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Vicky Vicenti",
               "gender": 1,
               "credit_id": "52fe4cdbc3a36847f8241d0f",
               "name": "Claudia Cardinale",
               "profile_path": "/trBLcdRy1jr6DJ46aV28UrG2ObW.jpg",
               "id": 4959,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "General George Pratt",
               "gender": 2,
               "credit_id": "52fe4cdbc3a36847f8241d13",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "James Fitzpatrick",
               "gender": 2,
               "credit_id": "5688a132c3a36860e90255da",
               "name": "Guy Stockwell",
               "profile_path": "/kUT8VPWDVTOvgyhHf29w2ggCIJx.jpg",
               "id": 93655,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Miss Smith (\"Smitty\")",
               "gender": 1,
               "credit_id": "5688a149c3a368227b01a6e0",
               "name": "Anne Seymour",
               "profile_path": "/qulq6eZtU5qVPn2bxnOUu4AM4HK.jpg",
               "id": 40233,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Arthur Vincenti",
               "gender": 2,
               "credit_id": "5688a167c3a3684be9024237",
               "name": "Alejandro Rey",
               "profile_path": "/1a763Tm8ErU65MfF1nUDEhxq2B5.jpg",
               "id": 83851,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Harrigan",
               "gender": 2,
               "credit_id": "5688a176c3a368362800d94c",
               "name": "Brad Dexter",
               "profile_path": "/4IJA7Ne7V79VZHjGn5U2FjWwHzW.jpg",
               "id": 14529,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Michelangelo Vincenti",
               "gender": 2,
               "credit_id": "5688a19792514169d0010a20",
               "name": "Vito Scotti",
               "profile_path": "/pN3aRdEF78xyCHsZrju56FO12wK.jpg",
               "id": 82779,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. Bob Berford",
               "gender": 2,
               "credit_id": "5688a1b4c3a3684bcc027184",
               "name": "Ted Knight",
               "profile_path": "/32OrUdfeRgxmtkbnYbxYDvGoAJs.jpg",
               "id": 71146,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Lavinia Vincenti",
               "gender": 1,
               "credit_id": "5688a1cc9251412e52023e25",
               "name": "Angela Clarke",
               "profile_path": "/cAYP8CNTjIt1TXQDTc67kPJhsnb.jpg",
               "id": 89215,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mario Vincenti",
               "gender": 2,
               "credit_id": "5688a1e0c3a36860e9025607",
               "name": "John Megna",
               "profile_path": "/36YhNk83ZoPESHzZHwC5AKjn2oP.jpg",
               "id": 8490,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Lippy",
               "gender": 2,
               "credit_id": "5688a1f09251417e6300d146",
               "name": "Ned Glass",
               "profile_path": "/3H3OFQohDcX2TQ9bKhwWpfL6HxI.jpg",
               "id": 18870,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Davis",
               "gender": 2,
               "credit_id": "5688a20d9251417e6300d14b",
               "name": "Hari Rhodes",
               "profile_path": "/j3oQPReGHOU4kS1oc0cwGGoK4pK.jpg",
               "id": 98797,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Henchman",
               "gender": 2,
               "credit_id": "5688a2239251414ecb016b8f",
               "name": "Mort Mills",
               "profile_path": "/1KmPkFX992nBkDBPzg5QoWB8v4K.jpg",
               "id": 45525,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Henchman",
               "gender": 2,
               "credit_id": "57d065f892514173ac001bee",
               "name": "Jack De Mave",
               "profile_path": "/6sOVFlSIHfir8NyrAAj6iAL3P6j.jpg",
               "id": 248050,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cdbc3a36847f8241d19",
               "name": "Philip Dunne",
               "profile_path": null,
               "id": 116326,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "531cda0792514177b1005e30",
               "name": "Lucille Fletcher",
               "profile_path": null,
               "id": 87754,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "57d0633bc3a3681624001a26",
               "name": "Charles Horvath",
               "profile_path": "/t89JjyDeQmx2hXjqYHoSAtEojcM.jpg",
               "id": 151463,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "58070add9251415ab00122ea",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58070af49251415a860112f6",
               "name": "Joseph MacDonald",
               "profile_path": null,
               "id": 30288,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58070b00c3a3684e8b010b6e",
               "name": "Ted J. Kent",
               "profile_path": null,
               "id": 2920,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58070b1592514170b7018403",
               "name": "Robert Arthur",
               "profile_path": null,
               "id": 30103,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58070b269251415bec011125",
               "name": "Marvin Schwartz",
               "profile_path": null,
               "id": 117411,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58070b2f9251415a86011313",
               "name": "Ernest B. Wehmeyer",
               "profile_path": null,
               "id": 1590561,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.299723,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 169066,
      "vote_count": 3,
      "budget": 0,
      "overview": "A patient being psychoanalyzed by Dr. Snow is a government scientist. General Pratt hides him in a secret place known as \"Base X,\" forcing Dr. Snow to wear a blindfold whenever he is taken there ...",
      "similar": [
         275,
         8067,
         36955,
         562,
         681,
         341013,
         14869,
         27576,
         101,
         207703,
         4723,
         4771,
         1724,
         253,
         954,
         37834,
         37724,
         2832,
         1571,
         203801
      ],
      "original_title": "Blindfold",
      "runtime": 102,
      "poster_path": "/yNhsAWp560XryMo4rA4gqKmz5bO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1965-12-22",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Behind the Blindfold is the Greatest Security Trap Ever Devised!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philip Dunne"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Philip Dunne",
         "W.H. Menger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0058977/",
      "coverLink": null,
      "actors": [
         "Rock Hudson",
         "Claudia Cardinale",
         "Jack Warden"
      ],
      "reviews": [
         "This is a pleasant mystery thriller with some light comedic moments and as such is typical of a lot of movies made in the same period of the middle to late sixties, most with one word titles such as this one has. Partly inspired by the popularity of the stylish \"Charade\" of a few years earlier, and more obviously influenced by Hitchcock, this is a mixed group of films with often middle aged or lesser known actors in the lead. This one has a biggie: Rock Hudson. He plays a psychiatrist with the wonderfully slick, Hollywoodish name of Bartholomew Snow, who gets in trouble up to his ears and, more to the point, eyeballs, when one of his patients turns out to be a prominent scientist who's being trailed some rather unsavory characters. Hudson's ably supported by the luscious Claudia Cardinale, and the two make a very attractive couple. Also good is the late Jack Warden in a key role, and Guy Stockwell as a man who stutters. There's really no need to go much further into the plot except to say if one is in the mood for stylish, anodyne entertainment, this is a good one to catch. It has good credentials, too: directed by Philip Dunne, from a Lucille Fletcher story, photographed by the legendary Joe MacDonald. Though not on the Hitchcock level, the movie exudes class. While I wouldn't call this a brilliant film, it never insult the viewer's intelligence.",
         "This thriller/comedy never reaches great heights but is solidly entertaining throughout and that is more of an achievement then one might give it credit for. To be sure, the plot elements and romantic element of two people who can't stand each other for most of the film but eventually fall in love has been done a million times before in various films over the years. But usually, films containing these elements come across as hackneyed, tiresome and dreary in some shape or form but Blindfold never feels like that and is consistently good fun throughout its journey. Credit for that must go to Hudson and Cardinale who work well as a team and Hudson is especially effective in the film's more comic moments. Jack Warden is reliably effective in his supporting role. While Blindfold is no classic on any level the solid entertainment it provides is something Hollywood consistently struggles to achieve to this day in films created for that purpose. If you want to see a really bad example of this genre, see the abysmal pseudo-hip caper comedy A Fine Pair starring Hudson and Cardinale again which is a disaster on all levels.",
         "I've seen this mystery/comedy on one of the cable channels, a few years ago. I believe it's a Universal picture, and it may be one of those movies that the studio hasn't gotten around to putting out on VHS or DVD. It's not bad as a film, and I hope that it comes out on digital in the years ahead. Rock Hudson is his usual self in this film, playing his typical cool guy/nice guy self in trying to figure out who the good guys/villains are. And this movie did keep me guessing till the very end. Nice movie",
         "Strongly influenced by Alfred HItchcock's spy thrillers (\"north by northwest\" \" the man who knew too much\"...etc) ,\"Blindfold \" shares with them the same vagueness as far as the political stakes are concerned. There are villains who kidnapped a scientist ,period.Sometimes ,the viewer does not know who the villains are anymore.And the movie shows some humor ,when it seems everything is unauthorized and when the cop lies down on the psychiatrist's coach.Besides the movie is proof positive that mules are clever .Claudia Cardinale keeps her slightly hoarse voice (apart from Italian,she is also fluent in French) and her pairing with Hudson is odd,but why not?The movie is never dull and although it is far-fetched to a fault -Hudson finding the way back to the House - it's good entertainment . But if you have not seen Hudson's precedent movie -one of his favorites- \" Seconds\"(Frankenheimer) ,made the same year,you'd better choose that one.",
         "This was once a mainstay of top movies for TV, but has since become forgotten, a victim of being one of the better movies. The older movies shown now are picked by the same people who have money in new movies, so they won't show good competition. This one had Rock Hudson playing a likable psychiatrist who becomes involved in espionage, treating a man who is a high level security risk. He is taken to the location several times, always blindfolded, and later, he must retrace his steps when he realizes something has gone wrong. A beautiful girl also has an interest in finding this location, and she builds a relationship with Rock, who does a great acting job of a heterosexual. Lots of great action, some of it before it's time. When this film was made, textbooks still claimed that no alligator ever killed a human being. Alligators become a major force here. There are lots of interesting bits, especially with the transportation the pair use in the swamp, \"Henry\". Enjoyable, and has all the classic attributes great movies have, without a lot of fanfare and big all star cast (although there are a few fairly big names). Well directed, and lots of fun.",
         "Good fun entertainment by Rock Hudson and Claudia Cardinale. As always Jack Warden does a nice job in a support role. When Hudson is kidnapped he makes note of the things he hears on the way to the kidnappers hideout. He is able to help the police track down the kidnappers following the sounds. To this day this movie stands out in my mind because of them noting the geese sounding like people at a party. Grab some popcorn and enjoy it if you are lucky enough to catch an airing of this on TV.",
         "Blindfold is a clever and entertaining film with an interesting moral to it about some folk's paranoid obsession with security. As lead Rock Hudson plays a psychiatrist he's in a perfect position to diagnose the problem. Can he find a cure though when security is compromised? Hudson's practice includes some of New York's society bigwigs and he's quite the lady's man within that set. But one day he gets a call from a general in civilian attire played by Jack Warden who wants him to treat a former patient of his who is now a government scientist and who has had a nervous breakdown. But we can't let the Commies or anyone else know about it. So Hudson is flown a couple hours to an old mansion where Alejandro Rey is being held and he does his psychiatrist thing and he's blindfolded as well. Two other people are concerned, Claudia Cardinale as Rey's sister who is telling the world about her brother's kidnapping and in point of fact he was. And there's the stuttering Guy Stockwell who convinces Hudson that Warden is a fake. A great deal of the film is spent with poor Hudson trying to get answers to questions with no one 'authorized' to tell him. So who is real and who is fake, Warden or Stockwell? That you see the film for. Blindfold is a delightful comedy and suspense film in the Hitchcock tradition. As is the mark of a good film, supporting the charming leads is a flawless cast of memorable performances. Besides those I've already mentioned there is Anne Seymour as Hudson's secretary, Brad Dexter as a thick as a brick NYPD detective, Vito Scotti and Angela Clarke as Cardinale and Rey's parents and a mule named Henry who gives the plot a kick in the right direction. For fans of Rock Hudson and those who will be after seeing Blindfold.",
         "I saw this movie many years ago and yet I have never forgot it. If it comes out on DVD I will probably buy it since Rock Hudson, Claudia Cardinale, and Jack Warden did good characterizations. The sets and music add to the suspense. The movie moves along and has some interesting moments like when Rock Hudson tries to relocate the place he was taken blindfolded. Interesting how geese and people laughing sound similar. This one is rarely on TV so rent it if you can or buy it.",
         "Claudia Cardinale is the only possible reason to watch this film. She is absolutely gorgeous. The film is all over the place not knowing whether to be deadly serious or slapstick. Kidnap and murder on the one hand, then Rock Hudson fighting the bad guys with a canoe stuck on his head and then fending them off with a fire extinguisher whilst sat on a rocking horse. It made Henry \"the ornery Mule\" look the most dignified character and the most intelligent too. But the mere sight of Miss Cardinale!",
         "Channel 5 TV in Britain showed this film today 09/12/05 and I was very taken and surprised what a delightful and deftly made film it was/is. It was entertaining and though not deep you always sensed that all was not what it appeared to be and there would be a sting in the \"tale\". Being blindfolded would never seem to portend a good omen a would always be an indication of undergoing a pretty serious experience though it's a way of you not seeing too much so that it may possibly portend eventual survival . Seeing blindfolded men these days seem to be a prelude for having your head sawn off whilst still alive, a la Iraq, so there is always in this situation which carries a serious thread even it is interwoven with a comic touch and a dry sense of humour as is this film and the film is a success: an accomplished weave of dynamic and contrasting interplay of humour and seriousness: walking that particular tightrope is an act were you can easily fall off long before you reach the finish at the other end: too much rope for some films but this one skips there easily.",
         "Rock Hudson (Dr Bartholomew Snow) is a psychologist who is approached by Jack Warden (the General) to treat important scientist Alejandro Rey (Arthur Vincenti) who has been recently taken to a secret location for matters of National importance. This means that Dr Rock can only be transported to his patient while blindfolded so that he is kept unaware as to the scientist's hiding place. Claudia Cardinale plays the missing scientist's sister who suspects Dr Rock of being involved in her brother's kidnapping but then teams up with him to track down the scientist. All Dr Rock has to go on are the sounds that he has heard on the several journeys that he has made to him. Dr Rock and Claudia Cardinale set out on their adventure but there are others on the trail - stuttering Guy Stockwell (Mr Fitzpatrick) and bumble-brained detective Brad Dexter (Harrigan). I'm not sure what is so important about this scientist or why people are suddenly interested in capturing him. The film's premise is that if he falls into the wrong hands, the enemy will be able to unlock his brain. He is on the verge of a nervous breakdown so only psychology can save him! However, up to this point, it seems that no-one has really felt the need to capture him. Why now? He seems like an unpleasant sort of fellow so the most effective cure would be to tell him to snap out of it or he's going into the swampy waters with the quicksands and alligators. Another dodgy part of the film which isn't dwelt upon is the rather unhealthy past-time of Claudia's uncle Vito Scotti (Michaelangelo) who makes mannequins of her and dresses them up in underwear! I think that's the crime that needs investigating not the silly scientist storyline. Rock Hudson keeps us watching as the story unfolds but the film is nothing special. The cast are all fine, apart from the curiosity that is Claudia Cardinale's diction. She speaks by stressing the wrong parts of every word so that she sounds as if she is putting on a deliberate Mexican accent with her already noticeable Italian accent. She is also given unrealistic dialogue for a foreigner, eg, \"cock-eyed stunt\" (3 times!) and \"Bluebeard\". This is not natural language that a non-native speaker would casually work into a conversation. She does have some great clothes, though, a sign of the times, particularly a stylish green outfit when she is in the park, where she reminded me of my mother (who also spoke English with a foreign accent - Portuguese). She also has a funny moment when she steps out of a van into a swamp. Another stupid part of the story comes during a swamp chase sequence where Rock and Claudia get out of a predicament by using 2 mannequin lookalikes of Rock Hudson!! Where on earth did they suddenly spring from!!?? Of course, they must have been carrying them around with them throughout the whole swamp chase sequence but the audience just never noticed. It's a comedy-thriller where everyone functions according to plan and clever use is made of the sound of geese. It's true - they sound like people laughing at a party. That's something I will take away from this film. That along with Claudia looking like my mum and the boy John Megna (Mario) playing Chinese Chequers. I've never seen Chinese Chequers in a film before.",
         "When Alfred Hitchcock made \"North by Northwest\", it was so successful that the studios wanted him to make another movie in the same style. However Hitchcock wanted to move on saying, \"Style is merely self-plagiarism\". Nevertheless, Hollywood loved the ingredients in \"North by Northwest\" and attempted many variations on the theme: \"Charade\", \"Arabesque\", \"Caprice\" and \"Blindfold\", which got as close as any. Psychiatrist and playboy, Dr Bartholomew Snow, is enlisted by national security chief, General Pratt (Jack Warden), to help the recovery of Arthur Vicenti, a top scientist suffering from a mental breakdown. Vicenti is in danger from an organisation that kidnaps and sells scientists to the highest bidder. Snow, who never loses his sangfroid for a moment, is blindfolded and taken to a secret location for his meetings with Vincenti, but returns to his practice in New York so that nothing appears out of the ordinary. When Vicenti's sister, showgirl Vicky Vicenti, comes looking for her brother, she and Snow become involved along with enemy agents of varying degrees of intelligence. Eventually it all ends up in the Florida Everglades with alligators, airboats, quicksand and Rock and Claudia in a clinch at the fadeout. By this stage of his career, Rock Hudson was as smooth as Cary Grant, but how sexy was Claudia Cardinale in \"Blindfold\"? There is a scene in her dressing room where she wears a see-through costume with the only nod to modesty being a sprinkle of strategically placed sequins and some feathers. Claudia Cardinale was never likely to be first choice for Shakespeare, but she was such a stunning presence that it didn't matter if she wasn't totally projecting the Stanislavski Method. Although Rock could give powerful performances, he just about phoned this one in. However it's really all he needed to do and he had great comedic timing; I love his reaction when his secretary catches him in his office playing with Vicky's knee. There is a stupid fight scene with Rock using a fire extinguisher, but the clever sequence where he retraces the route when he was blindfolded makes up for it. For those who liked \"North by Northwest\", \"Blindfold\" blended the same basic ingredients well.",
         "This comedy thriller needs to be seen to be believed. It's half mystery/half Three Stooges, and a stunning look at Central Park in the mid 1960's. Rock Hudson is a noted psychiatrist, approached by Jack Warden in the middle of the park, and asked to assist him with a former patient. But there's more to it than meets the patient's closed file, as we find out when the former patient (Alejandro Rey) tries to strangle him, and later when a hot tempered dancer (Claudia Cardinale) arranges for a rather abrupt encounter with him along the Central Park bridal path, overlooked by the Dakota. The encounter reveals to Hudson that more is going on than he was initially lead to believe, but Hudson manages to keep one step ahead of her, eventually breaking the ice until Warden demands that he breaks it off with her. But there's no way that's going to happen, leading to twice as much intrigue, verbal humor and physical pratfalls, and enough trips through Central Park to keep a pedicab in business for six months. The many paths and bridges of Central Park almost become like characters, and much of it remains unchanged. But a good movie set in a popular city needs much more than just location to make a good film, and much of that involves not only the scenery but the farce as well. One sequence in the middle of a long gone storage house near the reservoir actually has Hudson swinging around with a canoe over his shoulders, ultimately spraying his enemies with paint. It's all very finny, but this makes it seem closer to a Bugs Bunny cartoon than a 60's thriller. There's some fun supporting performances by well known character players, especially Anne Seymour as an Eve Arden like secretary who obviously tells boss Hudson how to run his office. I guarantee that you won't be bored, but you'll be laughing at it, not just with it.",
         "The original poster of this film read in big characters: \"Behind the blindfold is the greatest security trap ever devised!\" These formulaic promotional campaigns can kill a movie, as in this case, an above average comedy drama that today is almost forgotten. Better than one could expect, considering that Philip Dunne as a filmmaker was not among the best visual stylists from New York, \"Blindfold\" benefits from his talent for words and structure. He was a very good scriptwriter and for this comedy he wrote a fine script with clever dialogue (with the collaboration of theater instructor and writer W.H. Menger) for an above average mystery thriller based on a novel by Lucille Fletcher, the author of the famous radio plays \"Sorry, Wrong Number\" and \"The Hitch Hiker\". Rock Hudson might not have been as solid an actor as others who in the early 60s were in similar films (as Cary Grant in \"Charade\" or Gregory Peck in \"Arabesque\" and \"Mirage\"), but he excelled in romantic comedies and there's a good amount of elements from this sub-genre in \"Blindfold\", sharing screen time and space with Claudia Cardinale, who also knew how to be very funny. As a matter of fact I prefer Hudson paired with beautiful brunette leading ladies of European origin (Gina Lollobrigida, Paula Prentiss, Leslie Caron, Elizabeth Taylor, Jean Simmons and Claudia) than with Doris Day or Julie Andrews. Recommended.",
         "Aside from all too few location scenes of Manhattan in 1964, the movie \"Blindfold\" is a low-budget affair that wastes the acting talents of all involved in this movie. One scene stands out for me, as Rock Hudson's character is talking to the general, played by Jack Warden. They are supposedly flying in a turboprop airplane, yet their seats face each other, the window is covered by a long curtain and you see no one else, not even the pilot. Just a studio set, Universal wouldn't spring for filming in a mock up of a real plane or even in a real small plane. As usual throughout this movie, director Philip Dunne does an abysmal job staging the scene. What is surprising to me is that Joseph MacDonald, the director of photography, does such as bad job lighting up this scene and most of the movie outside of the scenes in Central Park. DP MacDonald usually was aces, as in westerns like \"Rio Conchos\" and \"Alvarez Kelly.\" The less said about the story, the better. This movie was co-writer Dunne's last screenplay and he quit while he was at the bottom. I still can't figure out why everyone made such a big deal about kidnapping the scientist, there is no explanation of what he was working on. Beautiful Claudia Cardinale wanders about the movie looking upset. In a chase scene at the end through a swamp, she wears a tight blouse that the director makes sure never gets wet, don't want to show too much of her assets. The one word that describes this movie is \"tired.\" No one wanted to do more then turn out about ten reels of film. Flat lighting, cheap sets, badly edited chase scenes and dull characters. Rock Hudson as a famous psychiatrist who has a problem with his girlfriend? This movie was a good way for Hudson to prepare for his later career on his series \"McMillan & Wife,\" where cheap production values, bad lighting and shoddy writing were the norm for that 1970s series. Except for the fine actors in this movie, I can't think of one positive thing to say about \"Blindfold.\""
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "7 Pictures"
      ],
      "summaries": [
         "Dr. Bartholomew Snow, a psychiatrist, is treating a man with emotional problems who, it turns out, is a brilliant scientist being pursued by different international powers and their operatives. Snow soon finds himself caught in the middle and out of desperation, he falls in with a mysterious and beautiful woman named Vicky Vincenti. But is she helping him, or is she yet another sinister figure out to manipulate him?",
         "A New York psychiatrist is solicited by government agents in connection with a former patient of his who also happens to be a scientist wanted by certain foreign powers."
      ],
      "budget": 0
   },
   "movielensId": 115692,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-12-22",
      "dvdReleaseDate": null,
      "directors": ["Philip Dunne"],
      "runtime": 102,
      "movieId": 115692,
      "title": "Blindfold",
      "mpaa": "",
      "actors": [
         "Rock Hudson",
         "Claudia Cardinale",
         "Jack Warden",
         "Guy Stockwell",
         "Anne Seymour",
         "Alejandro Rey",
         "Brad Dexter",
         "Vito Scotti",
         "Ted Knight",
         "Angela Clarke",
         "John Megna",
         "Ned Glass",
         "Hari Rhodes",
         "Mort Mills",
         "Jack De Mave"
      ],
      "imdbMovieId": "0058977",
      "originalTitle": "Blindfold",
      "genres": [
         "Thriller",
         "Comedy",
         "Crime",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A patient being psychoanalyzed by Dr. Snow is a government scientist. General Pratt hides him in a secret place known as \"Base X,\" forcing Dr. Snow to wear a blindfold whenever he is taken there ...",
      "tmdbMovieId": 169066,
      "avgRating": 3.25,
      "releaseYear": "1965",
      "numRatings": 2,
      "posterPath": "/yNhsAWp560XryMo4rA4gqKmz5bO.jpg"
   }
}