{
   "tmdb": {
      "original_language": "fa",
      "keywords": [],
      "imdb_id": "tt1846445",
      "video": false,
      "title": "A Cube of Sugar",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "5468ef37eaeb816b52001406",
            "name": "Seyyed Reza Mir-Karimi",
            "profile_path": null,
            "id": 1168560,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.424668,
      "production_countries": [],
      "id": 102851,
      "vote_count": 5,
      "budget": 0,
      "overview": "Throughout the two days preceding her long-awaited wedding, amid the flurry of arriving relatives and the preparation of a seemingly endless array of colorful, culinary delights, young bride-to-be Pasandide finds herself the center of attention. The event also proves an occasion for extended family to reconnect, reminisce and rejoice in the pleasures of familiar company. The family compound of aged Uncle Ezzatolah proves an ideal site for this summer reunion among three generations, with its lush courtyard gardens, labyrinthine parlors and passageways and erratic electrical system (subject to untimely city blackouts).",
      "similar": [],
      "original_title": "یک حبه قند",
      "runtime": 116,
      "poster_path": "/fS7aOd9o8l928qZha4sUCCaiVTA.jpg",
      "spoken_languages": [{
         "name": "فارسی",
         "iso_639_1": "fa"
      }],
      "production_companies": [],
      "release_date": "2012-02-29",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Reza Mirkarimi"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Mohammad Reza Gohari",
         "Reza Mirkarimi"
      ],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt1846445/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2OTMwMzc2Nl5BMl5BanBnXkFtZTcwODc5NjQyNw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Reza Kianian, Negar Javaherian, Farhad Aslani | See full cast and crew »"],
      "reviews": ["In his latest dramatic comedy, acclaimed Iranian filmmaker Reza Mirkarimi narrates pretty much a different story which happens in a beautiful old house in an old Iranian city. Where different members of a big family are gathering for the wedding ceremony of the youngest sister, Pasandideh. Spilling over with light and energy, in its very early minutes the movie becomes a delightful day dream, full of nostalgic elements. For those many Iranians who feel trapped in modern style of life, Mirkarimi succeeded beautifully depicting the very dream they have in common: Back to hometown-to childhood. Grandsons whispering about a ghost in an old barn, sisters joking about the handsome boys they had around when they were girls living there, fruits floating freely in the old pool somewhere at the middle of garden, colorful lights all around the green yard, noisy kids playing everywhere and Pasandideh trying to catch a ripe red apple while soaring on a wooden swing and just everything an old house needs to be awesome. And yet it doesn't take much for the sorrow to seep into the garden, to turn that sweetness to quite a different taste and that gathering to quite a different kind. wedding ceremony becomes a funeral. The cube of sugar doesn't taste that sweet anymore, yet it's still \"a cube of sugar\", a life. Pasandideh's uncle, who, in absence of her father was also the father somehow, who wasn't very pleased with her marrying to the absent groom, passes away, in a very unusual but simple way. The waves of sorrow hit more touching, when the bride shows up in her new clothes, black ones. despite its simple nature, the movie doesn't let the viewer to get enough of it. not enough time to think on many things that happen around, like Naser's talking to his doctor about his cancer, like Hamid's failing to find the treasure in the old barn. No extra time to catch up, just like the life. And finally love, in it's most pure recrudescence shows up and becomes the main line of the story. sorrow fades as Pasandideh's old lover steps in to the garden, however in black, however deeply sad. \"Ghasem\", Pasandideh's cousin, has a lot to tell her. Dressed in army uniform, he somehow promises to \"stay there\" however his virtue doesn't let him talk directly. Ghasem is the man who the decedent uncle wanted to be called as groom that night and his death gave him another chance to be the real lover, not the outsider one who talks on skype and sends Iphone as the gift. The movie ends, simply as Pasandideh turns lights off one by one, as the soothing music plays on uncle's old radio, which Ghasem were trying to fix before leaving. pretty much what one would expect from a story that happens in a classic context of this kind. pretty much well worth watching."],
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [],
      "summaries": ["The story happens in an old house in an old city of Iran. Because of the wedding of the youngest sister, Pasandide, all of her sisters come to their old house to help their mother."],
      "budget": 0
   },
   "movielensId": 115756,
   "movielens": {
      "languages": ["فارسی"],
      "releaseDate": "2012-02-29",
      "dvdReleaseDate": null,
      "directors": ["Seyyed Reza Mir-Karimi"],
      "runtime": 116,
      "movieId": 115756,
      "title": "A Cube of Sugar",
      "mpaa": "PG-13",
      "actors": [""],
      "imdbMovieId": "1846445",
      "originalTitle": "یک حبه قند",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Throughout the two days preceding her long-awaited wedding, amid the flurry of arriving relatives and the preparation of a seemingly endless array of colorful, culinary delights, young bride-to-be Pasandide finds herself the center of attention. The event also proves an occasion for extended family to reconnect, reminisce and rejoice in the pleasures of familiar company. The family compound of aged Uncle Ezzatolah proves an ideal site for this summer reunion among three generations, with its lush courtyard gardens, labyrinthine parlors and passageways and erratic electrical system (subject to untimely city blackouts).",
      "tmdbMovieId": 102851,
      "avgRating": 3.35714,
      "releaseYear": "2012",
      "numRatings": 7,
      "posterPath": "/fS7aOd9o8l928qZha4sUCCaiVTA.jpg"
   }
}