{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "babysitter",
            "id": 2604
         },
         {
            "name": "based on short film",
            "id": 13000
         },
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "attempted suicide",
            "id": 155793
         },
         {
            "name": "uncle niece relationship",
            "id": 165913
         }
      ],
      "imdb_id": "tt3060492",
      "video": false,
      "title": "Before I Disappear",
      "recommendations": [
         187864,
         94025,
         33544,
         14495,
         83125,
         214140,
         276908,
         157289,
         287855,
         192393,
         61416,
         155006,
         122445,
         141635,
         43193,
         69040,
         150707,
         169860,
         90041,
         57602
      ],
      "backdrop_path": "/kTAEVMZUGnE9GD5aJvsZ5Na9XbG.jpg",
      "revenue": 8251,
      "reviews": [{
         "author": "Dan_Tebasco",
         "id": "5926b59fc3a368787001ee0e",
         "content": "Good film, part dark comedy, part drama with a dash of mystery sprinkled on top.\r\n\r\nAbout a man in the middle of commiting suicide when his sister calls asking him to look after her daughter for the night.\r\n\r\nNot to be confused with JUST BEFORE I GO which is also about a suicidal guy but in that one played by SEAN WILLIAM SCOTT and this one stars a mister SHAWN CHRISTENSEN. JBIG is slightly more comedic where as this one is slightly more dramatic and more realistic. Both are well worth seeing though.",
         "url": "https://www.themoviedb.org/review/5926b59fc3a368787001ee0e"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Richie",
               "gender": 0,
               "credit_id": "52fe4e759251416c91132463",
               "name": "Shawn Christensen",
               "profile_path": "/wB2Vgdqikyb2RTvLH7JM3BrCBmw.jpg",
               "id": 234817,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sophia",
               "gender": 0,
               "credit_id": "52fe4e759251416c91132467",
               "name": "Fatima Ptacek",
               "profile_path": "/hMbpi8qmhGI8utHCa8pgzG72TLk.jpg",
               "id": 1099603,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe4e759251416c9113246b",
               "name": "Emmy Rossum",
               "profile_path": "/cFGVEMOjKyVLkCSVdKYMy9UqHBD.jpg",
               "id": 4730,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gideon",
               "gender": 2,
               "credit_id": "52fe4e759251416c9113246f",
               "name": "Paul Wesley",
               "profile_path": "/arhkjiCDzV9GxwKWIqBt095tnna.jpg",
               "id": 83141,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe4e759251416c91132473",
               "name": "Ron Perlman",
               "profile_path": "/xZyrXT2iEmSOokQRc1hedmxrbTi.jpg",
               "id": 2372,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bruce",
               "gender": 2,
               "credit_id": "52fe4e759251416c91132495",
               "name": "Richard Schiff",
               "profile_path": "/gHFxL7MIGvmcbg5hhTNrbjIttQN.jpg",
               "id": 31028,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e759251416c91132479",
               "name": "Shawn Christensen",
               "profile_path": "/wB2Vgdqikyb2RTvLH7JM3BrCBmw.jpg",
               "id": 234817,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e759251416c9113247f",
               "name": "Shawn Christensen",
               "profile_path": "/wB2Vgdqikyb2RTvLH7JM3BrCBmw.jpg",
               "id": 234817,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e759251416c91132485",
               "name": "Shawn Christensen",
               "profile_path": "/wB2Vgdqikyb2RTvLH7JM3BrCBmw.jpg",
               "id": 234817,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e759251416c9113248b",
               "name": "Damon Russell",
               "profile_path": null,
               "id": 1038655,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e759251416c91132491",
               "name": "Lucan Toh",
               "profile_path": null,
               "id": 1292103,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "557596659251413fd2003bed",
               "name": "Terry Leonard",
               "profile_path": null,
               "id": 160532,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "557596a0c3a36838d3008ef6",
               "name": "Paul Wesley",
               "profile_path": "/arhkjiCDzV9GxwKWIqBt095tnna.jpg",
               "id": 83141,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "557596b7c3a368234e0042dd",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "55c130a9c3a36823c9002c5f",
               "name": "Darren Morze",
               "profile_path": null,
               "id": 1018757,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "586ab051c3a3686e21001e08",
               "name": "Daniel Katz",
               "profile_path": null,
               "id": 1731561,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57c3bf5ec3a3680c45003d40",
               "name": "Andrew Napier",
               "profile_path": "/ayBgEciG3vN4bLSmJft10GgHh7u.jpg",
               "id": 1314543,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57c3bf68925141170b0001cc",
               "name": "Damon Russell",
               "profile_path": null,
               "id": 1038655,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.800074,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 253254,
      "vote_count": 75,
      "budget": 0,
      "overview": "Based on the 2013 Academy Award® winning short film 'Curfew'. At the lowest point of his life, Richie gets a call from his estranged sister, asking him to look after his eleven-year-old niece, Sophia, for a few hours.",
      "similar": [
         11474,
         769,
         18487,
         1429,
         968,
         311,
         9475,
         44214,
         76025,
         269795,
         167073,
         154400,
         169917,
         290764,
         194662,
         160588,
         406997,
         244786,
         241239,
         86829
      ],
      "original_title": "Before I Disappear",
      "runtime": 100,
      "poster_path": "/3gyglAKTe1yFzxg9BBioIphHPZp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Strongman",
            "id": 55143,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fuzzy Logic Pictures",
            "id": 19724,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Wigwam Films",
            "id": 55144,
            "origin_country": ""
         }
      ],
      "release_date": "2014-10-11",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://curfewfilm.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shawn Christensen"],
      "runtime": 93,
      "synopsis": "Richie is so stressed out with all the combinations of missing his girl Vista, out of a job, and most dominantly drugs consumption effects. He knows that this can out right be his last day to live due to being out of money to get more durgs. Suddenly his distanced sister Maggie calls, yelling at him asking for a favor to pick up her daughter Sophia from school. Richie and Maggie haven't contacted each other for about five years. But Richie agrees to help. Looking dosed, he picks up Sophia, who immediately emits a very non-friendly aura on him. Richie goes home after Sophia tells him he can do so. At home he finds out that his friend wrongly supplied menopausal treatment pills to him. Maggie calls her again, furious to know that Richie left Sophia alone. Richie then picks up Sophia and takes her away from Maggie's apartment on Maggie's orders due to her being arrested. He tells Sophia that he used to draw cartoon on flip books. One of the characters he created was named Sophia, which Maggie really liked. Richie doesn't want Sophia In his place, so he takes her to other places instead. He takes her to a bowling alley but she prefers to do her homework there. The alley's owner Gideon asks Richie about Gideon's girl, to which he doesn't answer completely honestly. Richie then takes Sophia to his ex apartment to retrieve his old flip books but the visit terrifies her. Sophia is calmed after seeing the flip book. Richie's drug effects takes a toll on him as he suddenly bleeds. Sophia rushes to save him and succeeds. Richie takes Sophia while he meets his drug seller Bill. He remembered seeing Gideon's girl dying on Bill's toilet. He immediately takes Sophia out of there. As Sophia asks, Richie explains the distanced relationship between him and Maggie. Richie takes Sophia back to Maggie's place as Sophia asks. He cant get in because the guards there kick him out due to property distraction earlier that day. He goes to Gideon and tells the truth. He then goes back home and imagines Vista again. This makes absolutely no sense.",
      "writers": ["Shawn Christensen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3060492/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU2MjY1MjA1NV5BMl5BanBnXkFtZTgwOTk2MDMxMzE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Shawn Christensen, Fatima Ptacek, Emmy Rossum | See full cast and crew »"],
      "reviews": [
         "I give this an 8 and I don't do it lightly. I'm also not rating it highly as an indie, it's good compared to any project. This movie is absolutely haunting. The writer has a deep understand of people and displays them so realistically. I really liked the fact that it didn't have cliché characters. The \"gangsters\" don't do what you expect them to do. The things people did in this movie weren't over the top, it felt very real. The cinematography and shots were fantastic in this movie. It was at times like a dream or an acid trip and it never felt out of place. The transitions between hallucinations and real life were not stark and abrupt like in other movies where someone is tripping. Shawn Christensen is going to be the director to watch out for in the future. The casting was perfect. Everybody was good. I just dislike Ron Perlman because he gets cast in this type of role in so many movies that it's starting to be a cliché, still he was great. Christensen is also a great writer. This movie was at once deeply sad and entertaining. Casting Fatima Ptecek as Sophia was perfect. She was the pillar of light for Richie's darkness and she was just a delight to watch. There really is something special about Ptecek. She's the next Abigail Breslin.",
         "I saw this film at NorthEast Film Festival in NJ and from the moment this film started I was swept up and there is not a second that your mind wanders, every second of this film is visually stunning and diverse. You can't help but root and fall in love with Richie (Shawn Christensen) as he struggles through the evening's events. The dynamic between him and Sophia (Fatima Ptacek) is like catching lightning in a bottle, they make a fantastic duo. Fatima does a wonderful job of transitioning the younger Sophia from 'Curfew' to a more mature Sophia in 'Before I Disappear'. Even though the story is about a lot struggles and heartache, there are moments that have you laughing out loud. Each supporting character to Richie and Sophia's journey is so well cast. Paul Wesley as Gideon is simply phenomenal, as he creates a very diverse character within only a few appearances on screen. He manages to create so many subtle undertones with a performance that doesn't hit over the head with it, but leaves you with a deeper understanding of the character. Emmy Rossum as Maggie does an outstanding job of creating a real and emotional counterpart as the mother to Sophia's character. Ron Perlman is as fantastic as always and creates a very chilling presence on screen. Hats off to the multi talented Shawn, for directing, starring, writing and composing for this beautiful surprise of a film.",
         "Shawn Christensen's Oscar Winning Curfew was a wonderful piece of filmmaking, and I was worried that the feature version \"Before I Disappear\" would be just more of the same. I was pleasantly surprised and this expanded version took wonderful to extraordinary. One of Shawn's many accomplishments in this film was his deft transition of the Sophia character from precocious little girl to self-realized adolescent, who has it together a hell of a lot more than her uncle. It took me a little time to warm up to Emmy Rossum's character -- as in how could she have a child that old -- but a few lines to clear that up -- and boom, all taken care of. Emmy's vulnerability and willingness to go to a very raw place near the end of the film was beautiful to watch. Shawn's expanding the characters I loved in the short and adding new characters, played by Paul Wesley and Ron Perlman was terrific. Who knew that Wesley could bring such depth to a character that could have come off as horribly one-note? The cinematography was brilliant. The choice of color was truly inspired. This is definitely a virtuoso piece of indie filmmaking, and deserving of every award it has picked up on the film festival circuit. My only regret is that this film should be opening in a hell of a lot more theaters this awards season. If you love indie filmmaking, you need to see this film as soon as possible,",
         "Another fascinating movie from SXSW I got to screen was Before I Disappear, one I wasn't sure I would enjoy but walked out of the room with a few tears streaming down my face, which never happens to me in cinema. Shawn Christensen's direction in this film was positively extraordinary. From the get go we see our main character Richie surrounded by poor life decisions that keep dragging him further and further down the rabbit hole; unable to crawl out of his own personal horrors and drowning in mournful regret, he decides he's going to end it. That is until he gets the phone call that changes the tone of the movie completely. A frantic phone call from his estranged sister has him picking up his niece from school and he had no idea why. He goes on an evening of half hallucinated, half sedated, adventures trying to juggle one bad situation while struggling with another. A battle between two bosses, both with whom he feels he owes loyalty; one begging for silence, the other for answers and neither an uncomplicated choice. All the while, he has an 11 year old girl, who is clearly raised to be prim and proper, completely oblivious to the underworld he's trolled, in tow witnessing his digression. Paul Wesley unquestionably stepped out of his comfort zone and brightly shined in the spotlight as the young club owner and boss in this film. Although both he and Ron Pearlman had minimal roles, it was definitely memorable as you felt the hectic panic in his drugged state and actually sympathized with his situation. This movie brings the uncomfortable truth to the surface, what it's like to battle with drug addiction, how it feels to suffer with loss and how some people cope with the choices... on the other side of the coin, how the family members tend to deal with these loved ones. I feel this movie did for drug addiction what Silver Linings Playbook did for people coping with being bipolar. It's ugly, it's messy but there are answers.... there is hope. .",
         "I watched Before I Disappear when it screened at the Hollywood Film Festival this past weekend and also fell in love with the short film version, Curfew, when I saw it after it won the Oscar for best live action short film. The feature film is an outstanding debut for writer/director/star/producer, Shawn Christensen, the man with many hats. This independent film has such a beautiful balance of dark themes such as suicide, drug addiction, and depression but couples it with some very dry and dark humor, an incredibly emotional core, and a hopeful message of life and love. The strong character-driven story is very original and has such great characters to invest in, especially the core relationship between the main character, Richie, and her niece, Sophia, played by the extremely talented, Fatima Ptacek. Christensen's strong visual and storytelling style flows seamlessly throughout the movie, showing his brilliantly creative voice. For one, the visuals and the cinematography are absolutely stunning from each scene to the next, with vibrant colors, smooth camera composition and movement, and unique lighting choices all throughout the story. Also, there's quite a bit of surrealism in this feature, which might have took me back at first, but realized how creative and beautiful the storytelling techniques progressed the character's motivations through them. And finally, with Christensen's background as a musician, music plays a vital role in the film, weaving the drive of each character, as really great music drives the story just as powerfully as the visuals. I honestly loved this film and can't wait to watch it again, hopefully own it on DVD, too! Shawn Christensen definitely has become one of my favorite directors as well as one of the strongest voices as an up and coming artist in film, who already has got his hands on an Oscar as he shows off his incredibly well made first feature length film. Before I Disappear is a beautiful piece of filmmaking that grabs the audience on an emotional level, isn't afraid to be bold, and can really get you thinking and soon enough appreciate the great value of our very lives.",
         "\"Before I Disappear\" was birthed from director Shawn Christensen's 2013 short film \"Curfew,\" which won Best Live Action Short Film at the Academy Awards that year. I remember watching the short film and simply being captivated by its portrayal of ugly yet realistic characters in a seamy environment, so much so that I called it \"a wonderful exercise in style, emotion, human interaction, and existential purpose.\" With the accolades and recognition \"Curfew\" received, it was only a matter of time before the short would be adapted into a feature-length project, and, thankfully, the core focus of the film and its characters didn't find themselves lost in translation. This is a film of tone, realism and germane surrealism, and companionship, four ideas that one would assume would make for an awkward, uneven film but mesh so well together thanks to Christensen's carefulness that the end product is something to behold. The film concerns Ritchie (Christensen), an aimless and depressed twentysomething working for a seedy nightclub run by Bill (Ron Perlman). His will to live is waning day-by-day after his girlfriend Vista has mysteriously disappeared, and, upon finding the corpse of a young female in the nightclub bathroom, Ritchie is ready to call it quits. He goes home, fills a bathtub full of water, and proceeds to take a sharp razor and slit his wrists, ending his miserable existence. His suicide attempt is interrupted by Maggie (\"Shameless\"'s Emmy Rossum), who phones him asking to pick up her eleven-year-old daughter Sophia (Fátima Ptacek, who voices Dora on \"Dora the Explorer\") from school and look after her while she takes care of other things. Reluctantly, Richie exits hit bloody bathtub, bandages his wrists, throws on old clothes, lights a cigarette and heads off to pick Sophia up. Sophia is exactly the kind of precocious tot that Richie needs in his life, regardless of whether or not he knows it. Sophia is meticulous, organized, and grounded in a world where all there is is homework and poetry. She's drawn realistically and not conjured up from the barrage of clichés one expect from this character. She's sensitively played by Ptacek, who is only fourteen-years-old, and just when you think her character is a caricature, she surprises and comes to be a wonderful addition to not only the story but Richie's life. Richie and Sophia wander the streets, with Richie being hunted by loansharks and mob bosses for his failure to pay back old debts, going from several seedy locations before finding some sort of solace and connection at a bowling alley. This scene is almost identical in structure and setup as \"Curfew,\" but with it being bookended by more familiarity and involvement with the characters, it takes on a greater significance. It provides for a momentary discourse in Richie's miserable existence, as he watches Sophia freely dance down the lane of the alley, with people shaking their hips with bowling balls in their hands at the front of each lane. This adds to the surrealism aspect I mentioned earlier, in that while \"Before I Disappear\" explores realistically-drawn characters with serious problems and shortcomings, it also welcomes intriguing surrealism into the mix, bending the reality our disillusioned character lives in. Consider when Richie takes a handful of menopause pills (which he believes are sleeping pills that will turn fatal if he takes enough) and hallucinates one of his collectors coming after him; it's one of the greatest surrealist scenes in a film predicated off of being human and realistic. \"Before I Disappear\" has received the most flak from people who saw \"Curfew,\" weren't a big fan of it to begin with, and then cringed at the thought of watching the short stretched out for ninety-three minutes. Those who enter blindly, and have never seen \"Curfew,\" will likely get the most enjoyment out of it, or those, like me, who enjoy stories about believable and real characters, will find several things to appreciate.",
         "This movie was a gem. I just saw it today, and it was very powerful. Sean Christiansen(sp?) was phenomenal, as was pretty much everyone else including a very invested performance by Paul Wesley (Vampire Diaries) After watching I checked out the background to find out that Sean, the lead was also the writer and director.. what a feat! I was pretty damn impressed by this unknown actor's performance, let alone the direction, and couldn't't help but liken his acting chops to a young Ed Norton (who I also think is great!) I really hope people see this movie... The critics have it underrated, as seen by the user reviews. It was honest in writing, acting, production, etc... a cohesive, unique and moving film... at least for me!",
         "I stumbled across it on Netflix, not expecting much, and was wildly surprised. It's beautiful and very well written and executed. A gorgeously poignant mood permeates the piece throughout, creating a near perfect setting. What could be a timeless story has just the right amount of contemporary sheen and grime and it delivers charm, heart, tears and pain all in enveloping beauty. Well directed, well shot and acted; just lovely really. If you can relate to equal amounts of hopelessness, depression and the blissful joy of life, you'll love this. What a gem by this new filmmaker. No gunfights, no car chases and no explosions, true. It was all done with an engaging story, cast and setting. Nicely sprinkled doses of subtle dark humor are also used just when they're needed. I love this film.",
         "A few years ago, Shawn Christensen won an Oscar for his amazing live- action short called Curfew, focused on a man in despair and contemplating suicide that gets the first chance to spend time with his niece, now around 11 years old. The short was very deserving of that Oscar, and Christensen took an interesting route to build on that by starting with that same initial story and fleshing it out into a full feature length film. On one hand, I would like to see him go into something new with the same finesse that he showed in Curfew, and I feel like there's directions he went here that didn't feel as genuine as some aspects of the same characters in Curfew. On the other hand, though, he kept many of the key moments and feelings from the short, while fleshing out so much more to it. I do also very much like that Fatima Ptacek returns as Tabitha, the niece, as she had a great performance in the short, and she does just as strong of a job here. This film really wouldn't be as strong as it is without her. Christensen plays the lead role as well as directing, and while he's good in front of the camera, it's behind the camera that's really what impresses me. The style and flow of the short was good, but he does so much more here, and there's a very strong visual presence in so many scenes that it really sticks with me. This includes not only some of the more fanciful parts, like an expanded version of the music number from the short to simple shots, like the phone on the floor at the start of the film. What really strikes me is how he managed to take a short and really not dilute it when he extended it out to feature-length, and it still maintains its emotional center, and I think that shows a lot of creativity and skill as both a writer and a director. I really hope that this film does well enough that it opens the doors to more work by Christensen, although I can't help but feel that with the quality of this film, it will do so.",
         "It's becoming increasingly harder and harder these days to find films in the theater that stand out and really make a memorable impact. This gem of a feature, expanded from an Oscar- winning short (Curfew), makes that rare leap from one form to another without losing its magic. Although I knew the basic story since I had seen the short, I was pleasantly surprised by the whole of this film - compelling characters (not just the amazing leads (Christensen, Ptacek and Rossum are perfectly cast), but even supporting ones), unexpectedly funny, the MUSIC!!, the tone/color/cinematography, and of course, the story itself. All of these various factors melded together into that rare magical alchemy that produces the perfect film. I would love to delve into more detail here, but don't want to spoil anything. Christensen is obviously one to watch for. I am in awe that he wrote, directed and starred in this project, and am already looking forward to his future work. Much respect."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Fuzzy Logic Pictures",
         "Wigwam Films",
         "Strongman"
      ],
      "summaries": [
         "A troubled young man and his strait-laced niece embark on a thrilling odyssey through New York City in this heartrending drama based on an Oscar-winning short. As his life hits rock bottom, 20-something Richie decides to end it all, only to have his half-hearted suicide attempt interrupted by an urgent request from his sister to babysit her precocious daughter. So begins a madcap tour of Manhattan after dark, as uncle and niece find unexpected bonds in the unlikeliest of places.",
         "At the lowest point of his life, Richie gets a call from his estranged sister, asking him to look after his eleven-year old niece, Sophia, for a few hours."
      ],
      "budget": 0
   },
   "movielensId": 115770,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-10-11",
      "dvdReleaseDate": null,
      "directors": ["Shawn Christensen"],
      "runtime": 100,
      "movieId": 115770,
      "title": "Before I Disappear",
      "mpaa": "",
      "actors": [
         "Shawn Christensen",
         "Fatima Ptacek",
         "Emmy Rossum",
         "Paul Wesley",
         "Ron Perlman",
         "Richard Schiff"
      ],
      "imdbMovieId": "3060492",
      "originalTitle": "Before I Disappear",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["bosMzZh916I"],
      "plotSummary": "Based on the 2013 Academy Award® winning short film 'Curfew'. At the lowest point of his life, Richie gets a call from his estranged sister, asking him to look after his eleven-year-old niece, Sophia, for a few hours.",
      "tmdbMovieId": 253254,
      "avgRating": 3.63816,
      "releaseYear": "2014",
      "numRatings": 76,
      "posterPath": "/3gyglAKTe1yFzxg9BBioIphHPZp.jpg"
   }
}