{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1861439",
      "video": false,
      "title": "Wyatt Earp's Revenge",
      "recommendations": [],
      "backdrop_path": "/bKrkASbBLYkk1DoR5wJG4atmB9r.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Wyatt Earp",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67c3",
               "name": "Val Kilmer",
               "profile_path": "/AlhPeiH8R4reMNGNQ9ag1FPbuW9.jpg",
               "id": 5576,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Young Wyatt Earp",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67c7",
               "name": "Shawn Roberts",
               "profile_path": "/2pzr8yoBCOnDnaS0iUxraBfZ7SR.jpg",
               "id": 81097,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Bat Masterson",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67cb",
               "name": "Matt Dallas",
               "profile_path": "/yuJxCxg47z7cJ5T7pGl0oLl1FeA.jpg",
               "id": 79494,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "James 'Spike' Kenedy",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67cf",
               "name": "Daniel Booko",
               "profile_path": "/zVTpVwVl8idwr6rhQBDfZ1DFTkv.jpg",
               "id": 183066,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Charlie Bassett",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67d3",
               "name": "Scott Whyte",
               "profile_path": "/tGdJBNXklO2MODOic3iZ1gAQwig.jpg",
               "id": 71520,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Sam Kenedy",
               "gender": 0,
               "credit_id": "52fe4a339251416c910c67d7",
               "name": "Steven Grayhm",
               "profile_path": "/eHX8UDYD8VWhLtH5AcWPD7ocBEL.jpg",
               "id": 81014,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Bill Tilghman",
               "gender": 0,
               "credit_id": "52fe4a339251416c910c67db",
               "name": "Levi Fiehler",
               "profile_path": "/mz7tUnbhwaLTqUweGySuA97dzSJ.jpg",
               "id": 133780,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Milflin Kenedy",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67df",
               "name": "Trace Adkins",
               "profile_path": "/9MMbYFI0WL2rp5iQG9DeYL0Pgvl.jpg",
               "id": 85477,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Dora Hand",
               "gender": 1,
               "credit_id": "52fe4a339251416c910c67e3",
               "name": "Diana DeGarmo",
               "profile_path": null,
               "id": 938028,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Confederate Jones",
               "gender": 2,
               "credit_id": "52fe4a339251416c910c67e7",
               "name": "Brian Groh",
               "profile_path": null,
               "id": 938029,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Doc Holliday",
               "gender": 2,
               "credit_id": "543d7d1cc3a368250d0003fc",
               "name": "Wilson Bethel",
               "profile_path": "/oQmR6txJbNhjmpCgO0OaUTIQd5W.jpg",
               "id": 85779,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a329251416c910c6789",
               "name": "Michael Feifer",
               "profile_path": "/cuvms83KMWKAVAkdiPze1gENP6F.jpg",
               "id": 64278,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a329251416c910c678f",
               "name": "Jeffrey Schenck",
               "profile_path": null,
               "id": 128979,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a329251416c910c6795",
               "name": "Peter Sullivan",
               "profile_path": null,
               "id": 92591,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a329251416c910c679b",
               "name": "Darren Benjamin Shepherd",
               "profile_path": null,
               "id": 938023,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a329251416c910c67a1",
               "name": "Andres Boulton",
               "profile_path": null,
               "id": 128980,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a329251416c910c67ad",
               "name": "Sean Olson",
               "profile_path": null,
               "id": 938025,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a329251416c910c67b3",
               "name": "Dean E. Fronk",
               "profile_path": null,
               "id": 30876,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a329251416c910c67b9",
               "name": "Donald Paul Pemrick",
               "profile_path": null,
               "id": 30874,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe4a339251416c910c67bf",
               "name": "Nikki Pelley",
               "profile_path": "/qU6hvVZ0OV5fJyDCWsOKd92iN9C.jpg",
               "id": 938027,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "547b28a2925141379b000693",
               "name": "Roberto Schein",
               "profile_path": null,
               "id": 938024,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.176465,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 89888,
      "vote_count": 13,
      "budget": 0,
      "overview": "Wyatt Earp is approached by a journalist for an interview about how he became a famous sheriff. Earp told the story of how he was a fearless U.S. Marshall. If 27-year old Wyatt Earp comes out that his first girlfriend Dora Hand was murdered. Together with his friend Doc Holliday, Bat Masterson, Bill Tilghman and Charlie Bassett he goes hunting for the perpetrator ...",
      "similar": [],
      "original_title": "Wyatt Earp's Revenge",
      "runtime": 92,
      "poster_path": "/3OnFdRFQe0u5Fz1FsjbOb5WJ2lY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-03-06",
      "vote_average": 3.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Feifer"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Jeffrey Schenck",
         "Darren Benjamin Shepherd"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1861439/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1ODUzOTIxMl5BMl5BanBnXkFtZTcwOTI0NDcyNw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Val Kilmer, Shawn Roberts, Daniel Booko | See full cast and crew »"],
      "reviews": [
         "Apologies to Deadwood for any comparison. If you're just going to wave a western in front of a camera, a viewer has to ask the valid question - what's the point? Apparently all involved with this enterprise thought that superficial pretense could carry the day and ridin' around 'n ominous music would convey all ya need to know about some sort of story. The casting was positively ludicrous. Every one of the twenties something pampered southern Cal principles here looked fresh out of a shower and the makeup trailer, and I'm telling you, dentistry in the late 1800s must have been pretty cutting edge with all those pearly whites on display. A very lame and uninteresting production that wasn't even worthy of having Val Kilmer snoringly narrate the tale with innumerable pregnant pauses, but maybe having Timothy Olyphant and John Hawkes lookalikes was supposed to make up for all it's low budget deficiencies. A real poser. Bleh.",
         "Straight-to-video is justified, considering the low budget. However, as Earp movies go, this was more than watchable. A fairly well-structured narrative. But definitely more for those, like myself, who are fascinated with the subject matter. Val Kilmer plays an aging Wyatt Earp giving an interview to a newspaper reporter about his involvement in the investigation of the murder of actress Dora Hand in Dodge City, which is a genuine historical event (though to what degree the real Earp's involvement actually was depends on which historian's account you may be reading). Kilmer's work is probably the most memorable element of this film, very moving, making Earp down-to-earth and realistic. The actor playing the reporter does a fine job as well (not sure who he is, but he bears a striking resemblance to Patrick Dempsey). The actors playing the young Earp, Bat Masterson, Charlie Bassett, Spike Kenedy, etc. are also fine, though the script doesn't give them much to work with as far as deep character development. The actor playing Doc Holliday (in one scene only) is very memorable. His expressions ('daisy', etc.) may seem like they're borrowed from Kilmer's Doc from \"Tombstone\", but they're actually historically validated as being genuine southern expressions, and many books attribute them to Holliday. This might be the first on-screen Doc since Victor Mature NOT to have a mustache, though (for what that observation's worth). My gripes are: a. The music score didn't seem to fit very well. That's very often a crutch with movies; the use of the music can often damage the 'mood' of a film which would be better served having no music at all. b. When Bat Masterson is introduced, he's involved in a fist-fight which employs some use of slow-motion which doesn't make any sense to me whatsoever. c. The film looks too 'neat'. A grittier, darker look would have infinitely improved the experience. A nice thing about this film is the use of almost 'forgotten' lawmen, such as Charlie Bassett and Bill Tilghman, who have gotten very few portrayals in film. Overall, not a complete waste of time. Again, more for those interested in Earp history. I appreciated the references to the \"Buntline Special\" revolver, the historicity of which has been debated for quite some time.",
         "When someone says \"straight to DVD\" that invokes a certain \"image\" about a film, and this movie embodies it perfectly. Small budget, virtually unknown cast, simple story... pretty much everything you'd expect. But that's not to say it doesn't have good points too: Val Kilmer as an elder Wyatt Earp does a fine job and has several genuinely touching moments. Wilson Bethel steals his scenes as Doc Holliday, taking a hilarious and memorable turn as the character Kilmer himself made famous. (And Kilmer as Doc fans will appreciate that Bethel seems to be playing from the former's play-book - down to using Kilmer's more memorable lines.) There are some truly lovely vista shots (as one would expect from any western worth it's salt) and a few honestly funny comedic moments. Down the downside, I do wish Trace Adkins had gotten more scene time and the script could have definitely done with a bit of a cliché overhaul. Overall, I'd say it does a fine job at being exactly what it is - a straight to DVD Western; nothing more and nothing less.",
         "I seldom write reviews...However...On this occasion I felt the \"Western genre\" fans needed a heads up on this title. Westerns are rare these days and having always liked the genre...I thought I'd give this a try...having my appetite whetted again with the likes of \"Deadwood\" or even 3:10 to Yuma. Oh my! What a total and utter disappointment. To use a British term... What a lot of utter tosh! I sat through it thinking \"it''s got to get better or have some saving grace\"....it didn't on either count... now all that valuable time I wasted when I could have been doing something useful like picking my feet is gone forever. This movie went straight to DVD...can see why...but don't know why they even bothered. It was made with the same panache and imagination as Bonanza in the 60's. The story was predictable in the extreme and the acting and dialogue was embarrassing to watch. The costumes were laughable as well as very clean and I was left feeling that the movie was either made as a prank or for a bet. I cannot believe somebody actually sank money into making it. I guess Val Kilmer was there to give it some credibility..........he didn't! I would rank this as about as bad as a western gets...in fact off the top of my head I cannot recall one that was worse than this offering This ranks high on my list of all time movie garbage. So please if you're thinking of actually paying money for this, do yourself a real big favour and ...DON'T! Do something useful with the cash instead like having a few beers or giving to the homeless...because if you do buy it....well you have been warned!",
         "Overall I enjoyed the movie, there were a few rough acting spots....But the story was good and believable. What bothered me was the setting. If you are making a movie about Dodge City, or Western Kansas, please be aware that it is FLAT. The foot hills, green fields, vistas, etc., are all beautiful in this movie. However, there isn't a single hill in Western Kansas, it is as flat as a piece of paper, and dirty, dry and brown. With scenery this mismatched it was a little hard to believe the movie was supposed to be set in Dodge City and surrounding counties. Other than the poor location shoot choice, and some awkward acting at times -- Overall, I enjoyed the movie. It's worth a watch.",
         "I've seen Westerns for many many years and this is by far the worst ever. Makes one wonder where the supposed 3M budget went because it certainly didn't go to the actors. Watching Val Kilmer struggle in this one, brought up how difficult it must be for actors that are past their prime and are willing to do grade F movies for a buck. The actors that they found to surround Kilmer must have been extras that they gave double scale pay to pretend they had talent. I kept watching trusting that at some point the movie would pick up and get better but as the minutes ticked by, I found myself getting more disappointed that I'd wasted more time on something that wasn't going anywhere fast. I've literally seen better movies done by high school and college students. Save your $$$ and pass this pathetic excuse of a movie by.",
         "So the tale of Wyatt Earp gets a 21st century makeover. Perhaps best described as Wyatt Earp: The Early Years, this movie details an adventure in the life of the young (late 20-something) Wyatt, and is narrated by an older Wyatt (Val Kilmer - who did a fine job of playing Wyatt's sidekick Doc Holliday in Tombestone waaay back in 1993) Featuring a cast of young guns including Shawn Roberts as Wyatt and Matt Dallas as Bat Masterson the film is good clean fun set against the backdrop of the violent west. Playing out like a modern version of the B-western oaters that used to be a cinema staple, it'll be a hard hearted viewer indeed that can't find something positive to say about this flick. True, it looks low budget and appears to have come from a different era of comic books and B-movies, but that's part of the joy. Everyone involved seems to be having a blast from country star Trace Adkins to dastardly bad guy Daniel Booko as Adkins wayward son. Other noteworthy performances include David O'Donnell, Levi Fiehler and a brief but memorable performance from Brian Groh as Confederate Jones, which leaves you longing for the bit part character to get his own movie. While not in the same league as My Darling Clementine, Gunfight at the OK Coral or even 1990s efforts Tombestone and the Wyatt Earp, the yarn is sufficiently entertaining to make you glad they bothered to make it. One is just left longing for some appearances by old time western stars such as Harry Dean Stanton and LQ Jones in these modern day oaters.",
         "I have a soft spot for westerns, I just can't get enough of them and whilst I admit I picked this movie up primarily because Trace Adkins was in it, it turned out to be a very well made movie considering its budget and straight to video status. Val Kilmer's narration and scenes were well acted and heartfelt and the plot was believable and paced appropriately. The scene with 'Doc' was memorable and wildly entertaining with the actor channeling the amazing version made by, ironically enough, Val Kilmer down to a similar voice and catch phases. I was a little disappointed that more wasn't done with Trace Adkins, although his trademark southern draw due a smile. All in all, an above average movie and I definitely recommend it",
         "I can't help but compare every Western I watch to Unforgiven, partially\u0010 because I've broken that film down in every context imaginable. By that measure, Wyatt Earp's Revenge is the worst western I've ever seen, and I've seen hundreds of them. In terms of character development and portrayal, there are no opportunities to warm to any of the characters, nor nothing that makes them inherently likable. The act for which Wyatt Earp supposedly wishes to avenge solicits no emotion from the actor who plays him, and the victim of said act is not a priest or a child nor anyone else for whom the audience would care about without extensive back-story. Nor is any back-story offered after the event that might trigger any remorse for the victim in retrospect. The acting is wooden and horrible. Where actors are meant to look introspective and brooding, they just look bored, or as if they forgot their lines. Dialogue is forced and clichéd, and there is no relevant emotion portrayed in tone. The actors appearance is largely anachronistic, and their behavior nonsensical. The script is vacuous and terrible. You could cut half the scenes and the outcome would not change. You could tighten up the pacing by cutting half of the remaining scenes, and it would take nothing away from the final product, except that you would see the sum of it in 22 minutes instead of an hour and a half. The cinematography is boring and uninspired -- almost as if it was shot 'by the numbers', and the unending use of 'dramatic' music serves to do nothing but point out how terrible the film is, as if a sit-com with a laugh-track that activates every five seconds. I must assume that this is a 'first movie' by a fledgling production company following the advice of 'just get that first film in the can'. It's good advice, but it doesn't necessarily mean people should spend their time watching it just for the sake of it. Leave this film as a demonstration of basic competency by a fledgling production company in search of investors, and instead go watch _any_ of the internet archive's public domain westerns instead. It will be a much better use of your time. 1/10",
         "I like westerns and do so even more if they're based on real events. So when I saw the title containing one of the most iconic characters of American Western History I just dropped my remote sank my butt in the couch and prepared to enjoy the show. Never have I been so wrong. Where to start...??? Acting: Val Kilmer was probably the \"biggest\" name of the cast and, although he portrays the main character, he literally spends the whole film sitting on a couch and telling his story. Basically he's a narrator. Maybe for the general public that's not a bad thing but personally I miss the old Val Kilmer which had bigger roles in his films. The most important thing for someone playing the narrator is definitely their voice. Kilmer wasn't that bad in this aspect but I think he was lacking a kind of \"cowboy accent\". Personally I was thinking why didn't they just pick the guy that narrates The Big Lebowski (he's also the one that plays the cowboy in the first Ghost Rider), he has voice and the accent. Concerning the rest of the acting it was to stiff most if not all the time. Even the fight scenes, I mean Earp just stands there when Spike launches himself over him. It wasn't even a decent jump it was kind of a poorly choreographed ballet jump. If you want to knock someone down just cannonball the hell out of him. Still on the same fight, Spike had to guns pointed at Earp and, when he decided to shoot, both guns were out of bullets. Facepalm moment. Make up: as I've read in previous review, it actually seemed they had better hygienic habits than we have nowadays. Constantly on dirt and riding their horses but always clean. Just like their teeth, why the hell can't I have their cowboy teeth. But this is actually something recurring in almost every movie nowadays. God forbid the main characters from having dental issues. Historical accuracy: Jesus Christ, where to begin: -Wyatt Earp wasn't the one in charge of the posse to capture Spike. It was actually Charlie Bassett. Earp was one of his deputies. -Everone seemed to know and fear Earp when in truth, during this manhunt he wasn't yet that well known. -Earp had no relationship with the actress Dora. -In the movie old Earp said he never wanted to kill and that he never killed someone for revenge. In truth there was something called \"Earps Vendetta Ride\" (GOOGLE IT). -Spike's father said Earp couldn't be bought with money but if Earp was as famous as they made him seem in the film he would know that Earp was also a famous gambler.(Of course this doesn't mean he would have been a sell out. I'm just saying he probably wouldn't refuse an offer so quickly). In the end, only the character names were accurate. They might as well have just put Jesse James in the film and say it was Earp that killed him. This movie, in my opinion, is just an excuse to enhance Earps greatness using lies to do so.Yes Earp was a great icon in American Western history but there wasn't the need for so many lies to make him sound great. Just check his biography and you'll find plenty of decent material to make a decent movie about this man. Overall a give it a 4/10. I was facepalming throughout the whole movie so I don't think I've seen enough to give it a lower score."
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "Feifer Worldwide",
         "Hybrid Productions Inc.",
         "Lancom Entertainment"
      ],
      "summaries": ["Story of a young Wyatt Earp before he became a lawman. When someone important to him is killed he sets out to find the one responsible. He is joined by some friends among whom are Bat Masterson and Doc Holliday."],
      "budget": 3000000
   },
   "movielensId": 115885,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-03-06",
      "dvdReleaseDate": null,
      "directors": ["Michael Feifer"],
      "runtime": 92,
      "movieId": 115885,
      "title": "Wyatt Earp's Revenge",
      "mpaa": "PG-13",
      "actors": [
         "Val Kilmer",
         "Shawn Roberts",
         "Matt Dallas",
         "Daniel Booko",
         "Scott Whyte",
         "Steven Grayhm",
         "Levi Fiehler",
         "Trace Adkins",
         "Diana DeGarmo",
         "Brian Groh",
         "Wilson Bethel"
      ],
      "imdbMovieId": "1861439",
      "originalTitle": "Wyatt Earp's Revenge",
      "genres": [
         "Drama",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["4UkHthd8vjE"],
      "plotSummary": "Wyatt Earp is approached by a journalist for an interview about how he became a famous sheriff. Earp told the story of how he was a fearless U.S. Marshall. If 27-year old Wyatt Earp comes out that his first girlfriend Dora Hand was murdered. Together with his friend Doc Holliday, Bat Masterson, Bill Tilghman and Charlie Bassett he goes hunting for the perpetrator ...",
      "tmdbMovieId": 89888,
      "avgRating": 2.625,
      "releaseYear": "2012",
      "numRatings": 4,
      "posterPath": "/3OnFdRFQe0u5Fz1FsjbOb5WJ2lY.jpg"
   }
}