{
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 235,
      "synopsis": "In 1934, four brilliant Cambridge men are recruited to spy for Russia. Fueled by youthful idealism, a passion for social justice and a talent for lying, they take huge personal risks to pass Britain's biggest secrets to Moscow. Based on true events.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0346223/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyOTE5Mjg2MV5BMl5BanBnXkFtZTcwMjMyNDMzMQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Hollander, Toby Stephens, Rupert Penry-Jones | See full cast and crew »"],
      "reviews": [
         "This is a lightly fictionalised account of how four tewwibly well brought up English boys betrayed their country to the Soviet Union. Philby's father had been a distinguished diplomat and Arabist and McLean's a cabinet minister. All had public school educations and had been undergraduates at the same Cambridge college. They set off into promising careers in the foreign office and security services and were Soviet agents from the start. Their great coup was to give the Soviets enough details about the atomic bomb to speed up their program to build one by a couple of years, but it was at the expense of blowing McLean and Burgess's cover (they escaped to Moscow in 1951), and Philby being fired from MI6. He joined them in Moscow in 1963. Blunt, by now the Keeper of the Queen's Pictures was then interrogated; he confessed, and was let go. It's one of the really great spy stories of the 20th century. This version concentrates on the personal dynamics. The amount of contact the spies had with each other after Cambridge seems to be much exaggerated (pretty bad security), but gives us the picture of the gang of four against the Establishment. The women are interesting too. Philby was a ladies' man to whom Donald McLean's American wife Melinda (Anne-Louise Plowman) was attracted. They later lived together in Moscow. Blunt and Burgess were both gay, but friends rather than lovers. The Establishment, in the person of Lord Halifax (James Fox), Ambassador to Washington, found it difficult to believe that 'people like us' could do such things and started looking for the atomic spy in the embassy kitchens. One or two western counter-intelligence operatives including the CIA's formidable James Jesus Angleton nearly nabbed them, but with Philby tipping them off (and duchessing Angleton), Burgess and McLean made it safely to Moscow. With four hours to play with all the characters are richly drawn. Tom Hollander's Guy Burgess is a drunken dirty little sod who somehow manages to be witty and charming as well. It was great cover for a spy. As Donald McLean, Rupert Penry-Jones is the Golden Boy who feels himself unworthy, and sees communism as the way to redemption. Toby Stephens as Kim Philby gives us the cleverness, the deviousness and the angst as well, especially in the Spanish episode.(I'm afraid us Philbys are a devious lot, but we bleed, we bleed). Samuel West's Blunt has the occasional hint of emotion, but basically is a cold fish. Art, it seems is his life. He does get on tewwibly well with the Queen. Seventy years on, it's not so much why they did it, but why they kept it up that mystifies. Given their location close to the heart of British Intelligence and hence knowing as much as anybody outside about what really went on the Soviet Union, it's extraordinary that Philby and McLean in particular continued on right up to 1951 (Blunt was more or less inactive after 1945). It is suggested here that Ms McLean did try to get her husband to give up spying but there's no real explanation as to why he persisted. Perhaps he still believed. Anyway, truth or fiction is hardly the point here - Sunday night is not for history lessons. This is a familiar tale well told, visually splendid and not too taxing. The real story, I suspect, is far too complex for even the most adroit (or left) TV producer. An earlier TV account,\"Philby Burgess and McLean\" (1977) is also worth watching, if you can find it.",
         "The BBC has once again shown that they can still create top quality drama. While there may be some historical issues with the script, one has to admire the fact that the characters are portrayed accurately and convincingly. Having just seen the last of the four-part series, I can comment that for entertainment value it is top notch. Sure, some may argue the historical facts are inaccurate, or that the light spun upon the situation is somewhat different to how it was at the time, but much information about the infamous Cambridge spies is uncertain at best - in particular Kim Philby (Toby Stephens) is somewhat a mystery even today. Do not be fooled into thinking that this series is a documentary, it isn't. However, you will be forgiven for thinking that you are watching the actual events, with the locations, pieces and acting all first class. Watch it with an open mind, as if it is fictional. You will be greatly rewarded, excited and even humoured at how four masterminds underplayed the archaic MI6 for their principals. I'd certainly recommend it. Overall: 9/10 - Losing the ultimate 1 mark for seeming rushed in parts and sometimes making it hard to understand the relationships between the very complex characters - particularly at the start of the series.",
         "What a superb series the BBC has made in Cambridge Spies! The cast are really fantastic. My favourite actor has to be Imelda Staunton as the late Queen Mother. She has some of the best lines and delivers them so well. The leads are cast very well indeed. Tom Hollander is suitably seedy as Guy Burgess, Samuel West is very starchy and upper class as Blunt, Rupert Penry-Jones is wonderful as the handsome but flawed Donald Maclean and Toby Stephens is delightfully dislikable as Kim Philby. These characters are thoroughly entertaining and horrible in the extreme in their betrayal of King and Country. The cloak and dagger feel of the piece is wonderful. The settings are really great too. Cambridge is so beautiful. The writers should be congratulated in keeping the pace moving so well. All in all BBC you have done it again. I wish we saw more quality drama like Cambridge Spies!",
         "This BBC presentation is, like the 4 spies involved, quintessentially British. The settings are supreme, particularly the depictions of life at Cambridge as an undergraduate, which is where we first meet the 4 characters whose effect on 20th century history, may never be fully appreciated. The story follows their lives and adventures up until Burgess and McLean defect in 1951. The settings apart, what lifts this production out of the ordinary and into the sublime, is the casting and the performances from everyone involved. The 4 leads played by Samuel West as Blunt, Toby Stephens as Philby, Tom Hollander as Burgess, Rupert Penry-Jones as McLean are, all of them, perfectly cast. And.............. there are also memorable contributions from Anthony Andrews, moving and dignified as King George VI, Imelda Staunton, wonderfully cryptic and tart as the late queen mother, John Light as the outsmarted and frustrated James Angleton and not least Marcel Lures as the dignified KGB officer who acted as contact to the four. I have already watched this twice and will do so again as there is so much to enjoy with repeated viewings. Particularly memorable scenes include their outrageous celebrations on their last day at Cambridge, Philby getting himself and his companions out of a jam in Vienna by dint of his unshakable belief in the power of his British Passport (One of many delicious ironies), McLean's unconventional courting of future wife Melinda, Blunt's scenes with the Royals and unforgettably, Burgess' way of getting himself declared \"persona-non-grata\" in USA. Hollander's \"God Bless America\" scene is one of the many highlights in the production and is as good a piece of bravura acting as anything that might come from a Brando, a Pacino or a De Niro. But there are goodies everywhere. You will not need to be a History Buff to enjoy this, but you will conclude as I did, that yet again, \"Nobody comes close to doing this kind of thing quite as well as the Beeb.\"",
         "I almost didn't watch this when I found out the story behind the \"Cambridge Spies\", but I'm so glad I did. This mini-series almost authentically captures the feel of the 1930s in Europe. It's a beautiful looking mini-series. The actors who played the infamous four spies were all very good and they each held their own. They made you care about them even though you know they are all traitors to their country. I enjoyed it very much. One of the best parts also, coming from the DVD, is the interesting documentary on the Cambridge Spies. It's a fascinating, well acted show. Take a close look at the guy who plays Guy Burgess. He's a lot of fun to watch and strangely enough, looks almost exactly like the real Guy Burgess. Very good show! Worth watching a second time!",
         "Cambridge Spies is glamorous, intelligent and exciting - a winning formula! The acting is brilliant and the editing very stylish. The plot is slightly hard to catch at times, but it doesn't matter as the locations are stunning and performances touching. Great TV!",
         "High production values and a great story drive this excellent show along at just the right pace. Never rushed or drawn-out. A few oddities with the script - some things don't seem to flow right but minor. Perhaps the editor put a few bits of film in the wrong place! David Higgs' photography is a joy to watch - it would almost be worth watching without any sound! Aspiring DPs (directors of photography)should look at his lighting, framing and camera movement. Lovely use of long lenses to separate the characters from the background. Older DPs should start to worry!",
         "Since no one has said so yet, it seems necessary to add this. The series is an excellent drama, in every way - no doubt about that. Well worth watching. BUT. And that is the point: The subject of this drama is politics, international affairs, government, intelligence - and these are largely absent from the drama. So if you are prepared to enjoy a view of the events from the perspective of the personal lives of the main characters, then all is fine. But if you were looking for more than tenuous references to the events and forces at play in the world, and an account of how the characters of the story were involved in those events and forces, you will miss something... This is not to say that it's a bad drama - it's still excellent. And lavishly designed and produced. But those political events and forces were of historic importance. At a time where the world was still strongly driven by ideological currents, and there was a ruthless struggle for world domination. In my view, that is even higher drama, and I missed those connections.",
         "When you see a title like this, you expect secrets, conspirations, tension, etc. Especially if it's about the famous Cambridge Four. What you get instead is love, friendship, tears, gay love, drama, complete historical inaccuracy and sheer boredom. It focuses on all the wrong aspects. And it portrays the Cambridge Four as insecure kids instead of cunning master spies. Also the part when Kim Philby travels to Vienna couldn't be more ridiculous. It portrays Litzi Friedman as a petty thief (and still expects the viewer's sympathy towards her). And it portrays Vienna in 1934 like Berlin 10 years later. Roadblocks on every corner with soldiers asking for papers? Jews must hide and if found they get executed on the spot along with their helpers? In Vienna, in 1934? ARE THEY F*-ING SERIOUS?!!! Hitler just rose to power, Jews were largely unharmed yet even in Germany, and Austria was still independent for a long time.",
         "Only halfway through the 4-part series so far but Cambridge Spies has definitely lived up to my expectations. Much impressed by the excellent Toby Stephens, having seen how versatile he can be from: Tenant of Wildfell Hall, Sunset Heights, Great Gatsby and of course Die Another Day! I have to say what a superb actor Tom Holland is too. Putting aside historical inaccuracies (this has never claimed to be a documentary anyway) in favour of sheer entertainment value, this is proving to be a fast-moving, truly gripping drama. I'm hooked!"
      ],
      "genres": [
         "Drama",
         "History"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Perpetual Motion"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 115895,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-05-09",
      "dvdReleaseDate": null,
      "directors": ["Tim Fywell"],
      "runtime": 235,
      "movieId": 115895,
      "title": "Cambridge Spies",
      "mpaa": null,
      "actors": [
         "Tom Hollander",
         "Toby Stephens",
         "Rupert Penry-Jones"
      ],
      "imdbMovieId": "0346223",
      "originalTitle": "Cambridge Spies",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1934, four brilliant Cambridge men are recruited to spy for Russia. Fueled by youthful idealism, a passion for social justice and a talent for lying, they take huge personal risks to pass Britain's biggest secrets to Moscow. Based on true events.",
      "tmdbMovieId": 103081,
      "avgRating": 3.75,
      "releaseYear": "2003",
      "numRatings": 6,
      "posterPath": "/6riEJgttGCDi7L2pubmlOYhLNw6.jpg"
   }
}