{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "dinosaur",
         "id": 12616
      }],
      "imdb_id": "tt0123950",
      "video": false,
      "title": "The Land Before Time V: The Mysterious Island",
      "recommendations": [
         17337,
         19164,
         19004,
         24102,
         24554,
         25587,
         25556,
         15997,
         24556,
         31933,
         39961,
         339526,
         12144,
         25913,
         57355,
         19042,
         31473,
         20377,
         20378,
         110395
      ],
      "backdrop_path": "/vvrikCMyik8sZK7p8hrn8BjhWS4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Narrator / Cera's Father (voice)",
               "gender": 2,
               "credit_id": "532c2425c3a3684bbf00148a",
               "name": "John Ingle",
               "profile_path": "/d7RnwWIuBjMpDRSpz3mTaCHMmOc.jpg",
               "id": 44052,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Brandon Lacroix",
               "gender": 2,
               "credit_id": "532c2438c3a3684b9d001399",
               "name": "Brandon Lacroix",
               "profile_path": null,
               "id": 1162379,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Ducky (voice)",
               "gender": 1,
               "credit_id": "532c244ec3a3684bce00149d",
               "name": "Aria Noelle Curzon",
               "profile_path": "/efuqPjw5LNmgo43ICBQtAMhkz0l.jpg",
               "id": 1303010,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Spike (voice)",
               "gender": 2,
               "credit_id": "532c2460c3a3684b9d00139d",
               "name": "Rob Paulsen",
               "profile_path": "/hHgifZsqtTchMvpxGspoKGnqvmZ.jpg",
               "id": 43125,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Cera (voice)",
               "gender": 1,
               "credit_id": "532c2472c3a3684b9d00139f",
               "name": "Anndi McAfee",
               "profile_path": null,
               "id": 35224,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Petrie / Mr. Clubtail (voice)",
               "gender": 2,
               "credit_id": "5402d5310e0a2658de006ecf",
               "name": "Jeff Bennett",
               "profile_path": "/bms3A7TA0QItjtUlB28qv4MFFAH.jpg",
               "id": 34982,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Grandpa (voice)",
               "gender": 2,
               "credit_id": "532c24afc3a3684b9d0013ac",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Grandma (voice)",
               "gender": 1,
               "credit_id": "532c24d39251416e98000dc6",
               "name": "Miriam Flynn",
               "profile_path": "/6VKACA883vyve6uuviO4I6QpluL.jpg",
               "id": 35109,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "532c24e59251416e89000e1f",
               "name": "Charles Grosvenor",
               "profile_path": null,
               "id": 90864,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "532c24f49251416e9f000da8",
               "name": "John Loy",
               "profile_path": null,
               "id": 30692,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "532c25039251416e9f000dab",
               "name": "Judy Freudberg",
               "profile_path": null,
               "id": 71446,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "532c25199251416e8f000d5e",
               "name": "Tony Geiss",
               "profile_path": null,
               "id": 40346,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "532c25a39251416e98000dd5",
               "name": "Tony Geiss",
               "profile_path": null,
               "id": 40346,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "532c96e79251413a780001c2",
               "name": "Michael Tavera",
               "profile_path": null,
               "id": 58289,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "532c96f59251413a780001c4",
               "name": "Jay Bixsen",
               "profile_path": null,
               "id": 90868,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "532c97029251413a810001e2",
               "name": "Andrea Romano",
               "profile_path": "/1XTwon7oYI6nl9YWtrYC4AkjgID.jpg",
               "id": 34945,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5518cb9bc3a3685cfa004393",
               "name": "Tom King",
               "profile_path": null,
               "id": 1237111,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 6.904255,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19165,
      "vote_count": 91,
      "budget": 0,
      "overview": "This fourth sequel in the series finds \"leaf gobblers\" eating all the vegetation in Great Valley, driving Littlefoot, the young brontosaurus, and the other dinosaur inhabitants out. Arguments break out among the adults during migration, and Littlefoot and his friends decide to take matters in their own hands by crossing the \"big water\" to an unknown island. There they meet an old friend from The Land Before Time II--Chomper, the T-rex, who has to protect the gang from his own, carnivorous parents. Plenty of drama in this one, and as the series has been wont to do from the beginning, it shows adults as sometimes being less than perfect.",
      "similar": [
         329,
         88751,
         135397,
         351286,
         10567,
         18890,
         15997,
         425,
         105864,
         18162,
         12144,
         1593,
         49519,
         8355,
         254,
         278154,
         8967,
         124905,
         55341,
         249170
      ],
      "original_title": "The Land Before Time V: The Mysterious Island",
      "runtime": 74,
      "poster_path": "/zky4X5XpwJcB0yUGYFV79URJ85i.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Universal Cartoon Studios",
         "id": 4285,
         "origin_country": ""
      }],
      "release_date": "1997-09-12",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/alkvR9vTtuZEmd5ygsayOfxYOMa.jpg",
         "name": "The Land Before Time Collection",
         "id": 19163,
         "poster_path": "/n1bjdBVThBezxR6nEf2dy43sTtV.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Grosvenor"],
      "runtime": 74,
      "synopsis": "After a cloud of Swarming Leaf Gobblers (locusts) descends upon the Great Valley, devouring all plants and leaving it a barren wasteland, the inhabitants must seek another place where they can survive until the plants in the Great Valley have grown back. However, the Swarming Leaf Gobblers have left a path of devastation behind them, leaving no food for the dinosaurs to find. After erring for days and days through this desolation, the herd quarrel and threaten to separate. The main characters do not want to be separated, so they set out to find a location with plentiful food. They leave a trail for the grownups to find them with, and eventually reach the \"Big Water\" (ocean). There, they see a verdant island connected to the mainland by a thin land bridge. On their way, an earthshake (earthquake) occurs, which they narrowly escape, and which wipes out the bridge. Isolated on the island, they try out Cera's idea to return by using a log as a boat (which made her seasick). However, a \"swimming sharptooth\" (resembling a Cretoxyrhina shark) attacks, and in the confusion and fright which follows, they end up on the island again. That night, they remember their families, while the herd, who followed the trail, sleep on the shores of the beach on the mainland, worrying for them. The next morning, the children wake up to the shadow of a Sharptooth. They take off, but find themselves cornered by high cliffs. They huddle together when the sharptooth approaches, only to find that it is Chomper (from The Land Before Time II: The Great Valley Adventure). He then helps them to hide from his parents, who are also on the island, and provides them with food upon their request. However, an overcautious Cera openly displays distrust to Chomper because he was a Sharptooth, which grieves him, and he departs. Littlefoot follows him and apologizes, but is interrupted by Chomper's mother. She nuzzles him, then leaves, presuming Littlefoot is prey. Littlefoot is intrigued by her display of love to Chomper. Meanwhile, another Sharptooth living on the island (resembling a Giganotosaurus) finds the children, and gives them chase. Chomper tries to help, but the Sharptooth overcomes him. His parents then come and battle the Sharptooth near the edge of the island, during which he falls into the Big Water and takes Chomper with him. Littlefoot plunges in to save Chomper while the sharptooth is swept away by the current. The \"swimming sharptooth\" returns, but they discover it was an Elasmosaurus named Elsie then saves the two from drowning. She returns them to the island, where Chomper's grateful family promises never to harm the children. Still, the gang miss their families, so Elsie offers to take them across the sea, making Cera even more seasick than before. They say their final goodbyes to Chomper, and board Elsie. When back on the mainland, they find out that the herd found a lush, green, little place on the shore to stay in till the Great Valley is green again.",
      "writers": [
         "John Loy",
         "Judy Freudberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0123950/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczNTQxMjY5N15BMl5BanBnXkFtZTcwMTg1NTMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Ingle, Brandon Lacroix, Aria Noelle Curzon | See full cast and crew »"],
      "reviews": [
         "One of the reasons I love this film is the song 'always there' where littlefoot sings a verse about his mother. That has NEVER happened before or since this movie was made and it brought a tear to my eye. The other songs are fun, the art brightly coloured and it's action packed...What more could a fan want? Well better voices for one. Chomper and littlefoot both sound like they have a cold. ahh well I can't be too picky. Kids and long time fans will love it. oh and chomper comes back too.",
         "I am a HUGE fan of the land before time series i started watching them when I was around 6 or 7. This movie is a very good one that goes by 2 titles. This one and The Journey To Big Water. Even though this is a very good movie I believe that number #6 is better. It is me all time favorite. Any ways this movie is awesome and I would watch it over and over again. Its AWESOME ! ! ! The Land before time series is an amazing series.It is awesome especially for kids all ages.it tells about a mysterious land again. Which no one really knows about. And Dinosaurs every child is fascinated by dinosaurs.The songs are also magical on any movie you watch from number one to the very newest one. They all take you on a magical journey of your own.",
         "I love the first \"Land Before Time\", and still consider it one of the better Don Bluth movies. I have liked most of the sequels, but there have been some I have not liked(more about that another time). Along with \"Great Valley Adventure\" and \"Time of the Great Giving\", \"Mysterious Island\" is one of the better ones. The animation, while not as sophisticated or as handsome as the visual style of the first film, is nice and colourful, and I think it is one of the better animated sequels of the franchise. The incidental music is lovely, and while not particularly memorable, the songs are pleasant \"Always There\" especially is very touching. And the voice acting is excellent, and the characters are at least likable. Who cannot love that adorable Chomper? All these positives make up for a too-short duration, a touch too simplistic writing and a plot that takes a tad too long to get going. I also thought the singing was mixed, Cera's singing was beautiful but Ducky sounded off for some reason. Asides from these flaws, this is a surprisingly pleasant and watchable sequel. 6/10 Bethany Cox",
         "This is a good LBT, not the best, but certainly is up ahead of quite a few of the others. One weird thing about this LBT: This was directed by Charles Grosvenor and (except for LBT7) all of his later ones did not have as much action, heart, kindness or plot and story as this. Yes, some of his other ones are good as well and yes, they do have action, heart, kindness, plot and story, but not in the same way as this one. The animation in this is also similar to the films before that and it is luckily good quality LBT animation as well.? The plot is also very interesting, gripping and a little bit more heartwrenching than a lot of other LBTs (even more so than some of the ones before Charles Grosvenor). The first ten minutes or so is very gripping and exciting, showing a swarm of \"evil\" locusts ridding the great valley of all green. The film goes on, everyone in the valley has to leave to find more food in the dreaded mysterious beyond. The children (Littlefoot, Cera, Ducky, Petrie and Spike), go along with this. As the film goes on we see much betrayal, hard work, teamwork and hope. These feelings are expressed in a different way than a lot of the other LBTs and hopefully this will give pleasure to all who watch it (except for those who think that there should be no LBT sequels, however good they are).? ? So, enjoy \"Land Before Time V: The Mysterious Island\". :-)? 7 and a half out of ten.",
         "This is arguably the best entry in the entire LBT series, which, as of this writing, is up to number 10. My sons (along with Mommy and Daddy) have watched this one more times than any of the others, and there's a reason for that: it's a good one. (Number 2, \"The Great Valley Adventure,\" with Ozzy and Strut, the first appearance of the baby T-Rex Chomper, and some great songs by the Roches, comes in second.) \"The Mysterious Island\" also contains three fabulous songs, perhaps the best three songs from the whole series: \"Big Water,\" \"Always There,\" and \"Friends for Dinner,\" all by Michele Brourman & Amanda McBroom. Don't miss it. (And also watch \"The Great Valley Adventure,\" if you haven't already.)",
         "While the Time of the Great Giving is a much better sequel than the others, this one is also better, but is not as excellent as the original was. The dialog is nice, but the story is predictable and takes way too long to get it going. Even the writing was inept. There are a few redeeming qualities that save this movie. The songs, although not memorable, are pleasant to listen to, especially Always There which was very touching. The animation is beautiful and the voice acting is excellent. Thomas Dekker did great as Littlefoot and the cameo Christina Pickles did great as the sea creature near the end of the movie. The character are likable, especially Chomper which made me feel glad to see him again after The Great Valley Adventure. Overall, not as excellent as the original, but still a worth-watching sequel.",
         "The Land Before Time V: The Mysterious Island, the fifth installment in the Land Before Time series, we have the return of Chomper in this one! Which I absolutely loved, because he was such an adorable character in the second sequel to the series. Littlefoot and his friends are back and they do get into another squwabble, but it's all good to continue their adventures. I've so far have actually enjoyed these sequels, as silly as they are, I think that they are great for the kids and even as a family film. The characters are lovable and the story has great morals on friendship, trust and respect. I'd rather have my kids watching this vs. some of the shows on the Disney channel today. But The Mysterious Island was a great addition to the story as we continue to see Littlefoot grow with his friends. After a cloud of locusts descend upon the Great Valley, devouring all plants and leaving it a barren wasteland, the inhabitants must seek another place where they can survive until the plants in the Great Valley have grown back. However, the \"Swarming Leaf Gobblers\" have left a path of devastation behind them, leaving no food for the dinosaurs to find. After looking for days through this desolation, the herd fight and threaten to separate. The main characters do not want to be separated, so they set out to find a location with plentiful food. They leave a trail for the grownups to find them with, and eventually reach the ocean. There, they see a verdant island connected to the mainland by a thin land bridge. On their way, an earthquake occurs, which they narrowly escape, and which wipes out the bridge. Isolated on the island, they try out Cera's idea to return by using a log as a boat. However, a \"swimming sharptooth\" attacks, and in the confusion and fright which follows, they end up on the island again. That night, they remember their families, while the herd, who followed the trail, sleep on the shores of the beach on the mainland, worrying for them. The next morning, the children wake up to the shadow of a Sharptooth. They take off, but find themselves cornered by high cliffs. They huddle together when the sharptooth approaches, only to find that it is Chomper. He then helps them to hide from his parents, who are also on the island, and provides them with food upon their request. However, an overcautious Cera openly displays distrust to Chomper because he was a Sharptooth, which grieves him, and he departs. Littlefoot follows him and apologizes, but is interrupted by Chomper's mother. But with a sharptooth's reputation, they don't know if this will be a good or bad meeting as well with the woe of not knowing if they will ever see their families again. The Land Before Time V: The Mysterious Island is a good movie, I'm really disappointed in the ratings on these movies, after all they are more meant for the kids. As a child's movie, it's a great one, as a movie that the whole family can enjoy together, I think it's very possible if you give it a chance. Plus you just have got to love Chomper, how could you not? He's so adorable and I loved seeing the sharptooth's reaction to their friendship. But this is a great story and I think these movies are good so far, I'm looking forward to watching the next sequel. 6/10",
         "\"The Land Before Time 2\" was a good film. It slightly altered the tone of the original film (which remains a true classic and the best of the series) with it's use of songs. It still had a fine mix of action, character development and of course introduced \"Chomper\". For me, sequels 3 and 4 were not that appealing, with unnecessary secondary characters that \"dumbed down\" the films. Part 5 returns to the nice tone established in part 2. There is adventure, surprise developments both in story and with the characters. And best of all we learn what happened to Chomper. If you want a true \"trilogy\" with a story arc, I recommend watching the original, then part 2 and then part 5. What an epic!",
         "of the numerous Land Before Time films, this one stands out with some high quality songs and a great storyline. the two big songs of the film, Big Big Water and in particular Friends For Dinner, are two of the best that you will find in the series of films, and are of the high, singalong quality you would normally only find in a high profile Disney movie. the basic premise of the storyline, one of how all can work and flourish together despite obvious differences, is a good one, and provides many moments of education for youngsters as much as it does entertainment. our little one, who is not yet three, loves this film to bits. that's the target audience, and you can't argue with that! watch and enjoy, and be prepared to be singing \"friends for dinner\" in your head for quite a while after!",
         "What's cool about this sequel is that we find out T-Rexes have their own language. Subtitles translate the roars. Chomper of course speaks English because of previous acquaintance with our favourite babies. The \"Always There\" song is heartwarming. The story is strong and will keep everyone entertained. 9/10"
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Musical"
      ],
      "productionCompanies": ["Universal Cartoon Studios"],
      "summaries": ["When a swarm of \"leaf-gobblers\" devours all the green food in the Great Valley, the herds move on to find another valley of greens and in the process, Littlefoot and his friends Spike, Cera, Petrie and Ducky wind up on an island in the middle of the Big Water. They're reunited with Chomper...Along with his nasty, hungry parents."],
      "budget": 0
   },
   "movielensId": 115943,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-12",
      "dvdReleaseDate": null,
      "directors": ["Charles Grosvenor"],
      "runtime": 74,
      "movieId": 115943,
      "title": "The Land Before Time V: The Mysterious Island",
      "mpaa": "G",
      "actors": [
         "John Ingle",
         "Brandon Lacroix",
         "Aria Noelle Curzon",
         "Rob Paulsen",
         "Anndi McAfee",
         "Jeff Bennett",
         "Kenneth Mars",
         "Miriam Flynn"
      ],
      "imdbMovieId": "0123950",
      "originalTitle": "The Land Before Time V: The Mysterious Island",
      "genres": [
         "Family",
         "Animation",
         "Adventure"
      ],
      "youtubeTrailerIds": ["_et5LL4Pe1M"],
      "plotSummary": "This fourth sequel in the series finds \"leaf gobblers\" eating all the vegetation in Great Valley, driving Littlefoot, the young brontosaurus, and the other dinosaur inhabitants out. Arguments break out among the adults during migration, and Littlefoot and his friends decide to take matters in their own hands by crossing the \"big water\" to an unknown island. There they meet an old friend from The Land Before Time II--Chomper, the T-rex, who has to protect the gang from his own, carnivorous parents. Plenty of drama in this one, and as the series has been wont to do from the beginning, it shows adults as sometimes being less than perfect.",
      "tmdbMovieId": 19165,
      "avgRating": 3.19643,
      "releaseYear": "1997",
      "numRatings": 28,
      "posterPath": "/zky4X5XpwJcB0yUGYFV79URJ85i.jpg"
   }
}