{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2091240",
      "video": false,
      "title": "Barbie: A Perfect Christmas",
      "recommendations": [
         73456,
         44874,
         13459,
         168903,
         34134,
         91342,
         16418,
         129533,
         23566,
         13004,
         21705,
         18198,
         57737,
         13284,
         285733,
         13283,
         16962,
         255718,
         13285,
         227200
      ],
      "backdrop_path": "/j8M6kBy37Ap39EcIoXYDxt3c24V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Barbie (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b44f",
               "name": "Diana Kaarina",
               "profile_path": null,
               "id": 526306,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Barbie (singing voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b453",
               "name": "Jennifer Waris",
               "profile_path": "/3PWJDmiOx0MszfNEu1TfEuxKKTZ.jpg",
               "id": 582116,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Skipper (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b457",
               "name": "Rachel Harrison",
               "profile_path": null,
               "id": 582117,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Skipper (singing voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b45b",
               "name": "Nevada Brandt",
               "profile_path": null,
               "id": 582118,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Stacie (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b45f",
               "name": "Lauren Lavoie",
               "profile_path": null,
               "id": 582119,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Stacie (singing voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b463",
               "name": "Danielle Bessler",
               "profile_path": null,
               "id": 582120,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Chelsea (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b467",
               "name": "Ashlyn Drummond",
               "profile_path": null,
               "id": 582121,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Chelsea (singing voice)",
               "gender": 0,
               "credit_id": "52fe496fc3a368484e12b46b",
               "name": "Lucia Vecchio",
               "profile_path": null,
               "id": 582122,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Christie Clauson / Ivy Elif (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b46f",
               "name": "Maryke Hendrikse",
               "profile_path": "/9iMFnpg5VmZvNWJ7Lo9AlvemoMb.jpg",
               "id": 85432,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Christie Clauson (singing voice)",
               "gender": 0,
               "credit_id": "52fe496fc3a368484e12b473",
               "name": "Allie Feder",
               "profile_path": null,
               "id": 582123,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Brian (voice)",
               "gender": 2,
               "credit_id": "52fe496fc3a368484e12b477",
               "name": "Aidan Drummond",
               "profile_path": null,
               "id": 215395,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Cole Elif (voice)",
               "gender": 2,
               "credit_id": "52fe496fc3a368484e12b47b",
               "name": "Alistair Abell",
               "profile_path": "/8NpOt0Tqszhg23oLPNZ1PTWV9zg.jpg",
               "id": 63797,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Aunt Millie (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b47f",
               "name": "Patricia Drake",
               "profile_path": "/q21jvkbE2clFy0Qt4gV7L6Hft8u.jpg",
               "id": 172888,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Holly Elif (voice)",
               "gender": 1,
               "credit_id": "52fe496fc3a368484e12b483",
               "name": "Chiara Zanni",
               "profile_path": "/7K9QMwQkRl7FRdrn7Y7guK3zexf.jpg",
               "id": 33053,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe496fc3a368484e12b489",
               "name": "Terry Klassen",
               "profile_path": null,
               "id": 129373,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe496fc3a368484e12b48f",
               "name": "Elise Allen",
               "profile_path": null,
               "id": 569197,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe496fc3a368484e12b495",
               "name": "Mark Baldo",
               "profile_path": null,
               "id": 474866,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe496fc3a368484e12b49b",
               "name": "Aaron Seelman",
               "profile_path": null,
               "id": 1102683,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "554aa208c3a3685e4c000234",
               "name": "Peter J. Deluca",
               "profile_path": null,
               "id": 1447587,
               "department": "Art",
               "job": "Art Department Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.605845,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 77499,
      "vote_count": 66,
      "budget": 0,
      "overview": "Join Barbie and her sisters Skipper, Stacie and Chelsea as their holiday vacation plans turn into a most unexpected adventure and heartwarming lesson. After a snowstorm diverts their plane, the girls find themselves far from their New York destination and their holiday dreams. Now stranded at a remote inn in the tiny town of Tannenbaum, the sisters are welcomed by new friends and magical experiences. In appreciation for the wonderful hospitality they receive, they use their musical talents to put on a performance for the whole town. Barbie and her sisters realize the joy of being together is what really makes A Perfect Christmas!",
      "similar": [],
      "original_title": "Barbie: A Perfect Christmas",
      "runtime": 74,
      "poster_path": "/u14NrsyD9h505ZXs5Ofm7Tv3AuM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-07-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Baldo"],
      "runtime": 74,
      "synopsis": null,
      "writers": ["Elise Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2091240/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTEwNjU5NzE3NDheQTJeQWpwZ15BbWU4MDUxMzYwNjAx._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Diana Kaarina, Jennifer Waris, Rachel Harrison | See full cast and crew »"],
      "reviews": [
         "It was... alright. Pros - cheap movie you can give to your little girl who'll watch it that year and never watch again. Cons - they didn't even TRY to disguise the fact that each character has a different singing voice from the speaking voice. It makes it hard to like the music in the movie. Story line is dreary - maybe Christmas movies are just spent. Music isn't memorable - again the obvious voice differences were annoying. I was surprised - the movie was actually not that great at all. Not worth it in my opinion. I really don't have any more to say about it. I would buy any other Barbie movie, hands down, but this one was not worth the anticipation. 2/10",
         "The storyline and message is passable but the voice acting leaves much to be desired and the singing is TERRIBLE. I understand that they wanted Barbie to be more \"modern\" so they had a casting change from the original woman who voiced Barbie. But if she is going to sing she should still have a gorgeous, stunning voice. The singing voice of Barbie (and every other character) is disappointing. The songs had so much potential but I can barely stand listening to these average voices. Especially considering the singing voice Barbie used to have (Kelly Sheridan). What a let down, I hope the producers take note. Barbie is supposed to be what everyone else deems as the perfect person...good at everything...except apparently singing. Sure, her voice is more raspy and \"modern\" now but being modern doesn't mean you need to sing like an amateur. And what's with the child's voice? She is what, 6 or 7? Why isn't a child of that age portraying her? The animation has also gone downhill since A Mermaid Tale and Fashion Fairy Tale. I hope this is a one time flub and Mermaid Tale 2 will bring back the awesomeness of the other films. And please, if she's going to do another film where she is singing, BRING BACK KELLY SHERIDAN. What you have done to Barbie is not awesome, cool, trendy or modern. You are making her boring, average, shallow and untalented.",
         "For my sins, I am watching random movies all with 'Christmas' in the title until the Great Day itself. My first two choices were disappointing to say the least... So what's next out of the hat? Well, let's see. Oh dear. Oh dear, indeed. Well, let's look at the positives shall we? Animated films are usually short, right? So It'll all be over before I know it. Plus, my nails are getting kinda long. I could always give them a trim with my teeth. Aanndd... I'm struggling. Lord help me. I'm not even a drinking man... Which is a shame, as a bottle of whiskey would make watching this 'thing' a whole lot less painful. In the end, I just grabbed a note pad and made... notes about every sappy song, each in-your-face moral about FAMILY BEING THE MOST PRECIOUS GIFT OF ALL at Christmas and all the appearances from cute critters till the blessed end. And let me just say... There was a LOT of them. As for the characters... Barbie is perfect, her younger sister Skipper(?) idolises her, there are two bratty kids who squabble, yet make up at the climax.(OF COURSE) and... that's about it. My other scribbles seemed also be along the lines of \"WTF A pink Christmas Tree!!\" and \"References to GPS and blogs... OMG Barbie you so modern\". Nothing too cohesive, but it was a darn sight more intelligible than this lobotomized, lifeless, dead-on-arrival pap. Let your daughters stick with the plastic figures... They could create a more interesting story in one wet afternoon than is present here. And 'wet' is most definitely what we're going to be getting this year I'm afraid... 2/10",
         "I have made no secret of having a soft spot for the Barbie movies. Neither of them are perfect movies or among the best movies I've seen, but they're charming and mostly have their heart in the right place. I had mixed feelings on A Perfect Christmas. It is better than A Fairy Secret and Fashion Fairytale, but not as good as Nutcracker, Diamond Castle, The Prince and the Pauper and Island Princess. What I didn't like very much were the character designs which consist of big heads and eyes and tiny mouths(though thankfully Barbie doesn't look as anorexic as she did in Fashion Fairytale for instance) and the singing which not only sounded forced but completely different to the voice actors. Regarding the voice actors they aren't as stilted as in Fairy Secret and Fashion Fairytale but lacking the fluency of Rapunzel for example(plus Kelly Sheridan is sorely missed). And there are times where the dialogue is corny, though thankfully less \"bad-attitude\" driven Fairy Secret and Fashion Fairytale. However, the character designs aside, the backgrounds are less rough and more colourful though still not as stunning as Nutcracker, Swan Lake and Diamond Castle, and the music is very sweet and catchy. I also admired the story, which had more heart than especially Fairy Secret, and the message is of the importance of Christmas, a step in the right direction compared to the hate and vanity that Fashion Fairytale seemed to promote. The characters are well-meaning and cute in general, not as spirited as in earlier entries(Rapunzel, Three Musketeers and Nutcracker as examples) but not the stereotypical brats from Fairy Secret and Fashion Fairytale. So overall, passable, not among the best or worst of the Barbie movies. By all means it could've been better, but compared to Fairy Secret and Fashion Fairytale it could've been worse as well. 6/10 Bethany Cox",
         "I'm going out on a limb here to say that I really did find this story to be sweet and entertaining. I'm a novice to these types of movies: I'm a 40-year-old working professional who has a 2-year-old, and I'm discovering the world of childhood video delights and travesties late in life. This was my first Barbie video experience, and I was unexpectedly delighted with it. Yes, the story is not as magical or infused with supernatural creatures as many cartoons, but it's a simple, home-spun story. A family, dreaming of a perfect Christmas in the Big Apple, get stranded in a tiny mid-western town due to bad weather. When it becomes clear they're stranded there, they're sure their Christmas will be ruined. However, it's only when they have time to reflect on what they already have that they learn the true meaning of Christmas. I thought it was very enjoyable, though very young children may not be as engaged as grade school children. It's worth checking out!",
         "When I first put this on for my girls I thought I'd bought a rip off of a Barbie film or something! This is so unlike any of the other Barbie films. I have sat through all of them with my daughter with a little bit of guilty pleasure as the songs are usually fun and the story lines are well thought out. As another reviewer mentioned, the voice acting is awful and almost painful to listen to. The story line is basic and it just seems like they must have really rushed this film to get it out in time for Christmas as there was so little thought that went into it. They definitely need to take a step back towards their older films. I disliked the changes they made recently by giving them all giant heads (!) and they always did the classic stories very well. Having said that most of the films have been fairly fun and entertaining. This was not. They definitely need to bring back Kelly Sheridan for the voice acting. However, for a 5 year old this was good viewing. My children enjoyed it though I don't think (and hope) that it won't be one that gets chosen all the time."
      ],
      "genres": [
         "Animation",
         "Family"
      ],
      "productionCompanies": ["Technicolor Digital Productions"],
      "summaries": ["Barbie and her sisters have a whirlwind of activity as they pack and prepare for their big trip to Manhattan, It's December 23rd, where they're going to have The Perfect Christmas! Mom and Dad are already in the city for work, so it'll be wonderful to meet them there for the holiday."],
      "budget": 0
   },
   "movielensId": 115929,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-07-01",
      "dvdReleaseDate": null,
      "directors": [
         "Terry Klassen",
         "Mark Baldo"
      ],
      "runtime": 74,
      "movieId": 115929,
      "title": "Barbie: A Perfect Christmas",
      "mpaa": "G",
      "actors": [
         "Diana Kaarina",
         "Jennifer Waris",
         "Rachel Harrison",
         "Nevada Brandt",
         "Lauren Lavoie",
         "Danielle Bessler",
         "Ashlyn Drummond",
         "Lucia Vecchio",
         "Maryke Hendrikse",
         "Allie Feder",
         "Aidan Drummond",
         "Alistair Abell",
         "Patricia Drake",
         "Chiara Zanni"
      ],
      "imdbMovieId": "2091240",
      "originalTitle": "Barbie: A Perfect Christmas",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Join Barbie and her sisters Skipper, Stacie and Chelsea as their holiday vacation plans turn into a most unexpected adventure and heartwarming lesson. After a snowstorm diverts their plane, the girls find themselves far from their New York destination and their holiday dreams. Now stranded at a remote inn in the tiny town of Tannenbaum, the sisters are welcomed by new friends and magical experiences. In appreciation for the wonderful hospitality they receive, they use their musical talents to put on a performance for the whole town. Barbie and her sisters realize the joy of being together is what really makes A Perfect Christmas!",
      "tmdbMovieId": 77499,
      "avgRating": 2.1875,
      "releaseYear": "2011",
      "numRatings": 16,
      "posterPath": "/u14NrsyD9h505ZXs5Ofm7Tv3AuM.jpg"
   }
}