{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0324038",
      "video": false,
      "title": "Special Forces",
      "recommendations": [],
      "backdrop_path": "/vWiw89VmkII31S4sJiVnuf1kNGV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Major Don Harding",
               "gender": 2,
               "credit_id": "52fe4936c3a36847f818efc7",
               "name": "Marshall R. Teague",
               "profile_path": "/qRDCvSWg76O071pggoGeru30SGk.jpg",
               "id": 63941,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jess",
               "gender": 2,
               "credit_id": "52fe4936c3a36847f818efcb",
               "name": "Tim Abell",
               "profile_path": "/jTRTWvth6CMApbomOoMuMCI0z8t.jpg",
               "id": 99235,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Wyatt",
               "gender": 2,
               "credit_id": "52fe4936c3a36847f818efcf",
               "name": "Troy Mittleider",
               "profile_path": null,
               "id": 226338,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Bear",
               "gender": 0,
               "credit_id": "52fe4936c3a36847f818efd3",
               "name": "Danny Lee Clark",
               "profile_path": null,
               "id": 140078,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Wendy Teller",
               "gender": 1,
               "credit_id": "52fe4936c3a36847f818efd7",
               "name": "Daniella Deutscher",
               "profile_path": null,
               "id": 168025,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Reyes",
               "gender": 0,
               "credit_id": "52fe4936c3a36847f818efdb",
               "name": "T.J. Rotolo",
               "profile_path": null,
               "id": 200150,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Hasib Rafendek",
               "gender": 2,
               "credit_id": "52fe4936c3a36847f818efdf",
               "name": "Eli Danker",
               "profile_path": "/g6xL7z946FYpHR5l80MAK9QCyeE.jpg",
               "id": 78111,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Talbot",
               "gender": 2,
               "credit_id": "52fe4936c3a36847f818efe3",
               "name": "Scott Adkins",
               "profile_path": "/mX5vlgiyJ8XdvBUMlFe6FVQ9YDh.jpg",
               "id": 78110,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4936c3a36847f818efbd",
               "name": "Isaac Florentine",
               "profile_path": "/4PJrg3l105M2GMNazhu2DXZ1Wce.jpg",
               "id": 78108,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4936c3a36847f818efc3",
               "name": "David N. White",
               "profile_path": null,
               "id": 141171,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.135365,
      "production_countries": [],
      "id": 57483,
      "vote_count": 8,
      "budget": 0,
      "overview": "When the crazed commander (Eli Danker) of a sadistic army in Moldavia kidnaps an American photojournalist (Daniella Deutscher) and holds her hostage, his misguided actions ignite a targeted response from Maj. Don Harding (Marshall R. Teague) and his trained squad of special forces soldiers. With help from a local schoolteacher (Scott Adkins) who's trained in martial arts, Maj. Harding readies his troops for an all-out offensive.",
      "similar": [],
      "original_title": "Special Forces",
      "runtime": 93,
      "poster_path": "/naQMaMYD3LJUGDHqPhdMUuaLwJM.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "2003-06-06",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Isaac Florentine"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["David N. White"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0324038/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTUxNTEwMDI4OV5BMl5BanBnXkFtZTcwMDI2MzAwMQ@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Marshall R. Teague",
         "Tim Abell",
         "Danny Lee Clark"
      ],
      "reviews": [
         "Director Isaac Florentine's follow-up to his cult hit, U.S. Seals 2 revisits America's military with more Hong Kong style action and martial arts. Budgeted at a mere $1.3 million, Special Forces manages to push the limit on action filmmaking within a grimly patriotic story set in the shadow of the bloody Bosnian-Serbian conflict. Although unrelated to U.S. Seals 2, Marshall R. Teague returns, this time to headline the film as Major Don Harding, in addition to acting as military advisor. He's the real deal when it comes to portraying a no-nonsense military officer. His mostly non-emotive persona, echoed by hisfellow team members offers a nice stabilizing force to ground the stylized action. Wendy Teller (Daniella Deutscher) is an American photo-journalist in theEastern European country of Moldavia who stumbles upon local military forces executing villagers. The commander is a veteran of the Bosnian War named Hasib (Eli Danker) who captures the woman and attempts to exchange her for captured war criminals. Its a bad call as the only response he gets is Major Harding and a team of Army special forces flown in to rescue her. Once down, they settle in to discover her whereabouts with the aid of a local schoolteacher and a seasoned SAS operative named Talbot (Scott Adkins). A bitter, past encounter with Hasib fuels Harding's desire for revenge as well as to save the journalist. But after an attempted rescue is thwarted, his team members are either killed or captured. Armed with lethal martial arts ability, Talbot steps in to assist Harding in completing the mission. Director Isaac Florentine has toned down the stylized action for this film while retaining the excitement of previous efforts. His credits include directing 70 episodes of the popular children's action series for television, the Power Rangers. This fact and his love for modern Japanese action filmmaking in general has led to his past use of exaggerated sound effects and camera work suitable for genre filmmaking, but often at odds when paired with real-world scenarios. Initially, martial arts combat is used sparingly and with quicker results in neutralizing targets, more in keeping with real combat training. This limited display of hand-to-hand combat may come as a bit of a disappointment to some, but the film adequately compensates in two ways. First, there is relative newcomer Scott Adkins, who plays the Special Air Service operative. He's appeared in smaller roles in films such as Extreme Challenge (2001) and The Highbinders (AKA The Medallion). This could be considered his first breakout performance as a martial arts star and an impressive one at that. This leads to the second compensation for action buffs, the end fight. You know its coming. The lead villain's sidekick, who does little else throughout the film is present for the sole purpose of taking on Adkins. This scene is outstanding and features the highly competent choreography of Akihiro Noguchi, another Power Rangers veteran. But this is no kid's stuff. Scott's kicking ability and range of motion are outstanding. The fight is fierce, extended, and only briefly interrupted by Teague's less potent, but solid brawl with Eli Danker. There may be more gunplay and explosions than anything else, but Adkins' two or three fight scenes are good enough to warrant martial arts fans taking more than a passing interest. Any way you slice it, Florentine, himself a martial artist, is clearly committed to filming some of the best martial arts scenes outside of Hong Kong. Its all the more impressive given that he's doing it on a small budget and in an industry not always receptive to allowing quality martial arts in their films. Special Forces also scores points for it's ambitions. The film begins with a sobering mass execution of innocent civilians by machine gun. To know that similar acts have actually occurred in numerous countries and in many conflicts, especially in recent years, sets this film apart from your standard independent action film. This was written after 9/11 and was originally meant to be set in Afghanistan, putting it in touch with the fight against terrorism. Due to a change of plans, location shooting moved to Lithuania and the film's backdrop became ethnic cleansing. The authentic setting and the assistance of the local military further raise the scale of the film. Depicting the role of America's special forces to any degree of authenticity presents many challenges and this cast and crew surmount some of them. But in the end, Special Forces remains a stylized action movie first by giving way to heroic fights and even bigger fireballs. For perspective, the Navy Seals actioner Tears of the Sun starring Bruce Willis shares the same fate on a $70 million budget. The small budget is a limiting factor, but quality fight choreography, decent acting, and a notable action performance by Scott Adkins makes this effort Florentine's best yet.",
         "[Note that there are 2 different direct-to-video movies named \"Special Forces\". One of them stars Daniel Bernhardt (Bloodsport sequels, Matrix Reloaded) and has a black & white cover. This one stars Marshall Teague and is a bit newer.] I cannot believe it. Isaac Florentine's \"Special Forces\" may be the first low budget, direct-to-video action movie to succeed in satisfying the military/gun nuts, the martial arts fans, and general action fans all at once. It's even fairly well-made in terms of direction and production value. First, there is plenty of gunplay and it manages to look vaguely authentic. The soldiers use proper shooting stances, keep their fingers out of the trigger guard, move & cover semi-relistically, and, unlike most low budget 'spec ops' movies, it looks as if the firearms were chosen because they were credible as US special ops weapons and not because they were the only ones available to the production. I wonder if this is due to Marshall Teague? On the special features of the Criterion Collection DVD of \"The Rock\", Teague is seen with a real Navy Seal demonstrating realistic weapons handling. Perhaps he brought this knowledge & training over to this film? On an even more pedantic note, several of the scenes where the soldiers were undercover in town reminded me of the fictional novels of Dick Marcinko, the Navy Seal legend turned best-selling author (Rogue Warrior, etc). Playing mind games and staredowns with the goons, evading tails, etc. A bit of a nice touch if you're familiar with Marcinko's work, though obviously it may be a completely unintentional similarity. Second, the martial arts fights are very good! The final battle is blazing fast, energetic, and brutal. Whoever choreographed it certainly knows the specific rhythms and timing of a good Hong-Kong-style fight scene. The hand-to-hand fights are kept mainly to the latter half of the film. Before that, there are some quick takedowns and exchanges where you can see glimmers of this HK-style flair, but they are kept low-key so that they simply add a bit of energy to the proceedings without constrasting too much with the realistic gunplay. Lastly, Florentine's direction is solid. He knows how to shoot and edit an action scene for both clarity and excitement. Thank goodness that he's not one of those MTV directors who feels the need to cut every half-second, chopping up every action scene into an incoherent blur. When so much work has gone into staging the action scenes, it's nice that he lets them play out clearly on screen. The non-action scenes are handled competently as well. There's an occasional bit of visual style here and there, but basically he just keeps things moving along and rarely if ever looks amateurish. You could call it a smooth professionalism. They also make great use of their Eastern European locales. It's scenic and absolutely believable for the story. Overall, \"Special Forces\" is an enjoyable action flick featuring an unusual amount of detail & competence dedicated to the staging of its action scenes. If you're familiar with the direct-to-video military action genre, this is certainly one of the better ones.",
         "The only reason i've watched this badly filmed, cheap military action, is that another IMDB member said that there is \"an unusual amount of detail & competence\" in this movie. Neither detail, neither competence however can be found in it! There's total lack of realism, behaviour of the special force squad is against all army regulations and common sense! Weapon handling is comic, and ballistics are absolutely fake. This is an brilliant example of cheap millitary style movie! The only thing that deserves attention is the brilliant martial arts performance by Scott Adkins /SAS agent Talbot in the movie/. This guy is something serious! Overall, one of the worst military movies in terms of filming, scenario and realism i've ever seen.",
         "This is certainly the most awful movie ever done. The action scenes are expensive and ridiculous, five guys fight an army in open field with a van. A helicopter is destroyed and the same army who did it can't destroy the van. The enemies jump in the air ridiculously when shot, a guy kills a lot of people with a punch in the stomach or opening a door strongly against them. The acting on this film is terrible, the direction is horrible. I'm out of adjectives, I've just seen it and came here to comment. I dare anyone to see the whole movie.",
         "I happened to see it last night, and I watched it just because it was so horrible. I don't get it. Why producers waste 1,3 mil $ on complete trash like that? No originality at all. Stupid enemy soldiers, who preferred to run towards Americans rather than shoot at them. So it's kind of miracle, how they managed to kill most of American soldiers. They also look all the same, probably there were total 10 actors who died at least 5 times in different scenes. Then there were ultimate heroism-scenes, you know, wounded American soldier blew himself up with 3 enemy soldiers and so on. And over-the-top boring main villain, who does usual bad boss stuff, i.e. shooting old ladies who then fall in slow-mo, \"brutally\" beating up some prisoners etc etc. And extra tough boss' assistant, who looks like IT-nerd. When independent studios have capital, and they have a WILL to do movies, why they still do non-original crap like this film, \"Base II\" and so on? Gosh! M",
         "One of the first things i have to say - this movie is just awful, horrible acting combined with terrible script. all the shooting scenes are as unrealistic as it can get. the bad guys cant hit the good guys even at the distance of 10 meters. bad guys holding their AK assault rifles always storm towards the good guys waiting to be shot and killed. WHY Aren't THEY SHOOTING? maybe this is because many of the bad guys have wooden weapons. yes, they have wooden Kalashnikov, the parts that are supposed to be made form metal are just painted black. another scene - the good guys driving with minivan and they get shot at by dozens of bad guys with kalashnikovs - NONE, not a single one of the high powered assault riffle bullets manages to penetrate thin sheet metal of the minivan. and it gets even worse. one of the good guys is shot in the head, somewhere near his left ear and HE DOESN'T DIE!! in fact he continues to drive on with a minivan and do several drivebys to closing enemy soldiers and kill dozens of them before he is finally taken down by enemy bullets. some of the special effects are made by using BAD computer graphics, like the rescue helicopter that is shot down by anti aircraft missile... when the final rescue helicopter(computer animated blackhawk) comes and rescues few good guys who managed to survive, THERE ARE NO PILOTS FLYING IT when it rises up after rescuing good guys. enemy soldiers have no intelligence whatsoever, even a bunch of stone age warriors with wooden clubs would have no troubles of defeating the demented soldiers armed with Kalashnikov in that movie. i feel sorry for everybody who have wasted their time watching this movie. it wouldn't be as bad if it would be a comedy, but it is really terrifying that the authors of this movie were thinking they are doing a serious and realistic(what a laugh) war movie. it is really harder the get even worse.",
         "This movie looks like it was made my a combination of the United States government and the makers of the punisher.. The characters were simply awful. Bad acting combined with bad scripts made this a horrible watch. And the cocky attitude of everyone in this movie was disgusting.. They simple came across like rednecks who had seen too many war movies when they were kids. Exaggerated overdone scenes that were meant as a recruiting tool as far as i see and watching the movie was a true punishment... There you have it.. if you are looking for a good movie to watch, don't come near this movie.",
         "Unbelievable shoot-outs where all the bad guys poured fire at the good guys, missed, the good guys shot back and killed everyone, the bad moaned dramatically the same when hit. Bad guys in armoured vehicles with cannon faced the good guys behind logs with small arms and never-empty weapons, good guys won. Amateur script, awful direction, with every stereo-type on screen, from all the bad guys speaking accented English, being brutal and callous whilst the good guys played with kids. Factual errors; a normal SAS team is 4-man, not 2-man. Only saving grace was Scott Adkins final fight, which showcased his extraordinary skills but went on for too long.",
         "Because here is everything what Special forces soldier can show.Great shooting and good cover from bullets cover,excellent martial arts performance tragedy about getting as Hostage and be scared for live!OK the best what I liked it is the operations what was planed in night as cover of the dark.It's like real Special forces team.And they also disarmer the bad guys with martial arts because they are economic their bullets .That's cool.Bud thing what I unlike is enemy soldiers bad shooting technique's and bad choreography.But only of them only was good Zaman(Vladislavas Jacukevicius) and Hasib(Eli Danker) they showed some good shoots to the enemies but other soldiers can not hit any shoot.And Talbot(Scott Adkins)who arrived with impressive shoots and martial arts performance.It's looked excellent!! But here was Isaac Florentine one of the best of his films.He got old and known action stars.Who do't know Marshall Teague or also Tim Abell.But most best job in martial arts showed famous English action star Scott Adkins.Who's one of the best action stars today.Also I liked how stuntman Vladislavas Jacukevicius showed athletic moves in the film.But he can not get be famous maybe later.But in Special forces all mentioned or not guys showed excellent film about Special forces!!",
         "This is one of the worst movies I've ever seen, and I spent my teen years watching Troma films and other crap horror. Actually the only reason I looked it up on IMDb after seeing it on a bus ride is because I seriously wondered if it was made by the US military, the patriotism was so over-the top. I mean, come on. These guys shoot one bad guy in the shoulder and he dies, but they are like superhuman tanks that keep running while getting gunned down, including shot in the head. What's even funnier is reading the reviews and seeing all of the Americans praising it as a great movie with realistic action scenes, and only the Lithuanians, Estonians, etc are the ones who notice how unbelievably biased it is. Like we Americans are so convinced of our natural superiority we don't even notice. My next suspicion, after US military propaganda film was that it was adapted from a video game, nothing else could explain the cartoonishness of the villains. But I was wrong there, too. To think that this is the best form some series, I can't even imagine what the worst looks like. I might look it up for a laugh.",
         "Far and away the best of the American Heroes series. If the other films only followed this one's lead, the series as a whole would be a lot better. But luckily for Special Forces, it stands alone as the clear winner. Jess (Abell), Bear (Clark), Wyatt (Mittleider), and Reyes (T.J. Rotolo) are an elite counter-terrorism team. They are under the command of Major Don Harding (Teague). When megalomaniacal dictator Rafendek (Danker) kidnaps and imprisons American journalist Wendy Teller (Deutscher) in exchange for some of his \"freedom fighters\" to be released from Guantanamo Bay, the Special Forces are sent into the eastern European town of Muldonia to rescue her, and take down Rafendek and his men. Rafendek is the type of guy who massacres his own people for fun, and Wendy caught it all on film. He's also a Bosnian refugee that has a history with Maj. Harding. Not to mention the corrupt government officials in his back pocket. With the help of a British martial arts expert with motives of his own, Talbot, (Adkins) will they be able to take down this evil warlord gone rogue and save the girl - or will Harding relive his previous Bosnia experience all over again? Special Forces is much more watchable than the others in the series, even enjoyable! The plot is clearer, the camera-work is actually interesting, and there are hand-to-hand martial arts fights that really work, thanks to Scott Adkins, a likable presence who clearly could be the next Gary Daniels. The movie really stands on its own from the series, thanks to the capable direction of Isaac Florentine. We actually know who the Special Forces are, thanks to the very simple but tide-turning idea of showing their names on the screen when we first meet them. It may seem obvious, but it makes ALL the difference. Now we know who they are, as opposed to the mess of the other American Heroes films. The movie starts with more murders than ten movies of its kind put together, and the plot basically is these few Special Forces versus an entire army of bad guys. So needless to say there are countless deaths during the progress of the movie, and plenty of guns going \"pew pew!\", and the necessary guard tower falls and blow-ups, but you care more this time around. Especially with the revenge subplot involving Harding and Refendek. And with the addition of Scott Adkins, we get some well-staged hand-to-hand combat, not just mindless shooting. The final fight with Rafendek's beret-ed henchman is certainly a standout. We also get some classic catchphrases such as \"Smoking will kill ya!\", and some more tastefully done patriotism this time around. There's also some good atmosphere, and everything is just more competent here than in the other films. It should have been released during the golden video store era of the 80's/early 90's, instead of being lumped with the other \"American Heroes\" movies. If you watch one from the American Heroes series, make sure it's Special Forces.",
         "(Preface: Don't confuse this \"Special Forces\" movie with the Daniel Bernhardt \"Special Forces\" movie!) I like movies from the Nu Image filmstudio, and I also like movies directed by action king Isaac Florentine, so I knew I had to watch this. I was not disappointed. I will freely admit that this movie is not perfect. The CGI effects are obvious and clunky. There is little written to differentiate the protagonists from each other, and the bad guys are stock characters. The dialogue is often very familiar. And a large part of the first half of the movie is really slow and drawn out. But there are more positive things about \"Special Forces\" than negative. It is slickly shot, with clear photography and good lighting. The Lithuania locations are well chosen, and dressed with enough props and extras to look realistic. But the best thing about the movie are the action sequences. A lot of money was obviously spent on ammo and explosive devices, and the various shootouts are really exciting. Even better are the martial art sequences - these sequences can stand proudly beside martial art sequences from Hong Kong films. And the last forty or so minutes of the movie are non-stop action - you'll be barely given time to breathe! Just be a little patient during the first half of the movie, and you'll be rewarded with enough mayhem to really pump your blood.",
         "Director Isaac Florentine who also created other classic flicks, Undisputed 2 2006, Undisputed 3 2010, Ninja 2009, Ninja: Shadow of a Tear 2013 and another classic special forces flick, US Seals 2 2001 has created another gem in Special Forces. It stars Marshal Teague who has also been in another classic special forces flick, The Rock 1996 and the classic flick, Armageddon 1998 and Isaac Florentines US Seals 2. Also starring is Scott Adkins who has also been in other classic flicks, The Tournament 2009, Bourne Ultimatum 2007, Pit Fighter 2005, Re-Kill 2015, Jarhead 3: The Siege 2016, Hard Target 2 2016, El Gringo 2012 and other classic special forces flicks, The Expendables 2 2012 and Zero Dark Thirty 2012 and Isaac Florentines Undisputed 2, Undisputed 3, Ninja: Shadow of a Tear and Ninja. I enjoyed the action and violence. If you enjoyed this as much as I did then check other classic special forces flicks, Air Strike 2004, Sniper 2 2002, Commando 1985, The Expendables 2010, Direct Contact 2009, GI Joe: Retaliation 2013, Outpost 2007, Seal Team Six: The Raid on Osama Bin Laden 2012, Act of Valor 2012, Special Forces 2011, Wolf Warrior II 2017, American Assassin 2017, Sniper: Ultimate Kill 2017 and Marines 2003."
      ],
      "genres": [
         "Action",
         "Thriller",
         "War"
      ],
      "productionCompanies": [
         "Lietuvos Kinostudija",
         "Martien Holdings A.V.V.",
         "Millennium Films"
      ],
      "summaries": ["In a former Soviet Republic, the President is oppressing the people and with help from a former Bosnian General who's a sadist, he is extremely hated. An American reporter goes there to catch the atrocities on film but is caught. She is forced to make false statements. So the Americans sends a Special Forces unit to try and rescue her. It's a big deal for the team's leader because the Bosnian once captured him and tortured him. While there they run into a British agent who was sent there on a mission and they work together. But when they try to leave they're captured."],
      "budget": 2500000
   },
   "movielensId": 115953,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2003-06-06",
      "dvdReleaseDate": null,
      "directors": ["Isaac Florentine"],
      "runtime": 93,
      "movieId": 115953,
      "title": "Special Forces",
      "mpaa": "R",
      "actors": [
         "Marshall R. Teague",
         "Tim Abell",
         "Troy Mittleider",
         "Danny Lee Clark",
         "Daniella Deutscher",
         "T.J. Rotolo",
         "Eli Danker",
         "Scott Adkins"
      ],
      "imdbMovieId": "0324038",
      "originalTitle": "Special Forces",
      "genres": [
         "War",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When the crazed commander (Eli Danker) of a sadistic army in Moldavia kidnaps an American photojournalist (Daniella Deutscher) and holds her hostage, his misguided actions ignite a targeted response from Maj. Don Harding (Marshall R. Teague) and his trained squad of special forces soldiers. With help from a local schoolteacher (Scott Adkins) who's trained in martial arts, Maj. Harding readies his troops for an all-out offensive.",
      "tmdbMovieId": 57483,
      "avgRating": 3.28571,
      "releaseYear": "2003",
      "numRatings": 7,
      "posterPath": "/naQMaMYD3LJUGDHqPhdMUuaLwJM.jpg"
   }
}