{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 187,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2194326/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjgwNDg2Mzk2OF5BMl5BanBnXkFtZTcwNDAwNDEyOQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Don Henley, Glenn Frey, Don Felder | See full cast and crew »"],
      "reviews": [
         "I loved The Eagles back in the 70's, especially after I finished my military service. Now, watching this special, \"The History of the Eagles,\" and downloading lyrics, I can see that, even without the music, the words are pure poetry. Having taught poetry for nearly 5 decades, that is my ultimate test of whether the lyrics are real, authentic, if you can divest them of the music and they're still poetry. Only the best artists can maintain that precious risk; take away the musical safety net, which might even support a simple three chord progression, and if what you have is still addressing key tenets of the Human Condition, then you aren't merely experiencing entertainers, money makers, or businessmen, you and dovetailing delightfully with poets. Joe Walsh utters one of the most honest speeches I've ever heard a public figure deliver, and he struggles manfully, painfully, as if ripping heartfelt wisdom from deep within his being, about how in the final analysis, our lives are like fine-spun, intricately-woven novels; however, along the way, what we sense and experience is like running into a sudden comet or meteor, delectable or horrifying. Don Henley, who always seems to know just what to say in the moment or afterwards, described his immediate ambiguous feelings directly following the cessation in 1980 of the band's efforts: \"Horrible relief.\" I have to wonder how much of a gifted artist's time, effort, soul, life and genius they must invest. Henley comments that he often wondered why he was successful when equally-talented artists did not reach the apex of Henley's success. Glen Frey sends out a desperate, impassioned plea to his wife and children to support him and hope that their \"second act\" did not change him too drastically. I admired the coloratura guitar riffs of Don Felder, and I was deeply saddened, when I learned that he had been replaced in one furious collision of egos and cat fights, some borderline, behind the scenes; others, embarrassedly right on stage in front of cheering but partly bewildered audiences. Frey conjures up the perfect analogy between a good band and a baseball team. You are all aligned in teamwork, energy, synergy; however, you don't have the ball in your own hand all of the time. Felder craved more opportunities to sing. Frey himself admitted that the longer The Eagles were together, the less and less he sang lead. Why? Because they had Don Henley. Henley himself mused that Felder's insistence he sing lead on one song was tantamount to Henley's demanding to play lead guitar on \"Hotel California.\" I've watched this special now three times. It is so completely honest that no one individual emerges unscathed, yet most of them proceeded, like \"Hotel California\" not only from innocence to experience; but, moreover from some degree of benightedness toward a larger sense of awareness, maturity, good judgment and enlightenment as human beings, as artists, entertainers, writers, and people who realized how their creations behind the scenes and before jubilant audiences, mattered far more than they ever dreamed or feared or ever imagined could be realized. The deep lessons I derived focused upon Henley's efforts to save Henry David Thoreau's \"Walden\" from commercial vandalism and decimation; Joe Walsh's gratitude at being driven to rehab so that he, too, could experience \"A Second Act\" with his band mates. I think that \"The History of the Eagles\" should be required viewing of any budding producers, agents, or artists. It is one slice of life, one sobering view of fame, celebrity, success and failure, of Phoenixes emerging from their own self-induced immolation, of a group of young men growing up as their country and citizens in it also evolved painfully, sometimes jubilantly, with a lot of luck and some daunting disappointments. Watching the movie is almost like watching and listening to a magician explain patiently how the trick worked as well as disclosing those times when it didn't work.",
         "Remember in THE BIG LEBOWSKI, when Jeff Bridges as \"The Dude\" complained so much to his cabbie about turning off \"Peaceful Easy Feeling\" because \"he hates the F-ing Eagles, Man\"! That rant got him evicted from his cab and earned him a long walk home from Malibu to his crappy apartment. Was it worth it? Well, The Dude just might change his tune if he checks out the new documentary HISTORY OF THE EAGLES currently running on Showtime. I recently watched both parts over two days, and it was well worth the time spent. Even though I never really was a big fan, I can most assuredly say that these guys were truly the biggest American band of the 1970's. Pretty much every album from their 1st through Hotel California was a part of the soundtrack of my teenage years. And as Don Henley mentioned in the beginning of Part 2, with the advent of classic rock radio in the early 80's, they've been constantly with us all the way through 2013. The songs were so good that we just never get tired of them. As far as the movie goes, much like the recent Scorcese long film about George Harrison and P. Bogdanovich's nearly 4-hour marathon on Tom Petty, it's all good. I'm convinced cable TV is the best way to show a rock doc., as you really get to tell and see it all with numerous interviews of those who lived it, without having movie theater time constraints and/or box office totals to worry about. And wow, did the Eagles have a whole bunch of video which I'd never seen. Some of it's great, much of it is \"disposable\", but almost all of it fascinating for fans. I read some of the comments on the IMDb board bashing Henley and Glenn Frey for coming off as \"pompous a-holes\". And while they did seem a bit overly protective of their cut of the band's fame and fortune, they have the right to. THEY STARTED THE BAND! Watch this film if you've ever yelled along while driving with the woo-hoo-hoos on \"Already Gone\", as it will flash you back nicely to the fun of the mid-70's. P.S.-And Dude, I know you once did your wacky dance to The First Edition's \"Just Dropped In (To See What Condition My Condition Was In)\", but you may want to skip over the part in the film where Kenny Rogers discusses helping Henley's pre-Eagles band Shiloh try to get started in LA. You will not recognize Kenny and may be a bit frightened with the condition his face's condition is in these days!",
         "One might think that should there ever be a Mount Rushmore of country rock, they may well etch the faces of the Eagles into the cliff side. However, they might need some time, for there have been quite a few comings and goings and line-up changes in camp Eagles over the years. This documentary ventures into the first chapter of the band's existence and provides evidence of the rifts, drifts, differences and fallouts that have occurred. It is probably fair to say that the Eagles are one of the most notoriously disharmonious of bands, who inexplicably and ironically orchestrate some of the most harmonious musical harmonies of any group since CSN. It is still a struggle today to meet a band that matches up vocally. Although they may not straddle the earth with an omnipresence that marked their original inception and 1970s heyday, the reformed country rockers are still synonymous with classic radio and the rock album format. Running at 2 hours, there is a lot of ground to cover. For a casual viewer, there is a mercifully breezy skip through respective childhoods and the pace is pushed with momentum towards the inspiring and prolific late-60s underground music scene of LA that homed residencies of Poco, Buffalo Springfield, Joni Mitchell, Jackson Browne, Linda Ronstadt et al. There is acknowledgment as to the creatively incestuous backdrop of the times, of the area and of the era. The sort that enabled artists to shift, move and collaborate seemingly at will. As the late 60s moved into the early 70s and success increased for the bulk of the aforementioned artists, it is clear that all look back with giddy rose-tinted glasses of nostalgia. The creativity was clearly as intoxicating as the drugs that they were recreationally self-medicating. The Eagles were always a band that stood apart from their peers. They did so for a few reasons. One, is that they were massively successful in a way that the others could only dream of, another is that they had a steely core that made them efficiently consummate and business-like. Both of these aspects are highlighted by the documentary. The band reflect openly upon their motivations and inclinations, with a mix of new interviews and footage that dates back to the period. To see how much and how little they've changed is part of the joy of the feature. Around the mid-point, Joe Walsh arrives into the frame and is spotlighted in both the past and the present as an impassioned guitarist who is part-talent, part-court jester. His phrasing exudes a humorous hybrid of Keith Richards and Stephen Stills along with a healthy dose of his own breezy personality. For a music film, the tone is more or less consistently serious throughout, so his appearance offers some light hearted respite. On the downside, there is not as much insight into the studio processes as a fan may want, but the band members are all given a fair hearing from both time periods and talk candidly about being in the epicentre of the Eagles whirlwind. Understandably, Part One ends on a decisively sour note; their downfall and break-up. Although the pressures of topping the totemic Hotel California engulfed them all to a certain extent, it is clear that decisive fractures of the intragroup relationships had crippled the band. It is also evident that the distractions around the process was a demon that gobbled them up. Power may corrupt and absolute power may corrupt absolutely, but I am sure there is a pithy equivalent for success. Life in the fast lane had brought this group crashing into a ditch. This is a tale that has enough acrimony to give Pink Floyd a run for their money. They may have been back together since 1994, as they will happily testify, but in case you're wondering, they only speak to Don Felder through lawyers. Some things don't change and won't be taken easy.",
         "After watching this again I still feel this was a monetary project from start to finish. It is nice to sit back and enjoy some of the music that you remember so well from the 70's decade. It is a pity that today's kids have nothing in the form of music or an identity that I had as a teenager in the seventies period. They have their phones and social internet and nothing else. There is not a single musician today that can even come close to entering the hero spaces musicians had in my teen years such as Dylan, Lennon, Roger Waters, down home southern poets like R.VanZant, and yes, Henley and Frey. For this reason I can relax some of my initial reaction to their egomania which is still painfully obvious. Don Henley's reaction to his very successful solo career which led to some masterful music in my opinion he just blows off with \"I won some awards and had some hits\" and finishes with his usual bombardment of everyone else and their unwillingness or inability to reach his own genius level-mainly producers, agents, songwriters and other musicians. He comes across as a total a$$ and seems to know it and not care the least-so be it. The total highlights of the entire program belong to Joe Walsh for his honesty and in an indirect way to Linda Ronstadt and her blossoming sexually and \"voice as big as a house\" that I remember so, so well from that period. Again, there is nothing or no one today in terms of young female singers, that could match her talent or her effect on young men that I also remember so well- Henley's admission that she was \"one of the boys\" also reflects as an identical feeling I had about her at that time. The star of the show is Joe Walsh as he seems so separated from the narcissistic love Henley and Frye have for themselves. His honest approach comes off as realist and sincere especially his reflections on how he remembers that era, as if it were a fiction novel, and using it for an example-brilliant! Perhaps some young people will take to heart what he has to say and use it to improve their own lives. All the partying and some senseless nudity come across as flush material and the catfights between the former and current members of the group are nothing new to even casual fans of the band. I saw the Eagles live once during the Hotel California tour and their abilities as a live band, along with inspiring melodies and well rehearsed harmonies, were the impression I remember even today. Lynda Ronstadt was also touring with Jackson Browne about the same time and, of course, her show was unforgettable to say the least. All in all this is a good production and I think people can use the ole saw \"take what you want and leave the rest\" and find this an enjoyable program to watch. pa How can you write a spoiler for a music program about 40year old songs?",
         "The reviewers before me have pretty much summed this film up. I would put my money on 80% of the viewing demographic will have grown up with the Eagles and many of them, like myself, would know them first and foremost for their music. All of us have heard snippets of stories and probably read differing opinions as to how they imploded and reassembled and then generally just came and went again at random. Many of us would have been to a concert, possibly more than one and seen them in the flesh, marveling again at their magical ability to blend voices and instruments into some of the best music produced in modern times. This documentary knits it all together. There will be millions of words written online over the coming months and perhaps years critiquing this film for better or for worse. I have adopted the stance that this is a group of musicians that are just as human as all the rest of us, extraordinarily gifted in their chosen fields and were at the intersection of preparation and opportunity just at the right time. The addition of a copious amount of personal home movie footage, some never aired before adds the essential layer to the production and wraps the package up like a tightly constructed wine. I'm sure there are many who will be watching this who will see themselves in the background of some of the footage, even at the third encores and will will be gasping in their living rooms grateful for the fact that the passage of time is the best camouflage for human recognition. Could you just imagine...\" OMG Mom, I don't believe you did that ! How am I going to explain this to my friends !! \"",
         "There was a lot of speculation on the \"Why the Eagles split up\" and without giving too much away this does answer a lot. Some people have said in musical fields that Glen Frey is an ego- maniacal, glory-seeking, talentless musician. The reality is between Glen Frey, Don Henley, Timothy Schmitt, Randy Meisner, J.D. Souther and Jackson Browne, the Eagles possibly have more hits than most bands could hope for since the Beatles. There is a feeling of an arrogant man in the way Glen Frey presents himself and as the movie clearly states it was not until Frey decided he was ready that The Eagles could reform and play again. The different ventures each went on and the use of musicians in Henley's solo career such as Pino Palladino certainly give Henley more musical kudos in some circles than Frey will ever get, but the reality is together they wrote great songs. The same was said of Lennon and McCartney in other ways. Simply as the title of this summary says, he that writes owns. Any musician ever involved with any label or record company as it used to be known, knew that \"He that pays owns\". This is no different. So basically,they can do whatever they like. The glue that holds them together is the songs and if I was to pick the most likable person and peacemaking soul that holds the band together, where humanly possible, it would be Timothy B Schmitt who Frey could take some humility lessons from because he comes across as what his critics say in paragraph #2. All that said and done, it is one of the better historical and pedagogical films made and worth watching if you liked the Eagles music which I did. There are sad moments and one cannot help but feel sadness at youthful ignorance and the pitfalls of the industry, but it is a great eye opener and worth the money to buy the DVD. :)",
         "Don't walk into \"History of the Eagles\" expecting an actual history of the band. This is a story steeped in revisionism, told from the perspectives of Glenn Frey and Don Henley. And you don't get far into the film before you start to wonder what's been left out. This is a band with an almost legendary period of drug use, infighting and unchecked egos, and only a fraction of the bad stuff is paid any lip service; just a formality so they go back to self-praise. Randy Meisner and Bernie Leadon don't receive any attention once they've left (no insight or commentary). Two integral founding members are but a memory. But the film's biggest disappointment is the short shrift given to Don Felder. We don't get much in the way of input from him as Frey and Henley continue telling the story. He had legitimate issues with the way the band was being handled (power being taken away from himself, Timothy B. Schmidt and Joe Walsh, getting screwed out of song credit and royalties), but they're summed up with \"Felder was unhappy\". But I was surprised to hear the audio between Frey and Felder as they were figuratively at each other's throats in 1980. Equally surprised that David Geffen flat-out stated that Don Henley is a malcontent (not that anyone else was lining up to say anything less than flattering about the man). The Eagles are the quintessential American band, and their story deserves to be documented in full. This is little more than a puff piece. Which is hilarious because Glenn Frey still comes off as a dick. 5/10",
         "I found this on Netflix streaming movies. I am roughly the same age as most of the member of the Eagles group, I have some recollection of hearing their songs back in the 1970s but nothing more. I knew absolutely nothing about them. I had no idea who Glen Frey and Don Henley were in the 1970s. Jump to the 2000s, maybe 10 or 12 years ago, a friend gave me the DVD of the Eagles returning to performing as a group in 1994, \"Hell Freezes Over\", because they once had said hell would have to freeze over before they reunited. The DVD itself is great, it gives a bit of the preparation they went through to get a few new songs and get concert ready. They coined the inside phrase \"are you puking?\" because that is the feeling they were to get as they were nervous about performing again in front of a big audience. So I only knew them as 40-something men, clean-cut and business- like. But this documentary \"History of the Eagles\" shows them starting out as kids, in their early 20s, scruffy with long hair and a few beards. And then there was Joe Walsh, by his later admission always on drugs and/or alcohol during his waking hours, a talented musician who loved to trash hotel rooms just for the fun. I believe he said his record was $28,000 damage to one room. As Henley says, many hotels banned them from ever returning. But they obviously had talent and they pooled their talent to become one of the most successful groups of the 1970s. Their \"Hotel California\" will likely live forever. The film also traces their issues with managers, producers, and recording companies. And how strong personalities caused them to quit in 1980. Now late in life the biggest revelation is Joe Walsh, he was forced by Henley and Frey to enter rehab before they would try to reunite. Walsh now says they saved his life and in fact he is a much nicer person in old age. Now I am an even bigger fan of the Eagles. This film documents what they went through, but I suppose it isn't greatly different from what many similar bands went through during that period. Or perhaps any period!",
         "I remember the Eagles as a kid when they had a few hits in the British charts but it was not the music I grew up with. By the time I was a teenager they had already broken up. They were a band I got to know retrospectively through their hit songs and then later their new songs after they reformed in the 1990s. So I arrived to this two part documentary rather fresh knowing little about the band apart from band members Don Henley and Glenn Frey had pop hits as solo artists in the 1980s. Part one focuses on the formative years of the musician from being kids onwards, the early days of the band until they hit the big time and their creative tensions leading to their breakup. Its a fascinating and informative story for me. I had no idea that such a Californian sounding rock/country/blues band recorded their early work in London and how much they were in awe of the music of The Who, Beatles, The Rolling Stones. The band has gone through lineup changes with disputes among band members. Joe Walsh with his past demons comes across as the most honest in the documentary, Frey and Henley as the victors and the defacto leaders of the Eagles get to write their version of the history.",
         "**CONTAINS SPOILERS** This is not watching the \"Eagles\" & their history? This, is living it! It's an extremely well done story of the band! It's \"Ups & Downs\", personal relationships & absolutely the best music from days gone by! The only complain I'd have? Is the show at the Capital Center, being too short! Amazing performances, when young & wild, all 2 weeks before the \"Hotel California\" album came out & seeing that song played in 1977 is worth the price of the entire package! I saw that tour & the memories rush back to that time! If you're an \"Eagles\" fan? This is a must get! Brutally honest, no sugar, yet nothing but a great story, told candidly & very well produced! The production should have been nominated & The Music? Not nominated? It's so sad there's no category for \"Classic Rock\"? Parents? Will never buy more music than kids, of all ages!"
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Jigsaw Productions"],
      "summaries": ["The life and times of the super successful American soft-rock band, Eagles."],
      "budget": 0
   },
   "movielensId": 116002,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-01-19",
      "dvdReleaseDate": null,
      "directors": ["Alison Ellwood"],
      "runtime": 186,
      "movieId": 116002,
      "title": "History of the Eagles",
      "mpaa": "",
      "actors": [
         "Don Henley",
         "Glenn Frey",
         "Timothy B. Schmit",
         "Joe Walsh",
         "David Geffen"
      ],
      "imdbMovieId": "2194326",
      "originalTitle": "History of the Eagles",
      "genres": [
         "Documentary",
         "Music"
      ],
      "youtubeTrailerIds": ["MkYZrcJzY-M"],
      "plotSummary": "Alison Ellwood’s intimate, meticulously crafted patchwork of rare archival material, concert footage, and unseen home movies explores the evolution and enduring popularity of one of America’s truly defining bands.",
      "tmdbMovieId": 159140,
      "avgRating": 3.7037,
      "releaseYear": "2013",
      "numRatings": 27,
      "posterPath": "/f1Br9MR7AKVn8B5lUoPaO0YTU78.jpg"
   }
}