{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pregnant minor",
            "id": 5808
         },
         {
            "name": "children",
            "id": 10103
         }
      ],
      "imdb_id": "tt0150111",
      "video": false,
      "title": "Children of the Corn V: Fields of Terror",
      "recommendations": [
         25750,
         25752,
         25753,
         25748,
         25749,
         70575,
         32595,
         38499,
         35945,
         36421,
         38500,
         33519,
         18009,
         25754,
         29794,
         55377,
         76171,
         19286,
         19288,
         52263
      ],
      "backdrop_path": "/frk5Gtc0f8M2TRkhDUkUI9L9jRu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Allison",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ad97",
               "name": "Stacy Galina",
               "profile_path": null,
               "id": 102728,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Greg",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ad9b",
               "name": "Alexis Arquette",
               "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg",
               "id": 19578,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kir",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ad9f",
               "name": "Eva Mendes",
               "profile_path": "/6JoVMpn0CcZwb6JK7XW2E6ntU52.jpg",
               "id": 8170,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Tyrus",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ada3",
               "name": "Greg Vaughan",
               "profile_path": "/qhTCuqFmGu34HKwk941UgZvl0f5.jpg",
               "id": 102729,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Charlotte",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03ada7",
               "name": "Angela Jones",
               "profile_path": "/p7pNCt4uBTDk9kRkPU3BFfXfEPq.jpg",
               "id": 71836,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lazlo",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03adab",
               "name": "Ahmet Zappa",
               "profile_path": null,
               "id": 86906,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Sheriff Skaggs",
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03adaf",
               "name": "Fred Williamson",
               "profile_path": "/tc4K1y80KA8RrVR8tvmSNCuvWa8.jpg",
               "id": 9811,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Jacob",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03adb3",
               "name": "Dave Buzzotta",
               "profile_path": null,
               "id": 56574,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lily",
               "gender": 1,
               "credit_id": "52fe44dbc3a368484e03adb7",
               "name": "Olivia Burnette",
               "profile_path": "/cn8n42CWGUSBI1NNiarVIP9Lyr6.jpg",
               "id": 27261,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ezeekial",
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03adbb",
               "name": "Adam Wylie",
               "profile_path": "/qSeYVaE3HKf62J4WQY12mEAKjbz.jpg",
               "id": 21402,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Luke Enright",
               "gender": 2,
               "credit_id": "5620d514c3a3680e19007931",
               "name": "David Carradine",
               "profile_path": "/wCvrY9PUKtN6NwkmLHWLJivCCov.jpg",
               "id": 141,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "5620d524c3a3680e19007934",
               "name": "Kane Hodder",
               "profile_path": "/1bTc6ACp6bLCBhhfNUZyqwnZ5fY.jpg",
               "id": 62596,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad87",
               "name": "Ethan Wiley",
               "profile_path": null,
               "id": 69331,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad8d",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03ad93",
               "name": "Ethan Wiley",
               "profile_path": null,
               "id": 69331,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03adc1",
               "name": "Jeff Geoffray",
               "profile_path": null,
               "id": 59003,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03adc7",
               "name": "Walter Josten",
               "profile_path": null,
               "id": 59004,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dbc3a368484e03adcd",
               "name": "Jeffrey Kurz",
               "profile_path": null,
               "id": 1099671,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03add3",
               "name": "JoAnn May-Pavey",
               "profile_path": null,
               "id": 16638,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03add9",
               "name": "Paul Rabjohns",
               "profile_path": null,
               "id": 67695,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dbc3a368484e03ade5",
               "name": "Peter Devaney Flanagan",
               "profile_path": null,
               "id": 40269,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55434ccac3a3680cd5001903",
               "name": "David Lewis",
               "profile_path": null,
               "id": 576249,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.21355,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25751,
      "vote_count": 42,
      "budget": 0,
      "overview": "Six college students take a wrong turn and find themselves lost in a strangely deserted rural town... only to discover that this deceptively quiet place hides a murderous cult of children controlled by evil forces. Yet even as bodies begin cropping up all around them, the young friends decide to stay and rescue the children... or die trying.",
      "similar": [
         298312,
         77949,
         10320,
         7326,
         601,
         15373,
         46705,
         150540,
         342473,
         9355,
         20352,
         394823,
         394117,
         290637,
         11637,
         5123,
         137116,
         9339,
         57431,
         103663
      ],
      "original_title": "Children of the Corn V: Fields of Terror",
      "runtime": 83,
      "poster_path": "/w3ZOi0jbHNEQ26MEt1X3XCJzBYe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Blue Rider Pictures",
            "id": 2623,
            "origin_country": ""
         }
      ],
      "release_date": "1998-06-21",
      "vote_average": 4,
      "belongs_to_collection": {
         "backdrop_path": "/g4aK8Up5zSegesJdMYbxDcndn20.jpg",
         "name": "Children of the Corn Collection",
         "id": 115225,
         "poster_path": "/v6auJblMcNxUmZx23mQXMHmzyY3.jpg"
      },
      "tagline": "In a deserted town... The terror continues!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ethan Wiley"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Stephen King",
         "Ethan Wiley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0150111/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NTQ4OTMyN15BMl5BanBnXkFtZTcwODQ5ODEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Stacy Galina, Alexis Arquette, Eva Mendes | See full cast and crew »"],
      "reviews": [
         "Unlike many people who apparently don't like the Children of the Corn sequels, I happen to believe this is the best one of the series, I simply love this film, I think it is a great Slasher flick, not scary, just lots of fun, the cast was atractive,it was well acted, it has several familiar faces and there was MORE blood and special effects THAN in a lot of recent mainstream movies.",
         "\"Children of the Corn V: Fields of Terror\" is the fifth in the series, and actually wasn't as bad as I was expecting it to be. Now I'm not saying it's great, but it wasn't a complete waste either. This film is about a group of teenage friends who happen to be driving through a small midwestern town that is home to more of the evil child cult. When they crash their car, however, and have a creepy encounter with the children who emerge from a cornfield, they decide to try and get help somewhere. They end up finding an abandoned farmhouse that is currently for sale, and decide it is perfectly okay to shack up there and raid the cupboards where the only find some Maracchino cherries. Of course, the house is right at the edge of a cornfield, where the evil kids are lurking. From there on, the friends begin to drop like flies, all meeting grisly fates from the children. This was alright, I was expecting something much worse (I usually expect the worst from films like this). The story wasn't really original, but none of these sequels are so that doesn't really matter. The friends decide they're going to try and help the children, which is rather ridiculous. The acting was a surprise, it was actually decent. The only cast member I recognized was Eva Mendes from \"Urban legends: Final Cut\", the rest are pretty much unknowns. We had some good cameo appearance by David Carradine, an evil supporter of the cult, and Kane Hodder (who played Jason in some of the \"Friday the 13th\" films) in a minor role of a local bartender. I really didn't the movie was that bad though. Overall, this isn't as good as \"Part IV: The Gathering\" was (in my opinion at least) but it was an alright follow up. Don't take it so seriously, you might enjoy it. Of course it's campy, but in a good way. 5/10.",
         "This one is the best so far, by far, it actually holds your interest unlike the other films with the exception of part III that holds your interest all the way up to the lamest ending of all times. Part V stays with it's farmlike and ccountrylike setting and is yet another story of a child who teaches about \"He who walks behind the rows\" (not rose for some of you calling it that) and he brings a bunch of kids ranging from 12-18 to serve \"He who walks behind the rows\" by killing the adults and anyone who will not join or threatens them, etc. There are 4 characters that we concentrate on all the way 'til the end of the movie which has the best ending in the series with more excitment muck like \"Children Of The Corn II: The Final Sacrifice\" 's ending. I won't spoil it for you but for once all this phsyco kids that follow him are gona get what they deserve. Part 6 in the series comes out 10/19/99 and will have the return of Issac (part 1) and hopefully will end the series because it is getting old, but if it's anything like this one fell free to make some more sequels. *** stars",
         "I just love it. I truly believe this is a great slasher film. The effects were bloody, it has a high body count, an extremely attractive cast, and besides the killing there's a sub-plot and it has a few twists. The best one of the sequels!!!",
         "\"Children of the Corn 5:Fields of Terror\" is actually better than the following entry \"Children of the Corn 666\".The acting is pretty good and the cameos by Fred Williamson,David Carradine and Kane Hodder are nice to see.The pacing is decent and there's a bit of gore.So if you like slasher/splatter movies give this one a look-I still think that Fritz Kiersch's \"Children of the Corn\" is the best of the series!My rating:6 out of 10.",
         "Six college students take a wrong turn and find themselves lost in a strangely deserted rural town... only to discover that this deceptively quiet place hides a murderous cult of children controlled by evil forces! The film features a young Eva Mendes' in her first movie. If nothing else, it seems that the \"Children of the Corn\" franchise was good for launching starlets' careers. Mendes follows in the footsteps of Charlize Theron and Naomi Watts. We have some great roles filled by Kane Hodder (as a bartender), Fred Williamson (a sheriff) and David Carradine (a prophet and savior). I think Stephen King appears as a drunk guy... I am still confused how this series was allowed to carry on for so long, but at least this one is saved by some good cameos and a fine special effects shot of a splitting head with a fireball inside. Totally did not see that coming.",
         "Plot: A car full of people driving on the back roads with ashes of a dead friend crashes in the hell of the cornfields. The towns Sheriff is Black Caesar aka Fred Williamson. The bartender is Jason Voorhees or better known as No-Neck Hodder. Even Grasshopper from Kung-Fu is on there. And that (thing)known as Alexis Arquette. As I have make mention before I hate COTC III: Corn in Chicago. And this is pretty good. My only gripes is that big eared boy from Kindergarten Cop he is just an annoyance..He's ugly and he's well Ugly. So if you hate Children of the Corn III then you love Children of the Corn V: Fields of terror",
         "Four friends end up in a seemingly deserted (and dangerous) town after crashing their car near at cornfield in Children of the Corn V: Fields of Terror. The film begins with a young boy being possessed by \"he who walks behind the rows\". Flash forward a year from then, and the little boy Ezekiel(who hasn't aged) is in charge of the other children in town similar to Isaac in the first film, Micah in II, Eli in III and Josiah in IV. Anyways, it's revealed that one of the of friends had a brother named Jacob who began worshipping \"he who walks behinds the rows\" as a child after she left him to live with their abusive father years ago. She finds out that some kids are \"practising\" the same belief so she, along with her friends, go to find him. They come across this sort of foster house where children live with a man named Luke. He is their adopted wards of the state. Eventually Allison finds Jacob who is under the control of Ezekiel. It's the eve of his 18th birthday, and as per Children of the Corn rules, he must die when he turns the age of an adult. Allison and the friends find out what Luke and Ezekiel have been doing and come together to put a stop to their treachery leading to a huge bloodbath. Children of the Corn 5 is a pretty good installment to the film series. It isn't anything special, but has it's moments. The acting is pretty good and the level of gore is decent enough. I liked the ending as well to this as well. Instead of ending it in the cornfields with the survivor walking away (which usually happens), it takes us a little further in time and concludes the film in an interesting way. I recommend it to horror fans and fans of the series. 5/10",
         "The video market is flooded with straight to video sequels that no one asked for. But then how come so many have been churned out? The best explanation may be that it's due to morbid curiosity. I can't deny that I am guilty of this, but those of us who are have to learn our lesson some time. The less money these poor excuses for film make the less there will be. Of course there are exceptions, but those are few and far in between. One of the biggest offenders is the 'Children of the Corn' series, which started out fairly well, but soon wore out it's welcome. The last installment turned out better than average and it really should have ended there, but money talks and the series that wouldn't die continued. Pros: Beautiful cinematography. Cast does well with the mediocre material. Some good and very bloody kills. Fast paced. Decent visual and make-up effects. A good, though forgettable score. Writer/director Ethan Wiley gives the film more style than it deserves. Cons: Brings nothing new or really interesting to the table. Devoid of good scares and suspense. Plot wears thin. Totally predictable and riddled with clichés. Leaves the door open for yet another sequel. Final thoughts: Not that any of the previous films are masterworks, but a few of them are pretty good. This fourth sequel is well made, acted, and is mildly entertaining, but instantly forgettable and is further proof that this concept about evil kids worshiping a deity in the corn can only be taken so far. At least it's better than the next two sequels, which truly are a waste of one's precious time. My rating: 2.5/5",
         "I've seen all the 'Children Of The Corn' films before this except for part 3. While part 1 was good and very thought provoking. Part 2 was lacking in alot of areas and the characters were lame. Part 4 was creepy but was a let down near the end with the showdown between the heroine and the main villain. Now comes \"Fields Of Terror\". The fifth installment of this series. I liked this one the most and I put it up there with parts 6, and 7 as being my favorite installments of this series. It started off very well with the guy getting smoked by a bolt of lightning after hes airlifted by the evil leader kid Ezekiel. Then his wife is done in by Ezekiels followers although its not shown on screen if you lsiten you know what happened to her wasn't pretty. The first 2 deaths of the group of teens were cool...and really showed how vicious these kids were. I think this group of kids is the most vicious I've seen in a COTC movie since part 1. The kid with the long hair and the tall kid in particular. I liked how they used the heroines brother in the story as a logical reason for her and her friends to stick around the town despite finding two of their friends dead in a crusher type machine. The movie had some nice dark parts to it. Like when the gang finds an abandoned house and decide to crash there for the night, and while they're sleeping one girl hears noises and goes to investigate. The house looked really creepy in those moments. and when they go outside to the cornfield at night after hearing a noise thats a really creepy moment as well. Those moments always have you expecting a kid to jump out and attack. Later on the girl finds her brother and realizes that hes in danger when he gives her a coded message written in the corn kids cult book. The occult stuff is kind of intersting. Especially when that Kira girl kills herself thinking she'll be with her recently killed boyfriend. It shows you how a person in a fragile emotional state can be easily seduced by cults into doing things like leaping into a giant flame or other dangerous things. The films last 20 minutes has some great scenes. Includidng the confrontation between Luke and the town Sheriff. In fact after Kira kills herself, the film starts to get creepy and picks up steam after explaning a few things before that about the cult and how adults are viewed as corrupters of children. Anyway the last 20 minutes has some great fight/chase scenes and one confusing scene where Ezekiel tells Allison that he put Luke to good use as their leader and then a flash of light comes from the corn silo at which Ezekiel turns around to see what the flash was giving our heroine Allison time to escape shotgu in hand. I have no clue what that scene was all about. My guess was HWWBTRS was upset that Ezekiel mentioned Luke as their leader when he's the one in charge. The fight scenes were especially good when the last 3 remaining teens escape into a barn where they find Allisons brother Jacob dying. The scene where she says good bye to her brother was emotional enough to pull at your strings a little. The fight scenes after that are great in particular the scene where Allison fights off one chainsaw weilding kid named Zane and when one guy sacrifices himslef in order to kill tow of the most vicious of the corn kids. Ezekiels speech to the remaining kids about their family lying broken and bleeding all around them was pretty cool. The fight scene between Allison and Ezekiel was pretty good. Especially when she turns the tables on him and flings him into the fire after hooking him through the hand with a hook like weapon. Although he was just a kid, after all the lives he had taken it was pretty easy to not cringe when he gets killed. One thing I didn't get about the film was why was fertilizer and gasoline the key to stopping the flame??? I guess its based on gasoline causes a natural fire and fertilizer is natural soil whereas the flame was unnatural and the soil in the cornfield was unholy so she needed the natural ingreedients to stop the unnatural force. The ending was pretty cool too. The parents of Lily the girl who was pregnant with Allisons brother Jacobs baby were completely aware of the child being evil. You can tell that they knew something was wrong with the kid the minute Allson steps into the house. The dad takes a huge sigh of nervousness. You can tell something wasn't right there also when they rushed out of the house leaving Allison with the baby. Why would they rush out of their own house instead of rushing Allison otu of their house and locking the door?? ASnyways, I liked this film, and give it 4 out of 5 stars. Ezekiel using his powers to ressurrect Luke as a puppet to use as the kids caregiver so as not to arouse any suspicion from the towns people or the police as to their true intentions was a good plot point added in by the writers. It would've been better though if we could've learned more about Lukes past but it's only a 1hr 22 minute film so what can you do."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Dimension Films",
         "Blue Rider Pictures"
      ],
      "summaries": ["Six college students take a wrong turn and find themselves lost in a strangely deserted rural town... only to discover that this deceptively quiet place hides a murderous cult of children controlled by evil forces! Yet even as bodies begin cropping up all around them, the young friends decide to stay and rescue the children... or die trying!"],
      "budget": 1650000
   },
   "movielensId": 116032,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-21",
      "dvdReleaseDate": null,
      "directors": ["Ethan Wiley"],
      "runtime": 83,
      "movieId": 116032,
      "title": "Children of the Corn V: Fields of Terror",
      "mpaa": "R",
      "actors": [
         "Stacy Galina",
         "Alexis Arquette",
         "Eva Mendes",
         "Greg Vaughan",
         "Angela Jones",
         "Ahmet Zappa",
         "Fred Williamson",
         "Dave Buzzotta",
         "Olivia Burnette",
         "Adam Wylie",
         "David Carradine",
         "Kane Hodder"
      ],
      "imdbMovieId": "0150111",
      "originalTitle": "Children of the Corn V: Fields of Terror",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["ZGnaj-lDCtA"],
      "plotSummary": "Six college students take a wrong turn and find themselves lost in a strangely deserted rural town... only to discover that this deceptively quiet place hides a murderous cult of children controlled by evil forces. Yet even as bodies begin cropping up all around them, the young friends decide to stay and rescue the children... or die trying.",
      "tmdbMovieId": 25751,
      "avgRating": 2.71429,
      "releaseYear": "1998",
      "numRatings": 14,
      "posterPath": "/w3ZOi0jbHNEQ26MEt1X3XCJzBYe.jpg"
   }
}