{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "juvenile delinquent",
         "id": 14857
      }],
      "imdb_id": "tt0055633",
      "video": false,
      "title": "The Young Savages",
      "recommendations": [
         86059,
         96366,
         118911,
         42713,
         296104,
         4999,
         38904,
         76140,
         42266,
         37380,
         8737,
         27635,
         51619,
         43045,
         100257,
         222593,
         118139,
         36495,
         80027,
         26174
      ],
      "backdrop_path": "/spKwVHuvZqj90nnJFjcDf3Auul7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hank Bell",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19c9",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Karin Bell",
               "gender": 1,
               "credit_id": "52fe49929251416c910b19cd",
               "name": "Dina Merrill",
               "profile_path": "/qDOsmYm22C4skFBmfiaVwb3kllL.jpg",
               "id": 58414,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "R. Daniel Cole",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19d1",
               "name": "Edward Andrews",
               "profile_path": "/naSCJGkfi7hbyohoUO122O37ROP.jpg",
               "id": 29719,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mrs. Escalante",
               "gender": 0,
               "credit_id": "52fe49929251416c910b19d5",
               "name": "Vivian Nathan",
               "profile_path": "/7do6pux59LVrdtaRQMID3yYfz9e.jpg",
               "id": 6442,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mary diPace",
               "gender": 1,
               "credit_id": "52fe49929251416c910b19d9",
               "name": "Shelley Winters",
               "profile_path": "/zVg966M0RVK5kycHZUEDc51QULV.jpg",
               "id": 7632,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Randolph",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19dd",
               "name": "Larry Gates",
               "profile_path": "/gfEgzWPQX1PeLBITN4LRo4jQn2V.jpg",
               "id": 3640,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Detective Lt. Gunderson",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19e1",
               "name": "Telly Savalas",
               "profile_path": "/pN5jiLdHKzDXn8GZHPnJHwdax1H.jpg",
               "id": 10169,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Louisa Escalante",
               "gender": 1,
               "credit_id": "52fe49929251416c910b19e5",
               "name": "Pilar Seurat",
               "profile_path": null,
               "id": 151803,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Angela Rugiello",
               "gender": 1,
               "credit_id": "52fe49929251416c910b19e9",
               "name": "Jody Fair",
               "profile_path": "/70LGYFdb1heq5UkbQ0xWkilKs7J.jpg",
               "id": 247856,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Jenny Bell",
               "gender": 0,
               "credit_id": "52fe49929251416c910b19ed",
               "name": "Roberta Shore",
               "profile_path": null,
               "id": 153720,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Dr. Walsh",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19f1",
               "name": "Milton Selzer",
               "profile_path": "/104NuoOSNK1pDgCgUjYqP2jsqNF.jpg",
               "id": 101901,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Judge",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19f5",
               "name": "Robert Burton",
               "profile_path": "/kmmkntCe9ovlOdda68mCrFSNZ75.jpg",
               "id": 31260,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Barton",
               "gender": 2,
               "credit_id": "52fe49929251416c910b19f9",
               "name": "David J. Stewart",
               "profile_path": null,
               "id": 126900,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Danny diPace",
               "gender": 0,
               "credit_id": "52fe49929251416c910b19fd",
               "name": "Stanley Kristien",
               "profile_path": null,
               "id": 1039986,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Arthur Reardon",
               "gender": 2,
               "credit_id": "52fe49929251416c910b1a01",
               "name": "John Davis Chandler",
               "profile_path": "/66egeP4tNoXacifMfuzRuewcrRN.jpg",
               "id": 32786,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Anthony 'Batman' Aposto",
               "gender": 2,
               "credit_id": "52fe49929251416c910b1a05",
               "name": "Neil Nephew",
               "profile_path": null,
               "id": 32787,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Zorro",
               "gender": 0,
               "credit_id": "52fe49929251416c910b1a09",
               "name": "Luis Arroyo",
               "profile_path": null,
               "id": 206116,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Roberto Escalante (as Jose Perez)",
               "gender": 2,
               "credit_id": "52fe49929251416c910b1a0d",
               "name": "José Pérez",
               "profile_path": "/rON9BAauB6ErVzKKtAln1dE82VZ.jpg",
               "id": 109145,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Gargantua",
               "gender": 0,
               "credit_id": "52fe49929251416c910b1a11",
               "name": "Richard Velez",
               "profile_path": null,
               "id": 1039987,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49929251416c910b19c5",
               "name": "John Frankenheimer",
               "profile_path": "/q1TaCOAFmC1KNLHDVZhJhkvTSrr.jpg",
               "id": 13776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49929251416c910b1a17",
               "name": "Edward Anhalt",
               "profile_path": null,
               "id": 70997,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe49929251416c910b1a1d",
               "name": "J.P. Miller",
               "profile_path": null,
               "id": 81441,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.515255,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 86616,
      "vote_count": 11,
      "budget": 0,
      "overview": "A district attorney investigates the racially charged case of three teenagers accused of the murder of a blind Puerto Rican boy.",
      "similar": [
         819,
         11564,
         209276,
         227,
         41585,
         189312,
         13696,
         9768,
         52811,
         329819,
         15300,
         26516,
         47050,
         27973,
         114051,
         47211,
         13950,
         9791,
         115903,
         28000
      ],
      "original_title": "The Young Savages",
      "runtime": 103,
      "poster_path": "/wsl3nTqADdrpF1pnYVwuPHvwhOY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Contemporary Productions",
         "id": 14132,
         "origin_country": ""
      }],
      "release_date": "1961-05-24",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "HERE IS THE RAW TRUTH...NAILED TO THE SCREEN!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Frankenheimer"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Edward Anhalt",
         "J.P. Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0055633/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNTI5NTI2MF5BMl5BanBnXkFtZTgwNzE5Nzk1MDE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Burt Lancaster, Dina Merrill, Edward Andrews | See full cast and crew »"],
      "reviews": [
         "For The Young Savages Burt Lancaster went back to his roots. The actor was born and raised in the East Harlem section of Manhattan. At that time it had not become a Latino neighborhood, it was predominantly Italian where he grew up. To this day there are still a few Italian families in the area in and around Pleasant Avenue and neighboring streets. His had to be the only WASP family in the area at the time. In 1961 just as you see in West Side Story the neighborhood was divided with racial and ethnic tensions. But these kids don't sing and dance between rumbles. They are a hard bitten bunch of punks on both sides. In fact that's where our story begins as three Italian kids leave their turf and go and stab a blind Hispanic youth. It's a crime that shocks the city. Ambitious District Attorney Edward Andrews sees this as a case when successfully prosecuted could make him governor. He relies on one of his best men, ADA Burt Lancaster to bring home a victory and a trip to old Sparky as they called the electric chair in Sing Sing. Of course there's a lot more to the case than meets the eye both in the crime and in Lancaster's conflicted loyalties. He's happily married to pretty Dina Merrill from the suburbs. She's what you call a limousine liberal, one who's ideas are shaped by books instead of living the poverty she's studied in school about. I've met many like that and it really is true many conservatives are liberals who've been mugged. When one of the gangs gives her a bad experience, she sings a different tune. But where The Young Savages falls apart for me is the fact that Lancaster was once involved with Shelley Winters, the mother of one of the three defendants. I'm sorry, but right then and there Lancaster in real life would have recused himself from this case. Of course Winters appeals to him for old time's sake and Lancaster starts doing his own investigation and prods the police to do more on their end. In the film also Lancaster is from that neighborhood. His character's family name of Bell was once Bellini. Many families with ethnic names of all types anglicized them or had them anglicized by immigration officials. The film which according to a recent biography of Burt Lancaster was shot in 35 days on location in New York City. It was a project Lancaster did while waiting to do Birdman of Alcatraz. The Young Savages is notable for being Telly Savalas's big screen debut and for Lancaster using TV director John Frankenheimer on his first big assignment. Purportedly Lancaster was pretty rough on Frankenheimer, but in the end he impressed the star so that he did four more films with him including Birdman of Alcatraz. And Telly Savalas was in that one too. Though the film is based on one horribly bad premise, the acting and directing are not bad. I had the same criticism of 12 Angry Men in which another young talented director, Sidney Lumet got his first break. The Young Savages remains a graphic look at a seamier side of New York City during the Kennedy years.",
         "Overall the film is not an 8 but the cool parts just won't allow me to give it a lower score.When it was first released I was in junior high school and there existed a non-conformist society within a society.These non-conformists wore long dark coats(trench coats ?) and small brimmed dress hats.My older brother used this kind of dress,I thought it looked so cool.The best I could do was a hand-me-down off white coat that had been balled up in the closet.My big head size ruled out using a hat,instead of looking like a teenage gangster I probably resembled a juvenile Colombo.In the film the gang called the Horsemen dress in the coat and hat style,I really could relate to this cool look.Real gang members are used for some parts of the movie.The viewer sees a style of dress that really existed at the time,for me it's history preserved.The slang and look of the young people are what I like about this movie.Among them are Zorro,Pretty Boy,Gargantua and Batman.The outstanding one and for me the scene stealer of the movie is Arthur Reardon one of the accused murders played by John Chandler.Although only involved in violence twice in the movie he goes about it gleefully as it escalates.A complex person he grins telling how he wanted to live on a farm but his parents put him out on the streets to play with bad boys.Most of the time he is sneering giving indication many things in the world annoy him.His character would have no trouble fitting into a current movie. Soundtrack is very good and in one scene sets the viewer up for seeing Diavolo for the first time.The back of his jacket is something else,be ready for it they only show it for a second. The big finale court trial is unbelievable,a fairytale.About the most realistic scene involving Burt Lancaster is when he is at home talking to his wife and reflects on changing his name from Bellini to Bell.Probably especially after one of the Italian gang members yells..What's the matter you ashamed of being a W--?.This is not a Burt Lancaster movie/story,changes were made to fit his image.When asked by a gang member..Do you know why I stomped him? Lancaster gives the correct answer to show his so called tough up bringing.In the book Lancaster's character can't give the answer and is more meek.The character in the movie still has to take a backseat to the young persons maybe all the way to the trunk.Look for the emphasis on poverty,one gang leader lives in a crowded apartment with people laying around. It looks like a combination flop house/sweat shop where sleeping is done in shifts.My favorite touch is a rooster pecking around on the stairwell INSIDE the apartment building(a housebroken slum rooster?)",
         "***SPOILERS*** 1961 motion picture loosely based on the notorious August 30,1959 Salvador Agron \"Capeman killings\" in New York City's Hells Kitchen. The movie has the racial backgrounds of victim and killer reversed which made the film a bit disingenuous to the movie going public back then in 1961, just two years after that terrible event. The killer Salvador Agron was Hispanic and his two teenage victims, Anthony Krezsinski and Robert Young, were white. Three members of the white Manhattan street gang The Thunderbirds cross into Spanish Harlem on the turf of the local Puerto Rican gang The Horsemen and zero in on young and sensitive harmonica playing Roberto Escalante, Jose Perez,knifing him to death. Caught minutes after the killing are the three gang members Reardon Di Pace & Aposto, John David Chandler Stanley Kristien & Neil Nephew. With the city D.A Daniel Cole, Edward Andrews, wanting a first degree murder conviction of the three teenage assailants, to give him a boost in the upcoming gubernatorial elections, he put's his best prosecutor on the case Asst. D.A Hank Bell, Burt Lancaster. With the three defendants claiming that they killed Roberto in self-defense their excuse falls apart like a house of cards when it's shown that he was totally blind and a threat to no one, much less themselves. It now starts to look like D.A Cole would get the first degree murder conviction that can send the three youths, all under 18, to the electric chair. Bell who at first had no idea who the three defendants were soon realized that one of the accused killers, Danny Di Pace, is the son of a woman Mrs. Mary Di Pace ,Shelly Winters,that he was in love with years before he got married to his present wife Karin, Dina Merrill. This made prosecuting Danny very difficult and painful for him. Slowly getting all the evidence in order and at the same time being attacked,far worse the his wife was earlier in the film, by gang members for doing his job Asst. D.A Bell finally gets to the bottom of the case. Bell finds out the real reason for Roberto's killing and it totally throws him off to what he's supposed to do in the case; get a verdict that would strap the three into the electric chair, regardless of their guilt or innocence, in order to further his boss' D.A Cole political career. A bit ahead of it's time \"The Young Savages\" goes into the mental mindset of the three accused killers of blind Roberto Escalante and comes up with some startling conclusions; all three were not in full control of themselves or in what they did so a first degree murder conviction was unable to be reached by the jury. Not that they got off Scot-free for their actions and Roborto himself was anything but the innocent bystander that he was made out to be by his friends family and the liberal newspapers. A cowardly bully with a deep inferiority complex who was the leader of the pack Arthur Reardon is given 20 to life. A mentally retarded and delusional Anthony \"Batman\" Aposto, who thinks that he's the Batman of comic book fame, ends up in an institution for the criminally insane until he's seen fit, by a battery of psychiatrists, to again become a member of society. It was Danny Di Pace who got off from getting heavy jail time, Danny got a year in Juvenile Hall, for just wanting to be a member of a street gang to have the family that he never knew but that involvement lead to Roberto Escalante losing his life. Hank Bell threw away whatever future he had in the New York State D.A's office by looking at the facts and perusing Justice instead of letting the three gang member fry for the sake of his, and D.A Cole's, future in state or national politics.",
         "This is one of those social conscience movies that were popular in the 50s and early 60s. This is not an especially good example of the genre. It follows prosecutor Burt Lancaster's investigation into a gang killing. The movie seems to be designed around a series of points the screenplay wants to make about the nature of slums and gangs and whether the death penalty is a good thing and that sort of thing, but it approaches all this in an unconvincing, mechanical manner. While the movie isn't all bad throughout, and seems vaguely interesting most of the way through, the trial at the end is so utterly absurd that it ruined what little momentum the movie had going. This is standard Hollywood law, in which Lancaster exhibits fairly incompetent prosecutorial behavior in his quest for \"the truth.\" The movie is sincere and has good credentials, so it looks like it should be a good movie, but it really isn't.",
         "This is the first of the several black and white films that Frankenheimer made in the sixties, most of them excellent. Although is not as good as The Manchurian Candidate or The Train it has also his usual rigor in the construction of a plot with political implications. Lancaster has a good performance, his appointments with the members of the gangs are enough believable and the trial scene reaches an adequate climax. The film starts with the murder of a blind puertorican boy by three italians guys, members of a gang. Lancaster, who was born in little Italy and has changed his surname Bellini to Bell has to prosecute them as D.A. despite of one of the italians boys is a former gilrlfriend's son. This was also one of the first playings of Telly Savalas and is remarkable that his performance as a cynical policeman prefigures his later successful in \"kojack\", although it wasn´t the most appropiate for this film.",
         "During this period, many juvenile delinquent films were released following the Hollywood success of The Blackboard Jungle with Glenn Ford in 1955. The cycle continued into the sixties when the juvenile films often turned soft or zany, such as the beach films. The delinquency films returned to a more hardcore approach with the advent of the motorcycle films from the mid sixties to the early seventies. John Frankenheimer was a director to be reckoned with from the fifties through the mid sixties. In The Young Savages, his second feature film, Frankenheimer directs Burt Lancaster as a crusading assistant district attorney who later finds himself second-guessing himself when prosecuting three Italian gang members for stabbing a blind Puerto Rican boy to death. The role is beneath Lancaster, and it becomes one of his standard portrayals of an intense character in growing conflict with himself over ethical issues. His performance is good, but toward the end of the film in the courtroom scene, Lancaster's character seems to take an about face in relation to his position as a prosecutor and from his earlier get tough approach; as a result, his concluding courtroom speech rings hollow and makes him sound like a political mouthpiece for the screenwriter. The film also glosses over the ethical dilemma of Lancaster prosecuting the son of a former girlfriend. The icy Dina Merrill represents the book-learned liberal faction of society insulated from facing the social problems the establishment attempts to come down on. Shelley Winters is always good, this time as an Italian mother with a son she's disconnected from. Edward Andrews is good as Lancaster's amoral, political boss. Telly Savalas appears in only his second feature film as a rough and tumble police lieutenant, a precursor to his Kojack persona. Luis Arroyo, the one time pitcher from the Yankees at the time, is Zorro (the Puerto Rican gang leader). The Young Savages attempts to do too much in one film, depicting juvenile delinquency as a social problem with varied causes seemingly to be studied and understood. Also the four main characters of Lancaster, Merrill, Winters, and Andrews appear to symbolize the various factions of society with a vested interest in delinquency as an issue; of course a couple are misguided. Neither gang is depicted as all good or all bad. The gang members appear to be acting a bit exaggerated in the film, which may have seemed necessary for the film to make its point, but today the performances simultaneously seem dated, tame, and, in the case of John Davis Chandler, over-the-top. Frankenheimer's early films, as did his early television work, move quickly with tense, emotionally packed scenes. He was also innovative with camera angles and stop action close-ups. The Young Savages benefits immensely from on location shooting in East Harlem neighborhoods where Lancaster grew up himself. The screenplay is based on Evan Hunter's novel: A Matter Of Conviction, the title deliberately ambiguous perhaps. This is probably Frankenheimer's weakest film from his first decade of directing. *** of 4 stars.",
         "The Young Savages (1961) Released six months before \"West Side Story,\" this elegant story of New York gang violence in the ghettos of uptown Manhattan is as powerful, and as beautiful. And the title makes clear that the movie is pointing to a new social problem, the immigrant gangs (Italian and Puerto Rican in this case). But in most ways \"The Young Savages\" couldn't be more different. At the heart of it all is district attorney Hank Bell, previously Bellini, played by Burt Lancaster in what struck me as possibly the most subtle role in his career. That's an absurd thing to know for sure, and Lancaster is so good so often it's easier to just say he is terrific, but if you know him from some noir films or from \"Birdman of Alcatraz\" or \"Judgement at Nuremberg\" you might know a more overtly dramatic actor. Here he is restrained in a perfect way, his pauses and his turned head adding depth to his apparent struggle with how to get at the truth as the events and the witnesses start to swirl out of control. A virtuosic performance. The themes are hot topic issues layered with good old fashioned love and loyalty. Mostly we have first and second generation immigrant trying to define themselves, to stake out a place in the city, and to fend off competing immigrant groups and sometimes invade their territory. Bell's own Italian-American background makes him understand the problems of youth violence from the inside, but he has avoided being identified as Italian, and even his wife doesn't quite accept him as an immigrant, but wants to see him as more like her, a Vassar girl. Which he is not, even if sometimes he passes as a Yankee or as an old stock New Yorker. Much of the movie is that wonderful quite and deliberate investigation of the crime, the facts, the witnesses, the evidence. And we see this through Bell's eyes. The last long section is pure courtroom drama, and it's as good as courtroom dramas get, gutsy and tense. In the biggest sense, real justice is achieved, even at the expense of some reputations or expectations around the D.A. (who of course is supposed to always want and get the death penalty). By the final turns of events, you see the story is really about a single man who struggles against his own bias and does the right thing, and does it well. Director John Frankenheimer once again pulls off a movie with social significance that doesn't forget it's roots in theatrical drama. Cinematographer Lionel Lindon is an old pro, starting with some 1940s boilerplate movies sprinkled with some gems (\"The Blue Dahlia\" is a great one) and then scores of television shows. And the next year, 1962, he shot \"The Manchurian Candidate\" which succeeds partly for its amazing visual pizazz. Here, there are both moments of beauty and of cacophony. The fight scenes, and the dazzling murder that starts the movie off, are mini-masterpieces. But even quiet moments are given anxiety and drama by shooting at sharp angles or by moving in close. It's quite a beautiful experience to watch this, even as the events are tumultuous.",
         "After the murder of a young Rican blind in a neighbourhood in New York by three boys Ital-Americans, the instructor of the district attorney's office \"Hank Bell\", (Burt Lancaster) decides, contravening its role, clarifying the facts and search for truth. During the investigation, \"Bell\" will be more or less pressured by all: both bands; its chief (future candidate for governor) who seeks the electric chair for the guilty; his former girlfriend, which is the mother of the main suspect; his wife, contrary to the death penalty. In his first job in the film, Frankenheimer took a novel of Evan Hunter and filmed with the great Burt Lancaster, who starred almost all his great films \"Birdman of Alcatraz,\" \"The Train\", \"Seven Days in May\". Frankenheimer carried out a strong criticism of the American society who blame, at least in large part, to be the cause of the existence of these bands, born of abject poverty. It also criticizes the justice in that country, \"that does not allow cross-examine a less than 16 years but it can \"frying\" in the electric chair. With Lancaster, the director leads us to slums, shows us the extreme poverty: girls prostitutes, entire families living overcrowded, young people who see violence as a way of life and only solution... But also, and is one of the points to highlight, although the company has much to blame, members of the different bands are displayed as unscrupulous people, and most enjoys with what you do not want to change anything from their bitter situation: some frightened his wife, others give him a beating, all want to end its rivals. We must emphasize the interpretation of Lancaster, who with this director always got magnificent interpretations. Also of Winters and the intervention of Home Antonio. In addition, good and proper musical score by David Amram that recur in \"The Manchurian candidate\". A hard and interesting film premiered the same year as \"West Side Store\", whose thematic links.",
         "Post-World War II, there was a rise in juvenile delinquency, and this was mirrored in films such as \"Blackboard Jungle,\" \"Rebel without a Cause,\" \"High School Confidential,\" and \"Knock on Any Door.\" Antiheroes like James Dean and Marlon Brando became popular, and sexual threats like Elvis Presley invaded music. To adults, the kids were out of control. \"The Young Savages\" from 1961 is another film looking at the rise in delinquency, this one starring Burt Lancaster, Shelley Winters, Dina Merrill, and Telly Savalas (in his film debut). Directed by John Frankenheimer, the film is an attempt to get at the psychological reasons behind the murder of a Puerto Rican boy in Harlem. Lancaster plays DA Hank Bell aka Bellini before his father changed it. He grew up in the neighborhood depicted. Now there is an ethnic division, the Italians versus the Puerto Ricans, with gang activity on both sides - West Side Story sans music. Hank Bell is to prosecute the juveniles accused of the stabbing, and one of them is the son of a woman (Winters) whom he once dated. She tells him her son could not have been involved in any murder and begs him to look into it. In real life I think he would have had to give the case to someone else, but here, he tries to find out what really happened. Along the way, he learns some things about himself. Like \"Knock on Any Door,\" \"The Young Savages\" endeavors to show what's behind the tragedy. Merrill is Karin, Hank's suburban life, with the liberal philosophy of one who doesn't actually deal with juveniles. She's a far cry from Hank's old girlfriend from the neighborhood - Hank has reinvented himself and has a debutante type for a wife. Partly from guilt, partly from \"there but for the grace of God,\" Hank throws himself into the case, endeavoring to see both sides, to the complete annoyance of his superiors. Good movie with an intense performance by Lancaster. The film is notable also for being Telly Savalas' first film, playing a police detective with shades of Kojak. The juveniles - Stanley Kristien, Neil Nephew, Luis Arroyo, Jose Perez, and Richard Velez, are all excellent. Though somewhat derivative, this is a good film -- Burt Lancaster's production company was associated with quality films, and this is one of them.",
         "John Frankenheimer directs this intense story of three teenage killers in New York City's Spanish Harlem and the idealistic DA(Burt Lancaster)given the job to prosecute them. Young gang members trying to protect their turf see no use in cooperating with the law. Lancaster plays the part as if he were Jack Webb. (That is meant to be a compliment). This movie also gives Lancaster the chance to work with Shelley Winters. (Wink, wink) Also in the cast are Dina Merrill, Chris Robinson, Edward Andrews and the debut of Telly Savalas. Very little actual violence, but some pretty good drama."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Contemporary Productions"],
      "summaries": [
         "A district attorney investigates the racially charged case of three teenagers accused of the murder of a blind Puerto Rican boy. He begins to discover that the facts in the case aren't exactly as they seem to be.",
         "After three teenage hoods stab blind Puerto Rican Roberto Escalante, assistant DA Hank Bell is tasked with prosecuting the case. He's looking for convictions for first degree murder for all three of the boys, even 15 year-old Danny DiPace, son of his old girlfriend, Mary DiPace. He grew up in the neighborhood and investigates the case with Lt. Gunderson. He learns that Escalante may have pulled a knife and was actually one of the leaders of the Puerto Rican gang that fought regularly with their Italian opponents. Bell's wife is upset at the prospect that he's seeking the death penalty for kids and he thinks she's just a liberal living in her own little perfect world. As he gathers more evidence however, he begins to see that it's all far more complex than it first appeared. He pursues justice in the case.",
         "In an area of Spanish Harlem controlled by the Puerto Rican-American gang the Horsemen, fifteen year old Roberto Escalante, a blind boy, is stabbed to death in broad daylight by three other youth in front of on-lookers. The three are apprehended and are supposed members of the rival Italian-American gang, the Thunderbirds: seventeen year old Arthur Reardon, sixteen year old Anthony 'Batman' Aposto, and fifteen year old Danny di Pace. The district attorney's office, led by Dan Cole, appoints Hank Bell to prosecute. Dan's choice is partly because Hank suggested first degree murder charges, which if achieved would help Dan's gubernatorial bid, but also because Hank knows the racially charged Harlem turf wars well since he grew up there. The one person who openly disagrees with Hank on prosecuting on first degree murder is his privileged wife, Karin Bell, who feels such charges especially against a fifteen year old are inhumane. Knowing the neighborhood and its people well, Hank investigates on his own, which places his and his family's life in danger as both sides try to use whatever methods of persuasion on Hank, including violence, implied or real, to get what they want. But Hank also tries to find out motivation for killing a seemingly non-gang related boy, who the three claim wielded a knife on them first and thus who they killed in self-defense. Arthur and Anthony's motivations become clear, but Danny is the big question mark, he who is deemed a good, bright boy by most around him, despite his solidarity in the killing with Arthur and Anthony. That investigation may be helped or hindered by the fact that Hank once seriously dated Danny's mother, Mary di Pace, who stands by her son's innocence."
      ],
      "budget": 0
   },
   "movielensId": 116012,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1961-05-24",
      "dvdReleaseDate": null,
      "directors": ["John Frankenheimer"],
      "runtime": 103,
      "movieId": 116012,
      "title": "The Young Savages",
      "mpaa": "",
      "actors": [
         "Burt Lancaster",
         "Dina Merrill",
         "Edward Andrews",
         "Vivian Nathan",
         "Shelley Winters",
         "Larry Gates",
         "Telly Savalas",
         "Pilar Seurat",
         "Jody Fair",
         "Roberta Shore",
         "Milton Selzer",
         "Robert Burton",
         "David J. Stewart",
         "Stanley Kristien",
         "John Davis Chandler",
         "Neil Nephew",
         "Luis Arroyo",
         "José Pérez",
         "Richard Velez"
      ],
      "imdbMovieId": "0055633",
      "originalTitle": "The Young Savages",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["2x8q0EHcSW4"],
      "plotSummary": "A district attorney investigates the racially charged case of three teenagers accused of the murder of a blind Puerto Rican boy.",
      "tmdbMovieId": 86616,
      "avgRating": 4,
      "releaseYear": "1961",
      "numRatings": 4,
      "posterPath": "/wsl3nTqADdrpF1pnYVwuPHvwhOY.jpg"
   }
}