{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "great britain",
            "id": 1025
         },
         {
            "name": "country estate",
            "id": 1610
         },
         {
            "name": "asylum",
            "id": 2884
         },
         {
            "name": "jesus christ",
            "id": 2974
         },
         {
            "name": "delusion",
            "id": 6262
         },
         {
            "name": "inheritance fight",
            "id": 156479
         }
      ],
      "imdb_id": "tt0069198",
      "video": false,
      "title": "The Ruling Class",
      "recommendations": [
         25495,
         3092,
         24965,
         34783,
         37853,
         21296,
         43028,
         12649,
         43048,
         11402,
         20372,
         17185,
         17409,
         18783,
         42879,
         29882,
         51619,
         42565,
         16515,
         71592
      ],
      "backdrop_path": "/aorPWXGPhteM64CwNoDAM1NYVaJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Arnold Alexander Tancred Gurney - 14th Earl of Gurney",
               "gender": 2,
               "credit_id": "52fe44489251416c9100b441",
               "name": "Peter O'Toole",
               "profile_path": "/7esSG4iZHueb5Nh8RBBhtRZLpom.jpg",
               "id": 11390,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bishop Bertie Lampton",
               "gender": 2,
               "credit_id": "52fe44489251416c9100b445",
               "name": "Alastair Sim",
               "profile_path": "/iAvHebiFHYIAJqDQWqLTB4NKvPo.jpg",
               "id": 20394,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Daniel Tucker",
               "gender": 2,
               "credit_id": "52fe44489251416c9100b449",
               "name": "Arthur Lowe",
               "profile_path": "/rpnKHoGKKuLVWO9CxjVI9i6ekd0.jpg",
               "id": 39024,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ralph Gurney - 13th Earl of Gurney",
               "gender": 2,
               "credit_id": "52fe44489251416c9100b44d",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lady Claire Gurney",
               "gender": 1,
               "credit_id": "52fe44489251416c9100b451",
               "name": "Coral Browne",
               "profile_path": "/nbUOn9NZSZFizwo1bB86OIKioeY.jpg",
               "id": 87513,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dr. Herder",
               "gender": 2,
               "credit_id": "52fe44489251416c9100b455",
               "name": "Michael Bryant",
               "profile_path": "/wsWNLeK6ek4KLUWgXbJomGNY32x.jpg",
               "id": 106612,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Grace",
               "gender": 1,
               "credit_id": "531f2fa392514177ab008d38",
               "name": "Carolyn Seymour",
               "profile_path": "/3byhqTWVshjTMmK8oywo3S5woqu.jpg",
               "id": 42970,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Matthew Peake",
               "gender": 2,
               "credit_id": "5a011407c3a368075600ab25",
               "name": "Hugh Burden",
               "profile_path": "/4z3dk7kMl6Ggnl9ZtAadGTxrij0.jpg",
               "id": 104658,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "McKyle",
               "gender": 2,
               "credit_id": "5a011428c3a36807c500a953",
               "name": "Nigel Green",
               "profile_path": "/dzMsll8MyI6GVBXAuu4igcJim3F.jpg",
               "id": 29909,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "McKyle's Assistant",
               "gender": 2,
               "credit_id": "5a011446c3a368072000aa38",
               "name": "Cyril Appleton",
               "profile_path": null,
               "id": 1098002,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "McKyle's Assistant",
               "gender": 2,
               "credit_id": "5a01145d925141572e00ac02",
               "name": "Leslie Schofield",
               "profile_path": "/r1WQsrbi1XkbfpORgrWTDNGQCKD.jpg",
               "id": 79489,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Kelso Truscott",
               "gender": 2,
               "credit_id": "5a01146e925141575000ae27",
               "name": "Graham Crowden",
               "profile_path": "/wyGg5BXqE1N8oG1Ag82I3yHYQdW.jpg",
               "id": 10654,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Fraser",
               "gender": 2,
               "credit_id": "5a01147f92514156e600b1e4",
               "name": "James Hazeldine",
               "profile_path": "/k6vaCPahjp4msGqVl36hFatL4V1.jpg",
               "id": 135101,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44489251416c9100b45b",
               "name": "Peter Medak",
               "profile_path": null,
               "id": 21377,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44489251416c9100b461",
               "name": "Peter Barnes",
               "profile_path": null,
               "id": 81506,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44489251416c9100b467",
               "name": "Peter Barnes",
               "profile_path": null,
               "id": 81506,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56548878c3a36850fa004c74",
               "name": "Jules Buck",
               "profile_path": null,
               "id": 1338878,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56548880c3a36850ec004316",
               "name": "Jack Hawkins",
               "profile_path": "/lqyKg1O0YTdrZ3gzogfqBNECv0f.jpg",
               "id": 10018,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56548888c3a3683ab60008a3",
               "name": "David Korda",
               "profile_path": null,
               "id": 21242,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "56548900c3a3685100004ac8",
               "name": "Ken Hodges",
               "profile_path": null,
               "id": 558444,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56548909925141055b00029b",
               "name": "Ray Lovejoy",
               "profile_path": null,
               "id": 244,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "56548910c3a36850f300465b",
               "name": "Maude Spector",
               "profile_path": null,
               "id": 10340,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "565489199251417010004326",
               "name": "Peter Murton",
               "profile_path": null,
               "id": 9918,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "56548921c3a36850f60044ae",
               "name": "Ruth Myers",
               "profile_path": null,
               "id": 19310,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "57e672cec3a368245a0068a7",
               "name": "John Cameron",
               "profile_path": null,
               "id": 19043,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.66169,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 30892,
      "vote_count": 36,
      "budget": 0,
      "overview": "When the Earl of Gurney dies in a cross-dressing accident, his schizophrenic son, Jack, inherits the Gurney estate. Jack is not the average nobleman; he sings and dances across the estate and thinks he is Jesus reincarnated. Believing that Jack is mentally unfit to own the estate, the Gurney family plots to steal Jack's inheritance. As their outrageous schemes fail, the family strives to cure Jack of his bizarre behavior, with disastrous results.",
      "similar": [
         583,
         335778,
         615,
         12545,
         11051,
         235260,
         8430,
         58433,
         127770,
         30628,
         54106,
         16668,
         272112,
         346873,
         119876,
         362685,
         98132,
         113734,
         450731,
         335923
      ],
      "original_title": "The Ruling Class",
      "runtime": 154,
      "poster_path": "/4TV1qeDMRHwrRudBIMkEF9KHWe4.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Keep Films",
         "id": 3862,
         "origin_country": ""
      }],
      "release_date": "1972-09-13",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Medak"],
      "runtime": 154,
      "synopsis": null,
      "writers": [
         "Peter Barnes",
         "Peter Barnes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069198/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MTAyMjk4MF5BMl5BanBnXkFtZTcwNjU4OTgyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter O'Toole, Alastair Sim, Arthur Lowe | See full cast and crew »"],
      "reviews": [
         "This movie has EVERYTHING!!!!! I'm serious. Does it have musical numbers? Yes, it does. Beautiful costumes, fabulous sets, serial killers, witty dialogue, burlesque striptease, opera and aristocracy, romance and insanity, jealousy and drama, comedy and theology? Yes, yes, yes!!! Oh, why couldn't there be more films like this? In a way, it reminded me of \"The Ninth Configuration\" although that movie lacked humor. Peter O'Toole is just gorgeous, as well. My father (psychiatrist) says that this film is just about the only accurate film representation he's seen of MANIA, but when i asked him about it, he didn't recall the musical numbers. So i suppose it's got something for everyone. I could write about THE RULING CLASS for hours and hours and compare it to everything in the entire world but i don't want to give anything away. This is an absolute MUST-SEE for anyone with an interest in film, England, mental disorders, or dancing the Varsity Rag.",
         "British `dark comedy' was possibly as its zenith with this rich Peter O'Toole offering by director Peter Medak. O'Toole is Jack Gurney, the youngest and `somewhat eccentric' heir to the House of Gurney. He suddenly finds himself being forced by his late father's will into taking up his role in British society - assuming the family seat in the House of Lords. The biggest problem is not that the late Earl of Gurney has just accidentally hung himself wearing a cocked hat and a ballet skirt, or that Jack has just released himself from `hospital' where the doctors were treating his `nerves.' No the biggest problem is that, on a good day, the new 14th Earl of Gurney thinks he's Jesus Christ and, on a bad day, he thinks he's Jack the Ripper! And if that mix of the macabre doesn't make you chuckle, try this unexpected twist. At several poignant moments throughout the film, the cast will suddenly break from straight-faced dialogue into a full-blown, song and dance numbers, some of which would make Busby Berkley proud. In one case, the tune of `Connect 'dem Bones' is ushered up to punctuate a scene with O'Toole lecturing the local gentry about the need for capital punishment. Herein lies one of the big reasons why this film is so off-the-wall and refreshingly funny. For my money, this is one of the most original, thought-provoking and honest critiques of the British class system ever to be put on film. O'Toole is simply mesmerizing as he juggles Jack's multiple personalities, the funniest of which is Christ or, as he prefers it, `J.C.' It's hysterical to watch the cumulative effect of J.C.'s `touched' outlook on the members in his stuffy, conspiring family who are out to get Jack committed permanently. A true `Must See Film' for anyone who enjoys a juicy, sardonic, intelligent black comedy, especially when the topic focuses on the silly pomposity of the British upper classes.",
         "Peter O'Toole has often played characters who are obsessed and even a bit mad. But in The Ruling Class he is utterly over the top crazy, and it's a bit disquieting how naturally he slips into the role. Yet this is a comedy, a wonderfully bizarre, often black comedy that deals with acceptable and unacceptable behavior -- insanity, and morality, being irrelevant. It's characters mostly belong the English elite, but they simply stand in for all those whose power and prestige demand that appearances be kept up. So this isn't a film for everyone. And some may not like the way it swings from the very flippant to the very dark. It requires a wide range of humor to enjoy it all. Unfortunately, I hear that enjoying it all may be impossible. It seems that all home versions are cut several minutes from the theatrical release, sometimes much more. The longest length available is apparently 141 minutes, so that is the one to get.",
         "A scathing and profoundly witty attack on Britain's social and political institutions with Peter O'Toole on his best ever form as Jack, the Son of an English Earl who inherits his Father's estate when the old man accidentally kills himself via auto-erotic asphyxiation. The only problem for Jack's relatives is that he's a paranoid Schziophrenic who thinks he's Jesus and they're quick to move for his indefinite committal when he starts to talk about the relinquishing of material possessions and tolerance toward all men. The Ruling Class is a film of two halves. The first is some of the best character comedy you'll ever see. As \"JC\" who wears glasses because he's cold, O'Toole commands every scene benefiting from some superbly written monologues and one liners, the standout being his pre-wedding speech on the cross and he's assisted by the creme de la creme of British character actors, Arthur Lowe a standout as the newly liberated Trokskyite Butler Tuck with a blatant contempt for his old masters. The second half however, is dark stuff indeed - jet black in fact. Apparenty 'cured' after an arranged confrontation with the AC-DC messiah, Jack dresses as a Victorian gentleman, talks about capital punishment and superior breeding and concerns no-one, the fact he believes himself to be Jack the Ripper going completely unnoticed by his peers who prime him for his climatic accession to the House of Lords. The conceit is milked for all its worth and the final scenes with a hallucinatory Jack looking at his fellow peers in the House as decayed corpses is a particularly chilling postscript to the story. Subtle? No way but its sledgehammer to the concept of patronage and privilege as a criteria for governance and influence. Like the best satire its savage, angry stuff - possibly overlong and too conscious of its theatrical origins but ultimately no less caustic or inventive for it. Class indeed.",
         "This is an excellent movie, but don't watch it expecting it to be purely a dark comedy. There is a lot of humor in it--often very bizarre humor--but it is primarily a very powerful statement about what can happen when, for the sake of social acceptability, a human mind is forced into a mold that doesn't fit. In my opinion, the British ruling class was chosen to illustrate this point only because they do have very rigid rules about what kind of behavior is socially acceptable and what is simply \"not done.\" It's statement about the dangers of excessive self-repression apply equally to us all.",
         "The Ruling class is a disturbing commentary on the nature and necessity of our whole belief systems. It both highlights the extreme fragility of those beliefs, and takes gently mocking aim at us for our dependency on them. Viewed in that light, the film succeeds 100%. When viewed merely as a satire on the British ruling classes, of course it doesn't. It goes far deeper, becoming also an essay on our tendency to manipulate others for our own benefit: the characters' collective idiosyncrasies serve as punctuation for that essay. Brilliantly acted, often hilarious but always profoundly moving, it is a genuine classic of its kind, notwithstanding its undeniable, though relatively minor, flaws. I'd love to have it on DVD!",
         "No other actor has had a career filled with more idiosyncratic roles than Peter O'Toole, and his role in \"The Ruling Class\" is perhaps the most idiosyncratic of them all. O'Toole plays the heir to a British House of Lords who dies accidentally (and bizarrely), leaving his family to hash out the estate. The family is much disturbed by the fact that O'Toole is the heir -- understandably so, since he believes that he's Jesus Christ. Much wackiness ensues, until O'Toole has a change of perspective and decides that instead of Christ, he's Jack the Ripper. More wackiness ensues, the film gets darker and darker in that way that only British films can, and the whole thing may leave you scratching your head but will no doubt also leave you gloriously entertained. For O'Toole fans, this is a chance to see him single-handedly carry a delirious mess of a movie on his shoulders, and make a rousing success out of it. Much of it doesn't make a lot of sense, but it's all a hoot, especially the impromptu musical numbers peppered throughout the film. There's some scathing satire aimed at the British class system, but it's nothing you haven't seen before, and the whole film has the feeling of being the pet project of an undisciplined director. But I highly recommend this, because you've never seen anything quite like it, and it's a chance to see one of our generation's greatest actors strutting his stuff like the pro that he is. Grade: A",
         "Back in 2001, The Criterion Collection saw fit to add \"The Ruling Class\" (1972) to their catalog; which means there is now a good print available in the correct aspect ratio, one that includes the entire original release running time of 154 minutes. It also means that \"The Ruling Class\" is now regarded in film circles as a \"significant\" movie. Of course almost any film student will tell you that \"significant\" is not necessarily synonymous with entertaining, critically acclaimed, or well-made. So if you are considering a purchase or have just had a confused post-purchase viewing experience the following discussion may prove useful. This is a British film, one I originally watched on the BBC a few months after its release. It was neither a critical success (mixed reviews) nor a box office sensation and hitting the BBC so soon after a theatrical release back then was not much different from going direct-to-video today. It was a counter-culture film, and much of my original enjoyment came from the obvious tweaking of certain cultural and political institutions. Much of this stuff has lost its power and appeal over the years. It has a lot of expressionistic and allegorical elements; this sort of stuff was (and is) relatively rare in an English language film and probably accounts for much of the current cult status of the film. The black comedy aspect of these elements has held up very well and you will understand the film better and enjoy it more if you don't take it literally. Jack, the 14th Earl of Gurney (Peter O'Toole), has recently inherited the family title and a place in the House of Lords of the British Parliament. The story actually begins with a cheerfully provocative black comedy sequence as his father, the 13th Earl (Harry Andrews), accidentally hangs himself while performing what is apparently a long-standing self-pleasuring ritual. Jack believes himself Jesus Christ and his family believes that they can get their hands on the estate once he produces an heir. Their idea being to have him committed and then become guardians of the child. Carolyn Seymour plays his uncle's mistress who is brought in to marry Jack. Her character throws a wrench in the works by falling in love with her new husband. Other than Jack, Seymour's character is the only one that undergoes any real change during the course of the film and she sells this transformation quite nicely while also providing one of the best striptease sequences you are likely to stumble across in a mainstream movie. As already noted the running length is 154 minutes, that's about the length of two movies and if the film were being produced today I suspect that it would be done as two separate films. Indeed it is really two stories with each having an entirely different tone. About midway through the film, the Jesus version of the 14th Earl is replaced by a Jack the Ripper version. In the process a farcical and relatively light-hearted black comedy is instantly transformed into a much darker story. Black comedy gives way to dark fantasy and hallucinations as the wheels fall off the story until a visually stunning ending. The 1972 theme being essentially that being forced to conform to the ritualistic practices of upper class British society produces a monster. That not being able to \"do your own thing\" unleashes a monster on the world. Unfortunately the basic cause and effect of this whole process is glossed over and one is left wondering why the film you have been watching has been replaced with something entirely different and far less entertaining. O'Toole underplays his two characters, don't expect a lot of Gary Oldham type excess. Jesus is more a mild narcissist than a booming holy roller. Jack (the Ripper) is much better mannered but obviously smoldering beneath his polite exterior. The laughs mostly come from the discomfort of Jack's family and from Alastair Sim's apoplectic bishop and Authur Lowe's collectivist butler who abuses the family with a \"Benson\" type frankness. There are two great musical sequences, a hunt club performance of \"Dem Bones\" (a homage to \"The Prisoner\") and the climatic scene in the House of Lords (a surreal montage of decay to the music of \"Pomp and Circumstances\" and \"Onward, Christian Soldiers\"). Then again, what do I know? I'm only a child.",
         "'The Ruling Class', released in 1972, is a farce on the British aristocracy, and (at least from this distance), you have to wonder if it is much less relevant today than when it was made. There is still a House of Lords, and it has taken the intervening 32 years to have fox-hunting almost banned. Briefly, the Earl of Guerney dies in a ridiculously fetishistic manner, and leaves his estate to his son, Jack, much to the outrage of his family, since Jack has been a voluntary mental patient for the past 8 years. A plan is hatched to marry him off, get a mail heir, and then through diverse intrigues, gain possession of the estate. Unfortunately Jack books himself out and shows up. Jack, who believes himself to be God, is played by Peter O'Toole, resplendent in Jesus hairdo and varying hilariously between Biblical sounding pronouncements and schizophrenic word-salad nonsense. Generally he is entirely manic, except when he is sleeping on the huge wooden cross, in full view of anyone who walks into the manor. This was made two or three years before O'Toole literally almost drank himself to death, and one gets the feeling that they didn't so much write this part for him as set him loose on the set and tell him 'Be yourself'. This isn't meant as an insult. O'Toole is utterly magnetic, whether making Shakespearean pronouncements, running madly about, or as his even more insane incarnation as Jack the Ripper after he is 'cured'. The film lurches from hilarious satire to very dark humour, containing scenes which are genuinely alarming if not outright terrifying (again, mostly thanks to O'Toole). Other standouts include Arthur Lowe as the long-suffering Communist butler, and Alistair Sim as a hilariously doddering bishop. The film itself is all over the shop. Even at the most unexpected moments, the cast is likely to suddenly break out into a musical number. Another schizophrenic patient is wheeled in who proclaims himself to be the 'High-Voltage God', and who can shoot 10 million volts from his fingertips (whether the lightning bolts crackling from his fingers are imaginary or real, who knows?). It can lurch from lunacy like this to genuinely chilling scenes including brutal violence and murder. Generally speaking the second half of the film, after Jack's 'cure' is much darker. The flaws? Well, I think the second half is definitely unnecessary long. My VHS copy is 156 minutes, and if the current version is 141 minutes, that could be an improvement, if they carved some of the later scenes out. Basically it out-stays its welcome a little. Having made its point, it rather harps on it. All the same, there is nothing really like this in British cinema (except perhaps the even more obscure, and even more mad, but rather less scalding 'Sir Henry at Rawlinson End'). The cast is uniformly terrific, some of the dialogue is priceless, and it has some of the funniest scenes from 70's British cinema. You do need to be able to roll along with the changing mood of the film though, because what for the most part is a hilarious satire develops into a very, very black comedy.",
         "Mind blowing, superior satire on the class system in Britain, with a once in a lifetime cast (Peter O'Toole, Alastair Sim \"The Zambeesi Missions\", Arthur Lowe \"Alexi Kronstadt...Revolutionary!\", Coral Browne, William Mervyn and so forth). Cinematically, the British have long proved that no one has a better sense of humor, or is as self critical of them, than they themselves. Perhaps, as the saying goes, \"It keeps the old girl honest.\" This scathing comedy takes no prisoners, whether engaging in outlandish situational dialogue or performers suddenly zipping out in a song and dance routines. There are too many individual gems of dialogue to count (although a personal fave is O'Toole's talk with Mrs. Piggot-Jones and Mrs. Treadwell). The performances are delivered with just the right amount of relish and timing. A modern classic. Highly recommended."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": ["Keep Films"],
      "summaries": [
         "A member of the House of Lords dies in a shockingly silly way, leaving his estate to his son. Unfortunately, his son is insane: he thinks he is Jesus Christ. The other somewhat-more respectable members of their family plot to steal the estate from him. Murder and mayhem ensues.",
         "A member of the House of Lords dies, leaving his estate to his son. Unfortunately, his son thinks he is Jesus Christ. The other somewhat-more respectable members of their family plot to steal the estate from him. Murder and mayhem ensues."
      ],
      "budget": 0
   },
   "movielensId": 1162,
   "movielens": {
      "languages": [
         "Deutsch",
         "English",
         "Français",
         "Italiano",
         "Latin"
      ],
      "releaseDate": "1972-09-13",
      "dvdReleaseDate": "2001-10-30",
      "directors": ["Peter Medak"],
      "runtime": 154,
      "movieId": 1162,
      "title": "The Ruling Class",
      "mpaa": "PG",
      "actors": [
         "Peter O'Toole",
         "Alastair Sim",
         "Arthur Lowe",
         "Harry Andrews",
         "Coral Browne",
         "Michael Bryant",
         "Carolyn Seymour",
         "Hugh Burden",
         "Nigel Green",
         "Cyril Appleton",
         "Leslie Schofield",
         "Graham Crowden",
         "James Hazeldine"
      ],
      "imdbMovieId": "0069198",
      "originalTitle": "The Ruling Class",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["hvBsk_jJ7j0"],
      "plotSummary": "When the Earl of Gurney dies in a cross-dressing accident, his schizophrenic son, Jack, inherits the Gurney estate. Jack is not the average nobleman; he sings and dances across the estate and thinks he is Jesus reincarnated. Believing that Jack is mentally unfit to own the estate, the Gurney family plots to steal Jack's inheritance. As their outrageous schemes fail, the family strives to cure Jack of his bizarre behavior, with disastrous results.",
      "tmdbMovieId": 30892,
      "avgRating": 3.77515,
      "releaseYear": "1972",
      "numRatings": 825,
      "posterPath": "/4TV1qeDMRHwrRudBIMkEF9KHWe4.jpg"
   }
}