{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0416470",
      "video": false,
      "title": "America's Most Haunted Inns",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4af8c3a368484e170783",
            "name": "Robert Child",
            "profile_path": null,
            "id": 1084410,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.25,
      "production_countries": [],
      "id": 127375,
      "vote_count": 0,
      "budget": 20,
      "overview": "Welcome to the modest small town of Bucks County, Pennsylvania. Enjoy your stay at Bucksville house and have your room tidied up in the morning by colonial maids who turn and vanish. At the Wedgewood Inn, explore a tunnel of the Underground Railroad where slaves passed through to freedom and the spirits of some still linger. Examine the mystery of the figure on horseback, spotted in the woods outside the Arianna Miles, as this fascinating documentary reveals some of the most amazing images of spirits ever recorded!",
      "similar": [],
      "original_title": "America's Most Haunted Inns",
      "runtime": 60,
      "poster_path": "/ot3rZczeByeJhIRhVuHY0C7S6Hr.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Move beyond fear",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Child"],
      "runtime": 59,
      "synopsis": null,
      "writers": ["Robert Child"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0416470/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3NDY3MTI4N15BMl5BanBnXkFtZTgwMjkyMDA2MDE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": [],
      "reviews": [
         "That was absolutely without a doubt the biggest waste of my time ever! I have watched many paranormal videos before but have never been so annoyed and bored at the same time. The only thing that saved this video were the Inn Keepers who told stories. Cathe the \"psychic\" spent most of her time talking to things that no one could see and telling Rob to \"get that\" on film. Over and over they showed photo after photo and then videos of \"orbs\" which looked very much like dust to me and everyone watching. Even worse was the \"amazing\" video at the end where they filmed something none of us could see and talked about it like it was remarkable. One of the most important things I've learned while doing ghost hunting was not to smoke so you can rule the smoke out as a possible factor in the pictures. They showed many photos with what looked like smoke swirling around then at the end one of the camera operators was walking around smoking! How professional was that for any type of investigator? I require more evidence from more credible sources and these were not those. PLEASE DON'T WASTE YOUR TIME WATCHING THIS AND EVEN MORE IMPORTANT, YOUR MONEY PURCHASING IT!",
         "The \"Psychic\" Cathe didn't pick up anything of what the Inn Owners stories actually told of. She was basically talking to herself and making things up as she went along- very imaginative. (I actually believe in psychics and have seen a spirit myself) Ladies and Gentlemen, she wasn't the real thing! All of the \"orbs\" or \"smoky spirits\" they managed to get in pictures were so totally unrealistic or from cigarettes, it wasn't even funny. They even showed a cameraman holding a cigarette!!! The only picture that was even close to being real was a face and somewhat form of a body it belonged to that an Inn Keeper took herself. At the end- ooooooh, I'm scared now! The \"horse rider\" looked like some branch movement to me. It looked as if something were rooting through the underbrush causing the upper limbs to sway. I not only rewound and zoomed once, but did so about 5 times and came to the same conclusion. Honestly, if it weren't for the stories from the Inn Keepers themselves, this flick would a 0 out of 10. However, they don't give you that option..."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Luminence Films"],
      "summaries": ["Have you ever seen a ghost? After seeing this program you can say you have... What figure appeared on horseback in the woods outside the Arianna Miles? Have your room at the Bucksville House tidied up in the morning by Colonial Maids who turn and vanish. At the Wedgewood Inn, explore a tunnel of the underground railroad where slaves passed through to freedom and some still remain. In this program you will see some of the most amazing images of spirits ever recorded-exactly as they were revealed to our cameras. Absolutely no computer generated images or post production effects or recreations were utilized in this production. Gives justice to the field of ghost hunting other documentaries fail to bring you anything other than campfire ghost stories."],
      "budget": 20000
   },
   "movielensId": 116433,
   "movielens": {
      "languages": [""],
      "releaseDate": null,
      "dvdReleaseDate": null,
      "directors": ["Robert Child"],
      "runtime": 60,
      "movieId": 116433,
      "title": "America's Most Haunted Inns",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0416470",
      "originalTitle": "America's Most Haunted Inns",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Welcome to the modest small town of Bucks County, Pennsylvania. Enjoy your stay at Bucksville house and have your room tidied up in the morning by colonial maids who turn and vanish. At the Wedgewood Inn, explore a tunnel of the Underground Railroad where slaves passed through to freedom and the spirits of some still linger. Examine the mystery of the figure on horseback, spotted in the woods outside the Arianna Miles, as this fascinating documentary reveals some of the most amazing images of spirits ever recorded!",
      "tmdbMovieId": 127375,
      "avgRating": 1.66667,
      "releaseYear": "",
      "numRatings": 3,
      "posterPath": "/ot3rZczeByeJhIRhVuHY0C7S6Hr.jpg"
   }
}