{
   "tmdb": {
      "original_language": "hi",
      "keywords": [{
         "name": "bollywood",
         "id": 10540
      }],
      "imdb_id": "tt0070947",
      "video": false,
      "title": "Zanjeer",
      "recommendations": [
         71298,
         62201,
         51725,
         33145,
         144672,
         143844,
         168498,
         25505,
         20622,
         32680,
         73443,
         45002,
         345980,
         41903,
         45003,
         16566,
         108016,
         21463,
         71304,
         48922
      ],
      "backdrop_path": "/pmkVFmpmJIF99mqoFpWgmtCXTIy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Insp. Vijay Khanna",
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9acf",
               "name": "Amitabh Bachchan",
               "profile_path": "/9daoHX8vQrrk2oLQQdrvRV0UlE6.jpg",
               "id": 35780,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mala",
               "gender": 1,
               "credit_id": "52fe4a1ac3a36847f81b9ad3",
               "name": "Jaya Bachchan",
               "profile_path": "/c0guZYhxlssatd0HT5M15w4lM6A.jpg",
               "id": 35743,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sher Khan",
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9ad7",
               "name": "Pran",
               "profile_path": "/aTI9CC8ktetco0VKQGDtdSQBuuJ.jpg",
               "id": 110085,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "De Silva",
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9adb",
               "name": "Om Prakash",
               "profile_path": "/aMtDEC1Q20fWKQyZHY66z3WAfRS.jpg",
               "id": 600251,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Seth Dharam Dayal Teja",
               "gender": 0,
               "credit_id": "52fe4a1ac3a36847f81b9adf",
               "name": "Ajit Khan",
               "profile_path": "/5HfS1X34J3DsrRqBRkDqTEI2flk.jpg",
               "id": 1028469,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mona",
               "gender": 1,
               "credit_id": "52fe4a1ac3a36847f81b9ae3",
               "name": "Bindu",
               "profile_path": "/zD1ZSbQOIcs9k0KdKMsE1iJOpz6.jpg",
               "id": 623417,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Police Commissioner Singh",
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9ae7",
               "name": "Iftekhar",
               "profile_path": "/wjYdOjGPKI0peayj4BJtPWEFccm.jpg",
               "id": 110096,
               "order": 6
            },
            {
               "cast_id": 26,
               "character": "Gangu",
               "gender": 2,
               "credit_id": "59c193539251412bc2002d15",
               "name": "Keshto Mukherjee",
               "profile_path": "/nF5H4HZEU7LTsSVNAKZmKvXZaTB.jpg",
               "id": 593144,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Lala Ashok - Sherkhan's friend - Usurer",
               "gender": 0,
               "credit_id": "52fe4a1ac3a36847f81b9aef",
               "name": "Randhir",
               "profile_path": null,
               "id": 1033156,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Street Singer",
               "gender": 0,
               "credit_id": "52fe4a1ac3a36847f81b9af3",
               "name": "Gulshan Bawra",
               "profile_path": null,
               "id": 1029300,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Kabir",
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9af7",
               "name": "Ram Mohan",
               "profile_path": null,
               "id": 641165,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Constable",
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9afb",
               "name": "Yunus Parvez",
               "profile_path": "/8y0u0NS7j9lzffw8ePGxf6NNLpr.jpg",
               "id": 593137,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9b01",
               "name": "Prakash Mehra",
               "profile_path": "/Ast2Ndnl0upkJL2GposdDMi61S3.jpg",
               "id": 610747,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9b07",
               "name": "Javed Akhtar",
               "profile_path": "/qKnvYtFvox7BhHy2Nx6YbcuSuIB.jpg",
               "id": 81984,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a1ac3a36847f81b9b0d",
               "name": "Javed Akhtar",
               "profile_path": "/qKnvYtFvox7BhHy2Nx6YbcuSuIB.jpg",
               "id": 81984,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "555ae3dec3a3682f61004743",
               "name": "Salim Khan",
               "profile_path": null,
               "id": 81986,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "555ae40d9251412ff900c512",
               "name": "Salim Khan",
               "profile_path": null,
               "id": 81986,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "555ae41bc3a36810240015c3",
               "name": "Salim Khan",
               "profile_path": null,
               "id": 81986,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "555ae42b9251411e5b00d5ef",
               "name": "Javed Akhtar",
               "profile_path": "/qKnvYtFvox7BhHy2Nx6YbcuSuIB.jpg",
               "id": 81984,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57a3fac2c3a3683835003977",
               "name": "Kalyanji - Anandji",
               "profile_path": null,
               "id": 1013074,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57a3fad0925141346d001ecd",
               "name": "N. Satyen",
               "profile_path": null,
               "id": 1013076,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "57a3fafe92514134ce001d6b",
               "name": "Ramchandra Mahadik",
               "profile_path": null,
               "id": 1085325,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57a3fb4cc3a3683f97005bf5",
               "name": "Prakash Mehra",
               "profile_path": "/Ast2Ndnl0upkJL2GposdDMi61S3.jpg",
               "id": 610747,
               "department": "Sound",
               "job": "Songs"
            },
            {
               "gender": 0,
               "credit_id": "57a3fb6e9251413b80001e83",
               "name": "Gulshan Bawra",
               "profile_path": null,
               "id": 1029300,
               "department": "Sound",
               "job": "Songs"
            },
            {
               "gender": 2,
               "credit_id": "57a3fb8992514147f300170a",
               "name": "Prakash Mehra",
               "profile_path": "/Ast2Ndnl0upkJL2GposdDMi61S3.jpg",
               "id": 610747,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Action",
         "id": 28
      }],
      "popularity": 0.562044,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 103236,
      "vote_count": 11,
      "budget": 0,
      "overview": "The world erodes around Vijay, an honest police officer. He is jailed for 6 months on false charges, trapped by gang leader Teja. When Vijay is released from jail, he plans to take revenge.",
      "similar": [
         44425,
         205022,
         204435,
         87,
         87827,
         700,
         283589,
         20453,
         244267,
         4538,
         334543,
         7508,
         38167,
         12177,
         11236,
         49009,
         19666,
         268238,
         27621,
         2897
      ],
      "original_title": "ज़ंजीर",
      "runtime": 146,
      "poster_path": "/cseNvCQpu7rxpib68mGq46Y94Gk.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Prakash Mehra Productions",
         "id": 64402,
         "origin_country": ""
      }],
      "release_date": "1973-05-11",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Prakash Mehra"],
      "runtime": 145,
      "synopsis": null,
      "writers": [
         "Javed Akhtar",
         "Javed Akhtar"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0070947/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTA1MzkzNTY2NF5BMl5BanBnXkFtZTcwNTg2ODgzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Amitabh Bachchan, Jaya Bhaduri, Pran | See full cast and crew »"],
      "reviews": [
         "As a kid, little Vijay, while hiding in a wardrobe, witnessed his parents assassination by Teja, a man who was a member of a mafia group Vijay's father was a part of and retired. Vijay was adopted by a police officer and as he grew up, he himself became a hot-blooded policeman. Vijay does not remember Teja. He only vaguely remembers the murderer's golden chain with a white horse hanging on it. That's the story of Prakash Mehra's Zanjeer, an action-packed drama and one of the first films which shot the leading actor Amitabh Bachchan to fame. Zanjeer is an entertaining movie, and the story is interesting and well told. The direction is also pretty good. The characters are well-written. Bachchan's character is that of a very serious and uncompromising young man who takes crime as a personal affront and is thus often put in trouble with his superiors. The film has several actors supporting Bachchan, including Jaya Bhaduri, his real-life future-wife, who plays the sassy and lovely Mala. The chemistry between the two is wonderful as always. Pran, also an actor who frequently collaborated with Bachchan, plays Sher Khan, a kind-hearted, brave and smart man who befriends Vijay in some unusual circumstances and supports him in every throughout the film. Om Prakash also appears in a small but important role of a drunkard who is also Vijay's informant. Bachchan is excellent as Vijay. It's easy to see why this was a star-turning performance for the actor. He is restrained and inhibited and brilliantly displays his character's internal turmoil and fear. Jaya Bhaduri is absolutely charming and natural as Mala, and it's nice to see her transforming from a vivacious girl to a mature and supportive wife. Pran is brilliant in his rather unusual role. Om Prakash is good in his role of a traumatised man. Bindu makes her usual vamp act, and Ajit is okay as Teja. Zanjeer is an enjoyable and well-made film. It is at times a bit unsettling and disturbing but it is generally well-executed, well-narrated and well-acted. The film's music is also very nice, though the cabaret number was a bit annoying. I liked it that no songs were given to Bachchan. It only contributed to his serious image in the film. In its favour it can also be said that the film is devoid of too much melodrama, though it is not very realistic in the last portions. Anyway, this is a good movie, I recommend you to watch it.",
         "As a child, Vijay witnesses the murder of his parents by their unscrupulous employer, worried that pops will spill the beans on his \"spurious injections\" business. As luck would have it, Vijay was hidden in a wardrobe at the time and all he sees of the killer is his golden chain, with a cute little plastic horse dangling from it. 20 years later, Vijay has morphed into Amitabh Bachchan and is a police officer, always in trouble with his superiors because of his tendency to take crime as a personal affront and use any means available to punish its perpetrators. He's a very serious and intense young man, haunted by nightmares of his parents murder. Prior to 1973, the name Amitabh Bachchan was not revered amongst Indian cinema goers as it has been ever since. Indeed, Amitabh was considered to be box office poison at the time, and director Prakash Mehra was thought to have gone mad for choosing him as the star in his new film Zanjeer. History appears to be on Mehra's side, for Zanjeer was a resounding success and created the \"Angry Young Man\" image for Amitabh Bachchan that dominated Indian cinema for the next decade. Zanjeer follows the same pattern as many of Amitabh's films - or rather, many of his films follow the pattern of Zanjeer, I guess. Amitabh has proven himself a very versatile actor, but it is the driven intensity he brings to roles such as this that made him Bollywood's undisputed king. Driven by a rage he cannot release, he tears up the screen and the bad guys but remains vulnerable and easy to empathise with. Bachchan is joined by some interesting characters - the larger than life good-bad guy Tiger played by Pran, and the sassy gypsy girl played by Jaya Bhaduri, who was Bachchan's love interest and later his real-life wife. Unfortunately the bad-bad guy is less charismatic and interesting than he might have been - he is cold and cruel, but not as \"villainous\" as he might have been. I don't know just how original Zanjeer was at the time of its release... it seems to follow a pretty conventional formula, but the impression I get is that it largely created this formula. Perhaps similar plots were covered before, but I can't imagine anybody filling such a role as well as Amitabh. Certainly Zanjeer was a runaway success, and a profoundly influential film. Sadly, in this case 'first' does not mean 'best'. Although it's certainly a solid film, it's not as well scripted as other films along similar lines, and Amitabh doesn't have the cocky confidence that he would quickly develop and employ so effectively in his numerous star roles. I guess everybody involved was still finding their feet a little, so it's not surprising that the elements presented here would be improved on in later films. The conclusion I draw is that ZANJEER is not the best starting point on an Amitabh adulation path, but is definitely worth picking up once such a path has been a little trodden in. My enjoyment of the film was doubtless hampered somewhat by the DVD presentation, which is clearly heavily cropped - most obviously at the bottom of the screen, where a good 20% must be missing. This was probably done to get rid of subtitles burnt into the print used for mastering, but unfortunately you lose a lot along with the subs - people's mouths during close-ups, for instance. I think it was also cropped at the sides, possibly to preserve aspect ratio. It may even have been a 4:3 film originally though, cropped to more than 1.85:1. Whilst this cropping (and general print wear and tear) do not ruin the film, it's definitely an impediment to full appreciation.",
         "This movie is lots of fun. It has EVERYthing in it - car chases, dance numbers, action, crime, revenge - like many Bollywood films - there's something for everyone. The film cant help but be dated - some of the 70's era clothes are hilarious. Some of the cliché zoom shots to an actor's face and yes, the movie is long - 145 minutes - it is slow at times but hang in there - it is worth it. The fact that Bachchan became a huge superstar after this also makes it a must-see. He supposedly found the seeds here to start his \"angry young man\" act. Bachchan is excellent as Vijay. It's easy to see why this was a star-turning performance for the actor. He is restrained and inhibited and brilliantly displays his character's internal turmoil and fear.",
         "Zanjeer (The Chain) is the film where Amitabh Bachchan made the breakthrough from being an established actor to superstardom, and where the trend was set towards the revenge film in Indian cinema. Amitabh's Angry Young Man character was born in this film in his brilliant portrayal of the brooding, temperamental Vijay who is haunted by a recurrent nightmare. Indeed, his performance as a disturbed, vengeful young man propelled him to new heights, such that he was at the top of many directors' wanted list for at least a decade afterwards. Interestingly, the role was rejected by several stars of the early 70s before being offered to Amitabh, illustrating how luck can play a part in a career's success or failure. Who knows what different turns Bachchan's career would have taken had he not had the chance to play Vijay, the young man with chips on both shoulders. Surely his talent would have found an outlet somewhere, but would he have made such a ground breaking impact in any other role? Zanjeer is certainly not all about one actor, and a strong cast showcase their talents to the full. The greatest character actor of all time in Indian cinema, Pran, gives a very enjoyable performance as Vijay's loyal friend, Sher Khan. As ever, Pran's attention to detail and willingness to 'live the character' is immediately obvious and doubtless he will have researched the Pathan dialects to deliver a richly authentic performance. Jaya Badhuri cleverly plays the sassy knife sharpener with great depth and sensitivity. Ajit is no conventional villain: not the hothead that is seen in so many Indian movies; instead he is cold and cruel but nevertheless, quintessentially evil. Even Iftekhar's cameo as Vijay's boss, the Police Commissioner is worthy of praise. This classic thriller is tightly scripted by Javed Akhtar, and never loses its pace thanks to Salim Khan's screenplay and Prakash Mehra's clever direction and the richly talented cast. It has a high octane tension which is sustained throughout. An example of this is in Vijay's visit to the party when the gangster's moll (played by Bindu) seeks to seduce Vijay in the raunchy number Dil Jalon Ka. The posturing of the unimpressed Vijay and Teja (Ajit), the cool, calculating tycoon and his cronies with the backdrop of the gyrating Bindu and superb musical score are captured expertly by a circling camera team. Mehra achieves all this without being overly melodramatic, something that might not be said of one of his other big hits, Muqaddar Ka Sikander, and that is very much to Zanjeer's benefit. There are several haunting, dark moments in this film which last long in the memory. The initial murder scene against the backdrop of the firecrackers of the Diwali celebrations, as well as Vijay's nightmare of the black hooded rider atop a galloping white horse are enduring images which immediately spring to mind. The film is essentially dark in mood and many of the images - the inner city back streets and railway sidings give it a real gritty feel - and yet in contrast, many of the scenes are shot in bright daylight. Mehra's attention to detail influences all aspects of the film, giving it a rich texture, quite literally in some cases! Vijay's costumes are very early 70s Western chic, without going over the top, and the Pathan, Sher Khan (Pran), wears authentic cultural dress. The enjoyment of this film is slightly detracted from in a couple of scenes, as the cropping of the edges of the film mean that facial expressions of the leading characters are missed. This does not detract from the fact that Zanjeer is pure, carefully crafted art and that this seminal film is essential viewing for anyone with an interest in Indian cinema.",
         "This hard-hitting film is my favourite for many reasons: -powerful performance by amitabh (laughs twice in the movie) -train murder scene which deserves putting Prakash Mehra up there with the all time director greats. Also Mehra has a penchant for location shooting and you get to see some of the dark sides of the mumbai locale. -esoteric motifs and hints strewn all over the movie('Baa baa black sheep, have you any wool') -Teja the bad guy is convincingly portrayed by Ajit -The unending quest for justice and it's bittersweet resolutions -The theme of love vs. revenge All these were amplified in Mehra's second classic 'Muqaddar ka Sikandar' In short it is rewarding viewing!",
         "Despite a taut script and lots of action, both of which make sure that this film never gets boring, this movie is a bit too caught up in clichés and stereotypes to ever transgress the \"obsessed good guy tracks down fundamentally evil bad guy\" scheme, which is a bit of a pity. Nevertheless, it managed to establish Amitabh Bachchan as the \"angry young man\" of 1970s Indian cinema. Sadly, the talent of Jaya Bhaduri is totally wasted except for her entry scene and a split second at the end - surely a knife-sharpening girl could have been put to better use in an action movie? Overall, my disappointment over what could have been made out of this prevails over the fact that it's a solid action movie.",
         "Zanjeer is a film that entertains throughout. The cast did a good job in their own role. Amitabh Bachchan gave us an intense performance which his extreme discomfort and anger. Jaya Bachchan portrayed a shy,innocent and young girl well. Pran did well as a loyal friend. The villains did their part. Although this was a serious movie, there were some lighter parts; I especially liked the part where Jaya Bachchan (Mala) learns words from that family and tries using it. In one scene, when Amitabh Bachchan (Vijay) was leaving she called him and said \"bye bye\"; he laughs and taps her with the police baton as she looks shyly at him - cute scene between them. A nice film which is worth a watch and is recommended.",
         "\"Zanjeer\" tells the story of a very zealous young policeman, Vijay. As a child, he saw his parents murdered. In his subsequent quest for justice, he tends to go overboard. In trying to stop a racketeer, he gets framed. Having lost his job and being under pressure from his wife, Mala, he withdraws for awhile. But inevitably, when asked to stop a racket from a man who lost three sons to poisonous liquor, he re-energizes and takes after the top racketeer who is passing himself off as a model citizen. \"Zanjeer\" is also a love story, showing how Vijay gets together with Mala, who has no family and sharpens knives on the streets for a living. Although the story in \"Zanjeer\" (1973) occasionally dawdles and loses tension, it more than makes up for it in deft painting of different characters we really care about. Mala, played by Jaya Bhaduri, is enchanting doing her song and dance about knife sharpening. She gives us an exceptional portrait of a young and unschooled girl who has charm, bravery and aptitude. Vijay is played by Amitabh Bachchan, a tall man who is by turns amiable, caring, but also intense and violent when it comes to meting out justice. His boss has to restrain him and teach him not to take the law into his own hands. The movie is very adept in introducing its characters as real people very quickly. It also has a talent for showing the philosophical sides of the characters, adding a lot of depth to the film and showing us real people. The entire film has a great deal of charm, becoming much more than an action or revenge film, but without sacrificing suspense and interest. The main supporting player is Pran who plays Sher Khan, who becomes a loyal friend to Vijay. He evidently is an experienced player in the role of the robust and vigorous Khan. Om Prakash does a turn as the father who has lost his 3 sons and appeals to Vijay for help. The main racketeer is coolly handled by Ajit. Although the story has the two components of love and crime, it is neither a love story nor a crime story. Told mainly from the point of view of Vijay with Mala and Khan close by, I would call it melodrama, not without down periods in the lives of the protagonists, but with a happy ending. This is a movie strong enough to create its own overall tone and mood, which is of good but imperfect people trying to hold the evil ones in check, not without setbacks and their own conflicts along the way.",
         "This movie is lots of fun. It has EVERYthing in it - car chases, dance numbers, action, crime, revenge - like many Bollywood films - there's something for everyone. The film cant help but be dated - some of the 70's era clothes are hilarious. Some of the cliché zoom shots to an actor's face and yes, the movie is long - 145 minutes - it is slow at times but hang in there - it is worth it. The fact that Bachchan became a huge superstar after this also makes it a must-see. He supposedly found the seeds here to start his \"angry young man\" act. And the gypsy knife sharpener girl became his future wife in real life. I loved her first dance number where she gets customers to come out of their homes and bring her their knives to be sharpened. One thing about the copy we watched on DVD - it was subtitled but the SONGS WERE NOT. Frustrating.",
         "I managed to watch this entire movie (TCM - 4 stars!) because I kept hoping that it would get better...but it never did. There is so much that's bad about this movie that I don't know where to begin! The fight scenes: disjointed and senseless with terrible sound effects. The fight with Sher Khan at the beginning of the movie was really bad, no one got hurt but they both got filthy with oily dirt! It was more like adult men having a slap & tickle! The camera work: Moving camera work was jerky and made my brain hurt. The delivery truck barreling down the road was so contrived, like a bad 'Clutch Cargo' cartoon! And when it runs into the school kids...SCTV did better on their worst days! Weird camera shots, I remember the camera panning left and showing just the heads & shoulders of people on the ground and a group standing on a ramshackle raised patio - only their legs and feet! Or was the point of the shot the ramshackleness of the construction? Strange quick shots of characters displaying unreadable expressions on their faces occur frequently... The murder on the train? Some shifty-eyed thug butts out a cigarette on the guy's hand and he falls off the train (the only laugh I got all movie!) The solo singing number by Mala - no idea what she was singing about! The subtitles didn't make any sense - she was obviously lamenting about something to do with love, but the tears on her face told me that! No subtitles would've been better than what was displayed. The lighting in the Inspector's \"apartment\" - really bad during a critical fight scene. The fight scene near the end when Vijay gets thrown off the bridge onto the tracks below...more slap & tickle, but the fall from the bridge would've killed him certainly. Then out of seemingly nowhere deadly knives are thrown by Mala - who knew?! Maybe I'm spoiled (well...actually I'm sure I'm spoiled) but I've watched a lot of foreign films over the years and I'm more than willing to overlook minor errors - but this movie is just one big stew of nonsensical plot-chunks! 5 stars because of the dance numbers, the dance number with Sher Khan on the occasion of his birthday is a classic. \"Friendship is my Religion; my Friend is my Life!\" ((Interesting side note, the lead actor 'Vijay' and the knife-girl 'Mala' were married in real life after this movie and have remained married for 40 years))"
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Prakash Mehra Productions"],
      "summaries": [
         "A police officer (Amitabh Bachchan) after the brutal murder of his family seeks some answers from life. Where he was suspended from duty, because of false story portrayed against him by traitors, when he decides to track down the killer of his family years ago, with the help of a street-wise knife sharpening girl (Jaya Bhaduri), and a Pathan (Pran). He was able to make out one of them as underworld don Teja and promise himself that he would not rest in peace until he takes revenge.",
         "In his childhood; Vijay witness the assassination of his parents by a notorious criminal leader, Teja. He grows up to be a police inspector and comes across a pathan, Sher Khan and a village belle, Mala - together with their help he attempts to uncover the ravel surrounding the killings of his parents only to find himself trapped.",
         "A police inspector (Amitabh Bachchan), suspended from duty, tracks down the killer of his family years ago, with the help of a street-wise knife sharpening girl (Jaya Bhaduri), and a pathan (Pran). Based on a true story of one of the underworld dons, Teja.",
         "The world erodes around Vijay, an honest police officer. He is jailed for 6 months on false charges, trapped by gang leader Teja. When Vijay is released from jail, he plans to take revenge."
      ],
      "budget": 0
   },
   "movielensId": 116704,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1973-05-11",
      "dvdReleaseDate": null,
      "directors": ["Prakash Mehra"],
      "runtime": 146,
      "movieId": 116704,
      "title": "Zanjeer",
      "mpaa": null,
      "actors": [
         "Amitabh Bachchan",
         "Jaya Bachchan",
         "Pran",
         "Om Prakash",
         "Ajit Khan",
         "Bindu",
         "Iftekhar",
         "Keshto Mukherjee",
         "Randhir",
         "Gulshan Bawra",
         "Ram Mohan",
         "Yunus Parvez"
      ],
      "imdbMovieId": "0070947",
      "originalTitle": "ज़ंजीर",
      "genres": ["Action"],
      "youtubeTrailerIds": [],
      "plotSummary": "The world erodes around Vijay, an honest police officer. He is jailed for 6 months on false charges, trapped by gang leader Teja. When Vijay is released from jail, he plans to take revenge.",
      "tmdbMovieId": 103236,
      "avgRating": 3,
      "releaseYear": "1973",
      "numRatings": 9,
      "posterPath": "/szf1VsTXNd2lzjkQWF4YzDeyyjo.jpg"
   }
}