{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "teleportation",
            "id": 3822
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "mad scientist",
            "id": 10125
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "disfigurement",
            "id": 170383
         }
      ],
      "imdb_id": "tt0059076",
      "video": false,
      "title": "Curse of the Fly",
      "recommendations": [
         101898,
         112481,
         47632,
         85236,
         26854,
         43015,
         28271,
         160816,
         29237,
         53355,
         33388,
         98092,
         61702,
         59657,
         109109,
         91733,
         26924,
         59581,
         59701,
         35919
      ],
      "backdrop_path": "/9kFOCKPsX2Kc563r2Fu15RIK8EB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Henri Delambre",
               "gender": 2,
               "credit_id": "52fe46979251416c91059407",
               "name": "Brian Donlevy",
               "profile_path": "/dJP0woESrhHQrPbTieZdE54OM2f.jpg",
               "id": 41755,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Martin Delambre",
               "gender": 2,
               "credit_id": "52fe46979251416c9105940b",
               "name": "George Baker",
               "profile_path": "/roiBG5Mc0nAQ3nZLfcODwtHxqmF.jpg",
               "id": 10173,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Patricia 'Pat' Stanley",
               "gender": 1,
               "credit_id": "52fe46979251416c9105940f",
               "name": "Carole Gray",
               "profile_path": null,
               "id": 101910,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Wan",
               "gender": 0,
               "credit_id": "52fe46979251416c91059413",
               "name": "Yvette Rees",
               "profile_path": null,
               "id": 119742,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tai",
               "gender": 2,
               "credit_id": "52fe46979251416c91059417",
               "name": "Burt Kwouk",
               "profile_path": "/7s1Sul5L6NU2TEfgLarBqrde65v.jpg",
               "id": 21944,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Judith Delambre",
               "gender": 0,
               "credit_id": "52fe46979251416c9105941b",
               "name": "Mary Manson",
               "profile_path": null,
               "id": 119743,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Albert Delambre",
               "gender": 2,
               "credit_id": "52fe46979251416c9105941f",
               "name": "Michael Graham",
               "profile_path": null,
               "id": 119744,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Madame Fournier",
               "gender": 1,
               "credit_id": "52fe46979251416c91059423",
               "name": "Rachel Kempson",
               "profile_path": "/sQmgd5mppHdCdB5w94mR12zLcKf.jpg",
               "id": 10653,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Inspector Ronet",
               "gender": 2,
               "credit_id": "5ac0efd50e0a264a4e048036",
               "name": "Jeremy Wilkin",
               "profile_path": null,
               "id": 157693,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Hotel Manager",
               "gender": 2,
               "credit_id": "52fe46979251416c9105942b",
               "name": "Warren Stanhope",
               "profile_path": null,
               "id": 119746,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Inspector Charas",
               "gender": 2,
               "credit_id": "52fe46979251416c9105942f",
               "name": "Charles Carson",
               "profile_path": "/qc6tbPVk6zV2OOk8fO2c6YjUl9s.jpg",
               "id": 27931,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Nurse",
               "gender": 0,
               "credit_id": "52fe46979251416c91059433",
               "name": "Mia Anderson",
               "profile_path": null,
               "id": 119747,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Hotel Porter",
               "gender": 0,
               "credit_id": "52fe46979251416c91059437",
               "name": "Arnold Bell",
               "profile_path": null,
               "id": 119748,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55779af79251413d760004ce",
               "name": "Robert L. Lippert",
               "profile_path": null,
               "id": 70567,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46979251416c910593fd",
               "name": "Don Sharp",
               "profile_path": null,
               "id": 101528,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46979251416c91059403",
               "name": "Harry Spalding",
               "profile_path": null,
               "id": 37364,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46979251416c9105943d",
               "name": "Basil Emmott",
               "profile_path": null,
               "id": 115374,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55779b04c3a36842ee0004ab",
               "name": "Jack Parsons",
               "profile_path": null,
               "id": 133218,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55779b1fc3a368396c00105b",
               "name": "Harry White",
               "profile_path": null,
               "id": 11125,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "55779b309251413da00004c4",
               "name": "Harold Fletcher",
               "profile_path": null,
               "id": 108811,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 2,
               "credit_id": "55779b12c3a36842ee0004ae",
               "name": "Bert Shefter",
               "profile_path": null,
               "id": 4683,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.525231,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 38125,
      "vote_count": 18,
      "budget": 0,
      "overview": "Remember that scientist that was trying to perfect a matter transportation machine but got fused with a fly when one of the little critters got into the transporter with him? Well, this story is about three of his descendents (a son, Henri Delambre, played by Brian Donlevy and two grandsons). Seems the son wants to continue and perfect the machine while his two sons want to get out of the scientist business and live \"normal\" lives. The oldest son, Martin, decides to take a wife (who just happens to have escaped from a mental hospital after her parents died). Martin's father is not happy with this intrusion but finally gives in because he understands him son's needs. They all try to be a happy family until humans used in botched experiments are discovered by the new bride and the police nearly discover the lab while looking for Martin's wife. Everyone tries to get out of there via the transporter but things just don't go according to plan ...",
      "similar": [
         3034,
         9426,
         1694,
         3035,
         928,
         9738,
         263115,
         126889,
         384521,
         336843,
         1927,
         9383,
         9077,
         22825,
         2268,
         399055,
         4961,
         18111,
         19901,
         9556
      ],
      "original_title": "Curse of the Fly",
      "runtime": 86,
      "poster_path": "/yJmKIdm0DD7t9ES3yWj7gBWzVE4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lippert Films",
         "id": 5681,
         "origin_country": ""
      }],
      "release_date": "1965-05-01",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": "/1MMTGpmm0E9yXRTNyW0YebAs66S.jpg",
         "name": "The Fly (1958 series)",
         "id": 123213,
         "poster_path": "/if9PkF46yCeMp9WTYhUOjxnytAt.jpg"
      },
      "tagline": "Piece by Piece...Atom by Atom...Humans Invisibly Teleported Through Time and Space!!!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Don Sharp"],
      "runtime": 86,
      "synopsis": "The movie opens at night on the façade of an old building. A window shatters, the shards coming straight at the camera. A woman wearing only bra and panties exits the room through the window. Title and credits follow. The woman makes her way to the front gate of the property. She runs down the street away from the Fournier Mental Hospital. Driving down the road is Martin Delambre (George Baker). He sees the woman run off the road and into the woods so he stops to render assistance. He tosses his sweater to the scantily clad young woman. Patricia Stanley (Carole Gray) inquires as to his direction. When he tells her Montreal, she responds, \"Oh, that's where I wanted to go.\" Pat makes up a story about having to leave in a hurry, away from the unwanted attention of the husband of the woman writer she used to work for. Martin stops at a house and steals some clothes for Pat. Martin agrees to put her up at a hotel until she gets on her feet. He then lends her some money until she gets a job and can repay him. Martin calls his home and the houseboy, Tai (Burt Kwouk) answers the phone. Martin reports that the new equipment will be ready in a week and to tell his father. The maid, Wan (Yvette Rees) approaches Tai to learn what is going on. Tai enters the lab and calls London on a short-wave radio set. In a similarly equipped lab in London, Henri Delambre (Brian Donlevy) is sleeping on a cot and calls to his son, Albert. Albert Delambre (Michael Graham) answers the call. Tai inquires on the health of Henri Delambre, and the senior Delambre responds he is fine. Albert is annoyed that his father lied, \"Why don't you tell Martin the truth?\" Father replies, \"I don't want to worry him. We're so close to success.\" Albert is concerned and threatens, \"If you won't tell him, I will. I won't have anything more to do with the experiment.\" Albert wants a life of his own, but his father appeals to family history and the promise of a breakthrough. \"The teleporter will replace every known means of transportation.\" Albert reminds his father about the failures: Judith, Samuels and Dill, but Father reminds his son, \"Last week, you and Martin teleported me from Quebec to London.\" Albert reinforces his concern by lifting his father's shirt and exposing a huge radioactive burn on his back, \"Do you call that success?\" Martin and Pat are having dinner. A romance is blossoming between the two, but both are hiding secrets about themselves. A week has flown by and Martin is due to return home. They are on a picnic in the country and Martin impulsively proposes marriage. At a Montreal police station, Madame Fournier (Rachel Kempson) reports the escape of Patricia Stanley to Inspector Ronet (Jeremy Wilkins). Ronet demands to know why she waited so long to report the escape. Fournier explains that they are a private mental institution and that Patricia is not a lunatic, but only suffered a nervous breakdown. Before her concert debut her mother died and she suffered a breakdown. Pat and Martin are preparing to leave the picnic area when he suffers an attack of some type. She drives back to the hotel. She is unable to get a response at his door. Martin has administered an injection, but we see that his condition is serious. The skin on his face is puffy and blotched. He is having trouble breathing. Pat is so concerned she calls for the hotel Porter (Arnold Bell) to open his door. A cash gratuity overcomes his concern about hotel rules, but he knocks on the door rather than use his pass key. Martin, looking normally, answers the door. Martin and Pat, now married, pull up to the Delambre house in his Chevrolet station wagon. Tai answers the door and is introduced to Martin's new wife. He registers only mild surprise, then welcomes the new mistress of the house. Ronet checks with the hotel manager (Warren Stanhope) on Patricia Stanley, but gets very little information, except the connection to Martin Delambre. Martin gets Pat settled in their room. He goes to the lab. Wan delivers the suitcases to the bedroom, then quickly departs. Martin calls his brother, Albert, in London. His father interrupts to ask about the equipment. Delambre explains that his passport is not in order and he must return to Canada as soon as Martin can assemble the new equipment. While Pat waits patiently in the bedroom, Martin and Tai assemble the machinery. The lights dim in the bedroom as the teleportation equipment in the lab is brought to full power. The senior Delambre is dressed in a suit. He dons a set of protective goggles for his eyes. Albert closes the glass panels in the casket-like transport chamber. Martin and Tai prepare to receive Delambre. They hold welder's masks. Albert transports his father. The transporter lights the room. Albert reports the disintegration complete. A similar bright flash of light and the senior Delambre appears in the chamber. Martin administers oxygen to his father. It is while checking his father's heart he notices the body bandage. Martin was unaware of the mishap after the last transmission. Delambre explains to Martin that without the new equipment there were radiation burns. Delambre asks his son about the woman's voice he heard on the phone. Martin admits he met a girl in Montreal and married her. Martin tells his father he wants a life of his own, exactly the same words Albert used. Ronet returns to his office and informs Madame Fournier he has made an appointment to see ex-inspector Charas to discuss the Delambre family. She does not understand the connection, but Ronet tells her she will understand after Charas explains. The next afternoon Martin tells Pat that his father has arrived from London. Delambre meets his new daughter-in-law and is very friendly. Pat is surprised when she sees the piano in the conservatory room. Tai informs Martin there are people at the gate. Pat helps herself to the piano while Delambre registers unease. She plays with ease as her father-in-law looks on. Wan enters with a tray with an equally uncomfortable look on her face. Wan hurries outside, past three locked doors to the fourth. She looks through the top observation panel and tells the occupant, \"Be quiet now. Be quiet, Judith.\" Wan takes the lunch dish and an arm extends from the bottom trap door and takes her hand. A second hand extends, this one is wrinkled and claw-like. It entwines Wan's wrist and applies a vice-like grip causing Wan to grimace in pain, \"You're hurting me. Let go, Judith. You scratched my hand.\" Martin walks to the gate. Ronet explains that Madame Fournier operates the asylum from which Miss Stanley escaped. Ronet explains that they intend to take her back. Martin explains that, \"Miss Stanley and I were married yesterday.\" After a brief exchange, Martin reluctantly lets them enter the house. Tai enters the room holding the marriage certificate. Fournier and Ronet examine the document and stipulate it is genuine. Fournier tries to instill fear with her pronouncement about Pat's mental illness, but Delambre only replies, \"She appears to have made a remarkable recovery since leaving your hands.\" Tai shows Ronet and Fournier out. Pat runs to the back of the house where the doors are located. She is drawn to a scratching at one of them. She opens the observation panel on the door next to Judith's door. She opens the bolt on the trap door on the bottom of the door, but it slams shut. She peers inside the door at the top and is frightened by the distorted face that looks back at her. Pat screams and runs to the house. She runs straight into Wan who just stares at her. Martin comes along and comforts his wife. Martin explains they are research animals. Martin, his father, and Pat have lunch. After Pat leaves, Martin has another attack. His father helps him to a couch and then prepares an injection. He asks his son, \"When did this start again?\" Delambre tells his son they must proceed and quickly. Albert has become unreliable and Martin's marriage and the authorities snooping about have made him uncomfortable. A nurse (Mia Anderson) wakes Inspector Charas (Charles Carson) and tells him he has a telephone call. The old man is in a hospital bed and is wearing dark glasses. He is told by Ronet that he won't be visiting after all. When informed that Martin and Patricia Stanley are married, Charas replies, \"Martin Delambre's married already, has been for years...Her name is Judith.\" A woman sits at the piano, playing with one hand. Judith (Mary Manson) struggles to play. Pat wakes in her room and hears the piano being played downstairs. She walks down to investigate. Judith becomes frustrated when her deformed left hand approaches the keys. Pat enters the room, turns on the lights, and is shocked to see the woman at the piano. Half of her face is a mass of tissue; it runs from forehead to chin covering her left eye. Judith covers her face with her deformed hand. Wan allows Pat to fall to the floor and tells the deformed woman, \"Come Judith. It's time to go now.\" Judith limps across the room and accompanies Wan back to her cell outside. Pat wakes in bed when her husband returns. He tries to convince her it was a bad dream. Wan lies and denies seeing Pat in the conservatory or anyone playing the piano. While Martin comforts his wife, Delambre scolds Wan down in the lab. He tells her, \"You will not let Judith out again, except by Mr. Martin's order or mine. Is that understood?\" Martin comes into the lab and gets another injection by his father. \"We've got to teleport Samuels and Dill to London immediately,\" he tells his son. Albert's job will be to dispose of the two test subjects. Martin asks about Judith, but his father reminds his son that since he remarried he must make that decision. The two men drug and return Samuels and Dill to the lab for transport, but one escapes. Charas does meet with Ronet. He explains the family history to the policeman. Ronet asks if there were any ill effects from the process, \"No effect? No deformities?\" \"None that you can see,\" is the reply from Charas. Charas explains that Martin and his father are affected by the cold and also, at times, by a premature and very rapid aging. They have to have regular injections of a special serum. The other brother, Albert, is quite normal. The large deformed man attacks Martin in the lab. Delambre grabs a golf club and beats him almost to death. Martin calls his brother in London, but gets no answer. As father and son transport one body, Wan places a picture of Judith on Pat's nightstand. In her drugged state Pat reaches for it, but knocks the picture to the floor breaking the glass. In the lab, another body is transported and Martin again calls Albert in London. Delambre tells Albert he wants him to reintegrate immediately and dispose of the package. Albert reintegrates the combined subjects and is horrified by the writing mass of tissue in the chamber. He runs from the lab and returns with an axe. Delambre talks to Ronet on the telephone. He agrees to come to Montreal and discuss the situation. Martin sees his wife and tells her they have to go to the city. Martin confirms that Pat did see Judith and reluctantly admits to Pat that their experimental animals are actually humans and that Judith was one of the subjects. Ronet asks about Judith and is told they got a Mexican divorce. Ronet also asks about Samuels and Dill and is told they were exchange student lab assistants, and they left at the end of their terms. Ronet calls for a search warrant after the Delambres leave the office. At home, Judith finds bits of the broken glass from the picture frame. This confirms in her mind that she was not dreaming or hallucinating. Wan releases Judith from her cell and is attacked by Judith. Judith locks Wan inside the cell and goes to find Pat. Pat confronts Judith at the front door and then runs to the lab. Judith slowly follows, dragging her bandaged foot and leg. Tai opens the door for Pat just as Judith reaches her. Tai and Judith struggle in the lab, Tai knocks her out with a wrench. Tai releases Wan from the cell and they decide to leave. Tai tells Wan that he killed Judith. The two decide to use the teleporter to dispose of Judith's dead body first. As Martin carries Pat back to the house he sees the house lights dim, a sure sign the equipment is being powered up. Once inside the lab, Tai explains to all that Judith got away. Delambre dismisses the staff and tells Martin that Pat must be teleported to London. As Martin disposes of all their notes in the fire, Delambre implores Albert to help. But Albert refuses, \"You murdered those men, and you made me a murderer too.\" Martin gets on the phone to talk to his brother. He pleads for his father. Martin tells his brother that he is sending his father through. Albert pleads, but Martin hangs up. Martin teleports his father, but he doesn't realize Albert has destroyed the London equipment, an axe still in the body of the Samuels/Dill reintegrated tissue in the reintegrater chamber. Tai and Wan depart the house just as Ronet arrives. Martin has placed Pat in the transporter. She wears the eye protecting goggles. Martin tries again and again to raise Albert on the radio. He collapses, but does manage to help Pat out of the teleporter. He again collapses but gets up and drags Pat outside. Ronet enters the lab, looks around, and returns to the conservatory. Martin collapses into the car, pleading for his wife's help. Inside the car, we see he has aged at least 50 years. Ronet gets on the phone and calls for reinforcements and puts out an APB on Tai and Wan. Pat runs into the conservatory to use the phone. Ronet confronts her. She directs the policeman outside to Martin. Ronet looks into the car and sees what is left of Martin: a skull and empty clothes. He returns to Pat and we close with Ronet escorting Pat inside the house, the cast credits, and the question, \"Is this the end?\"",
      "writers": ["Harry Spalding"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059076/",
      "coverLink": null,
      "actors": [
         "Brian Donlevy",
         "George Baker",
         "Carole Gray"
      ],
      "reviews": [
         "One of the best horror movies of the 50s is without a doubt the 1958 version of \"The Fly\", the story of a scientist who gets fused with a common fly when a experiment goes awfully wrong. Directed by Kurt Neumann and starring David Hedison and Vincent Price, \"The Fly\" went on to become an enormous hit thanks to its effective mix of mystery, suspense and horror. As usual, to the surprising success of \"The Fly\" followed the making of a sequel, \"Return of the Fly\", released immediately the following year and with Price reprising his role. However, the change of focus from suspense to shock and horror, together with the rushed shooting and the low-budget made \"Return of the Fly\" an inferior product that did nothing but give a bad reputation to the series. This reputation extended to the third and final film, 1965's \"Curse of the Fly\", which is often labeled unfairly as \"one of the bad sequels\" when actually, it is a minor jewel of science fiction. \"Curse of the Fly\" follows once again, Henri Delambre (Brian Donlevy), who despite having been almost destroyed by his father Teleportation machine in his youth, he has spent his life continuing his father's work. Now he has his two sons working with him, and the Delambres have finally achieved transatlantic Teleportation, with Martin Delambre (George Baker) coordinating the Canadian side and Albert Delambre (Michael Graham) the British side. However, not everything is going well for the Delambres, as after a series of disastrous failures both Martin and Albert are disenchanted with the project and are willing to start a normal life. Henri's experiments will become endangered once again when Martin marries Pat Stanley (Carole Gray), as the newly arrived bride has secrets of her own that could unleash the curse of the Delambres, the curse of the Fly. Writer Harry Spalding does a terrific job in bringing back the series to its original themes of mystery and suspense, and while he downplays horror in favor of sci-fi, the story carries an appropriate feeling of doom. Spalding's script is very respectful of the themes exposed in George Langelaan's original short story, and unlike \"Return of the Fly\", it recaptures the Gothic atmosphere of the original movie and manages to tie in everything exposed in the previous films and give a proper conclusion to the Delambres' saga. The addition of an element of madness to the story is really clever, and allowed director Don Sharp some chilling scenes. As the backbone of the movie, it is truly Spalding's script what separates \"Curse of the Fly\" from other b-movies of its time, and returns the series to its former glory, at least for a last dance. Better known for his work with Hammer Studios, director Don Sharp took the job of bringing Spalding's script to life while he was still at the top of his game. Already familiar with low-budget conditions of work, Sharp hides his monsters in the shadows and employs atmosphere and music to create the horrors of the Delambres' house, and by doing this not only his monsters become more realistic and menacing, he also returns to the series' roots by focusing the horror in the unknown and the unseen. Basil Emmott's excellent cinematography is of great importance for this, as paired with Bert Shefter's eerie score create an ominous atmosphere of dread that suits the Gothic style of the series to perfection. In many ways, \"Curse of the Fly\" feels like a science fiction version of those low-budget Hammer thrillers of the 60s like \"Nightmare\" or \"Paranoiac\". Being produced in the United Kingdom, \"Curse of the Fly\" showcases a lot of British talent in its cast, which overall means a significant improvement over \"Return of the Fly\". Brian Donlevy of \"Quatermass\" fame appears as the aging Henri Delambre, who despite all the tragedies he has lived insist in fulfilling his father's dream. Donlevy's performance as the tragic scientist is quite subtle, yet of great power. George Baker is for the most part effective, and even when at times appear a bit wooden he manages to carry the film without problems. As the troubled Pat Stanley, Carole Gray delivers probably the best performance of the film, giving a very natural performance in her role. The performances by the supporting cast are nothing special, but most make a good job with their roles. Burt Kwouk and Yvette Rees do have some quite good scenes as the Asian servants Tai and Wan. As often happens with sequels, low-budgets can really become the Achilles' heel of a movie, and \"Curse of the Fly\" is no exception. While Don Sharp does a great job into hiding it during most of the movie, it is impossible not to notice that the make-up work in the movie is pretty bad and probably the worst thing in the film. Also due to budgetary constrains, the designs for the Teleportation machines look sadly poor and even anachronistic (they look like something out of a 50s film), cheapening some of the film's best scenes. Still, thanks to the high quality of Spalding's screenplay, most of those quibbles can be easily ignored as the film's story is simply captivating. The masterful direction by Don Sharp also helps in this as for the most part he manages to disguise the movie's flaws. Often dismissed as another cheesy horror from the 60s, \"Curse of the Fly\" is actually a fine piece of cinema that ultimately redeems the series in this the last chapter of the saga. One would have wished a better budget for this story, as the epic tragedy of \"The Fly\" is ended in an amazing fashion here. However, Don Sharp really made wonders with what he got (a true trademark of a Hammer alumni) and delivered a product worth of praise. While of course not as good as Neumann's classic, \"Curse of the Fly\" is definitely an unfairly hidden gem of science fiction. 7/10",
         "Curse of the Fly may well be a surprise to you, as it was to me. Expecting some typically cheap, cheesy '60s B Horror film, I instead found a film that captured my attention with a better than average storyline, good acting, interesting, if dated, theories on teleportation, and some rather subtle humor. Burt Kwouk, who played the Chinese houseboy \"Kato\" in the Pink Panther films to Peter Sellers' Inspector Clouseau, and who seemed to be forever perpetrating sneak attacks on Clouseau, likewise turns up in this film as a Chinese houseboy, sans the martial arts bits. This time however, Kwouk is named \"Tai\". Yvette Rees, who plays the Chinese house'girl', as it were, is named \"Wan\". Tai and Wan? Taiwan? Somebody obviously had a lot of fun writing the screenplay. The opening scene, featuring the beautiful Carole Gray as Patricia Stanley escaping from a mental institution in her underwear as the opening credits roll, is one of the oddest introductory scenes to be seen in a film of this genre. Absolutely recommended for all fans of horror, suspense, '60s b&w's, camp, and films featuring unintentional humor",
         "I saw this as a kid and had read that it was the worst of the series. I don't think so! This one is the scariest, weirdest, most atmospheric and most unsettling of the FLY series. I think that if this film wasn't having to be compared to the first two, it would be more highly spoken of. The scene where the heroine discovers just who (or what) is playing the piano in the middle of the night sent chills up my spine. This film has enough ghoulish imagery that really stays with you long after you've seen it (and for me it's been over 20 years). The opening escape scene is ahead of it's time with the mental patient running in slow motion with the title credits over it. Some of the mutants are very quite disturbing to look at and there are plot twists and turns applenty. Basically, no one is safe or sacred in this dark final film in the series. I could talk more but I would spoil it for those who have never seen it. It used to be on television frequently but has now disappeared. However, it's well worth the trouble of finding it. This has the mark of a truly great horror film - it will continue to live in your memory long after your initial viewing. I am wishing for a DVD of it someday. The sad part is that it is the unfavorable comparisons to the original on the part of most critics that probably keep Fox from releasing a video of it. Let's hope they wise up and preserve it on disc before the negative is destroyed. That would be an un-fitting end for CURSE OF THE FLY which is an unsung masterpiece of a horror film.",
         "I remember seeing the ads for this on tv back in 1965.Man did I ever want to see this flick!Too bad I had to wait over 30 years to do so.One good thing is that I really wasn't disappointed! This to me is the best of the \"Fly\" trilogy.A man turning into a fly via a matter transporter is a little outrageous.But turning into a gooey mutant is another thing entirely! The Delambre family (led by Brian Donlevy) is once again mucking about with transporters.The \"mistakes\" are kept in the stables.Radiation burns and rapid aging are the norm in this household. On the downside is the extremely low budget.Not a lot of different sets were used in this film.The make up is okay (but a sight better than the guinea pig man from Return Of The Fly). There is a very Gothic look to this flick and the cast and crew do extremely well with what they have been given.The ending is pretty much unforgettable and chilling.Excellent b&w photography.Well worth a look!",
         "Don't believe the Maltin review (his reviews on older horror/sci-fi's are nearly always dismissive & undoubtedly written when appreciating the B movie was not \"chic\"). Curse of the Fly is a gloomy neo-gothic that captures the real sense of doom that befalls the Delambres; mutants locked in old horse stables, kept like animals; everyone transported with the Delambre machine suffers some form of deformity or disease, and they struggle to perfect it before they all eventually succumb to mental and (literally) physical disintegration. Very downbeat, not for all tastes, but a personal favorite.",
         "I wasn't too impressed by \"Return of the Fly\", but it still fascinated me! When I learnt that there was a third one, I was quite intrigued to see it. I just watched it for the first time on DVD, and I was quite impressed on how smart the story was, and even though there is no Human-Fly monster in it (which, to be honest, is a smart approach), I thought it was more clever to base the movie around the Delambre legacy, rather than focus on the whole \"man gets gene-spliced with a fly\" blah blah blah! To be honest, I was expecting something REALLY dreadfully cheesy, but surprisingly, I loved it! The visuals (especially, the opening credit sequence, very well thought up!), and the originality of it is superbly done! It's got the classic horror movie style down perfectly! True its not as frightening as say... Alien, but, for its time (1960s), the mutant make up and story are very well sorted! TOTALLY UNDERRATED!",
         "(Some Spoilers) Even though \"The Curse of the Fly\" is the third installment of \"The Fly\" \"The Fly\" doesn't at all appear in the film, except for a photo of the original \"Fly\". Henri Delambre, Brian Donlevy, and grandsons Martin & Albert, George Baker & Michael Graham, are in the movie continuing his fathers work in perfecting the tele-transporter to be used in the future for the benefit of mankind. Even though Pop,Henri is as crazy and fanatical as can be in his pursuits to develop the tele-transporter his two boy's, Martin & Albert, are a bit turned off with his mad dreams that has taken a great toll on his health. Since it was making their lives a total wreck but still go alone with his research. Henri's experiments have taken a number of lives and horribly deformed some of the people that they were tried on, by putting them in that contraption, including Martin's wife Judith, Mary Manson and Martin and Henri themselves. Martin driving one evening sees this young women running down the road dressed only in her bra and panties and takes her to the hotel that he's staying at in Montreal Canada. Learning that her name is Pat, Carole Stanly, Martin in no time at all fall in love with her and the two are married within a week. Back at the Delmbra Mansion Martin continues his experiments with the tele-transporter with the help of his two live-in helpers the butler and maid Tie & Wan, Burt Kwouk & Yette Rees, with Pat blissfully ignorant of what happening in the house. When Martin's father Henri, back in London finds out that he did, got married he almost blows a fuse. Later finding out that Pat is an escapee from a local mental institution when Henri is tele-transported back to Montreal he realizes that now the police and hospital authorities will be snooping around the mansion. Henri gets Martin to show the police his marriage license with Pat to keep them off the premises,in order not for them to find out what he and Martin are doing there. There's another hitch in the plot when the police learn that Martin is still married to Judith, who mysteriously disappeared due to Martin's experiments on her, making his marriage to Pat illegal. Even though both Martin and Pat agreed not to ask each others about their past Pat is suspicious about what Martin is doing behind her back. One night Pat find Judith playing the piano, Pat herself is a pianist, and is terrified at her deformed appearance. Later Pat to her horror finds a number of the persons that Martin used in his experiments locked up outside the mansion. Now Martin himself, his conscience got the best of him, comes clean with her telling Pat what he's been doing at the mansion all these years. Not as good as the original \"The Fly\" but much better the \"The Return of the Fly\" with the emphasis on the tele-transporter and how in the end it destroys the Delambre's dream of perfecting it. Henri disappears when he's transported back to London with the receiving tele-transporter destroyed by his, also conscience stricken, son Albert. This has Henri turning into a bunch of loose and dismembered cells atoms and molecules floating in the nothingness of inner space forever.",
         "The \"curse\" of the fly, is the \"curse\" of the DeLambre family, whom has lost family members experimenting with teleportation. Two of the family members bodies had been intermixed with the bodies of house flies in two earlier films. Hence, the \"curse of the fly.\" No one turns into a \"fly\" in this one; but there are plenty of gruesome results nonetheless. Nothing in the film is better than the opening sequence, as heroine Carol Gray escapes from an asylum, only to meet and marry one of the \"mad\" DeLambres. The slow motion shattering glass creates quite an eerie effect. Much of what occurs in the film is gruesome rather than horrific. However, nothing is more frightening than Brian Donleavy carrying on a rational conversation arguing FOR the teleportation experiments, with his back covered in horrible radiation burns, the result of his self-experimentation. This is a powerful moment in an, otherwise, fairly routine programmer.",
         "Although I have not seen this film in many years the most chilling scene I remember was when dozens of the mutants, victims of the Delambre's teleporter experiments, were loaded up in the Montreal Transporter booth and teleported to London in an attempt to evade local authorities. The London Transporter operator reintegrates this transmission and it results in mass of fused bodies and flesh in the receiver. The operator is so horrified that he destroys the London receiving station. Later, we see a scene where he ignores repeated calls to reintegrate Henri' Delambre while he screams and cries half insane still holding the Ax he used to destroy the teleporter and presumably to kill the \"thing\" it created.",
         "Low budget, grade B second sequel to the \"classic\" Vincent Price horror film with the half-man, half-fly trapped in a web crying for help. Might be lumped in with all the other stale, stodgy, campy horror flicks of that era, but \"Curse of the Fly\" has the distinction in my family of being the only film I can truly say startled me with one single, solitary, particular scene; when the young woman was looking in the locked cells outside where the failed experiments were kept and she opened the little door where food is put in and slowly she bends over to see what is inside, .. . . The falling door before she looked within startled me to such a point I leapt into the air when I first viewed it. I told my brother and he had just watched it earlier and said the same thing. Our older sister said the same thing happened to her when she watched it. And we were all well out of high school when we watched this film for the first time. No other movie has had such a startling moment as that scene in this movie.",
         "I just saw this flick on Fox movies since it first came out. I loved it. First I want to say there is no Fly in this movie. It is about the son and the grandsons of the original creator of the Teleporter machine. The Delamber family. The time line is way off because Brian Donlevy is the son and he is way too old to play him. If my recollection is correct the original Fly took place after WW II. The grandsons are more age appropriate. I just think the Producers needed a famous name for the movie and Donlevy was available. He does play the obsessed scientist very well though. He doesn't care how this life is affecting his sons. One, Albert is very troubled by his dads pursuits. He doesn't have much to do during the movie because he is in London and he just is used as the other half of the teleporter operator. Seems like this is a great high tech way of smuggling illegal aliens ,beam me up Scottie. Because the old man is in England in the beginning of the movie but he cannot legally return to Canada because of all of his hanky panky, his passport has been absconded by the cops. So the teleporter is used to get him back into Canada. Albert has a very important role at the end of the movie but before that all we know is that he is not a happy camper. I am not going to spoil the ending. When Dad gets back home he discovers that number 1 son has taken a wife. This scene is great. The old man is telling the son that it is impossible that he got married because his new wife will bring attention to the family and their experiments. Well the son tells dad that she has no family or friends so no one will look for her. Just as he is saying this to his father the screen cuts to a scene where we see a woman talking to the police about looking for this woman. Well it turns out it was his wife. So now the cops are coming to the Delambres. After that her life with the Delambres goes downhill. Her husband is summoned to the police about the missing woman while he is gone, she discovers something is not right in the old backyard. I will not tell what happens. But the movie has enough going for it to please most fans of these types of movies. We even have a little Jane Eyre and Rebecca story mixed up in the movie. You will know what I am talking about when you see the movie.",
         "I actually found this film to be the most entertaining in the original Fly trilogy. The strongest and the weakest point of the film is the writing. The main plot is not highly original: the Delambres teleport people but they don't do it very well. But the subplot is very clever. The film starts with a woman escaping from a mental insitution and seemingly nice Delambre picking her up and falling for her. Once they return to Delambres mansion roles are reversed and we realize that it is not really she who is insane but rather the Delambre clan. That is unconventiional and well executed although it could have been made more use of. The second really good aspect of the film is Don Sharp's very stylish directing, particularly the opening sequence and his use of music. All these things put the Curse of the Fly in a class well above the usual SciFi B movie. And Brian Donlevy doesn't look quite as disoriented as in his other later films.",
         "Despite the title, there are no flies or fly hybrids in the film other than a photo of the first fly that is briefly shown on the screen. Instead, the film is about the descendants of the scientist from the first film trying to carry on his work--with a few \"mistakes\" along the way. They, too, are trying to create a matter transference machine but instead of getting mixed with flies, the results were a few deformed people. Instead of dealing with these \"freaks\" humanely, they just locked them in cells and had their insane servant feed them. Now the fact that there are no fly monsters in the film isn't a bad thing since the plot is still rather interesting and is a pretty decent example of the genre. However, some silly casting and a few clichés don't help it to be all that memorable or worth seeking. Bert Kwouk (of Asian decent) played one servant but the other was played by Yvette Rees who looked about as Asian as a hamster! Also, Carole Gray had a habit of fainting or making stupid choices--making her character seem clichéd and silly. In addition to these odd characters, Brian Donlevy (an old-time Hollywood character actor) and George Baker (a well-respected British actor famous for playing Tiberius in \"I, Claudius\" as well as many other TV and film roles) are on hand to give the movie some degree of class. Overall, the film has its scary moments but also quite a bit of cheese and flat moments to make it just another 60s horror film. Interesting but far from special.",
         "Even without the presence of Vincent Price, \"Curse of the Fly\" turns out to be quite the effective sci-fi horror thriller, and for me, a welcome treat courtesy of my local library, since I didn't know this third entry in the \"Fly\" series even existed until today. The picture effectively follows up on events of the original Price thriller, which I remember to this day as one of the all time great horror flicks to leave it's indelible impression on my youthful upbringing. Even if it doesn't have the audacity of 'Pleeeasee, help meee\", I thought the picture did a real fine job of spanning the generations utilizing the original teleporter gimmick. But gee, what's with the whole VE3TTF Montreal/G2FRR London business? Did the Delambre's really have to go through all that protocol just to talk to each other? It seemed pretty clever the first couple of times, but wore thin after awhile, and after all, who else would it be on the other end of the line? But I guess that's part of what gives this flick it's unique character. What's really unique though was the way the picture opens. That was a head scratcher actually, I had to check the DVD sleeve to be sure I was watching the right movie. Escaping from the Fournier Mental Hospital (nice set up), Pat Stanley traverses the Canadian countryside in her underwear until rescued, so to speak, by Martin Delambre (George Baker) on his way back home to Montreal. Now think about this - without ever questioning why she might have been traipsing around in her undies, the couple spends a week together before Martin pops the question. Not exactly the best recipe for a lasting marriage, but then again, there have probably been odder scenarios. The fact that you never even see a 'Fly' in this movie shouldn't come as a let down; the whole idea of the picture supports the premise of a Delambre legacy that resulted in tragedy the first time around, and continues to rear it's ugly head, or other mutations as the case may be. The creature effects are reasonably daring enough without going over the top, thereby helping to maintain suspense throughout. If I were rating the trio of pictures in the 'Fly' series, I'd place this second to the original starring Vincent Price. Brian Donlevy is convincingly conflicted and creepy enough to take up the Delambre mantle as he tries to keep his sons in line with the scientific mission. Besides the principals, Burt Kwouk and Yvette Rees are convincing as the loyal Asian servants, but one has to wonder - Tai and Wan - Taiwan? Who makes this stuff up?",
         "The Curse of the Fly is the third and the worst of the three Fly movies. This was made in Britain in 1965, six years after The Return of the Fly and has very little to do with the first two Fly movies. The son of the original inventor of the transportation machine is continuing with his experiments and as a result of these, he has created mutants which he is keeping locked up in his mansion. At the end, the transporter is destroyed. Despite this movie being rather disappointing, it has a decent cast: Brian Donlevy (The Quatermass Xperiment, Quatermass 2), George Baker (Inspecter Wexford in The Ruth Rendall Mysteries), Carole Gray (Island of Terror) and Burt Kwouk (who can currently be seen in Last of the Summer Wine). Despite the above, Curse of the Fly is not totally unwatchable. Rating: 2 stars out of 5.",
         "I am not sure if I watched the same film as some of the other reviewers, but I think I did. A woman in a short nightgown DID drift across the screen to the opening credits. No complaints here as she was beautiful and certainly filled her French-cut panties very nicely, but THAT does not make a good horror film. The Curse of the Fly tells the supposed conclusion to the history of Delambre family and their inherited ability to transport matter from one place to the other via small glass chambers. Guess what folks? No fly here. In fact, we are treated to a lot of dialogue and stoic acting by the king of stoic acting himself, Brian Donlevy. Not that Donlevy is bad, he is okay and a good actor overall. But he sure isn't Vincent Price. And I can tell you, this film really needs the likes of a Vincent Price. Sure the first two films were a bit hokey(particularly the second), but Price was the stabilizer. His lack of presence here is sorely visible. The rest of the cast is unimpressive with the likes of George Baker who brings dullness to a new level. Carole Gray is pretty good(and lovely) as the love-interest, crazy woman who goes in and out of her mind. Burt Kwouk is good too as a servant. But then we have Yvette Rees in a role that defies logic. She plays an Oriental servant and looks preposterous, has a preposterous accent, and is just plainly put plain awful. Don Sharp shows he knows how to direct, but the budget(lack of) and inferior script cramp his style. Don't get me wrong. This film is entertaining in its own way. I watched and wasn't bored. I thought some of the plot was interesting. But most of my time was spent focussing on its shortcomings and laughing at some of the dialogue and acting. It is a very watchable film, but it is not a good film. And it comes nowhere close to being as good as the original The Fly or even its sequel.",
         "There's not a whole lot I can say for this terrible 3rd entry into the original Fly series. It tells the story of Henri Delambre, the son of the original scientist...Wait, wasn't his son named Phillipe? And didn't he become a fly in Return of the Fly? Guess we're supposed to ignore that. Anyway, Henri is trying to continue his father's work, but is failing miserably as you may suspect. Something about this film that may surprise you though, is that there is no Fly appearance. You read right. The Fly doesn't appear in this movie at all. Just a bunch of messed up people. With Vincent Price gone, there is no hope of seeing a good performance in this movie. This movie features some of the most wooden acting I've ever seen. It's like they figured there was no point and just slacked off. The dialogue and direction of the film are no better. This movie is slow, dull, and not even interesting at all. It's a movie that makes me wonder...What was the point? 1/10",
         "The Delambre name is the only real connection to the first two films of the series. Phillippe is renamed Henri; Henri was the name in the short story not Phillippe but it would have made more sense in this 3rd film to keep his name Phillippe (a lot less confusing that way since it was changed to Henri in the first film). Also do not expect to see any Fly in this film. The teleportation device still has quite a few problems but flies are not one of them anymore. So in a way, this film is only connected to the first two films by the name Delambre and the teleportation device still having troubles. The problem is, with no Fly it's not really a Fly movie anymore, it's not what people are wanting to see which is The Fly. That's not to say this is a bad film because The Fly is not in this movie, it's just not as good as the first two and does not live up to it's name and film poster. It's a deceiving film, cashing in on the success of the first two films. 5/10",
         "Henri Delambre (Brian Donlevy) is obsessively continuing the experiments started by his father and has succeeded in creating a machine that can transport human beings. He managed to transport himself from London back to Montreal, but ended up with radiation burns as a result. Despite his determination to carry on with his work, Henri's two sons, Albert (Michael Graham) and Martin (George Baker), are fed up and want to settle down into ordinary lives. Martin has married Patricia Stanley (Carole Gray) who, unknown to him has escaped from the local asylum. When she discovers three people - including Martin's real wife, Judith), who have been turned into deformed mutants as a result of Henri's botched experiments imprisoned in cells at the rear of the Delambre's country mansion; Inspector Charas (Charles Carson) of the local police is called. He becomes suspicious that the Delambre family are carrying on the failed work of Henri's father and, as a result, Henri attempts to destroy all the evidence and transport himself back to London. But, as you will expect, it all goes horribly wrong... A better than expected conclusion to The Fly trilogy which is notable because, unlike its two US made predecessors, this was shot at Shepperton in England at a time when that studio was struggling to find films to make and had laid off many employees. The film is pure scientific mumbo jumbo of the cheesy, drive in b-movie kind. Nevertheless, in the hands of the talented director Don Sharp, the results are better and a bit more polished than one would have expected. The opening sequence in which Patricia Stanley escapes from the asylum wearing only a nightdress is splendidly shot in slow motion as the credits unscroll and the theme tune played by the Royal Philharmonia Orchestra features, perhaps, the most beautiful and haunting piano forte of any horror film. In addition, there is another masterfully staged shock sequence where Patricia awakes in the middle of the night during a thunderstorm to hear piano music playing. When she goes to investigate she encounters Martin's real wife, the disfigured Judith, who was a distinguished pianist, at the piano. We learn that one of the Delambre's servants, Wan (played by the excellent Yvette Rees who was standout in Don Sharp's minor chiller, Witchcraft (1964) was devoted to her mistress and is not happy that Patricia has married Martin and stages the night time encounter so that Judith can attack her. The film is shot in excellent, unsettling black and white by Basil Emmott, a real veteran of British b-movies. Performances are generally good all round but Brian Donlevy who was superb in the Hammer Quatermass movies is less effective here as the mad scientist Delambre. Another let down is the climax that does not quite make the horrific impact upon the audience than it seeks perhaps due to the limitations of the budget and the schedule which I suspect was very tight indeed. All in all, Curse Of The Fly emerges as a better than average conclusion to The Fly trilogy which, to be honest, was never that strong anyway thanks to the handling of its director and crew who perhaps invested more effort into it than it deserved.",
         "It seems like this has become a cult favorite for a lot of people. Personally, I didn't see the appeal. I was quite interested in seeing this movie because for the longest time, it wasn't available on home video. It's a pretty rare movie, but it's really not worth looking at. It doesn't help that I haven't seen the other Fly movies. This is weird because it doesn't even feature any flies! It just seemed like it was a hard story to continue with this title! The main problem is the relationship. It's strange because this woman meets the guy and they immediately get married. She just starts the movie right away. There actually is this one really good shot in the film. It's actually the first scene and it shows a window being smashed. This is really a great shot and it's filmed beautifully. If only the rest of the film were like that. Another problem is that the film is too anti-climatic. This seemed like it would more appropriate to be featured in an episode of \"Mystery Science Theater 3000\". I actually did like the makeup effects in this. They do have some creative ideas. Like many movies, the main problem is that they're not used very well. **",
         "The original theatrical series of \"Fly\" films from 20th Century Fox concluded with this decent entry. In a very atmospheric opening, a young woman named Patricia Stanley (Carole Gray) escapes from a mental institution. Soon, she runs into Martin Delambre (George Baker), one of the current generation of Delambres. This eternally stubborn family is STILL trying to make their teleportation machines run without a hitch. Well, it turns out that they CAN now teleport human beings, but not without biological side effects. The guinea pigs all develop mutations. It may first come as a disappointment that there are no humans with fly heads in this sequel. Instead, the effects involve more limited use of makeup. But as guided by Australian born director Don Sharp (\"Psychomania\"), \"Curse of the Fly\" is a reasonably enjoyable addition to this series that goes off on its own merry way instead of offering a retread of the earlier stories. It's got appropriate laboratory sets, a fine music score by Bert Shefter, and some wonderfully moody cinematography by Basil Emmott. The tale spun by screenwriter Harry Spalding has a romantic angle (Patricia and Martin quickly fall in love and are content not to tell each other much about themselves) and, ultimately, a tragic one as well, which is right in line with the first film. Spalding does also exhibit a sense of humour. The Asian assistants are named Tai and Wan (!) (and are played by \"Pink Panther\" series regular Burt Kwouk and Yvette Rees). The cast performs the material with all the sincerity they can muster. Both Baker and Gray are appealing. Michael Graham is good as disapproving son / brother Albert, as is Jeremy Wilkin as the detective on the case. Brian Donlevy has a nicely authoritative presence as the father who doesn't want anything jeopardizing his scientific work. Nothing special here, but a solidly entertaining sci-fi story. Six out of 10.",
         "Nice little film, with two Oriental servants called Tai and Wan... that's a sample of the inspiration that screenwriter Harry Spalding brought to end the trilogy, but as everybody has pointed out it is better than the previous installment. Mental patient Patricia Stanley (sexy South African actress Carole Gray) is the main character this time, a pianist who escapes an asylum only to get mixed up with the Delambres, who now have cells in their manor, where they keep the victims of their experiments with teletransportation. Tai-Wan are in charge of the Delambre mansion, laboratory and prison, and things get ugly but no flies fly around to make them nastier. Enjoy!",
         "This is easily the weakest of the original The Fly series. It is the third and final installment and bares little resemblance to its predecessors. In fact, to accommodate its story line, the makers of the film actually change the plot details of the first two films. In The Fly, Andre Delambre, the original scientist to mix fly and human DNA, had a son named Phillipe. Phillipe would then become the main character of the first sequel, Return of the Fly. In the Curse of the Fly, there is no mention of Phillipe and suddenly Andre has a son named Henri. Where he came from, I haven't the slightest. This, as you can plainly see, could confuse viewers who are familiar with the first two films. Imagine Luke Skywalker not appearing in Return of the Jedi and out of nowhere, Darth Vader has a son named Roy. Same thing. It leaves one perplexed throughout a good chunk of the film. Despite this obviously flaw, the story itself isn't that bad, I suppose. Henri and his sons are continuing with Andre's experiment to transport human beings from one place to the other. His one son, Martin, has married and his wife has discovered the botched experiments that had turned his ex-wife and former lab assistances into monsters. At first he tries to convince her she is dreaming all of this (Oh yeah, the film begins with her escaping from a mental hospital), but soon enough he can't disguise the fact that he and his father are mad scientists. The one saving grace of this film is the pathetic attempt to pass off a Caucasian woman as a Chinese servant. She looks more like Katherine Hepurn then Amy Tan, but this embarrassing bit of casting at least brings some camp value to the picture. Again, this picture pails in comparison to The Fly (1958) and Return of the Fly (1959), which are both stellar pieces of early science fiction cinema. And oh yeah, in Curse of the Fly, there is no fly at all to speak of throughout the entire film. Lame. So very lame.",
         "To be sure, there are genuinely scary moments in this film, but the cons outweigh the pros. The opening sequence of the lovely Carole Gray making her escape from the insane asylum is very atmospheric. PROS: She's in bra and panties and the scene is in slow motion. CONS: But then George Baker (as Martin) sees her running down the road ,in her skivvies, in the Canadian night, and MARRIES her!? Then we're introduced to Martin's father, Henri (Brian Donlevy). It seems he's recuperating from something on a couple of sawhorses. PROS: Good laboratory set. CONS: Mr. Donlevy's voice rises to a laughable squeek when he gets agitated. The family's curse is being fanatical about matter teleportation. \"Imagine being able to send help where it's needed INSTANTLY!\", squeeks Henri. Various other characters are introduced: Chinese servants (Tai and Wan), the director of the asylum, the police inspector, the misshapen human teleportation guinea pigs, etc. PROS: good makeup on the \"failures\". CONS: A Caucasian actress trying to portray an Asian house servant. It's stupid and offensive, especially when she speaks in \"Engrish\". It all goes to Hell in the end, of course. The former lab assistants are fused horribly into a large, multi-limbed, gelatinous mass. Daddy gets disintegrated. Martin keels over and ages into a skeleton. The police inspector leads the now numb Ms. Gray away as the music swells. Thank God it's finally... THE END"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": ["Lippert Films"],
      "summaries": [
         "Remember that scientist that was trying to perfect a matter transportation machine but got fused with a fly when one of the little critters got into the transporter with him? Well, this story is about three of his descendents (a son, Henri Delambre, played by Brian Donlevy and two grandsons). Seems the son wants to continue and perfect the machine while his two sons want to get out of the scientist business and live \"normal\" lives. The oldest son, Martin, decides to take a wife (who just happens to have escaped from a mental hospital after her parents died). Martin's father is not happy with this intrusion but finally gives in because he understands him son's needs. They all try to be a happy family until humans used in botched experiments are discovered by the new bride and the police nearly discover the lab while looking for Martin's wife. Everyone tries to get out of there via the transporter but things just don't go according to plan ...",
         "Motorist Martin Delambre attempts to keep evidence of his family's bizarre experiments in teleportation hidden from his wife, who is hiding secrets of her own."
      ],
      "budget": 0
   },
   "movielensId": 116809,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-05-01",
      "dvdReleaseDate": null,
      "directors": ["Don Sharp"],
      "runtime": 86,
      "movieId": 116809,
      "title": "Curse of the Fly",
      "mpaa": "",
      "actors": [
         "Brian Donlevy",
         "George Baker",
         "Carole Gray",
         "Yvette Rees",
         "Burt Kwouk",
         "Mary Manson",
         "Michael Graham",
         "Rachel Kempson",
         "Jeremy Wilkins",
         "Warren Stanhope",
         "Charles Carson",
         "Mia Anderson",
         "Arnold Bell"
      ],
      "imdbMovieId": "0059076",
      "originalTitle": "Curse of the Fly",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["u6XqTeNWLNI"],
      "plotSummary": "Remember that scientist that was trying to perfect a matter transportation machine but got fused with a fly when one of the little critters got into the transporter with him? Well, this story is about three of his descendents (a son, Henri Delambre, played by Brian Donlevy and two grandsons). Seems the son wants to continue and perfect the machine while his two sons want to get out of the scientist business and live \"normal\" lives. The oldest son, Martin, decides to take a wife (who just happens to have escaped from a mental hospital after her parents died). Martin's father is not happy with this intrusion but finally gives in because he understands him son's needs. They all try to be a happy family until humans used in botched experiments are discovered by the new bride and the police nearly discover the lab while looking for Martin's wife. Everyone tries to get out of there via the transporter but things just don't go according to plan ...",
      "tmdbMovieId": 38125,
      "avgRating": 4,
      "releaseYear": "1965",
      "numRatings": 2,
      "posterPath": "/k3O5OMXQp8sEdzuFivnbJBKhvcb.jpg"
   }
}