{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "werewolf",
            "id": 12564
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "norse mythology",
            "id": 179101
         },
         {
            "name": "animal horror",
            "id": 223059
         },
         {
            "name": "lycanthrope",
            "id": 228001
         }
      ],
      "imdb_id": "tt0115610",
      "video": false,
      "title": "Bad Moon",
      "recommendations": [
         16191,
         62132,
         40344,
         40952,
         70351,
         26675,
         69870,
         45779,
         26689,
         21151,
         18111,
         68665,
         82315,
         26558,
         40059,
         363890,
         36421,
         11429,
         40168,
         58864
      ],
      "backdrop_path": "/u71KG4VK09yYUz5xpV570Dd2qDr.jpg",
      "revenue": 1100000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Janet",
               "gender": 1,
               "credit_id": "52fe47a5c3a36847f8140e0f",
               "name": "Mariel Hemingway",
               "profile_path": "/lNlfYgxGwVSLC4tPJXyos02IRQC.jpg",
               "id": 10447,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Uncle Ted",
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e1f",
               "name": "Michael Paré",
               "profile_path": "/g1cVLWWAgl3J1nNFhg67qXs8GUT.jpg",
               "id": 60650,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Brett",
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e13",
               "name": "Mason Gamble",
               "profile_path": "/gcWwvfZLxvk8VH6NEjfmt7j87aR.jpg",
               "id": 15252,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Flopsy",
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e1b",
               "name": "Hrothgar Mathews",
               "profile_path": "/d0IRs8KBK9jq6qDKGpb0Q1UL4yF.jpg",
               "id": 62912,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Sheriff Jenson",
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e17",
               "name": "Ken Pogue",
               "profile_path": null,
               "id": 58406,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Marjorie",
               "gender": 0,
               "credit_id": "5796a5d69251417d4a0020bd",
               "name": "Johanna Marlowe",
               "profile_path": null,
               "id": 1472700,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Reporter",
               "gender": 1,
               "credit_id": "5940ad6f9251413c8c004877",
               "name": "Julia Montgomery Brown",
               "profile_path": "/8Oe5fqtyQTRVqSHwW3EoDBWt90w.jpg",
               "id": 191140,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Forest Ranger",
               "gender": 0,
               "credit_id": "5940ad7ec3a368517f00d8c9",
               "name": "Gavin Buhr",
               "profile_path": null,
               "id": 1441223,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e0b",
               "name": "Eric Red",
               "profile_path": null,
               "id": 54839,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e25",
               "name": "Gary Barber",
               "profile_path": "/hVdFCnxL2F1wuq7BdgMoxiGBzis.jpg",
               "id": 4507,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e2b",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e31",
               "name": "Bill Todman Jr.",
               "profile_path": null,
               "id": 11000,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e37",
               "name": "Daniel Licht",
               "profile_path": "/i6hSKUXNwH8wOnxTNDXB9rCFEsQ.jpg",
               "id": 46353,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e3d",
               "name": "Wayne Smith",
               "profile_path": null,
               "id": 88454,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a5c3a36847f8140e43",
               "name": "Eric Red",
               "profile_path": null,
               "id": 54839,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56521e609251410f190028eb",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "56abf58e9251413e95003526",
               "name": "Bill Corso",
               "profile_path": "/iL7zT7LUL5p7aBuKfQa4vXF4bAt.jpg",
               "id": 15017,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "5940ad969251414b020181fa",
               "name": "Jan Kiesser",
               "profile_path": null,
               "id": 43529,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5940ad9f9251414af20196aa",
               "name": "Geza Sinkovics",
               "profile_path": null,
               "id": 52150,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5940adb3925141059900a7af",
               "name": "Carroll Timothy O'Meara",
               "profile_path": null,
               "id": 46008,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5940adbe9251414afb018c0e",
               "name": "Linda Del Rosario",
               "profile_path": null,
               "id": 773316,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5940adc9c3a368040a017172",
               "name": "Richard Paris",
               "profile_path": null,
               "id": 928270,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5940addf9251414afb018c32",
               "name": "Tracey Boulton",
               "profile_path": null,
               "id": 1517387,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "5940ade9c3a3687ddb004573",
               "name": "Rita Riggs",
               "profile_path": null,
               "id": 7308,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5940ae03c3a3687ddb004589",
               "name": "Susan Weir",
               "profile_path": null,
               "id": 1457830,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.443463,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49763,
      "vote_count": 42,
      "budget": 7000000,
      "overview": "One man's struggle to contain the curse he hides within... and his last-ditch attempt to free himself with the love of family. But when it looks as if he is losing his battle, and endangering all he holds most dear, the family dog, Thor, is the last hope for his family's survival... and the end to his Werewolf curse.",
      "similar": [
         2907,
         52520,
         9426,
         924,
         578,
         257445,
         332567,
         346672,
         12444,
         16859,
         11544,
         277,
         10195,
         12437,
         97630,
         50619,
         834,
         854,
         1927,
         12230
      ],
      "original_title": "Bad Moon",
      "runtime": 80,
      "poster_path": "/ivjPm80ZT4MXO1DifALrP0GkOBZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Morgan Creek Productions",
         "id": 10210,
         "origin_country": ""
      }],
      "release_date": "1996-11-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Half man.  Half wolf.  Total terror.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Red"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Wayne Smith",
         "Eric Red"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115610/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NzYzMDQ5NV5BMl5BanBnXkFtZTcwMTczMTIyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mariel Hemingway, Michael Paré, Mason Gamble | See full cast and crew »"],
      "reviews": [
         "Despite what you might think after reading my title, I quite liked Bad Moon. It's good for a werewolf movie even though I sometimes had the feeling I was watching an episode of \"Lassie\" rather than a movie about a werewolf. A man and his girlfriend, both American scientists on an expedition somewhere in the jungle of India, were attacked by a werewolf. He manages to survive the attack and knows to kill the animal, but his girlfriend has already been ripped to pieces and died a horrible death. Even though he survived the werewolf wounded him badly and now he's a werewolf himself. Despite popular believe, the man doesn't only turn into a werewolf at full moon. He becomes one every night and there is no cure. His only hope is his sister and her son. He hopes that the love of his family will cure him from his \"disease\". As I already said Bad Moon is an enjoyable movie. Especially the morphing technique (when you actually see him turn into a werewolf) is cool to watch. The story may not always be the very original, it still does the trick. The same for the acting. There is nothing spectacular about it, but it is very decent and believable. I give this movie a 6,5/10.",
         "I was positively impressed with just how well done the transformation into the werewolf was done. I am very familiar with werewolf movies from the ones done by Lon Chaney Jr. to the present day and this one was pretty effective. The plot was standard, but just how much can one change the werewolf saga? A good man is against his will unfortunately transformed into a murderous creature of the night, and even though he tries his best to control his urges, it is all to no avail, and in the end someone close to him has to end his bloody reign of terror. The acting by the principles was reasonable, and yes the German Shepherd, Thor, did steal the show, but again, so what? I would even enjoy watching it again!",
         "Bad Moon is a sorely underrated werewolf film that is like hidden treasure for werewolf and horror movie enthusiasts. I watched Bad Moon a few years back and did not expect it to become one of my favorite werewolf films - but it did. Maybe it helped because I like both Michael Paré (Eddie and the Cruisers) and Mariel Hemingway (Star 80) but maybe anyone could have acted out the parts and I would have still enjoyed Bad Moon anyway. If you are looking for modern-day, high dollar movie with tons of CGI effects - then this movie may not be for you. Bad Moon uses \"old school\" special effects that I still love to this very day. This is one of those movies I would enjoy watching again on a dark, rainy night with popcorn in hand. 9.5/10",
         "Just as you shouldn't judge a book by its cover, try not to judge a movie by its pre-credits sequence. I was actually groaning aloud while witnessing the bad acting on display as soon as this movie opened. And things looked like they were about to get a hell of a lot worse with a sub-Showgirls moment of unerotic, sexual writhing. Then a werewolf appeared and some blood was thrown around . . . . and my interest was piqued once again. Moving on from that, Bad Moon introduces the viewer to Janet (Mariel Hemmingway), her son Brett (Mason Gamble aka the boy who was Dennis on screen) and their loyal dog, Thor. Into this small unit comes Janet's brother Ted (Michael Pare), the man involved in the opening unerotic, sexual writhing and werewolf carnage. Thor doesn't really like Ted and it's not too long until everyone, apart from those on screen, knows exactly where the animosity springs from. Director Eric Red is not a bad guy. He's provided those who saw it with the brilliance of Cohen & Tate and he also wrote The Hitcher, a long-time favourite of mine. But here, perhaps because he's adapting from the source novel named \"Thor\" by Wayne Smith, he feels a little boxed in and restrained. Seeing the title of the source material on screen certainly prepares the viewer for the focus of the movie as the brave family dog goes about the business of trying to keep loved ones safe. The film plays out like some Joe Dante-infused blend of Cat's Eye, Fluke and Silver Bullet which hinders it initially but then makes for a snappy, and highly enjoyable, second half. Acting aside, as it's frankly not worth mentioning anyway, we can judge this first and foremost as a creature feature. In that respect, does it deliver something worth seeing? I'd have to say that it does. Mixing practical make-up, camera trickery and some nice little tricks and cheats here and there, the main beastie is both handsome (in a beastly way) and ferocious. It may not be up there with the best that this particular subgenre has to offer but it's no pathetic piñata either. So, in summation, the movie overcomes many faults to be something enjoyable and worthy of inclusion in anyone's nostalgic list of movies they inexplicably enjoy. Thanks to the creature design and one solid performance from the canine lead it's a surprisingly sweet-centred horror movie that, strangely enough, perhaps could have used a little less blood on screen to gain some broader appeal (and I never thought I would use THAT sentence in my reviews).",
         "The problem with werewolf movies is that there's so few good ones. Since the dawn of the millennium, we've had two good ones; Ginger Snaps and Dog Soldiers, and then there's the 80's duo of An American Werewolf in London and The Howling, not to mention the Universal and Hammer takes on the legend...but seriously, the werewolf tale is a classic story and it deserves more good films than just the aforementioned. Bad Moon, while certainly not a bad take on the story, is hardly one to add to the illusive list of good ones; but it's still an enjoyable ride for the werewolf fan. It has all the elements to be a success; decent effects, a change sequence, some interesting characters and even a bit about the legend itself. We follow Uncle Ted; a man that has been bitten by a werewolf and decides to go and stay with his sister and her son, in order to beat the curse with family love. However, one thing he hasn't counted on is the family dog; Thor, who could end up being the family's one last hope of survival. The special effects in a werewolf film are very important as the monster is the centre of the tale, and bad effects can easily bring a whole movie down. This movie is lucky enough not to suffer from bad effects and while the wolf isn't exactly lifelike; it looks good enough and it also appears in the film quite often, which is a nice bonus. The change sequence is a little suspect and has nothing on the change scenes in the werewolf films of the 80's, but it's always good to see in a film of this kind. Aside from the werewolf element, Bad Moon also draws on the idea of a strange uncle invading a film home for it's scares, and the idea works quite well. Another idea that works better than I thought it would is having the main hero be a canine. Dogs are sensitive animals, and the film also draws on the idea of a dog wanting to protect the family home from threats. It's also admirable how they managed to get the dog to certain things for the camera, as I imagine that sort of thing wouldn't be easy. While this film isn't a great example of a take on the werewolf legend, it's entertaining and I reckon that people who like werewolf movies will find lots to like about it.",
         "****SPOILERS**** At the start of the movie \"Bad Moon\" Janet,Mariel Hemingway, is harassed by this two-bit shyster Flopsy, Hrothgar Mathews, who's trying to make a quick buck by inciting Janet's and her young son Brett,Mason Gamble, handsome smart and courageous German Shepherd Thor on him in order to sue her for everything that she's got. Thor has Flopsy running for his life with his tail between his legs and threatening to report her and Thor to the local sheriff. Later Janet gets a call from her brother Ted, Michael Pare,who's been away for a while on the Indian sub-continent with his fellow archaeologist and girlfriend Marjorie, Johanna Lebovitz. Janet is more then happy to invite Ted to stay with her not knowing that Ted had picked up a little something in the wilderness of Tibet; a vicious wolf bite when he and Marjorie were attacked in their tent by a wolf-like animal that tore Marjorie to pieces and left Ted barely alive. At the house Thor senses that there's something strange about Ted and Ted knows it. Thor's got the drop on Ted for what he really is. Thor being civil doesn't let on to Janet and Brett who Ted really is in order not to spoil the family get-together but keeps a close eye on Ted to the point where one night he follows him into the woods and sees what he really is, A Werewolf. Ted to his credit does try to prevent himself from going out in the woods at night, when there's a full moon, and killing both people and animals by handcuffing himself to a tree in the forest. This doesn't work all the time with Ted breaking loose and attacking and killing a number of campers and neighbors. One night Flopsy sneaks onto Thor's dog-house with an ax in order to kill him for making a fool out of him by showing him up for what he really is a coward and chiseler. Flopsy instead of finding Thor is found by Ted, in his werewolf mode, and ripped to shreds. Sheriff Jenson, Ken Pogue, who Flopsy reported that he was attacked by Thor earlier in the movie has the local ASPCA take Thor to the dog-pound to be euthanized for the suspected killing of Flopsy. With both Janet and Brett alone and Thor not being around to protect them Ted again turns into a werewolf at moonlight. Janet follows Ted into the woods to see just what he's been doing all those nights that he's been away from the house and, seeing him for what he really is, gets the shock of her life. Ted chasing Janet into the house while Brett, who left earlier, drives with his bike to the pound and saves Thor from being killed by letting him loose. Thor immediately shoots right to the house, almost getting himself killed in the heavy traffic on the country roads, where Janet is being attacked and fighting off the man-turned-beast Ted. Taking on the much bigger and more powerful werewolf Thor's courage and valor more then makes up for Ted's strength and ferocity. With the help of Janet blasting Ted with a full load of lead from her handgun Thor, injured and bleeding, then slams Ted right out of a top floor window killing him. Thor who was on death-row just hours before ended up saving the day, or was it the night, as well as both Janet and Brett lives. \"Bad Moon\" is a pretty good dog coming to the rescue film with Thor stealing every scene, as well as bone, that he was in. The one thing that puzzled me about the hero of the movie, Thor, was what happened to him after he was savagely bitten and mauled by the werewolf? shouldn't he have also turned into a werewolf himself like Ted did or are werewolf bites only effective on humans not animals when it comes to making then into beasts! The answer may be that Thor being a dog he can't be effected by any werewolves bites since he's, I know this is very hard to believe, a beast already?",
         "You have a good life. Nice home, nice yard. But one day a relative comes to visit, and you know something's not right about him. You come to find out he's a werewolf. The only problem is, you're the only one who knows. And you're a dog. Werewolves are one of those monsters that come and go in films. After a decade which saw the release of many good werewolf films (the 1980s), there just weren't many films about them in the 1990s. Bad Moon is one of the few good ones that were made during this period. Not an outstanding film by any stretch, but a fun film nonetheless. It features an excellent performance by a German Shepherd as the protagonist, Thor. Worth a look if you're a fan of the genre. Probably not very exciting if you're not.",
         "This is an excellent werewolf flick! A nail biter for sure. Werewolf looks great and packs an intense punch that will leave you wanting more! Michael Pare is very good. This is one of his better films. Acting is solid and the direction is right on. A winning hit for wolfman fans! I highly recommend this to people who love scary, wolfy type movies. I hit this baby with a 10 spot!! Check it out!!",
         "This movie is a wonderful example of 90s monster horror. had I seen this movie when it first came out, I would of been scared poop-less(granted I would of only been 8) but seeing it nearly 20 years later its comes in at pretty campy. The Acting: Out of the two stars I give for acting. it receives one 1. Convincing. Not award winning. Plot: Out of the three stars I give for plot, this earned 2. Believable. Entertaining. But not too original. Special Effects: The special effects are pretty good for 1996. No use of CGI gives the movie the feel that I think helps it stand the test of time. Even though I do not believe it meets my standard to get the star in SFX",
         "Whenever \"Bad Moon\" comes to mind, I always surprised to read it was made in 1996. The early nineties, maybe, the late eighties, more likely, I think. Yet, there is it. Release date: 1996. The film feels much older then that, a deliberate throwback to early eighties creature features, when Rick Baker, Rob Bottin, and Stan Winston redefined monster effects. The film was ignored upon release and remains somewhat obscure to this day. Open-minded horror fans who take a chance on it might find a likable, eccentric werewolf thriller. Based on the novel \"Thor\" by Wayne Smith, \"Bad Moon\" is a story about a boy and his dog\u0085 And a werewolf. Attorney Janet lives with preteen son Brett in a big house on the edge of the Pacific Northwest forest. Seems the only company the family of two has is Thor, their loyal German Shepherd. That is until Janet's brother Ted comes to stay. Unbeknownst to the family, Ted was bitten by a werewolf while in Nepal. Changing every night, he struggles with his animal tendencies, handcuffing himself to a tree when he transforms. Neither Janet nor Brett connect Ted's reappearance to the vicious mauling deaths in the area. Thor, on the other hand, senses something off about the uncle. The dog keeps a close eye on the man and his nightly rituals. It's not much longer until Ted realizes that Thor is on to his secret. Perhaps the reason the film has never been well-received, besides it generic title, is that \"Bad Moon\" seems to be a movie with two minds. The films open with a steamy sex scene that ends with a werewolf tearing a woman apart and then having its head blown off. The film then transitions to a little boy playing catch with his dog. The whole film slingshots between those two tones. The gore is fairly explicit, the werewolf crushing a construction worker's head in its jaws, strewing his body parts through a tree. Later, the wolf tears a con man apart with his claws, the blood spraying through the air. When the movie isn't focused on graphic werewolf violence, it's a film about family, including the beloved pet Thor. This schizophrenic tone is most obvious in the final act. While Ted confronts Janet about his lycanthropy, chasing her through the house, Brett sneaks off on his bike, rescuing Thor from the local pound. The hard horror content doesn't always co-exist easily with the Spielbergian family drama. Yet it almost doesn't matter because veteran genre screenwriter turned genre director Eric Red nails the heart of the story. The soul of the film rests behind Thor's vivid eyes and the love his family has for him. If they gave out Oscars to dogs, Primo, the shepherd who plays the part, would have won. I'm only being partially facetious when I say he's the best actor in the film. Any animal lover is bound to have their heart-strings tugged by the scene where Thor is separated from his boy. The last act, where Thor and the werewolf fight, would have been ridiculous if the audience didn't care about Thor as much as the characters do. The movie successfully endears the dog to the viewer, investing \"Bad Moon\" with far more emotion then it otherwise would have had. The human cast is a bit more mixed. Mariel Hemingway does very well as the single mom, never reduced to a screaming female. She's strong in the face of a petty con men and remains strong when being chased by a werewolf. Mason Gamble as the young boy is less impressive. It's a good thing that the kid is pushed towards the sideline for most of the film because he's not quite convincing. Michael Pare's performance is a bit harder to read. He conveys a threatening attitude subtly, especially when only a blink frightens Thor into attacking. However, moments of bigger emotions seem unconvincing coming out of Pare's mouth. A brief voice-over narration especially doesn't work, Pare given melodramatic dialogue about \"the restorative power of love,\" for goodness' sake. The center piece of any werewolf movie is its werewolf. \"Bad Moon\" doesn't feature the most original design, your standard up-right dire wolf. However, the effects are convincing. Some might consider them cheesy but I like the close-ups of the drooling, snarling face. The film's relatively small cast keeps the body count low but gore hounds might still find effects of note here. The dismembered body mentioned earlier is especially gruesome. The only effect in the movie that doesn't work is a nightmare sequence featuring a were-dog. It's a silly moment and luckily one the film doesn't focus on. \"Werewolf of London\" is briefly seen and the film outright pays homage too, with its werewolf vulnerable to regular bullets and Nepal-set opening. Red's direction is handsome and makes good use of its lush shooting location. The score balances frights and lovely orchestral nicely. I'm not surprised that \"Bad Moon\" bombed in theaters as a post-\"Scream\" audience probably didn't have much interest in an eighties-style creature feature. The movie's unlikely to blow anyone's socks off but it's a solid werewolf flick nevertheless."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": ["One man's struggle to contain the curse he hides within... and his last-ditch attempt to free himself with the love of family. But when it looks as if he is losing his battle, and endangering all he holds most dear, the family dog, Thor, is the last hope for his family's survival... and the end to his Werewolf curse."],
      "budget": 7000000
   },
   "movielensId": 1168,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-01",
      "dvdReleaseDate": "2000-10-03",
      "directors": ["Eric Red"],
      "runtime": 80,
      "movieId": 1168,
      "title": "Bad Moon",
      "mpaa": "R",
      "actors": [
         "Mariel Hemingway",
         "Michael Paré",
         "Mason Gamble",
         "Hrothgar Mathews",
         "Ken Pogue",
         "Johanna Marlowe",
         "Julia Montgomery Brown",
         "Gavin Buhr"
      ],
      "imdbMovieId": "0115610",
      "originalTitle": "Bad Moon",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["R8mK-_EPxdk"],
      "plotSummary": "One man's struggle to contain the curse he hides within... and his last-ditch attempt to free himself with the love of family. But when it looks as if he is losing his battle, and endangering all he holds most dear, the family dog, Thor, is the last hope for his family's survival... and the end to his Werewolf curse.",
      "tmdbMovieId": 49763,
      "avgRating": 2.52093,
      "releaseYear": "1996",
      "numRatings": 215,
      "posterPath": "/ivjPm80ZT4MXO1DifALrP0GkOBZ.jpg"
   }
}