{
   "tmdb": {
      "original_language": "zh",
      "keywords": [],
      "imdb_id": "tt0485863",
      "video": false,
      "title": "Battle of the Warriors",
      "recommendations": [
         62979,
         108512,
         25384,
         25645,
         358451,
         40166,
         119540,
         137707,
         28123,
         23132,
         41244,
         21241,
         51303,
         16404,
         63736,
         21121,
         10686,
         14245,
         45991,
         39767
      ],
      "backdrop_path": "/wCwe6Kz4tSkvZeNx8mG0s09CcIR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Ge Li",
               "gender": 2,
               "credit_id": "52fe461b9251416c7506d625",
               "name": "Andy Lau",
               "profile_path": "/mrGR5igHcVWdUP1X8yIt1qBMX1L.jpg",
               "id": 25246,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Xiang Yan-zhong",
               "gender": 2,
               "credit_id": "52fe461b9251416c7506d60f",
               "name": "Ahn Sung-Ki",
               "profile_path": "/dvIQzEjQqf4FBkbQxYIQ5JybYSX.jpg",
               "id": 17121,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Cavalry Chief Yi Yue",
               "gender": 1,
               "credit_id": "52fe461b9251416c7506d613",
               "name": "Fan Bingbing",
               "profile_path": "/rO6kT0EJuXRKUKEyKN9O6LyG71A.jpg",
               "id": 64439,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Prince Liang Shi",
               "gender": 2,
               "credit_id": "52fe461b9251416c7506d617",
               "name": "Choi Si-won",
               "profile_path": "/nq5KYGVYH4Zr983kDYAPlOxHvUT.jpg",
               "id": 77318,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "King of Liang",
               "gender": 0,
               "credit_id": "52fe461b9251416c7506d621",
               "name": "Wang Zhi-Wen",
               "profile_path": "/eSkabnJRA8BfhTeCJCf7NCGrU20.jpg",
               "id": 109435,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe461b9251416c7506d61d",
            "name": "Jacob Cheung",
            "profile_path": "/6zvL7vSBvOfAXJIKpBFfbhQCWR5.jpg",
            "id": 77319,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 2.023589,
      "production_countries": [{
         "iso_3166_1": "CN",
         "name": "China"
      }],
      "id": 14808,
      "vote_count": 20,
      "budget": 0,
      "overview": "In 370 B.C, China was separated as seven nations and several other small tribes, one of these being the city state of Liang. The nation of Zhao is led by the terrifying Xiang Yangzhong who orders his troops to conquer the small city. Leaping to the defense of the people of Liang is 'Ge Li' from the Mo-Tsu tribe, their last hope from the terrors of Yangzhong's troops.",
      "similar": [],
      "original_title": "墨攻",
      "runtime": 133,
      "poster_path": "/65ExJbKyHiTdDPQVtwAER1MNBbX.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Boram Entertainment Inc.",
         "id": 2965,
         "origin_country": ""
      }],
      "release_date": "2006-11-23",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Chi Leung 'Jacob' Cheung"],
      "runtime": 133,
      "synopsis": null,
      "writers": [
         "Chi Leung 'Jacob' Cheung",
         "Ken'ichi Sakemi"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0485863/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzNTIxNzU5MV5BMl5BanBnXkFtZTcwNDUyMTk3Mg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Andy Lau, Sung-kee Ahn, Zhiwen Wang | See full cast and crew »"],
      "reviews": [
         "The warring states of Ancient China serve as a backdrop for this pan-Asian war epic, starring the charismatic Andy Lau. Going by the literal translation of the Chinese title, it's \"Ink War\", alluding to the fact that much of the battles in this movie relies a lot more on superior strategy in order to overcome a mammoth battle against a Goliath, with a 4,000 population up against the might of a 100,000 strong well-trained army. Based on a Japanese novel/manga Bokkou, Battle of Wits fictionalizes one of the episodes during 370BC, where China was still divided, and each nation seizing opportunities to usurp the other. Those familiar with history will know that eventually, the kingdom of Qin will ultimately unite the Middle Kingdom for the first time. However, the story sets its sights on the Kingdom of Zhao leading an attack on the smaller state of Liang. In its defence lies a mysterious man from the Mozhi tribe known as Ge Li (Andy Lau of course), who galvanizes Liang's population to stage a stand against what seemingly looks like impossible odds. While war movies of long, long time ago have been flogged to death recently by Hollywood, with films like Alexander, Troy, and fantasy epics like the Lord of the Rings series, Asian movies have rarely scratched the surface until of late, with Battle of Wits leading the charge, and coming right up are at least two film adaptations of episodes from the Romance of the Three Kingdom novels. For those expecting fantastical and romanticized wu-xia martial arts moves, you will be disappointed, as this movie is rooted much in reality. Given the epic scale of this production, it still rings a sense of familiarity in its war scenes, and I thought that shooting most of them in middle-close range, loses much of its grandeur. The big spectacles shown have nothing new that will take your breath away, especially after Hollywood has plundered such productions. Nonetheless it augurs well that Battle of Wits managed to pull off a production of this nature, and has, surprise, a competent storyline to carry it through. There is a strong anti-war message that got worn on the sleeves Ge Li, as smart and cunning as he is, he's the reluctant hero, willing to make sacrifices for the greater good. He finds no pleasure in war, nor killings, but in order to save the masses, he must do what he has to thwart efforts of bloodthirsty kingdoms. He's is the message of \"loving thy enemy\", naturally not shared by the incompetent leadership in Liang. And since time immemorial, you always have the incompetents possessing the heart of insolence, with characters of sloth and ill intentions, straddling from a high horse. Inept leaders silencing their opposition through calls of treason is a tactic all too familiar, which makes it all the more despondent as you ponder about that aged old Chinese proverb about there being nothing wrong in looking after your personal interests first, instead of bothering with the affairs of others. Ge Li faces both the task of winning over the people's trust (since they're committing the state's defences to his organization), and the inevitable unappreciative, thankless task of having to do just that. As I mentioned, do not expect to see \"Qing Gong\" or fancy swordplay. Rather I was in awe with the delivery of strategies and counter strategies in having two warring factions pitting their wits against each other. Sometimes they come rather unexpectedly, and will leave you with a smile, like when you're wondering just what everyone is up to when they close their eyes en masse. Accompanied by an excellent soundtrack, the movie could be split down two halves, and while the first centered on the macro affairs, a more micro, personal affairs of the heart managed to creep in between Ge Li and Yi Yue (the gorgeous Fan Bingbing), a calvary officer, and though their romance sometimes stalled the pace of the movie, it added some gravitas to Ge Li the Man, questioning his strong beliefs on being unselfish, and made the finale all the more heart-wrenching to watch. Featuring stars like Wu Ma and Nicky Wu (when was the last time I saw them in a movie) and Korean actor Ahn Sung-kee, this certainly is the movie to watch this week. Forget about them animated penguins, treat yourself to an epic worthy of your time, and well worth a weekend ticket.",
         "Big budget and hundreds of extras. Huge sets and even bigger philosophical issues. Summary: A lone philosopher warrior arrives to help defend a small kingdom of 4000 from an invading army of 100,000. His surprisingly effective help is accepted until the king and his court become jealous of his popularity and turn on him. Well directed and photographed Chinese/Japanese co-production is full of unanswered philosophical questions about war and honor and when does self-defense turn into savagery. There are a number of rough edges, a few scenes are hard to understand, the historical setting might be unfamiliar to non-Asian viewers, sometimes you can't tell which side of the fight you are watching (although that might be intentional), the CGI effects are sometimes no better then what you would see in a Playstation 2 cut scene and occasionally the movie resorts to old- school theatrics. Despite these shortcomings this movie should see a wider release, in some ways it's better than \"Hero\" or \"House of Flying Daggers\". Very recommended.",
         "It's not everyday that a seemingly generic movie serves up surprises of the immense strength seen here. Although the word immense may carry subjective undertones to each and every movie watcher, getting a powerful anti-war and humanist message thrown into the mix can never be a bad thing. And while certainly not ground breaking in any shape or form and riddled with shocking oversights totally out place in a professional production, A Battle of Wits (ABOW) makes good on its promise in a manner sadly absent from many a supposedly superior project. Once more we're subjected to the oft reused premise of second century China where the seven kingdoms are in an Orwelian state of perpetual war, a condition ABOW at least delivers in a more historically-authoritative fashion. None of that make-believe fictional nonsense suffices, we get names and places that nominally come straight from the history books. At the core of proceedings lies city-state Liang, besieged by the vastly more numerous armies of Zhao. Liang's rather uncaring ruler (Wang Zhiwen who was also in Together) summons for help from legendary warrior-tactician clan Mozi, but only one man turns up: the lone, enigmatic negotiator-style wanderer Ge Li, constantly referred to in the film as Mr. Ge Li for a more meaningful reason than ostensibly presented. Done by Andy Lau in a somewhat low-profile role for the superstar, Ge Li brings to the fore the usual unwilling class and prime values so essential in a valiant protagonist. The catch here is that for all his conquering charm and military prowess, Ge Li doesn't believe in violence and espouses universal love. He also never really hurts anyone on screen, and manages great victories with the least carnage possible, accepting the necessity of violence with the utmost pain. Ge Li gathers Liang's resources as the city becomes encircled by the more traditionally-militant Zhao forces. There's quite a few skirmishes and battles with the movie pacing itself nicely, alternating between philosophical ponderings and action as needed. The antagonists are marshalled by General Xiang Yan Zhong, played by excellent Ahn Sung-kee, who provides a link between ABOW and one of its main inspirations, Musa, where Ahn did the skilled Korean archer Jin. Another element thrown in for good measure revolves around the fledgling love affair between Ge Li and cavalry captain Yi Yue (Fan Bingbing). However, do not worry about getting this epic spoiled by saccharine distractions. ABOW doesn't hold back the tragic contingent, with one heart-wrenching calamity close on the heels of its predecessor. Sooner or later, a sobering reminder yanks events back to the harsh light of reality, no matter how promisingly ideal. Throughout the respectable running time available, maneuvering and scheming supplement ferocious combat, but none of it comes across gratuitous. While you sit there enjoying the clever writing and constant surprises, the story moves along beautifully, purveying the deepest, most profound human content seen in this genre, possibly ever. None of the usual bravado and camera-pleasing antics transpire, ABOW shying from pyrotechnics and wire-works to concentrate on a memorable message regarding the horrors of warfare and the fallibility of humanity. And the grace with which this is conducted must be cherished. Characters steer clear of preachy sermonizing, instead delivering their heart-breaking anguish through organic narrative and fitting context. But every character has ambiguity written all over it, from Ge Li as undecided about his role and identity, the Liang monarch who's as cruel and bent as can be despite professing love for his people, to the contemplative Zhao general and hapless commoners, this flick has them all. It does feel a tad rushed in certain places, some scenes obviously cut short, mayhap to avoid a more restrictive rating due to violent content that was left out by ruthless editors. Still, this doesn't detract from enjoying ABOW's deep moral repercussions and excellent story. What do stand out as sore spots are occasionally ridiculous visual effects and sheer amateurish performances, such as Fan Bingbing opening her eyes a split second after her character was supposed to close them once and for all. Also, some of the action suffers from over-direction, looking like laughable dance choreography with soldiers stumbling around in an exaggerated manner. Additionally, the voice track was clearly dubbed without any effort to mask the discord inevitable when doing this, resulting in awkward spoken material. This isn't helped much by the almost complete absence of a proper soundtrack. Avoid thinking these serious pitfalls. With every single participant in the story completely convincing and multi-dimensional, ABOW scores a huge win for a relatively underdoggish release, and none of its minor failings diminish that. Whatever's broken with the movie on hand is more than made up for by its realistic impact, and thirty minutes in you'll be right at home in Liang, oriented to feel it as a real place confronting concrete terror and hope. Make tracks to the nearest venue showcasing this milestone and see what happens when Hero meets Platoon or Full Metal Jacket. A Battle of Wits is that significant, albeit most likely it will go down in history just as misunderstood as the pan-human principles it seeks to imbue for the benefit of us all. Rating: * * * * 1/2",
         "being a huge fan of the original Japanese manga version of the Muk Gong, i have a big expectation to see this movie, and it doesn't disappoint. whereas the original manga covers much deeper the Mo Jia theories and their developments and the meaning behind, the movie actually adapted the storyline splendidly (though some may find some scenes towards the end a bit incoherent, you will know if you have read the manga) and the movie focus more about the ethnics of war. A big tension about the film is that Ge Li (andy lau) has to use warfare strategies to spread his self-sacrifice/non-attack/cross-spectrum love ideals (i believe this is how a Chinese philosophy get closest to the Christian ideal), moreover his existence is only valid during war time period, this contradiction of Ge Li can actually explain the developments of the movie. the director Chi Leung Cheung spent more than 10 years to do this movie and andy lau said in interviews that without Cheung he wouldn't take the post of Ge Li, this movie is definitely not only about the visual, but the inner meanings of the now almost forgotten Mo Jia. Sometimes it makes you wonder how china would be like if Mo Jia (along with many more other Jias; Jia = schools of thought) were not abandoned... i recommend all those who like the movie to check out the manga and novel as well...",
         "This film is based on Bokko, one of the finest Japanese manga ever crafted, about one man - Ge Li - sent to defend a besieged city in ancient China. Andy Lau here plays the main character, effectively downplaying his super-stardom with a delicate, subdued and humble performance. Apart from him, we get epic battles with twists, a couple of very nifty strategic ideas, and all the grievances and politics of the besieged city of Liang come to a boiling point. Ge Li has to fight enemies from within and without. Chinese filmmaking often draws upon that nation's very rich literary heritage, and it's often exciting to see the best it has to offer when that heritage blends with great aesthetics backed up by an important budget. \"Hero\" comes to mind of course, probably as the pinnacle of the genre. But even that film belies a worrying trend in mainstream Chinese film: ideological bullying. Back to this in a second... Technically, the film is of course very competently made, the period and city are created to perfection, even if the visual style is never more than generic. Where things begin to go sour is in the characterizations. The source manga has very rich, complex characters, and while it is unfair to condemn a film under 3 hours for failing to capture the wealth of a 400+ page graphic novel, one wonders why the filmmakers did not cut content for the sake of depth rather than the opposite. A lot happens very quickly, and it is very hard to care for anyone but Lau's Ge Li. This problem is further compounded by the apparently chronic irrationality of many characters: they act in frustrating ways, seemingly just because the film requires them to in order to complicate the hero's predicament. On the previously mentioned ideological front, things become downright risible. The source manga is a tribute to the value of the individual and the vices of the ruling class. On the other hand, the film suggests (word for word in one scene) that only unity will end war in China, and the leader of the invading army is made into a far more compelling human being than any of the inhabitants of the besieged city. In the end, the film is a case study in how filmmaking by committee leads to bland and idiotic results: nonexistent character, crude ideological content, spectacle for its own sake and a total absence of personality. But it has two good things going for it: first, it might get you to read the infinitely superior manga. The second reason is a man named Andy Lau.",
         "\"Battle of Wits\" seems to be based on a comic that is based on a famous period in the history of China! Everything in the movie looks authentic! The action is done as realistic possible! So no wire fu or any kung fu for that matter! This is not a martial arts movie! People who expect this will be disappointed! There is just enough action to make a point! The movie is indeed about strategy and tactics as the title suggests! Even when the pace of the movie is slow at times there are some surprises that will keep matters interesting! The love angle is beautifully done and not distracting at all! We have Andy Lau to thank for that because he really is superb as Ge Li! At first he is distant and passive like a monk! When he is explaining his philosophy to a slave he rescued, he realizes that he should show his love for Yi Yu (Bingbing Fan)! Also his prayer for peace is convincing! He is trying to avoid bloodshed as much as possible! When he is forced to kill a large number of enemy soldiers he begins to doubt whether he has taken the right action! This doubt makes him very human and very likable! He even makes an impact on the commander of the enemy troops! \"Battle of Wits\" is not without flaws! The battles are not that intense and massive as you would expect from a movie like this! And the pace is too slow at times! But in the end the result is that of a war epic with a very powerful message!",
         "\"A Battle of Wits\" is a historical spectacle that Hollywood used to turn out with what now seems to be amazing frequency during the Big Studio era. The scene when the Andy Lau character Ge Li approaches the Liang city gate on foot in a hooded robe reminds me of another movie scene, Robert Taylor as Ivanhoe approaching on horseback the keep where his father is held prisoner, with Ivanhoe wearing a hooded monk's robe. One movie review described Lau as being the first metrosexual, based on his appearance, but Taylor's Ivanhoe character also sports a stylish goatee. Ivanhoe also has scenes of siege warfare, but is nowhere near as grim as \"A Battle of Wits.\" --SPOILER ALERT-- The only character who seems remotely normal in this Asian co-production is the Zhao slave whom Ge Li rescues. At one point, this slave tells Ge Li that the only way to end the fighting and bloodshed is if China is unified, instead of having seven feuding kingdoms. That statement is meant to appease the Beijing political censors. The Mozi Ge Li is a comic book figure like Superman, totally unreal. The drunken, vicious King, told that his son and only heir died after a bungled attempt to kill Ge Li, lets the General responsible live temporarily. The Commander of the Zhao forces lets himself be burned alive after ordering his troops to leave Liang. After the battles, the city itself is a wreck, parts burned down, others demolished, many of its citizens dead, some executed on orders of the paranoid King. Liang's army leadership ends up wiped out. The production values, especially the art direction, are world class in this movie. From the carved designs on the pillars in front of the city entrance to the costumes (including even classy looking rectangular shields) to the cinematography, the crafts people who worked on this picture did a great job. Whatever the cost of the movie, whether the $16 million quoted on a website or more, all the money spent shows up on the screen.",
         "Around 500 BC, the four greatest civilisations in the world - Greece, Persia, India and China - had a flowering of philosophy, perhaps due to the spread of urbanisation. In Europe, Greek philosophers like Socrates, Plato and Aristotle lived, and schools like Stoicism, Cynicism, Platonism and Scepticism flourished. In the Middle East, mainly within Persia, but also conquered territories like Egypt and Judea, monotheism like Zoroastrianism and Judaism flourished. In India, some of the most sophisticated and rational systems of spirituality and psychology developed in Buddhism, Jainism, Ajivika and Vedic philosophy. In China, the 100 Schools of philosophy flourished, which included Confucianism, Taoism, Legalism - and Mohism - the latter being the subject of the film. While many cultural supremacists like to exaggerate the differences between countries, all of these philosophies fundamentally dealt with the same human condition, and shared a lot in common - for example, Stoicism and Buddhism were both intended as rational systems for coping with life and enhancing the mind - much of their wisdom revolves around acceptance that humans have limited power over the external world, so it is more rational to change oneself. Mohism, one of China's great contributions to human understanding, was suppressed by the first emperor of China when he burnt all the books of non-sanctioned ideologies (the Qin state followed Legalism) - and was further forgotten during the subsequent Han dynasty which promoted Confucianism - the ideology which remained the most influential in China, Korea and Vietnam. Surviving works were absorbed into the Taoist canon, and attempts to study Mohism are difficult thanks to it no longer being a 'living' tradition with an experienced lineage going back to it's founder. But what we do know, is that Mohism was similar to Buddhism and Christianity - a universalistic philosophy that believed in compassion toward all other humans. Mozi, it's founder, is said to have negotiated peace between kingdoms on the verge of war, and enhanced the fortifications of the kingdoms facing attack to dissuade violence. In this film, the protagonist is a Mohist tasked with defending a settlement during the Warring States period around 450 BC. Elements of Mohist philosophy are demonstrated in his actions, making it interesting film for anyone with inclinations toward learning. It is also a pretty good action film or drama, as other reviewers will point out.",
         "One the surface, one could associate BoW with \"The Alamo\", as an account on the siege of a city. The similarity, however, ends there. While \"The Alamo\" is about simple, sweet heroism, BoW is more complex. Finally, someone has the guts to invest in a \"Chinese historic epic\" that is not intended to please the general Hollywood-type audience. And this time, the movie is made by a Hong Kong director (Cheung Chi-leung) � one who has never been afraid to take things slowly even if it means that probably a majority of the audience will get \"bored\". \"Ji sor\" (1997) is a perfect example. Shot in a grainy, brownish hue, BoW depicts how a wandering strategist (think \"Yojimbo\") Ge Li (Andy Lau) helps the besieged city defend against overwhelming odds (the complex historical background can probably be ignored without losing much from appreciation of the movie). While a strategist, Ge is first and foremost a philosopher, spreading the gospel of \"universal love\" and \"no violence\". The battle scene, though impressive at times, is not the soul of the movie, as the complex character of Ge plays a more important part in attracting the attention of an appreciative audience. Just as intriguing are his nemesis General Xiang (veteran Korean actor Ahn Sung-kee) and wicked-to-the-bone governor of the city (veteran Chinese actor Wang Zhiwen � \"Half life fate\" and \"The emperor and the assissin\"). BoW is not your regular war epic (although it is not lacking in good action sequences) in many of which you'll find one-dimensional characters aplenty. It strives to give its characters depth (just compare the Andy Lau in this movie and the same actor in \"House of the flying dagger\"). It also tries to give the audience something to reflect on after leaving the cinema. Although it is not without flaws (could be better paced and tends to get preachy at times), this movie is generally successful in what it sets out to do.",
         "An epic Chinese, Warring States period war film staring Andy Lau as warrior/philosopher Ge Li who encourages the state of Liang to defend itself against a more powerful neighboring state. Ge Li as a third party interloper represents the Mozi sect and their non-violent philosophy and defends the state of Liang to prevent greater carnage from the aggressive nation of Zhao. Helping to defend Liang, Ge Li must reconcile his philosophical beliefs with the messy realpolitik ambitions of Kingdom's leadership and also deal with the petty jealousy of less courageous rivals. Although this film is well made and Ge Li's dilemma is compelling, an entire ludicrous segment involving a female love interest detracts from the central theme and, in fact, seems like a gratuitous concession to commercial interests."
      ],
      "genres": [
         "Action",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Boram Entertainment",
         "Comstock",
         "Fortissimo Films"
      ],
      "summaries": [
         "In 370 B.C, China was separated as seven nations and several other small tribes, one of these being the city state of Liang. The nation of Zhao is led by the terrifying prime commander Xiang Yangzhong who orders his troops to launch an attack on Liang in a bid to conquer the small city. Leaping to the defense of the cowed people of Liang is a warrior who goes by the name of 'Ge Li' from the Mo-Tsu school of thought, renowned for its defensive skills, respect for simplicity and peace, and belief in universal love. He is their last hope as the terrors of Yangzhong's troops are unleashed. The future of Liang now hangs in the balance, with all their hopes pinned on the mysterious Mo-Tsu warrior Ge Li...",
         "Story centers on a battle during China's Warring States Period, a series of civil wars, which spanned from the 5th to the 3rd century B.C. Based on a popular Japanese manga, which was in turn based a Japanese novel inspired by Warring States history in China."
      ],
      "budget": 16000000
   },
   "movielensId": 116803,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "普通话"
      ],
      "releaseDate": "2006-11-23",
      "dvdReleaseDate": null,
      "directors": ["Jacob Cheung"],
      "runtime": 133,
      "movieId": 116803,
      "title": "Battle of the Warriors",
      "mpaa": "R",
      "actors": [
         "Andy Lau",
         "Ahn Sung-Ki",
         "Fan Bingbing",
         "Choi Si-won",
         "Wang Zhi-Wen"
      ],
      "imdbMovieId": "0485863",
      "originalTitle": "墨攻",
      "genres": [
         "History",
         "Drama",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In 370 B.C, China was separated as seven nations and several other small tribes, one of these being the city state of Liang. The nation of Zhao is led by the terrifying Xiang Yangzhong who orders his troops to conquer the small city. Leaping to the defense of the people of Liang is 'Ge Li' from the Mo-Tsu tribe, their last hope from the terrors of Yangzhong's troops.",
      "tmdbMovieId": 14808,
      "avgRating": 3.66667,
      "releaseYear": "2006",
      "numRatings": 6,
      "posterPath": "/65ExJbKyHiTdDPQVtwAER1MNBbX.jpg"
   }
}