{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "serial killer",
         "id": 10714
      }],
      "imdb_id": "tt3904186",
      "video": false,
      "title": "Tales of the Grim Sleeper",
      "recommendations": [
         103752,
         49637,
         200942,
         86750,
         43487,
         45615,
         265929,
         37970,
         140481,
         319079,
         136071,
         16765,
         42567,
         24235,
         273509,
         25283,
         180314,
         341,
         35004,
         133879
      ],
      "backdrop_path": "/ypFo3f0WV9XvnDPzhUrl4A0uxOg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "Himself",
            "gender": 0,
            "credit_id": "553df8319251415852002742",
            "name": "Lonnie Franklin Jr",
            "profile_path": null,
            "id": 1459845,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5405c4aec3a36816af0036f0",
               "name": "Nick Broomfield",
               "profile_path": "/ra54j6GHbTkkv9mPrzjllH1A5UF.jpg",
               "id": 92561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5405c4d4c3a368436600850d",
               "name": "Barney Broomfield",
               "profile_path": null,
               "id": 1359822,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "553df85ec3a3683c48005c57",
               "name": "Marc Hoeferlin",
               "profile_path": null,
               "id": 107783,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "553df870c3a3685c65000e72",
               "name": "Erin Li",
               "profile_path": null,
               "id": 1459847,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "553df89392514137f9002de1",
               "name": "Sophia Loukaides",
               "profile_path": null,
               "id": 1459848,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "553df8bd925141687400711e",
               "name": "H. Scott Salinas",
               "profile_path": null,
               "id": 62705,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "553df8d39251413f5a0095bf",
               "name": "Joe Bini",
               "profile_path": "/pc6xqYadNk9NePR5hvDICZQPLC4.jpg",
               "id": 6827,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "553df8dec3a36879e70011a3",
               "name": "Marc Hoeferlin",
               "profile_path": null,
               "id": 107783,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "553df8f6c3a3683c48005c68",
               "name": "Mark A. Rozett",
               "profile_path": null,
               "id": 113838,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "553df9239251415852002758",
               "name": "James Honaker",
               "profile_path": null,
               "id": 1459849,
               "department": "Visual Effects",
               "job": "Color Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 2.207493,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 289575,
      "vote_count": 24,
      "budget": 0,
      "overview": "When Lonnie Franklin Jr. was arrested in South Central Los Angeles in 2010 as the suspected murderer of a string of young black women, police hailed it as the culmination of 20 years of investigations. Four years later documentary filmmaker Nick Broomfield took his camera to the alleged killer’s neighborhood for another view.",
      "similar": [
         1696,
         10285,
         948,
         10781,
         984,
         39874,
         9411,
         274,
         2832,
         1359,
         4232,
         4638,
         181283,
         1949,
         371608,
         1991,
         238636,
         10585,
         845,
         4488
      ],
      "original_title": "Tales of the Grim Sleeper",
      "runtime": 105,
      "poster_path": "/1ywSDHEQky7RwdCm7dxa6jnXOm4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "South Central Films",
         "id": 52185,
         "origin_country": ""
      }],
      "release_date": "2014-08-29",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "25 years. Hundreds of victims. Justice for none.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Broomfield"],
      "runtime": 110,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3904186/",
      "coverLink": null,
      "actors": ["Stars: Pam Brooks, Nick Broomfield, Lonnie David Franklin Jr. | See full cast and crew »"],
      "reviews": [
         "This documentary is about Lonnie Franklin who killed 10 women over the course of 25 years in South Central LA. The documentary served as an attack on the LAPD's inability to do the right thing, to investigate and release warnings to the public. It is also a testament to Nick Broomfield's persistence, as an outsider sporting a big microphone and a funny accent he was able to wear down and break communication barriers, witnessed by the evolving stories of those interviewed. Once inside a subculture within the gnarly South Central LA district, he reveals a full spectrum voices that speak the message of outrage from victim's loved ones and their supporters, to witnesses of sexual deviancy in the form of Franklin's friends.",
         "This is a film that is shocking to see because it lays bare the underside of American society that few are willing to countenance. Broomfield speaks with an array of black residents of South L.A., and uncovers a mind-bending culture of violence, anti-social behavior and sexual deviance. If nothing else, this film shows what happens when society and culture descend into a kind of nihilistic madness. Some characters, admirably, maintain a sense of good humor amidst the wasteland. However, Broomfield resorts to the usual politically correct bromides, allowing members of an activist group an open mic to condemn the police for the killer's actions, with no discussion of how culture and the attitudes of members of the community have contributed to the outrageous crimes that Franklin got away with for so long. This is, at best, a highly simplistic analysis of the situation. One woman discusses, almost proudly, how members of the community refuse to cooperate with the police, and will virtually never report a crime. Franklin's son discusses how his family members largely disowned him for turning in his murderous father. Franklin's friends discuss participating in appalling acts of rape and sexual humiliation against prostitutes. Everyone has a very casual attitude towards morals, behavior, justice, and sometimes human life in general. Broomfield should have explored this in more detail, but instead fails to draw the obvious connection that the police, racism, and \"society\" cannot exclusively be blamed for these disastrous cultural failings, and thus comes close to embracing the kind of moral relativism and excuse-making that has perhaps been as harmful to the underclass as racism and bad policing may have been in the past. This is still a film worth seeing, but if only Broomfield could have taken off his ideological blinders and noticed what was happening right in front of him, he could have offered a more sociologically relevant and honest film.",
         "In July 2010, Los Angeles Police arrested a man on suspicion of murder, yet to date he has languished in gaol without being tried. How come? Lonnie Franklin Junior is a suspected serial killer. He is accused of the murder of a woman in August 1985. Victim number 9 - the only known survivor - was shot in November 1988. It was not until March 2002 that another accredited victim was found. That near fourteen year hiatus led to the perpetrator being dubbed The Grim Sleeper. Although Franklin is charged with only ten murders and one attempted murder, he is suspected of committing many more. The evidence against him, which includes DNA, looks compelling, but at the moment his lawyers are playing what some might consider an obscene game to delay the inevitable. One of their tactics was to challenge the admissibility of a DNA sample as the fruit of the poisonous tree. This documentary does not deal with the legal case against Franklin so much as the lives of those who knew him. Interviewer Nick Broomfield is shown around the area by a former prostitute, and meets a wide variety of people, including Franklin's son, who unlike his father is not even superficially a nice person. All but one of Franklin's alleged victims were black, and all were apparently women a long way down the food chain. This and other factors like the failure of the police to warn that a serial killer was at large has led to the usual claims about race. This is a long documentary, but one you can watch or simply listen to while multitasking. Doubtless there will be others about this case after Franklin's trial and likely conviction. As things stand, that should begin next month, but don't count on it",
         "This documentary has so many holes. Nick Broomfield is an idiot who doesn't listen to the people he interviews. He needs to stop making documentaries. Example: He'll play a 911 call but goes no further to explain the van mentioned by the caller. Why would the killer call 911 and report his own van and license plate? He asks frustratingly DUMB questions (Often more than once per interview). He even runs a stop sign while driving around. He's inept and I can't stand the way this movie was done. Could have been great. But he made it unbearable with far more questions than answers. What a shame. These people deserve to have their story told by someone who knows what they're doing.",
         "It's not bad - it shows that LAPD are incompetent, and that in South Central life is very cheap indeed. Usual Broomfield faux-incompetence. Can't quite prove the allegation that LAPD were complicit rather than incompetent in the non-arrest of a prodigious serial killer. The impressive thing is the interviews, which Broomfield plays down. He can have people who were hurling insults at him tearfully recollecting, or admitting their own complicity as they realise they cleaned bloodstains or found victims. I'm surprised some local tough guy didn't take him out, there seems to be a strange reliance on the police, who no-one remotely trusts for anything else, to solve the problem of a serial killer in the neighbourhood - looks like local people who weren't related to the victims didn't care any more than the LAPD."
      ],
      "genres": [
         "Documentary",
         "Crime"
      ],
      "productionCompanies": ["South Central Films"],
      "summaries": ["Nick Broomfield digs into the case of the notorious serial killer known as the Grim Sleeper, who terrorized South Central Los Angeles over a span of twenty-five years."],
      "budget": 0
   },
   "movielensId": 116989,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-08-29",
      "dvdReleaseDate": null,
      "directors": ["Nick Broomfield"],
      "runtime": 105,
      "movieId": 116989,
      "title": "Tales of the Grim Sleeper",
      "mpaa": "",
      "actors": ["Lonnie Franklin Jr"],
      "imdbMovieId": "3904186",
      "originalTitle": "Tales of the Grim Sleeper",
      "genres": [
         "Crime",
         "Documentary"
      ],
      "youtubeTrailerIds": ["3Gh2dOxMAvM"],
      "plotSummary": "When Lonnie Franklin Jr. was arrested in South Central Los Angeles in 2010 as the suspected murderer of a string of young black women, police hailed it as the culmination of 20 years of investigations. Four years later documentary filmmaker Nick Broomfield took his camera to the alleged killer’s neighborhood for another view.",
      "tmdbMovieId": 289575,
      "avgRating": 3.54167,
      "releaseYear": "2014",
      "numRatings": 48,
      "posterPath": "/1ywSDHEQky7RwdCm7dxa6jnXOm4.jpg"
   }
}