{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "inuit",
            "id": 3355
         },
         {
            "name": "explorer",
            "id": 157155
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "starvation",
            "id": 188266
         },
         {
            "name": "clans",
            "id": 192914
         }
      ],
      "imdb_id": "tt2296935",
      "video": false,
      "title": "The Legend of Sarila",
      "recommendations": [238302],
      "backdrop_path": "/nK8dfV4WgJprKZFMBLJYRSBUHqh.jpg",
      "revenue": 15000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Croolik (voice)",
               "gender": 2,
               "credit_id": "530417a7c3a3683a9904b641",
               "name": "Christopher Plummer",
               "profile_path": "/fauMGxa6dc86nHNenQ8X6DlE6YV.jpg",
               "id": 290,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Apik (voice)",
               "gender": 1,
               "credit_id": "530417afc3a3683a91053546",
               "name": "Rachelle Lefevre",
               "profile_path": "/uVhPuqxlSmMMxIDZZN2PnLuyBeh.jpg",
               "id": 58168,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Markussi (voice)",
               "gender": 2,
               "credit_id": "530417b6c3a3683a7a0471d7",
               "name": "Dustin Milligan",
               "profile_path": "/n1vPVyn9lcd3c3u5CLMYmAAYcAc.jpg",
               "id": 53117,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Poutulik (voice)",
               "gender": 2,
               "credit_id": "530417bcc3a3683a7a0472ac",
               "name": "Tim Rozon",
               "profile_path": "/t7PqAPjsFZ2a4LKdbgXQwk0Fg3f.jpg",
               "id": 73610,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Saya (voice)",
               "gender": 0,
               "credit_id": "530417c3c3a3683a73062a5c",
               "name": "Geneviève Bujold",
               "profile_path": "/qqtni1dpO3b7nDeG9NOxKAPk7yM.jpg",
               "id": 35341,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Kwatak (voice)",
               "gender": 2,
               "credit_id": "530417cbc3a3683a7a047408",
               "name": "James Kidnie",
               "profile_path": "/INA5CUwxgE0okChyY3rLaQjsdc.jpg",
               "id": 38565,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Itak (voice)",
               "gender": 2,
               "credit_id": "530417efc3a3683a91053b62",
               "name": "James Kidnie",
               "profile_path": "/INA5CUwxgE0okChyY3rLaQjsdc.jpg",
               "id": 38565,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mipoulok (voice)",
               "gender": 0,
               "credit_id": "5304182bc3a3683a81058a6f",
               "name": "Angela Galuppo",
               "profile_path": "/bvX2yrwllRfz5g5JyiAnGmFXfqO.jpg",
               "id": 147892,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Kauji (voice)",
               "gender": 2,
               "credit_id": "53041832c3a3683aa1045bb5",
               "name": "Elias Toufexis",
               "profile_path": "/7lUw0pCCKEG98Hve3H4EAFERG1l.jpg",
               "id": 58907,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Arlok (voice)",
               "gender": 2,
               "credit_id": "5304184bc3a3683a7a0488a8",
               "name": "Elias Toufexis",
               "profile_path": "/7lUw0pCCKEG98Hve3H4EAFERG1l.jpg",
               "id": 58907,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Kimi (voice)",
               "gender": 2,
               "credit_id": "530418c2c3a3683a8105a715",
               "name": "Robert Higden",
               "profile_path": "/3CixeWnXbHmmc2RZMP9b2IywX6F.jpg",
               "id": 78687,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Jiniak (voice)",
               "gender": 1,
               "credit_id": "53041931c3a3683a9105aef4",
               "name": "Holly Uloth",
               "profile_path": "/5sLJUJvdOrQk9lpSe2IXd7v0xIf.jpg",
               "id": 85168,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Tayara (voice)",
               "gender": 0,
               "credit_id": "5304193ec3a3683a7306ff44",
               "name": "Dawn Ford",
               "profile_path": "/1aKWK9ksGeSUEwWCg3FnvNFEYBq.jpg",
               "id": 1091868,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Ukpik (voice)",
               "gender": 2,
               "credit_id": "53041948c3a3683ab2048fce",
               "name": "Natar Ungalaaq",
               "profile_path": "/3TVkYi8p7Ww73ZRFwINpdUZKdUj.jpg",
               "id": 97299,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "Sedna (voice)",
               "gender": 0,
               "credit_id": "5304194fc3a3683aab051dd9",
               "name": "Elisapie Isaac",
               "profile_path": null,
               "id": 1294340,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4e1bc3a36847f827e4af",
               "name": "Nancy Florence Savard",
               "profile_path": null,
               "id": 1276675,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53041962c3a3683a7307064d",
               "name": "Roger Harvey",
               "profile_path": null,
               "id": 1294341,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53041969c3a3683a6d03ccf0",
               "name": "Paul Risacher",
               "profile_path": null,
               "id": 1294342,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53041972c3a3683a730706a7",
               "name": "Pierre Tremblay",
               "profile_path": null,
               "id": 1002603,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.126938,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 233423,
      "vote_count": 10,
      "budget": 0,
      "overview": "Three young Inuits set off in search of a promised land to save their clan from starvation.",
      "similar": [
         297762,
         258480,
         858,
         141,
         634,
         244772,
         112160,
         401898,
         437557,
         242224,
         8966,
         12,
         35,
         98,
         587,
         20766,
         20352,
         8810,
         808,
         788
      ],
      "original_title": "The Legend of Sarila",
      "runtime": 80,
      "poster_path": "/aKFNEurZueBaSIl0viRdW3D540w.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "CarpeDiem Film & TV",
            "id": 20182,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Productions 10th Ave",
            "id": 20183,
            "origin_country": ""
         }
      ],
      "release_date": "2013-02-22",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Discover the wonder. Follow the magic. Find the promised land.",
      "adult": false,
      "homepage": "http://www.thelegendofsarila.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nancy Florence Savard"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Roger Harvey",
         "Paul Risacher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2296935/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4ODI5MjEwMF5BMl5BanBnXkFtZTcwODg5MTE5OA@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Plummer, Rachelle Lefevre, Dustin Milligan | See full cast and crew »"],
      "reviews": [
         "On the one hand, it's obviously cool that the Quebecois-Canadian film industry can now put out films that look like this. Fifteen years ago, only a few institutions in the world could have amassed the technology, finance, and expertise to put together computer graphic images like this. On the other hand, however, this democratization of the tools of imaging has, unfortunately, just given more powers of spectacle to incompetent filmmakers who don't have even the most rudimentary idea how to tell a story. This story begins from the premise that an Inuit shaman -- who has gone bad, for badly-explained/justified reasons -- has renounced his ancestral skill set for subservience to an evil god... who nonetheless never gives him any power to do anything about the hateful, unwatchable, noxious, saccharine and awful characters we're supposed to accept as heroes and sympathetic characters. Then at the end, we're supposed to go gooey-eyed because after being stupidly and unconvincingly defeated, he's \"forgiven,\" and thus kinda-sorta redeemed by these horrible \"hero\" characters who we've spent the last hour-plus wanting to see die... Don't waste your time.",
         "The Clan has been without a steady food supply for some time due to poor relations with the spirit world. It is up to the young members of the Clan to embrace a challenge requiring purity of mind and heart. In this way, they may enter a mythical land and gain what is needed to set the Clan back in good standing with the spirits while bringing old, tiresome hatred out from it's shadows so it can be dealt with openly. While the animation is a bit dated, it lends a charm to this script and is in keeping with both the simplicity of the story and it's target audience. The script is likewise as simple and far-fetched as are the minds of most little ones, but does a fine job of including the whole family from grandparents to grandchildren. The acting is par with the production. It's refreshing to NOT be bombarded with Disney-like gender bashing and agenda crunching. Sadly this film did not enjoy the wide release it may have otherwise shared. Compared to the junk issued from Hollywood that is high in production, low on substance, we have here quality at a minimum cost that won't infect your kids with attitude and avarice. Good, silly fun with a few fine messages for all viewers.",
         "Man, what the hell, I will open up my heart with you guys right here right now. I was NOT expecting much of this movie, actually I thought it would be pretty crap, I even prepared some beers and some snacks, sure... I thought \"I'm really gonna need to feel my belly in order to take the emptiness of this movie\" (this thought was good I need to write that, duh, I'm doing it already), anyway... All that bacon with bbq and beer does not hold me any longer and I started to give this movie a chance, those Inuit guys are hilarious, oh my god, I almost threw up (I actually kinda did a little bit on the carpet but it was OK, almost can't tell the difference only get a little bit darker with the taint), when they start to run, man, got to tell you, nobody can stop them! THE ANIMATION IS VERY GOOD, AWESOME QUALITY AND I EVEN GONNA INVITE ALL MY FAMILY FOR THE NEXT SESSION. I know understand a bit more of INUIT culture and Nancy Savard as director? This dude really knows what the is doing, some scenes really keeps you on thinking, oh my god, then you notice that it is just a movie, but sometimes you even lose track of this, you really feel yourself living that, oh my god. Well, not the part of starvation, that part I really did not feel. Enjoy the movie holmes.",
         "As a lifelong fan of animation and as someone who has seen Christopher Plummer and Genevieve Bujold give great performances, The Legend of Sarila was always going to be something I was going to see. Plus the idea was interesting and quite unique. Unfortunately, what potential The Legend of Sarila had was marred by generally poor execution. There are redeeming qualities here. The music score is appropriately rousing and dynamic, giving as much heart and energy as possible in a film that was on the most part in desperate need of more elsewhere. And there are two good voice acting performances. Christopher Plummer is no stranger to voicing villains, having been the best thing about Rock a Doodle and being just as fun in the Babes in Toyland animation, and he brings a menacing and larger than life personality to Croolick, by far the most involved actor in the voice cast. Genevieve Bujold is touching and dignified as Saya, qualities she brought to her definitive Anne Boleyn in Anne of a Thousand Days. Sadly, for these three good things, The Legend of Sarila fails quite badly everywhere else. The animation is particularly poor, and at worst inept. The colours are very drab, the backgrounds were in real want of more detail(sometimes it was there, but a lot of them were sparse), the landscapes never felt authentic or made one feel transported to the world where the film takes place in, characters move awkwardly, dynamic physical interaction is next to non-existent and there is little to no attempt with interaction with the environment(lack of peril in dire straits, characters looking as if they'd not been wet despite supposing to). The lack of care in the animation would have been forgivable if the script and story had been any good, unfortunately while not quite as bad failures they don't work either. Narratively, as well as being pedestrian in places, The Legend of Sarila felt very muddled and like there wasn't enough story to sustain the running time. It's thinly plotted stuff, and is stretched with plot points that were potentially interesting and could have given the characters depth but with little done with them, they're introduced but not resolved or properly explored. Especially true to this was with Markussi and his powers. The lack of originality could have been forgiven if the story was executed well otherwise, which was not the case. The script lacks flow and not only does it sound like it's lacking in sense but it's awkwardly delivered too on the most part. It also feels much too safe, depth, humour and emotion are seldom there and any chances with character development were a missed opportunity. There are attempts, sure, but it feels half-hearted and clumsy, like at the end with Croolick but even that felt incredibly rushed. Regarding the characters, they are one-dimensional and little more than fantasy clichés, even when having an idea that was unique for animation. And apart from Plummer and Bujold, the voice acting is very one-note. In conclusion, has its redeeming values, but as a whole The Legend of Sarila just fails to enchant. 3/10 Bethany Cox",
         "I think a 5.3 rating here is completely undeserving. It's a wonderful re-imaging of Inuit traditions, myths and legends. The animation is solid and it's true to its source material. The evil spirits could be a little too scary for under 6s, but this story aims for the 8 - 12 age anyhow, and for that age group it's a wonderful adventure tale with a rich respect for cultures. A nice Sunday afternoon film for the family, so give it a go if it's on TV or rent it. Sure it's not a must own film, but its charming enough and definitely better than many of the animated sequels pumping in hundreds of million into studio pockets.",
         "The trailer made this look like a good family movie. But it falls far short of good...it's terrible. If based on Inuit legends and myths, no effort was made to explain or define anything. Story line was terribly slow to develop and it was quite easy to predict how particular events would unfold. The sound audio was terrible and it proved very very difficult to understand what the characters were saying. . Character development was non-existent... I would recommend avoiding this movie...young children will not understand it and will probably be scared by some of the evil spirits (which just show up and are not explained in any way).",
         "a nice movie. exploration of Inuit culture, not very high but far to be boring, useful for kids and a really good animation. the story is basic, the old fairy tale spirit is present, the characters are charming and no surprises . Christopher Plummer is himself and old shaman represents one of great good points of film. the young actors seems be the best choices for characters of adventurers. the only problem is the dialog. who, in many scenes seems be almost fake. sure, it is a movie for children but that not is a realistic excuse for that.the second problem - the good goddess who is not the most inspired drawing. a good point, almost a virtue - the music. short - a nice film for entire family."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "CarpeDiem Film & TV",
         "Productions 10th Ave"
      ],
      "summaries": ["Three young Inuits set off in search of a promised land to save their clan from starvation."],
      "budget": 15000000
   },
   "movielensId": 116979,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-02-22",
      "dvdReleaseDate": null,
      "directors": ["Nancy Florence Savard"],
      "runtime": 80,
      "movieId": 116979,
      "title": "The Legend of Sarila",
      "mpaa": null,
      "actors": [
         "Christopher Plummer",
         "Rachelle Lefevre",
         "Dustin Milligan",
         "Tim Rozon",
         "Geneviève Bujold",
         "James Kidnie",
         "James Kidnie",
         "Angela Galuppo",
         "Elias Toufexis",
         "Elias Toufexis",
         "Robert Higden",
         "Holly Uloth",
         "Dawn Ford",
         "Natar Ungalaaq",
         "Elisapie Isaac"
      ],
      "imdbMovieId": "2296935",
      "originalTitle": "The Legend of Sarila",
      "genres": [
         "Family",
         "Animation",
         "Adventure"
      ],
      "youtubeTrailerIds": ["GvsExrARHnI"],
      "plotSummary": "Three young Inuits set off in search of a promised land to save their clan from starvation.",
      "tmdbMovieId": 233423,
      "avgRating": 3,
      "releaseYear": "2013",
      "numRatings": 2,
      "posterPath": "/aKFNEurZueBaSIl0viRdW3D540w.jpg"
   }
}