{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1015976",
      "video": false,
      "title": "Columbus Day",
      "recommendations": [
         32010,
         31461,
         24643,
         10026
      ],
      "backdrop_path": "/zDtDzySAHLTBGrr49FDuw9XinSw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Cologne",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634d9",
               "name": "Val Kilmer",
               "profile_path": "/AlhPeiH8R4reMNGNQ9ag1FPbuW9.jpg",
               "id": 5576,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe45d09251416c750634dd",
               "name": "Marg Helgenberger",
               "profile_path": "/9jIgVEJGZkfjQI1bItxFIaNN3b3.jpg",
               "id": 19838,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634e1",
               "name": "Wilmer Valderrama",
               "profile_path": "/ecZiHIGL4twAFOS4RTeEUV7ccWH.jpg",
               "id": 18975,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Antoine",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634e5",
               "name": "Bobb'e J. Thompson",
               "profile_path": "/vffCOthyQ4hDQt52L21RW2U2o0w.jpg",
               "id": 75633,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Alana",
               "gender": 1,
               "credit_id": "52fe45d09251416c750634e9",
               "name": "Ashley Johnson",
               "profile_path": "/2zIDMXy9680S7ioPo9jpZUq5qG1.jpg",
               "id": 34486,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jimmy Espinosa",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634ed",
               "name": "Lobo Sebastian",
               "profile_path": "/muw74umbo9s6KI22pxzc7RSNqi9.jpg",
               "id": 48071,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Detective Daniels",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634f1",
               "name": "Michael Muhney",
               "profile_path": "/6spxz4Mzuplnwa8sLufeLlvkr0B.jpg",
               "id": 71673,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Leonard",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634f5",
               "name": "Mark Kelly",
               "profile_path": "/7TEzD5ix20IUJSiGB5VzWNci8h.jpg",
               "id": 84897,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Babul",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634f9",
               "name": "Shelley Malil",
               "profile_path": "/wFT638ViyXKOhBWdUYnoEIMJbh9.jpg",
               "id": 84898,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Manny",
               "gender": 2,
               "credit_id": "52fe45d09251416c750634fd",
               "name": "Richard Edson",
               "profile_path": "/7YegwxrBppretnwGEEMxEI453Ef.jpg",
               "id": 6396,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Officer Walters",
               "gender": 2,
               "credit_id": "52fe45d09251416c75063501",
               "name": "Sean Blakemore",
               "profile_path": "/hPeXz7vcBJdBIHoaTuVMcRJZeGJ.jpg",
               "id": 62093,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Cute Girl in Park",
               "gender": 1,
               "credit_id": "52fe45d09251416c75063505",
               "name": "Melissa Bacelar",
               "profile_path": "/lontAU7Rd8y26XqQxSnVt6r5coy.jpg",
               "id": 84899,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Driver",
               "gender": 2,
               "credit_id": "52fe45d09251416c75063509",
               "name": "Rick Avery",
               "profile_path": "/rXar2OrwkorJyQ9dRGf18zUEByW.jpg",
               "id": 81687,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Detective",
               "gender": 0,
               "credit_id": "52fe45d09251416c7506350d",
               "name": "David Winston Barge",
               "profile_path": null,
               "id": 84900,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Jake",
               "gender": 2,
               "credit_id": "52fe45d09251416c75063511",
               "name": "Bryan Hanna",
               "profile_path": null,
               "id": 84901,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "Cheryl",
               "gender": 1,
               "credit_id": "52fe45d09251416c75063515",
               "name": "Ivana Miličević",
               "profile_path": "/ukBpu3MgWoncHcR4Cjs81BCBPvu.jpg",
               "id": 29930,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Freddie",
               "gender": 0,
               "credit_id": "52fe45d09251416c75063519",
               "name": "Rocco Passafaro",
               "profile_path": null,
               "id": 84902,
               "order": 16
            },
            {
               "cast_id": 18,
               "character": "Executive Man",
               "gender": 0,
               "credit_id": "52fe45d09251416c7506351d",
               "name": "Larrs Jackson",
               "profile_path": null,
               "id": 84903,
               "order": 17
            },
            {
               "cast_id": 19,
               "character": "Edward",
               "gender": 0,
               "credit_id": "52fe45d09251416c75063521",
               "name": "Miles Platt",
               "profile_path": null,
               "id": 84904,
               "order": 18
            },
            {
               "cast_id": 20,
               "character": "Garbage Truck Driver",
               "gender": 2,
               "credit_id": "52fe45d09251416c75063525",
               "name": "Marc Schaffer",
               "profile_path": null,
               "id": 84905,
               "order": 19
            },
            {
               "cast_id": 22,
               "character": "Cop #1",
               "gender": 0,
               "credit_id": "52fe45d09251416c7506352f",
               "name": "Dot Jones",
               "profile_path": "/8nZu0mVlKoNc1odkXR9QiiNl73e.jpg",
               "id": 1219312,
               "order": 20
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe45d09251416c7506352b",
            "name": "Charles Burmeister",
            "profile_path": null,
            "id": 111414,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.115258,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14142,
      "vote_count": 13,
      "budget": 0,
      "overview": "A thief tries to fix the damage done during the biggest heist of his career.",
      "similar": [],
      "original_title": "Columbus Day",
      "runtime": 90,
      "poster_path": "/m7R11UaEPy3Nzz49jnRHqqraqob.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bert Marcus Productions",
         "id": 3924,
         "origin_country": ""
      }],
      "release_date": "2008-08-29",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Charles Burmeister"],
      "runtime": 90,
      "synopsis": "John Cologne (Val Kilmer) has just pulled off the biggest heist of his life and is racing to get rid of the merchandise before he leaves for Florida to retire. The plans get mixed up when he meets a young boy in a downtown park who helps him to realize the important things he needs to change in his life. Before he can do that, he must unload the mysterious briefcase to the same gangster he stole it from without getting killed. The quick-witted John comes up with a plan and enlists the help of his friend Max (Wilmer Valderrama) to safely unload the merchandise. He's in a race against the clock to stay alive and make all the money he'd ever need for the rest of his life all in one afternoon. If he succeeds he can finally rekindle his relationship with his ex-wife (Marg Helgenberger) and become the father he's always wanted to be.",
      "writers": ["Charles Burmeister"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1015976/",
      "coverLink": null,
      "actors": [
         "Val Kilmer",
         "Bobb'e J. Thompson",
         "Richard Edson"
      ],
      "reviews": [
         "After seeing the horrendous 'Conspiracy' I had almost lost faith in kilmer all together. However this movie is a return to form. The little black kid he talks to in the park is a great character and really helps Val along with his own demons. For a low budget flick it works well and the acting is superb, especially the kid, top little actor, I expect to see more from this dude. The plot all be it simple is effective and pretty much the entire movie transpires in echo park. The romance sub-plot works well and didn't feel like it was just thrown in their and overall was a good movie with some tense parts throughout and a great ending. I recommend it to Val Kilmers fans and anyone else for that matter. By no means a Hollywood blockbuster but taking into account a tiny budget, linear setting and some good acting... I give it 8/10 Well worth a look.",
         "Val Kilmer runs around in a park for a whole day. Sorry I just told you the whole movie. Not the best I've seen but not even close to the worst. There is really nothing wrong with the acting. The story is just so boring. Endless phonecalls here and there to persons that are not introduced so you have to guess who it may be and that just makes it more confusing. Sudden laps in time back and forward but without indication on whats past and what is present. The filming is very nice but would fit better to a romantic comedy. Endless panoramics over the park and closeups on people doing parkthings is nice for so many seconds but not througe a whole movie. Sorry to say I couldn't watch it to the end. Still I give it a 5 because the movie makers has potential to become better. I hope this was low budget because it would explain a lot. See the movie for yourselves and remember taste is different. You might love it who knows.",
         "I'm with llanderson - I really signed up today on IMDb just to leave a comment on this movie. I was surprised to someone else had the same thought, and within 24 hours of me. I'm a Val Kilmer fan - I saw this in RedBox and was surprised I hadn't seen it, and expected something along the lines of Spartan or Heat, or even that movie where he's like 1/32nd Indian and he's an FBI agent out on some reservation. He literally walks around in a park the ENTIRE movie, makes a gazillion phone calls to three cute actresses you recognize but probably don't know their names and Fez from that 70's show. Fez tells him at one point that his colleagues buddy probably has his nuts in a vice somewhere and is giving him up, so you really expect to see some hardcore torture or gruesome action coming up, but instead Val pays some guy feeding pigeons to take care of the unusually short kid who's been following him around all day. That really is it.",
         "I do not know what the other reviewers with reviews posted here were watching, but it obviously was not the same movie I saw! The first 5 to 10 minutes were the best of the movie. On the whole the acting was terrible, the direction was terrible, the story line was boring and they couldn't even give us something like a decent soundtrack. Echo Park, numerous telephone calls and some touchy-feely feel good moments with a young boy. That's all there was. No suspense, no intrigue and no twists in the tail. Terrible, just plain terrible! This movie rates right up there with some of the worst movies I have ever seen.",
         "Man oh man what a boring movie - I loved Kilmer in Heat, the Doors, Felon, and in Batman - but seriously this movie goes nowhere SLOOOOOOOOW! Basically Kilmer steals \"something\" ducks out in a park all day and hangs out with a kid. Don't get me wrong the kid was pretty cool - well as cool as he could be in a movie like this. The two of them talk and eat ice cream and avoid a bad guy or two but thats about it. For the commenter who said \"Even the friggin extras in the background of the park Kilmer hides out in have their own small story lines going on (ie one couple meets for the first time in the background of one shot and later near the end of the film you see them again in the background arguing...everything comes full circle in this movie- plot, characters, extras(lol)\" you cant be serious - this movie takes place in the span of two hours - I don't know many people who meet for the first time and stroll on the park and then start arguing after 2 hours and that being realistic. As far as the bond thing between the kid and kilmer - again He's only in the park for two hours - its like meeting someone on an airplane - and miss them when you get off cause you formed some kind of everlasting bond with them - na not buying it. I understand this is a low budget movie - but its not a good suspense, action or drama movie. If you want to see a bond form between a kid and a grown man over the course of two hours you may like this movie - if not then I would probably avoid it. I understand there's some die hard kilmer fans out there and the acting was okay - but i wasn't feeling the whole scenario.",
         "Bobb'e J. Thompson (playing an African American boy, who befriends Val Kilmer in the movie, \"Columbus Day\" (2008), have a wonderful chemistry. It is their friendship, and their experience in Echo Park where Kilmer is hiding out, that makes the dialog work. Wilmer Valderrama puts in an electrifying performance. Marg Helgenberger provides much emotion and tension, as we learn about her relationship with Kilmer, and the little girl he does not know. The acting, editing, cinematography, and music are good. The dialog is written effectively, so that it pulls you in, and makes you want to know more about the individual relationships interwoven with the people Kilmer telephones from Echo Park. Without any doubt, an excellent script helps to bring the people together, in a custom-designed patchwork quilt of messages (on the telephone) and conversations (in Echo Park). Bobb'e J. Thompson's goal is to help Val Kilmer find a better life. Will the boy succeed? This film is definitely worth watching, and I rate it an 8 out of 10.",
         "Finally a crime drama that doesn't end on the most depressing of notes. The kid and Kilmer are just brilliant when their dialogue bounces between each other in the most unexpected ways while growing to become friends. Wilmer Valderrama puts in a performance that shows he's probably the edgiest actor to come out of 'That 70's Show' set. I didn't clue into the fact it was him until the final 30 minutes of the film. Marg must have loved playing a new role like this- she broke my heart with this performance and I cared so much about what happens to her and her daughter in relation to Kilmer's outcome. So realistically portrayed- bravo Marg. Kilmer is great as always and continues his reputation of delivering a fine tuned performance. A truly great film that deserved a higher budget, but Kilmer and co have created an amazingly, smooth piece of cinema. Everyone involved should be very proud. The acting, editing, cinematography, music: all fantastic- and there's so many lines of dialogue that catch you off guard either comedically or more often dramatically that I can't see the type who wouldn't get sucked into this movie's story. AND THE ATTENTION TO DETAIL IS INCREDIBLE!!!!!!! Even the friggin extras in the background of the park Kilmer hides out in have their own small story lines going on (ie one couple meets for the first time in the background of one shot and later near the end of the film you see them again in the background arguing...everything comes full circle in this movie- plot, characters, extras(lol)...fantastic. I can't wait to put this one in my DVD collection. Thanks for making up for Conspiracy in a grand fashion. Great screenplay. Great acting. Great film. sin-surely, RF",
         "Val Kilmer stars as a master thief who's pulled off a big heist and now has to wait in a park for his contact to unload his stuff. As he waits and things go sideways Kilmer flashes back through the events of the previous few days leading up to the robbery. Good but slightly awkward tale has been assembled from some choice pieces, the cast is really good as are the individual sequences, but for some reason it never comes together to be the great film that it should have been. I think the flashback structure is what does the film in since it prevents a steady flow of events. This isn't meant to damn the film, its not rather I want to register disappointment that this good film wasn't better. I certainly think the film is worth a look, especially if you like caper films.",
         "This movie is such an incredible hidden gem of talent, excitement and entertainment. I had no expectations going in, but was totally engrossed in each and every second of the film. This film has real staying power because of it's inventive and creative plot, superb acting and interesting twists and turns. I love a movie that is truly suspenseful and interesting and this is definitely it. Val Kilmer gives a shockingly good performance that will leave you without wanting for more. The other actors are also incredible - phenomenal supports and completely believable portrayals. Definitely two thumbs way up for Columbus Day.",
         "I don't know what movie a few of those reviewers were watching because this is Val Kilmer at his best. Columbus Day is a fantastic film all of the way through. I absolutely loved it. To start, the acting is superb. Even more importantly is the exquisite way in which this film was shot. The attention to detail, high level camera work and manner in which the story unfolded and was depicted was beyond impressive. I was also fully engrossed in the story and the romantic plot was organic and engrossing. I think that this film is totally underrated and deserves high level praise because it was a seriously captivating and entertaining watch for me.",
         "I recently saw this film and it was fantastic. Not only was it suspenseful and exciting, but the acting was awesome. Val Kilmer's performance is as good as ever - he is such a compelling and charismatic actor. His portrayal of his character, a thief, strikes a balance with the emotional chords of the film, the love story and protection of family. This balance is what makes this a great film and something I was totally engrossed in. I was shocked that this wasn't more widely recognized and i would absolutely recommend this film for any Val Kilmer fan, or person looking for a fun and suspenseful ride.",
         "Columbus Day - My Review Current mood: hungover Category: Movies, TV, Celebrities Val Kilmer has had a strange sort of career. At it's height he starred in some big movies such as Top Gun , Batman Forever and heat but since then he had made countless unremarkable films including some real bad ones , the worst being The Saint. I'm not sure the reason for the career slump but i think it might have something to with the reputation he got for being an awkward and moody , on and off set. Whatever the reason I'm please to announce the The Kilmer is back with undoubtedly one his best performances seen in recent years! After the heist of his life, a thief hides out in a city park as he plans to strike a deal to unload the stolen goods. There, he begins an unusual friendship with a precocious boy, prompting him to reach out via phone to his ex-wife and estranged daughter, who he hopes will reunite with him now that he is about to be rich. As his business deal begins to unravel, he fights to keep the kid out of harm's way and escape to Florida to join up with his family. Forget that this is a heist movie because that is only a sub plot in what is a superbly acted and directed movie about people , friendship and the fight with what should be their priorities in life. The interaction between John Cologne ( Kilmer) and 12 year old ( Antoine) Bobb'e J. Thompson is delightful. At first Cologne finds him a distraction but the young boys charm draws him in and they end up with a strong Bond between them. There are also some good cameos from Marg Helgenberger ( of C.S I Fame) and Lobo Sebastian who plays gangland boss Jimmy Espinosa Director Charles Burmeister has made a little gem of a movie here that may well give Val Kilmer the career boost that undoubtedly his acting deserves. Apparently Val Kilmer had to undergo over an hour of daily makeup to look older for the role but to be fair apart from putting on a few pounds he didn't look to different from the old days. Columbus Day just goes to show that you don't need big budgets and multi million dollar stars to make a great movie. 8 out of 10",
         "Val Kilmer's own production company was somehow responsible for this film. It is supposedly some kind of drama synthesized with an action film but misses the mark due to the dramatic elements being the most over-used clichés of the 'redeemed con turned family man' genre. Important to note, here in Australia, (where they must take us for idiots), this film has on its cover a picture of Val standing tall against a blood red background and holding two .45 pistols and beside the phrase, 'A Game of Life and Death'. Which bit was of the film was that? Was it the part where the man feeds the ducks? Or was it the fact that the majority of the 'action', (if you can call someone making 28 phone calls 'action') occurring beside a lake which the characters could perilously fall into and perhaps drown? Maybe they might catch something from all the pollution in the water? That might be fatal and constitute elements of 'life and death'. Who knows? The 'action' in this film substantiates to about 15% of the total, if that. I don't mind it being a drama, but it's downright dishonest to palm this off as a gritty edge of your seat 'action' film and then have the majority of the story center around a day in the park, which is what it really is. There were no .45 caliber guns of the type shown on the cover used at any point in this film by the character Val portrays. Perhaps they substituted this imaginatively suggestive cover because they realized pretty quickly after putting it in front of a test audience that if they used a shot of the man feeding the ducks on the cover with Val together with his eight year old on-again-off-again pal smiling in the distance whilst peddle boating across the lake in the sunshine then people might get a whiff and not rent it. Here in Australia that fake cover fully constitutes false advertising as per the 1972 Trade Practises Act section 40 and on Monday I'm going to personally call the Office of the Australian Competition and Consumer Commission and make a complaint about that as it breaches the law. At one point in the film the blood smudge on Val's cheek switches sides (and during a close up, if you can believe they would miss such a glaring error). (Don't think the blood smear indicates any type of 'action' having occurred either.) They even spelled 'gangster' on the cover with two 'n's! To me this indicates that the production crew and or anyone else involved with this film weren't looking too closely at the final edit. Maybe they couldn't wait to get rid of it. I'm pretty sure no one was looking too closely, and after watching it I will advise anyone, neither should you.",
         "I rented this movie and was completely enthralled, captivated and amazed. It was so good, so powerful, so suspenseful and down right entertaining. The acting was top notch and one of Val Kilmer's best performances to date. I was totally taken back and awestruck by the way the film was shot - it basically takes place in one area, but the way in which the movie flowed never made it feel old, quite the opposite. The plot was fresh and unique throughout and the sub plot was believable and equally fresh. I cannot say enough good things about this flick and it is a must see and a recommended movie in my book.",
         "Columbus Day did not disappoint. It was a tremendously suspenseful and action-packed film and made me think all the way through. Not only were the plot and story interesting and captivating, but there was a lot more to the film than meets the eye. The acting was also great. I am a Val Kilmer fan and I think that he does an excellent job in this film. He looked ragged and worn in a way that played so well to the film's character. The other actors also did great supporting jobs and I found the performances to be highly believable and powerful. I would encourage people to get out there and see this one. It's an awesome surprise for sure.",
         "I guess the reason Columbus actually had a day is because he made the prescient career move of actually arriving somewhere. If you want to see Val Kilmer wondering al fresco for forty minutes then this is the movie for you. I say forty minutes because that's about as much as I could take. Incredibly, the script won some sort of award for being in the top thirty scripts read by some film body. I can only cower in fear at the quality of the other twenty nine. And what about the rejects? It was already ominous that Val Kilmer showed up in a recent Orange commercial, the graveyard of has-been movie stars. There is a jarring moment early in the picture when Kilmer shoots someone then disappears off camera. The next shot someone has a bag pulled over his head. We're not sure to whom this is happening at first but subsequently it looks like someone bearing a vague resemblance to Kilmer. So I guess it must be Kilmer. He is ambushed by a gang which he fells quite easily despite being somewhat milquetoast for the \"rest\" of the picture. It turns out this scene was added by a producer for the straight to video market, a sort of Columbus Cheap-Day return. So it wasn't Kilmer. It was someone dressed up to look like Kilmer. Which is confusing because sometimes in films characters dress up to fool each other or the police. Only this wasn't one of them. So maybe I should shut up. Sorry, not your day. Kilmer then wanders into a park on a hot day dressed inconspicuously in a heavy overcoat so as not to attract the attentions of bad guys, cops and half pint coloured stick up artists. But I'll get to that. Call it following in the footsteps of Columbus. Like him, I harbour lofty ambitions; unlike the producers of this flick who are conspicuously having an off-day. Anyway, to get back to Columbus Day, which is sinking fast without even the benefit of a ship to bail out from. In a stunning piece of every day realism, a school kid follows Kilmer around and engages him in conversation. In a further astounding piece of racial profiling, the kid attempts to hold him up as kids are want to do alone in a confined space with a possibly dangerous felon. With straight to video you take your chances. I guess this just wasn't my day. Kilmer may be difficult to work with. Trouble for him he's getting even harder to watch. Perhaps he knows this, hence his attempts to look as much like Jeff Bridges as possible, only on a bad day. Maybe Clint will make my day. It's called Gran Torino and not an Orange phone in sight. Have a nice day.",
         "Definitely a movie worth watching. Val Kilmer is such a complex and an accomplished actor that this movie fits him like a glove. The story itself is an action - crime thriller (where Kilmer is an semi-high profile thief that plans on retiring \"en fanfare\") interweaved with the drama of his personal life, which he plans on rebuilding by breaking up with his foreign girl-friend and start over with his ex-wife (Marg Helgenberger) and daughter he knows so little. These two plans come together in Echo Park where his last job comes down. The only thing I don't understand is that Antoine kid....his character was a little confusing and I didn't quite get what his role in the movie was. Other than that, acting is great, script is OK i guess, keen on details, overall the movie is very enjoyable...at least for me it was.....",
         "OK, I am not personally sure that Val Kilmer is a jerk, but John Frankenheimer, who directed him in The Island of Dr. Moreau, said about him: \"...I will never work with Val Kilmer again. There isn't enough money in the world.\" He also said: \"Will Rogers never met Val Kilmer.\" No doubt this refers to Rogers saying he never met a man he didn't like. A giant studio and a good director can minimize the effect of a prima donna narcissist on the movie itself. But when Val runs the show you get a mess like this. Don't think this was some artistic genius film ruined by the distributors. Val did with this what he probably tried to do with Island... make the entire movie all about Val with Val in every scene. Like a giant TJ Hooker episode, where Shatner could dictate that he appear in 90% of the scenes. Great narcissists make crappy movies. That's why the studio tried to add action scenes as the last resort, to save this mess. You can see the original movie in there-- and it sucks even worse than the action re-cut. So don't expect another Tombstone, this is either going to be boring drama drivel or incoherent action drivel, depending on which cut you see. Like all truly dreadful movies, it is fractal. The badness scales from the grandest story arc to the tiniest detail and everything in between. Everybody was phoning in their performance, no pun intended to the story line. You can almost hear them grinding their teeth waiting to get this turkey over with, and that is everyone from the director to the sound-man to the janitor to the intern getting the donuts.",
         "No offense, this movie has lots of problems mostly with the writing. I don't know what exactly happens except that Val Kilmer's character walks around Echo Park in Los Angeles, California with a briefcase. He befriends, Antoine, an African American boy, off from school for the holiday. Val's character makes constant phone calls to his ex-wife Alice (played by Marg Helgenberger); his adult daughter in Florida; Wilmer Valderamma's character; and his girlfriend. I only saw this movie because a favorite actor of mine, Michael Muhney, plays Detective Daniels in the film. It's a small supporting part. The setting of the park in Los Angeles is quite lovely to look at on screen. The film was shot entirely on location in Los Angeles, California and probably on a low budget. I wonder how bad the other screenplays were. While I believe the strongest aspect of the film is the Antoine friendship with Val's character. I still don't know what happened at the end."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Bert Marcus Productions",
         "Columbus Day the Movie LLC",
         "Trigger Street Productions"
      ],
      "summaries": ["A thief tries to fix the damage done during the biggest heist of his career."],
      "budget": 7000000
   },
   "movielensId": 117140,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-08-29",
      "dvdReleaseDate": null,
      "directors": ["Charles Burmeister"],
      "runtime": 90,
      "movieId": 117140,
      "title": "Columbus Day",
      "mpaa": "",
      "actors": [
         "Val Kilmer",
         "Marg Helgenberger",
         "Wilmer Valderrama",
         "Bobb'e J. Thompson",
         "Ashley Johnson",
         "Lobo Sebastian",
         "Michael Muhney",
         "Mark Kelly",
         "Shelley Malil",
         "Richard Edson",
         "Sean Blakemore",
         "Melissa Bacelar",
         "Rick Avery",
         "David Winston Barge",
         "Bryan Hanna",
         "Ivana Miličević",
         "Rocco Passafaro",
         "Larrs Jackson",
         "Miles Platt",
         "Marc Schaffer",
         "Dot Jones"
      ],
      "imdbMovieId": "1015976",
      "originalTitle": "Columbus Day",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["J1zgV7y7oVg"],
      "plotSummary": "A thief tries to fix the damage done during the biggest heist of his career.",
      "tmdbMovieId": 14142,
      "avgRating": 2,
      "releaseYear": "2008",
      "numRatings": 1,
      "posterPath": "/m7R11UaEPy3Nzz49jnRHqqraqob.jpg"
   }
}