{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1639397",
      "video": false,
      "title": "Last I Heard",
      "recommendations": [],
      "backdrop_path": "/AnhOTNZ55nAfmGtozpJuDydHE03.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Joe Scoleri",
               "gender": 2,
               "credit_id": "5440179cc3a368055100048d",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Ben Rose",
               "gender": 2,
               "credit_id": "544017acc3a368055c0004bc",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bobby DiBianco",
               "gender": 2,
               "credit_id": "5460d3fd0e0a2635380012c5",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rita Scoleri",
               "gender": 1,
               "credit_id": "5460d5760e0a2635380012e7",
               "name": "Renee Props",
               "profile_path": null,
               "id": 53600,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "57ab05dfc3a36806df000b9e",
               "name": "David Rodriguez",
               "profile_path": "/iQJjIMKAiFHvLf1C29L9hPEtLZy.jpg",
               "id": 991853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57ab05e49251411182000bad",
               "name": "David Rodriguez",
               "profile_path": "/iQJjIMKAiFHvLf1C29L9hPEtLZy.jpg",
               "id": 991853,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.285035,
      "production_countries": [],
      "id": 294600,
      "vote_count": 2,
      "budget": 0,
      "overview": "Released from federal prison after 20 years due to his ailing health, a formerly powerful New York mobster moves back home and attempts to reconnect with former life in this poignant Sopranos-esque character study.",
      "similar": [],
      "original_title": "Last I Heard",
      "runtime": 98,
      "poster_path": "/wUSy6Ic0PwxjyECN3xaUji0UKHH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": null,
      "budgetCurrency": "$",
      "directors": ["Dave Rodriguez"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Dave Rodriguez"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1639397/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMzg3MDg1MF5BMl5BanBnXkFtZTgwNTI3NjczMzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paul Sorvino, Michael Rapaport, Renee Props | See full cast and crew »"],
      "reviews": [
         "The was a Film about a man who made choice's and lived with the decisions.He didn't always understand the impact of his choice's on the people in his life.We all have older people in our lives that won't change with the times And this film portrayed us humans making the best of it. because 1. nobodies perfect and 2. we love our older friends and relative's. I fell the way the old man felt about his daughter some goof smacks her around it would be my duty to hurt him badly which i would happily do.Like i said in my opening this movie was simple it was a love story and we all know love is painful as much as it is joyful. yin and yang can't have a up without the down.If you are looking for a action packed MOB film this is not for you.this movie was like the soprano's if i had to compare it to something.Like that series showed TONY being a mob boss it spent a lot of time showing him dealing with his crazy mom and sister.",
         "I cannot describe how awful this movie was. It amazes me that they were able to get good (note I say good, not great) actors like Michael Rappaport & Sorvino with a script that a first grader could have written after having watched Goodfella's once. There is absolutely no arc to the story. Sorvino must have been trying to reclaim his goodfella's glory in order to agree to be in this turd. Nothing more can be said except to avoid watching at all costs. Even if your a huge gangster movie fan (such as I) avoid this film. You and your PCP smoking neighbor could have written a better script in between digging through your mother's sofa cushions for spare change.",
         "Without knowing much beforehand with the title \"Once Upon a Time..\" I first expected some epic sweeping three hour movie (like \"Once Upon a Time in the West\", \"Once Upon a Time in America\", etc). What it was instead a nice drama and part mobster movie with a nice sprinkle of humor. I don't normally like dramas but I liked this one. Being Italian my self I liked the nice positive sentiment it had about traditional Italian ways. Kind of nostalgic even. In the movies, particularly in mobster/gangster ones, you see a lot of Italians being violent, uncaring, and generally acting pretty stupid. But nothing could be further from the truth. Most Italians in America from \"the old country\" (the previous generation or two) are some of the most kind, loving, and sincere people you will ever meet. It's not about the \"me\", it's about family, friends, and making sure your guests feel welcomed, etc. With out giving anything away, I liked some of contrasts pointed out about the old and the new ways, etc. It's a little slow at points maybe, but not a very enjoyable movie if your into the occasional drama.",
         "what's there to say about this awful film? nostalgia. i like mob movies and this one had paulie from Goodfellas only 20 yrs later so i watched it for that. the film was boring and slow and it was drudgery just getting thru it. there is no action, just a lot of talking. the best thing was Andrea Nittoli and her hot body and beautiful BIG BOOBS. she has a nice face also. a real hot tamale she is. at least she provides some eye candy to get thru the boredom. the other broad in the film, Paulie's lesbian daughter also wasn't bad to look at. of course there's a big gay agenda in hollyweird now so every film or TV show has to have a fag or dyke in it to push the agenda furthur along. if you're looking for Goodfellas 2 this movie ain't it. give it a pass. luckily i saw it on a pirate website so it cost me nothing to watch it. all i lost was my time but the beautiful Andrea got me hot so i watched a porn afterwards. the porn was much better trust me.",
         "This was billed as a comedy drama, it was neither. It was 1 hour 41 minutes of shear boredom. Bad acting, bad screenplay an all round bad movie. How this drivel got a 6.2 score is unbelievable. Do yourself a favour and steer clear of this lemon. This surely had to be a straight to DVD release as there is no way this thing could have done anything at the cinemas. It is basically a movie about absolutely nothing. The strained continuous crying scenes were pitiful to watch. The characters were one dimensional unconvincing, and just made you dislike them altogether. Some of the more fantastic scenes involved character talking to each other without any audio other than music. Extremely annoying and must be just there to pad this rubbish out a bit."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cine Relevante",
         "Fuzzy Productions"
      ],
      "summaries": [
         "After spending 20 years in federal prison for myriad crimes, the ailing Mafia Capo Joseph 'Mr. Joe' Scoleri was released. As he tries to reconnect with his daughter and establish a relationship with his neighbor, he realizes that the life he knew no longer exists and nothing is the same as it was before he went away.",
         "After spending 20 years in federal prison for myriad crimes, ailing Mafia boss Joseph \"Mr. Joe\" Scoleri (Paul Sorvino) is released with a strict requirement not to interact with his old contacts in the mafia - and to ensure this, an FBI tail follows him. He quickly realizes that while the world around him may have changed, the habits of a mafia boss die hard.",
         "Recently released from prison, an ex-mafia boss tries not to fall into his old habits, but surviving outside of the mafia is harder than it seems."
      ],
      "budget": 1500000
   },
   "movielensId": 117561,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-01-01",
      "dvdReleaseDate": null,
      "directors": ["David Rodriguez"],
      "runtime": 98,
      "movieId": 117561,
      "title": "Last I Heard",
      "mpaa": "",
      "actors": [
         "Paul Sorvino",
         "Chazz Palminteri",
         "Michael Rapaport",
         "Renee Props"
      ],
      "imdbMovieId": "1639397",
      "originalTitle": "Last I Heard",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Released from federal prison after 20 years due to his ailing health, a formerly powerful New York mobster moves back home and attempts to reconnect with former life in this poignant Sopranos-esque character study.",
      "tmdbMovieId": 294600,
      "avgRating": 3.5,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/wUSy6Ic0PwxjyECN3xaUji0UKHH.jpg"
   }
}