{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0384212",
      "video": false,
      "title": "Admissions",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Evie Brighton",
               "gender": 1,
               "credit_id": "52fe489ac3a368484e10198f",
               "name": "Lauren Ambrose",
               "profile_path": "/zEdW3X6MHTDVG4jizKfVebVTmCH.jpg",
               "id": 54470,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Martha Brighton",
               "gender": 1,
               "credit_id": "52fe489ac3a368484e101993",
               "name": "Amy Madigan",
               "profile_path": "/pNdNJPKRdl3veCRH8fZv3H76ywJ.jpg",
               "id": 23882,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Steward Worthy",
               "gender": 2,
               "credit_id": "52fe489ac3a368484e101997",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "James Parks",
               "gender": 2,
               "credit_id": "52fe489ac3a368484e10199b",
               "name": "Fran Kranz",
               "profile_path": "/vDuvdRoliXbjQrptk7GVs4Qj07S.jpg",
               "id": 51533,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Emily Brighton",
               "gender": 0,
               "credit_id": "52fe489ac3a368484e10199f",
               "name": "Taylor Roberts",
               "profile_path": null,
               "id": 214256,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Emily Brighton",
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019a3",
               "name": "Taylor Roberts",
               "profile_path": "/nEnteJX3x6pVg0bgyPSUrDicBMS.jpg",
               "id": 1067581,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Stanford Interviewer",
               "gender": 1,
               "credit_id": "52fe489ac3a368484e1019d7",
               "name": "Vernee Watson-Johnson",
               "profile_path": "/xUhuGGj8vFLYM0Q5ShssooNU9Ca.jpg",
               "id": 157085,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Dartmouth Interviewer",
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019db",
               "name": "Benjamin Pratt",
               "profile_path": null,
               "id": 1095272,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Harvard Interviewer",
               "gender": 2,
               "credit_id": "52fe489ac3a368484e1019df",
               "name": "Scott Adsit",
               "profile_path": "/jp9FubdwhkovfMi2xBN1uUUiGGz.jpg",
               "id": 66580,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Harry Brighton",
               "gender": 2,
               "credit_id": "52fe489ac3a368484e1019e3",
               "name": "John Savage",
               "profile_path": "/4cNKdr2E2gAvAjjydcwJGscoBsD.jpg",
               "id": 47879,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe489ac3a368484e1019a9",
               "name": "Melissa Painter",
               "profile_path": null,
               "id": 130106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019af",
               "name": "Dawn O'Leary",
               "profile_path": null,
               "id": 1095268,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019b5",
               "name": "Annette Vait",
               "profile_path": null,
               "id": 1095269,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe489ac3a368484e1019bb",
               "name": "Brian Presley",
               "profile_path": "/1qkln8C4amUK77rv5J9UZJzt3yk.jpg",
               "id": 58795,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019c1",
               "name": "Joyce Schweickert",
               "profile_path": null,
               "id": 73843,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019c7",
               "name": "Thomas Schobel",
               "profile_path": null,
               "id": 1095270,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe489ac3a368484e1019cd",
               "name": "Robert Frazen",
               "profile_path": null,
               "id": 65849,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019d3",
               "name": "Vivian Baker",
               "profile_path": null,
               "id": 1095271,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "52fe489ac3a368484e1019e9",
               "name": "Paul Ryan",
               "profile_path": null,
               "id": 191745,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe489ac3a368484e1019ef",
               "name": "Sheila Jaffe",
               "profile_path": null,
               "id": 7494,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.610903,
      "production_countries": [],
      "id": 73452,
      "vote_count": 1,
      "budget": 0,
      "overview": "A gifted high-school student flubs her college admissions interviews for the most unexpected reasons in this independent coming-of-age drama. Cynical, world-weary Evie is more interested in taking care of her family than getting into the Ivy League institutions for which she seems destined. Dad Harry spends all his time building model trains in the basement, while workaholic mom Martha depends on Evie to take care of her other daughter, developmentally challenged Emily. When she's not busy reading poetry to her sister Emily, Evie hangs out with James (Fran Kranz), the sensitive boy next door, whose romantic overtures prove too confusing to acknowledge. College also seems too daunting, so Evie deliberately blows one university interview after another in the hopes of staying at home as her sister's keeper. Meanwhile, Evie begins passing off her own poems as Emily's, fuelling the belief that her brain-damaged sister is actually a literary savant.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         112160,
         858,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Admissions",
      "runtime": 84,
      "poster_path": "/xTOe8i8jFN7K74mpz5mEgVuOBUS.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2004-10-16",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Melissa Painter"],
      "runtime": 0,
      "synopsis": null,
      "writers": ["Dawn O'Leary"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0384212/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NzgzODMyNF5BMl5BanBnXkFtZTcwMTg4MTkyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Lauren Ambrose, Amy Madigan, Christopher Lloyd | See full cast and crew »"],
      "reviews": [
         "\"Admissions\" is a fine drama even though they're are some problems with the ending. Lauren Ambrose plays Evie who is trying to avoid college. To make her overworked mother not notice, she makes up poems that everybody thinks her mentally challenged sister wrote. All the acting is first-rate especially Lauren Ambrose and Amy Madigan. They both put in great performances. The climax is also very powerful. There are only two bad parts. First is the character of Stewart Worthy played by Christopher Lloyd. His part is underdeveloped. The other weakness is the ending. It goes around in circles, which I didn't expect with the 84 min run time. Besides that, the movie is definitely worth watching. For more insanity, please visit comeuppancereviews.com",
         "The Brighton has a traumatic drama in the breast of their family: the twenty years old Emily Brighton (Taylor Roberts) is retarded due to a fall when she was one, and her overprotective mother Martha Brighton (Amy Madigan) blames her negligence for the accident. The seventeen years old Evie Brighton (Lauren Ambrose) loves her sister and reads poems and stories for Emily. Their father Harry Brighton (John Savage), a bank investor, lives in the basement with his models of trains and railroads. Evie mysteriously sabotages her interviews for different universities being rejected, and teaches the poetries of her own to Emily. When Martha hears Emily repeating the poems, she takes notes and shows them to the English teacher Stewart Worthy (Christopher Lloyd), who believes that Emily has had a moment of geniuses. When Evie's only friend James (Fran Kranz) reads the notes, he immediately discloses the truth about the authority of the poetries. But when Martha becomes aware, she finds the reality of Evie, triggering a series of revelations. \"Admissions\" is a very powerful drama about needy of love and guilty complex. The performances are stunning, and this is the first work of Lauren Ambrose, from \"Six Feet Under\", that I see and she is amazing. This independent movie is an excellent choice for the viewers that are looking for a refreshing story based on the acting of the cast. My vote is eight. Title (Brazil): \"Cumplicidade\" (\"Complicity\")",
         "I very much enjoyed this movie and I think most fans of Lauren Ambrose will too. Her character is much softer than her role in Six Feet Under and all of the performances are strong. I especially enjoyed the way the role of Emily, a mentally challenged savant, was handled. Despite some other misinformed user reviews the role was performed accurately and without cliché by the actress, Taylor Roberts. Also a standout was Fran Kranz, whose natural ease well complemented the more season veteran actors. Although the direction hit a snag here or there it seemed the only problems were with an underdeveloped script. What maybe worked well as a stage-play didn't hold out quite so well on screen. However the lovely cinematography by Paul Ryan definitely makes up for that, as well as the pace of the film, which is surprisingly not slow. I recommend this movie to fans of six feet under and also fans of plain good acting and cinematography.",
         "I have had the opportunity to catch this independent film and was impressed with it, despite the lack of excitement in the plot. The acting was very good by everyone involved. Amy Madigan played the part of a guilt ridden mother who is tired, yet well intentioned and determined to make up for her younger daughter's condition. Yet, in the process, she has neglected her older sister, who is more interested in playing with her savant-syndrome sibling and living in a world of escapism. The men in the movie are very powerful in their secondary roles. Christopher Lloyd, in a very understated role, shows us why he has such versatility. He plays a teacher who is dedicated to his profession and literature research, yet starved for a meaningful relationship. He and Madigan connect very well in their scenes together, yet both know nothing more can come from their friendship. Their wordless goodbye is nothing short of brilliant, an acting lesson for aspiring performers. And in a small role, Fred Savage is fun to watch. You can tell why this movie was based on a play, it's probably very good on stage. On screen, it's not particularly exciting, but it's nonetheless very thoughtful and powerful in its subtleties.",
         "We have a character named Evie. Evie just wants to be a good person. She's nice, friendly, smiles often, but is strangely brutally honest. Evie also has a secret. Her idiot-savant sister has been reciting original poetry, which is getting the community excited about the sister writing. Unfortunately, it's Evie's poetry. While their mother starts being happy again and the boy next door shows his interest in Evie, Evie just tries to figure out what she really wants to do. What to keep in mind while watching this movie is who Evie really is. For such a brutally honest person who doesn't mind telling Ivy-league types that she doesn't respect them, it would seem odd that she would be able to pull off a lie. For someone so happy and cheerful, she's quite emotionless when it comes to certain issues. Those aren't character flaws, they're plot development, and they mean a lot more than they at first seem. Mostly this is something of a melodrama: a character lies, the other characters' personalities propel them through drama as relationships are held at risk. But in terms of the writing it's very fresh and bold. The acting helps the writing along very well (maybe the idiot-savant sister could have been played better), and it is a real joy to watch. The directing and the cinematography aren't quite as good. They're acceptable, and Evie's world is wreathed in color and light, which makes for some very beautiful images, but it's not very consistent. It's not really so much of a flaw as a result of a low production value, but within that same value is some genuine storytelling and a real care for the characters. So while it isn't a perfect movie, it's certainly an enjoyable one. --PolarisDiB",
         "I was surprised to like this movie since I'm from the \"check your brain at the door and have fun\" school of film viewing. However, this film touched my heart. I have friends like mentally retarded Emily. I have friends like unsocialized Evie. And I've been in Evie's shoes, chasing away opportunity out of fear and out of devotion to others. Amy Madigan's disappointment in her daughters was almost palpable on screen and the awkward moments where she tried to bridge the gap with Evie were raw and painful to watch. And perhaps I am denser than most, but I never saw the twist with Evie's father coming. Usually I cotton on to those things rather quickly. My reservations are similar to others posted here. I thought Christopher Lloyd's wonderful, sympathetic character (a very different role for him, I thought) was underused. What happened to him once he realized what was going on with the poetry? Would he, like James, try again??? Second, the ending, such as it was, didn't seem to resolve or accomplish anything. I didn't expect the pieces to be picked up and all the ends tied neatly, but I felt that I was left at odds with the characters, that there was no real healing taking place here or any real efforts at healing being made. Otherwise, exquisite and lyrical and disturbing and, for some, very, very true.",
         "At first I didn't think that the performance by Lauren Ambrose was anything but flaky, but as her character developed the portrayal made more sense. Amy Madigan seemed too terse for her role and didn't really tie her daughter's characters together, even though it was apparent that her character was disengaged with the character played by Lauren Ambrose. Christopher Lloyd is a hit as usual and carried off his role to encourage the story line. His character development left the audience wondering why he was chastised by the younger characters and could have been accomplished more directly with The overwhelming glue to this somewhat vague story line was play by Taylor Roberts. Her comprehensive delivery of a simplistic character held the movie together. In this pivotal role, Taylor was able to encourage a realistic family relationship between the characters while acting as the antagonist for all of the other relationships in the film.",
         "This movie moved much too slowly for my taste.The concept of the story is refreshingly different in that it explores the family dynamics of living with a mentally-retarded family member in a way that I have not previously seen on-screen.However,the execution of the concept was flawed.Each character was developed fully within the scene of her first appearance,then one had to endure the feeling that each character was treading water the rest of the way.That is,each character flailed about awkwardly in her interpersonal relationships with others in the movie,which I found to be a form of emotional and social retardation.I suppose this has artistic merit,given the irony that the story centers around an intellectually retarded individual surrounded by way above-average intelligence friends and family.The acting,however,was well-done without exception.I agree with other reviewers that the cinematography was beautiful.In summary,I think the film has strong artistic merit because of the fine acting and cinematography,but fails on an emotional level due to the shortcomings described.",
         "There is a solid group of people that have lives like this girl going through the admissions process at school. The parental absence at all important junctures in Lauren Ambrose's school search provide admissions interviews only and draws the interviews with them at below transcript quality review that in 30 minutes sabotages four years of high school grading. The incident of anger in her mother obviously block a mothers display of possible physical abuse of her or her disabled sister at one time or another; thus masking her Mother's truer involvement in family losses. The daughter, Lauren, really has done something big - trying to make her mother fulfilled and then that plan itself, somewhat heroic in light of the age she is - still giving when everyone around her taking, somersaults on her. A heart not yet connected to her head - something that age has never had a genuine answer to even to this day. Her replacement of a significant other, not necessarily requiring a father image, however, a trusted authority nonetheless being imagined if not real. A pure cup without a handler .......(see the movie). Everyone needs a friend to see through understanding of a proportional world - she made hers up on what she knew of life at the time. She has all the mental capacity for higher learning though having no friends present for her time makes the ending a developmental tragedy in progress ... given a bird in a cage... not a puppy... that would a least get her walking two times a day. Ideas out of the roof she is under would be the developing on her sidewalk life. Sad is the looming psychiatric ending... how could she be committed at a time when she has proved an important responsibility? (believe it or not taking of a dog is a better witness than taking care of a bird at this time of her life) The symbolic cage of her in a cage is too much mental and self fulfilling of some of her writings within the story. The neighbor college freshman is developed just fine, he is as developed as the training education will allow for the mental maturity that dwarfs her eternal purpose compared to his fateful conditioning. I myself, eventually just went to the Mensa magazine and got a $20.00 degree saying I was an (Hon)DDiv. It offered all the education that buying the truth would and independence to skip fecal content. \"Run the world\" or do not get your own home was the college offer. Who was freeing anyone for superior time for the learning? The only sin is not having your pleasure right. What fight figged on that? She has been denied an act for life commensurate to her love for life. What is college, a reward for failing high school? Do you graduate with your class or without it - what is the exchange? A lifetime of correcting youth with only questions? Could lead occur w/o a question? The loss followed as much for good as bad. When was she given a mind for sexual intimacy or growth for her good self to be fulfilled? Why didn't good people treat her with good things? If good people do not do good things for good people, what is good for? She is young, pretty and walked on long before personal development is given a winning game. Her act taken in life with a closed door. Perhaps the title would be better as \"Christmas Doors\" not \"Admissions\".",
         "This movie was extremely dramatic and an odd one at that. Evie did good acting and so did the other characters except Christopher Lloyd. It wasn't his acting, it was his character development. I think he should have been in the movie more, putting things together and figuring things out. Also i kind of feel bad for the guy, Fran Kranz. Why did he keep on going back to Evie when she was obviously psycho??????????!!!!!!!!!!!!!! I was also disappointed by the ending. Maybe they could have showed more development of Evie's future. Even though they kind of hinted that Evie and James would get together I think that it would have been better the movie showed the future of Evie and James or the future of Evie, attending a Berkeley class or something or showing their wedding, i don't know. So you should definitely see this movie, You will be blown away!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [],
      "summaries": ["The Brighton has a traumatic drama in the breast of their family: the twenty years old Emily Brighton is intellectually disabled due to a fall when she was one, and her overprotective mother Martha Brighton blames her negligence for the accident. The seventeen years old Evie Brighton loves her sister and reads poems and stories for Emily. Their father Harry Brighton, a bank investor, lives in the basement with his models of trains and railroads. Evie mysteriously sabotages her interviews for different universities being rejected, and teaches the poetries of her own to Emily. When Martha hears Emily repeating the poems, she takes notes and shows them to the English teacher Stewart Worthy, who believes that Emily has had a moment of geniuses. When Evie's only friend James reads the notes, he immediately discloses the truth about the authority of the poetries. But when Martha becomes aware, she finds the reality of Evie, triggering a series of revelations."],
      "budget": 0
   },
   "movielensId": 117551,
   "movielens": {
      "languages": [""],
      "releaseDate": "2004-10-16",
      "dvdReleaseDate": null,
      "directors": ["Melissa Painter"],
      "runtime": 84,
      "movieId": 117551,
      "title": "Admissions",
      "mpaa": "PG",
      "actors": [
         "Lauren Ambrose",
         "Amy Madigan",
         "Christopher Lloyd",
         "Fran Kranz",
         "Taylor Roberts",
         "Taylor Roberts",
         "Vernee Watson-Johnson",
         "Benjamin Pratt",
         "Scott Adsit",
         "John Savage"
      ],
      "imdbMovieId": "0384212",
      "originalTitle": "Admissions",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A gifted high-school student flubs her college admissions interviews for the most unexpected reasons in this independent coming-of-age drama. Cynical, world-weary Evie is more interested in taking care of her family than getting into the Ivy League institutions for which she seems destined. Dad Harry spends all his time building model trains in the basement, while workaholic mom Martha depends on Evie to take care of her other daughter, developmentally challenged Emily. When she's not busy reading poetry to her sister Emily, Evie hangs out with James (Fran Kranz), the sensitive boy next door, whose romantic overtures prove too confusing to acknowledge. College also seems too daunting, so Evie deliberately blows one university interview after another in the hopes of staying at home as her sister's keeper. Meanwhile, Evie begins passing off her own poems as Emily's, fuelling the belief that her brain-damaged sister is actually a literary savant.",
      "tmdbMovieId": 73452,
      "avgRating": 3.83333,
      "releaseYear": "2004",
      "numRatings": 3,
      "posterPath": "/xTOe8i8jFN7K74mpz5mEgVuOBUS.jpg"
   }
}