{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "house",
            "id": 6095
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "nephew",
            "id": 155248
         }
      ],
      "imdb_id": "tt0040321",
      "video": false,
      "title": "Enchantment",
      "recommendations": [],
      "backdrop_path": "/rzFAmOekrflKo8CkLQfsngvWj4c.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "General Sir Roland 'Rollo' Dane",
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023aab",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lark Ingoldsby",
               "gender": 1,
               "credit_id": "52fe44fc9251416c91023aaf",
               "name": "Teresa Wright",
               "profile_path": "/1J7IOy7S8krsTK22agsFLm2dYXU.jpg",
               "id": 7663,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Grizel Dane",
               "gender": 1,
               "credit_id": "52fe44fc9251416c91023ab3",
               "name": "Evelyn Keyes",
               "profile_path": "/nqIiMP4PkeiJGaSJK53zdMiqI0j.jpg",
               "id": 11494,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pilot Officer Pax Masterson",
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023ab7",
               "name": "Farley Granger",
               "profile_path": "/uMawvHjbqcg2s1UnedJwD9Njzy5.jpg",
               "id": 12497,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Selina Dane",
               "gender": 1,
               "credit_id": "52fe44fc9251416c91023abb",
               "name": "Jayne Meadows",
               "profile_path": "/ksojQpBzxwfMgrPCZGhMZcBriF.jpg",
               "id": 19415,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Proutie",
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023abf",
               "name": "Leo G. Carroll",
               "profile_path": "/xTxzUMrwj00ZXa3iWOqP5w1xgO5.jpg",
               "id": 2642,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pelham Dane",
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023ac9",
               "name": "Philip Friend",
               "profile_path": "/YrMcvmM5lKj7DgtJNCahyQKgwr.jpg",
               "id": 120150,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marchese Del Laudi",
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023acd",
               "name": "Shepperd Strudwick",
               "profile_path": "/4LH8tFZHdejNYRdJyka1Wo3a4H.jpg",
               "id": 82676,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "General Fitzgerald",
               "gender": 2,
               "credit_id": "542d25690e0a2607b300184e",
               "name": "Henry Stephenson",
               "profile_path": "/wZgaeGbsFPCWfbnQJemCcpPCNAo.jpg",
               "id": 81934,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "The Eye",
               "gender": 2,
               "credit_id": "542d25860e0a2607a100174b",
               "name": "Colin Keith-Johnston",
               "profile_path": null,
               "id": 89589,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Lark as a Child",
               "gender": 1,
               "credit_id": "542d25a2c3a36845ec00173f",
               "name": "Gigi Perreau",
               "profile_path": "/qBuJfoaiSdNcK21qH2uXY40Ivdc.jpg",
               "id": 111988,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023ac5",
               "name": "Irving Reis",
               "profile_path": null,
               "id": 94880,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fc9251416c91023ad3",
               "name": "Rumer Godden",
               "profile_path": null,
               "id": 132506,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fc9251416c91023ad9",
               "name": "John Patrick",
               "profile_path": null,
               "id": 69393,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "542d24630e0a2607b300182b",
               "name": "Samuel Goldwyn",
               "profile_path": "/8fp8GXox3Uem1O4hlHXKWY7pnQa.jpg",
               "id": 13570,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "542d2475c3a36845d80018e2",
               "name": "Hugo Friedhofer",
               "profile_path": null,
               "id": 13571,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "542d2485c3a36845cf0017c0",
               "name": "Gregg Toland",
               "profile_path": "/6DKcT5fCniS4gIEEEqsLkZC6QeK.jpg",
               "id": 8504,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "542d24950e0a26079b0018ea",
               "name": "Daniel Mandell",
               "profile_path": null,
               "id": 4102,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "542d24c5c3a36845ec001721",
               "name": "George Jenkins",
               "profile_path": null,
               "id": 6358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "542d24d6c3a36845cf0017c8",
               "name": "Julia Heron",
               "profile_path": null,
               "id": 12349,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "542d24e80e0a26079b001900",
               "name": "Mary Wills",
               "profile_path": null,
               "id": 26174,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "542d25090e0a2607ab0016eb",
               "name": "Marie Clark",
               "profile_path": null,
               "id": 1369165,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "542d251ac3a36845de0017c4",
               "name": "Robert Stephanoff",
               "profile_path": null,
               "id": 1367963,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "542d252c0e0a2607a1001741",
               "name": "Fred Lau",
               "profile_path": null,
               "id": 10919,
               "department": "Crew",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.196355,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33111,
      "vote_count": 2,
      "budget": 0,
      "overview": "Uncle Rollo finally retires to the house he was brought up in. Lost in thoughts of his lost love, Lark, he does not want to be disturbed in his last days. However, the appearance of his niece and the subsequent romance between her and Lark's nephew causes him to reevaluate his life and offer some advice so the young couple don't make the same mistake he did, all those years ago.",
      "similar": [
         1024,
         24420,
         1259,
         276,
         1643,
         13523,
         226,
         44564,
         17612,
         19913,
         979,
         13,
         38,
         627,
         46705,
         50546,
         489,
         28178,
         86331,
         272693
      ],
      "original_title": "Enchantment",
      "runtime": 100,
      "poster_path": "/oGQA9hAfS6XHFsEGrUErl29xY32.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Samuel Goldwyn Company, The",
         "id": 28205,
         "origin_country": ""
      }],
      "release_date": "1948-12-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "JUST ABOUT THE MOST WONDERFUL LOVE STORY EVER FILMED!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Irving Reis"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "John Patrick",
         "Rumer Godden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040321/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzg1MjQ2MTkyMl5BMl5BanBnXkFtZTcwOTIzNjcyMQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: David Niven, Teresa Wright, Evelyn Keyes | See full cast and crew »"],
      "reviews": [
         "The 1940s seemed to be the decade of the romantic \"women's films\" featuring stars like Bette Davis, Merle Oberon, Olivia de Havilland and others. And Samuel Goldwyn had the good taste to hire the best script writers, the best cinematographers, the best musicians, and the best available actors to play in all of his films. None was more romantic than ENCHANTMENT and it has a warm glow about it, despite being a tale of unrequited love whereby an elderly man (DAVID NIVEN in convincing age make-up) recalls his younger days and his sweetheart (TERESA WRIGHT) who leaves him because of a misunderstanding caused by his neurotic sister (JAYNE MEADOWS). When a young woman ambulance driver (EVELYN KEYES), who happens to be his niece, comes to stay in the grand old house during the London blitz of World War II, he advises her not to make the same mistake he did in following his true love. Result: a happy ending for Keyes and her pilot lover FARLEY GRANGER when she goes rushing after him during an air raid. The tale is told in a clever use of flashbacks from one generation to the other, and all of it is photographed in crisp B&W splendor by Gregg Toland with a quietly effective musical score by Hugo Friedhofer. It's a handsomely mounted production, tastefully done without overdoing the sentimentality of the tale. LEO G. CARROLL is excellent as Niven's servant, realistically aged for the part of the tale that takes place in the present. Highly recommended as a quality picture of its kind. It's also a sad reminder of the fact that after leaving Samuel Goldwyn under the contract system, TERESA WRIGHT's screen career floundered and she soon found that she had to work for lesser salaries in films not worthy of her presence. She became a free agent but admitted that it turned out to be a huge mistake.",
         "\"Enchantment\" seems to be one of those movies which has fallen through the cracks in terms of being appreciated. The story is told in a very unique way which keeps you totally involved. The cast, headed by David Niven and Teresa Wright is great. And Jayne Meadows is excellent! I would highly commend this movie and a good bag of popcorn. If you have the chance to buy the film...do it!!",
         "WARNING (I have outlined the whole film below) \"Enchantment\" was the work of the brilliant film producer and film pioneer, Samual Goldwyn. The film came out in 1948 with a great deal of media attention. Goldwyn said of the film: \"I don't care if it doesn't make any money, I just want everyone to see it\". Goldwyn got half of his request. \"Enchantment\" made little money since few movie fans in 1948 went to see it. It began a series of box office disappointments for his studio. The film begins in 1944 when an retired British general named Rollo (played by David Niven) returns for the first time in decades to the home that he grew up in. There he meets his grown niece Grizel, (played by Evelyn Keyes)just arrived from America, for the first time. She is working as an ambulance driver for the RAF. Soon Grizel learns of a young girl named \"Lark\" who once lived there and whom Rollo still misses. She goes to work the next day and meets a young Canadian pilot named Pax (played by Farley Granger). It turns out Pax is Lark's nephew. Then through flashbacks we learn that Rollo grew up in a home with a brother and older sister. One night Rollo's father brings home a frightened eight-year old girl. He tells his children that the young girl named Lark, parents were just killed in train wreck and she will be their new sister. The boys are thrilled, while their sister is not. As the movie moves on Lark grows into a beautiful young woman (played brilliantly by Teresa Wright). As expected, both boys, now young men, fall in love with their adopted sister. At the same time Lark's sister, Selena (played by Jayne Meadows) is jealous of her and makes Lark's life difficult. At the same time the film brings the viewer back to 1944 with the budding romance between Grizel and Pax. Will they get together or will the war tear them apart? We then go back in time and see Lark turn down a wealthy suitor from Italy. She and Rollo fall in love and decide to get married. However, Selena has other plans for Rollo. She gets him an officer's chief of staff position in Afganistan. He must leave immediately and stay there for five years. Rollo must decide Lark or my career. Lark can not come with him to Afganistan. Selena coldly tells Lark she must leave Rollo for his career. Rollo decides that he loves Lark and does not care about his career. By the time he comes back for Lark she has left to marry her Italian suitor. Now the film moves to the present (1944) old Rollo learns first from Pax that he just received a telegram that Lark has died, he then learns that Grizel and Pax have broken up. He tells Grizel to go after Pax. He does not what happened to him to happen to his niece. She leaves the house just as the German bombers are overhead. Bombs are falling everywhere. She finds Pax on a bridge and the young lovers embrace. Just then they see a terrible explosion. It is Rollo's house and he is dead. The film ends with a shot of the home. If you are a fan of romance novels, you will enjoy this film. ***A few observations: Young Lark is played by Gigi Perreau. As young Lark she is adorable. You wish she was in more scenes. Her brother, Richard Miles Perreau played young Rollo in the film. Jayne Meadows (best known as Mrs. Steve Allen) does a great job as the shrew and evil sister Selena. She clearly dislikes Lark but loves her two brothers. Teresa Wright is outstanding as Lark (did she ever give a bad performance in her long career?) She looks stunning in her Victorian gown as she dances during a ballroom scene. I watched the film on the cable gem TCM. At the beginning of the film movie historian Robert Osborne mentioned that this was Ms. Wright's last film under contract (she was fired) with Samuel Goldwym. He mentioned that she was glad to be out of the contract. Ms. Wright gave several interviews stating that yes, being a contract player caused her to lose a great deal of privacy in her life and that the studio treated their actors like cattle. However, she said her firing was the biggest mistake of her career. Not only did she lose her weekly salary but she said she went from making $125,000 a picture in 1948 to only making $10,000 in 1950. She was fired for not going on tour to promote \"Enchantment\". She told Goldwyn that she was ill and could not make the tour. She had recently had her second child and also had family obligations. Today an actor just has to go on Lettermen, Leno or Ophra's show along with TV ads to promote a film. In 1948 actors would fly in prop planes to each city and meet the local media in a hotel to promote their film. According to Goldwyn biographer, A. Scott Berg, Ms. Wright's Gallup poll numbers (Q rating today) showed her popularity with the public had not gone up since she began acting. This and her inability to promote her film(s)led Goldwyn to not renew her contract. She went on to continue her acting career but never was given the roles her immense talent and beauty deserved.",
         "and superb acting in this wartime story. Jayne Meadows as the cold, manipulative sister is terrific as is Gigi Perreau in a small but very effective role as a child. David Niven is a delight and more intense than he usually is. Great yarn, good acting, delightful music and highly atmospheric. Glad I caught it.",
         "I saw the movie Enchantment in 1948 when I was 11 years old. I was so moved by the story, when I returned home I wrote down the complete story, so I would never forget. I have seen the movie 5 times in the last 50 years and if I owned the movie I would watch it every week.",
         "One of the most memorable and beautiful love stories I have ever seen - and I've seen a few! It follows the life and loves of Lark, a girl who loses her parents quite young and is sent to live with a new family. She quickly befriends brothers Pehlum and Rollo while fights to gain the approval of her new sister. As she ages, she and Rollo fall in love... And that's all I shall reveal! Don't be deturred by the fact it's in black and white. The acting is first rate, the story truly unique and captivating. Catch it if you have the chance but be prepared to have some tissues handy; especially at the end! :)",
         "58 years before \"Monster House\" - a film about a neighborhood terrorized by a house - there was \"Enchantment\" (1948); a film narrated by a house. I'm not kidding; the house provides a brief bookend voice-over commentary; introducing the story and then wrapping things up at the conclusion. Fortunately this house is much better behaved than its 2006 successor because 95% of the film takes place under its roof. The modest set means that second-to-none cinematographer Gregg Toland's expertise is somewhat wasted. There wasn't much for him to apply himself to here other than some interesting lighting and a series of interesting match cut transitions (more about these later). \"Enchantment\" is a romance, more precisely two romances as the film tells the story of wartime romances in a London family during both the WWI and WWII. Set in 1944, the film opens with retired General Roland (Rollo) Dane (a convincingly aged David Nivin) pining away over his lost opportunity for true love. Upon the death of his sister Selina he moved back into his boyhood home because it contains memories of his lost love Lark (Teresa Wright). Lark was an orphan his family adopted when she was eight. Rollo and Lark fell in love when they grew up but shrewish sister Selina managed to derail the romance. Lark marries someone else and Rollo pursues a career in the Army. They never see each other again. Enter niece Grizel (Evelyn Keyes-Scarlett O'Hara's little sister) who comes to wartime London from America. Grizel is an ambulance driver who moves in with her great uncle Rollo. Grizel begins a romance with a wounded Canadian officer named Pax (Farley Granger), who turns out to be Lark's nephew. Now this may not sound very promising, but \"Enchantment\" transcends ordinary romantic melodrama by the way in which it tells its tale (and I'm not talking about the talking house). The story is told by cutting back and forth between two parallel romantic story lines taking place in the same house; Rollo and Lark during WWI and Grizel and Pax during WWII. This device works quite well and is worth watching just to see the match cut transitions that move the film back and forth between the two romances. There are ten of these transitions. The camera holds on the door inside Selina's bedroom as the story flashbacks to the same spot 25+ years earlier. Then a place-setting at the dinner table takes the story forward. The transitions continue; using a chandelier, a mantle clock, the fireplace, the sidewalk, and the staircase. But this is more than just a slick editing trick. Each match cut is designed to draw attention to parallels between Grizel and her predecessors in the house. Which is why she is given Selina's old room. The climatic transition does not use the match cut technique, presumably to indicate that the later romance will have a more upbeat outcome than the earlier one. The final match cut involves a set of house \"keys\"; probably not a deliberate play on a certain actresses' surname but a symbolic reference (i.e. the key to happiness). The sidewalk transition is the best one as Niven actually morphs into Granger at the same exact point on the sidewalk. This was a dolly tracking shot and the row houses in the background had to line up perfectly (remember this was before digital effects). For pretty much everyone who has seen\"Enchantment\", the most memorable images involve eight-year old Lark and ten-year old Rollo; played by real life brother and sister Peter Miles and Gigi Perreau. Gigi totally hijacks the film at this point leaving viewers wishing she had more scenes. Peter (in appearance and style) may remind you of Freddie Highmore (\"Charlie and the Chocolate Factory\" and \"Finding Neverland\"). In fairness to Selina (nicely played by Jayne Meadows), her resentment of the cute little waif is somewhat understandable. Lark immediately brings out the protective instincts of Selina's father and two brothers. Basically supplanting Selina and stealing her destiny. Niven, Wright, and Keyes are quite good although Keyes never quite sells her shrewish side nor her attraction to Pax. I felt this was mostly due to Granger who was one creepy guy. Hitchcock cast him for his lead in \"Rope\" for this very quality and while it was an asset in that role it works to everyone's detriment here. Then again, what do I know? I'm only a child.",
         "This is a lovely tale set in England during the blitz. An American servicewoman (Evelyn Keyes) stops by the house of her elderly uncle (David Niven). At first the uncle is pretty grumpy but he relents and lets her stay in his home. A little later, his nephew (Farley Granger) from Canada also stops by and much of the rest of the film is spent going back and forth in flashbacks telling the story of Niven and his step-sister, Lark (Teresa Wright), and their abortive plans to marry. Their plans are marred by the exceptionally nasty older sister of Niven, played with gusto by Jayne Meadows. In the end, the story becomes a wistful tale of what might have been. At the same time, a romance blooms between Granger and Keyes, but Keyes is hesitant. But then Niven intervenes to illustrate how his regrets in love have haunted him and convinces Keyes to literally chase after Granger in the film's emotional conclusion. The film works so well for many reasons. First, the makeup is great--the stars really were aged well and you'd have almost thought that Niven and his butler, Leo G. Carroll were really old men when the movie was made. Second, the acting was terrific--especially the wonderful job done by young Gigi Perreau as Lark as a child. Her expression was amazing and she handled the job well. Third, the music, cinematography and direction were beautifully and lovingly done. A first-class job all the way.",
         "What a wonderful movie! I had never heard of it and had no idea what it was. It's a lost treasure, it seems. \"Enchantment\" is the story of two generations, and a very special love. The narrator is the house they lived in at various times. When the movie begins, David Niven is an old man, Rollo, during World War II, and he is living alone in the house with the man-servant with whom he grew up, Leo G. Carroll. His niece, in the service, comes to stay with him and soon meets a wounded soldier (Farley Granger) who has a connection to the house. Rollo's story, and the story of his sister, brother, and the little girl that came to live with them, Lark, is told in flashbacks throughout the film as they grow up and Rollo and Lark fall in love. After a flashback, the camera focuses on the fireplace, or some other object, and we are brought back into the present, with the fire still burning or the book still in the bookshelf, and we are back with Rollo and his niece in the present day. It is a seamless way to tell the story and very poignant. David Niven is wonderful as Rollo but the surprise performance for me was by Jayne Meadows as his selfish, sharp-tongued sister Selina, who always resented Lark. She is excellent. Farley Granger and Evelyn Keyes are the present day young loves, and they give very sweet performances. Gigi Perreau as the small child Lark is heartbreaking. The ending of the film is very striking. My only criticism would be that it seemed as if the character of Rollo aged 50 years instead of about 30. Don't miss this marvelous film.",
         "A melancholy love story that is a work of art. Flashbacks are often misused in movies but they are subtle and flow easily in \"Enchantment\", intertwining two stories. This tear-jerker flows from beginning to end - a masterpiece in every way. David Niven shows his acting skills both as a dashing young officer and as the retired general (makeup is FANTASTIC!!) still carrying a torch. His facial expressions tell his portion of the story even better than the well-written lines given to his character. Jayne Meadows is the older sister you'll love to hate. Teresa Wright is a sweet unintentional heart-breaker with a voice to match. As wonderful as the acting is, the photography and lighting make this movie as magical as it is \"Enchanting\"."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Samuel Goldwyn Company, The"],
      "summaries": [
         "Uncle Rollo finally retires to the house he was brought up in. Lost in thoughts of his lost love, Lark, he does not want to be disturbed in his last days. However, the appearance of his niece and the subsequent romance between her and Lark's nephew causes him to reevaluate his life and offer some advice so the young couple don't make the same mistake he did, all those years ago.",
         "The widowed patriarch of the Dane family adopts a young girl named Larke, whose parents have been killed in a train wreck. This upsets his biological children; Selina, the eldest, and two boys, Roland and Pelham. As the years go by, however, the boys find they like their new \"sister\" and, as they grow older, they each find themselves in love with the high-spirited, but somewhat manipulative, girl. But each attention and accolade that Larke receives only enflames the jealousy of Selina, who feels Larke is nothing but a parasite, who has usurped Selina's rightful role of both daughter and sister and, eventually, matriarch."
      ],
      "budget": 0
   },
   "movielensId": 117690,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-12-25",
      "dvdReleaseDate": null,
      "directors": ["Irving Reis"],
      "runtime": 100,
      "movieId": 117690,
      "title": "Enchantment",
      "mpaa": "",
      "actors": [
         "David Niven",
         "Teresa Wright",
         "Evelyn Keyes",
         "Farley Granger",
         "Jayne Meadows",
         "Leo G. Carroll",
         "Philip Friend",
         "Shepperd Strudwick",
         "Henry Stephenson",
         "Colin Keith-Johnston",
         "Gigi Perreau"
      ],
      "imdbMovieId": "0040321",
      "originalTitle": "Enchantment",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Uncle Rollo finally retires to the house he was brought up in. Lost in thoughts of his lost love, Lark, he does not want to be disturbed in his last days. However, the appearance of his niece and the subsequent romance between her and Lark's nephew causes him to reevaluate his life and offer some advice so the young couple don't make the same mistake he did, all those years ago.",
      "tmdbMovieId": 33111,
      "avgRating": 4.5,
      "releaseYear": "1948",
      "numRatings": 1,
      "posterPath": "/oGQA9hAfS6XHFsEGrUErl29xY32.jpg"
   }
}