{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "water skiing",
            "id": 158345
         }
      ],
      "imdb_id": "tt0045718",
      "video": false,
      "title": "Easy to Love",
      "recommendations": [],
      "backdrop_path": "/qTY4TjP1iJ1fGvAoxOoKNuEfpFB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Julie Hallerton",
               "gender": 1,
               "credit_id": "52fe4640c3a36847f80f48d9",
               "name": "Esther Williams",
               "profile_path": "/nkQlUjqUymEkYNkF5PK6xN2IcWg.jpg",
               "id": 129520,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ray Lloyd",
               "gender": 2,
               "credit_id": "52fe4640c3a36847f80f48dd",
               "name": "Van Johnson",
               "profile_path": "/6sWt0ilIFgggXr2wtUia3iv8dYa.jpg",
               "id": 37446,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Barry Gordon",
               "gender": 2,
               "credit_id": "52fe4640c3a36847f80f48e1",
               "name": "Tony Martin",
               "profile_path": "/vAmFNffX9bkhQtSNKyaTWwAdmZW.jpg",
               "id": 94803,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hank",
               "gender": 2,
               "credit_id": "52fe4640c3a36847f80f48e5",
               "name": "John Bromfield",
               "profile_path": "/8e0WQzplGTV7kQkTNXowjNLKrNA.jpg",
               "id": 87750,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Nancy Parmel",
               "gender": 1,
               "credit_id": "52fe4640c3a36847f80f48e9",
               "name": "Edna Skinner",
               "profile_path": null,
               "id": 129547,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe4640c3a36847f80f48ed",
               "name": "King Donovan",
               "profile_path": "/mREKj50gHPnaoBgJ3e0m4mFbLGF.jpg",
               "id": 69811,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Nightclub Dancer",
               "gender": 1,
               "credit_id": "58df47009251415e5f004c4d",
               "name": "Larri Thomas",
               "profile_path": "/gzVGA3VB6Zi0ZWZc4AhAdvHTjS9.jpg",
               "id": 1787560,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4640c3a36847f80f48d5",
               "name": "Charles Walters",
               "profile_path": "/vs5meUlbUPsHmSEbLLveuCiYl7T.jpg",
               "id": 69392,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5421d2a90e0a260a2300052f",
               "name": "László Vadnay",
               "profile_path": null,
               "id": 144071,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5421d2b9c3a368352e0004cd",
               "name": "William Roberts",
               "profile_path": null,
               "id": 14521,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58293b529251417b29033799",
               "name": "Ray June",
               "profile_path": null,
               "id": 16750,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a486e41925141031400ba61",
               "name": "Joe Pasternak",
               "profile_path": "/gAAbsb5OoV0NVlQ13ScOwq7sXz0.jpg",
               "id": 94115,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.912735,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43343,
      "vote_count": 1,
      "budget": 0,
      "overview": "Two men vie for the heart of a Cypress Gardens swimming star.",
      "similar": [
         872,
         11224,
         224141,
         14128,
         16119,
         11631,
         114,
         812,
         10882,
         15121,
         824,
         703,
         134,
         252,
         3933,
         18947,
         19404,
         41233,
         46195,
         254470
      ],
      "original_title": "Easy to Love",
      "runtime": 96,
      "poster_path": "/2OuDEPUo6Q9F2vcdrCgvmomFTf2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1953-12-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "MGM's spectacular Technicolor musical excitingly filmed in Florida's beautiful Cypress Gardens!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Walters"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "László Vadnay",
         "William Roberts"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045718/",
      "coverLink": null,
      "actors": ["Stars: Esther Williams, Van Johnson, Tony Martin | See full cast and crew »"],
      "reviews": [
         "Olympic-swimming-hopeful turned MGM-screen-sensation Williams does her thing as only she could in this light musical. She plays an overworked employee of Florida's Cypress Gardens (owned in this film by Johnson) who gets a chance to hit the big time for four times the money and half the work. While on a trip to New York City, in which Johnson works her like a galley slave, she falls for suave singer Martin who introduces her to a big-time producer. However, despite his autocratic treatment of her, she loves Johnson and can't decide what road to take. Meanwhile, back in Florida, she has yet another man to contend with, her hunky swim partner Bromfield, who wants to marry her. Worked in between all the romantic shenanigans and misunderstandings are several splashy (pun intended) swimming and/or skiing productions and a large handful of silky love songs sung by Martin. The film is simple, undemanding entertainment with beautiful and creative aquatic and water-ski moments to enliven the more familiar and routine romantic plotline. Williams is absolutely gorgeous in or out of the water and her acting, while it isn't anything tremendous, is perfectly acceptable as she shows affection and not a little amount of spunk. Johnson's character is pretty obnoxious at times, but he and Williams have a good rapport together. As an actor, Martin sings beautifully, but he's smooth enough not to detract from the film. It's hard to imagine Williams even glancing anywhere else but at the tanned, buff Bromfield, who spends a great deal of his screen time in teensy black swim trunks (but is just as yummy in pastel sportswear!) Baker has one scene as Martin's suspicious girlfriend. It's always a feast for the eyes when Williams swims in one of Busby Berkeley's elaborate concepts. Here she shares a blossom-strewn love duet with Bromfield, is the centerpiece of a skiing spectacular and hams it up as a clown in a slam-bang circus number (looking like the result of an affair between Ronald McDonald and Lucille Ball.) It should be noted that she was pregnant during the filming of this movie! Like most films of this ilk, it all turns out with a happy (if unbelievable!) ending for all. Martin's denouement is particularly amusing.",
         "Easy to Love may yet when the definitive history of film is written to be Busby Berkeley's ultimate triumph. No longer confined by a motion picture sound studio, Berkeley stages a water ballet finale that is probably his ultimate fantasy number. I have no doubt that somebody at MGM got together with someone at Florida's Cypress Gardens and decided to make a film promotion of the place. In essence that's what you have here. MGM shot the whole thing down there in Florida and the technicolor photography is spectacular. When MGM did its compilation film That's Entertainment it was also mentioned that for one and one star alone did that studio construct a sound stage just for her. That would be Esther Williams, swimming star and movie star. Esther's place at MGM was something akin to Sonja Henie's at 20th Century Fox. A sports star who was already a celebrity before becoming an actress, Esther because the Olympics of 1940 was canceled did not quite have the clout Henie did when dickering with the MGM brass. Yet Esther was as good a businesswoman as Henie and MGM did quite all right by her in marketing her to the public. She does some numbers in the tank, but that finale is something else. For those of you who have only seen the finale because of That's Entertainment, the story is three guys and Esther and who she will choose. Her choice is her boss at Cypress Gardens Van Johnson, nightclub singer Tony Martin, and her swimming partner John Bromfield. Tony Martin sings the Cole Porter classic title tune and several other numbers, the best of which is one sung with a chorus of senior citizens and Esther, That's What a Rainy Day is For. I particularly like that one it's perfectly suited to Martin's style. Besides the finale Esther a very cute number dressed in a clown get up with a seal and chimpanzee and a mechanical alligator. According to her memoirs they were among her most memorable co-stars. I think it's unfortunate that Easy to Love did not utilize the musical talents of Van Johnson. He was signed by MGM in fact after he was spotted in the cast of Broadway's Too Many Girls. Of course he was no match for Tony Martin as a singer, but in films like Till the Clouds Roll By and Brigadoon he more than held his own. In fact MGM should have used him more in musicals generally than they did. And for we who appreciate these things there's the sight of John Bromfield who spends most of the film in a bathing suit. Easy to Love is quite the spectacle and real easy to take.",
         "Release dates for this one indicate that M-G-M decorated the nation's movie screens with this tuneful treat on Christmas Day. It was a delightful concoction with Esther displaying just about everything that made her one of the studio's biggest box office favorites, including a frantic number where she's dressed as a clown and required, no doubt by Busby Berkeley, assisting director Charles Walters, to perform some exceedingly lively stunts in the course of an elaborate aquatic display of why she was still a champion when wet. Tony Martin croons the title tune, a Cole Porter standard, to Esther as she languidly swims for what seems like miles in a moonlit lagoon and there's an extremely sweet little song, entitled \"That's What a Rainy Day Is For,\" tossed off, as they could afford to do in those melodious times, by Mr. Martin again, to a roomful of charming elderly ladies surrounding Miss Williams. The final extravaganza, set in Florida's Cypress Gardens, involves motorboats, dozens of swimmers, and Esther dangling and diving from a helicopter, no doubt the brainchild of Mr. Berkeley, the scourge of everyone assigned to execute the products of his fertile imagination (and, according to some reports, his alcohol-fueled tirades.) Of course the plot, with Esther pining for a remarkably disinterested Van Johnson, probably irritated even the tolerant audiences of the early Fifties, but it was scripted cleverly enough to display Esther's gift for light comedy, something that is not as appreciated as it should be. When that lengthy sequence of scenes from Esther Williams movies was put together for \"That's Entertainment!\" in 1974, a young acquaintance of mine, completely unfamiliar with Hollywood's one-and-only mermaid, exited the theater thoroughly besotted with her charms. He found himself literally at a loss for words to express his admiration. I don't know if he ever had the opportunity to see one of her pictures in its entirety, but this wouldn't have been a bad choice, were he limited to just one title.",
         "Although critics constantly gripe that Esher Williams could not act this movie lore is absolutely nonsense. Most of her films were slight escapist fare that called for her to display her sparkling light comedic touch which she showed over and over in hit after hit throughout the forties and fifties. WHen allowed to play more dramatic roles like \"Million Dollar Mermaid\"(MGM,1952) and most superbly in the underrated \"The Unguarded Moment\"(Universal,1956) she was very fine indeed but the rumor persists. But I will say it is in delightful musical confections like \"Easy TO Love\"(MGM, 1953) that she remained a top box-office star. Her chemistry with Van Johnson was always there. This was their fifth film together: their first was in Victor Fleming's dramatic fantasy \"A Guy Named Joe\"(MGM,1943) in support of superstars Spencer Tracey and Irene Dunne but this film made both stars; the empty but hugely successful \"Thrill of a Romance\"(MGM, 1945); certainly holding their own opposite the marvelous Lucille Ball in the charming and extremely popular \"Easy to Wed\"(MGM, 1946); and finally the solid hit \"Duchess of Idaho\"(MGM,1950) which allows Esther and Van to sparkle. But it is their last film \"Easy to Love\" that captures Esther and Van at their most captivating. The story is the usual fluff about fighting ex-lovers and is topped off with spectacular Busby Berkeley production numbers but all this is wrapped up in a witty script and the superb comic performances of Miss Williams and Mr. Johnson who were never better. Sad to say both their careers declined after this success.",
         "She was great! And, she could swim too. Esther Williams earned the snide remark from Fanny Brice about her acting but we, back in the late forties and early fifties, loved her. I mean, she didn't even have to act or have a decent script! Check out Pagan Love Song, if you doubt my words! This story, a typical Esther Williams escapist medium, includes some great character actors: King Donovan, married to Imogene Coca; John Bromfield, as the other guy interest, TV's The Sheriff of Cochise and the couple crooner Tony Martin and his wife, Cyd Charisse. But, let's not forget that heart stopper of the bobby soxers, old Van Johnson. I remember my aunt and her girl friend standing in the rain to get tickets to see him in \"30 seconds over Tokyo.\" This film, mild by today's standards, is a peaen to those halcyon days after the (second world) war, when the world was young and full of hope. No video, no DVD. Look for it on the late show.",
         "What's good: beautiful Esther Williams. Enough can't be said about this. She was positively radiant the entire film. No actress brought technicolor to life like Esther Williams. Tan, fit, gorgeous Esther. Also the great Busby Berkeley aquatic numbers. Esther Williams plus Busby Berkeley equals a win every time. What's bad: the men. Unfortunately, Esther is saddled with rather poor love interests here in Tony Martin and Van Johnson. There's no great chemistry to be had with either but Martin tries his soggy best. I definitely felt like he was attracted to Esther, although in a kind of scuzzy greaseball sort of way. He also has several terrible songs. MGM was pushing him extra hard in this. He wouldn't stop singing those terrible songs! I like Van Johnson but he's as exciting a male lead as a wooden plank. So bland and colorless. Esther really had some crappy choices here. Honestly it's not one of the greats. The plot of Esther wanting Van but all he thinks about is business so she tries to make him jealous with Tony is pretty flimsy and the romance is blechh. But see it for the stunning Esther Williams in technicolor and the wonderful production numbers choreographed by the great Busby Berkeley.",
         "Despite the fact that most films done with Esther Williams are just \"Little Ditties\" The cast in this movie is absolutely delightful. And the choreographed water scenes of water skiing and swimming by Busby Berkley are beautiful. So is the song Easy to Love, sang here by Tony Martin. The cast includes Van Johnson, who gives a touching performance. There is something about this actor that pierces through me in whatever part he plays. There is an appearance of beautiful Cyd Charisse at the end of the film together with her husband Tony Martin. Seeing this movie brings back memories of the time that TV was not available and Cinema was the most prevalent outing. There is nothing frightening or harmful in this kind of film it is pure entertainment.",
         "I liked seeing \"Easy to Love\" because it showed a part of Florida history that is now gone. Cypress Gardens was a premier destination in Central Florida up until Disney opened the Magic Kingdom in 1971. Following this, it was a steady decline until a few years ago when the property was bought by Legoland. I know that things change and I probably wouldn't have even liked Cypress Gardens but it is a shame that so much of the 1950s and 60s kitsch in Florida is gone--and this film is at least a nice chance to see a bit of it. The film stars Esther Williams as the premier star of the theme park, Julie. Her boss, Ray (Van Johnson), is not an easy man to like--he's all business and seems more content to exploit this star than anything else. Yet, inexplicably, Julie secretly loves him. I frankly saw NOTHING about the man that would make anyone fall for him. Laer, tiring of this seemingly pointless love, she begins spending time with a famous singer, Barry Gordon (Tony Martin). He at least says he loves her, though he is a playboy. In addition to these guys is Hank (John Bromfield)--a nice guy who works at the park and who openly and repeatedly tells her he loves her....plus he's rich. Of the three, the choice is obvious....Hank. However, considering that John Bromfield is not exactly a star, it's obvious he hasn't a prayer in the world. So who does she pick? See for yourself. Just be forewarned--it's a HUGE step backwards for women and I would hate to see my daughters pick a guy like that! As a romance, the film was definitely lacking. But, it was fun, a bit silly (in a good way--offering the most ridiculously over the top scenes of Williams doing the water stunts), and I liked Tony Martin's singing (particularly \"That's What a Rainy Day is For\"). Worth seeing if you like the old fashioned Hollywood musicals of the 50s--though I do suspect that a lot of younger folks today would find them all awfully silly. By the way, at the very end, look for a cute little cameo between Martin and Cyd Charisse--Martin's real-life wife.",
         "Esther Williams plays a romantically unattached water-skiing secretary who longs to stop \"walking on the water\" and be some man's wife; Van Johnson and Tony Martin are her potential choices for a husband. Despite fine aquatic sequences filmed at Florida's Cypress Gardens, this romantic comedy is awfully stale. As helmed by plodding director Charles Walters, everything here is made to seem intentionally innocuous, which doesn't lend the picture much staying power. Even Esther's big moments in the water are not quite up to the mesmerizing leaps from her previous swimming vehicles, though they are preferable to the asides with the men, both of whom are colorless. Carroll Baker, in her film debut as Martin's disgruntled ex-girlfriend, is the liveliest of the bunch. Flimsy stuff, indeed. *1/2 from ****",
         "Hi, I was hoping that someone might be able to assist me with information regarding this movie. My father ( since deceased ) was on the water ski team at cypress gardens and he told me years ago that he was part of the team used in the making of EASY TO LOVE. Does anyone know the names of the skiers ? They are not mentioned in the credits and I would like to know if he was part of the movie. His name was Robert Paul and his friends called him BOb or Bobby. Thanks in advance. -------- ------- --- ------- ---- ---- ---- ----- ------ -------- ---- --- ----- --- --- - ----- -- --- ----- --- --- -- - ------ -- - - ----- -- -- - ----- --- -- -- ----- --- - - ------ -- - --- - --- -- ------ --- -- ------ -- - ---- -- --- - - ------ -- -- ------ ---- - -- -- --- -- --- -- --- -- --- --- - ------ ---- -- - ----- ----- --- - --- -- -- - -- - --- -- ------- - ------"
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Set against the background of Florida's Cypress Gardens, and featuring many stretches of water carnival-ballet numbers, the slight story line finds swimming star Julie Hallerton (Esther Williams) in love with Ray Lloyd (Van Johnson), her boss and the creator and operator of the operation. She stays mostly wet, while he stays mostly disinterested in anything other than the cash receipts.",
         "An Aquatic performer tries to attract the man she loves."
      ],
      "budget": 0
   },
   "movielensId": 117666,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-12-25",
      "dvdReleaseDate": null,
      "directors": ["Charles Walters"],
      "runtime": 96,
      "movieId": 117666,
      "title": "Easy to Love",
      "mpaa": "",
      "actors": [
         "Esther Williams",
         "Van Johnson",
         "Tony Martin",
         "John Bromfield",
         "Edna Skinner",
         "King Donovan",
         "Larri Thomas"
      ],
      "imdbMovieId": "0045718",
      "originalTitle": "Easy to Love",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["5sxumk6DCgo"],
      "plotSummary": "Two men vie for the heart of a Cypress Gardens swimming star.",
      "tmdbMovieId": 43343,
      "avgRating": 2.5,
      "releaseYear": "1953",
      "numRatings": 1,
      "posterPath": "/2OuDEPUo6Q9F2vcdrCgvmomFTf2.jpg"
   }
}