{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0115650",
      "video": false,
      "title": "The Green Beautiful",
      "recommendations": [
         170832,
         153272,
         27260,
         11019,
         5071
      ],
      "backdrop_path": "/brbW9my1WC7Ycaimwfr6b1yaXVp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mila",
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379ab",
               "name": "Coline Serreau",
               "profile_path": "/nvuVQdd2F9N2uDpzPGJqYOULNKn.jpg",
               "id": 35208,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe44cdc3a368484e0379af",
               "name": "Vincent Lindon",
               "profile_path": "/ttfk7etXzELkW1gMSo5eH8aEzjY.jpg",
               "id": 5443,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mesaje",
               "gender": 2,
               "credit_id": "52fe44cdc3a368484e0379b3",
               "name": "James Thiérrée",
               "profile_path": "/yFRYfPNxjKv2Wyuuo2FqAhnCaLv.jpg",
               "id": 46274,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mesaul",
               "gender": 0,
               "credit_id": "52fe44cdc3a368484e0379b7",
               "name": "Samuel Tasinaje",
               "profile_path": null,
               "id": 93907,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Macha",
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379c1",
               "name": "Marion Cotillard",
               "profile_path": "/eSRyCYy2qiGIRodOV5eZJJRZIyP.jpg",
               "id": 8293,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sonia",
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379c5",
               "name": "Claire Keim",
               "profile_path": "/gUQr9TYvDJwyLtzVCXnOjNTKhV5.jpg",
               "id": 100371,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "La femme sage",
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379c9",
               "name": "Catherine Samie",
               "profile_path": "/6cxG1CJOSOcfOqXv8DM0NdjDywd.jpg",
               "id": 35917,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Osam",
               "gender": 2,
               "credit_id": "52fe44cdc3a368484e0379cd",
               "name": "Paul Crauchet",
               "profile_path": "/byVczF1WpaXsSdHYrv5cN5V4Prc.jpg",
               "id": 35003,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Homme politique",
               "gender": 0,
               "credit_id": "52fe44cdc3a368484e0379d1",
               "name": "Didier Flamand",
               "profile_path": "/cPMcoI8tBJlVU9B1XiuV27AhvtN.jpg",
               "id": 35077,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "52fe44cdc3a368484e0379d5",
               "name": "Michel Lagueyrie",
               "profile_path": "/pkVCR1E4czSAEZVBE1FiQvDtDde.jpg",
               "id": 37647,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Présentateur",
               "gender": 2,
               "credit_id": "52fe44cdc3a368484e0379d9",
               "name": "Patrick Timsit",
               "profile_path": "/p429Z97XloHvHe2a4PEZPqBZNEi.jpg",
               "id": 41526,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Papapote",
               "gender": 2,
               "credit_id": "52fe44cdc3a368484e0379dd",
               "name": "Denis Podalydès",
               "profile_path": "/AfsmUtlz0ogq08hzHfyT4dnJTPT.jpg",
               "id": 6020,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Florence",
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379e1",
               "name": "Philippine Leroy-Beaulieu",
               "profile_path": "/rv19icphzGPAdydBMdtx4Vy6DDI.jpg",
               "id": 20530,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Angry bmw driver",
               "gender": 2,
               "credit_id": "52fe44cdc3a368484e0379e5",
               "name": "Francis Perrin",
               "profile_path": "/1nSSPMgTgxDGvBuN5Kw9TypK9Pq.jpg",
               "id": 147043,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "La boulangère",
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379e9",
               "name": "Yolande Moreau",
               "profile_path": "/xvNEPTrfgvHeH1wOvMq0WGzovKv.jpg",
               "id": 2415,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379bd",
               "name": "Coline Serreau",
               "profile_path": "/nvuVQdd2F9N2uDpzPGJqYOULNKn.jpg",
               "id": 35208,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44cdc3a368484e0379ef",
               "name": "Coline Serreau",
               "profile_path": "/nvuVQdd2F9N2uDpzPGJqYOULNKn.jpg",
               "id": 35208,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.533566,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 25518,
      "vote_count": 42,
      "budget": 0,
      "overview": "As part of an intergalactic coalition, a well-meaning space alien volunteers to bring a message of self-actualization and harmony with nature to the one planet rejected by all her peers as incorrigible: Earth.",
      "similar": [
         258480,
         10735,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         634,
         437557,
         17130,
         43923,
         11634,
         141,
         376867,
         394117,
         242224,
         297762,
         370663,
         376660
      ],
      "original_title": "La Belle Verte",
      "runtime": 99,
      "poster_path": "/jLmn8t9HxFJdeGOAtfEUdtLANLq.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Les Films Alain Sarde",
            "id": 635,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TF1 Films Production",
            "id": 3823,
            "origin_country": ""
         }
      ],
      "release_date": "1996-09-18",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "FRF ",
      "directors": ["Coline Serreau"],
      "runtime": 99,
      "synopsis": "As part of an intergalactic coalition, a well-meaning space alien volunteers to bring a message of self-actualization and harmony with nature to the one planet rejected by all her peers as incorrigible--Earth. This family-oriented French sci-fi comedy chronicles her adventures on the chaotic planet. Mila is 150 years old and has five children; encoded in her brain are two telepathic programs designed to restructure the thinking of destructive humans. The first is a fairly mild program designed to inspire the humans to rethink their world and begin asking some difficult questions. The other is far stronger and rapidly indoctrinates subjects with lofty utopian ideals and makes them deeply aware of themselves. Mila lands in Paris and is unnoticed but for the sudden, inexplicable power surges and outages that occur whenever she sends a telepathic message to her alien cohorts. Instead of eating, Mila draws energy from holding newborn babies. It is while holding an orphan infant in an obstetrics ward that her Earthly troubles begin. Feeling deeply for the baby's plight, she confronts the ward's head doctor and when logic fails, looses her programs upon him. Instantly the unsympathetic brute sees the light and begins helping her save the babe from wicked welfare workers. ~ Sandra Brennan, Rovi",
      "writers": ["Coline Serreau"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0115650/",
      "coverLink": null,
      "actors": ["Stars: Coline Serreau, Vincent Lindon, James Thierrée | See full cast and crew »"],
      "reviews": [
         "did you ever wonder why the floor under your feet , in the place where you live are covered with a gray material, & you can't see the soil? why this floor is full of poop? why are there boxes of metal emitting gases that you must breath? why you live in high cages, forced to hear the noise of these metal boxes? why you're driving them, & not using your feet, causing you to eventually have heart attack, if you won't die earlier from cancer from the gases, or an accident with the fast moving boxes? why you eat corpses of animals? why you use pieces of paper entitling you to any value, without which you won't have nothing, not even food? why you eat unhealthy food? why you're sitting every evening watching a box showing people telling lies, & dirtying your mind? why do you let yourself be led by fat selfish people caring only about themselves, their money & power, why don't we really listen to each other, talk to each other, why do we have these hierarchies, in which the stupidiest, incapable ones rule, control & exploit the goodness & capable weaker ones? why we go about doing wrong immoral things just because we're being told, why we we're constantly mad, worried & frustrated with such small trivial things, like a scratch in the mirror of our cars, & never see, appreciate & thank the beautiful wonderful life, nature & world that sorrounds & support us? why we ruin the world, poison ourselves, live in ugliness, support the rich selfish people exploiting us, selling us lies, tobbaco, weapons & arms, killing people with the money that we're forced to pay them as taxes? if you haven't wondered on all this, its because you're like an ant, small cell in the super-organism, & can't see beyond your cell's vision. what you need is to be disconnected, shocked by artists such as Coline Serreau, that have a vision that you don't have, consciousness, different from that of the ants. such artists, like Jesus & Johann Sebastian Bach, cause the world to change, the super-organism to evolve into something more intelligent, more good for its cells, that are given life.",
         "This movie is undiscovered or perhaps denied genius. Watch it, give yourself to it, you can't help both feel great and wonder what our society's up to these days, how really far behind we are, of our own selves, even. Fantastic idea from start to finish, (ET's, super-advanced humans have been keeping track of a number of civilizations, including ours, which has been the slowest to develop. They're surprised we still use money, and live less than a hundred years. What they note through this point of view will astonish you.) Well done, really well done, every detail well cured, and thoroughly thought out. Surprising, entertaining, intelligent movie. Visually and conceptually stimulating, a more mature movie than say, Rambo. But fit for kids, too.",
         "If you don't understand French you are gonna miss a lot in this film because the dialogues are incredible. It was really difficult to get a hold of this film in France and after seeing it I understand why. It shows our society for what it is and how we are all just a bunch of sheep following the leader. No one wants to be shown that they are a sheep, so its no wonder this film received very little exposure. I will make sure that everyone I know will see this movie and make sure that all their friends see it too. Its a wake up call that was made over 10 years ago and we still haven't understood the message. Every high schooler, every college student should see this film, you should see this film. Its a film that calls for change. Loved it.",
         "As opposed to the last reviewer, I found this movie completely refreshing. Finally, a movie that presents the quirks of our modern and frantic living in a very humorous and simple way (check out Kooyaanisqatsi if you need a more abstract and poetic view). This movie doesn't \"try\" to make you laugh, you just do so because you can see yourself in it. This may not be a movie that Americans will quite get into since the type of humor and cultural background is very French in deed (and it does point out the absurdity of a lot of things we do here in North America as well as in Europe). It is highly commendable for the social comments it passes (just check out the scene where Vincent Lindon accidentally scratches someone else's car's rear view mirror or when the baby doesn't exist since it doesn't have papers). The movie as a lyrical feel to it and gives us hope. We just have to listen a bit closely. I give it a solid 7,5/10",
         "When I first saw this movie on Youtube, I was amazed about the foresight of her maker, Coline Serreau. That's why it's a shame after its release in 1996 this movie was banned in the EU and neglected in the rest of the World. It was far ahead of its time, and the ones who banned it knew that it would change the people, as a result of which they would lose their power. However, times have changed and the DVD can now be downloaded for free at www.romanovs.info/labelleverte.php with English, Russian or Portuguese subtitles. This movie is no SF anymore but will be our true reality in the next few years. Dear ones, watch this amazing movie, and let it change you, so that you can change the world.",
         "Once again I am struck by the original talent of Coline Serreau, who shows in \"la Belle Verte\", in a very simple and yet beautifully profound way, all the insane sides of humanity. Very much unlike her later film \"Chaos\" (2001) ,the choice of style and expression for \"La Belle Verte\" is a very undemanding form of comedy, which gives the movie an altogether very light tone, totally free of complexions and not at all inviting to intellectual debate. She simply points to the almost ridiculously obvious differences between a life of beauty and respect of life and one of disease, stress and egoic battle. Interesting is off course also to see the director herself in the leading part. Merci Madame! /Henrik Ajax",
         "7th June 2011. I am 30 years old and live in London, UK. I was born in Gran Canaria and, a day like today, I happen to watch \"La Belle Verte\"........... I haven't read many reviews of the ones already written, but I have seen that many people have given 10 out of 10. I also give 10 out of 10 because it somehow expresses that this \"film\" should be watched by everybody that needs to \"wake up\", to see our existence from the distance, with objectivity. It doesn't matter if some people claim that it gets \"repetitive\". That's just like saying that your mother's, girlfriend or boyfriend kisses are \"repetitive\". This film is pure LOVE. Forget about cinematography, or technicalities of filmmaking. This film is a film but it could well be a book, or a theatre play. Coline Serreau probably thought that in these days, with film this could get further, to everybody, that's why, I guess. There's only been another film that made such an impression to me: \"Into the Wild\". Thanks Coline. Thanks for helping me to continue to get re-connected. I keep trying.",
         "La Belle verte is directed by Colline Serreau,a talented woman film maker from France who made us all laugh with joy with her 1985 film \"Trois hommes et un couffin\".Her film is probably the only French film of recent times that talks of nature,environment and importance of greenery in our daily existence.In La Belle verte,we see how an alien lady from a green planet descend on French capital Paris in order to gather information about the status of greenery. What follows is absolutely shocking for this alien person as she learns that earth's inhabitants have almost no respect for nature,greenery and environment. Apart from its pro nature stance,La Belle verte is also a searing attack on consumerist society where modern human beings have no idea of nature's power.This forces them to eat meat,listen to music which is nothing but cacophony.An important role in this film is played by Colline Serreau who is effective as Mila,lady from green planet.Thanks to a DVD box set of Colline Serreau's films,la Belle verte is enjoying renewed popularity as a film that has highlighted mother earth's plight.",
         "I saw this film at the theater in 1996 and I just loved it. But I never watch it again until today and I was not disappointed as I feared: This movie is as Wonderful as I remembered it! I think this movie is excellent but that most of the people find it disturbing. And it is (!!) as it's about the stupidity of our world!! And people don't want to know how stupid they are, how they live their lives, closed in in their comfort and habits. But if you're not like this, you will just love this movie as it is pure genius. The whole film is very well done, with beautiful pictures, good acting and it's very funny. It's just the scene of the football match that I think was a little too much and off the subject. Otherwise Coline Serreau offer us a perfect movie: smart, funny, beautiful and touching.",
         "This movie is very nice, talking about how important it is to be careful of the nature, and stuff like that. I would use those words: Gaïa is there, loving us, and we are part of it, and we most be careful, because She will survive, where we couldn't. Please do not interpret what i say a I spoiler, because it is not. It is just the way I see maybe one of the many messages passed by this lovely movie, a cult movie, for me, indeed! In fact, one who see this movie and stay unaffected, is either totally unable to understand french language (or can't read subtitles if there is any ;) ) or has a mental or emotive blockage. The call to the truth of human nature, where the human life is leading, where there is a way to get the (f word here) away from this worldwide situation, in a better world, it lies in our hands to improve our world!!! =) Anyway... You do what you want, but this movie is a cult movie for me, as was The Fifth Element and The Matrix.. Keys are there, ready to be used to unlock some interesting realms... Have fun seeing this movie and g'day!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Les Films Alain Sarde",
         "TF1 Films Production"
      ],
      "summaries": ["The \"Green Planet\" belongs to another solar system. Through the simplicity of their lifestyle those who live there are a real step ahead of us: they spend their time concentrating their knowledge, strength and energy on the development of their minds and bodies in a natural environment which they dearly preserve and care for. Once a year, they gather in the crater of a dormant volcano to decide which planets they ought to send messengers to. There are volunteers for every planet except Earth, which is considered too polluted and too dangerous. One woman alone, Mila, decides to go there to seek out her identity, as Osam the old sage has revealed to her that she was conceived there during a previous trip by her father."],
      "budget": 80000000
   },
   "movielensId": 117849,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-09-18",
      "dvdReleaseDate": null,
      "directors": ["Coline Serreau"],
      "runtime": 99,
      "movieId": 117849,
      "title": "The Green Beautiful",
      "mpaa": "",
      "actors": [
         "Coline Serreau",
         "Vincent Lindon",
         "James Thiérrée",
         "Samuel Tasinaje",
         "Marion Cotillard",
         "Claire Keim",
         "Catherine Samie",
         "Paul Crauchet",
         "Didier Flamand",
         "Michel Lagueyrie",
         "Patrick Timsit",
         "Denis Podalydès",
         "Philippine Leroy-Beaulieu",
         "Francis Perrin",
         "Yolande Moreau"
      ],
      "imdbMovieId": "0115650",
      "originalTitle": "La belle verte",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["b8m3Vy8bto4"],
      "plotSummary": "As part of an intergalactic coalition, a well-meaning space alien volunteers to bring a message of self-actualization and harmony with nature to the one planet rejected by all her peers as incorrigible: Earth.",
      "tmdbMovieId": 25518,
      "avgRating": 3.78205,
      "releaseYear": "1996",
      "numRatings": 39,
      "posterPath": "/jLmn8t9HxFJdeGOAtfEUdtLANLq.jpg"
   }
}