{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0273850",
      "video": false,
      "title": "My Brother Tom",
      "recommendations": [
         64509,
         341544,
         108768,
         158947,
         312101,
         215960,
         65831,
         245930,
         215739,
         165027,
         43738,
         99503,
         20548,
         230846,
         343725,
         32119,
         339258,
         248694,
         248808,
         48114
      ],
      "backdrop_path": "/luXwFxBNFDWirKIIZNOsS19LzGQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jessica",
               "gender": 1,
               "credit_id": "52fe4a139251416c910c2563",
               "name": "Jenna Harrison",
               "profile_path": "/8wVFSrzdiKoUNtWQYJtP9f2TSyZ.jpg",
               "id": 77749,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c2567",
               "name": "Ben Whishaw",
               "profile_path": "/e74Cz65ifeNb9zHfUTvF5rTix0d.jpg",
               "id": 17064,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe4a139251416c910c256b",
               "name": "Honeysuckle Weeks",
               "profile_path": "/eu7nbPhQZz7fI3e8CcmLmuHvEjT.jpg",
               "id": 192855,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Ian",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c256f",
               "name": "Michael Erskine",
               "profile_path": null,
               "id": 1066137,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c2573",
               "name": "Adrian Rawlins",
               "profile_path": "/bqUlzzI0PrnJxvVbnxV86ORkoEY.jpg",
               "id": 1643,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jessica's Mum",
               "gender": 1,
               "credit_id": "52fe4a139251416c910c2577",
               "name": "Judith Scott",
               "profile_path": "/Aqeajq8Mdu1SHPVebRCMNKOqcL1.jpg",
               "id": 44185,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Gang Leader",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c257b",
               "name": "Michael Tucek",
               "profile_path": null,
               "id": 192906,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Gang Sidekick",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c257f",
               "name": "Michael Power",
               "profile_path": "/pKJhNfH30hBa1ozcGlumg9r0uAX.jpg",
               "id": 1066138,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Gang Boy",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c2583",
               "name": "Daniel Bliss",
               "profile_path": null,
               "id": 1066139,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Gang Boy",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c2587",
               "name": "Adam Paul Harvey",
               "profile_path": null,
               "id": 164602,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Gang Boy",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c258b",
               "name": "Craig Vye",
               "profile_path": "/fsspBr633zj3bqLN8GesumaS1u9.jpg",
               "id": 67243,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Jessica's Dad",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c258f",
               "name": "Richard Hope",
               "profile_path": "/3mKtKcJC4beo8a5gqd1YOzNA67H.jpg",
               "id": 28479,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Nicola",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c2593",
               "name": "Emily Barrett",
               "profile_path": null,
               "id": 1066140,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Father Felix",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c2597",
               "name": "Patrick Godfrey",
               "profile_path": "/n6q70F8UE4VSSHAjBlx3xBMqxY2.jpg",
               "id": 3568,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Tom's Dad",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c259b",
               "name": "Jonathan Hackett",
               "profile_path": null,
               "id": 1644,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Max",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c259f",
               "name": "Peter England",
               "profile_path": null,
               "id": 137979,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Ade",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c25a3",
               "name": "Elliott Tiney",
               "profile_path": null,
               "id": 1066141,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Ade's Girlfriend",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c25a7",
               "name": "Rosalind Whelan",
               "profile_path": null,
               "id": 1066142,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "52fe4a139251416c910c25ab",
               "name": "Glen Berry",
               "profile_path": null,
               "id": 67568,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Inspector",
               "gender": 0,
               "credit_id": "52fe4a139251416c910c25af",
               "name": "Ian Thompson",
               "profile_path": null,
               "id": 144564,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a139251416c910c2553",
               "name": "Dom Rotheroe",
               "profile_path": null,
               "id": 1066135,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a139251416c910c2559",
               "name": "Alison Beeton-Hilder",
               "profile_path": null,
               "id": 1066136,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a139251416c910c255f",
               "name": "Dom Rotheroe",
               "profile_path": null,
               "id": 1066135,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a139251416c910c25b5",
               "name": "Carl Schönfeld",
               "profile_path": null,
               "id": 1066143,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a139251416c910c25c1",
               "name": "Robby Müller",
               "profile_path": "/d9Fz3vBIBBYUXYbPTIxo2FwYGSL.jpg",
               "id": 1632,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "548ccdffc3a3684ea100247d",
               "name": "David Charap",
               "profile_path": null,
               "id": 47204,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.39105,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 89280,
      "vote_count": 10,
      "budget": 0,
      "overview": "A teenage girl, Jessica, befriends a teenage boy called Tom, who is bullied by a local gang. She is abused by Jack, who is both her neighbour and school teacher, and Tom is sexually abused by his father. Together they bond in the woods, creating a private reality that no-one else can enter.",
      "similar": [],
      "original_title": "My Brother Tom",
      "runtime": 111,
      "poster_path": "/hCMxCl0yvA668PqiMoIj0HhVR0Y.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5uoaxZCSYuc6KEiJgEYSWzLIFAW.png",
         "name": "Film4 Productions",
         "id": 6705,
         "origin_country": "GB"
      }],
      "release_date": "2001-11-16",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dom Rotheroe"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Alison Beeton-Hilder",
         "Dom Rotheroe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0273850/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDcwNTc0NjYyNF5BMl5BanBnXkFtZTcwMjg1MDY5MQ@@._V1_SY300_CR2,0,214,300_AL_.jpg",
      "actors": ["Stars: Jenna Harrison, Ben Whishaw, Honeysuckle Weeks | See full cast and crew »"],
      "reviews": [
         "'Teenage love is rarely this painful.' said the blurb outside the cinema. 'My Brother Tom' is a film full of pain and sadness. This film has not been written for fun, as entertainment, nor as a job of work, but has been wrenched out of the reality of someone's suffering. It shows life from the perspective of a child who has experienced and seen things more painful than her tender years can accommodate. But it does not leave one without hope. The director has been courageously faithful to the script and the challenging roles are fulfilled without self-consciousness. The film bears a degree of honesty that is rarely seen in life, let alone on screen, and perhaps for some viewers it will be too much. 'Man cannot bear too much reality'. It also carries an exhilarating sense of freedom - the two children have been let down by society, and understandably and with true childlike spirit they abandon it. They choose for their home the 'good wood', and the film's sense of hope comes from nature. Society may be 'f***** up', but mother nature is a refuge, full of nurture and protection and love. Theologically speaking - for though in a sense iconoclastic the film is not secular - it is the product of an age in which the Church has become a shrine to its own conventions, and has lost sight of the 'living spirit' which was once its source. Thus far from being offensive to the religious, 'My Brother Tom' is on the side of the Spirit, desperately wanting to resurrect the Spirit from the sepulchre of conventional 'religion'. As for the hand held camera, I did not once find it an irritation or a distraction, as I did occasionally, for example, in 'Festen'. On the contrary, it suited the film, adding to its wildness and immediacy in a way I never really believed that this technique could. If you regard film as primarily for relaxation and entertainment, this is clearly not a film for you. If, however, you are someone ready to wrestle with all the truth and pain that this world holds, and if you regard film as a fit medium for this wrestling, then do not miss 'My Brother Tom'.",
         "I found this film very disturbing. I had to watch it until the end. The acting was such that I had to remind myself that it was acting sometimes. I feel that some actors are very brave to take on certain parts. I think that in some darker places in the world (e.g. USA), elements of the population would confuse the actor with the part and abuse him. Congratulations to all involved for an excellent performance. The tension is never \"Watch out behind you\" but \"Please, please, not that\". If this film causes just one adult to reflect on how his actions may damage a child then it is very worthwhile.",
         "An incredibly compelling film which had me glued from start to finish. As someone personally affected by the abuse issues raised I felt so much empathy for the characters who were portrayed fantastically by the young actors. Uncomfortable viewing at times, particularly for those with such experiences in there past, but essential non the less. The harsh reality of adults, especially those in powerful positions, reluctance to see what is going on around them is shown brilliantly. Yes it shows a dank view of the world, but talk to 10 young people in your life and its almost guaranteed that at least 5 of them would have experienced similar acts, with no one to turn to. A film were you need to look beyond such aesthetics as SFX or high budget locations and accept that this stuff really does happen everyday!!!!!!",
         "The way it is haphazardly edited, the poor quality of the sound and the general disturbed nature of the plot and it's character's, all suggest that Dom Rotheroe has been watching too much of Lars von Trier at al. We begin with 15 minutes of absolutely nothing - walking to and from school, little dialogue, little plot development apart from a hedgehog and the odd jump from a tree. But this laboured pacing sets us up for the almost 'mentioned-in-passing' rape of a young schoolgirl by her teacher. In her own bedroom. With her mother downstairs in the living room. We know from here that what we are watching is pretty serious stuff. With an air of 'Heavenly Creatures', the two kids become almost inseparable, stripping off but doing little more than feeling each other and banging foreheads - we are shown an extremely intense relationship between two seriously messed up children. I thought I recognised the girl who played Jessica from somewhere else, but looking at her bio there is nothing on there that rings a bell. She puts in an impressive performance which she'll probably never match, and one which I'm sure she'd be disappointed has only been witnessed by a small number. On the whole, the film was very engaging and very hard-hitting - but the biggest compliment I can give, is that I'm pretty sure Mr von Trier would have loved it.",
         "A fascinating and disturbing study of two damaged teenagers who find solace in each other's company. This is what film is all about. The use of hand-held DV - the unselfconscious performances of the two leads - the harsh portrayal of the selfish acts of cruelty perpetrated by unthinking adults on vulnerable, impressionable children. I love this film, but I could barely watch it at times. The two leads reminded me of a young Joanne Whalley (Jenna Harrison should go far if there's any justice in the film industry) and a seriously unhinged Lee Evans without any of the comedy - just his style of manic lashing out. Spoiled on its UK TV airing by the booming Channel 4 Big Brother voice ruining the mood over the credits. Channel 4 seems happy to destroy the end of its own movies. Sad. 8 out of 10. At least. Should be shown in schools.",
         "My Brother Tom is about a subject that is, sadly enough, quite well known in my country. As you may know, we had a case of child abuse that was so gruesome that it has probably been covered by the news all over the world. Since Dutroux has been put in jail for the rest of his life, people gradually seem to be able to cope with the subject again. I guess that the fact that this movie was actually shown on television is a good example of that. If you read the title of this movie, you might think that it is about a kid who's brother Tom is the victim of child abuse. That's not entirely true. In fact it is about two victims, a girl and a boy, who have found each other in their misery and try to deal with it together. Even though they aren't relatives, they call themselves twins. That's where the title comes from. My Brother Tom is probably not the best movie for parents of young children who are easily worried. I guess they might get frightened by the idea that this could happen to their own children. However, you could also see it as a very good educational movie. Anyway, I must say that I liked it. The acting and the story are very convincing and are brought to you in a very good way. It shows very well how devastating this abuse is and what it can lead to in the end. I reward it with a 7.5/10",
         "One of the most moving and hard hitting films I have seen in a long while. It deals with issues very rarely brought to the film going audience. The topic of abuse is the thread that holds the screen play together, and it is an issue that is used without it being sugar coated for the audience. At times I felt that I should not be watching; I felt that I was trespassing on something private and unseen. Though the camera work is shaky and the film so dark as to seem almost black and white this adds and I believe does not detract from the overall message. 'My Brother Tom' is neither enjoyable or entertaining to watch. Rotheroe does the same as Tim Roth does in 'The War Zone'; he broaches issues that deserve a representation in celluloid. I recommend strongly that you see this film but do not expect an easy movie experience, instead expect to shocked by realities that you would rather less confront.",
         "I really loved this film! I was watching it from about 12:40 midnight and I was falling asleep, but i had to watch it to the end. It highlights really well the reasons why some people seem crazy and shows how we should look for reasons rather than just scorn or punish people. Raw, but tender passionate, painful, blissful. It had all of these and really captured the mental instability of both characters through brilliant filming. The acting was superb. Ben Whislaw was excellent as Tom, really getting underneath the skin of the character, and Jenna Harrison also gave an excellent debut performance, making the story so real and so passionate. Well done!",
         "Rarely do first time directors have the confidence to abandon superfluous dialogue and concentrate on the raw emotion of their story. Rotheroe is an exception. Not a frame is wasted as he explores the sexual trauma of two teenagers groping towards understanding in the magical woods.",
         "very surprised, too, to read so many bad comments. this is, at the very least, the best british film i ve seen this year. very strong, very emotional, very black&white: if u don't like that, do not go. else: IT S A MUST. (ps: FANTASTIC phtography by robby mueller. yes, handheld camera, nevertheless: FANTASTIC) -funtoosh"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "British Screen Productions",
         "Film Council",
         "FilmFour"
      ],
      "summaries": ["A teenage girl, Jessica, befriends a teenage boy called Tom, who is bullied by a local gang. She is abused by Jack, who is both her neighbour and school teacher, and Tom is sexually abused by his father. Together they bond in the woods, creating a private reality that no-one else can enter."],
      "budget": 0
   },
   "movielensId": 117907,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-11-16",
      "dvdReleaseDate": null,
      "directors": ["Dom Rotheroe"],
      "runtime": 111,
      "movieId": 117907,
      "title": "My Brother Tom",
      "mpaa": "R",
      "actors": [
         "Jenna Harrison",
         "Ben Whishaw",
         "Honeysuckle Weeks",
         "Michael Erskine",
         "Adrian Rawlins",
         "Judith Scott",
         "Michael Tucek",
         "Michael Power",
         "Daniel Bliss",
         "Adam Paul Harvey",
         "Craig Vye",
         "Richard Hope",
         "Emily Barrett",
         "Patrick Godfrey",
         "Jonathan Hackett",
         "Peter England",
         "Elliott Tiney",
         "Rosalind Whelan",
         "Glen Berry",
         "Ian Thompson"
      ],
      "imdbMovieId": "0273850",
      "originalTitle": "My Brother Tom",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["VTUX9mxN84Q"],
      "plotSummary": "A teenage girl, Jessica, befriends a teenage boy called Tom, who is bullied by a local gang. She is abused by Jack, who is both her neighbour and school teacher, and Tom is sexually abused by his father. Together they bond in the woods, creating a private reality that no-one else can enter.",
      "tmdbMovieId": 89280,
      "avgRating": 3.5,
      "releaseYear": "2001",
      "numRatings": 8,
      "posterPath": "/hCMxCl0yvA668PqiMoIj0HhVR0Y.jpg"
   }
}