{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0091364",
      "video": false,
      "title": "Courier",
      "recommendations": [
         72611,
         63573,
         63958,
         67467,
         71393,
         20886,
         79216,
         41979,
         57776,
         127608,
         97666,
         83486,
         172878,
         129229,
         72955,
         83524,
         20870,
         89674,
         87793,
         270393
      ],
      "backdrop_path": "/9HPoaqxrHI9JymjDBRQwGJDeZym.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ivan",
               "gender": 0,
               "credit_id": "52fe481cc3a368484e0e9bdb",
               "name": "Fyodor Dunayevsky",
               "profile_path": "/ldbp65jWSIzsHcQAIIxPSNNNjKg.jpg",
               "id": 559988,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Katya",
               "gender": 0,
               "credit_id": "52fe481cc3a368484e0e9bdf",
               "name": "Anastasiya Nemolyaeva",
               "profile_path": "/5UC5jIWYFy326G1gpHtPiWuXDsS.jpg",
               "id": 20892,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Katya's father",
               "gender": 2,
               "credit_id": "52fe481cc3a368484e0e9be3",
               "name": "Oleg Basilashvili",
               "profile_path": "/gEjodCo6a33GCdAl6jXgBBYxvJH.jpg",
               "id": 99262,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ivan's mother",
               "gender": 0,
               "credit_id": "52fe481cc3a368484e0e9be7",
               "name": "Inna Churikova",
               "profile_path": "/eJd7GZ6rArA7Esg5PS6q8A0SJWy.jpg",
               "id": 99291,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ivan's chief",
               "gender": 2,
               "credit_id": "52fe481cc3a368484e0e9beb",
               "name": "Aleksandr Pankratov-Chyornyy",
               "profile_path": "/jGgdsjaVjlHd4D10nSmBIiFR5Fq.jpg",
               "id": 240543,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Guest on Katya's birthday",
               "gender": 2,
               "credit_id": "52fe481cc3a368484e0e9bef",
               "name": "Vladimir Menshov",
               "profile_path": "/uFcUO36vMhZuI4e8KSfM4UckODG.jpg",
               "id": 23442,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "52fe481cc3a368484e0e9bfb",
               "name": "Svetlana Kryuchkova",
               "profile_path": "/3KhH7RHAPWSZK2FTd0QJSJbaOWX.jpg",
               "id": 240540,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe481cc3a368484e0e9bf3",
               "name": "Alika Smekhova",
               "profile_path": "/sIuhVBg1OsdZ81nQdMtfCOqfKwS.jpg",
               "id": 232861,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe481cc3a368484e0e9bf7",
               "name": "Sergey Chonishvili",
               "profile_path": "/hev9DH5c9x4aqPiQaOlVk6XGjPs.jpg",
               "id": 545608,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe481cc3a368484e0e9bd7",
               "name": "Karen Shakhnazarov",
               "profile_path": "/y0yzilBH1TisWu8tCFJXre2drNK.jpg",
               "id": 235417,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53a3087ec3a36831f90017e7",
               "name": "Aleksandr Borodyanskiy",
               "profile_path": "/7R8maHFQdtttAzi47G8raQn5nHe.jpg",
               "id": 235054,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53a30889c3a368443e000fe6",
               "name": "Karen Shakhnazarov",
               "profile_path": "/y0yzilBH1TisWu8tCFJXre2drNK.jpg",
               "id": 235417,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53a308a2c3a3683202001776",
               "name": "Karen Shakhnazarov",
               "profile_path": "/y0yzilBH1TisWu8tCFJXre2drNK.jpg",
               "id": 235417,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5ab24deec3a3686fd200a5c6",
               "name": "Nikolay Nemolyaev",
               "profile_path": null,
               "id": 47446,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.917761,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 70966,
      "vote_count": 21,
      "budget": 0,
      "overview": "Ivan Mirosnikov, a cheeky young man in the Gorbachev era, is trying to figure out what to do with his life (he's not in college, and the 2-year mandatory military service is looming large ahead of him). Meanwhile, he lives with his divorced mother, and works as a courier at a Russian newspaper. Through his job, he meets patronizing Professor Kuznetzov and his rebellious daughter Katya. To annoy the professor, Ivan claims to have an affair with Katya. To his surprise, Katya backs his story up.",
      "similar": [],
      "original_title": "Курьер",
      "runtime": 88,
      "poster_path": "/hyVbbg0ZD247ZimWzmi8iRu0Tca.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
         "name": "Mosfilm",
         "id": 5120,
         "origin_country": ""
      }],
      "release_date": "1986-06-06",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Karen Shakhnazarov"],
      "runtime": 90,
      "synopsis": "A minor masterpiece energetically and humorously depicts the economic gloom, psychological emptiness and prevailing insecurity of the late Soviet Union. A young, disconcerting \"original\" (Fyodor Dunyaevsky) attempts to build a life following his parents' divorce and his own rejection from university. He has only a short period of time remaining before the inevitable army conscription and decides to spend his days courting, after a fashion, Katya (Anastasiya Nemolyayevna), a girl he meets while delivering packages and, in general, causing disruption of every order in a society already wracked by upheaval. Although ending on a note of sweet sadness, the film all the same manages to raise quite a comedic 'monument' to the new 'original' Soviet type it portrays. The film also features one of the great performances of \"Autumn Marathon\" and \"Station for Two\" star, Oleg Basilashvili in the role of Katya's father.",
      "writers": [
         "Aleksandr Borodyanskiy",
         "Karen Shakhnazarov"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0091364/",
      "coverLink": null,
      "actors": ["Stars: Fyodor Dunayevsky, Anastasiya Nemolyaeva, Oleg Basilashvili | See full cast and crew »"],
      "reviews": [
         "The Messenger Boy brought the \"gritty reality\" of the time approaching the end of the Soviet Union to the screen in a much more enjoyable way than other Chernukhas like Little Vera. Although the main character Ivan represents the rebellion and insolence that was associated with the young generation of the time without any restraint, there was an underlying positive quality, almost a purity, in him that singled him out as an authentic, \"good\" person of the time. A great way to describe this masked purity would be to compare Ivan with Holden Caulfield, the protagonist of J.D. Salinger's The Catcher in the Rye. Both characters share a certain \"unlikeability\" among their elders and the older generation of the society of which they are part, but their frankness is seen as a positive directional icon to their own generation. Each dropped out of school and flops around society with either a poor job or none at all, but is nevertheless seen as a lost child in a dirty world, and hence pitied for their genuineness. Katia enjoyed Ivan's tactless mannerisms much like Holden's friends (however few) enjoyed his general apathy--they felt a bond with each representation of the \"lost generation.\" The movie truly made one feel for Ivan's plight--it's not that he did not care, it is simply that the society of which he was part was falling apart, so their expectations on his behavior did not do much. It is precisely this truth, this authenticity, that made Ivan, and the entire movie, so enjoyable to watch. Finally, props to Oleg Basilashvili, the actor who played Katia's father, to be able to switch roles so effectively from The Autumn Marathon as Bouzikin to The Messenger Boy-- it almost seemed like nothing had changed, it is just that time has passed between the two, which further adds to the truth value of this particular film.",
         "Early Perestroika years in Moscow. The Communist regime has brought about relative wealth and comfort, but also growing differences between the haves and the have nots. Belonging to the middle-upper class means working hard and conforming. Ivan Miroshnik is a teenager pampered by his mum who has just divorced. He plans neither to work hard nor to conform. After uncaringly failing his university entrance exams, he does not know what to do with himself, but mum finds him a job as a messenger boy in a small editing house. On his first day at work Ivan is sent to take a parcel to professor Kuznetsov, who belongs to the successful upper class. On arrival, he meets Katya, the professor's daughter, and quickly and effectively sets out to charm her with his cheek and impudence. Katya has led a protected life and quickly takes to Ivan's \"originality\", while Ivan goes with the flow. As to professor Kuznetsov, he decides that Ivan is just a supplied, rude and nihilist young man. Ivan and Katya meet, alone or with their usual group of friends, and class differences soon become painfully obvious. Ivan's constant dubious practical jokes, probably the only means he has to try and please, start to lead to very unpleasant situations. This film is about the wavering of youth, sexual attraction among people with different backgrounds, about clashes between generations, the end of the Soviet Union and the rejection of its values by younger people. Very interesting and honest analysis of Katya's psyche, achieved with just a few brush strokes. This film got several prizes when it was released, and has aged well, since it contains sufficient reflections on universal issues (clothes and hairstyles aside, perhaps). Good musical score by E. Artemev.",
         "Ivan, a boy living in the years of Perestroika and Glasnost, finds himself on the precipice between youth and adulthood. Unlike \"little\" Vera, the world of adults is not something he outright rejects. Evidence may be found in his calm, unflinching demeanor, his compassion for his family, and his seamless ease of integration in the company of adults, but nothing more clearly stands out than his advice to Bazin after Ivan gifts him his coat: \"Wear it and wish for something great\". In a shot, this one line exposes Ivan's imagination, creativity, and drive, qualities that are underdeveloped in many of his peers. He must rely on these exclusively as he transitions between childhood and adulthood. These are not the only two worlds Ivan must navigate between. He fancies Katya, a professor's daughter, who possesses an education and lives a life of luxury and propriety. Ivan serves as the messenger, transporting ideas from Katya's world of the well-to-do to his own gritty reality and vice-versa. This deeper metaphor, present in the film's title, is impossible to miss. The clash between the worlds of the poor and the rich, of children and adults, proves too much to handle for Katya, who disenchanted, rebels against her parents at a social gathering and plays Ivan's coarse and raucous tune for the roomful of adults. Unlike his father, Ivan is responsible. He cares for his mother and thinks of the future. This is manifested into the form of a young man in uniform staring with eyes full of nostalgia at the gathering of children at the end of the film as Ivan stares back pondering if he would be treated to the same fate and wondering what the future will hold. All of Russia would be similarly apprehensive of what would come of Perestroika and Glasnost. I believe Ivan is Karen Shakhnazarov's answer.",
         "It is true that Russian film \"Courier\" is more than 25 years old but its emotional as well as intellectual impact continues to be astounding. Each time a viewer sees it, one is reminded of the struggles for freedom which people of the past had to undergo. It is somewhat autobiographical in nature as it depicts some events which took place in Mr.Karen Shakhnazarov's life. It was directed by him in 1987 but depicts what happened to him as a youngster two decades ago in 1967. Much of the film is based on the point of view of a non conformist, upper middle class youth whose views indirectly influence his girl friend too. We also get a chance to see a huge chasm in the form of generation gap. Karen Shakhnazarov maintains the balance as he gives an honest perspective of the difficulties faced by parents while raising their children.Courier has its share of comic scenes too but not they cannot be classified as slapstick comedy scenes. The best example of this film's artistic mischievousness is reflected in a scene wherein the film's protagonist, claiming some lines by the great Russian poet Pushkin as his own, confidently reads them to impress an influential person. It was in 1987 that film critic Lalit Rao watched \"Courier\" for the first time on India's national television network \"Doordarshan\".This film was part of a series of award winning foreign films which were shown rather late in night. A whole generation of cinéphiles in India were formed by watching such world cinema classics.",
         "I first saw \"Kuryer\" when I was 8. All I remember is the change of moods that it inspired in me--from tears of laughter to gloomy sadness. Were I born 6-7 years earlier, I might have very well experienced the dillemmas that confronted the young hero of this film..."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Mosfilm"],
      "summaries": [
         "Ivan Mirosnikov, a cheeky young man in the Gorbachev era, is trying to figure out what to do with his life (he's not in college, and the 2-year mandatory military service is looming large ahead of him). Meanwhile, he lives with his divorced mother, and works as a courier at a Russian newspaper. Through his job, he meets patronizing Professor Kuznetzov and his rebellious daughter Katya. To annoy the professor, Ivan claims to have an affair with Katya. To his surprise, Katya backs his story up.",
         "The story of a teenager boy in times of the comunism fall in the Soviet Union."
      ],
      "budget": 0
   },
   "movielensId": 118166,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1986-06-06",
      "dvdReleaseDate": null,
      "directors": ["Karen Shakhnazarov"],
      "runtime": 88,
      "movieId": 118166,
      "title": "Courier",
      "mpaa": "",
      "actors": [
         "Fyodor Dunayevsky",
         "Anastasiya Nemolyaeva",
         "Oleg Basilashvili",
         "Inna Churikova",
         "Aleksandr Pankratov-Chyornyy",
         "Vladimir Menshov",
         "Svetlana Kryuchkova",
         "Alika Smekhova",
         "Sergey Chonishvili"
      ],
      "imdbMovieId": "0091364",
      "originalTitle": "Курьер",
      "genres": [
         "Drama",
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["uN8eris65VI"],
      "plotSummary": "Ivan Mirosnikov, a cheeky young man in the Gorbachev era, is trying to figure out what to do with his life (he's not in college, and the 2-year mandatory military service is looming large ahead of him). Meanwhile, he lives with his divorced mother, and works as a courier at a Russian newspaper. Through his job, he meets patronizing Professor Kuznetzov and his rebellious daughter Katya. To annoy the professor, Ivan claims to have an affair with Katya. To his surprise, Katya backs his story up.",
      "tmdbMovieId": 70966,
      "avgRating": 4,
      "releaseYear": "1986",
      "numRatings": 63,
      "posterPath": "/4DVM2sNtse5tQlYgRNQB6i6V3Y4.jpg"
   }
}