{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "christmas",
         "id": 207317
      }],
      "imdb_id": "tt3072182",
      "video": false,
      "title": "Christmas in Conway",
      "recommendations": [],
      "backdrop_path": "/xNtFls8rWToTHWI5Y25FHOZXrPZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4eadc3a36847f82a0999",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4eadc3a36847f82a099d",
               "name": "Mary-Louise Parker",
               "profile_path": "/3e72qs1QuqMlpieIm2JZtX1WNg2.jpg",
               "id": 18248,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4eadc3a36847f82a09a1",
               "name": "Mandy Moore",
               "profile_path": "/15sDtRpe301tZWrRYV31wjMuFpx.jpg",
               "id": 16855,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4eadc3a36847f82a09a5",
               "name": "Cheri Oteri",
               "profile_path": "/1j7zUQberFkZ6YVMzG3b7nkajaQ.jpg",
               "id": 60252,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4eadc3a36847f82a09a9",
               "name": "Riley Smith",
               "profile_path": "/jdkypzjSf6S4NjpAuS6lBtohG2c.jpg",
               "id": 67850,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4eadc3a36847f82a09ad",
               "name": "Mark Jeffrey Miller",
               "profile_path": "/ihppJwgMkHejIXLTdoS1aYVDewz.jpg",
               "id": 1249175,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4eadc3a36847f82a09b3",
               "name": "John Kent Harrison",
               "profile_path": null,
               "id": 96001,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a64e113c3a3687f7502bf84",
               "name": "Stephen P. Lindsey",
               "profile_path": null,
               "id": 151181,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a64e11f9251410b21026d54",
               "name": "Luis Ugaz",
               "profile_path": null,
               "id": 1053448,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 3.824926,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 240820,
      "vote_count": 13,
      "budget": 0,
      "overview": "Duncan Mayor decides the perfect Christmas present for his beloved wife, Suzy, is a ride on a real Ferris wheel, set up in their very own back yard. As a young man, it was the perfect place for a wedding proposal. Now, years later, in order to relive the experience with his wife, Duncan will go to any length to make their fantasy become a reality.",
      "similar": [
         11395,
         10147,
         17979,
         25842,
         11881,
         1581,
         1585,
         634,
         9479,
         13673,
         51052,
         8871,
         10719,
         296100,
         338964,
         10510,
         10437,
         9279,
         13188,
         9021
      ],
      "original_title": "Christmas in Conway",
      "runtime": 97,
      "poster_path": "/ojdFSIL8hJ3CvWJaa0xIo6cSiHd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/wHs44fktdoj6c378ZbSWfzKsM2Z.png",
            "name": "Sony Pictures Television",
            "id": 11073,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Hallmark Hall of Fame Productions",
            "id": 9027,
            "origin_country": ""
         }
      ],
      "release_date": "2013-12-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "He gave her a gift this town will never forget.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Kent Harrison"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Stephen P. Lindsey",
         "Luis Ugaz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3072182/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjA3NTMxNjIyMl5BMl5BanBnXkFtZTgwMTI5NDc2MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Andy Garcia, Mandy Moore, Cheri Oteri | See full cast and crew »"],
      "reviews": [
         "Natalie is a hospice nurse who lives in Florence, SC. Her boyfriend (either Bob or Brian) has gotten a great job in Chicago and he wants her to come up and visit soon. But after she takes him to the airport, Natalie must go to Conway, 60 miles from home, to take care of Suzy, who is terminal and was only allowed to come home from the hospital if she had a home care nurse. When Natalie arrives, next-door neighbor Gayle is determined to win the neighborhood Christmas decoration contest, and she is being helped by Tommy, who has a college degree but is a landscaper. Suzy's husband Duncan doesn't want a nurse, saying he can take care of her himself, but Natalie reminds him that she can only be at home with a nurse. Besides, Duncan is a contractor, though we never see him working for anyone else. If he takes time off work for Natalie, how can he pay the bills? Suzy is sweet and determined to do as much as possible, but she has given up on chemotherapy, so beating the cancer is no longer an option. But she isn't exactly giving up, and Natalie is so helpful. Duncan resists any attempt by anyone else to help him, particularly Tommy, who he hates for some reason. Duncan seems like a cranky old man to everyone else, but he is very loving to Suzy, and inside the house even shows the emotions he is trying to hide when anyone else is around. He doesn't know how he will make it without her. Duncan wants to take Suzy to Myrtle Beach so they can relive the day he proposed on a ferris wheel there. Natalie thinks it's not a good idea to drive Suzy so far, and she's right. Suzy gets sick and needs to go home. There is another way: Duncan goes to Family Kingdom and asks how he can get a ferris wheel of his own. The mechanic, who has to test the rides during the off-season, reluctantly tells him about Henry near Moncks Corner. It's beginning to look like this ferris wheel fantasy will never happen. Henry is a wacko who runs a junkyard and carries a gun which he will use on anyone who tries to steal from him. And no, that broken-down ferris wheel is NOT for sale. But one day a truck shows up with Henry and his partners Lonnie and either Bob or Brian. All they do is unload. Duncan will have to do the rest, and Henry provides what directions he has. It seems he and his partners used to travel around putting together rides for carnivals, but Henry had his own tragedy that made him bitter. But everything is about to fall into place. Duncan needs help and Tommy is there, if he can just get over whatever is bothering him. Meanwhile, Suzy is going downhill, though she tries to remain positive, and Natalie remains helpful. Her relationship is in trouble, but I think Natalie likes Tommy. As the ferris wheel goes up, the conceited Gayle objects to this monstrosity in her posh neighborhood and runs to her brother the sheriff. Can this fantasy really happen? Will Suzy even make it if it does? Mary Louise Parker is excellent. She doesn't really seem sick (she even has her hair) but it's just that her character is so strong and won't give up. And no matter what, she shows concern for others. I didn't recognize Andy Garcia, though he looks like Mitt Romney in this. Garcia is nothing like his past roles, but he is very good here, providing the perfect balance between bitter curmudgeon and loving but sad husband. Mandy Moore is sweet and caring, and determined to do whatever is necessary. Riley Smith is likable as Tommy. I didn't know Cheri Oteri but I sort of remember her from \"Saturday Night Live\" prime-time specials and clips. She provides most of the desperately needed humor. Mark Jeffrey Miller also stands out and gives us a few more laughs, showing a mix of bitterness and caring as the former carnival worker. I have only one complaint. They obviously didn't film this movie in the real towns. The movie was set in Conway and it has the Spanish moss that helps make the town so attractive. As the couple rode to Myrtle Beach, they crossed an attractive bridge which I've never seen. Conway has a real nice bridge they should have used. The Riverwalk was mentioned but I don't think the real one was shown, because I have visited it for the past six years and it didn't look quite like that. I have passed Family Kingdom amusement park in Myrtle Beach many times and may have gone there (whatever it was called then) as a child nearly fifty years ago. I don't think that was the real Family Kingdom either. And Moncks Corner is not as close to Conway as they made it look, and nowhere near a freeway. This is a family movie, but it doesn't shy away from the reality of terminal illness. But this is a worthy effort for the Hallmark Hall of Fame.",
         "This film had quality actors playing roles with substance. Several plot lines and touching moments. They could have done without the buffoonish neighbor lady, but otherwise, I appreciated the love this man (Andy Garcia) showed for his wife in the last stages of her life. Mandy Moore was truly believable in her role as a hospice care nurse, and the relationship she developed with the dying Mrs. had depth to it. Probably a little on the unbelievable side, overall (building a ferris wheel in your back yard?), but I appreciated the fact that the end of the movie was their ride together on the wheel, and not her death. Thumbs up!",
         "Christmas in Conway is about a loving husband, Duncan who brings home his terminally ill wife, Suzy to be with those who love her . She wants no more treatment for her illness. A young health carer, Natalie, whom the wife calls, Pretty Lady, helps taking care of her and to console a saddened and grumpy husband who would give the world to have her happy until the end. I've been an avid fan of Andy Garcia since I've seen him starring in When a man loves a Woman for the very first time. I loved him for the way he portrayed the hurt and distressed husband of a wife who abused alcohol. Although I've also thought of him as being very good looking, I adored his talent and tried to see all his work over the years. I have seen mostly dramas done by him as well as comedy, which I have also enjoyed immensely. A dear friend surprised me with a wonderful gift, when I received a DVD of Christmas in Conway in the mail recently. Starring my beloved Andy Garcia as well as Mandy Moore and Mary Louise Parker. What a delightful evening I had. Watching this Jewel of a movie with loved ones. Although it was very sad, I had some good laughs as well! Needless to say, I started to cry early on in the movie, which ended in loud sobs. No shame here! I enjoyed this beautiful and heartwarming story as never before. What I loved most,is the way the ending was done. Beautifully done by the producer, in my opinion! Quite unexpected, because I thought it was going to end in a different way, at a 'most awaited' moment towards the end. Wow! Is about all I can say! Andy has aged, like all people do, but he still has the amazing talent and ability to charm this lady's heart in a very nice way. And make my heart skip a beat or two, with his good looks. Be kind to yourself and find a way to see this awesome, wonderful and wholesome movie with a dear friend or even a granddaughter often years old. I'm going to watch it again and a again and again.",
         "This was very good, a little heartbreaking if I'm honest but I appreciated that it wasn't the usual cheesy or corny Christmas movie. A surprisingly great cast here too (Andy Garcia, is fantastic, Mandy Moore, very believable as the home care nurse and Mary-Louise Parker is suitably sick. They all do a great job telling the story of a grumpy (heartbroken) man who goes about building a Ferris wheel for his ailing wife in their backyard as a reminder of the night he proposed. There are some very heartfelt moments here and a bit of a romance between Moore and the landscaper which is left a little vague, hinted at more like. I could have done without the brief attempts at humour i.e. the neighbourhood Grinch woman and the cowboy junkyard man. A beautiful ending here too which at first left me surprised -what, that's it? Because I was so engrossed in the story. But then when I thought about it I realized I didn't really need to see anymore. 12/22/14",
         "I love love love this movie. It's not the usual \"cheery Santa Claus Christmas movie\" It's a heartwarming classic! All the characters portrays the many different kinds of people there is that makes this world. I would watch this over and over. Hallmark has really done it this time with this awesome movie! It had laughter with the nosey-rosey high end neighbor, the cranky man, the lovable hospice nurse, and the bad-turn-good youth kid to the sheriff whom had a heart. I love love love this movie, I wish it never ended or a sequel to it. Such an awesome true love Christmas movie! Thank you Hallmark! Thank you to the awesome cast as well.",
         "Christmas In Conway is a made for TV drama starring Andy Garcia from The Godfather,Mary Louise Parker from Weeds,Riley Smith from New York Minute and Mandy Moore from A Walk To Remember and Disney's Tangled. The film chronicles on a man played by Garcia who's wife played by Parker is dying and she hasn't got much time left. Meanwhile a young girl called Natalie played by Moore is sent to help the man with his dying wife while he plans to built a Ferris wheel for her as Natalie is a nurse who helps Parker's charcther out of bed and feeds her. The story is quite similar to the 2002 film A Walk To Remember starring Moore as both Garcia and West built something for their dying partners; West with a Telescope,Garcia with a Ferris wheel. Two reasons why I checked this film out was because: 1. I'm a fan of Mandy Moore for 15 years now since 1999 when she was known as the bubbly blonde pop star back in the days and she also starred in my all time favourite movies Tangled and A Walk To Remember. 2. I like watching romantic films and dramas depending on the actual story that goes with them. Overall what did I think of it well it wasn't a bad film,not as good as Remember Sunday with Zachary Levi but still its a good movie to check out as I have seen it today for the first time. Its a 6 out of 10.",
         "I live 20 mins from Family Kingdom and it was the real Amusement Park, I agree with you that Moncks Corner is not a short drive from Myrtle Beach. Also I agree that the RiverWalk was not given justice, The RiverWalk is a pleasant place to visit and was obviously not the same one in the movie. With that said it was nice to see that South Carolina (Grandstrand) was the setting for a Christmas movie. I would rate the movie 9 from a scale for 1-10. I was saddened to see that all the details wasn't exact but movies are based in towns all across America and are obviously not filmed in the exact town there based on simply due to the fact for permits and etc.",
         "I enjoyed this movie but sadly I had one major major problem with it and it is kind of funny. Mary Louise Parker, the sick lady in the movie, funny enough she had the same role in Fried Green Tomatoes. Guess she is only good at one thing and also the bedroom setting was the same except for the big clock in fried green tomatoes. Please refrain from letting actresses know they are only good for one thing. Guess this is like being slotted in only one kind of role. Love Mary Louise Parker but honey I like you living..... Also I was hurt to know I can't post anything on this site if my spelling is correct. Guess we all go back to school a time or two. So for all you people that are like me and are not perfect, don't comment on movies here.",
         "The over-riding theme of this plot is terminal illness. Who wants to see such an ultra-depressing movie at Christmas...OR any other time of the year?? Movies are basically and primarily (supposed to be) entertainment. There is nothing entertaining about terminal illness. And NONE of this movie's inner messages could sugar-coat it...therefore, I found NOTHING up-lifting. It's depressing! Many folks, self included, know the intensely heartbreaking experience of loved ones who had a terminal illness and passed away. Some folks experienced losses of loved ones shortly before or on Christmas day, or shortly afterwards. Do we really need a movie like this to remind us of our heartbreak, especially around Christmas time? I assure you: definitely not! Watching this movie once, was MORE than enough for me! There is more than enough sadness in life...and.. I find this movie to be totally INSENSTIVE to the movie watchers, which, I believe, was made for the sake of the almighty dollar!"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Hallmark Hall of Fame Productions",
         "Rocket Science VFX"
      ],
      "summaries": ["To the folks in Conway, South Carolina, Duncan Mayor is a very cranky guy. To \"my sweet girl\" - his wife, Suzy - he's a doting pussycat. But Suzy is just home from the hospital and cared for 24/7 by nurse Natalie, whom Duncan tries his best to ignore. Duncan decides the best medicine Suzy could possibly have - and a Christmas present she'll never forget -- is a ride on a real Ferris wheel, set up in their own back yard. Why a Ferris wheel? Because it was while riding one many moons ago that Duncan asked Suzy to marry him. Where to find a 45-foot-high used Ferris wheel? Duncan strikes gold in an abandoned amusement park, presided over by a lonely ex-carnival worker -- Henry. Assembling the mechanical monstrosity is not exactly a one-man job. Duncan gets a crucial assist from Tommy, a former student of Suzy's, who is deeply in her debt. He's become a successful landscape designer after a troubled youth; it was Suzy who set him straight. Meanwhile, the neighbors are not amused; especially prim and proper Gayle Matthews. She's entered her garden in an upscale magazine's \"Christmas Showcase\" contest. The interest of the contest's judges witnessing the atrocity next door is more than Gayle can bear. Fortunately, her brother is the local sheriff - and there are zoning laws to prevent this kind of thing, aren't there?"],
      "budget": 0
   },
   "movielensId": 118115,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-12-01",
      "dvdReleaseDate": null,
      "directors": ["John Kent Harrison"],
      "runtime": 97,
      "movieId": 118115,
      "title": "Christmas in Conway",
      "mpaa": "",
      "actors": [
         "Andy García",
         "Mary-Louise Parker",
         "Mandy Moore",
         "Cheri Oteri",
         "Riley Smith",
         "Mark Jeffrey Miller"
      ],
      "imdbMovieId": "3072182",
      "originalTitle": "Christmas in Conway",
      "genres": [
         "Drama",
         "Romance",
         "TV Movie"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Duncan Mayor decides the perfect Christmas present for his beloved wife, Suzy, is a ride on a real Ferris wheel, set up in their very own back yard. As a young man, it was the perfect place for a wedding proposal. Now, years later, in order to relive the experience with his wife, Duncan will go to any length to make their fantasy become a reality.",
      "tmdbMovieId": 240820,
      "avgRating": 3.375,
      "releaseYear": "2013",
      "numRatings": 4,
      "posterPath": "/ojdFSIL8hJ3CvWJaa0xIo6cSiHd.jpg"
   }
}