{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "nightclub",
            "id": 2334
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "dance hall",
            "id": 186403
         }
      ],
      "imdb_id": "tt0021551",
      "video": false,
      "title": "The Widow From Chicago",
      "recommendations": [125736],
      "backdrop_path": "/wMs1NVVpud9HkQSaLCJmkXzNBZR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Polly Henderson, aka Polly Dorgan",
               "gender": 1,
               "credit_id": "52fe4bcdc3a36847f8214737",
               "name": "Alice White",
               "profile_path": "/ibMjpIrFGZfE9bp5FoZctkyfpX2.jpg",
               "id": 141753,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dominic",
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f821473b",
               "name": "Edward G. Robinson",
               "profile_path": "/af1aBRi4UccaxtmDPWEtlfy1vXE.jpg",
               "id": 13566,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Georgie 'Swifty' Dorgan",
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f821473f",
               "name": "Neil Hamilton",
               "profile_path": "/zbSm4kPqVZM2JB6ph7eQsZVsnQP.jpg",
               "id": 27733,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Slug O'Donnell",
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f8214743",
               "name": "Frank McHugh",
               "profile_path": "/oSBztLH3U3TctJnuJm0U9600fSq.jpg",
               "id": 74875,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Johnston (Credits) / Chris Johnson",
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f8214747",
               "name": "Lee Shumway",
               "profile_path": null,
               "id": 951965,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Mullins, Floor Manager",
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f821474b",
               "name": "Brooks Benedict",
               "profile_path": "/l3Bw5oBij94yG0QSO45inFnySRZ.jpg",
               "id": 115995,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Police Captain R.L. Davis",
               "gender": 0,
               "credit_id": "52fe4bcdc3a36847f821474f",
               "name": "E.H. Calvert",
               "profile_path": null,
               "id": 999884,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Helen",
               "gender": 0,
               "credit_id": "52fe4bcdc3a36847f8214753",
               "name": "Betty Francisco",
               "profile_path": "/btxXzJudfEYsR3dpO93rAD8xwJ4.jpg",
               "id": 1066900,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "James 'Jimmy' Henderson",
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f8214757",
               "name": "Harold Goodwin",
               "profile_path": "/B1BTmh9aBUqzHD9ePvxabhFL0H.jpg",
               "id": 80545,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Newsboy",
               "gender": 0,
               "credit_id": "539490ff0e0a266dca0045c3",
               "name": "Ernie Alexander",
               "profile_path": null,
               "id": 1186116,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Police Sergeant Jerry Dunn",
               "gender": 0,
               "credit_id": "539491110e0a266dc5004654",
               "name": "Allan Cavan",
               "profile_path": null,
               "id": 141029,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mazie",
               "gender": 1,
               "credit_id": "539491230e0a266dce0046fd",
               "name": "Anne Cornwall",
               "profile_path": "/oqisYzMA6Es2YNbJMFFCgIjhfw4.jpg",
               "id": 141304,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Dominic's Lookout at the Crystal Palace",
               "gender": 2,
               "credit_id": "5394913a0e0a266dce004703",
               "name": "Mike Donlin",
               "profile_path": "/1pTOSv269jklmgvP7wXHSwVmsk5.jpg",
               "id": 14425,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Detective T. Finnegan",
               "gender": 0,
               "credit_id": "5394916e0e0a266dc2004651",
               "name": "John Elliott",
               "profile_path": "/sPHFmyKeCbHwU6PI1DIy16XuxsM.jpg",
               "id": 123576,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Gossiping Irish Neighbor",
               "gender": 1,
               "credit_id": "539491810e0a266db400474c",
               "name": "Mary Foy",
               "profile_path": "/ilqtBK9tdx835v3hs1fqJWYESoD.jpg",
               "id": 1079576,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Johnson's Henchman",
               "gender": 2,
               "credit_id": "539491940e0a266dbf00467b",
               "name": "Al Hill",
               "profile_path": "/xX80Pn6KCWXi60kYiVFeFOE5thB.jpg",
               "id": 600741,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Patrolman",
               "gender": 0,
               "credit_id": "539491a60e0a266db4004750",
               "name": "Robert Homans",
               "profile_path": "/qgFVZf4Tl9GLNhTLgrEdSWeBbgY.jpg",
               "id": 95311,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Cora",
               "gender": 1,
               "credit_id": "539491b80e0a266dbf004680",
               "name": "Dorothy Mathews",
               "profile_path": "/tJucJZzRrsmgLxOj5lbS3sGPF4x.jpg",
               "id": 96054,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bcdc3a36847f8214733",
               "name": "Edward F. Cline",
               "profile_path": "/lkAs1ydjzF9SjDIXDFOx5VvCxjl.jpg",
               "id": 13953,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5823899ac3a3683308012dd7",
               "name": "Sol Polito",
               "profile_path": null,
               "id": 8714,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "582389a0c3a3683308012de0",
               "name": "Edward Schroeder",
               "profile_path": null,
               "id": 1031548,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "582389a69251410cae01157d",
               "name": "Anton Grot",
               "profile_path": null,
               "id": 32999,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "582389b1c3a3683304010d8d",
               "name": "Clifford A. Ruberg",
               "profile_path": null,
               "id": 1290385,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "582389bac3a36832fe00f8aa",
               "name": "Earl Baldwin",
               "profile_path": null,
               "id": 32994,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.380779,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 118134,
      "vote_count": 3,
      "budget": 0,
      "overview": "A woman infiltrates a criminal mob to avenge her brother's death.",
      "similar": [
         10651,
         4771,
         75780,
         984,
         9411,
         193893,
         11423,
         15069,
         20676,
         12150,
         96,
         186,
         949,
         189,
         807,
         320,
         1939,
         877,
         1923,
         25376
      ],
      "original_title": "The Widow From Chicago",
      "runtime": 64,
      "poster_path": "/3n166M8v2sdmvsdZwEfm7URJKJZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "First National Pictures",
         "id": 3245,
         "origin_country": ""
      }],
      "release_date": "1930-11-23",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "WIDOW STEALS GANGSTERS LOVE",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edward F. Cline"],
      "runtime": 64,
      "synopsis": null,
      "writers": [
         "Earl Baldwin",
         "Earl Baldwin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021551/",
      "coverLink": null,
      "actors": ["Stars: Alice White, Edward G. Robinson, Neil Hamilton | See full cast and crew »"],
      "reviews": [
         "Alice White stars in this 1930 crime drama that also boasts an early starring role for Edward G. Robinson. He plays a nightclub owner and bootlegger; she plays the widow. She shows up in his club looking for work and claiming to be the widow of a gangster (Neil Hamilton) who was killed when he jumped off a train in an attempt to escape the cops. In reality she's the sister of the cop who was tracking Hamilton. Now she's out to track down her brother's killer. Smart dialog and solid story here with White in a slightly different role. Although she masquerades as a floozie she's really a pretty smart cookie as she leads to police to her brother's killer. Although the setting is a nightclub, White does not do a musical number (perhaps cut from the final print?) as she usually does in her talkies. Although White was not an actress in the way Bette Davis or Joan Crawford were, she's got a great screen presence and holds her own here in scenes with the great Robinson. Hamilton is also solid as the undead gangster who returns to cause problems for White. Co-stars include Frank McHugh, Harold Goodwin (as the brother), Betty Francisco, Brooks Benedict, and Anne Cornwall and Dorothy Mathews as the dance hall babes. Worth a look.",
         "And I'll support that conclusion. However, I must preface my commentary by acceding to a predilection for Alice White's performances. I adore her no-apologies-for-pert, straight-ahead style that was the antithesis of 'real' actors who rolled their R's and eyes at every opportunity. We are introduced to Polly (Alice White) and Jimmy (Harold Goodwin) as new tenants by the neighbors' gossiping. Are they married? The question remains unanswered until just before Jimmy, the precinct's newbie detective, leaves for work. The clever script puts a smile on your face just as Jimmy waves at his sister, Polly from the street, and becomes a drive-by shooting victim. The scripts' powerful counterpoints and wit are enhanced by director Edward Cline's smart pacing and Sol Polito's brilliant photography. The avenging Polly, masquerades to mob boss Dominic (Edward G. Robinson) as the widow of a dead associate of the gang. But she becomes trapped in his office when the 'widow's husband returns from the dead. When Dominic goes out to meet him, we are left with a great insert of the edge of the office door. Slightly ajar, we watch it in anticipation while Dominic meets Polly's 'dead' husband. Will she make a break for it? Will Swifty confront her? Your mind races as the camera holds on that door. It's bravura filmmaking, and Cline keeps it coming. By the way, Polly embraces her 'husband' whispering \"go along, I'm on the spot\". The excitement's just beginning, Swifty is only too happy to go home with his 'wife'. Neil Hamilton handles his role as Swifty Dorgan with effective menace, and Polly goes from being on the spot in Dominic's office to being in a spot behind her own (now locked) door. Frank McHugh's got a fine bit as one of Dominic's hentchmen 'Slug', and advises his fellow thug, Mullins, to give up the girl he can't get along with. Slug's smugness melts, however, when Mullins returns the girl's key only to discover the key is to Slug's girlfriend's apartment. Earl Baldwin's script has plenty of sparks left, and Polito takes the shootout in the dark to a new level when a spotlight is introduced: not only being shot at, but everything its prowling eye touches gets killed. You'll wonder why Little Caesar is famous after seeing this terrific gangster film.",
         "A clever crime movie in which a woman seeks to put a mob boss behind bars for killing her brother, who was a cop. Polly gets inside Dominic's circle by posing as Swifty's wife, but when the real Swifty shows up things get interesting, and very unpredictable. Polly's brother was killed for impersonating Swifty, so now she is impersonating Swifty's wife for revenge. An entertaining movie that has humorous points and look out for an unusual place to see a SWATSTICKER, years before Hilter's rise.",
         "The primary reason to watch this movie is to see Edward G. Robinson's first time playing a gangster ( Dominic) at Warner Brothers. Robinson had that role down pat ( this was his fourth time he played a mob boss). The biggest problem is the main star Alice White ( Polly Henderson). The problem is although Polly is beautiful to look at, she is far too lightweight to be in a gangster movie ( as is her future love interest 'Swifty' Dorgan Neil Hamilton (best known as Perry White on the 'Superman' a TV Series)). The story involves Polly pretending to be the 'Widow' of Hamilton in order to find out who murdered her policeman brother., who was pretending to be Hamilton ( who he believed died from a leap into the East River). Of course, the problem happens when ( spoilers ahead) he survived and found out about his \"Widow.\" Of course, she succeeds and tricks Robinson into confessing to the murder on the phone while the cops listen. Of course, 'Swifty' saves her from Dominic, and as Dominic says \"Invite me to the wedding, but make it fast, because I am afraid, I will not be around for awhile.\" Which inspires 'Swifty to pop the question. One other thing about the movie is movie ( probably sung by Alice White), that were cut from the movie ( as a gangster film fan ( and hater of musicals) that was a good thing). Basically this movie shows clearly the rise of Robinson and harder edge movies and the end of Alice White's fluff. 8 of 10 stars.",
         "Ruthless gangster Dominic (Edward G. Robinson) bumps off a young detective impersonating Swifty Dorgan. The detective's sister (Alice White) sets out to get revenge. She passes herself off as Swifty's wife in order to infiltrate the gang. But then the real Swifty (Neil Hamilton) shows up. Pre-Little Caesar gangster movie for Robinson, his first at Warner Bros. Also very early role for Frank McHugh, who already seems to be perfecting his screen persona. Alice White is pretty bad. She says every line the same way, regardless of what emotion she's supposed to be displaying. It's an early talkie so there's the expected amount of creakiness. Watchable, particularly for Robinson fans, but nothing special. Believe it or not, this was originally a musical!",
         "I often wondered whatever happened to Alice White, one minute she was the top cutie, the next she had barely any lines in \"Murder at Midnight\". Then I read where she was causing all sorts of difficulties at First National, being a demanding diva, so when Warner Bros. took control she was quietly shown the door. She did make a comeback playing typical pre-code babes but in her hey day she was everything the public wanted in a movie cutie. Not only did she have the rare privilege of being billed above Edward G. Robinson, she had the rarer distinction of being probably the only person who could make a joke about his lack of height, laugh and get away with it. It all happened in \"The Widow From Chicago\". Things may have happened for Robinson immediately after this but for now Alice was the star. This is a snappy little movie, Edward G. Robinson is as intense and gives 100% as usual but Alice White and Neil Hamilton have great chemistry and keep the mood light. When Polly's policeman brother is killed trying to impersonate \"Swifty\" Dorgan, who was last seen jumping into the East River and is presumed dead, Polly becomes \"the widow from Chicago\" and tries to infiltrate Dominic's (Robinson) empire. The fun starts when \"Swifty\" (Hamilton) returns from the dead and finds his \"wife\", much to his surprise is \"Palpitating Polly\" a dance hall hostess working in Dominic's Crystal Palace Club. He plays along with it - Polly is palpitatingly cute enough to make every man's heart flutter, including Dominic's. Being a pre-coder the wise cracks fall thick and fast - \"I'm going to give her a piece of my mind - don't do it, you can't spare it\" and \"I don't think I recognise her - you ought to you got a good look\"!!! But it is surprisingly tame on risqué business - Alice isn't seen in her underwear once!!! There is a scene where \"Swifty\" tries to impose his husbandly duties (Hamilton is so cute) but Polly isn't having any of that - then \"Swifty\" spies his missing grip and realises Polly is more than just a pretty face!!! Understandably Robinson is the dominant player, it was only a small stepping stone from Dominic to Rico, all the intensity and mannerisms are there. In this movie he plays a beer baron who is all set to send Polly over to a rival club, whose manager will not buy his \"poison\", and set up a murder when her dear, departed \"Swifty\" shows up. By the time \"Swifty\" is sent over to the club posing as a waiter, Polly, who has learned to care about him, follows him and proves she has the guts and smarts to become either an ace reporter or even a police commissioner!! The thrilling climax has Polly using her big brown eyes to convince Dominic he is the one for her and with the phone off the hook by the aid of a matchstick, the police can all listen in as Dominic confesses to several murders. Robinson was far more relaxed and camera easy than he was in \"The Hole in the Wall\" and 1930 gave him a variety of roles, including a couple of gangsters, an Italian immigrant and an Oriental. After \"The Widow From Chicago\" he returned to Broadway for \"Mr. Samuel\" and after it folded he traveled to Hollywood for \"Little Caesar\" and didn't return to the stage for over 20 years. Mistake Alert - There is a poster advertising \"Palpitating Polly\" at the club long before Polly even seeks employment there.",
         "Widow from Chicago, The (1930) ** (out of 4) Early gangster film from Warner has Alice White playing Polly Henderson, a woman who sees her brother get gunned down by a bunch of thugs. The woman pretends to be the widow of another gangster who is presumed dead and she crashes in on thug Dominic (Edward G. Robinson) to try and find out who killed her brother. THE WIDOW FROM CHICAGO is a fairly entertaining film that's going to mainly play to those who want to see Robinson in the role of a gangster a year before he became a star with LITTLE CAESAR. There's really nothing to compare in terms of the two performances as it's clear Robinson was still trying to find it acting chops. He's certainly good here but it's easy to see why this film didn't make him a star. It should go without saying but there's very little going on with the screenplay other than a few twists and turns that most viewers are going to pick up on long before they happen. The screenplay itself is pretty silly as there are all sorts of wacky things that happen including the entire bit with the real gangster (Neil Hamilton) who's supposed to be dead showing back up and throwing a wrench in the plans of White. The twist in what happens to Robinson is downright silly and so far-fetched that you almost have to laugh at it. As for White, she's certainly not in the same league as the legends from this era and while her performance is far less from what I'd consider good, there's no doubt that she has a presence on the screen. Her and Robinson do fine work together and certainly help the weak material. The supporting cast offers up Frank McHugh playing the comic bit but he doesn't get a chance to do too much. In the end this is a pretty forgettable film but the addition of Robinson makes it worth viewing for fans of his or the genre.",
         "Before his breakout role in Little Caesar Edward G. Robinson gets some practice in as a thug nightclub owner in The Widow from Chicago. Featuring the limited Alice White in the lead Robinson has little trouble in garnering all the attention in this mediocre crime pic. Polly Henderson's policeman brother is murdered while working undercover. She swears to get the man behind his murder and goes undercover herself as the wife of a supposedly dead mobster. Getting a job at Domenic's club she begins to make headway when the faux widow's husband turns up breathing. Whites high pitched squeal of a voice and cutesy mannerisms are cloying within the first reel leaving it up to Murray Hamilton and Robinson to inject the proceedings with a feeling of dead seriousness which Edward G does with aplomb in a supporting sporting role. In it you see the first vestiges of the cock sure Rico, a touch less subdued but every bit imposing. But with White occupying most of the screen time The Widow from Chicago deserves no sympathy.",
         "Polly (Alice White) infiltrates a group of gangsters headed by Dominic (Edward G Robinson) in order to find out who killed her brother Jimmy (Harold Goodwin). The plot develops at a pace which just about allows you to keep up with the story. It's a bit complicated at the beginning but things fall into place so keep watching. Alice White is super cute and likable but I'm not convinced about her ability to survive in the underground world. She'd be dead if she wasn't mixing with lightweights such as Neil Hamilton who plays \"Swifty\". It comes as a surprise when she ruthlessly shoots a policeman although there is a twist that runs alongside this. Another lightweight is Harold Goodwin - the film gets off to a good start when he gets shot. Overall, this film holds an interest but it is nothing special.",
         "Edward G. Robinson and Alice White star in this early Warner Bros. gangster flick. White is the sister of a murdered policeman, and she sets out to find her brother's killer by impersonating the widow of a dead gangster and cozying up to Robinson, a rackets boss. There are even more complications in this, frankly, badly directed film (Edward F. Cline fared much better as a comedy director at Universal later in his career), several of the supporting performances are either weak or hammy, the film tends to meander and has quite a few dead spots, but Robinson and the unjustly neglected (and very sexy) Alice White do quite well despite the convoluted plot. It's main interest is as a precursor to the classic WB '30s gangster films, and you can see the famous Warners style emerging. It's just a pity that the film itself is so mediocre. It's worth a look to see where Warners was going with the gangster genre, and you can see a lot of Joan Blondell in the vivacious Alice White, but other than that, it's nothing really special, and doesn't hold a candle to Robinson's later work in \"Little Caesar\" and \"Smart Money,\" which came out a year later."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["First National Pictures"],
      "summaries": ["Vice lord Dominic has brought Swifty Dorgan east to do a job for him. When Swifty appears to have died falling from a train, detective Henderson impersonates him hoping to get into the mob. When he's killed his sister Polly poses as Swifty's widow and gets a singing job at Dominic's nightclub. Then the real Swifty shows up."],
      "budget": 0
   },
   "movielensId": 118774,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1930-11-23",
      "dvdReleaseDate": null,
      "directors": ["Edward F. Cline"],
      "runtime": 64,
      "movieId": 118774,
      "title": "The Widow From Chicago",
      "mpaa": "",
      "actors": [
         "Alice White",
         "Edward G. Robinson",
         "Neil Hamilton",
         "Frank McHugh",
         "Lee Shumway",
         "Brooks Benedict",
         "E.H. Calvert",
         "Betty Francisco",
         "Harold Goodwin",
         "Ernie Alexander",
         "Allan Cavan",
         "Anne Cornwall",
         "Mike Donlin",
         "John Elliott",
         "Mary Foy",
         "Al Hill",
         "Robert Homans",
         "Dorothy Mathews"
      ],
      "imdbMovieId": "0021551",
      "originalTitle": "The Widow From Chicago",
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman infiltrates a criminal mob to avenge her brother's death.",
      "tmdbMovieId": 118134,
      "avgRating": 4,
      "releaseYear": "1930",
      "numRatings": 1,
      "posterPath": "/3n166M8v2sdmvsdZwEfm7URJKJZ.jpg"
   }
}