{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sexploitation",
            "id": 10053
         },
         {
            "name": "erotic movie",
            "id": 190370
         }
      ],
      "imdb_id": "tt0062385",
      "video": false,
      "title": "The Touch of Her Flesh",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Janet",
               "gender": 0,
               "credit_id": "54845e5cc3a3685d0b000526",
               "name": "Suzanne Marre",
               "profile_path": null,
               "id": 1395828,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Claudia Jennings",
               "gender": 0,
               "credit_id": "54845e8692514168c70005be",
               "name": "Angelique",
               "profile_path": null,
               "id": 1395829,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Richard Jennings (as Robert West)",
               "gender": 0,
               "credit_id": "54845e96c3a3685d0b00052f",
               "name": "Michael Findlay",
               "profile_path": null,
               "id": 236380,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Go Go Dancer",
               "gender": 0,
               "credit_id": "54845eb4c3a3685d05000570",
               "name": "Vivian Del Rio",
               "profile_path": null,
               "id": 1395830,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Hooker",
               "gender": 1,
               "credit_id": "54845ec6c3a3685d15000603",
               "name": "Peggy Steffans",
               "profile_path": null,
               "id": 103201,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "58456cd7c3a3684903001de8",
               "name": "Sally Farb",
               "profile_path": null,
               "id": 1718597,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Steve",
               "gender": 0,
               "credit_id": "58e66c4ec3a36872ee044a86",
               "name": "Ron Skideri",
               "profile_path": null,
               "id": 1718720,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Claudia Jennings (voice) / Credits Girl / Dream Girl (uncredited)",
               "gender": 1,
               "credit_id": "58e66c70925141354c003f04",
               "name": "Roberta Findlay",
               "profile_path": "/rljIPC31LvhSt50NjXMfNlDFKAN.jpg",
               "id": 1114201,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a69c3a368484e151af1",
               "name": "Michael Findlay",
               "profile_path": null,
               "id": 236380,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54845eebc3a3685d0e000572",
               "name": "Michael Findlay",
               "profile_path": null,
               "id": 236380,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54845f0292514168bf000586",
               "name": "Michael Findlay",
               "profile_path": null,
               "id": 236380,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54845f14c3a3685d03000558",
               "name": "Roberta Findlay",
               "profile_path": "/rljIPC31LvhSt50NjXMfNlDFKAN.jpg",
               "id": 1114201,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "54845f27c3a3685d11000581",
               "name": "Roberta Findlay",
               "profile_path": "/rljIPC31LvhSt50NjXMfNlDFKAN.jpg",
               "id": 1114201,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "54845f3e92514168c50005ef",
               "name": "Roberta Findlay",
               "profile_path": "/rljIPC31LvhSt50NjXMfNlDFKAN.jpg",
               "id": 1114201,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54845f5192514168d2000530",
               "name": "Michael Findlay",
               "profile_path": null,
               "id": 236380,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58e66c8e92514127ec045b33",
               "name": "Roberta Findlay",
               "profile_path": "/rljIPC31LvhSt50NjXMfNlDFKAN.jpg",
               "id": 1114201,
               "department": "Lighting",
               "job": "Lighting Technician"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.546711,
      "production_countries": [],
      "id": 121620,
      "vote_count": 3,
      "budget": 0,
      "overview": "A distraught weapons dealer is involved in an automobile accident after catching his stripper wife in bed with another man. Upon recovering, he goes on a killing spree, bumping off exotic dancers and hookers while plotting revenge on his wife.",
      "similar": [
         50124,
         80752,
         28468,
         27066,
         17654,
         81774,
         86331,
         341174,
         44214,
         1690,
         979,
         2057,
         263472,
         2770,
         106646,
         112160,
         4995,
         27,
         88,
         122081
      ],
      "original_title": "The Touch of Her Flesh",
      "runtime": 78,
      "poster_path": "/bfQ9o47JF5Zn0C2V2PM9ZSLtfON.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1967-04-19",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Michael Findlay"],
      "runtime": 78,
      "synopsis": null,
      "writers": ["Michael Findlay"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0062385/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTA0NjIwODgxMTleQTJeQWpwZ15BbWU3MDY2MDU4MTE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Suzanne Marre",
         "Angelique Pettyjohn",
         "Michael Findlay"
      ],
      "reviews": [
         "Roberta and Michael Findlay are mostly known for the infamous \"Snuff\" (with fake snuff scenes). \"Touch..\" is the first in the Flesh triology and it's kinda hard to describe. Richard (Michael Findlay) discovers that his wife is cheatin' on him, he then gets run over by a car and becomes a psychokiller who goes on a rampage murdering strippers etc. with different kinds of tools. The film's \"plot\" is women getting naked and then being killed. It's a bit better than your average Doris Wishman-movie and is kinda of fascinating in a twisted sort of way but defintely not for everyone. The other films in the series follow the same \"ideas\". On the positive side, there some goodlooking naked women and some good soul/R&B tunes. Something Weird Video carries all three b/w Flesh \"epics\" (\"Curse of...\", \"Kiss of...\").",
         "SPOILERS INCLUDED Of all the Sixties exploiteers Michael Findlay had the reputation for holding nothing back. Although for years primarily known for Seventies horror movies like the bulk of Snuff or the Yeti themed Shriek of the Mutilated- for a look at the man at the height of his powers those time machines have to be set for New York City at the end of the dirty Sixties. Findlay's notoriety began with a trilogy of movies shot between 1967 and 1969- The Touch of Her Flesh, The Curse of Her Flesh and The Kiss of Her Flesh. This- the opening chapter- introduces us to Richard Jennings (Robert West aka Findlay) a stuffy suit and tie man with an unhealthy obsession for firearms and knifes. Jennings is married to Claudia (Anna Riva aka Roberta Findlay) who is cheating on him with off Broadway actor Steve (John Amero) 'with all those weapons he could be a real lady-killer' ponders the object of Claudia's affections. When Jennings cuts home early on the way to a weapons convention he gets an eyeful of the couple making lurve. Hurt, Jennings maniacally flees from the apartment and is hit by a car- losing an eye and being temporary paralysed for his troubles. Now bitter and wheelchair bound Jennings drunkenly stares into space, planning his revenge on womankind. He delivers a poisoned rose to a stripper, then from the back of a disco, sweats it out, voyeuristically watching on with his one eye as the stripper goes down for the count to the tune of 'I've got the right kind of lovin', baby just for you'. Jennings then wheels himself to a burlesque house and executes an even more audacious killing- murdering a stripper on stage by using a blowpipe which he's discreetly smuggled in under his coat. Fearing Richard's wrath Claudia has hidden away with Janet a nude model in a woodwork factory. When the 'pig that poses nude for Claudia' is spotted chatting to a prostitute, Richard poses as a potential john for the hooker. Literally pushed back to her bedsit Jennings takes to torturing the truth about Claudia's whereabouts out of her 'I'm not afraid to hurt you, very badly'. She spills the beans but Jennings is so completely off the rails by this point that he messily stabs her to death anyway. Now fully mobile Jennings decides to pay a visit to his wife and her buxom friend. By the pictures end Jennings is tearing his wife's clothes off 'let me feel them before they die' and victoriously decapitates her with a bandsaw, but any further efforts to make the world a safer place for misogynists are terminated.... for now. Touch retains a raw power even today, but for a world where a few years previous frolics in nudist camps had been the norm- this must have been the celluloid equivalent of an almighty slap in the face. For the record, the real Michael Findlay is described as a sensitive, sweet person who for his films played out every dark idea he ever had and projected them on the big screen. Jennings transformation from businessman respectability to unkept, eyepatch wearing sex psycho amazes still, and the character seemed to have a profound effect on Findlay as well. Later he would use Richard Jennings as a pseudonym alterego in his films and as late as 1976's Virgins in Heat references to the ubiquitous Mr Jennings lurk in the background. By the mid Seventies Findlay's career was joyriding in all directions, associated with drive-in horror films like Invasion of the Blood Farmers- Findlay was also a 3-D enthusiast and became involved in a revival of the faded gimmick, it didn't work but he did get to fly to Hong Kong and supervise Kung- Fu films. Back in New York, he also followed his (then separated from) wife Roberta into hard-core including a 3-D epic called Funk. With so many tricks up his sleeve its hard to know what Findlay would have pulled out next, plans were ahead for an all out horror film a-la The Last House on the Left, but time was against him. In May 1977 Findlay made a fateful trip to the Pan Am building in New York, the rest is grim history. Viewed chronologically, there is an almost competitive streak to Findlay's films- in that much fun seems to have been had by creating sex and death scenarios even more outrageous than the last film. By the end of the Sixties Findlay had perfected his act with a near faultless sense of shock value. The 'Of Her Flesh' series particularly Touch are urban in tone, so vividly set against a New York backdrop that they are frozen in time shots of the Big Apple in its rotten 60's prime. Touch is so awash with burlesque houses, menacing neon lights and grotty hookers hotel rooms that no director really deserves to be forever tied to that era than Findlay does. For years his films were as notorious as they were little seen, both elements speculatively fuelling each other. In the late- eighties the 'Of Her Flesh' pictures emerged on murky bootlegs mostly run off directly from well projected prints- the rest of the oeuvre was in limbo. Now as we enter a new millenium most of the highpoints of the Findlay back catalogue have resurfaced giving a definite insight into the era in which Findlay defined sleaze. Sadly with Findlay and the times and places he inhabited long gone, its really all there is left. Adios Richard Jennings.",
         "Possible minor spoilers. First came the nudies--harmless fluff flicks with the cast bouncing around in various stages of undress. Then came the roughies--rape, dominations, whippings, BD/SM. And then...there were the ghoulies. And no one did the ghoulies better than Michael and Roberta Findlay, the all-time king and queen of the New York grindhouse circuit. I must say that this Flesh surprised me. I expected some shaky, cheap-thrill blood-guts-and-boobs epic...and I got a surprisingly professional, highly personal endeavor that comes dangerously close to the realm of Art. I am not kidding! Michael is Richard Jennings, a middle-class man with the archetypal Madonna-whore complex. When his wife turns out to be the latter, crippled Richard seeks vengeance against the sex industry and the women who populate it; viewed today, it eerily predicts how Bully Boy would destroy much of the vibrant, seedy world that allowed for the creation of this film. In a fantastic psychedelic discotheque sequence, a cute black go-go girl receives a poison rose and after some lengthy topless gyrations (go-go fans take note), drops dead in mid-freakout. A stripper slithers around in what turns out to be her last show. But the ultimate target is unfaithful wife Claudia (Claudia Jennings? Is this where the drive-in queen got her inspiration?), a busty blonde dubbed in Roberta's distinctive New Yawk tones. This is a steamy, seamy walk on the wild side from the people who did it best. Michael (as Robert West) turns in an excellent performance as the star psycho. The dialogue is minimal and dubbed (quite well in Richard's case); some of it is very funny--\"My dear Claudia! Let me see those breasts of yours! Those breasts that he was fondling!\" With a little gore, plenty of female skin, and an atmosphere thick with gritty vitality. Sadly, the film is a time capsule of a by-gone era. The Findlays are gone now (Michael has passed on, may he rest in peace; Roberta has disappeared from sight); the seedy vitality of Times Square has been replaced by soulless corporate fiberglass. If your mindset is outside the mainstream...if you think that sleaze is not necessarily a bad thing...you owe it to yourself to see this hour of monochrome madness. We miss you, Mike.",
         "Roberta and Mike Findlay made over a dozen nudie/sickie/roughies in the 60s and early 70s, culminating with SNUFF in the late 70s. Of all those films, the FLESH trilogy is the most memorable. TOUCH OF HER FLESH, CURSE OF HER FLESH, and KISS OF HER FLESH were three sickie classics starring Robert West as Richard Jennings, a one-eyed psycho who kills strippers in sadistic ways. This was his beginning and is a tad boring, but pays off. Richard Jennings witnesses his wife having sex with another man and runs into traffic. Losing one eye and temporarily paralyzed from the waist down, Richard vows his vengeance and vents his frustration while searching for his wife by killing strippers in inventive ways. He sends one a rose with thorns dipped in poison, shoots a poison dart into the stomach of another, and by the finale, a dagger, a buzzsaw, and a crossbow fit into the whole mess. TOUCH OF HER FLESH is really sick. First the audience is treated to coy sex scenes and stripping/go-go scenes, followed immediately by scenes of death and gore. I guess that's why they call them sickies. All the acting is bad, but most of the women would fit right in a Russ Meyer film! Top-heavy tarts make up most of the nudity here, which is pleasing to the eye and sort of differentiates this from other films of its kind. There are some good instances of cinematography and editing that are above par in an exploitation film as well. TOUCH OF HER FLESH is not for everyone and will probably offend those looking for a softcore sex film from the 60s. The version I saw was cut, as the film only ran an hour (original running time is 70 minutes), but the sex was not graphic; it's the gore that should draw audiences. Sadistic viewers should enjoy it, but I'm surprised cries of misogyny haven't plagued this film from its release! Not heartily recommended, but is worth a look if you're curious. And you should be if you're reading a review of this!",
         "The perfect ten rating I gave this film has nothing to do with its technical merits. It's not a particularly well-written film at all. The acting, for the most part, is wooden (with one BIG exception). The music is strictly canned library music. But it's still at ten. It's a ten because, as a cinematic experience, there is nothing else quite like watching the work of Michael and Roberta Findlay. Nothing else compares. And if the goal of cinema is to take you into another world, this is the film that will do it, albeit a sick, claustrophobic, dirty one which will leave you drained and in desperate need for a shower. Other reviews cover the plot of this film sufficiently. What I'd like to focus on is the way this movie feels. Like other low-budget but truly inspired masterpieces - \"Last House on Dead End Street\" comes to mind as the perfect example - this film's technical flaws add to its creepiness. This film has no gloss with which to reassure us, and its starkness makes it that much more compelling. The standout performance I mentioned at the outset of this review is, of course, that of Michael Findlay. The fact that he stars in this film is no coincidence. In fact, nobody else could have done it, since what we're seeing in this film - as in most of the Findlay collaborations - is a very, very personal vision, a celluloid representation of the dark demons haunting one man's mind. While no one is suggesting that Findlay was anything like the obsessed monster of a man he portrays on the screen here - there is much evidence to the contrary, in fact - there isn't any doubt that Findlay wasn't exorcising demons from his own psyche with these films, which, for me, is what makes them so compelling. On screen, Findlay's hammy, bloated performances would be laughable if you didn't know you were watching someone acting out of the depths of his mind, which makes them both disturbing and compelling at the same time. An interesting experiment in watching these films is to compare it to similar, contemporary films, such as \"Saw.\" While the violence in the latter movie is much more graphic, there's an intensity in Findlay's work which it can't even come close to. I say all these things only to the special few with the capacity to digest film this way, and I don't expect that to be a particularly large group. You know who you are. And you'll see this film for what it is.",
         "Michael Findlay and his wife Roberta were responsible for quite a few cult classics of sleaze in the 60s and 70s, and \"The Touch Of Her Flesh\" is one of the films that earned the couple their cult-status amongst lovers of sleazy Grindhouse cinema. This is a film that is recommendable to my fellow fans of cult-sleaze for a pioneering character. As probably many other Exploitation fans out there, however, I must say that my admiration of this film, and my acknowledgment of its pioneering cult character exceeds the actual fun that I had watching it. It is definitely entertaining to watch, but then again, the long scenes of women dancing seductively etc. may have been sleazy and exciting then, but they are quite dated and overlong for today's standards, especially due to the fact that these sequences are very tame compared to what was to come in the 70s. This is also what is to acknowledge about this film however as it is pioneering in its sleaze and weirdness. There is little talking, or, more precisely, dubbing, as people never look at the camera when they talk, which is quite annoying at times. I know this from a bunch of older films, but this is definitely the only film from the late 60s I've seen, that still uses this form of dubbing, which really needs getting used to. Nothing but the low budget can take the blame for that, however. After catching his catching his exotic dancer girlfriend with another man, a troubled arms dealer gets involved in an accident. Reciovering from his heavy injuries, the man has become a psychopath on the hunt for sexy women to murder... This is the first part in a trilogy of \"Flesh\" films. I have yet to see the sequels \"The Kiss Of Her Flesh\" and \"The Curse Of Her Flesh\", and Ia am exited to do so, as I have big respect for this little cult flick, and I highly recommend any lover of Exploitation cinema to see it. People who are not as familiar with exploitation cinema will probably find it crappy, since one has to perceive this film's pioneering character in order to acknowledge it adequately. The film has more than just a sentimental value of originality, however. Director Michael Findlay also stars in the role of psycho Richard Jennings, and the guy's craziness is very entertaining to watch. Female eye candy is also omnipresent throughout the film. It is interesting to see how beauty trends change, as \"The Touch Of Her Flesh\" concentrates on the display of big breasts and buxom curves. This is not a movie I'd recommend to everybody, but I strongly advise my fellow fans of sleazy Grindhouse cult not to miss it. This is pure cult cinema, and for Exploitation fans like myself it has a certain value as a pioneering classic of weird sleaze. Be warned though: it tends to bore.",
         "Well, a-hem! ... This was my first introduction to the gritty works of husband and wife sleazemeisters Michael and Roberta Findlay, and it was quite an experience, let me tell you! This is about as far removed from our recent PC World as you can get! This was the first of a sexploitation trilogy of \"FLESH\" films that proceeded to get more and more violent, perverted and misogynistic with each filthy installment. That means they became more and more entertaining as they went along and, needless to say, this series is an absolute MUST for those men who enjoy raunchy grindhouse kicks, or men who just don't like women (and also for those of us who do, if you know what I mean). Things get a little confusing to start off with... For TOUCH, Michael Findlay directed (as \"Julian Marsh\") and starred as Richard Jennings, the world's first super-maniac, acting under the moniker of \"Robert West\" (but too bad he's not as interesting an actor as he is a filmmaker). His wife Roberta went by the pseudonym of \"Anna Riva\". The story deals with the anger and hatred a mild-mannered husband starts to feel for women after he finds his no-good wife screwing around in bed with another man. Running into the New York streets in a daze, he is struck by a car and loses one eye (which seems to alternately get healed and blinded again from scene to scene throughout the three movies) and also gets temporarily paralyzed. He becomes confined to a wheelchair and turns into a nutcase with an ax to grind - first against every stripper/hooker/go-go dancer he can find, and then ultimately against any member of the female race - PERIOD. There are many nude lovelies to gawk at during the 75 minute running time, and some rather inventive murder techniques for the times. But even with all the slime there is to savor here, I tended to feel that after getting off to a strong start, the pacing lagged too often with this first go-round. Things were to improve twice more, beginning with the first \"sequel\" in this chauvinistic series, THE CURSE OF HER FLESH. ** out of ****",
         "THE TOUCH OF HER FLESH is a typical cheap and sleazy sexploitation film from the US of A. This one's black and white, like the rest, and very cheap in terms of staging. However, it's also better-plotted than expected, with a storyline involving a guy who finds his wife in bed with another man, causing him to have a car accident and then become a psycho and going on a murder spree. This film reminded me of the work of H.G. Mikels in places but the genuine plotting is outweighed by the endless strip routines and bedroom small-talk. As ever, the version available on Amazon Prime is heavily censored.",
         "Touch of Her Flesh, The (1967) * (out of 4) Richard Jennings (Michael Findlay) catches his wife in bed with another guy so he runs out of the house only to be hit by a car. Now, confined to a wheelchair, he decides to take revenge on any hooker/stripper he comes across. One of the first \"slashers\", this NYC cheapie might be one of the first of its kind but that doesn't make it a good movie. Like most of these films, the biggest problem is the fact that we've got 20-minutes worth of story and then 50-minutes worth of pointless and boring strip scenes. To me, that's why short films are often a lot better than trying to push something that isn't there into the feature category. Wall to wall nudity can't save this one. The first film in the \"Flesh\" trilogy. Curse of Her Flesh, The (1968) ** (out of 4) Second in the \"Flesh Trilogy\" has Richard Jennings (Michael Findlay) returning, stalking the streets for more women to kill. The bigger budget adds some better production values and the cinematography is pretty good here. The jazz music score helps move things along and Findlay does a better job with the story structure. However, there's still way too much dead space to be fully entertaining. Kiss of Her Flesh, The (1968) * 1/2 (out of 4) Thankfully the final film in director Michael Findlay's Flesh trilogy. Once again the psycho killer stalks the streets looking for women to kill. Boring on all accounts, as is the entire trilogy. These three films could have been edited down and together into a twenty minute movie and they'd still be slow and dull.",
         "Weapons expert Richard Jennings (a creepy portrayal by writer/director Michael Findlay) catches his faithless wife Claudia (voluptuous eyeful Angelique) in bed with another man. Jennings blows a mental gasket and embarks on a vicious misogynistic killing spree in which he tortures and murders all women that he deems to be irredeemable scarlet harlots. The almighty sleaze cinema duo of Michael and Roberta Findlay come through with an on the money unremittingly harsh and scummy aesthetic: Plentiful tasty distaff nudity, steamy soft-core sex, buxom go-go gals shaking their stuff on stage (cue the fantastic R&B tune \"(I Got) The Right Kind of Love\"), lots of great footage of 60's New York City in all its seedy splendor (the scenes at the Port Authority Bus Terminal in particular are absolute gold; bet that stuff was shot sans permits!), a dazzling array of trashy underwear, and jolting moments of sadistic violence that pack one hell of a wicked punch (a beheading by buzz saw rates as a definite brutal highlight). The stark black and white cinematography provides a cool noir look. The deliberate pacing proves to be oddly hypnotic. Noted soft-core auteur Joe Sarno's fetching brunette wife Peggy Steffans is memorably sexy as a hooker victim. Best of all, the whole rough'n'ready upfront style of this fabulously fetid flick gives it an extra seamy (and discomfiting) edge. Essential viewing for hardcore grindhouse movie aficionados.",
         "If you would look up the term \"misogyny\" in the dictionary, there's a fair chance there will be a poster image of this little movie next to it. The DVD box describes this film as one of the most shameless, sordid and sleaziest exploitation movies of the sixties, and also one of the most inexplicably profitable ones. Apparently \"Touch of her Flesh\" was a huge success in the so-called Grindhouse circuit and almost promptly \u0096 within just one year \u0096 spawned two similarly titled sequels. Well, all these aforementioned things may be true but the reputation should also include that \"Touch of her Flesh\" is dreadfully boring and contains an impossibly high amount of insufferable padding sequences. Richard Jennings, a dork with a passion for weapons, walks in on his wife having sex (well \u0085 more of a breasts-fondling marathon, really) with another guy, runs out of the house whiningly and bumps into a car. Short one eye but with a hatred towards women that keeps increasing, he goes out to kill random girls that use their luscious bodies to seduce poor and defenseless men. His victims include a go-go dancer, a prostitute and a nude model before going after his own unfaithful wife again. Admittedly this sounds pretty horrific and like the ideal sexploitation guff, but unfortunately the actual murders take less than a seconds whereas the \"preludes\" seem to last forever! Okay, granted, these girls are pretty hot and they all have sensational racks, but watching them swing around for ten whole minutes is just plain dull. Jennings' monologues are what make this a true 60's sick-flick, as he compares women with everything that is filthy, unreliable and scum. \"Touch of her Flesh\", as well as its two sequels, is the work of the notorious director's due (and married couple) Michael and Roberta Findley. Together, they made a lot of infamous but overall terrible exploitation flicks. Ironically enough, Roberta delivered her best work (\"Tenement: Game of Survival\", \"The Oracle\") after her hubbie died in a helicopter crash"
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Rivamarsh"],
      "summaries": ["A distraught weapons dealer is involved in an automobile accident after catching his stripper wife in bed with another man. Upon recovering, he goes on a killing spree, bumping off exotic dancers and hookers while plotting revenge on his wife."],
      "budget": 0
   },
   "movielensId": 118848,
   "movielens": {
      "languages": [""],
      "releaseDate": "1967-04-19",
      "dvdReleaseDate": null,
      "directors": ["Michael Findlay"],
      "runtime": 78,
      "movieId": 118848,
      "title": "The Touch of Her Flesh",
      "mpaa": "",
      "actors": [
         "Suzanne Marre",
         "Angelique",
         "Michael Findlay",
         "Vivian Del Rio",
         "Peggy Steffans",
         "Sally Farb",
         "Ron Skideri",
         "Roberta Findlay"
      ],
      "imdbMovieId": "0062385",
      "originalTitle": "The Touch of Her Flesh",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A distraught weapons dealer is involved in an automobile accident after catching his stripper wife in bed with another man. Upon recovering, he goes on a killing spree, bumping off exotic dancers and hookers while plotting revenge on his wife.",
      "tmdbMovieId": 121620,
      "avgRating": 3,
      "releaseYear": "1967",
      "numRatings": 2,
      "posterPath": "/bfQ9o47JF5Zn0C2V2PM9ZSLtfON.jpg"
   }
}