{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0272950",
      "video": false,
      "title": "The Zombie Chronicles",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Ebenezer Jackson",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e057897",
               "name": "Joseph Haggerty",
               "profile_path": null,
               "id": 98870,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Marsha",
               "gender": 1,
               "credit_id": "52fe4563c3a368484e05789b",
               "name": "Beverly Lynne",
               "profile_path": "/iskmFOK2BN0cFDoJacfGF2u2zp8.jpg",
               "id": 72838,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Melinda",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e05789f",
               "name": "Janet Tracy Keijser",
               "profile_path": "/oOeerrQsx0UEyftLWIkVtzBmfvq.jpg",
               "id": 98871,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Sgt. Ben Draper",
               "gender": 2,
               "credit_id": "52fe4563c3a368484e0578a3",
               "name": "Garrett Clancy",
               "profile_path": null,
               "id": 98851,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Tara Woodley",
               "gender": 1,
               "credit_id": "52fe4563c3a368484e0578a7",
               "name": "Emmy Smith",
               "profile_path": "/cDFQkMl2v7Dpmw2g0zliAVZ6lAj.jpg",
               "id": 98872,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Pvt. Wilson",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e0578ab",
               "name": "Greg Brown",
               "profile_path": null,
               "id": 98873,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Jason",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e0578af",
               "name": "Mike Coen",
               "profile_path": null,
               "id": 98874,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Buzz",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e0578b3",
               "name": "John Kyle Grady",
               "profile_path": null,
               "id": 98875,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Geeter",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e0578b7",
               "name": "Jarrod Robbins",
               "profile_path": null,
               "id": 98876,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Man #1",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e0578bb",
               "name": "Matt Emery",
               "profile_path": null,
               "id": 98877,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Man #2",
               "gender": 0,
               "credit_id": "52fe4563c3a368484e0578bf",
               "name": "Joe Myles",
               "profile_path": "/rl8bMmZvFezq5AfAOl80oc1Dnyc.jpg",
               "id": 98878,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4563c3a368484e057869",
               "name": "Brad Sykes",
               "profile_path": null,
               "id": 98842,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4563c3a368484e05786f",
               "name": "David S. Sterling",
               "profile_path": null,
               "id": 98519,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4563c3a368484e057875",
               "name": "Jon McBride",
               "profile_path": null,
               "id": 98867,
               "department": "Crew",
               "job": "Additional Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4563c3a368484e05787b",
               "name": "Jeff Leroy",
               "profile_path": null,
               "id": 98680,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4563c3a368484e057881",
               "name": "Garrett Clancy",
               "profile_path": null,
               "id": 98851,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4563c3a368484e057887",
               "name": "John Polonia",
               "profile_path": null,
               "id": 98868,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4563c3a368484e05788d",
               "name": "Mark Polonia",
               "profile_path": "/9V2ccNFz9Zb214loSrBe6af0glH.jpg",
               "id": 98865,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4563c3a368484e057893",
               "name": "Joe Castro",
               "profile_path": "/ju6mljsA6zfEAdwLQrE07SWkcVN.jpg",
               "id": 98869,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [],
      "popularity": 0.041758,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27739,
      "vote_count": 1,
      "budget": 0,
      "overview": "No overview found.",
      "similar": [],
      "original_title": "The Zombie Chronicles",
      "runtime": 71,
      "poster_path": "/7EVLD9movDuWHkq2shx4FzwVd7w.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2001-01-01",
      "vote_average": 0.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brad Sykes"],
      "runtime": 71,
      "synopsis": null,
      "writers": ["Garrett Clancy"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0272950/",
      "coverLink": null,
      "actors": [
         "Greg Brown",
         "Garrett Clancy",
         "Michael Coen"
      ],
      "reviews": [
         "I think I will make a movie next weekend. Oh wait, I'm working..oh I'm sure I can fit it in. It looks like whoever made this film fit it in. I hope the makers of this crap have day jobs because this film sucked!!! It looks like someones home movie and I don't think more than $100 was spent making it!!! Total crap!!! Who let's this stuff be released?!?!?!",
         "Pros: Nothing Cons: Everything Plot summary: A female reporter runs into a hitchhiker that tells her stories about the deaths of people that were killed by zombies. Review: Never in my life have I come across a movie as bad The Zombie Chronicles. Filmed on a budget of what looks to be about 20 bucks, TZC is a completely horrible horror movie that relies on lame, forgetable actors whom couldn't act to save their lives and gore that's more gross than frightening. How does a movie like this even get made? Simply put, avoid TZC like a sexually-transmitted disease. My last 2 cents: Humorously enough, this movie was made by a movie company called Brain Damage Films. They're brains must have really been damaged to come up with a craptacular movie like this. My rating: 1 out of 10(If it were up to me, this movie would get the rating of negative bajillion)",
         "1st watched 8/3/2003 - 2 out of 10(Dir-Brad Sykes): Mindless 3-D movie about flesh-eating zombies in a 3 story within a movie chronicle. And yes, we get to see zombies eating human flesh parts in 3D!! Wow, not!! That has been done time and time again in 2D in a zombie movie but what usually makes a zombie movie better is the underlying story not the actual flesh-eating. That's what made the original zombie classics good. The flesh-eating was just thrown in as an extra. We're actually bored throughout most of this 3-part chronicle because of the lame(twilight-zone like) easily understood and slow-pacingly revealed finale's. The last story is actually the story the movie started with(having a reporter investigating a so-called ghost town) and of course we get to see flesh eating zombie's in that one as well. Well, I think I've said enough. Watch the classics, not this 3D bore-feast.",
         "I should learn. God, why have I not learned. I see these movies advertised as trailers on other crappy movies, and I get hooked in....The trailer for this movie (which I saw on the unelievably crappy Terror Toons) looked interesting. I am a living dead head, and thought it looked like a good low-budget zombie flick. What I got was beyond that. Most low budget directors will at least try and make things semi-believable. IN this, you have storylines in the 70's with people driving cars and wearing clothes from the late 90's, bad acting (extremely bad acting), crappy blurry filming which I guess is supposed to be 3D, some decent, but mostly lame make-up and gore effects, and to top it off, there is some giraffe necked Zombie at the end that noone explains about....huh? The movie lasts slightly longer than the trailer, a little over an hour, which is another rip-off. The man playing the hitch-hiker is totally ridiculous and acts as good as a cardboard cut-out. He has to be reading cue cards. What is sad that I expected an extremely low budget flick, which is not always bad. It's the acting and direction of this film that puts it in the crapper. If I buy another braindead film, please, Eat meeeeeeeeeee.................",
         "If the crew behind \"Zombie Chronicles\" ever read this, here's some advice guys: 1. In a \"Twist Ending\"-type movie, it's not a good idea to insert close-ups of EVERY DEATH IN THE MOVIE in the opening credits. That tends to spoil the twists, y'know...? 2. I know you produced this on a shoestring and - to be fair - you worked miracles with your budget but please, hire people who can actually act. Or at least, walk, talk and gesture at the same time. Joe Haggerty, I'm looking at you... 3. If you're going to set a part of your movie in the past, only do this if you have the props and costumes of the time. 4. Twist endings are supposed to be a surprise. Sure, we don't want twists that make no sense, but signposting the \"reveal\" as soon as you introduce a character? That's not a great idea. Kudos to the guys for trying, but in all honesty, I'd rather they hadn't... Only for zombie completists.",
         "Without wishing to be a killjoy, Brad Sykes is responsible for at least two of the most dull and clichéd films i've ever seen - this being one of them, and Camp Blood being another. The acting is terrible, the print is shoddy, and everything about this film screams \"seriously, you could do better yourself\". Maybe this is a challenge to everyone to saturate youtube with our own zombie related crap? I bought this for £1, but remember, you can't put a price on 71 minutes of your life. You'd do well to avoid this turkey, even at a bargain basement price.",
         "Amateur, no budget films can be surprisingly good ... this however is not one of them. Ah, another Brad Sykes atrocity. The acting is hideous, except for Emmy Smith who shows some promise. The camera \"direction\" needs serious reworking. And no more \"hold the camera and run\" gimmicks either; it just doesn't work. The special effects are unimaginative, there's a problem when the effect can be identified in real time. If you're going to rip off an ear, please don't let us see the actor's real ear beneath the blood. The scenery is bland and boring (same as Mr. Sykes other ventures), and the music is a cross between cheap motel porn and really bad guitar driven metal (see the scenery comment). Did I mention the lack of any real plot, or character development? Apparently, the scriptwriter didn't. Whoever is funding this guy ... please stop. I've seen some of his other \"home movies\" (which I will not plug) and they are just as bad. Normally, a \"director\" will grow and learn from his previous efforts ... not this guy. It's one thing to be an amateur filmmaker, but anyone can be a hack. Definitely not even a popcorn film ... of course, chewing on popcorn kernels would be less painful than this effort. Award: The worst ever military push-ups in a film.",
         "There's tons of good-looking women in this flick. But alas, this movie is nudity-free. Grrrrrrrrrr Strike one. Ahem. One story in this film takes place in 1971. Then why the hell are the main characters driving a Kia Sportage? Hello? Continuity, anyone? As you might know, this movie was released in stereoscopic 3D. And it is the most hideous effect I have ever seen. I'm not sure if someone botched the job on this, but there WAS no 3D, just double-vision blurs. I didn't have the same problem with this company's other 3D movies, HUNTING SEASON and CAMP BLOOD. Sure, the 3D in those ones sucked too, but with them I could see a semblance of 3D effect. This thing is a big ball of nothing. And whoever that women was who played the daughter of the ear-eating dame, yum! I'd like to see more of her. In movies, as well. Looks like Janet Margolin at a young age. Purrrrrrrrrrrrrrrr",
         "As a fan of these kind of movies, I enjoy low budget entertainment like this movie had to offer. I especially was interested in the opening trailers of other movies that \"Brain Damage\" has made and am going to see if I can find these somewhere. But getting back to this one, if you like this kind of genre, I highly recommend it. Good makeup effects for the budget they had.",
         "Really the only thing wrong with this film is the small budget. It is in the vein of tales from the crypt or tales from the dark side and the two stories told in the film are fine stories in that tradition. They aren't anything great, but they are certainly entertaining. The blood and guts are fairly good, the directing is serviceable and the stories are told clearly enough that any surprises are not confusing. If you enjoy anthology horror shows, this is worth your while. I've seen other low budget films that are much worse than this. I would watch this over a lot of bigger budget movies any day of the week.",
         "\"The Zombie Chronicles\" is a lot better than expected for a low-budget zombie anthology. **SPOILERS** Driving through the mid-west, journalist Tara Woodley, (Emmy Smith) stops in the town of Scopesboro in order to write about a few of the area's local legends. Meeting up with local Ebenezer Jackson, (Joe Haggerty) he agrees to tell her two stories about the myths that surround the town. The Good Stor(ies): Story 1-Returning from the Vietnam War, Sgt. Ben Draper, (Garrett Clancy) and his wife Marsha, (Beverly Lynne) break down in the woods around town. Heading off to find some gas, he returns to find her strapped to a tree rigged with explosives, and he is soon tormented into performing several arduous tasks from a mysterious watcher that soon turns out to be from his past. This one here does have some rather good stuff to it, mainly in the form of it's effective and surprising twist. That not everyone is as clean-cut as it first seems is well-played and makes for a fun time, as it spells everything out nicely rather than being forced out at once. We even get a couple of nicely-done suspense scenes, as the first scene in the woods, where her body is stumbled upon strung up with bombs in the middle of nowhere, as well as the final chase where the zombie chases the victim through the woods is nice to see. The gore isn't bad, as a hand is forced through a stomach, ripping out the intestines and another has the eyes torn out of the head. The best is the zombie, which here has that dirt-encrusted, skeletal vibe to it that effectively makes it look dead. There is some problems to it, mainly the fact that the segment really boils down to is the effectiveness of performing calisthenics as a form of horror, since they're not exactly that engrossing or terrifying, and come off as being rather boring. It does serve the film with a nice segue into revealing the protagonist with the back-story, but watching them play-out on-screen, for an eternity as well, is just endlessly boring and would've been better served in montage form. That also sets up the common theme in the film, that it's a little too long, but it's not all that bad overall. Story 2-Heading out to a campground, Jason, (Mike Coen) Buzz, (John Kyle Grady) and Melinda, (Janet Tracey Keijser) decide to stop in a secluded spot in the woods. They try to pass the time by telling ghost stories, including one of a famous outlaw said to be buried in the area. Not taking much stock in the legend, they soon find themselves trying to escape from zombies out to avenge their desecration of them. This one here is just insanely fun, and despite it being all-too familiar in set-up, execution and pay-off, is done with just the right amount of action and goofy fun that it never manages to disappoint. The fact that the woods are presented as being a creepy environment, with that uncertain-and-disorienting design, off-screen noises and that run-by of the unknown factor coming together into an effectively-set atmosphere. We also get more zombie-make-up goodness, as these look even better than the previous one, still retaining that dirt-encrusted, dead-for-centuries look which should be appropriate given the date of their deaths, and the look works here. Even the back-story is a lot of fun, providing an effective vehicle to hang an engrossing zombie story off of, and it's flashback presentation is good stuff. The last good part is that the segment manages to get in some more nice gore, including a nifty decapitation, a face ripped off and an ear removed and devoured. Again, it's a little longer than it should be, including getting to the graveyard to set-up everything that comes, but it's still a lot of fun. The Bad Stor(ies): Truthfully, there isn't much wrong with this one, just a few small concerns with it overall rather than individual stories. One of the biggest is at the end, when the lead comes to realize that the stories told couldn't happen, as if no one involved with these adventures survived them, then how do their stories get passed down. Despite proposing this proper angle, it comes off with the wrong angle to execute it. She was, after all, looking for \"ghost stories,\" which indicates that she's expecting to find folklore, the insistence on a verifiable story seems to mean that she's searching more for paranormal phenomena, which is completely different to what she implied earlier, and doesn't make any sense. It goes points for pointing out the logical inconsistency it presents, but not in the execution. Another flaw is that the three sequences are full of simply atrocious-looking cinematic virtues, due to it's budget. There are a few shots where the camera closes up on a character's face as they are running in fear for their lives, and it's obvious that the actor is the one actually holding the camcorder in front of them as their heads bop around out-of-frame, sound goes in-and-out at odd variables, the wind is audible on the soundtrack and overall, the feel is cheap. The last flaw is the film's framing. As mentioned before, it's stories are pretty long, and it wouldn't have needed that much of a miracle to be able to whittle them down a bit providing enough time to squeeze in one more tale, as the whole thing just feels incomplete. These, though, aren't that big of flaws for the film. The Final Verdict: A lot better than expected, even with some minor flaws in presentation rather than in the stories themselves which is a rare occurrence. Highly recommended mainly for the low-budget zombie film enthusiast, although only skip this if you can't enjoy it due to the budget, all others should give it a shot. Rated R: Graphic Violence, Graphic Language, Brief Nudity and a mild sex scene",
         "En route to a small town that lays way off the beaten track (but which looks suspiciously close to a freeway), a female reporter runs into a strange hitch-hiker who agrees to help direct her to her destination. The strange man then recounts a pair of gruesome tales connected to the area: in the first story, an adulterous couple plot to kill the woman's husband, but eventually suffer a far worse fate themselves when they are attacked by a zombie; and in the second story, a group of campers have their vacation cut short when an undead outlaw takes umbrage at having his grave peed on. The Zombie Chronicles is an attempt by writer Garrett Clancy and director Brad Sykes at making a zombie themed anthology—a nice idea, but with only two stories, it falls woefully short. And that's not the only way in which this low budget gore flick fails to deliver: the acting is lousy (with Joe Haggerty, as the tale-telling Ebenezer Jackson, giving one of the strangest performances I have ever seen); the locations are uninspired; the script is dreary; there's a sex scene with zero nudity; and the ending.... well, that beggars belief. To be fair, some of Sykes' creative camera-work is effective (although the gimmicky technique employed as characters run through the woods is a tad overused) and Joe Castro's cheapo gore is enthusiastic: an ear is bitten off, eyeballs are plucked out, a face is removed, brains are squished, and there is a messy decapitation. These positives just about make the film bearable, but be warned, The Zombie Chronicles ain't a stroll in the park, even for seasoned viewers of z-grade trash. I give The Zombie Chronicles 2/10, but generously raise my rating to 3 since I didn't get to view the film with the benefit of 3D (although I have a sneaking suspicion that an extra dimension wouldn't have made that much of a difference).",
         "My girlfriend once brought around The Zombie Chronicles for us to watch as a joke. Little did we realize the joke was on her for paying £1 for it. While watching this film I started to come up with things I would rather be doing than watching The Zombie Chronicles. These included: 1) Drinking bleach 2) Rubbing sand in my eyes 3) Writing a letter to Brad Sykes and Garrett Clancy 4) Re-enacting the American civil war 5) Tax returns 6) GCSE Maths 7) Sex with an old lady. Garrett Clancy, aka Sgt. Ben Draper wrote this? The guy couldn't even dig a hole properly. The best ting he did was kick a door down (the best part of the film). This was the worst film I have ever seen, and I've seen White Noise: The Light. Never has a film had so many mistakes in it. My girlfriend left it here, so now I live with the shame of owning this piece of crap. News just in: Owen Wilson watched this film and tried to kill himself. Fact. DO NOT WATCH",
         "OK, it's not \"Night of the Living Dead\" (but then again, what is?), but it's not THE worst movie I've ever seen. The acting wasn't TOO bad--the WRITING, however, left a lot to be desired. The camera work was kinda poor--I could have done without the reflection of the actor's faces in several instances, and it looked like they were going for the \"Blair Witch\" effect by having the actors run while holding the camera on their own faces--never a good move, especially by amateurs. I was especially surprised to learn this was made in 2001--having indulged myself in relatively recent \"MST3K\" DVD's, it looked like it was made either A. in the late 70's, or B. by a college video club. I did enjoy the stories, however, surprisingly enough. A writer gets lost on the way to a remote town famous for its ghost stories, and picks up a mysterious hitchhiker on the way. When they stop \"to rest a spell\", he tells her (I only counted 2?) stories of horrible deaths connected with the town. That part is predictable enough, but the stories the hitchhiker tells are pretty good. If this were given to a more professional cast and crew, it might rise up to the level of \"Creepshow\"--maybe. The ending made absolutely no sense, sadly, and it ended too soon. I watched the \"2-D\" version, and it was over in less than 1.25 hours, and the hitchhiker only told two stories. If the third was supposed to be \"the wraparound\" story, that was pretty lame. I wouldn't run out and buy it, but it's not as bad as most MST3K fodder.",
         "Zombie Chronicles isn't something to shout about, it's obvious not a award winning movie but it is a entertaining B-movie directed by Brad Sykes who directed Camp Blood which was another entertaining low budget flick. The acting is bad like most cheaply made movies but that's what makes it more entertaining, the zombie make-up is cool and effective especially with the budget, the gore is also great and gross, the film is sort of like a zombie version of Tales from the Crypt since we get two tales about zombie encounters in the woods, the stories are fun and do leave you guessing especially the first tale. Zombie Chronicles is a lot better than some low budget zombie movies out there, if you love low budget B-movies or cheaply made zombie flicks then check out Zombie Chronicles.",
         "This is Brad Sykes second film using the the then only affordable 3D camera lens for the home market. It was intended for use with a now outdated system that worked only on tube sets and were marketed at video stores with the movies for a ridiculous price. Now you can get all of the movies that the company put out as double features on Bluray 3D for less than ten dollars and they aren't even worth that. I'm pretty positive that any one reading this that can read and comprehend Film Making For Dummies can raise up 50 bucks(More if you give the actors lunch)and make a much better film that this. Hell, if you made a 60 minute film of fat hairy guys puking up fake vomit you would have a better film than this. So go get a 3D camera and make something better than this.",
         "\"The Zombie Chronicles\" by Brad Sykes mixes \"Creepshow\" like anthology horror with zombie blood and guts.The film is extremely low-budget and it has mysterious ghostly drifter Ebeneezer Jackson telling zombie stories to annoying female reporter.The gore is amateurish and plentiful,each zombie is recognizable and the acting is incredibly bad.The gore includes laughable decapitation,ear ripping,brain devouring and one girl having her eyes ripped out.The characters are one-dimensional as they serve only as tasty zombie's meat.So if you are a fan of very low-budget zombie flicks you can give this one a try,but you have to be really tolerant when it comes to Z-grade badness.4 empty graves out of 10.Fans of more polished and professional horror should avoid \"The Zombie Chronicles\" like the plague.",
         "OK its not the best film I've ever seen but at the same time I've been able to sit and watch it TWICE!!! story line was pretty awful and during the first part of the first short story i wondered what the hell i was watching but at the same time it was so awful i loved it cheap laughs all the way. And Jebidia deserves an Oscar for his role in this movie the only thing that let him down was half way through he stopped his silly name calling. overall the film was pretty perfetic but if your after cheap laughs and you see it in pound land go by it.",
         "Some films that you pick up for a pound turn out to be rather good - 23rd Century films released dozens of obscure Italian and American movie that were great, but although Hardgore released some Fulci films amongst others, the bulk of their output is crap like The Zombie Chronicles. The only positive thing I can say about this film is that it's nowhere near as annoying as the Stink of Flesh. Other than that, its a very clumsy anthology film with the technical competence of a Lego house built by a whelk. It's been noted elsewhere, but you really do have to worry about a film that inserts previews of the action into its credit sequence, so by the time it gets to the zombie attacks, you've seen it all already. Bad movie fans will have a ball watching the 18,000 continuity mistakes and the diabolical acting of the cast (especially the hitchhiker, who was so bad he did make me laugh a bit), and kudos to Hardgore for getting in to the spirit of things by releasing a print so bad it felt like I was watching some beat up home video of a camping trip. Awful, awful stuff. We've all made stuff like this when we've gotten a hold of a camera, but common sense prevails and these films languish in our cupboards somewhere. Avoid.",
         "I received this movie as a gift, I knew from the DVD cover, this movie are going to be bad.After not watching it for more than a year I finally watched it. what a pathetic movie\u0085. I almost didn't finish watching this bad movie,but it will be unfair of me to write a review without watching the complete movie. Trust me when I say \" this movie sucks\" I am truly shocked that some bad filmmaker wane bee got even financed to make this pathetic movie, But it couldn't have cost more than $20 000 to produce this movie. all you need are a cheap camcorder or a cell phone camera .about 15 people with no acting skills, a scrip that were written by a couple of drunk people. In the fist part of this ultra bad move a reporter (Tara Woodley )run a suppose to be drunk man over on her way to report on a hunted town. He are completely unharmed. They went to a supposed to be abandon house ,but luckily for the it almost complete furnished and a bottle of liquor on the door step happens to be there. just for the supposed to be drunk man but all is not what it seems. Then the supposed drunk man start telling Tara ghost/zombies stories. The fist of his stupid lame stories must be the worst in history. his story Sgt. Ben Draper let one of his soldiers die of complete exhaustion (I think this is what happens)after letting the poor soldier private Wilson do sit ups he let him dig a grave and then the soldier collapse ,Ben Draper buries him in a shallow grave. But Sgt. Ben Draper are in for n big surprise. his wife/girl fiend knows about this and she and her lover kills Sgt. Ben Draper to take revenge on private Wilson.(next to the grave of the soldier he sort off murdered) The soldier wakes up from his grave in the form of zombie and kill them for taking revenge on his behalf. The twist ending were so lame. Even if you like B HORROR movies, don't watch this movie",
         "I rented this only because it had zombies and was 99 cents... I got less than I payed for. Pros: Lots of blood and gore (even if it is crappy) Cons: Everything. I admire Brain Damaged for trying to create a fairly good Z film, but I'm sorry, this is too much crap. I nearly had to go to church to cleanse myself of this sin to zombies. I only give it 3 for, conveniently, 3 things. 1. Lots of blood and gore (again, most of it is crappy, but enjoyable). 2. Mediocre plot and story, just barely passable. 3. Hot chicks. But, the acting is nearly crap, the stories are too damn bad, and there are only 3 of them. At least give me 5, people. Zombie Chronicles had potential, but in all seriousness, give me a camera, makeup, some cars, let my friends do the acting, and we could have topped this. If your a die hard zombie fan and/or are a role player for zombie games, at least rent this for 99 cents and enjoy. And trust me, there's not much to enjoy.",
         "I have not seen many low budget films i must admit, but this is the worst movie ever probably, the main character the old man talked like, he had a lobotomy and lost the power to speak more than one word every 5 seconds, a 5 year old could act better. The story had the most awful plot, and well the army guy had put what he thought was army like and then just went over the top, i only watched it to laugh at how bad it was, and hoped it was leading onto the real movie. I cant believe it was under the 2 night rental thing at blockbusters, instead of a please take this for free and get it out of our sight. I think there was one semi decent actor other than the woman, i think the only thing OK with the budget was the make up, but they show every important scene of the film in the beginning music bit. Awful simply awful.",
         "..Oh wait, I can! This movie is not for the typical film snob, unless you want to brush up on your typical cinematic definitions, like \"continuity editing\" and \"geographic match\". I couldn't tell where I was in this movie. One second they're in the present, next minute their supposedly in the 70's driving a modern SUV and wearing what looked like to me as 80's style clothing. I think. I couldn't pay long enough attention to it since the acting was just horrible. I think it only got attention because it has a 3d which I did not watch. If you're a b-movie buff, and by b-movie I mean BAD movie, then this film is for you. It's home-movie and all non-sense style will keep you laughing for as long as you can stay awake. If your tastes are more for Goddard and Antonioni, though, just skip this one.",
         "After seeing this movie, I thought to myself; \"What the hell did I spend $5 bucks on this movie for?\" Definately not worth renting. The cover of this movie was eye catching and that is probably it's best quality. There were several scenes in the movie where my grandmother could have acted better. Also, I wasn't really impressed with the special effects. For example in one scene one of the zombies pops the eyes out of this chicks head. You can still see her real eyes behind the effect. Low budget, only see if you wanna good laugh."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Razor Entertainment"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 118852,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2001-01-01",
      "dvdReleaseDate": null,
      "directors": ["Brad Sykes"],
      "runtime": 71,
      "movieId": 118852,
      "title": "The Zombie Chronicles",
      "mpaa": "",
      "actors": [
         "Joseph Haggerty",
         "Beverly Lynne",
         "Janet Tracy Keijser",
         "Garrett Clancy",
         "Emmy Smith",
         "Greg Brown",
         "Mike Coen",
         "John Kyle Grady",
         "Jarrod Robbins",
         "Matt Emery",
         "Joe Myles"
      ],
      "imdbMovieId": "0272950",
      "originalTitle": "The Zombie Chronicles",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 27739,
      "avgRating": 3,
      "releaseYear": "2001",
      "numRatings": 2,
      "posterPath": "/7EVLD9movDuWHkq2shx4FzwVd7w.jpg"
   }
}