{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "bank robbery",
         "id": 15363
      }],
      "imdb_id": "tt2017486",
      "video": false,
      "title": "Closer to the Moon",
      "recommendations": [],
      "backdrop_path": "/bNdftXOtoCDaJNv3uuINq3BKxWG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Alice Bercovich",
               "gender": 1,
               "credit_id": "52fe4c2ec3a368484e1ab7b1",
               "name": "Vera Farmiga",
               "profile_path": "/oWZfxv4cK0h8Jcyz1MvvT2osoAP.jpg",
               "id": 21657,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Max Rosenthal",
               "gender": 2,
               "credit_id": "52fe4c2ec3a368484e1ab7b5",
               "name": "Mark Strong",
               "profile_path": "/svq7VWJqKN4Fq8ZJK1Yd8W711rn.jpg",
               "id": 2983,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Virgil",
               "gender": 2,
               "credit_id": "52fe4c2ec3a368484e1ab7b9",
               "name": "Harry Lloyd",
               "profile_path": "/vI6FWizXNa5quCyIiTd06gxNQu1.jpg",
               "id": 205258,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Holban",
               "gender": 2,
               "credit_id": "58ef1210c3a3682633006367",
               "name": "Anton Lesser",
               "profile_path": "/rKDn8ZHuIxl4Z3LLbUxvHdCOk0U.jpg",
               "id": 27397,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Răzvan Orodel",
               "gender": 2,
               "credit_id": "52fe4c2ec3a368484e1ab7bd",
               "name": "Joe Armstrong",
               "profile_path": "/dwx3FGXgd3k3iyCL5is2Dsa3vKs.jpg",
               "id": 202047,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Iorgu Ristea",
               "gender": 2,
               "credit_id": "531c3283c3a3685c3d0061b2",
               "name": "Christian McKay",
               "profile_path": "/sNzMFhhayZvBCYak24Y306xajA.jpg",
               "id": 28478,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dumitru 'Dumi' Dorneanu",
               "gender": 0,
               "credit_id": "531c32a1c3a3685c56006284",
               "name": "Tim Plester",
               "profile_path": "/w2AzIdLAn03XHpWtWdiSjBSCJru.jpg",
               "id": 62972,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Sonia Rosenthal",
               "gender": 0,
               "credit_id": "58ef1219c3a3682626005aae",
               "name": "Monica Bârlădeanu",
               "profile_path": "/zDe519bZURlucZzaRJPASkyRzQ3.jpg",
               "id": 145242,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Flaviu",
               "gender": 2,
               "credit_id": "58ef12249251414241006508",
               "name": "Allan Corduner",
               "profile_path": "/2ojqtqJHgZS2Nzjfy27luskDunp.jpg",
               "id": 78018,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Prison Commander",
               "gender": 2,
               "credit_id": "5a0a28cc925141310a00adf9",
               "name": "Martin McDougall",
               "profile_path": "/w8MaALgeRVDuqkZh7gEpgrYTiLC.jpg",
               "id": 36901,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c2ec3a368484e1ab7a7",
               "name": "Nae Caranfil",
               "profile_path": null,
               "id": 55520,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c2ec3a368484e1ab7ad",
               "name": "Nae Caranfil",
               "profile_path": null,
               "id": 55520,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.324508,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "PL",
            "name": "Poland"
         },
         {
            "iso_3166_1": "RO",
            "name": "Romania"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 137347,
      "vote_count": 17,
      "budget": 9000000,
      "overview": "A Romanian police officer teams up with a small crew of bank robbers to pull off a heist by convincing everyone at the scene of the crime that they are only filming a movie.",
      "similar": [
         1969,
         507,
         416160,
         10569,
         968,
         10623,
         755,
         9472,
         949,
         1585,
         2330,
         4147,
         59440,
         854,
         338766,
         318846,
         97367,
         106646,
         136400,
         553
      ],
      "original_title": "Closer to the Moon",
      "runtime": 112,
      "poster_path": "/nJqRhKd7KHz4CufBRTlaQWXA8Ni.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Română",
            "iso_639_1": "ro"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Agresywna Banda",
            "id": 36299,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Denis Friedman Productions",
            "id": 66146,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mandragora Movies",
            "id": 20643,
            "origin_country": ""
         }
      ],
      "release_date": "2013-11-29",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Romania",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nae Caranfil"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Nae Caranfil"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2017486/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3NjAzOTAxOF5BMl5BanBnXkFtZTgwNjE5MTUxNTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Vera Farmiga, Mark Strong, Harry Lloyd | See full cast and crew »"],
      "reviews": [
         "Unless you have at least some basic knowledge about Communist Romania, this movie might seem very far away from a rating of 10. As the story unraveled, it sucked us into an atmosphere that most of us feel is long gone, and nevertheless, so close to us. It's the period when the first cracks in an apparently perfect egalitarian world started to appear. Robbing a bank with guns in a communist country is like robbing a supermarket of its toilette paper. Money then and there was useless unless you could justify its origin. And that is what makes this story so strange for us. But there are many, many other layers to the story. The cast is great. The historical background is fascinating (at least for us, Romanians). And the cinematography is far above average. This movie was like a breath of fresh air. One full of poisonous gases, as seeing the movie, you will discover that there are many things about the human race that will upset you, but at the same time, air that provokes an uncontrollable laugh. Some people in the audience didn't appreciate the jokes. I did, because I considered it was the only way not to make the most depressing movie in the world. A masterpiece that will most probably be considered as such many years from now, when people will start making movies about our not so egalitarian society.",
         "I was so completely entertained by this little film. I understand the historical data is highly accurate and appropriate for the Romanians that have lived in that exact period - which I respect so much . The amazing cinematography traps you along with power-house performances from Farmiga and Strong, the story is simply amazing and unique ( i think we all crave for unique stories nowadays). Caranfil's directing took me by surprise because I have never expected this level of craft from a director also trapped in a country where films at this scale are only a dream. I loved every single one of the shots and the editing was also amazing. I really hope Caranfil will make more movies like this - keeping the amazing dark, funny and artistic tone. ( See The Rest is Silence - it maintains that unique blend of tones ). One of the best non- American films i've seen in the last couple of years.",
         "It is always gratifying to find a film you do not know anything about and it becomes one of your favorite movies. Director/writer Nae Caranfil has taken an obscure incident in Soviet occupied Romania in the late 1950's and has offered it up to the 21st century cinema to give us a most pertinent message for today's world. That message is not robbing the bank! The message is to be found in how the system (society) can single out certain groups and marginalize them into committing a desperate act --- and not really have any reason to do this act but to just fight back. The entire cast is perfect in their individual roles, the script is intelligent, the photography beautiful! This film should a 10 in anyones book!",
         "Excellent movie. A quintet of Jews seeing their status drop in postwar Romania rob a bank in Nae Caranfil's Closer to the Moon, only to be caught, convicted, and forced to reenact their crime in a slyly anti- Semitic propaganda film. Though based on a true story, the film discards some of its claim to authenticity right off the bat, casting Brits and Americans in all the leads and having them speak English instead of Romanian; later, it will have trouble establishing the gang's motives for a crime they all but knew would lead to their execution. Stateside potential is modest for the semi-convincing yet enjoyable tale, relying on familiar names in a cast that acquits itself well given the demands of the unusual plot. The dialogue may not sell viewers on the motivations for a robbery where the loot was a nearly worthless currency, but the setting offers a melancholy that would be welcome elsewhere in the film.",
         "You've probably never heard of the Ioanid Gang, or the bank robbery that they carried out in Bucharest in 1959. I had never heard of it before I watched Nae Caranfil's \"Closer to the Moon\". The movie isn't any kind of masterpiece, but sufficiently looks at this incident, and how Romania's Soviet-backed government arrested the gang and forced them to star in a propaganda film reenacting the robbery. One of the thing that we notice while watching the movie is the hypocrisy of the Eastern Bloc governments. They claimed that they were establishing classless societies but there was a high society (and the people in the government had no qualms about themselves jewelry). Later on, Nicolae Ceaușescu forced women to have as many children as possible, which overfilled Romania's orphanages. Most of the heads of state in the Eastern Bloc were typical ideologues, but Ceaușescu sounded like a mental case. Anyway, the movie's worth seeing.",
         "Set in 1959 and '60, in Bucharest, Romania. and based on a true story, this film focuses on the plight of the group that was to become known as the Rosenthal Gang. The group led by Max Radoiu Rosenthal (Mark Strong) were all once daring Jewish Resistance fighters vs. the Nazis during WWII, in Romania. They were all Communists as well, and when the Soviet Union seized complete control over Eastern Europe after the war, many of these Resistance fighters held elite positions in Romania. However now over a decade later, many of the fighters are being blacklisted and purged from the country's hierarchy. As the film opens, the so-called Rosenthal gang is staging a daring daylight robbery of a bank transport van carrying loads of cash. They're using the pretense of making a movie as the heist progresses, in the middle of Martyrs' Square in Bucharest. Of course, this type of crime is unheard of in a Communist country. Flash forward a year, and we find the group has all been captured, tried, and sentenced to death by a firing squad for their crimes. However, before their executions can take place, the government wants to recreate their story in a propaganda film, that will serve as a lesson for the Romanian people. The movie, written and directed by Romanian filmmaker Nae Caranfil, is presented in a most irreverent and satirical way, which unfortunately only at times came across as entertaining to me. Towards the end of the film, as we finally learn the motivations of the \"gang\", it made little sense to me considering the dire consequences of what their actions could bring. Overall, I know this movie is presented in a most satirical way, but it had me \"scratching my head\" half of the time, specifically as to the path the main characters chose to take here.",
         "In reality, something happened. Some people have been executed without being guilty. They have been forced to play a role in their fake trials and all ended in their execution. A false history was created by some top authorities in order to teach some kind of a lesson to the people that worked in the communist regime structures. This movie was not made for the public. This false reenactment most probably inspired Lucian Pintilie to create a cinematographic masterpiece, Reconstruction (1968). Add to that the fact that Pintilie's film has been done in those crazy times, when you could have gotten into big trouble for criticizing the regime. Now, here comes Caranfil, a great director, that takes the original story and twists it once again, turning these people into courageous heroes that opposed the regime. They get into a suicidal mission just to send a message. How much believable is that? Does this bring justice to the original six persecuted people? I'm not sure about that. There's a documentary, called Marele Jaf Comunist (The Great Communist Robbery) that reveals more of the true story. Anyway, a drama is not supposed to tell the real story, and that's OK, but in this case, it's a pity that some people will take it as history. The real six people have been persecuted in communist style with fake trials and five of them were killed. They were Jews and they were high professionals. Moreover, ironically, they had a history in participating successfully in bringing the communism to Romania. So, why did the regime chose them in order to teach a lesson to the other communists, and probably to the Jewish communists? The movie might leave you with the impression that all Jews were persecuted under the communism. Many of them they were. The Russian occupation brought suffering to all kinds of Romanian citizens. But many of the Jews supported the regime since the beginning. I know that many of the Jews have been disappointed by the communism that they previously believed in. Most of the Jews went to Israel sometimes in the Sixties, but also, many Jews supported the communist repression, leading to massive deportation, imprisonment and execution of hundreds of thousands of Romanian citizens. You will not see this in the movie.",
         "About five minutes into this film I had the sinking feeling that I had just paid to see a film I would not want to watch. I chose it from a list of \"On Demand\" films on TV and the blurb was misleading otherwise I probably wouldn't have chosen it. The blurb said something about WWII, Jews,and Communism, so I thought it was about WWII and the Holocaust, but it is not. Anyway, I would have stayed with it but found it both confusing and boring. It struck me as an artistic film that's more about the acting and other aspects of its production, than it is about storytelling. I found it to be similar to watching an early Fellini production in which a certain grotesqueness about the actors' faces and behaviors is supposed to be moving and often, humorous. Perhaps if I had had more knowledge about the history upon which the film is based, I would have enjoyed it more? Somehow, I don't think so. There's also the possibility that the discomfort I felt watching the film was the reaction the director and producers were going for. If that's the case, I suppose it warrants a much higher vote than I gave it.",
         "Now perhaps the fact that it was a movie about Jewish people should have been obvious from the description. But that needn't be a bad thing. Fiddler on the Roof showed how to tell a story about underlying tragedy in a humorous and inclusive way. To paraphrase: Closer To The Moon is no Fiddler on the Roof It is just a poorly made movie. I gave up watching it after 10 minutes, which was 5 more than my senses told me I should. I skipped forward to see if it got any better. It doesn't. Very much a niche movie.",
         "Almost all high-rate Romanian directors have a somewhat perverted fetish about Communist Romania stories. That being said, if you've seen a Romanian movie from the 2000's until present day, in over 90% of the cases it's some story set in Communist Romania,and how bad it was and how people where so against it all. Nothing further from the truth! All of these stories are filled with one-sided prejudice opinions and resemble the directors view of the world, in most cases conservatives and Christian-democrats with strong rejection of anything left-wing and progressive. So, this movie isn't any different from all the other famed movies our directors have launched in the past years about pre-1989 Romania. The Ioanid gang, who where a bunch of superficial silly Bonn vivers on film where in fact a gang of guys (and a girl) with no ideological stance to their continuous dissidence before the WWII and afterwards. They where acting against the regimes only for the fun of it, for the adventurous filling of being in contradiction with those in power , not because they opposed Nazism and Communism as ideologies. They where Jews, who where oppressed by the Romanian Nazi collaborators and afterwards resented by the same Romanian Nazi collaborators(fascist legionnaires disguised in Communists and Bolsheviks as Romanian Iron Guard followers where to do after Germany lost the war) wrapped in the red flag of Communism. All in all the actors played their parts well, as they are professionals. But the storytelling, the way Caranfil romanticized a bunch of fools is not to my taste. As a different approach by our distinguished directors, I'd like to see a movie about the atrocities committed in the years when fascists where in power in Romania, when our honorable King Carol II imposed his dictatorial regime banning parties and letting the legionnaires from the Iron Guard rise to power. But there is no real interest. It is more comfortable to pick the same over done subject of Communist Romania. My advice to you after seeing this artistic movie is to see the real reenactment \"propaganda\" movie made by the authorities in 1960. It's with the real participants and has a better way to sticking to facts as they occurred."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Agresywna Banda",
         "Denis Friedman Productions",
         "Mandragora Movies"
      ],
      "summaries": [
         "Bucharest 1959. A spectacular Bank heist has the country in an uproar. In post-war Communist Romania it is an unimaginable slap in the face to the iron fisted authorities. Four men and a woman are arrested, tried, convicted and while waiting for their execution... are forced to star in a propaganda film about the crime. All five protagonists were heroes of the resistance during the Second World War and highly placed members of Romanian society. They clearly knew they would be caught and executed.",
         "A Romanian police officer teams up with a small crew of old friends from the World War II Jewish Resistance to pull off a heist by convincing everyone at the scene of the crime that they are only filming a movie."
      ],
      "budget": 5000000
   },
   "movielensId": 118862,
   "movielens": {
      "languages": [
         "English",
         "Română"
      ],
      "releaseDate": "2013-11-29",
      "dvdReleaseDate": null,
      "directors": ["Nae Caranfil"],
      "runtime": 112,
      "movieId": 118862,
      "title": "Closer to the Moon",
      "mpaa": "R",
      "actors": [
         "Vera Farmiga",
         "Mark Strong",
         "Harry Lloyd",
         "Anton Lesser",
         "Joe Armstrong",
         "Christian McKay",
         "Tim Plester",
         "Monica Bârlădeanu",
         "Allan Corduner",
         "Martin McDougall"
      ],
      "imdbMovieId": "2017486",
      "originalTitle": "Closer to the Moon",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["S_2EDLTqep8"],
      "plotSummary": "A Romanian police officer teams up with a small crew of bank robbers to pull off a heist by convincing everyone at the scene of the crime that they are only filming a movie.",
      "tmdbMovieId": 137347,
      "avgRating": 3.30952,
      "releaseYear": "2013",
      "numRatings": 21,
      "posterPath": "/nJqRhKd7KHz4CufBRTlaQWXA8Ni.jpg"
   }
}