{
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [],
      "runtime": 173,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115392/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNjc0NjgyMl5BMl5BanBnXkFtZTcwMDAzMTAzMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Gallagher, George C. Scott, Catherine Zeta-Jones | See full cast and crew »"],
      "reviews": [
         "This made-for-TV version of the famous disaster actually stands up fairly well against its $200 million James Cameron counterpart. The effects are good - and in a few cases even on par with Cameron's version. Indeed, watching the two films back to back, you might be surprised at the similarities between the two versions, at least during some key moments. Both have steerage party scenes, for instance. The cast is generally strong too, particularly Catherine Zeta Jones in one of her first lead performances, and George C. Scott as Capt. Smith. But where Titanic (1996) hits all the wrong notes is in a poorly conceived subplot involving a crooked crewmember (Tim Curry). His character doesn't really belong here, and his villainous actions get to be quite shocking near the end ... it takes away from the human drama of the doomed people on the ship and actually comes close to ruining the movie (though no fault of actor Tim Curry, who turns in a great performance). If you only have time to see one super-long movie based on the disaster, see the Cameron film - if you've got time to see two, this one is worth the rental.",
         "The thing with this film is it had good points and it had bad points. Some of the good points are that there were aspects to this film that were far more realistic than James Cameron's. For instance, the young rogue that sneaks onto the ship does so not by winning a suspensful hand of poker, but by stealing the tickets when his drinking buddy has passed out for the evening. This is also the same young rogue who steals a jacket to get into the first-class dining room and then procedes to pick-pocket some of the passengers, starting with John Jacob Astor. The crooked crew member (played by Tim Curry) was a nice touch. And the rape scene was a gritty touch of realism, though painful to watch. And yes folks, stuff like that does, and did happen in real life. This film DID focus on real people that were on the ship, though not neccessarily the same ones as James Cameron. That is neither a good or bad thing, that is what you call a creative decision. For instance, we get a casual glimpse into JJ Astor's Young wife's life through Catherine Zeta-Jones' character, who is in a similar situation. They are friends and have a conversation about it. This makes it feel much more natural than Rose's hurried pointing around the room under the thin guise of gossip. The thing with the Allisons' maid was interesting- the maid did, in fact, take the baby and get in a life boat, without the mother's consent, causing the parents and their little girl to roam the ship looking for them until it went down. Whether the maid was actually crazy was anybody's guess, but it was an interesting choice of plot in this film. Though just a touch too ridiculous. Captin Smith, though he had a famous actor behind him, was a little off character I thought. He had too much initiative. I'm not using James Cameron's portrayal as a basis for comparison, but Captain Smith, though he had years of sea-faring behind him, had had very little experience with intense situations of that sort and was actually very unprepared for the disaster. He didn't think anything could possibly happen on that voyage. I like Molly Brown better, I don't know why. And I really like the last shot of the first part (cause this was a TV flick)- when the people are kicking the ice around on deck, the camera focuses to the forground where someone has placed a champagne glass on the railing. It slowly slides down the now slight incline and smashes to pieces on the deck. When I saw that, I felt it was worth watching. Overall, this film, was, well, a TV film. Meaning it wasn't that great. But it wasn't that bad either.",
         "Though Titanic purists and some critics did not particularly care for this mini-series, it is rather good. The cast is strong, including George C. Scott as the captain. The computer FX are well done. The only disappointment for me was the hodge podge way the final sinking was represented -- it was just a confusing series of cross fades that really showed nothing. Nevertheless, the film is worth seeing.",
         "It isn't great, but I was impressed by the overall project. It is overlong, with a somewhat corny script and some of the actors don't convince. The rape scene halfway through was very brutal, and perhaps inappropriate. Some people say this is historically inaccurate, but I need to check my history. The performances are good generally with some exceptions (Catherine Zeta Jones is lovely here), the costumes are nice and the special effects for a TV mini series were close to superb. George C.Scott is a brilliant actor, and he was quite good here. Tim Curry, as a villain likewise. Though both men have been better. I wasn't entirely convinced by Ase and Jamie's romance, as it was basically a retread of the James Cameron blockbuster, which also suffers from its length. The music is also good( my music teacher hates the 1997 film's music) and this is the first adaptation when the ship breaks into two, which was nicely done. Not a bad attempt! 7/10 Bethany Cox",
         "I had very mixed feelings about this movie. Although there were quite a few flaws, it was certainly not without its charm. The first thing that must be taken into consideration when commenting on this movie is that it was a low-budget, made-for-tv movie, so the effects and other technical aspects were less than spectacular. However, to me the story is what makes a movie good or bad. Since there were a few stories sprinkled throughout the film, it was at times good, but usually not so good. First the bad things. I think the worst thing about this movie is that there was alot of pointless and boring filler that made the movie seem to drag on, especially around the time of the sinking. The second time I watched the movie, I noticed that I fast fowarded through almost half of it. I also did not care much for the story of the Allison family and their paranoid nanny. I found their part when the ship is sailing extremely tedious and boring and the part when they're searching for their baby too obnoxious to be sad. I also almost couldn't bear the performance of the actress portraying Mrs. Allison. And the whole part about the nanny just became annoying. The Allison family actually existed, and the young Allison girl was the only first-class child to die on the Titanic. This could have been a very sad and touching part, but I just saw it as a complete flop. Now for the ok things. I really loved Catherine Zeta-Jones and Peter Gallagher in this. Although the love affair between the two was just a little more than okay, they threw in great performances and I found their characters interesting. I enjoyed much of the happenings in first class and especially found the old superficial socialite (that woman with the dog, her name slips my mind as of now) very entertaining and humorous. As for those down in steerage, I found Jamie and Olsa to be quite charming characters and took interest in their affairs. However, my favorite part of the movie was most likely Tim Cury. If there is one thing I love in a film it is a good villian, and he is definately one. His performance was, in my opinion, the best part of the movie. Overall, I'd say that it was not great, but there were some factors that saved it and actually made it an enjoyable made-for-tv movie(how often can you say that?)",
         "This looks like a made for TV rush job; perhaps they heard a blockbuster version was in the works (Cameron's mega-hit the next year), and hurried to finish this before the release of it. These coat tail copies have been done before. In any event, this effort at relating the infamous maritime disaster of 1912 is big on ambition, but crippled by low budget. There are distinct parallels to its more famous 1997 cousin. You get a Jack & Rose type romance, which is written very awkwardly. Catherine Zeta-Jones and Peter Gallagher did their best with it, but it really doesn't evoke the passionate emotion intended. Overall, the idea of the soap-opera entanglements of several characters is a good plan, and the actors mostly do well. However, the constant heavy-handed bashing of rich people is about as subtle as a repeated blows to the head with a tire iron; it really gets old. In particular, the slant on Molly Brown was so far afield it was just dumb. I thought George C. Scott was pretty good as the ill fated Capt. Smith, who inherits the lines of the Titanic's designer, a character that is in other versions, but deleted from existence here. The film makes an earnest effort to portray the horror and sorrow of the tragedy, but one blunder really hurt the effectiveness: to show the gradually increasing listing of the ship, the director simply has the camera turned at a slight angle, but fails to have the actors lean in the direction. The painfully comic result is characters standing perfectly upright at odd angles where their center of gravity would force them to lean. Also a problem was the unnecessary house-thief crewman (Tim Curry) still wandering around burglarizing state rooms as the water gushes in all around him. Even worse, the character is played as a constantly giggling idiot. The montage sequence was a good answer for the limited resources available, and the protracted epilogue aboard the Carpathia might have worked better had it been dedicated to giving fates of real survivors; instead, we get the schmaltzy and unrealistic fates of fictional people. Just fair entertainment, and hardly a good source for the history of the event. If you want the best historical approach at the Titanic's story, see \"A Night to Remember,\" and if you prefer a highly dramatic and fictionalized version, the 1997 Titanic is better than this one.",
         "This was incomparably better than the glitzy, overhyped, award-winning movie of the same title that came out the following year. It's unfortunate that a first-class piece of work like this is virtually overlooked, while another movie that has nothing to offer but multimillion-dollar special effects and a silly, inaccurate, unrealistic story received so much attention and praise.",
         "In 1996 I decided this TV miniseries was a ripoff to grab viewers' attention a year before James Cameron's blockbuster opened. I haven't changed my mind. The plot is mechanical as a watch; within minutes of meeting each new character, or of their shipboard meetings with each other, we know almost exactly what will happen to each one. The writers resort to the tired ploy of having characters introduce each other to viewers--e.g., Eva Marie Saint, a society matron, \"explains\" others to her granddaughter: Molly Brown, vulgar but too rich to ignore, the disreputable Mr Guggenheim, the \"Jewish\" Strausses. The acting stinks all round. Worst, from any standpoint, is the hysterical mother who refuses to leave her cabin for the lifeboats without her husband. The whole thread involving this couple and their nanny sets your teeth on edge, though it is based on a real couple who died because they stayed on board too long to find their son, who was safe in a lifeboat w/the nanny. The thread is so badly written, so implausibly dramatized, that were it not that the mother's idiocy dooms her annoyingly precocious daughter, it's almost possible to say she deserves to drown. As usual, Ms Zeta Jones is more impressed with her own beauty than with the need to act. Marilu Henner is worse miscast as Molly Brown in this film than Cloris Leachman in \"S.O.S. Titanic\" (1979); the real Molly was not as brazen as the vulgarian we see here. Henner seems trapped in some proto-feminist, sexually revolutionized time warp. George C. Scott was in poor health in 1996, and seems propped up for many of his scenes as Capt. Smith; was his melodramatic characterization an effort to compensate for physical immobility? Tim Curry badly overdoes the slime as a lustful, larcenous steward. The only remotely believable figures are a young British criminal, his Danish shipboard sweetheart, and the British working-class family with whom she travels. Avoid this one. It sank before it ever left the dock. The iceberg might as well have been lurking in Southampton harbor.",
         "Well, for a TV production this still is a quite good one. Of course it's not as well known and appreciated as the multiple Oscar winner from 1997, this movie fairly much tells the same story, with the same characters and situations but also with the same sort of stupid fiction writing. It's an almost 3 hour long production, which means that you'll have to go through a lot of drama before the sinking is starting. This movie has a couple of fictitious characters and plot-lines in it that are just too distracting from the bigger picture and above all totally unnecessarily. I mean, when will film-makers learn that the true story about the Titanic itself is already good and fascinating enough to fill a movie with, with all of its persons and real life situations involved. In that regard this movie really doesn't differ much from similar attempts and therefore also adds little to what has been told so far about the Titanic. Guess this movie got made to profit from the hype surrounding the James Cameron production with the same tittle, which had already began production first in 1995. They had to rush this movie to release it before the James Cameron movie, which is the reason why the movie is not always very slick looking but considering the budget, the circumstances and the time span this movie got made in, the end result is still quite surprising and satisfying. Both movies are comparable in lots of ways and some sequences and lines of dialog are just totally the same, which is a bit of an odd sight at times to notice. This is not a lame looking TV production, with low production values and bad acting involved throughout. They actually did a good job with filming it and the effects are also surprisingly good looking, especially for an 1996 movie with such a restrained budget. The movie has a quite impressing cast but yet none of the characters really work out well. It's because the actors are not really given much room to work with, also since the movie can't really seem to decide on which characters to put its main emphasis. The movie focuses a bit on everyone now, making the movie filled with plenty of characters and some uninteresting side tracks. Because of this some of the story lines within the movie also don't really work out. A bit of a shame of the talents of the fine actors, such as George C. Scott, Tim Curry, Eva Marie Saint and Catherine Zeta-Jones. A quite good attempt but it just isn't special or impressive enough to rate this even above the over praised 1997 version. 6/10 http://bobafett1138.blogspot.com/",
         "I'm kidding, but the network executive who OK's this turkey should have gone down with the ship. I was born on an April 15 (but not 1912, the date the RMS Titanic sank), so this has been a favorite subject of mine -- beginning when I read Walter Lord's \"A Night to Remember\" as a kid not too long after it was published in 1955. And then there's that tremendously emotionally charged movie of the same title and based on the book that came out in 1958. I felt like I was there, and experiencing it from the perspective of passengers in steerage, second & first class, as well as the crew. Many others have commented on the factual inaccuracies, wooden acting, and contrived plot developments that supposedly were added to \"spice it up,\" as if this human tragedy of titanic proportions needs \"spicing.\" What bothered me the most were a number of scenes which made me just cringe, fold my arms and slowly shake my head, thinking, \"Oh, Come on! Nobody could/would do that and expect to get away with it. Do they really think viewers are so dense to buy this\" As just a few examples, and these may or may not be spoilers: Do you really think Capt. Smith would let a passenger (female or male) take steerage control of the ship on a visit to the bridge, just for fun? If he actually did, and it got to the White Star Line in New York, I suspect he would have started his retirement before his last return trip home. Test this on your next cruise: try to go to the bridge and ask to steer the ship for awhile. Do you really think J. Bruce Ismay, the chairman of the White Star Line, would climb down to the boiler room and order more boilers to be fired up for more speed? He would do this to defy the orders of their boss, Capt. Smith? And the crew would go along with it? No crew would go against the orders of their next in command, as ordered by their captain. Get real. Bruce Ismay is another real person just trashed by this movie. He did save himself by climbing into a lifeboat when there were no other women or children at that station (although there were plenty elsewhere). At the inquiries, he said he did that so that the full story could be told. Nobody believed that. He lost his job at White Star; White Star was absorbed by Cunard, and I understand Ismay died alone and lonely in the U.K. in the 1950s. The contrived character Simon \"Snidley Whiplash\" Doonan is so blatantly obnoxious and evil as a member of the ship's passenger crew, that he should have been reported by someone -- but never was. Instead, he strolls into cabins at his leisure and takes his time robbing first cabin passengers. And gets away with it. The often mentioned rape-in-the-shower scene: What are the odds? The Titanic was the largest ship afloat, with well over 1,500 passengers on board. The vast majority were in steerage, where the rape scene occurred. \"Steerage\" on the Titanic was better than 2nd class on other liners: the food was better, the service and cabins were better. . . . most passengers never had electric light or indoor plumbing at home. They had it here for the first time. If there were communal showers -- and I don't think there were -- I suspect they'd be in constant use as a real novelty. And they'd be segregated by sex. So, here's this gal in a communal shower. But she's ALL BY HERSELF -- in a steerage section filled with several hundred other women who have never had the experience of a hot shower before. And \"Snidley\" Simon casually strolls in without a care or fear in the world and rapes her --and smirkingly gets away with it. Oh, come on. What are the odds? And then there's the business with Frederick Fleet in the lookout tower being ordered to release his binoculars for their return to the bridge, as if that were a mega blunder and contributing factor to the disaster. Oh, pleeeeeeze! What bridge command on any ship would order the lookout to give up his binoculars? Especially after receiving ice warnings. What does the bridge want to see that's different than what the lookout NEEDS to see? They could call on the phone and ask Fleet to look. Anyway, on the night of April 14, there was no moon, but a dead-calm sea and a velvet sky blanketed with stars. The two lookouts didn't have, and didn't need, binoculars because it was pitch black. What tipped Fleet off was that, dead ahead, there was a growing blackness due to an absence of stars. It was the iceberg, which led to his clanging the emergency bell in the lookout tower and calling the bridge. If there were moonlight, they would have seen it sooner. If the sea were a bit rougher, they would have seen the white foam of the churn hitting the outline of the base of the burg. To claim, as this film does, that the lookout was forced to give up the binoculars is a lie and a gross disservice to the memories of the officers and crew of the RMS Titanic. Anyone who wants to understand and be profoundly moved by this tragedy as experienced by realistic and representative folks of all classes, crew and officers -- try \"A Night to Remember.\" It doesn't need shower scenes, rapes, \"Snidley Whiplash\" or other contrived plots to make it \"interesting.\""
      ],
      "genres": [
         "Action",
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Konigsberg/Sanitsky Company",
         "American Zoetrope",
         "Crescent Entertainment"
      ],
      "summaries": [
         "The plot focuses on the romances of two couples upon the doomed ship's maiden voyage. Isabella Paradine (Catherine Zeta-Jones) is a wealthy woman mourning the loss of her aunt, who reignites a romance with former flame Wynn Park (Peter Gallagher). Meanwhile, a charming ne'er-do-well named Jamie Perse (Mike Doyle) steals a ticket for the ship, and falls for a sweet innocent Irish girl on board. But their romance is threatened by the villainous Simon Doonan (Tim Curry), who has discovered about the ticket and makes Jamie his unwilling accomplice, as well as having sinister plans for the girl.",
         "The tale of the RMS Titanic, the famous passenger liner that claimed to be unsinkable. This claim was proved to be false when it hit an iceberg when crossing the Atlantic Ocean. The drama unfolds as the passengers and crew race against time to get off the sinking vessel and decide who will go into the lifeboats that can only hold half of the ship's population. Those who do not get the privilege of a space on a lifeboat face almost certain death.",
         "Everyone thought the RMS Titanic was the safest ship in the world - a leading shipbuilding journal proclaimed it \"unsinkable\" because of its watertight compartment design. On its first trip from England to New York City, it collided with an iceberg in the middle of the North Atlantic. The much-publicized \"unsinkable\" watertight compartment design was never designed to cope with such extensive damage, and the \"unsinkable\" ship starts to go down. Even worse, more than half the 2200+ passengers and crew on board are already doomed, as the Titanic is only carrying lifeboats for about 1200. This is the frightening story of the passengers and crew's struggles to stay alive. Who will escape the Titanic before it goes nearly two miles to the ocean bottom, and survive the panic as well as the 28-degree water?",
         "The story of the 1912 sinking of the largest luxury liner ever built, the tragedy that befell over two thousand of the rich and famous as well as of the poor and unknown passengers aboard the doomed ship."
      ],
      "budget": 13000000
   },
   "movielensId": 118916,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-11-17",
      "dvdReleaseDate": null,
      "directors": ["Robert Lieberman"],
      "runtime": 173,
      "movieId": 118916,
      "title": "Titanic",
      "mpaa": "PG-13",
      "actors": [
         "Peter Gallagher",
         "George C. Scott",
         "Catherine Zeta-Jones",
         "Eva Marie Saint",
         "Tim Curry",
         "Roger Rees",
         "Harley Jane Kozak",
         "Marilu Henner",
         "Mike Doyle",
         "Sonsee Neu",
         "Felicity Waterman",
         "Malcolm Stewart",
         "Kevin McNulty",
         "Kavan Smith",
         "Terence Kelly",
         "Scott Hylands",
         "Janne Mortil",
         "Tamsin Kelsey",
         "Eric Keenleyside",
         "Kevin Conway",
         "Devon Hoholuk",
         "Crystal Verge",
         "Bernard Cuffling",
         "Barry Pepper",
         "Matt Hill",
         "Don MacKay",
         "Stephen Dimopoulos",
         "Matthew Walker",
         "Chris Humphreys",
         "Gerard Plunkett",
         "Molly Parker",
         "Hagan Beggs",
         "Brent Stait",
         "Aaron Pearl",
         "Byron Lucas",
         "Ron Halder",
         "Eric Michael Roy",
         "Gavin Craig",
         "Janie Woods-Morris",
         "Peter Haworth",
         "Martin Evans",
         "Katharine Isabelle",
         "Lachlan Murdoch",
         "Doug Abrahams",
         "Robin Driscoll",
         "Tina Fiorda",
         "Cindy Girling",
         "Kim Kondrashoff",
         "Richard Lautsch",
         "John Tench",
         "Shaina Tianne Unger",
         "Dale Wilson"
      ],
      "imdbMovieId": "0115392",
      "originalTitle": "Titanic",
      "genres": [
         "Action",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["yxIVO7P0iig"],
      "plotSummary": "A story of the romances of two couples upon the doomed ship. Isabella Paradine (Catherine Zeta Jones) is a wealthy woman mourning the loss of her aunt, who reignites a romance with old flame, Wynn Park (Peter Gallagher). Meanwhile, a charming ne'er do well named Jamie Perse (Mike Doyle) steals a ticket for the ship, and falls for a sweet innocent Irish girl on board. But their romance is threatened by the villainous Simon Doonan (Tim Curry), who has discovered about the ticket and makes Jamie his unwilling accomplice, as well as having sinister plans for the girl.",
      "tmdbMovieId": 2699,
      "avgRating": 2.6,
      "releaseYear": "1996",
      "numRatings": 10,
      "posterPath": "/kvSt1JSPnAny4XhI5PksAtMwp4P.jpg"
   }
}