{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "dysfunctional marriage",
            "id": 10061
         },
         {
            "name": "pregnancy",
            "id": 13149
         },
         {
            "name": "self-liberation",
            "id": 197705
         },
         {
            "name": "1920s",
            "id": 207876
         }
      ],
      "imdb_id": "tt1654829",
      "video": false,
      "title": "Thérèse",
      "recommendations": [
         145960,
         103881,
         112193,
         116695,
         67696,
         102492,
         80141,
         145666,
         101411,
         423179,
         100764,
         184915,
         259146,
         410156,
         429866,
         117198,
         226343,
         46111,
         221768,
         431061
      ],
      "backdrop_path": "/lmBlePZBi5sZftTVQVwo7C90PDl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Thérèse Desqueyroux",
               "gender": 1,
               "credit_id": "52fe4ad0c3a36847f81e33d7",
               "name": "Audrey Tautou",
               "profile_path": "/pKfmpmZgH2LDPK4l1GbtnCWTukf.jpg",
               "id": 2405,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Bernard Desqueyroux",
               "gender": 2,
               "credit_id": "52fe4ad0c3a36847f81e33db",
               "name": "Gilles Lellouche",
               "profile_path": "/A4bSPMA9aSVumMtz7WRQCvKyYMp.jpg",
               "id": 54291,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Anne",
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33df",
               "name": "Anaïs Demoustier",
               "profile_path": "/kObYOu3UYkNcQGg1gnl4xitwhNc.jpg",
               "id": 123989,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Jean Azevedo",
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33e3",
               "name": "Stanley Weber",
               "profile_path": "/ex59nBpmAeXCsXrebqq8tadevo0.jpg",
               "id": 578081,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "L'avocat de Thérèse Desqueyroux",
               "gender": 2,
               "credit_id": "52fe4ad0c3a36847f81e33e7",
               "name": "Yves Jacques",
               "profile_path": "/5EPwdqBBa0pYrxsRGXC4Gq7kvQx.jpg",
               "id": 38529,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Monsieur Larroque",
               "gender": 2,
               "credit_id": "52fe4ad0c3a36847f81e33eb",
               "name": "Francis Perrin",
               "profile_path": "/1nSSPMgTgxDGvBuN5Kw9TypK9Pq.jpg",
               "id": 147043,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Tante Clara",
               "gender": 1,
               "credit_id": "52fe4ad0c3a36847f81e33ef",
               "name": "Isabelle Sadoyan",
               "profile_path": "/q5jstjdpu3o6OeldK1sNuqs8lhH.jpg",
               "id": 38501,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Madame de la Trave",
               "gender": 1,
               "credit_id": "52fe4ad0c3a36847f81e33f3",
               "name": "Catherine Arditi",
               "profile_path": "/viqXuOkKccGffjlAneeFnv30Y4n.jpg",
               "id": 55927,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Deguilhem",
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33f7",
               "name": "Jérôme Thibault",
               "profile_path": null,
               "id": 1049253,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ad0c3a36847f81e33b5",
               "name": "Claude Miller",
               "profile_path": "/s3zRKECzjam2SrhRIHmr3vBcjlL.jpg",
               "id": 18209,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33bb",
               "name": "François Mauriac",
               "profile_path": null,
               "id": 1049252,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ad0c3a36847f81e33c1",
               "name": "Yves Marmion",
               "profile_path": null,
               "id": 54288,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33c7",
               "name": "Gérard de Battista",
               "profile_path": null,
               "id": 38492,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33cd",
               "name": "Véronique Lange",
               "profile_path": null,
               "id": 23978,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ad0c3a36847f81e33d3",
               "name": "Jacqueline Bouchard",
               "profile_path": null,
               "id": 54284,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "53a5f84ec3a36874950011dc",
               "name": "François Mauriac",
               "profile_path": null,
               "id": 1049252,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53a5f85fc3a36874950011de",
               "name": "Claude Miller",
               "profile_path": "/s3zRKECzjam2SrhRIHmr3vBcjlL.jpg",
               "id": 18209,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57ab06b4925141065e000f67",
               "name": "Nathalie Carter",
               "profile_path": "/yo80M2BecNXFMIv4uPccThh52bm.jpg",
               "id": 84473,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.81201,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 110323,
      "vote_count": 35,
      "budget": 0,
      "overview": "The unhappily married woman struggles to break free from social pressures and her boring suburban setting.",
      "similar": [
         306819,
         9313,
         2926,
         707,
         10160,
         283227,
         16869,
         1574,
         612,
         10545,
         10404,
         64682,
         82695,
         112160,
         80,
         88,
         311,
         86331,
         37135,
         314095
      ],
      "original_title": "Thérèse Desqueyroux",
      "runtime": 110,
      "poster_path": "/1dbMck5ldr7VinuE54Ln9mBQg0z.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "UGC Distribution",
         "id": 3578,
         "origin_country": ""
      }],
      "release_date": "2012-05-27",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "The fate of a woman.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Claude Miller"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "François Mauriac",
         "Claude Miller"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1654829/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0MzQ0NTk2N15BMl5BanBnXkFtZTcwMDE2MDY3OQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Audrey Tautou, Gilles Lellouche, Anaïs Demoustier | See full cast and crew »"],
      "reviews": [
         "This film is about a blue blooded woman marrying a tycoon, but quickly finds out that marriage is not a thing she likes. The title \"Thérèse Desqueyroux\" doesn't give the plot away, but the Hong Kong Chinese title does. As a result, I kept guessing how the plot will turn out. Initially, we see Thérèse having a rather entangled relationship with Anne, which may or may not have played a part in her dissatisfaction in Thérèse's subsequent marriage. Then, the marriage itself is portrayed well, with the husband giving Thérèse much love that is clearly not reciprocated. However, all these supposed seeds that led to the deed did not adequately explain Thérèse's criminal action. Without a plausible motive, I was left to wonder exactly why she did such a horrible deed. Such a lack of motive may drive suspense and keep viewers on edge, but in \"Thérèse Desqueyroux\" it only serves to confuse. In addition, the subplot between Thérèse and Anne, and between Anne and Jean were left hanging, which was quite a pity. The amazing contrasts between the pre-deed, post-deed and liberated Thérèse could not help to lift \"Thérèse Desqueyroux\" to becoming a great film. I think it is a good film but it is unfortunately masked by hanging subplots and confusion.",
         "French screenwriter, producer and director Claude Miller's fifteenth and final feature film which he co-wrote with French screenwriter Natalie Carter, is an adaptation of a novel from 1927 by French author and playwright François Mauriac (1895-1970) and a remake of a French film from 1962 by French filmmaker Georges Franju (1912-1987). It premiered Out of competition at the 65th Cannes International Film Festival in 2012, was screened in the Special Presentations section at the 37th Toronto International Film Festival in 2012, was shot on locations in France and is a French production which was produced by producer Yves Marmion. It tells the story about a woman named Thérèse Desqueyroux who lives in a Provencal village in France with her father and her grandmother. Thérèse has a close and sister-like relationship with a girl named Anne de la Trave who lives in a mansion with her mother and brother named Bernard who is a hunter and a landowner, but after Thérèse marries Bernard and her friend meets a man named Jean Azevedo they don't get to see each other as much as before and Thérèse begins to regard her marriage as conventional and as a prison of duties where she no longer recognizes herself. Distinctly and brilliantly directed by French filmmaker Claude Miller (1942-2012), this quietly paced fictional tale which is narrated by the main character and mostly from her point of view, draws a mindful and tangible portrayal of a cultured French woman who after choosing to become a wife and realizing what it entails is so plagued by her decision and bored by her Catholic husband that she commits a crucial act. While notable for its naturalistic and atmospheric milieu depictions, sterling cinematography by French cinematographer Gérard De Battista, production design by production designer Laurence Brenguier, costume design by French costume designer Jacqueline Bouchard and use of sound and light, this dialog-driven, monologue-driven and narrative-driven story about an independent-minded woman who discovers her true identity after becoming a someone in a bourgeoisie society depicts a multifaceted study of character and contains an efficient instrumental score. This internally dramatic, non-judgmental, rhythmic, reflective and romantic drama which is set in Argelouse in the Landes department in Southwestern France during the 1920s in the aftermath of the First World War and where a young woman falls in love with a Jewish man whom her family prevents her from seeing as they have a man from another family named Deguihelm in mind for her, and her closest friend whom has married her brother is suffocating in her matrimony, is impelled and reinforced by its fragmented narrative structure, substantial character development, subtle continuity, timely use of music, undertones of mystery and the distinguished acting performances by French actress Audrey Tautou, French actor, screenwriter and director Gilles Lellouche and French actress Anaïs Demoustier. A cinematographic, nuanced, eloquent and lyrical period piece which honors the art of storytelling in cinema.",
         "'Thérèse Desqueyroux' is a French drama set in the 1920s in which Audrey Tautou, as the titular Thérèse, is content to play the iconoclast in her stuffy husband's family. But when her best friend (also her sister-in-law) describes her passionate relationship with an attractive young Portuguese man, Thérèse's emotions take a more sinister turn. My one complaint about this is that as Thérèse's husband (played by Gilles Lellouche) is such a central part of the plot it's a shame he is portrayed as such a one-dimensional duffer, ignorant of his wife's feelings in the most stereotypical way, but apart from that this is quite an enjoyable production, both in terms of the plot and the idyllic coastal scenery in which much of the film is set.",
         "I found this movie on Netflix streaming movies. It is in French with English subtitles. I speak a bit of French, but man generic French is so quick that I could barely understand what they were saying, so the subtitles are important. I became a big Audrey Tautou fan when I saw \"Amelie\" the first time. Since then I have seen a total of six of her movies, she is always good, as she is here. It is set in the 1920s France, Audrey Tautou is Thérèse Larroque, in a family that owns some property laden with pine forests. This becomes a significant fact during the movie, as she gets married to a man who also owns land with pine forests and together their pine forest wealth will be great. But it also becomes a threat when, during a period of drought, a forest fire threatens their holdings. Almost as a ritual rather than a love affair Thérèse marries an older man, fine actor Gilles Lellouche as Bernard Desqueyroux. He is a nice man, reasonably handsome, loves his hunting, and sees Thérèse mostly as a way to have a family. And hopefully a son to carry on the family name. But there never was any passion in their relationship. The movie, as titled, is about Thérèse, her unhappiness and feeling trapped in the marriage. Her husband has some symptoms which require medication, and he is prescribed some sort of arsenic drops, only three a day with water. But soon Thérèse sees this as an opportunity, maybe a few more drops each day will do the trick. Of course he gets ill but recovers, her ruse is exposed and she even has to defend herself in court, with the cooperation of her husband. But their relationship, whatever there was of it, is badly damaged. Thérèse has a daughter, the baby is virtually taken away from her by family members, and seems to be growing up without even realizing Thérèse is her mother. Thérèse seems only mildly upset by that development, if at all. Seems maybe she wasn't cut out to be a wife or a mother! In the very last scene, in the city as Bernard tells her goodbye (pronouncing her name 'tezz') then we see her walking among all the people in the street, a wry smile on her face. Was she thinking, \"All-in-all that worked out pretty well. Now I can start my life.\" An excellent character study, Tautou is great.",
         "This excellent film, like the novel, has a challengingly \"modern\", existential feel, with themes that bring it closer to the ideas of Camus and Sartre than many of Mauriac's other works. Thérèse isn't really sure why she acts in the way she does, but her character, thanks largely to Tautou's performance, is so complex and nuanced that, far from leading to \"confusion\", as another reviewer has suggested, it simply seems real. Perhaps too \"real\" to be hugely dramatic, but real enough to be compelling and fascinating. Gilles Lellouche plays husband Bernard to perfection, too, with just the right amount of odious materialism and hypocrisy, combined with a tinge of genuine sympathy. He genuinely can't comprehend his wife and her actions, and responds in the way that he thinks best. The movie is beautifully and atmospherically shot - the best compliment I can pay is that it looks just how I imagined it when I read the book. Plus it made me want to read the novel again, because it reminded me just how powerful and \"modern\" a work it is. Despite the film's length, there are no \"longueurs\" (boring bits), and the plot feels surprisingly tight given the lack of action. So watch this film, enjoy the \"look\", and be surprised and challenged by the characters and their motivations, and by just how modern Mauriac's ideas were, way back in the 1920s. Definitely recommended.",
         "Clearly Audrey Tautao has now acquired sufficient clout to cherry pick her roles and equally clearly she is weary of playing adorable air-heads and, looking around for something with which to display her acting chops, came up with Francois Mauriac's old war-horse of a novel from 1927, already filmed half a century ago by Georges Franju. Claude Miller was a sick man - he actually died shortly after the shoot - and arguably in no position to say nay so here we are. No one is going to accuse this of being a laff riot in fact Tautao cracks a smile only on one - or possibly two - occasions otherwise it's all very sombre, long takes, longer faces, an attempt to make boredom photogenic, for yes, Therese and Madame Bovary are sisters under the skin albeit Therese has a tad more sand, and has also a little in common with Madeleine Smith, late of Edinburgh. Gilles Lellouche turns in yet another fine performance and the movie tests high on atmosphere but I doubt it will find its audience.",
         "\"Therese\" is a lovely looking film. The characters are all attractive, the scenery is pristine and engaging, and the colors really pop out at you. The cinematography is near top-notch. Ultimately, this is a very dark, and rather depressing story. Although arguably a victim of circumstance, the lead character comes across as rather self-absorbed and pathetic. I'm not sure if that was the intention or not, or even if there was an intention. The story and dialogue are sufficiently sophisticated to keep the viewer's attention. Overall a solid piece of work with good performances from the cast. If you liked this review, then please check out my other reviews. I try to review the movies which not many people see.",
         "The air-headed Audrey Tautou acquires a brain in this adaptation of a Francois Mauriac novel. She is heiress of thousands of acres of Aquitaine, including a huge stand of timber and miles of sandy beaches, and marries the man next door, who owns almost as much. She has a dreamy girl-friend (hubby's sister) who falls in love and is locked up for it, to marry the man of her family's choice. In short, Audrey is living in an open prison and decides to off her husband, who regularly takes four drops of arsenic for his heart condition. She forges a prescription and radically ups his dose until he nearly dies. The family sticks together and backs up her phony story, then locks her away in a tatty loft bedroom, deprived for ever of her infant daughter. Only at the end of nearly two hours does her husband announce that she is to be set free. She announces that she will move to a hotel in Paris and live her own life. On that happy note, the film ends, but not before we have lived through her hellish existence for a little too long. Recommended for Tautou's performance.",
         "Contains spoilers! Well this is a very odd little movie, and one that has a lot of similarities to another movie I saw (and reviewed) recently, the \"Kate Winslet\" version of \"Mildred Pierce\". Both movies are based on novels of no great distinction that should have otherwise been relegated to the pulping machines. Inexplicably this is the second film version to be made of both novels. Since both novels are now quite old the latest movie renditions are now period pieces, and that seems to be the only possible interest to a viewer and rationale for making a film which if not deep is at least \"beautiful\". Both movies feature woman protagonists of low/no charisma, yet both are played by actresses of considerable talent and acclaim. Both actresses are called upon to display absolutely none of the skills for which they are noted, producing what is probably the nadir in both actresses portfolios. The movie opens with a breathless and hopelessly overacted sequence involving two young girls, and we gather there is a special bond between them, possibly to the extent of lesbianism. For reasons which are unclear one of them not only shoots a bird but considers it necessary to also wring its neck. This scene is apparently significant because it is reprised later in the movie. The dialog implies that it is intended that one girl's sister will in the not too distant future marry the other girl. We then abruptly cut to this predicted courtship but, at least to my surprise, the \"girl\" now looks about 40 and the brother/fiancé looks about 50. In the intervening 20 years since the introductory sequence the girl seems to have morphed from a flighty, babbling youth to a middle age woman with all the warmth and passion of a sack of spuds. The girl/woman and the brother duly marry not out of love but out of duty to their families and their mutual business interests, and the marriage is consummated with the girl acting like the afore-mentioned sack of spuds. Meanwhile the husband's sister has found the real deal, or so she thinks, she has fallen head over heels in love with a guy who sails a nice boat but who unfortunately does not pass muster in the social stakes. The sister's family lock her away in the time honored tradition of discouraging unsuitable suitors, and her old friend (her brother's wife � are you following all this...?) is called upon to encourage her lover to desist from the relationship. As it happens the \"lover\" is just a big scumbag who doesn't care about the girl at all. He is a \"free spirit\", a liberal, an avantgarde who quotes poetry and philosophy, the world is his oyster, he was just having a bit of fun and no one is going to tie him down, he is off to Paris. All this talk of freedom ignites a little spark in the brother's unfulfilled wife and she goes off into a little fantasy world which seems to suggest that she might shack up with this neer do well. But all this comes to nothing, that little thread peters out and goes nowhere. The wife has a baby she doesn't like, she tries to poison her husband and she may or may not have had a hand in burning down a good part of their combined pine plantation. She moons about a lot not looking very happy and she doesn't seem to know what she wants. Eventually her long suffering husband agrees to let her go to Paris to start a new life. In the final scene she still doesn't know what she wants, she doesn't know why she tried to poison her husband, in fact she doesn't really know anything. She is really a complete waste of space. Was there a message here? Was this novel/movie supposed to be some sort of comment on the role of women and their suppression by men and society? Was it supposed to be a celebration of liberation? A triumph of passion over societal expectations? Should we care about this woman, someone of zero passion, drive or warmth, or about her not very likable husband? What happened to the only interesting character in the story, the husband's sister? Or to her baby? Why were so many story threads started only to be abandoned? Why did they take a talented and attractive actress like Audry Tatou and made her look so ugly, boring and stupid? All these questions and more. All in all, much ado about nothing.",
         "Is there anything this actress can't do? I went into the film to see a woman deal with the social pressures of a period, maybe a film that reminded me of \"The Age of Innocence\", a time where women had to sit, listen, and maybe \"obey\" the social conventions. The preview was a bit elusive because it made you forget that you are dealing with France, Paris, and the unexpected, and that's exactly what you get. By the end, the main character has grown tired and despondent, but she has left a mark that earns everyone attention if not respect, and the most interesting scene is at the end, in a conversation between her and a leading character that reveals life is not as simple as it appears. This was a period of change, and Therese found a way to at least get on her way to some peace, but nothing is perfect. Therese is a child of privilege. Everything is in place for her set up marriage to improve all of those involved. Unfortunately, as she admits early in the film, she must deal with her own personal conflicts, and this might not be possible. She eventually finds a possible solution to her problems, but this might lead to even more problematic resolutions. What makes the film even more interesting is that her husband eventually becomes the more puzzling of the characters. He is not the standard chauvinistic and domineering standard. There is more to him, and that only leads to Therese becoming even more traumatized. The film is beautifully scored and photographed, and the art direction/costume design work here is reason enough to sit through the film, but as I said before, it's the entire cast's work that expands on that idea behind \"Midnight in Paris\", a kernel of a premise that Allen delivered with grace and fun. This is a serious film, and it shows that there is plenty of substance in everyone. Yes, powerful minds can be more than an asset at the right time. Just imagine what the lead character in \"Frances\" could have been if she had better luck. Therese is lucky she lives in the country, and that there is loyalty in her world. In the end, the film stops at a crucial time of her existence. Things are not over, just a new beginning."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Les films du 24",
         "France 3 Cinéma",
         "TF1 Droits Audiovisuels"
      ],
      "summaries": [
         "The year is 1926. In the Landes region, free-spirited Thérèse Larroque, the daughter of a wealthy pinery owner and radical-socialist politician, marries Bernard Desqueyroux, another pinery owner. Although she does it half-heartedly, she thinks that marriage may help her to \"sort out all the ideas in her mind\". But her disappointment is great. Her wedding night is all but fascinating and when she becomes pregnant she realizes the baby matters more to Bernard than herself. While Thérèse stifles in her husband's beautiful residence among stiff in-laws who do not think high of her, ideas keep on roaming her mind.",
         "An unhappily married woman struggles to break free from social pressures."
      ],
      "budget": 12700000
   },
   "movielensId": 119426,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2012-05-27",
      "dvdReleaseDate": null,
      "directors": ["Claude Miller"],
      "runtime": 110,
      "movieId": 119426,
      "title": "Thérèse",
      "mpaa": "",
      "actors": [
         "Audrey Tautou",
         "Gilles Lellouche",
         "Anaïs Demoustier",
         "Stanley Weber",
         "Yves Jacques",
         "Francis Perrin",
         "Isabelle Sadoyan",
         "Catherine Arditi",
         "Jérôme Thibault"
      ],
      "imdbMovieId": "1654829",
      "originalTitle": "Thérèse Desqueyroux",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The unhappily married woman struggles to break free from social pressures and her boring suburban setting.",
      "tmdbMovieId": 110323,
      "avgRating": 3.27778,
      "releaseYear": "2012",
      "numRatings": 9,
      "posterPath": "/1dbMck5ldr7VinuE54Ln9mBQg0z.jpg"
   }
}