{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0244196",
      "video": false,
      "title": "Second Skin",
      "recommendations": [
         122163,
         31128,
         29670,
         17728
      ],
      "backdrop_path": "/hPXrXHykqn9goA5JHOzgyzBEyOF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Crystal",
               "gender": 1,
               "credit_id": "52fe4617c3a368484e07e761",
               "name": "Natasha Henstridge",
               "profile_path": "/z0gm11WfolcmUUGDsTusUZsR60Y.jpg",
               "id": 57395,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sam Kane",
               "gender": 2,
               "credit_id": "52fe4617c3a368484e07e765",
               "name": "Angus Macfadyen",
               "profile_path": "/qTplz89WHXM4dGu0PVSarWEYHcO.jpg",
               "id": 2464,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tommy G",
               "gender": 2,
               "credit_id": "52fe4617c3a368484e07e769",
               "name": "Liam Waite",
               "profile_path": null,
               "id": 62031,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Merv Gutman",
               "gender": 2,
               "credit_id": "52fe4617c3a368484e07e76d",
               "name": "Peter Fonda",
               "profile_path": "/dgorN06SQ9ZNL2NY3I7BNxg93lc.jpg",
               "id": 8949,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Harvey",
               "gender": 0,
               "credit_id": "52fe4617c3a368484e07e771",
               "name": "André Jacobs",
               "profile_path": "/s6otB0T7b85VZMql5ppGToF5JrT.jpg",
               "id": 938734,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4618c3a368484e07e777",
               "name": "Darrell James Roodt",
               "profile_path": null,
               "id": 16730,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4618c3a368484e07e77d",
               "name": "John Lau",
               "profile_path": null,
               "id": 358070,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.581462,
      "production_countries": [],
      "id": 60119,
      "vote_count": 7,
      "budget": 3,
      "overview": "A tough guy named Tommy Gunn, with \"kaos\" tattooed on his neck, a beautiful blond named Crystal Ball who's struck by a car and can't remember her past, a sadistic scalpel-wielding mobster in Cleveland, a balding schmuck gambling in Las Vegas, a reclusive bookstore owner in a small coastal town who discourages customers, and the hit-and-run driver of the SUV that hits Crystal: what connects them? Sam, the bookstore owner, comes to Crystal's aid after the accident; an affair begins. When she's menaced by Tommy, Sam tries buying him off. As Crystal begins to remember her past, the question arises about Sam's: why is he in hiding?",
      "similar": [],
      "original_title": "Second Skin",
      "runtime": 95,
      "poster_path": "/vgfcDqtetKXYapoV3RzNXl6X5ma.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2000-12-22",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "A beautiful woman. A deadly scheme. A perfect murder.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Darrell Roodt"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["John Lau"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0244196/",
      "coverLink": null,
      "actors": [
         "Natasha Henstridge",
         "Angus Macfadyen",
         "Liam Waite"
      ],
      "reviews": [
         "I liked this movie right from the beginning. It's obvious by the way it looks that it isn't a blockbuster, but it certainly was entertaining, moody, and well executed. I especially liked the music, which added to the atmosphere of the film, and was written by former Prince band members Wendy & Lisa. It stars the lovely Natasha Henstridge as a mysterious woman who wanders into a small bookshop looking for work. The dubious owner is sceptical at first, and refuses her request even though he is attracted to her. But he is soon drawn to her, as he witnesses her being run over as she leaves his store. Many good plot twists and turns follow, in this stylish thriller. But the ending was unsatisfying, and left me wanting more.",
         "I loved this movie. It was so beautifully shot and the acting was terrific across the board. It was great to see Angus Macfadyen from Braveheart in a completely different role. And Natasha Henstridge is a terrific actress. The story was very fun. Lots of twists and turns. And one great turn in the end. I loved the music. I looked up the credits and it was by Wendy and Lisa of Prince fame. Check out Peter Fonda for a wickedly tongue in cheek bad guy. All in all a fantastic stylish film. Why wasn't this in the theatres!",
         "I caught this movie on TV after watching a rather suspicious promotional trailer. The first scene with the sensual Natasha Henstridge dressed in a semi-transparent white dress hooked me and I decided to give the movie a try. The first half of Second Skin is pretty tolerable. I felt I was watching a fair and honest low budget noir picture, certainly moving toward some major twists. But I could never expect the plot could become so flawed and the second half of the movie could become so lame and dreary. This predictable, cliché-ridden movie could have been interesting. The music and the photography create a nice, moody atmosphere. Henstridge is, well... sensual as the femme-fatale, and MacFadyen is ok as the guy running from his past. Even though I don't like the way some scenes are cut, the real problem is the plot which turns out to be some kind of mess in the second half of the movie. After the 90 minutes of Second Skin it's frustrating to realize probably nothing will linger in your memory apart from the beauty of Henstridge.",
         "I have no idea why people are giving this movie a bad rap. This is a really good (small) movie with a great surprise ending. You will not guess it, which is more than you can say for 90% of the movies out there. The story moves along through twists and turns. Yes, the lead actor, whatever his name is, is and odd looking duden and maybe miscast, but the plot is so good that it carries him along. Natasha is in top form, I wish she would stop making other crap movies because when she is given a role she plays it well, really well. I don't know if I would go out of my way to see this movie but I usually watch it when it shows up on cable, twice already. 8/10",
         "I caught this movie on late-night cable a few years ago, and watched it because I like Angus McFayden. I got wrapped up in the story, and it has stuck with me ever since. McFayden does such a good job of playing a suspicious, very guarded man who lets down his defenses when he falls for a beautiful woman. You can see in his eyes how he feels, without him ever having to say a word (reminds me of Russell Crowe).The pain he feels as he tells her how much he cares about her is palpable. You can tell how hard it is for him to let himself be vulnerable. Natasha Henstridge does a surprisingly effective job as the girl. She's not the world's best actress, but she makes us believe that McFayden's character would fall in love with her. The film was obviously shot on a shoe-string budget, but McFayden's acting helps bring the film up to a higher level. All in all, pretty good for late-night viewing.",
         "Nothing quite appears as it seems, right up to the unexpected twist at the end. All the characters have some kind of hidden agenda. Most of the actors were unknown to me, except for Fonda and his was a minor part at best; but I think it was very well acted, directed, and the cinematography was very well done. All in all, I think it was a pretty cool movie.",
         "The problem with this movie is the leaden touch of Darrell Roodt. Pretty photography and an absolutely gorgeous lead babe can't hide the fact that there is no plot, that the girl is getting involved with a guy who has the charisma of a rotting potato and that by the time you get to the mystery, you've really stopped caring. The movie _slowly_ meanders from one cliche to the next. Guy without a past runs a bookstore without clientele, when a beautiful babe comes in and spouts a number of tacky cliches. Then, in the mother of all plot devices, she walks out the store and _gets hit by a car_ so she can \"lose her memory\". Who cares? I don't. A waste of money.",
         "This dark mystery/thriller begins well enough, but it gets increasingly implausible until by the end it loses most of its credibility. Crystal Ball (Natasha Henstridge) walks into a second hand bookstore owned by Sam Kane (Angus MacFadyen) ostensibly to apply for a job. Upon leaving, she is hit by a car. Sam takes her to the hospital and cares for her while she recovers. The impact causes her to lose her memory, so she doesn't know who she is or where she lives. The two fall in love and then Crystal suddenly remembers that she was sent by Merv Gutman (Peter Fonda) to kill Sam because Merv thinks Sam stole money from him. The film goes through a number of gyrations including confrontations between Crystal and her boyfriend Tommy G (Liam Waite), Crystal and Merv, Sam and Tommy G, Sam and Merv, Crystal and Sam, etc., etc. The plot has a few interesting twists, but the dialogue is banal and many of the scenes drag. However, for a film made on a $3.5 Million budget, director Darrell Roodt delivers some excellent photography and shows himself to be talented at creating powerful imagery. If there are two things that stand out from this film, they are the talents of Roodt and Henstridge. Roodt gives the images style and richness with interesting perspective shots and a number of beautiful location shots. I'd like to see him get a more prominent project where he can put his talents to work. Natasha Henstridge carries the film with an excellent performance that should portend a shot at meatier roles in the future. Her striking appearance and superior acting ability is made even more obvious playing against journeyman Angus MacFadyen, whose performance here helps validate his relegation to supporting roles throughout his career. MacFayden is stiff and forced, contributing little to the believability of his character. As mediocre as MacFayden is, Liam Waite is worse. Peter Fonda gives a nefarious performance in a minor role. This film isn't bad for a B movie and shows twinkles on the horizon for Roodt and Henstridge. I rated it a 6/10. With a stronger screenplay, it could have been very entertaining.",
         "This movie is very good except for the ending.It is suppose to be a surprise to me it was a let down and a big one at that.The story is well construct you come to care for the two main characters and then wham the ending.I own a few of those movies with that ending but this one it does not work at all.Sam and Crystal goes through so much together to end this way is stupid.I can't explain without revealing this bad ending so see the movie it is good only the last 4 minutes are stupid.The acting is very good except one character you see only three times,what is she in this movie I don't know.That's why the ending is so bad.But see it it is worth the price of the renting.I give it a 7 out of ten,I was so mad when I saw the ending that I give it a 7 but on the whole movie beside my reservation on the ending it is worth a 9 out of ten.",
         "***SPOILERS*** What surprised me most about the movie \"Second Skin\" wasn't all the twist and turns as well as double and triple crossing of those in it. It was the fact that the movie was filmed in and around Capetwon South Africa. I could have sworn that the story took place in Southern California or at least on the sunny Florida coast. We have in the film noir \"Second Skin\" the usual mystery woman calling herself Crystal Ball, Natasha Henstridge, who has, after being hit by a runaway car, trouble remembering her past. There's also the somewhat strange used book store owner Sam Kane, Angus MacFadyen, who seems not at all interested in attracting customers to his store but also, in how he has no worries at all about paying the rent, independently wealthy. After Crystal's accident Sam gets very close to her not only hiring Crystal as his assistant, a job which at first Chrystal wanted, at the store but having this creepy looking guy Tommy G, Liam Waite, show up looking to buy children books not for any children but for himself! As things turn out Tommy G and Crystal do in fact know each other and are both working for the \"Man\" United Brotherhood of Tanners Union President Merv Gutman, Peter Fonda! ***SPOILERS*** As the movie slowly unfolds we realize that Sam the used book store man ain't exactly what he want's us, and Crystal, to think he is! In fact we also find that Crystal isn't exactly what she want's Sam, and us in the audience, to think who she's also! We also learn that Tommy G turns out to be not only Crystal's boyfriend but somehow working together with Sam in a elaborate pay-off scheme to Gutman whom Sam, before he became Sam, owns money too! On top of all this confusion there's former Goernment Treasury Agent Hawthorne, Norman Anstey, who's blackmailing Sam to expose his true identity, as if he didn't know that already, to Gutman and want's a cool half million dollars in order to keep his mouth shut! The film just goes on and on with a series of confusing sub-plots and mind boggling double-crosses with Sam seeming to take on at least two other identifies, which makes it hard to follow his actions in the movie, by the time its finally over! The most confusing and odd-ball character in the film is non other then Tanner Union President Merv Gutman. This guy is so off the wall that even when he explains his reasons for wanting to do in the luckless Sam, who already paid off his debt to him, you get the strange impression that he just escaped from a local loony bin! As for the big surprise ending the person providing the surprise was about the least surprising character in the movie! In that if you blinked or sneezed while watching \"Second Skin\" you could have very well have missed him, or her, in the previous less then cameo scene he was in!",
         "I found the twists and turns amusing right up to the very last one. Having seen it I feel that I shall have to watch it again to see if the chronology is right. For instance when you learn the truth about each character you would think that Crystal Ball should have already met Sam Kane. Another is the hit and run car having been stolen from... was it Cleveland, I'll have to see it again and do a pause on the driver as I have the impression that it was the \"other woman\". That would complicate no end the logic of the story. I found the acting good overall - though it was a little contrived to prevent the public seeing \"more\" of Natasha Henstridge in the \"love\" scenes. The DVD was sold here, a week ago, for 2euros, so the film company obviously didn't place much value in it.",
         "Standard mob story with pretty girl falling for the wrong guy. She ends up with amnesia and starts her life over with the guy who happened to be there. Lots of behind the scenes intrigue going on, with secrets being kept by everyone. Tough to tell who is scamming who, and just how we got to this point of payback. It all comes apparent in the end, but by then you really don't care. The characters do there lines okay, but not much to work with. He gets the pretty girl, but there is no spark and no reason to believe she would ever be with him. Maybe if they used different actors, then the emotion would have been better. Then we would try to believe the mystery or even bother to understand it. This looks like it could have been okay, but along the way it just ends up flat.",
         "\"Second Skin\" bets everything on a hot babe, a scenic local, a handful of decent actors, a weak story and loses. Henstridge bumps her head, loses her memory, falls for some guy, gets her memory back and remember she's supposed to kill him. The story waxes somewhat more convoluted but lacks character depth and gives us little reason to care. Camera work is artsy for artsy's sake...nice try but no cigar. Fonda is unconvincing as the ultimate heavy, etc. Overall, this flick is a stylish loser not worth the time.",
         "Pretty decent film noir, well acted, gets better as it goes along. Then a stupid tacked on surprise ending blows all sense of reality. God I hate it when they do that. Sure I was surprised. Why wouldn't I be? Why would I expect an ending that nothing suggested and that negates everything I've seen before? The movie has charismatic leads (Henstridge has done a lot of bad stuff, but she's very good here in what I can only describe as the Linda Fiorentino part), Peter Fonda is sho'nuff creepy as the villain, Liam Waite (Henstridge's real life partner) is convincing as a hit man, and Angus MacFadyn makes a believable hero. There are some nice (believable) twists and earned climaxes along the way. Some clichés, yes (amnesia). But all in all, a very good time until the silly betcha-didn't-see-that-coming, surprise-is-everything last couple of minutes. Oh well, life is full of disappointments.",
         "Believe it or not, it has just been shown on our national TV as some late hour production. I can do nothing more than to agree with the above-mentioned reviewers. One swallow does not a spring make, and I mean the gorgeous Natasha in the leading female role. Even a B-movie needs a plot (word that the director hum ... what's his name again does NOT use). This movie is so full of clichés it can be run as an example in the actor classes. Something that could be passable is completely destroyed by plot hole after another and a cliché after cliché. It becomes so apparent that the main male character which has the charisma of donkey in a meadow will be killed in the end that you nearly wanna shout at the crew - \"Hey, why are you taking us for idiots?\" This movie is so bad it could be entertaining just for that reason. If you are in the mood for mindless entertaining just for the sake of it, it's your piece of cake. So go ahead and watch it. 1/10 from me.",
         "This movie is not only bad, it's sad. It doesn't really deserve a review, but its silly pretentiousness calls out for some kind of response . The dialogue is so bad it's laughable, it has cardboard characters with cardboard acting, and, to remind you that you're looking at full-bore noir, it's loaded with clichés (a slinky femme fatale, thunder and lightning, a lot of rain, dark clubs, moody music, hookers, obvious villains with faces shaded in menacing darkness throughout; the list goes on). It has characters named Tommy Gunn (a gruesomely tattooed, gum-thwacking bad guy; see Richard Widmark, 1947, Kiss of Death), Sam (as in Spade, a sort of good guy), Gutman (as in Sydney Greenstreet's character in The Maltete Falcon), and Crystal Ball. Scriptwriter John Lau and director Darrell Roodt, in other words, seem to be having fun with 1940s-style noir films. Unfortunately, we don't get to share in the fun. It's an unintentionally hilarious flick because it plays it dead-straight from start to finish. (Sample dialogue: 'Cherchez la femme'. 'What's that?' 'It's French'. One of the most famous phrases in the French language, and the femme fatale has never heard of it. Jeez.) As parody, this might have been at least tolerable; when played straight it's screaming for ridicule. There's a twist at the end, and you don't see it coming, and how could you? The 'other' woman who gives it the twist appears in the film without any context, so the viewer is left befuddled by the ending more than shocked, which is what noir audiences in the 1940s used to be when they saw similar kinds of stuff. Noir directors in the '40s-early '50s (e.g. Samuel Fuller, Henry Hathaway, Jules Dassin) made some excellent (and very cheap) films, and they did them with style, good pacing, and believable dialogue. And they didn't have the luxury of sexual situations and famous four-letter words that saturate this pile of tripe, which apparently cost something like $3.5 million (not a lot these days, but still...) to make. The leftish Dassin, for one, is shouting from somewhere in Europe, where he's been cloistered since the witch-hunts of the 1950s. You could feed a lot of hungry people with $3.5 million, I can hear him saying. This film is laughable, and doesn't intend to be. Ultimately, that's why it's so sad.",
         "Natasha is very pretty, and yep she can act some, too. (Is it me, or is there more than a passing resemblance between her and Julia Roberts?) Fonda, while showing little range here, was quite creepy. The other girl in the movie... what the heck? She was in, what, 3? 4 scenes? 2? lines of dialogue? What was that all about? Maybe some of her scenes wound up getting cut, but, whatever the explanation, her character came out seeming bizarrely undershown, considering how important she turns out to be. Angus was alright. The big surprise for me here was Liam Waite; I hadn't seen him before, and I'm surprised to see the other comments on IMDB.com are so negative toward him. I found him quite intriguing here. The plot needed some help; I agree that the ending was poor, at least in part due to the mystery girl suddenly becoming so central at the end. There were other plot holes too, and a lot of cliches. Still, the mood of the film was nicely established, and I did feel some interest in the characters and finding out what their relationships were to one another. 4/10; would have been higher with a more rational plot, a more justifiable ending (not to say a cliched one, necessarily, but...), and a little more energy from the male lead.",
         "This B TV movie has every cliche in the book - we actually laughed watching it - commenting how many of the scenes \"only happen on tv\". This one has amnesiac with no ID, a guy saying \"Never point a gun unless you plan on using it\" - and then does it several times without using it, the classic dead guy who's not dead and attacks again, etc.' The only reason to watch is to get disappointed with yourself for having watched it - it's so bad you can't turn away!"
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Alliance Atlantis Communications",
         "Fiction Film & Television Limited",
         "Film Afrika Worldwide"
      ],
      "summaries": [
         "A tough guy named Tommy Gunn, with \"kaos\" tattooed on his neck, a beautiful blond named Crystal Ball who's struck by a car and can't remember her past, a sadistic scalpel-wielding mobster in Cleveland, a balding schmuck gambling in Las Vegas, a reclusive bookstore owner in a small coastal town who discourages customers, and the hit-and-run driver of the SUV that hits Crystal: what connects them? Sam, the bookstore owner, comes to Crystal's aid after the accident; an affair begins. When she's menaced by Tommy, Sam tries buying him off. As Crystal begins to remember her past, the question arises about Sam's: why is he in hiding?",
         "A man opens a small-town bookstore in order to escape his connections to a mobster, but is reluctantly drawn back to his dark past by a mysterious woman."
      ],
      "budget": 3500000
   },
   "movielensId": 119436,
   "movielens": {
      "languages": [""],
      "releaseDate": "2000-12-22",
      "dvdReleaseDate": null,
      "directors": ["Darrell James Roodt"],
      "runtime": 95,
      "movieId": 119436,
      "title": "Second Skin",
      "mpaa": "R",
      "actors": [
         "Natasha Henstridge",
         "Angus Macfadyen",
         "Liam Waite",
         "Peter Fonda",
         "André Jacobs"
      ],
      "imdbMovieId": "0244196",
      "originalTitle": "Second Skin",
      "genres": [
         "Drama",
         "Thriller",
         "Romance",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A tough guy named Tommy Gunn, with \"kaos\" tattooed on his neck, a beautiful blond named Crystal Ball who's struck by a car and can't remember her past, a sadistic scalpel-wielding mobster in Cleveland, a balding schmuck gambling in Las Vegas, a reclusive bookstore owner in a small coastal town who discourages customers, and the hit-and-run driver of the SUV that hits Crystal: what connects them? Sam, the bookstore owner, comes to Crystal's aid after the accident; an affair begins. When she's menaced by Tommy, Sam tries buying him off. As Crystal begins to remember her past, the question arises about Sam's: why is he in hiding?",
      "tmdbMovieId": 60119,
      "avgRating": 1,
      "releaseYear": "2000",
      "numRatings": 1,
      "posterPath": "/vgfcDqtetKXYapoV3RzNXl6X5ma.jpg"
   }
}