{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0106578",
      "video": false,
      "title": "Class of '61",
      "recommendations": [],
      "backdrop_path": "/fcmI0SzXO2geWtqcBUijqcqizEo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Devin O'Neil",
               "gender": 2,
               "credit_id": "52fe49e8c3a36847f81acd21",
               "name": "Clive Owen",
               "profile_path": "/jm2as6tLcvHCYQvmMYM4VK6JEnr.jpg",
               "id": 2296,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lily Magraw",
               "gender": 1,
               "credit_id": "52fe49e8c3a36847f81acd25",
               "name": "Laura Linney",
               "profile_path": "/unRRWITXrZsbk9iTmnjVxd6yZv9.jpg",
               "id": 350,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Terry O'Neil",
               "gender": 2,
               "credit_id": "52fe49e8c3a36847f81acd29",
               "name": "Christien Anholt",
               "profile_path": "/2HpTdq83tOiU03AoelFzmqwMNis.jpg",
               "id": 29409,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lucius",
               "gender": 2,
               "credit_id": "52fe49e8c3a36847f81acd2d",
               "name": "Andre Braugher",
               "profile_path": "/9VtD8RlQ0urgDKS7B8tR456dW50.jpg",
               "id": 6861,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Shelby Peyton",
               "gender": 2,
               "credit_id": "52fe49e8c3a36847f81acd31",
               "name": "Dan Futterman",
               "profile_path": "/bVcDnTi6y1bzE9HINbBtctkvtcY.jpg",
               "id": 5346,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "George Armstrong Custer",
               "gender": 2,
               "credit_id": "52fe49e8c3a36847f81acd35",
               "name": "Josh Lucas",
               "profile_path": "/gv7jI1SZLRXRVJnNGOS1zK6yWB.jpg",
               "id": 6164,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Lavinia",
               "gender": 1,
               "credit_id": "54e84e8ec3a36836e0001698",
               "name": "Penny Johnson",
               "profile_path": "/kdj8nqf7ouk436ZwtiHpCllfulN.jpg",
               "id": 1218219,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "54e84e9d92514111b8000d27",
               "name": "Stephen Root",
               "profile_path": "/sceCvLiv8xe2jQzrVn39wvosVHG.jpg",
               "id": 17401,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Dr. Leland Peyton",
               "gender": 2,
               "credit_id": "54e84ebac3a36836ea00188c",
               "name": "Len Cariou",
               "profile_path": "/sXYaqG6en0MGbXG0zpVaWD7y76W.jpg",
               "id": 41247,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 1,
               "credit_id": "54e84ed5c3a3684ea6000d3f",
               "name": "Beverly Todd",
               "profile_path": "/pu3WvCEFahtHXElYVwqgzo9x1p5.jpg",
               "id": 18292,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 2,
               "credit_id": "54e84eeac3a36836d6001430",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Shannon O'Neil",
               "gender": 1,
               "credit_id": "54e84f069251412eb4001727",
               "name": "Sophie Ward",
               "profile_path": "/fZUeign4RwFWa8DG4vqlM8m7cf6.jpg",
               "id": 31921,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49e8c3a36847f81acd3b",
               "name": "Gregory Hoblit",
               "profile_path": "/8HyVUTApvgRwz9cl11R7R8TBPqh.jpg",
               "id": 17812,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54e84cef925141117c000e97",
               "name": "Jonas McCord",
               "profile_path": "/zqKtO5T91xfJq6uqMfbQQe5dcCE.jpg",
               "id": 166469,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54e84d209251412eac00145b",
               "name": "Jerry Adams",
               "profile_path": null,
               "id": 936710,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54e84d3ec3a36836e0001676",
               "name": "Jonas McCord",
               "profile_path": null,
               "id": 1226336,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e84d50c3a36836ea001867",
               "name": "Steven Spielberg",
               "profile_path": "/pOK15UNaw75Bzj7BQO1ulehbPPm.jpg",
               "id": 488,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e84d62c3a36836e700176a",
               "name": "John Debney",
               "profile_path": "/hTrlvZlDXQk49nfc2BM9sjKfJv.jpg",
               "id": 4500,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "54e84d7f925141117c000ea8",
               "name": "Janusz Kamiński",
               "profile_path": "/5LNGARjEfMDOcEP6fMNtJypAGYx.jpg",
               "id": 492,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54e84d8fc3a36836dc001713",
               "name": "David Rosenbloom",
               "profile_path": "/zvScb6TbJ1EDwKVY1kpyiGVknzU.jpg",
               "id": 17816,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54e84d9ec3a36836d90015dc",
               "name": "Hank McCann",
               "profile_path": null,
               "id": 1087388,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "54e84dbfc3a36836d6001419",
               "name": "Richard B. Lewis",
               "profile_path": null,
               "id": 1137057,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "54e84ddac3a36836ea001876",
               "name": "Laurie Scott",
               "profile_path": null,
               "id": 1062178,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54e84df4c3a3684ea6000d21",
               "name": "Michael T. Boyd",
               "profile_path": null,
               "id": 65710,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54e84e1ac3a36836d6001420",
               "name": "Peter Bentley",
               "profile_path": null,
               "id": 1362909,
               "department": "Sound",
               "job": "Sound mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.674204,
      "production_countries": [],
      "id": 101125,
      "vote_count": 4,
      "budget": 0,
      "overview": "Three West Point 1861 generation cadets and friends go on opposite sides after the breakout of The Civil War, with tragic consequences. A subplot involves Lucius, a Shelby Peyton's slave, who kills a slave trader and goes on the run.",
      "similar": [
         98948,
         110104
      ],
      "original_title": "Class of '61",
      "runtime": 95,
      "poster_path": "/pbZkMsxiaikQJsyhZE0wHwJvQpA.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "1993-04-12",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gregory Hoblit"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Jonas McCord"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106578/",
      "coverLink": null,
      "actors": [
         "Christien Anholt",
         "Andre Braugher",
         "Dan Futterman"
      ],
      "reviews": [
         "I really enjoyed this film because I have a tremendous interest in American History... the Antebellum years and the Civil War in particular. I purchased it recently from a rack of previously-viewed videos on sale at the supermarket and I was very glad to add this one to my history video collection. Though not of the caliber of Civil War films such as \"Glory\" or \"Gettysburg,\" provides a lot of history on the pre-Civil War brotherhood among cadets at West Point. Maybe it's the gray uniforms, the youth, or the military discipline, but I am fascinated by the story of the Corps of Cadets from around 1830 to the brink of the War. I imagine what it must have been like to sit in a classroom with other young men, learning how to make war, then later putting the lessons to use against your own classmates! Actually, there were two classes graduated in 1861: one class in May, the other in June. the movie makes no real mention of this, except to mention Henry A. DuPont, first graduate of the May Class; and George Custer, last grad of the June Class. the reason for the two classes was not so much about the war, but it was the result of switching back to a four-year course of study, after a few years of experimenting with a five-year course (I think the first class had attended five years, the other for four). As the movie portrays, cadets were like brothers and often had nicknames for each other... George \"Fanny\" or \"Autie\" Custer; Alonzo \"Lon\" Cushing; James \"Beauty\" Stuart (for J.E.B. Stuart, class of 1854), etc. I say this film is \"Santa Fe Trail\" as it should have been because that 1940 film, while enjoyable, really fudges history. Cadets from several different classes are all graduating together. JEB Stuart and George Custer are portrayed as the best of friends and are side-by-side in stopping John Brown's 1859 insurrection at Harper's Ferry. In fact, Stuart and Custer were never friends, but enemies during the War. They faced each other (for the first time, I think) at Gettysburg in 1863 (Stuart was at the Harper's ferry Raid, but Custer was still a cadet at the Point when it took place). \"Fanny\" Custer plays a role in \"Class of '61,\" though his classmate chums, Dev O'Neill and Shelby Peyton are fictional. I believe they are respectively based on Partick Henry O'Rorke and John Pelham, two people you can look up. Anyway, I truly enjoy this film or any film which provides a window into mid-19th Century America.",
         "Class of 61 tells the story of a group of friends who are cadets at West Point at the outbreak of the civil war. While the story starts slow and lets us get to know about these folks as people and as friends, it ends abruptly at the Battle of Manassas. Not surprising really in that it was meant as the pilot for a TV series dealing with the civil war. As a movie it really doesn't stand alone all that well. Just as you get to know and care about the characters the film is over.",
         "I just saw the last two-thirds of this movie on TV, and was very impressed by it. I'm not fond of Civil War movies in general, because they are bound to be very sad. This movie fulfills that promise, but nonetheless I found myself liking it a lot. The Class of '61 succeeds in humanizing both sides of that terrible war, by giving you characters on both sides to root for. Rather than rooting for the North or the South, you instead find yourself rooting desperately for peace so the lives of the men and women involved will not be destroyed. Though many important issues are involved in the plot, the movie is about the characters, not about the issues. The acting is superb, especially for a TV movie. The relationship between Shelby, a southern gentleman, and Lucius, his friend and slave, is particularly compelling. This movie, on the whole, is very worth watching despite its inevitably depressing end.",
         "The \"Class of '61\" looks at the splitting apart of the Union through the lives of three West Point graduates and their ramifications of families and friends imparting a sense of the times; sentiments, circumstances, and political climate. From Sumter to First Manassas, this didactic presentation is an even blend of drama and history with enough of each to entertain and inform though it does spread itself to a necessary thinness. Not sufficient as a stand alone drama, \"Class of '61\" is worth a look for anyone interested in Civil War history. C+",
         "I likes the first and last 20 minutes, when there is dramatic action. But between the two, there was much too much banal personal stuff. None of it done well enough to be interesting. I found myself uninterested in their personal concern I also found it offensive in the way it showed a lot of misbehavior on the Union side but not similar stuff among the Confederates. Both sides were intolerant and the Confederates were first with conscription. The Confederate government was so corrupt that the front line troops were hungry even thought the Confederacy had plenty of food. (Enough for General Sherman to live off later.) The battle scenes were realistic, but at the end of the day it was unclear what had happened. An explanation afterward would have improved the film for me.",
         "Recent history has produced several made-for-TV movies which have glorified the southron cause of slavery and secession even more than DW Griffith's film Birth of A Nation. In this film Slaves obey their masters in conformance with Holy Writ (Colossians 3:22) and regard the plantation as home. This is a generous reading of the sands of time. Even as early as the 1950s with a real right wing star John Wayne in HORSE SOLDIERS, Hollywood showed how Black Southerners warmly greeted US Army troops. The answer to the writers of this film comes from Mr Lincoln himself: \"Anyone who thinks slavery is a good idea ought to try it out.\" On the other hand the costuming was excellent and the scenery was well done.",
         "Not the greatest of its kind, Class Of '61 suffers a hastily delivered plot, too many plot holes and sometimes, poor acting. Anyway, Clive Owen and Laura Linney alone saved this albeit a bit shallow effort, as their delivery is very decent and very deep. The sheer tragedy of a class split, of friendships destroyed, of mates killed in the same battle is shown here. Well, bother, that could have been much better, had Ron Maxwell done that in his sheer Gettysburg style and grandeur. What the movie does show well is the very banality of death at war, the immediacy of tragedy looming, the simplicity of bloodshed. No heroism, almost, just a real suffering of men and women. That could be a better movie, but even now, it is OK",
         "RELEASED TO TV IN 1993 and directed by Gregory Hoblit, \"The Class of '61\" details what happens when three West Point graduates & their friends opt for opposite sides when the The Civil War breaks out and the impending Battle of Bull Run destroys any delusions of a quick, glorious victory for the Union. Despite the limitations of a TV budget, this is a well-done Civil War drama that leads up to the Battle of Bull Run. While there aren't any sweeping shots of this initial battle (because the budget wouldn't allow for it), I liked the way the movie focuses on the individual's experience during battle with those in the immediate vicinity. Dan Futterman stands out as the main protagonist, but there are some future stars as well, like Clive Owen and Josh Lucas, the latter playing Armstrong Custer. The movie scores well on the female front with the jaw-dropping Sue-Ann Leeds, as well as Sophie Ward and a young Laura Linney. It's also interesting seeing Robert Newman again. Besides the closing battle sequence, a couple of scenes are dramatically exceptional: The compelling train sequence and, especially, the quiet fishing boat scene where the protagonist has an honest talk with his black friend, who also happens to be a family slave (Andre Braugher). FYI: This was originally intended as the first of a 13-episode miniseries. THE MOVIE RUNS 95 minutes. WRITER: Jonas McCord. GRADE: B-",
         "CLASS OF '61 Aspect ratio: 1.33:1 Sound format: Stereo In 1861, class members from the West Point Academy are torn apart by the outbreak of the Civil War. Gregory Hoblit's OK historical drama makes an obvious point - virtuous men are rendered blind by conflict - though the production seems a little stilted, despite authentic period detail and a cast of talented newcomers (Clive Owen, Christien Anholt, Josh Lucas, Andre Braugher, Laura Linney, etc.), toplined by Dan Futterman as a conscientious Southerner who takes up arms in defence of slavery, pitting him in direct conflict with his former Northern friends. The movie's emphasis on such a misguided - though sympathetic - character is particularly brave, but the drama is otherwise flat and superficial, and Hoblit's direction is efficient rather than inspired."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": [
         "Amblin Entertainment",
         "Universal Television"
      ],
      "summaries": ["Three West Point 1861 generation cadets and friends go on opposite sides after the breakout of The Civil War, with tragic consequences. A subplot involves Lucius, a Shelby Peyton's slave, who kills a slave trader and goes on the run."],
      "budget": 0
   },
   "movielensId": 119898,
   "movielens": {
      "languages": [
         "Deutsch",
         "English"
      ],
      "releaseDate": "1993-04-12",
      "dvdReleaseDate": null,
      "directors": ["Gregory Hoblit"],
      "runtime": 95,
      "movieId": 119898,
      "title": "Class of '61",
      "mpaa": "",
      "actors": [
         "Clive Owen",
         "Laura Linney",
         "Christien Anholt",
         "Andre Braugher",
         "Dan Futterman",
         "Josh Lucas",
         "Penny Johnson",
         "Stephen Root",
         "Len Cariou",
         "Beverly Todd",
         "Paul Guilfoyle",
         "Sophie Ward"
      ],
      "imdbMovieId": "0106578",
      "originalTitle": "Class of '61",
      "genres": [
         "Adventure",
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["U1AXkyiZQ6M"],
      "plotSummary": "Three West Point 1861 generation cadets and friends go on opposite sides after the breakout of The Civil War, with tragic consequences. A subplot involves Lucius, a Shelby Peyton's slave, who kills a slave trader and goes on the run.",
      "tmdbMovieId": 101125,
      "avgRating": 3.5,
      "releaseYear": "1993",
      "numRatings": 1,
      "posterPath": "/pbZkMsxiaikQJsyhZE0wHwJvQpA.jpg"
   }
}