{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "native american",
            "id": 10322
         },
         {
            "name": "fortress",
            "id": 33974
         }
      ],
      "imdb_id": "tt0045785",
      "video": false,
      "title": "Fort Vengeance",
      "recommendations": [],
      "backdrop_path": "/MAxSKl62KXN4u0RgzE8REQcO0I.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dick Ross",
               "gender": 2,
               "credit_id": "53871ba7c3a3681ad7002ade",
               "name": "James Craig",
               "profile_path": "/8sA77ErNY0AVPGN6pSdsjY0y166.jpg",
               "id": 82860,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Bridget Fitzgibbon",
               "gender": 1,
               "credit_id": "538726c4c3a3681af3002d36",
               "name": "Rita Moreno",
               "profile_path": "/cpu3QeMGvbkBLmrFy8dUxEP7zdd.jpg",
               "id": 13299,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Carey Ross",
               "gender": 2,
               "credit_id": "53f62ed70e0a267f8000597c",
               "name": "Keith Larsen",
               "profile_path": "/roXXjk8fBhAF2dDTA5LgXwDlde8.jpg",
               "id": 176860,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Inspector Trevett",
               "gender": 2,
               "credit_id": "53f630470e0a267f7d005a56",
               "name": "Reginald Denny",
               "profile_path": "/s8YBz4bSkFkLDvVLJeZcbrLCff8.jpg",
               "id": 3364,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Sgt. Saxon",
               "gender": 2,
               "credit_id": "53f630560e0a26419b004466",
               "name": "Charles Irwin",
               "profile_path": null,
               "id": 131612,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Chief Crowfoot",
               "gender": 2,
               "credit_id": "53f630630e0a267f7a00598e",
               "name": "Morris Ankrum",
               "profile_path": "/vLlnpSWAParcYOFMKL0nrNCYW3o.jpg",
               "id": 81182,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Patrick Fitzgibbon",
               "gender": 2,
               "credit_id": "55339df5c3a3682226005343",
               "name": "Emory Parnell",
               "profile_path": "/1duv3EnZjZSz8jgtXGZS4MOArNK.jpg",
               "id": 124875,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sitting Bull",
               "gender": 2,
               "credit_id": "55339e0fc3a36848ca003f9a",
               "name": "Michael Granger",
               "profile_path": "/lNQs0f8LaDEHMTSr6CkV9w4St45.jpg",
               "id": 83912,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "MacRae",
               "gender": 2,
               "credit_id": "55339e25c3a36852de0014e3",
               "name": "Guy Kingsford",
               "profile_path": null,
               "id": 96260,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Eagle Heart",
               "gender": 2,
               "credit_id": "55339e4492514152910050df",
               "name": "Paul Marion",
               "profile_path": null,
               "id": 139221,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "53871ac60e0a26144a00370f",
               "name": "Lesley Selander",
               "profile_path": "/iQMfk2Ujf2AW24XeIFVgLxGicKW.jpg",
               "id": 130325,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53871b050e0a26144d003707",
               "name": "Harry Neumann",
               "profile_path": null,
               "id": 98161,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "53871b690e0a261447003774",
               "name": "Paul Dunlap",
               "profile_path": null,
               "id": 19965,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "53f62fed0e0a267f770058a0",
               "name": "Daniel B. Ullman",
               "profile_path": null,
               "id": 103382,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.071879,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 272663,
      "vote_count": 0,
      "budget": 0,
      "overview": "Two brothers flee America and join the Canadian North West Mounted Police. One brother is good, the other bad, both men on a collision course just as trouble starts to brew with the Indians.",
      "similar": [
         581,
         3114,
         57201,
         281957,
         11897,
         196,
         49849,
         384680,
         9361,
         8584,
         6529,
         10530,
         57212,
         395834,
         10747,
         223485,
         35588,
         9023,
         264656,
         9359
      ],
      "original_title": "Fort Vengeance",
      "runtime": 75,
      "poster_path": "/wG9wYes3CVWNZJDttlZpd7ta4nZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Allied Artists Pictures",
            "id": 4928,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Walter Wanger Productions",
            "id": 10096,
            "origin_country": ""
         }
      ],
      "release_date": "1953-03-28",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Terror Outpost Of The Canadian Wilderness... where the Northwest Mounted's scarlet troopers faced the kill-mad hordes of Sitting Bull!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lesley Selander"],
      "runtime": 70,
      "synopsis": null,
      "writers": ["Daniel B. Ullman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045785/",
      "coverLink": null,
      "actors": [
         "James Craig",
         "Rita Moreno",
         "Keith Larsen"
      ],
      "reviews": [
         "Yea for Hollywood! I thought Raoul Walsh's Saskatchewan (1954) had the market cornered on placing mountain ranges in Saskatchewan. But no, Fort Vengeance beat Raoul to it by a year. This film is about as silly a portrayal of the North West Mounted Police as you'll find, so perhaps it warrants more than the 1 star rating I have given it. But it's so awful I didn't get the \"so bad it's good\" buzz I was hoping for. The movie set for Fort Vengeance is a sad affair, the producers went all out providing about 100 feet of ramshackle log fencing to give the movie some shots of the fort compound. Quite a let down for a fort with such an imposing name. I dug the fort's adobe guard house though, a nice bonus I suppose when your movie is set in Saskatchewan, but you film outdoors in California. Mountains, forests, and adobe buildings, yes this is the southern Saskatchewan I know so well. Sitting Bull sets his warriors loose on a Canadian wagon train which is fun, because 1) the Sioux didn't kill anyone while in Saskatchewan, and 2) the Canadian west didn't have wagon trains (um, Hollywood, that was YOUR country's history not ours). The Mountie's fur hats were neat-o, particularly when they wear them throughout the movie in mid summer. I'll have to remember that trick when I'm hiking among Saskatchewan's mountains (known here as hills) in the summer. Some of this fine film's other attractions - a young Rita Moreno has a few lines and does a few turns on the dance floor, the Indians all conveniently speak English, and yes, in the end the Mounties do get their man.",
         "FORT VENGEANCE – 1953 Allied Artists hits a real low with this stinker of a western production. Two brothers, James Craig and Keith Larsen, are on the run with the law in pursuit. They head up into Canada to escape. They have a minor dust up with some Sioux warriors who are likewise heading for Canada. The Sioux under Sitting Bull have hot footed it north after doing in Custer at Little Big Horn. The brothers end up joining the North West Mounted Police (R.C.M.P.) It seems like a good place to hide out. The Sioux try to stir up the local native tribe to join them in a return invasion of the Dakotas. Craig takes to being a lawman and quickly becomes popular among the Police as well as the local natives. Larsen on the other hand cannot give up his outlaw ways and is soon involved in murder and robbery. Stirring the pot is Sitting Bull, Michael Granger, who has his warrior's burn down several settler cabins as well as attack a wagon train. He hopes to force the local Indians to join in his cause. Chief Crowfoot, Morris Ankrum, does not buy it for an instant and tells Sitting Bull to behave or there will be war. War between the tribes is what he means. Needless to say Craig has to confront his brother, Larsen, about his evil ways. Duty turns out to be stronger than blood with Larsen eating more lead than is healthy. All the action takes place in the rocky hills and valleys of Saskatchewan. Of course the film producers overlook the fact there are no mountains etc in Saskatchewan. The place is so flat, that the standing joke is that one can watch ones dog run away for days. The director, Lesley Selander, normally a steady hand with low budget films, is defeated by the extremely poor story. One of the few bright moments is seeing a young Rita Moreno in an early role.",
         "This is pretty much a routine 50s Oater, set in the Northwest. The story concerns two brothers working for the RCMP, one good, one bad. It gets a boost from a better than average cast, nice color cinematography, and a fine score by Sawtell.",
         "Fort Vengeance is directed by Lesley Selander and written by Dan Ullman. It stars James Craig, Rita Moreno, Keith Larsen, Reginald Denny, Charles Irwin and Morris Ankrum. Music is by Paul Dunlap and cinematography by Harry Neumann. As written there's a whole bunch of interest in this otherwise routinely staged Oater. On the surface it's a good brother versus bad brother theme, as Dick (Craig) and Carey Ross (Larsen) flee problems in the States by crossing the border into Canada and join the famed North West Mounted Police. Carey Ross is the tempestuous young brother, Dick Ross the wise and reasonable one. There's trouble afoot with the Indians, Sitting Bull (Michael Granger) is on the warpath and wants to unite with the Canadian Blackfoots to wipe out ole whitey. Running at just 75 minutes, Selander crams as much action in as he can, unfortunately this is at a cost to narrative promise. The story is set just after Custer's folly, and thus the Canadian Red Coats are dealing with the aftermath of the Blue Coats' ventures down across the border. On the Native American front, Sitting Bull is using devious tactics to stir up his wrath, but Blackfoot leader Crowfoot (Ankrum) still believes peace is possible. But with Carey Ross now a loose cannon on the Red Coat side of the fence, this part of Canada is turning into a powder-keg. There's a lot of fascinating historical ideas ticking away here, but the nature of this sort of production means nothing is ever expanded upon. The action scenes are competent, though the fisticuffs choreography is poor, and I'm still not exactly sure what Rita Moreno's character has to do with things? She seems to exist just to tease the men, unflatteringly so! The Cinecolor looks washed out, meaning the potential airy vistas lack vibrancy, while you will search far and wide for an acting performance of note. The various narrative strands jostling with each other for notice in the picture keeps things watchable, while the finale does pack an emotional punch, but ultimately it winds up as a time filling second string feature that is quickly forgotten once the credits do roll. A shame that. 6/10",
         "James Craig, long past his Hollywood heyday, and Keith Larsen, a bland, rugged youth, are brothers on the run from the law. They decide to seek refuge in the Great White North. Luckily for them, the recruiting standards for the Royal Canadian Mounted Police seem to be low. They don't run any background checks, taking them at their word that they are honest types who would love to take the Queen's shilling. Benign, old duffer Reginald Denny is soon kitting them out with Mountie outfits. Squaw woman Rita Moreno tries to catch the eyes of the brothers. The future EGOT winner did a lot of these \"exotic\" roles at this stage of her career, and is unconvincing here. There is a stab at historical accuracy with the introduction of Sitting Bull and his tribe, fleeing Little Big Horn. They are given an eccentric speech pattern and a yearning to recover their old hunting grounds. Clearly, they are doomed. The setting is a bit different to the majority of Westerns and most of it is shot outdoors. However, dramatically it is uninvolving and lacks credibility",
         "A pair of brothers named Ross who are probably no better than they ought to be flee the USA and cross into Canada. As brother James Craig points out to brother Keith Larsen they left in rather a hurry and haven't got all that much liquid capital and at least Craig would prefer to make an honest living. When the opportunity presents itself to join the Northwest Mounted Police they join with Larsen a bit reluctant. Their presence is welcome especially since they confirm that Sitting Bull has crossed into Canada after the Little Big Horn and is making for the Cree camp and Chief Morris Ankrum. He's looking for allies and the Cree are far more numerous than Mounties. But in Canada because there were so many fewer white settlers the Mounties become protectors of the Indians. As for the brothers Craig gets into the Mountie spirit and starts taking up with the trading post owner's daughter Rita Moreno. But Larsen reverts to his old ways and the Cree are ready to join the Sioux because of it. Fort Vengeance is nicely photographed with the players settling into familiar type roles for them. Before Rita Moreno won her Oscar playing someone of her heritage in West Side Story she was cast in a ton of films as exotic native types wherever the location of the film story was. Her she played a mixed race person known in Canada as a Meti. Lesley Selander directed Fort Vengeance and he has a couple of hundred films and television shows under his belt. The man did know what to do with his players on a western set, albeit this one being a Northwestern. Western and northwestern fans should be pleased.",
         "In contrast to most of the few reviewers, I found this an interesting western frontier story, despite some geographical and historical inaccuracies(such as mountains in Saskatchewan, and wagon trains rolling across Canadian prairies). It does present an important chief of the Sioux: Sitting Bull, and chief of the Blackfoot: Crowfoot in reasonably accurate historical perspective, aside from the Sioux attack of a wagon train in Canada. Historically, Crowfoot lead his people from Saskatchewan into Sioux US territory , and Sitting Bull tried to get Crowfoot to join him on another attack on US soldiers. Crowfoot declined, as he felt such an attack would prove useless in dissuading Europeans from encroaching on the Plains. He had pursued friendly policy with the Canadian Mounties. Eventually Crowfoot returned to Canada, and Sitting Bull eventually followed, to avoid capture by the US army, and was welcomed by Crowfoot, as long as he didn't stir up trouble with the Europeans. However, in the film, Crowfoot eventually agrees to join Sitting Bull in fighting the whites, if Crowfoot's son Eagle Heart is falsely convicted of killing 2 Europeans. ... The plot can be considered as involving 2 reluctant buddy pairs, who occasionally interact. I just described the Sitting Bull-Crowfoot pair. The other pair consists of 2 American brothers: Dick(James Craig) and Carey(Keith Larson) Ross: the one(Carey) being a trigger-happy loose cannon at times, compared to cautious Dick. Near the beginning of the film, Carey shoots dead the inquisitive son of Sitting Bull, while Dick dissuaded him from shooting his brother: Blue Cloud. Later, he shoots dead the thieving trapper Francois Leboc, who was being harried by Crowfoot's son Eagle Heart, whose furs were stolen. Eagle Heart is blamed for the murder, as well as disappearance of Carey(who removed his Mountie uniform). Later, Blue Cloud trails Dick, who is looking for his missing brother. Dick finally finds Carey, and wants to apprehend him for the murder of Francois. Carey resists and is about to shoot his brother when Blue Cloud kills Carey with an arrow in the chest: vengeance for killing his brother. In saving Dick, as a witness, this act also saves Eagle Heart from execution, and thus prevents an Indian war.......In conclusion, I have described a tightly constructed interesting plot. Rita Moreno serves as the token woman, being the daughter of the fort trader. She pops up a few times, flirting or dancing with the men, but I prefer her acting as a Indian maiden in \"The Yellow Tomahawk\""
      ],
      "genres": ["Western"],
      "productionCompanies": ["Walter Wanger Productions"],
      "summaries": [
         "Brothers Dick and Carey Ross, eluding the law because of Carey's disregard for laws,cross over the Canadian border from Montana, and join the Royal Canadian Mounted Police. They react in different ways with Dick becoming an honest and standout member of the Mounties while Carey resorts to his old ways. The attempt by Chief Sitting Bull to incite the Canadian Indians to war is also woven into the threadbare version - number-231 good brother vs. bad brother plot.",
         "Two American brothers chased by a posse cross into Canada and join the Canadian North-West Mounted Police at the height of the Sioux-American war."
      ],
      "budget": 0
   },
   "movielensId": 120252,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-03-28",
      "dvdReleaseDate": null,
      "directors": ["Lesley Selander"],
      "runtime": 75,
      "movieId": 120252,
      "title": "Fort Vengeance",
      "mpaa": "",
      "actors": [
         "James Craig",
         "Rita Moreno",
         "Keith Larsen",
         "Reginald Denny",
         "Charles Irwin",
         "Morris Ankrum",
         "Emory Parnell",
         "Michael Granger",
         "Guy Kingsford",
         "Paul Marion"
      ],
      "imdbMovieId": "0045785",
      "originalTitle": "Fort Vengeance",
      "genres": ["Western"],
      "youtubeTrailerIds": [],
      "plotSummary": "Two brothers flee America and join the Canadian North West Mounted Police. One brother is good, the other bad, both men on a collision course just as trouble starts to brew with the Indians.",
      "tmdbMovieId": 272663,
      "avgRating": 0,
      "releaseYear": "1953",
      "numRatings": 0,
      "posterPath": "/wG9wYes3CVWNZJDttlZpd7ta4nZ.jpg"
   }
}