{
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yash Chopra"],
      "runtime": 178,
      "synopsis": "\"Darr\" is fear. And fear beats in every lover's heart. Fear that your love may not be reciprocated, fear that you lose the one you love, fear that your beloved could have a change of heart. In short, fear is the villain in every love story. But in \"Darr\" fear is the ultimate expression of passion, of obsession and of sacrifice. \"Darr\" is Rahul's story whose love and obsession for Kiran frees him from all fears of life and death. \"Darr\" is Sunil's story, whose enduring love and passion for Kiran gives him the courage to face the fear of death. And finally \"Darr\" is Kiran's story, one who is caught between one man's love and another man's obsession. She fears one and fears for the other. One stands for love and the other for life. In this battle between love and life, the supreme victor is Love, because Love always wins, in Life and in Death.",
      "writers": [
         "Honey Irani",
         "Honey Irani"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0109555/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyNjQxMzcyMl5BMl5BanBnXkFtZTcwNTY5NTk5Mw@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Sunny Deol, Juhi Chawla, Shah Rukh Khan | See full cast and crew »"],
      "reviews": [
         "So many times, Bollywood has tried to remake Hollywood hits, only to produce total duds. Mercifully, Yash Chopra's interpretation of \"Sleeping with the Enemy\" is an extremely stylish and well-made films. Shah Rukh Khan is obsessed with Juhi Chawla (who's looking her very best in here!). When he realizes that Juhi has a fiance in Sunny Deol, he stops at nothing to make sure she becomes his. Every frame of this film is a delight to watch. Whether it's Shah Rukh chanting his trademark \"I love you, K...k...k...kiran!\" or the feel-good mushy scenes between Sunny and Juhi (who make a perfect match), you won't feel like leaving your eat in boredom. Each and every song on the soundtrack is ear pleasing, especially Jaadu Teri Nazar and Tu Mere Samne. Like I said, Juhi looks like a Goddess in this film. Darr may not be SRK's best film (that honor goes to Baazigar), but it definitely figures as one of his most flawless performances! Sunny is OK. He's done similar roles before, but he's good. Overall, Darr is g...g...g...great! ;)",
         "Darr is a great movie! Shahrukh plays an obsessed lover who will do almost anything to win over his lady which in this case is Juhi Chawla. Little does Juhi know in the film that Shahrukh has a MAJOR crush on her and is constantly stalking her. I have to admit, some of the things he did in this movie were pretty creepy... like the threatening phone calls. Never in my life will I forget the line, \"I love you K..k..k..Kiran!\" It's just too bad that Shahrukh and Juhi weren't exactly \"together\" in the film. But Juhi and Sunny do make a fairly good couple in the movie. Though Shahrukh's role was pretty psychotic, I still think he did a great job of playing it and can't possibly imagine anyone else doing that role. No wonder he got an award for Darr in 94'! Juhi... what can I say??? She looks especially amazing in this film! It's not that she doesn't always look amazing in her other films, but Darr did give the public a wonderful image of her! As for the music... it was excellent! Especially \"Jaadu Teri Nazar,\" one of my all time favorite songs. I also thought \"Tu Mere Samne\" was quite nice also. A must see for everyone! Overall Darr deserves a 9/10!",
         "I generally love SRK as a villain (how can you not?) and I believe that SRK and Juhi are a perfect match on screen as they both are actually more nice than pretty. This movie is great to watch, although it has some major flaws: 1) the good guy (Sunny) - not only he's so much less attractive than Shahrukh(what in my opinion is soooooo important in Bollyfilms) but his role lacks character - it would be much better if there was a conflict between two strong personalities, instead we have a conflict between a personality and an average soldier 2) Kiran's and Sunil's reactions for Rahul's actions are unbelievably silly and naive even for a Bollywood production But all this is not that important in comparison with the wonderful melodramatic atmosphere, great songs (really truly great)and (let's say it again) Shahrukh as a villain, I just love him when he's so pagal A must-see (along with Anjaam, Baazigar and Duplicate)",
         "this movie is such a good movie shah ruck khan does a great job as the crazy mad villain who is totally obsessed with the girl the story is fantastic the acting by all characters like the girl and shah ruck and Sunny are all fabulous and i really love the first song especially how it comes back at the end oh and its so emotional if your a true shah ruck khan fan you have gotta watch this movie because its the best shah ruck khan movie ever he plays an excellent role and i wish he done more crazy man roles but u have to watch this what so ever this is a really good movie this is a really good movie you have to watch it it is truly amazing you have to watch it it is fabulous i can go on and on about this movie because it is a fun funny scary cool and totally fantastic movie in the world",
         "The movie is a very good movie.one of the best from Yash raj films.The direction is incredible.The screenplay is brilliant.The story is excellent.It tells about Rahul who is obssed of Kiran his college friend.He is a full blown psycho doing things like talking to his mother on a phone(anyway she died 15 years back) etc.Kiran is engaged to Sunil.Rahul does everything so he can get her.He even trys to kill Sunil but he survives it.He even goes to the place where they are going to their honeymoon.The movie is every nes delight.Shahrukh is superb,Juhi is fairly good,Sunny is average,Anupham is okay and so is Tanvi,Dalip did good.The movie belongs to Srk.The dialogues are brilliant(Shahrukh ones and a lot if not the overacting and comedy).\"Jaadu Teri Nazar\" and \"Tu Mere Samne\" are absolutely melodious tracks.",
         "This movie is just brilliant, SRK's acting is just amazing, the end is so incredibly sad, I cry every time I see this film, it's the kind you never get sick of, and can see again and again, an absolutely amazingly brilliant movie.",
         "Yash Chopra is the filmmaker who is instrumental in the success of Amitabh who gave him several great films like DEEWAAR, TRISHUL, KABHIE KABHIE, KAALA PATTHAR and SILSILA and then he made some craps till CHANDNI(1989) and LAMHE(1991) which were good films DARR was the first film starring Shahrukh Khan in a Yashraj film The film released in 1993 when Shahrukh Khan also starred in a negative role in BAAZIGAR and Sanjay Dutt played a villain in KHALNAYAK in the same year DARR is an obsessive love story, The film sort of made the track famous Amitabh had played an obsessive lover in PARWANA(1971) which was a flop DARR brought it back with a bang The film keeps you on the edge throughout, Sunny-Juhi portions are sweet but the best part is Srk's character which is brilliantly handled Though at times the film does get sort of clichéd/filmy and some scenes do seem filmy but yet the film is well handled On the flipside, there are times when the film tends to veer towards scenes that look far-fetched, like the climax when a stabbed Sunny suddenly appears in the middle of the sea and bashes SRK Also the film tends to drag in some places Yash Chopra does a brilliant job Music by Shiv Hari is fab, be it TU HAI MERI KIRAN, TU MERE SAAMNE which became a rage and made Udit Srk's voice Or the romantic DARWAZA BAND KARLO Amongst actors Sunny plays the typical hero and is refreshingly low-key but his role lacks the meat which resulted in him being angry on Yash Chopra He felt he was cheated by the director Surprisingly in the same year Sunny stole the show in a DAMINI from Rishi Kapoor though having a guest role Juhi looks ravishing and does a good job Shahrukh Khan steals the show with a brilliant portrayal, be it his stammer, or his cold expressions he is superb In fact he was raw those days but that made him much more identifiable then today Amongst rest Anupam Kher is hilarious, like in LAMHE while Tanvi Azmi is likable too Anu Kapoor is good in a cameo",
         "This was Bollywood's answer to Fatal attraction and this is a classic film in its own right. Juhi Chawla was good and so was Sunny Deol but it was Shah Rukh Khan who shot to fame as the stalker. Since then he has become a favourite of the Chopra's (Dilwale Dulhaniya le Jayenge, Mohhabatein, Dil to pagal hai, Veer Zaara and Chak De India). Shah Rukh at first appears to be a villain but then towards the end you start to sympathize with him. The scripting was superb and the songs were chartbusters. My favourites are Too mere samne and Jaadu teri nazar. After the dismal failure of the underrated Lamhe Yash Chopra fought back with Darr. The dialogues were memorable, the k..k..Kiran dialogue is often repeated. Since Darr Yash Chopra has slipped bit. Dil to pagal hai was bad but he redeemed himself slightly with Veer Zaara, which was far far better. This was Yash Chopra's last masterpiece.",
         "Darr (1993) Sunny Deol and SRK are my two favorite Bollywood actors and I was excited to learn that they did a film together called Darr. However, after the release of this film SRK took all the credit and left Sunny standing in the dark alone, and thus started a rivalry with him. When I saw this film, I was excited to see them on the same screen space. The Pluses: the main cast, (especially Sunny Deol and Juhi Chawla), nice songs, Anupam Kher and his wacky Cricket interest, and the reference of Imran Khan in a positive light. Great quality picture. The Minuses: This is a 90's movie, so expect some corny dialogues, unexpected events in the film and songs that appear out of nowhere. Not for the sensitive hearted due to some scary scenes. SRK appears to be what we call in modern times, as a stalker. Overall, Darr is a great film. Watch it and you will be blown away. it' sad that SRK and Sunny Deol don't make films together anymore",
         "Pertty Kiran comes back to home after completing her college. She has got a nice charisma which always drawn men to her. Sunil Malhotra a dare devil navy employee is one such guy. He loves her deeply and even engaged to marry her. Rahul is another person who is insane and he also loves Kirrrran. Sunil is very close to her family and is adored by everyone in his home. Kiran has never met Rahul, but then Rahul would kill anyone who comes between him and Kiran. So when Rahul comes to know that Kiran is in love with Sunil, what will he do ? Will he kill him or he himself will be punished for his devil acts."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Yash Raj Films"],
      "summaries": [
         "A young man is insanely obsessed over a college girl. This obsession causes the young man to take daring steps to prevent her from marrying her fiancé, a naval officer. When she finally does marry the naval officer, however, the young man's fury causes him to break all limits of decency.",
         "The beautiful Kiran Awashti has plans to marry the brave, strong and powerful navy man, Sunil Malhotra. All is well in the beginning, as both dramatically begins to prepare for there marriage life, but an unknown caller, in the form and shape of Rahul Mehra begins to, both physically and mentally harass Kiran upturning the couple's life. Now Sunil has two options either leave Kiran to marry the obsessed Rahul or fight an unstoppable assassin.",
         "Kiran Awasti has two admirers. One is the brave and daring navy man Sunil Malhotra, who loves her wholeheartedly; the other is the insane Rahul Mehra, who also loves her wholeheartedly. Both men will do anything to marry Kiran. The only difference between the two is that Rahul will kill anyone who gets in the way of his obsession. The only problem is that Kiran is engaged to Sunil, and Kiran has never met Rahul.",
         "Sunil Malhotra is a brave naval officer who always fight for others' rights. He is in love with the beautiful Kiran Awasti and hopes to marry her soon, but the only problem in their lives is the occurrence of an unknown caller who claims that he is in love with Kiran. Many attempts both by Sunil and the police are made to trap this stalker, but they are all in vain. Now, both Sunil and Kiran's lives are in danger because the caller is an insane man who will do anything in his power to get what he wants.",
         "A woman is caught between one man's love and another man's obsession. She fears one and fears for the other. One stands for love and the other for life. Who will she choose?"
      ],
      "budget": 0
   },
   "movielensId": 120486,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1993-12-23",
      "dvdReleaseDate": null,
      "directors": ["Yash Chopra"],
      "runtime": 179,
      "movieId": 120486,
      "title": "Darr",
      "mpaa": "R",
      "actors": [
         "Shah Rukh Khan",
         "Juhi Chawla",
         "Sunny Deol",
         "Anupam Kher",
         "Tanvi Azmi",
         "Dalip Tahil",
         "Annu Kapoor"
      ],
      "imdbMovieId": "0109555",
      "originalTitle": "Darr",
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman is caught between one man's love and another man's obsession. She fears one and fears for the other. One stands for love and the other for life. Who will she choose?",
      "tmdbMovieId": 74309,
      "avgRating": 2.91176,
      "releaseYear": "1993",
      "numRatings": 17,
      "posterPath": "/9vkTd5syYW7EXK1gyGLJYJxJ7u.jpg"
   }
}