{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "zoo",
            "id": 2172
         },
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "zebra",
            "id": 7639
         },
         {
            "name": "animal lover",
            "id": 158395
         },
         {
            "name": "mountain lion",
            "id": 192767
         },
         {
            "name": "escaped animal",
            "id": 229034
         }
      ],
      "imdb_id": "tt0059944",
      "video": false,
      "title": "Zebra in the Kitchen",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Chris Carlyle",
               "gender": 0,
               "credit_id": "52fe4ade9251416c910c8575",
               "name": "Jay North",
               "profile_path": "/vOV4eMYrbV4SCJq279O36Gt8QQG.jpg",
               "id": 75351,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dr. Del Hartwood",
               "gender": 2,
               "credit_id": "52fe4ade9251416c910c8579",
               "name": "Martin Milner",
               "profile_path": "/gm66n7mAhkIUZ9cOLDLuOPI6vnv.jpg",
               "id": 14573,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. Del Hartwood",
               "gender": 2,
               "credit_id": "52fe4ade9251416c910c857d",
               "name": "Andy Devine",
               "profile_path": "/w4tLltNhtOqQXJzju4TzUJRiesg.jpg",
               "id": 14966,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Isobel Moon",
               "gender": 1,
               "credit_id": "52fe4ade9251416c910c8581",
               "name": "Joyce Meadows",
               "profile_path": "/2kG45Xk8HQKV6ncY7s8wN8DjM7p.jpg",
               "id": 131049,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Adam Carlyle",
               "gender": 2,
               "credit_id": "52fe4ade9251416c910c8585",
               "name": "Jim Davis",
               "profile_path": "/haBmMHnlucu5shtRY6SHPG9Gl4i.jpg",
               "id": 30846,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Anne Carlyle",
               "gender": 1,
               "credit_id": "52fe4ade9251416c910c8589",
               "name": "Dorothy Green",
               "profile_path": "/4IbkzUe2k8D0srYGOCWMJDn5jwD.jpg",
               "id": 55893,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Wilma Carlyle",
               "gender": 0,
               "credit_id": "52fe4ade9251416c910c858d",
               "name": "Karen Green",
               "profile_path": null,
               "id": 165087,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Councilman Pew",
               "gender": 2,
               "credit_id": "52fe4ade9251416c910c8591",
               "name": "Vaughn Taylor",
               "profile_path": "/3r3B8Tl6qUXoM3fiL22lT9gD2gJ.jpg",
               "id": 3641,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Newscaster",
               "gender": 0,
               "credit_id": "54a9aa629251417e800026f6",
               "name": "Wayne Thomas",
               "profile_path": null,
               "id": 1409007,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ade9251416c910c8571",
               "name": "Ivan Tors",
               "profile_path": null,
               "id": 111172,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ade9251416c910c8597",
               "name": "Art Arthur",
               "profile_path": null,
               "id": 120541,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ade9251416c910c859d",
               "name": "Elgin Ciampi",
               "profile_path": null,
               "id": 1211787,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.456721,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 150247,
      "vote_count": 1,
      "budget": 0,
      "overview": "A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town.",
      "similar": [
         10527,
         953,
         58224,
         87827,
         9836,
         9904,
         10258,
         38317,
         161143,
         184346,
         488,
         268357,
         2989,
         215459,
         61936,
         56015,
         388259,
         216436,
         138254,
         152458
      ],
      "original_title": "Zebra in the Kitchen",
      "runtime": 92,
      "poster_path": "/lauBgl87De54ltRvyOyG4rsnBHb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1965-06-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "The crazy day the animals came out to play!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ivan Tors"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Art Arthur",
         "Elgin Ciampi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059944/",
      "coverLink": null,
      "actors": [
         "Jay North",
         "Martin Milner",
         "Andy Devine"
      ],
      "reviews": [
         "This is the first movie I ever saw in a theatre (with my brother and cousins). I was about five or six years old, and I remember laughing 'til I cried. I went home and told Mom all about the funniest moments. Also, that huge screen up there, glowing bright and the people so big: it was all magical! Nowadays, I see this movie on the video store shelf and I refuse to rent it: apparently this movie is not very good, and I don't want the realization of its mediocrity to obliterate my magical childhood memory. We need to keep those memories intact: we retain them as little nuggets of magic, optimism and fun in our jaded adult hearts. If this wasn't YOUR first movie, rent it for your kids today (though I'd rather they see it on the big screen, of course!).",
         "Has some fleeting interest for cast trivia buffs: Robert Lowery looking rather handsome and Clark Gable-ish in his one scene as a big game hunter; Jon Lormer in his customary role as the judge; Percy Helton, Tris Coffin, Vince Barnett\u0085 Of course the film is actually designed to appeal mainly to those juveniles who love animal antics. Alas, for all its wealth of animalia, it's shot in an extremely pedestrian style. Not only is every jest and gag situation milked thoroughly dry, but the obvious plot is unraveled at the pace of a tortoise. In addition, Tors employs a relentlessly close-up after close-up, television method of shooting and even falls back on such jaded devices as speeded-up action. There's even a long storyboard introduction with the words of the hokey title song displayed for our edification. Unflatteringly photographed Martin Miller makes a rather wet hero. The girls don't impress either, while Andy Devine looks far too old even for a sinecure job as head keeper at the zoo. His fans, however, will be glad to find he has a major role, not a fleeting part or a cameo. Young Jay North registers mildly and occasionally even manages to surmount the impossible script. Production values are firmly on the el cheapo side. As well as a bit of stock footage, Tors even treats us to a generous excerpt of Oliver Hardy and Stan Laurel in their famous encounter with Lupe Velez in \"Hollywood Party\". This turns out to be the funniest scene in the whole movie!",
         "This was the first film I saw at the cinema too,the film came out in 1965 ,but I saw it in about 1973. It was in South Africa and back then our parents never came in with us they just dropped us off I was about 10 and my brother was about 7. We really loved it it was so hilarious ,I never thought of trying to rent it now ,but I would love to show it to my daughter and niece's. The cinema was a riot of unruly kids chucking sweets popcorn etc..what fun !! I remember coming home with a half chewed up toffee stuck in the back of my hair.. ahhh those were the days . Rent it for the kids they will love it ,I may watch it again too ..",
         "Ivan Tors, who brought \"Flipper\" to movie (and later television) screens, tried his luck again with this animal-based comedy-drama starring Jay North, from TV's \"Dennis the Menace\". Framed in flashback for no apparent reason (other than to pad the reedy-thin narrative with exposition), story concerns a domesticated Puma mountain lion and his unhappy preteen owner, who is forced to give his pet to the local zoo after his parents relocate them from the sticks to the city. Nothing in this movie feels accurate: the boy's father lost the family homestead because he was apparently hurt, but there seems nothing wrong with sturdy Jim Davis in the part; the zoo appears to be in mountain terrain (away from the town) and is described for us as \"shabby\" and \"pitiful\" when, actually, it seems well-staffed and very clean; also, the youngster is taken in quite readily by the friendly zookeepers as an assistant, yet he treats this job indifferently (while scheming to betray everybody and free the Puma). North, a competent child actor, isn't allowed much mischief beyond stealing Andy Devine's cage-keys, and is kept petulant and scowling. The extraneous shots of animals eating or pacing their cages are dropped in sloppily (much of the time, they're not even reacting to anything, so there's no humor in their presence), while the quasi-slapstick finale--with zoo animals finding their way into homes, as well as the local ice cream shop--lays a big egg. *1/2 from ****",
         "\"Zebra In The Kitchen\" may look at first glance to be a wholesome family movie, seeing that it was made by Ivan Tors of \"Flipper\" fame, and that it was made in the innocent '60s, long before humor like breaking wind becoming popular. Yet when you examine it closely, it has some disturbing messages that may give kids the wrong ideas. It has the idea that it's okay that truly wild animals like cougars should be domesticated and kept around the house. The movie also feels that it's okay for the child protagonist to free all the animals kept in a zoo and let them run riot in the adjoining town. And get this - the kid doesn't really get punished for this in the end! Besides disturbing messages like this, we get stupid characters and situations, like a family driving 800 miles between sunup and sunset. And I think even kids will find the child protagonist very annoying with his constant whining about his cougar named \"Sunshine\" (!) Only for viewers who want to see animals sprayed with whipped cream.",
         "This very lousy movie does have two redeeming features: Martin Milner gives a sincere performance and anchors the whole thing. Without him, the film wouldn't even hold together. Also, any film from those days with the wonderful Andy Devine should be watched by kids and adults alike because he is an adorable delight. However, the ridiculous totally overwhelms the redeeming qualities for me. For example, right at the start you have a mountain lion supposedly liking corn on the cob. It is never shown actually eating any, only playing with it. This is because it cannot and would not eat that, as its body requires red meat to survive. Highly dangerous animals are shown on the streets being treated in a cavalier manner by the public. These animals are frightening and some would kill the public if disturbed or provoked. Only the bad old police seem to take them seriously. Of course, the fact that each policeman has sworn an oath to protect the public never gets any consideration. Jay North's character appears at times just plain crazy. Watch carefully, you will see that this character is as one-dimensional as any ever written for the screen. Just the look on North's face is at times wacko as he commits numerous irrational acts. Its almost as if his character, rather than being the star, is solely there to do certain specific things over and over throughout the movie. He's not allowed to be a kid, never playing or going to school. Just a relentless tool of the script. Certainly children viewing this might bond with the animals, but I don't see how they could possibly bond at all with the non-kid character portrayed by North. Too bad for Jay North, its not his fault. Despite the nice filming in the beautiful California sunshine, this is very badly written and conceived. If you were expecting something like \"Flipper\" forget it- that kind of entertainment is not what this relentless movie is about.",
         "Ivan Tors (creator of TV's \"Seahunt,\" \"Flipper,\" Gentle Ben,\" and \"Daktari\") produced and directed this effective family comedy. With a low budget, creative editing, a cast that included \"Dennis the Menace's\" Jay North and \"Adam 12's\" Martin Milner, and a Hollywood Animal Farm assortment of animals, Ivan Tors is able to create slap stick and a message out of a story about a boy (Jay North) and his pet cougar. When the boy's family must move to the city, his pet cougar is placed in the city zoo, a run-down out-dated collection of cages maintained by zookeeper Chill Wills and Zoo Vet Martin Milner. Soon North ends up working for the zoo, but unhappy with the way the animals are caged up, releases the animals onto the city. The animals really aren't very dangerous and cause a lot of mischief in people's backyards, houses, and shops. Watch for Marshall Thompson (\"Daktari,\" \"Clarence the Cross-Eyed Lion\") in a cameo.",
         "Gravel-voiced zoo-keeper Andy Devine (as Branch Hawksbill) tells the heart-warming tale of young Jay North (as Christopher \"Chris\" Carlyle) and his mountain lion. \"Sunshine\" is an outside pet, which works out well because young North lives with his mom and dad on a farm. But that's about to change. After his father suffers an unseen mishap, the family must move to the city. North secretly brings the lion along. Sunshine startles the neighbors and must be sent to live at the local zoo. North is devastated. He is allowed in Sunshine's cage and gets the distressed feline to eat. A natural with animals, North gets a summer job as junior zoo keeper. He feels his pet and the other animals are in something like a \"jail\" and longs to set them free... \"Zebra in the Kitchen\" is confusingly titled. You're expecting it to be about a pet zebra. That animal is barely seen. The title is just the first line of song played over the opening credits, written by Hal Hopper (North's uncle and a show business veteran) and sung by The Standells... North is freshly free of his series \"Dennis the Menace\". He's got a different shade of hair color and successful sheds many of the TV character's quirky mannerisms. Producer-director Ivan Tors did much better with this fare on TV, with animal and kid adventure shows. So did earnest zoo manager Martin Milner (as Del Hartwood), herein between \"Route 66\" and \"Adam-12\". Best of the cameos is seeing Eddie Quillan enjoy watching Laurel and Hardy on TV, in the old film \"Hollywood Party\" (1934). Mr. Quillan was in that original movie, and his \"I've Had My Moments\" song and dance upstaged most, if not all, of his co-stars. ***** Zebra in the Kitchen (6/65) Ivan Tors ~ Jay North, Andy Devine, Martin Milner, Jim Davis",
         "Was really taken aback by the number of people who recall it as their first movie.However weird and made up it may sound,it was one of my first movies as well.My friends had it on home video and I remember laughing hard and having a really good \"childhood\" time with my buddies.The memories are very faint,but there was some sequence where they show a big key or something.And its a miracle that I recall the name!Seeing the rating I guess the movie must be pretty crappy,but I would still buy the movie,even though my friends back then are only memories now.I have to see the movie now to make a more critical comment,but for now I just want to reminisce the memories...",
         "Enjoyably silly Disney nature film has a boy forced to put his pet puma in the zoo, who then steals the zoo keeper's key to free all of the animals. So, no, Disney did not exactly make \"Day of the Animals\" or a nature-gone-wild horror film, but my kids found the silly animal antics pretty hilarious, even if in real-life there would would have been a lot more mauling. My kids also did not notice that a teenage Jay North is still as bad of an actor as he was on TV as Dennis the Menace. In the plus column for the film, the above mentioned zookeeper is played by the great Andy Devine. Nothing classic here, but it mostly held my interest and you could probably do worse.",
         "I enjoyed this film very much. Jay North does a fine job as a child who has raised a mountain lion from birth but because he has to move with this family to the city, the mountain lion has to be put in a zoo that is poorly funded and with tiny cages. As a result, Jay North's character frees all the animals there 45 minutes into the film. The middle part then is more comedic as the animals enjoy their time away from the cages. Longtime character actor Andy Levine and Martin Milner are wonderful in their roles as the zoo caretaker and zoo director, respectively. Now zoos are more animal-friendly but when this film was made, many zoos were like jails with cramped cages and the rights of animals was an afterthought in zoos. This film enlightens the public in that regard and does so in an entertaining and heartfelt way.",
         "Chris (Jay North) lives on a California ranch with his parents and two pets, a German Shepherd dog and a tamed mountain lion, Sunshine. However, one morning, his parents tell him that they are moving to the city, they can't turn a profit on the ranch. Talk about disappointment! Mostly, Chris is worried about Sunshine, who, unlike other big cats, doesn't know survival techniques. So, Chris sneaks him onto the trailer and takes him to their new home in Southern California. Almost immediately, Sunshine is discovered and taken to the local zoo, over Chris' zealous objections. When the young boy goes to visit, he sees the zoo is horridly small and the animals' cages are too confining. One of the nice zookeepers (Andy Devine) lets Chris work at the zoo, part time. Another zookeeper (Martin Milner) also has a caring heart and knows the zoo needs improvements but he can't convince the owners to put forth the dollars. Therefore, one day, Chris lets the animals loose, after a feeding, to make a point. Soon, zebras, chimps, a tiger, a lion, an ostrich and other animals are walking around town. Only the head zookeeper keeps the police from terminating the animals, asking for time to tranquilize the creatures and take them back. But, as the hours go by, will the zoo animals be saved and will Chris' misguided effort to improve the zoo bring results? This is a very nice family film, nearly unknown, but with a great cast of character actros and, naturally, a slightly older version of Dennis the Menace. North is enjoyable, as is the entire cast. Also wonderful are the animals, who put on a show to set everyone to knee-slapping fun. Just watch a chimp imitate a man watching Laurel and Hardy on television and you will be laughing, too. But, alas, there are a couple of problems. First, some evil boys throw lit cigars to the hippos, causing one to die. Nasty and unnecessary. Also, no one, no matter what the goal, should release wild and dangerous animals on the public. Its not a prank, so you and yours should discuss this during and after a watch. But, all in all, most folks of all ages will like this one and happily sing the catchy title song, too.",
         "How bizarre! This was one of the first films I recall seeing as well. And I do remember how much I laughed. Like another commenter here, I do not wish to see it again as I just know it will spoil the memory for me. And like the same commenter, I too was in South Africa at the time and was only about 6 or 7 years old. However, as I now have a six-month old daughter of my own, I will try to get it for her to see, and perhaps she too will laugh as much as I did all those years ago. Funny how we remember such simple things. I'm sure there are many, many movies that are far better, but I just remember this one in particular. Perhaps it was because my mother was in the hospital at the time giving birth to my baby (35 now) brother and I watched this to keep me occupied. If you have youngsters yourself, rent it for them if you can. They'll love it!",
         "This was my first movie EVER. I was 6 and saw it at the Starlite Drive-In in Bantam, OH. I remember falling asleep halfway through and my parents drove home before the movie ended. I too have absolutely no idea if it was a good movie or what it was about as I was too young and obviously too sleepy! To show you what little I remembered about it, I thought it was another of the 1960's Dean Jones movies (of course I saw all of them as well, especially The Love Bug). I see that it's in DVD form now and I too am a bit scared to buy it, fearing that my first movie experience was watching a dud! But for the right price, I might just take the risk!",
         "Zebra In The Kitchen combines the talents of two icons of children's television, Ivan Tors who produced Flipper and Jay North who had finally grown out of playing Dennis The Menace. What they came up with is a film that only kids could possibly appreciate despite a wonderful group of comic character actors in small roles. Young Jay North is not happy over his parents decision to sell the family farm and move to the city. Father Jim Davis was injured and can't work the farm as he used to. But this means that North will have to give up a mountain lion that he has had as a pet since it was a cub. That's the dangers of taking a pet from the wild. One of two things will happen, either it will revert to its natural ways and turn on the owner or if you leave the animal it won't function in the wild. That problem was best dealt with in a far better film, The Yearling. The mountain lion stows away in the family truck. And then breaks loose and while it hurts no one, the city folks are real scared as well they should be. Enter the management at the city zoo which is Martin Milner, Joyce Meadows and Andy Devine. They offer to take the mountain lion and keep him at the zoo. But neither North or the mountain lion are real happy with that. What to do, but North decides no animals should be kept and he gets Devine's keys and opens all the cages. Chaos descends on the city as the animals are running wild. Instead of what does happen in real life North would have gotten a juvenile record and Devine would have been canned if not more. I think even the kids watching above a certain age would know that. Oddly enough almost 30 years before Zebra In The Kitchen, Devine also played a zoo-keeper in the Bing Crosby classic Dr. Rhythm and one of high points of that film is an inebriated Devine letting loose the animals in his charge. Fortunately Bing saved him in the nick of time from letting loose the big cats which do get out here. A really horrible premise and bad choices ruin from the start what Ivan Tors thought was a good idea for a family film."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town."],
      "budget": 0
   },
   "movielensId": 120608,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-06-01",
      "dvdReleaseDate": null,
      "directors": ["Ivan Tors"],
      "runtime": 92,
      "movieId": 120608,
      "title": "Zebra in the Kitchen",
      "mpaa": "",
      "actors": [
         "Jay North",
         "Martin Milner",
         "Andy Devine",
         "Joyce Meadows",
         "Jim Davis",
         "Dorothy Green",
         "Karen Green",
         "Vaughn Taylor",
         "Wayne Thomas"
      ],
      "imdbMovieId": "0059944",
      "originalTitle": "Zebra in the Kitchen",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["kxOgAozYL9E"],
      "plotSummary": "A young boy lets the animals out of their cages at the Zoo, to set them free, but the animals start taking over the town.",
      "tmdbMovieId": 150247,
      "avgRating": 2.5,
      "releaseYear": "1965",
      "numRatings": 1,
      "posterPath": "/lauBgl87De54ltRvyOyG4rsnBHb.jpg"
   }
}