{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "ostern",
            "id": 8528
         },
         {
            "name": "yukon",
            "id": 189390
         }
      ],
      "imdb_id": "tt0017271",
      "video": false,
      "title": "By the Law",
      "recommendations": [
         109379,
         85715,
         106254,
         46212,
         130052,
         168179,
         115596,
         86379,
         114626,
         166709,
         243278,
         79240,
         103396,
         47717,
         84782,
         131366,
         112882,
         108747,
         47903,
         94706
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Edith Nelson",
               "gender": 1,
               "credit_id": "5484eadd9251416a6f000f35",
               "name": "Aleksandra Khokhlova",
               "profile_path": null,
               "id": 1396140,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Michael Dennin",
               "gender": 0,
               "credit_id": "5484eb439251416a6600103a",
               "name": "Vladimir Fogel",
               "profile_path": null,
               "id": 144829,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Harky",
               "gender": 0,
               "credit_id": "5484eb689251416a630010f6",
               "name": "Pyotr Galadzhev",
               "profile_path": "/aROeV6yRGtsTq65jbGV8okdlrGB.jpg",
               "id": 1396144,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dutchy",
               "gender": 0,
               "credit_id": "5484ebb19251416a63001102",
               "name": "Porfiri Podobed",
               "profile_path": null,
               "id": 1093970,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jack",
               "gender": 0,
               "credit_id": "5484ebd39251416a6000120c",
               "name": "Fred Forell",
               "profile_path": null,
               "id": 1396146,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hans Nelson",
               "gender": 0,
               "credit_id": "550c888a9251414695004092",
               "name": "Sergei Komarov",
               "profile_path": null,
               "id": 144833,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4ae3c3a368484e16c289",
               "name": "Lev Kuleshov",
               "profile_path": null,
               "id": 228729,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5484e97a9251416a60001149",
               "name": "Lev Kuleshov",
               "profile_path": null,
               "id": 228729,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5484e9909251416a6300107e",
               "name": "Jack London",
               "profile_path": "/sfU4Zbl15Hr70HDWPGymnZUFRRv.jpg",
               "id": 71759,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "5484e9efc3a3680b3a0014c6",
               "name": "Viktor Shklovsky",
               "profile_path": null,
               "id": 1391344,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5484ec709251416a5d001223",
               "name": "Konstantin Kuznetsov",
               "profile_path": null,
               "id": 1396150,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Western",
            "id": 37
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.587363,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 126644,
      "vote_count": 8,
      "budget": 0,
      "overview": "A five-person team of gold prospectors in the Yukon has just begun to enjoy great success when one of the members snaps, and suddenly kills two of the others. The two survivors, a husband and wife, subdue the killer but are then faced with an agonizing dilemma. With no chance of turning him over to the authorities for many weeks, they must decide whether to exact justice themselves or to risk trying to keep him restrained until they can return to civilization.",
      "similar": [
         12227,
         377697,
         429,
         421044,
         334524,
         3090,
         2000,
         294652,
         962,
         818,
         9654,
         22,
         682,
         1572,
         6637,
         49524,
         11310,
         11088,
         6415,
         57120
      ],
      "original_title": "По закону",
      "runtime": 80,
      "poster_path": "/1w7KEMksKELd2v7sy3M35mRECPE.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Goskino",
         "id": 25606,
         "origin_country": ""
      }],
      "release_date": "1926-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lev Kuleshov"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Lev Kuleshov",
         "Jack London"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0017271/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMzc5MDUyNV5BMl5BanBnXkFtZTgwNjIzMTM2MTE@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Aleksandra Khokhlova, Sergey Komarov, Vladimir Fogel | See full cast and crew »"],
      "reviews": [
         "You just know from the first handful of images that you are in the presence of a master filmmaker with this; one who understands the multiple planes of seeing, the different perspectives of seeing life around us, the more meaningful life inside, and the cosmic grind of life to which our life is merely pattern, and knows how to align them. Who can then pour universal soul, his, ours, into this cycle that reconciles disparities and unifies vision. See here. The scene is set; turn-of-the-century Yukon, prospectors with feverish dreams, restless lives clawing at the edges of the known world. What could they humanly discover where no one goes? The Irish worker hastens back to the campfire to break the good news to his company, everyone rejoices at the prospect of gold and begin dancing; except no one with him, he is left alone, dancing awkwardly a little out of way while tapping his empty food plate - the empty plate, next to the larger where dirt is sifted for gold nuggets. A little further, his dog, excited at the noise and merrymaking, stands at hind legs and eagerly performs his learned trick. How brilliantly Kuleshov conducts all these images, sustains in them each other's metaphor. This is the very thing. There are many filmmakers who can paint a beautiful sunset or turn story-telling beats with some urgency or suspense, or even give us an intelligent metaphor about these things. But so few can draw a meaningful image that connects itself with what is behind- and gives rise to it; so few who can brilliantly invent, picture the notions that will restore the world from our narrow perspective into its original dimensions. So, there is this solitary hut in the middle of the blasted, windswept tundra. Nights flutter with rain. Inside is humanity entire; this is how wide Kuleshov sees. The man, the worker who was wronged and wronged back twice harder, the couple who had no time to spare him from their cruelty but will spend so much solemn, dutiful time and effort to bury their dead in the wind and rain. They are both guilty, both probably never having meant to, and they're all waiting for the thaw, the law to come and settle scores. This is not agitprop like was commissioned from Kuleshov's pupils, Eisenstein and Pudovkin. The worker is not merely the prole, exploited but brave with adversity, his employees are not just the faceless cut-outs of corrupting evil. The figures are rich with ambivalence, they have actual faces equally damned and damnable. Tensions simmer as they grow paranoid together in the small hut, minds become unhinged. There are some pretty unforgettable images of this, faces and bodies locked in ghastly grimace as though something contorts from inside the soul. Baleful eyes. Again how Kuleshov conducts his metaphors though; outside is constantly pouring hard, and begins to seep inside with the madness. And then the ice begins to break; these are some of the most breath-taking images in film, certainly the most erudite in silent cinema, exactly because of the cycles they insinuate. It is the mind shattering with the surface of the earth, the universe above. So the three of them are basically growing mad while the world is torn asunder beneath their feet; except it's more than that, it's washed away implying a floating that renews. The overall notion framed in images is so powerful, I had to hold my breath a little as it happened. The law, or Law equally as good, they've been waiting for never comes of course. So they arbite to decide matters themselves, embodying the law in the absence of it with Bible at hand and a poster of Queen Victoria on the ramshackle wall. This is what is so valiant about the human effort in general, yet also equally misguided. It falls on us - and us alone - to devise the order that will nurture and sustain us. Oh, the couple devise their order as best they know, fair or not. But the maddening vision is not over, and the end is a bit of a stunner. If you seek this out, try for the restored FilmMuseum version. It comes with amazing ambient music by Austrian composer Franz Reisecker; sparse techno beats like Plastikman, now dissolving with static hum. It's great stuff.",
         "Kuleshov's By the Law does two things well. It expands upon the themes of London's short story The Unexpected and uses the purely cinematic to depict misery. The story starts with five goldminers in the wilderness of the Yukon Territory. Gold is found and the miners prosper. There is an intimation that the other characters mistreat Michael Dennin, but By the Law is not in the least about the oppression of the working class. As inexplicably as in London's story, Dennin walks in on the others eating and pulls out a shotgun. In an instant, two characters are dead. Edith and Hans Nelson are left to subdue Dennin. The struggle shows the famed Kuleshov effect in full force, as Hans' rage is crosscut with the absurdly positioned dead miners. Dutchy resting awkwardly with his face in his food, plate propped up, is a brilliant image taken straight from the original story. Slowly, Edith begins to restrain her husband. Dennin must be handled \"according to the law,\" she cries. Khokhlova (who plays Edith) is the film's main weakness, which shows here. Her grimaces during these scenes are more bizarre than animalistic, and not very affecting. Thinking Dennin dead, they prepare the other miners for burial. But Dennin returns to consciousness and they bind his arms and legs. Leaving him, they bury the deceased, going out into a downpour. Pathetically Dennin tries to escape, rolling around like an animal, barely getting outside the door before collapsing. The middle section of the movie has husband and wife guarding Dennin for weeks in the one-room log cabin, unable to go home until ships return to the Yukon. The breaking up of the Yukon's ice floods the cabin. The cold and wetness is unbearable, yet Kuleshov crosscuts these scenes of patient suffering with fascinating images of light reflected upon the water, shimmering on the walls. The forces of nature which have cut them off from civilization are awful and unremitting, yet mysterious and even ethereal. Two nearly irreconcilable sides of nature are captured by the camera and given equal precedent. What London states more plainly in his short story has been translated brilliantly to the screen: \"The unfit do not see what is not obvious, are unable to do the unexpected, are incapable of adjusting their well-grooved lives to other and strange grooves. In short, when they come to the end of their own groove, they die.\" (London) Edith believes in the law and religion. Neither belong in this wilderness, so she cannot make sense of it. Perhaps characterization of Edith is a bit weak. Her love of the Bible and the law is simple and not given much background. The story continues with Edith's birthday. She begins to grow closer to Dennin. In a great scene, Hans shaves Dennin as a favor while Edith leaves the cabin. Suddenly tension rises as Hans hesitates, realizing he could kill Dennin easily. But he doesn't. As their seclusion nears its end, Hans decides it would be more convenient to conduct their own trial. Edith agrees providing Dennin receives the English trial he would have had back home in Ireland. They play out the trial, as intertitles indicate each role they perform. With the pretense of authority they decide to hang Dennin. Hans has always wanted to kill Dennin, but for Edith the way in which justice is decided in civilization must be used. She can't leave these gestures behind, but in the wild playing at judge, witness, juror and executioner grants no real authority. This is the crux of the films argument. The journey to the hanging gives the film its greatest images. Images of Frankenstein silhouettes, trudging along a barren land, dwarfed by the lynching trees they approach. The hanging itself is nearly botched. Hans and Edith are in over their heads but they carry on regardless. Here the original story ends, as the Indians not included in the film version shake their heads at the ridiculous laws of the white man. But instead Kuleshov cuts back to the cabin as Edith and Hans prepare for their return. Suddenly a startling deus ex machina occurs which further resolves the themes of the film. (major, major spoilers coming up) In the middle of a torrential downpour the door swings open. Panning up from the legs, we see Dennin with the broken noose still hanging from his neck. He takes the gold for himself, leaves the noose behind \"for good luck\" and walks out into the storm. Dennin represents the adaptable, at home in the selfish wilderness. Hans is prepared to respond in kind to Dennin's brutal greed, but Edith must cling to the grooves of civilization, religion and the law. But in the wild, the laws of man do not reign. Edith and Hans have done nothing more than conduct a false trial, giving false authority to actions. So Kuleshov has taken this irrationality unique to man, and given it to nature. Nature responds with the mysterious and incomprehensible unexpected. Highly recommended. And a note on music: the New York Film Annex made a terrible choice when providing music for its release. If you're watching that, silence is preferable.",
         "With a gripping story and effective technique that establishes a memorable atmosphere and heightens the suspense, this lesser-known Russian-made silent melodrama is well worth tracking down. The plot, which (interesting to note) comes from a Jack London story, is quite efficient in getting a world of possibilities out of a situation that involves only a handful of characters. The technique relies mostly on the kind of montage approach that some of the Soviet film-makers apparently favored, and it shows how effective that technique can be when used in the right setting. Set in a remote, frozen, and often claustrophobic location in the Yukon, the story focuses on the dilemmas faced by a husband and wife who must contend with a crazed killer even as they battle the elements. Both the practical challenges and the ethical/moral decisions they face are brought out well by the way that many short takes are pieced together in a fashion that constantly emphasizes the unstable and confused nature of the situation that the characters face. Only some occasional overacting (especially by the wife character) detracts from the effect, and it all leads up to a compelling final sequence. Overall, it's a distinctive and most interesting film that works quite well.",
         "As one of the great influences in film history, Kuleshov shows his talent and craft in this adaptation of a Jack London story. The film displays Kuleshov's knack for editing and his use of montage to develop each scene during the silent era in cinema. Not only does he create great cinema in the film, but also manages to capture beautiful landscapes seen in the Ukon. The plot revolves around five characters who are searching for gold in the 1920s. They have been unsuccessful until their most belittled partner, Michael, discovers a large chunk during dinner time. The group is ecstatic, and continue to search for more immediately; but, they tell Michael to do laundry instead and he is highly offended that they continue to treat him in a demeaning manor. Under such harsh conditions as the Ukon and in such a state of mind, he attacks the other members of the group, killing two of them. However, husband and wife, Hans and Edith, stop him and bind him before he can do anymore harm. This leads to a long and trying period of time, in which the three must withstand each other and the intense weather around them. Ultimately, they decide to put Michael on trial, but is his fate really their decision to make? Overall, Kuleshov has created an excellent film that was very well-made for its time. The images he allows us to see through montage give the film more depth than if he had been able to use dialog. For most viewers, this picture may drag on due to its lack of sound, but for those who wish to see Kuleshov's mastery of the cinema, it is a perfect choice.",
         "By the Law is a film about greed, unfairness, religion, politics, and revenge. In my opinion having all of these categories together is quite deadly or you can say a very interesting plot. Just the fact that you have religion surrounding four subjects that are unjust and most of them mentioned in the Holy Bible has sinful makes the plot intriguing. First there is greed, which puts other things before God. The greed in the film is shown from the search for gold. Second, there is unfairness, which God does not want for His children (believers). The unfairness in this plot is shown through the way Michael was treated differently after he found the gold in the first place. Thirdly, politics (enough said). I just had to laugh at that one. Politics is unjust in my opinion and is filled with people who promise one thing just to get you on their side when they do not follow up on what they promised you. Politics was used to keep Michael alive but also what was used to attempt to kill him as well. The latter is where you can see the religious aspects not agreeing with the way the two survivors wanted to kill him. Most religious followers would say that no man has the right to take another man's life, only God. Lastly, there is revenge, which God asks all people to forgive, pray for them, then move on. The issue of revenge was seen all throughout the storyline starting with Michael killing the two men because of their treatment towards him, then by one of the men who was not shot and the fact that he wanted to kill Michael because he killed the two men.",
         "By The Law tells the story of five miners who come to the Yukon for gold. It is a gripping drama full of tension provided not only by the actors, but by the filming and editing as well. From the very beginning you can tell that Kuleshov means to draw attention to the separation of Dennin against his fellow miners with shots of the group enjoying there time together while Dennin is often shown by himself. In many scenes Kuleshov uses montage not only to elevate action, but also to establish tension throughout the movie. A great example of this is the scene in which Dennin and the group celebrates their finding of gold. In this scene Dennin is shown celebrating by himself while the rest of the group dances together. Little moments like this foreshadow the coming conflict and help establish the mood of tension between Dennin and the rest of the group so that it doesn't look forced. Close ups of their faces also help to establish and elevate the emotion within a scene. Close ups of Edith's reaction to the horror that has befallen her group members help amplify the chaos of the scene as well as close ups of the ruined meal and the kettle whistling. The tension is further exacerbated with the thawing of ice and the flooding of the small cabin. Montage shots of the same dreary landscape and flooded area around the cabin help create an almost suffocating tension that further conveys to the audience the drama and tension between the characters stuck in that cabin. The law, to which Edith strongly adheres, is also a cause for that tension as it keeps Dennin alive until Edith and her husband both decide to hold a trial there instead of waiting to turn him over to the authorities. During the trial scene the shots of the bible and Queen Victoria tie back to their strict adherence to the law and what is morally right. However there is also a bigger tension being drawn between doing what is morally right and civil to what should be done given the situation. Edith is protesting throughout the latter half of the film to wait for the law, while her husband wants to respond in kind to Dennin's actions. The end of the film is the culmination of the tension between the moral high ground and law of the jungle with Edith bending to her husband's idea that they hold a trial on their own. While a trial is the civil thing to do that is overshadowed by the fact that Edith and her husband act as judge, jury, and executioner. Kuleshov does a great job using montage and other techniques to convey the story of this film and create an underlying tension throughout.",
         "Lev Kuleshov's 'By The Law,' based on Jack London's The Unexpected follows a group of gold prospectors as greed, pride, and the cruelty of nature tear the group apart. There are, at first, five members of the party. Three are made out to be shareholders, financiers of the trip, one is the wife of the biggest financier, and the fifth member becomes their catchall, a minion-like bitter Irishman named Dennin. All the while in the time leading up to the inciting incident of the film, the rest of the prospectors treat Dennin with derision and laughter, and he becomes more and more sour towards them until the incident that sets the story in motion. Dennin kills two of the members of the party before being subdued in a violent fight with the last living people, the husband and wife. They take him into their custody, keeping a watchful eye on him, until the cruel winter dies down and they can bring him in for justice. The rest of the film shows the sort of Stockholm Syndrome that sets in with the three in the cabin, all of them growing more crazed but also seemingly more trusting and more sympathetic towards Dennin, until they cast their final judgment on him. Kuleshov's distinct style of editing is used throughout the film to highlight and intensify scenes, especially in the fight scene after Dennin kills the two men, and in the second to last scene, when they elect to hang Dennin in accordance with the Queen's law. In the fight scene, he cuts between wider shots showing the full action and extreme close ups on the faces, each crazed and wild eyed as they fight. In addition to these shots, it also cuts frequently to the polar opposite of the movement-heavy, frantic fighting to the completely still, grotesquely placed corpses of the dead men as a way to accentuate the tenseness of the scene. In the hanging scene, Kuleshov employs the same general montage structure; wide shots, extreme close ups, and shots of the inanimate thing that is causing the rising tension (corpses, a noose). Kuleshov also, through the whole film, cuts to a portrait of the Queen that hangs in their cabin, to constantly remind the characters and the audience of the law and the stakes. The use of this type of montage allows and forces the audience to feel the growing tension that the characters are feeling, through visuals, not through intertitles telling the audience how to feel. Kuleshov tells a story of extreme tension and despair, through montage more than dialogue and exposition. The way he cuts the scenes together, as previously mentioned, allows the audience to completely understand the stakes and the tension through visuals alone. 'By The Law' seems to be a very good example of how Kuleshov viewed the benefits of using montage, and each scene and the rising tension each scene creates, displays that use of montage.",
         "By the Law tells the tale of five people who have set up camp in the Yukon in hopes of finding gold. From the moment one of the gang� Dennin�finds gold, it is easy to tell that he is the outsider; one can quickly foreshadow that he is probably going to do something drastic later in the film. Indeed, soon enough�he does do something drastic: he comes in while others are eating and loses it�he takes his shotgun and shoots two of the five dead on the spot. The other two�husband and wife�are able to subdue him before he can do anything else. They are then left with a decision: do they wait until they can make it back to civilization to give him a trial, or do they take the law into their own hands and conduct the trial and sentencing themselves? This film doesn't have very many action scenes, but the one action scene�the scene where Dennin goes crazy and kills his fellow gold miners�is quite something. Kuleshov's use of montage seems to make the quick paced scene go even faster than it actually does. This one scene of action provides a lot of excitement for an otherwise dull movie. Another thing that stands out in the action scene is the way Kuleshov really focuses on the actors' faces. Their expressions add a whole different emotional effect that would not have otherwise been present. Another interesting part of this film is the fact that even a painting�Queen Victoria� can cause the Kuleshov effect to occur. During the trial Kuleshov flashes the camera back to her several different times and it seems almost as if her expression changes� even though it is very clear that as a painting it has not. Kuleshov does a great job using modernist techniques to give this story life.",
         "If there was a specific characteristic among the Russian films after the Bolshevik's advent to power, it was a special care about film aesthetics circumscribed in propaganda; avant-garde films that perfectly combined a political message with fascinating imagery. However sometimes Bolshevik films deviated from that norm thanks to the mastery and inventiveness of their directors. That certainly happens with \"Po Zakonu\" ( By The Law ), an astounding and brilliant cinematographic exercise directed by Herr Lev Kuleshov in the silent year of 1926. Herr Kuleshov's film theories play an important part in the success of the film. The film tells the story of five gold prospectors on the banks of the Yukon River trapped during a terrible winter and is an adaptation of Herr Jack London's story \"The Unexpected\". With minimal sets and cast ( this was a personal challenge for Herr Kuleshov, the claim that it is possible to accomplish a great film with few resources ) \"Po Zakonu\" is a remarkable and disturbing masterpiece. Fascinating shots of a wild environment ( nature is a main and decisive character in the film ) emphasize the claustrophobic atmosphere that drives the characters to desperation in their solitude (one of them shoots two other members of the crew). The film is also a disturbing physiological study wherein every gesture and facial expression is studied as well as the impressive Russian body language. Here the avant-garde technique is in the service of a nightmarish atmosphere and tense drama. And now, if you'll allow me, I must temporarily take my leave because this German Count must dig for gold in one of his Teutonic heiresses' private rooms. Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/",
         "Lev Kuleshov's \"By the Law\" is a largely psychological piece that suffers from some poor narrative choices. In the film, the frustration of a group of prospectors in the Alaskan wilderness turns quickly into joviality at the discovery of gold, and then unexpectedly degrades into sudden and chaotic violence. The remainder of the story, while not thematically complex, is an exercise in emotions. Each character descends into his or her particular brand of madness, emphasized by the silent, cramped, and (due to the weather) inescapable quarters in which the majority of the film talks place. Dennin, the murderer, displays spasmodic rage, and later, acceptance, with perhaps a degree of repentance. Nelson, the group's leader, shows a righteous but disturbing form of anger against Dennin, which he expresses through strangely repetitive or violent action. Edith, his wife, remains a defender of civilized justice, but suffers the most visible strain from remaining the voice of reason, and becomes progressively more frazzled, exhausted, and prone to attacks of grief. These driving psychological themes suffer, however, from strange choices in timing and storyline. Poignant scenes that might have better established the characters' growing exhaustion and stress tend to be rushed and frantic, leaving a lot of the emotional content ungrounded. The motivation for Dennin's crime is revealed late in the film, which is an interesting choice, but it turns out to be disappointingly hollow in comparison to the emotional weight of the preceding scenes. The crushing grief Edith displays after bending her previously steadfast morals to her husband's version of trail justice is likewise frustratingly undercut by the inscrutable decision to bring Dennin back to life after his ostensible death. Overall, \"By the Law\" is a good piece of psychological drama, but fails to present a satisfying narrative."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Goskino"],
      "summaries": ["A five-person team of gold prospectors in the Yukon has just begun to enjoy great success when one of the members snaps, and suddenly kills two of the others. The two survivors, a husband and wife, subdue the killer but are then faced with an agonizing dilemma. With no chance of turning him over to the authorities for many weeks, they must decide whether to exact justice themselves or to risk trying to keep him restrained until they can return to civilization."],
      "budget": 0
   },
   "movielensId": 120761,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1926-01-01",
      "dvdReleaseDate": null,
      "directors": ["Lev Kuleshov"],
      "runtime": 80,
      "movieId": 120761,
      "title": "By the Law",
      "mpaa": null,
      "actors": [
         "Aleksandra Khokhlova",
         "Vladimir Fogel",
         "Pyotr Galadzhev",
         "Porfiri Podobed",
         "Fred Forell",
         "Sergei Komarov"
      ],
      "imdbMovieId": "0017271",
      "originalTitle": "По закону",
      "genres": [
         "Western",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A five-person team of gold prospectors in the Yukon has just begun to enjoy great success when one of the members snaps, and suddenly kills two of the others. The two survivors, a husband and wife, subdue the killer but are then faced with an agonizing dilemma. With no chance of turning him over to the authorities for many weeks, they must decide whether to exact justice themselves or to risk trying to keep him restrained until they can return to civilization.",
      "tmdbMovieId": 126644,
      "avgRating": 3.5,
      "releaseYear": "1926",
      "numRatings": 4,
      "posterPath": "/1w7KEMksKELd2v7sy3M35mRECPE.jpg"
   }
}