{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "leprechaun",
            "id": 10310
         }
      ],
      "imdb_id": "tt0339294",
      "video": false,
      "title": "Leprechaun: Back 2 tha Hood",
      "recommendations": [
         18011,
         19287,
         19286,
         18009,
         59762,
         26962,
         70553,
         26959,
         38499,
         60965,
         26956,
         70984,
         30817,
         34845,
         25751,
         26957,
         27816,
         47891,
         34231,
         25753
      ],
      "backdrop_path": "/6xZrqzy2Uhq1DvB0zdE834p4gfB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Leprechaun",
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e2b",
               "name": "Warwick Davis",
               "profile_path": "/4LjgmjD9nKOgL3gGRhIS5EkI0a.jpg",
               "id": 11184,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Emily Woodrow",
               "gender": 1,
               "credit_id": "52fe47cd9251416c750a5e2f",
               "name": "Tangi Miller",
               "profile_path": "/muPztWB474dfCrZ1tfI8lmmPqas.jpg",
               "id": 80761,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rory",
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e33",
               "name": "Laz Alonso",
               "profile_path": "/6zqlURffzAErl4g4d8kiUWYWmoz.jpg",
               "id": 10964,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jamie Davis",
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e37",
               "name": "Page Kennedy",
               "profile_path": "/x33dFKAzV0IJEZuHE5hrrLyPQmF.jpg",
               "id": 177214,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "(Lisa Duncan",
               "gender": 0,
               "credit_id": "52fe47cd9251416c750a5e3b",
               "name": "Sherrie Jackson",
               "profile_path": null,
               "id": 208331,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Esmerelda",
               "gender": 1,
               "credit_id": "52fe47cd9251416c750a5e3f",
               "name": "Donzaleigh Abernathy",
               "profile_path": "/4ajXGPDN18IztZUdgjrb4vLTuUX.jpg",
               "id": 155940,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Watson",
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e43",
               "name": "Shiek Mahmud-Bey",
               "profile_path": "/ahbnSbmcZlQLUi2LnzFqxM49FFe.jpg",
               "id": 134529,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Jamie's Mom",
               "gender": 1,
               "credit_id": "52fe47cd9251416c750a5e7d",
               "name": "J. Karen Thomas",
               "profile_path": null,
               "id": 154495,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Father Jacob",
               "gender": 0,
               "credit_id": "52fe47cd9251416c750a5e81",
               "name": "Willie C. Carpenter",
               "profile_path": "/700iIf7ntH8ilYFustxOxzpASZv.jpg",
               "id": 20760,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Thompson",
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e85",
               "name": "Beau Billingslea",
               "profile_path": "/3Ooz7bdkkSwwbzOs9SPXIXvGKYQ.jpg",
               "id": 78494,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e27",
               "name": "Steven Ayromlooi",
               "profile_path": null,
               "id": 84983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e49",
               "name": "Steven Ayromlooi",
               "profile_path": null,
               "id": 84983,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e4f",
               "name": "Mark Jones",
               "profile_path": null,
               "id": 70558,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e55",
               "name": "Peter Block",
               "profile_path": null,
               "id": 51030,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe47cd9251416c750a5e5b",
               "name": "Phyllis Cedar",
               "profile_path": null,
               "id": 939493,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cd9251416c750a5e61",
               "name": "Mike Upton",
               "profile_path": null,
               "id": 80788,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cd9251416c750a5e67",
               "name": "Michael Whittaker",
               "profile_path": null,
               "id": 563074,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cd9251416c750a5e6d",
               "name": "Stephen H. Sloan",
               "profile_path": null,
               "id": 80850,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe47cd9251416c750a5e73",
               "name": "David Daniel",
               "profile_path": null,
               "id": 92937,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe47cd9251416c750a5e79",
               "name": "Kenn Coplan",
               "profile_path": null,
               "id": 64283,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.562717,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19288,
      "vote_count": 28,
      "budget": 0,
      "overview": "When Emily Woodrow and her friends happen on a treasure chest full of gold coins, they fail to to heed the warnings of a wise old psychic who had foretold that they would encounter trouble with a very nasty and protective Leprechaun.",
      "similar": [
         11811,
         19286,
         19287,
         18011,
         13207,
         11281,
         18009,
         126172,
         42622,
         15004,
         18887,
         112705,
         478974,
         120230,
         66457,
         329871,
         329873,
         237363
      ],
      "original_title": "Leprechaun: Back 2 tha Hood",
      "runtime": 90,
      "poster_path": "/dIyJ9mA3mPW1WEme5tUjaadHrYb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lions Gate Enterntainment",
         "id": 63092,
         "origin_country": ""
      }],
      "release_date": "2003-12-30",
      "vote_average": 4.9,
      "belongs_to_collection": {
         "backdrop_path": "/pRjYboGyfjO5PkY7Rdg21s4FhoI.jpg",
         "name": "Leprechaun Collection (Original Series)",
         "id": 19285,
         "poster_path": "/kdnaM7K8T8oXwWk2QdiWEs8Zg2w.jpg"
      },
      "tagline": "Evil has a whole new rap!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Ayromlooi"],
      "runtime": 87,
      "synopsis": "The film opens with an animated prologue revealing the origins of leprechauns, stating that they were summoned by a king to protect his gold from those who would try to steal it. After the death of the king the Leprechauns returned to their places of origin, all except one (Warwick Davis) who remained in the mortal world and through the ages slowly became corrupted and obsessed with the treasure he still guarded. In the present Father Jacob (Willie C. Carpenter) is chased through the construction site of the youth center he had planned on building by the Leprechaun, whose gold Jacob had taken to fund the building project. Using four-leaf clover laced holy water Jacob manages to banish the Leprechaun, summoning demonic hands which drag him underground, but soon after drops dead of injuries inflicted by the Leprechaun during the fight. One year later two down on their luck friends Emily Woodrow (Tangi Miller) and Lisa Duncan (Sherrie Jackson) have their fortune told when the clairvoyant Esmeralda (Donzaleigh Abernathy) who warns them that they will attain great wealth soon, but it must be denied as it will come at a great price and summon a terrible evil. While having a barbecue at the abandoned youth center construction site with Lisa, their stoner friend Jamie Davis (Page Kennedy) and her ex-boyfriend turned drug dealer Rory Jackson (Laz Alonso) Emily falls through a hole and discovers the Leprechaun's gold in an old tunnel where it was hidden by Father Jacob. Splitting up the gold (which is produced in a never ending amount by the chest it was contained in) evenly the quartet of friends use it to fulfill their fantasies, unaware that by taking the gold they have released the Leprechaun, who begins stalking the group (killing a guest who takes one of his coins at a party held by Jamie, prompting the police to temporarily arrest him). At the salon where Emily works the Leprechaun sneaks in and, after killing a regular customer, Doria, on the massage table by breaking her neck, attacks Emily, who barely escapes and warns Rory and the recently released Jamie, who rush to get to Lisa's. In her house Lisa is attacked by the Leprechaun and manages to fight him off for a short while, but is killed when the Leprechaun claws her in the stomach, with her friends finding her body moments later. While Emily and Jamie want to return the gold Rory does not and takes off with it; shortly after realizing Rory is gone Emily is attacked and chased outside by the Leprechaun, but is saved when Rory has a change of heart and comes back for her. Searching for Rory the Leprechaun stops by his house and kills Rory's profligate girlfriend Chanel (Keesha Sharp) by tearing out her upper jaw, reclaiming the gold she used to make a tooth while Rory and Emily are stopped and harassed by Officers Thompson (Beau Billingslea) and Whitaker (Chris Murray). After the Leprechaun appears and kills the two officers Emily and Rory escape and regroup with Jamie, only to be confronted by a machine gun wielding group of Rory's drug dealing rivals, led by Watson (Shiek Mahmud-Bey) and Cedric (Sticky Fingaz). Planning on executing Rory for infringing on their territory Watson and his gang are all disposed of by the Leprechaun, (who kills Watson and Cedric while the other two members run off) while Emily, Rory and Jamie drive off in Watson's car (which the Leprechaun latches to the bottom of for a short while) and go looking for help from Esmeralda. Advised to use four-leaf clovers against the Leprechaun by Esmeralda, Rory laces the hollow-point bullets of his gun with clovers Jamie finds in the marijuana Rory had earlier sold him. When the Leprechaun arrives Rory shoots him several times with the clover bullets, only for his gun to jam before he can finish the Leprechaun off. Rory and Emily are given the chance to run with the gold when the Leprechaun is distracted by Jamie and Esmeralda (the latter dying in a magical duel with the Leprechaun). Followed to the roof of the building Rory tries fighting the Leprechaun and is knocked out, though before the Leprechaun can kill him Emily taunts him by throwing some of his gold into nearby wet cement and lures him into the ruins of the youth center, where she tosses his gold into a furnace before knocking the Leprechaun in with it. Believing the Leprechaun is dead Emily returns to Rory, only for the recovered Leprechaun to renew his attack on them. Knocking Emily off the roof and leaving her barely holding on the Leprechaun taunts her, but is shot several times in the middle of his speech by Rory, who had fixed his gun. Shooting the Leprechaun repeatedly Rory runs out of bullets , but distracts him long enough for Emily to hit the Leprechaun with the chest of coins, sending him plummeting off the rooftop and into the wet cement below, where the Leprechaun sinks and becomes trapped with his gold. The movie them cuts back to the animated prologue like the one at the beginning, and the Leprechaun digs himself out of the ground leaving a cliffhanger ending.",
      "writers": [
         "Steven Ayromlooi",
         "Mark Jones"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0339294/",
      "coverLink": null,
      "actors": [
         "Warwick Davis",
         "Tangi Miller",
         "Laz Alonso"
      ],
      "reviews": [
         "This is a great movie! It has some very funny scenes and is one of the best Leprechaun movies out there. The Leprechaun seems much more evil in this one and no longer rhymes but he is still the reason to watch the movie. The deaths, although without the usual amount of gore, are still quite good. This movie will most probably spawn another sequel which will have to live up to this ones expectations. If you want a great Horror/Comedy you have to look no further this installment in the Leprechaun franchise will not disappoint!",
         "The hairdresser Emily Woodrow (Tangi Miller) finds a fortune in golden coins and she shares the amount with her close friends. However, the owner is the evil Leprechaun (Warwick Davis) that returns from Hell to get his treasure back, killing each member of the greedy group. \"Leprechaun: Back 2 tha Hood\" is silly, but funny in some moments. The problem is that the pothead and drug-dealer characters are non-likable and extremely ambitious, with the exception of Emily and Lisa; therefore the devilish Leprechaun becomes not as bad as he should be. The scene with the leg of the policeman is hilarious. My vote is four. Title (Brazil): \"O Duende Perverso\" (\"The Wicked Leprechaun\")",
         "Leprechaun Back 2 Tha Hood Written and Directed by: Steven Ayromlodi Yep, everyone's favorite evil elf is back in the 6th installment in this classic horror series. Parts 4 and 5 are universally viewed as two of the worst movies of all time (Despite them being two films I love, they are admittedly terrible) Steven Ayromlodi was still able to convince someone to give him the money to make a 6th movie. This time the Lep comes back to the hood in search of his gold once again. This time it is discovered by some down and out friends in the ghetto. They spend their fortunes and have fun...until the little Irish monster shows up and starts killing off the people that took his gold. Yeah, pretty cookie-cutter..but that's how the whole series is and you can't expect much more. But you gotta give director Ayromlodi credit for pulling out a couple of new turns, and making a solid entry into the series. I still think 3 is my favorite of the series, but this is definitely an improvement on 4 and 5 in all aspects. Sure, the acting is a bit cheesy at times, and it lacks in the gore department and the kills are less creative, but overall I was satisfied with this movie, and can only hope for a 7th. Definitely only for fans of the series though. **/4",
         "Leprechaun: Back 2 tha Hood directed by Steven Ayromlooi After some very bad sequels, a Leprechaun film has been made which can happily conclude the Irish monster's saga. It might have a reference to the hood in the title, but hardly similar to the previous attempt. Here they have created a worthy sequel. There may still be the problems with some of the characters and their dialogue, as well as some obvious plot holes, but Lep 6 actually worked on building up the characters, as well as a back story for the Leprechaun. Speaking of Leprechaun, Davis also manages to finish of his Leprechaun story, with one of his best Lep performances.",
         "The evil Leprechaun is back to reclaim his gold but this time he's got to resist the temptation of... smoking a bong?!? Leprechaun meets the boyz in the hood and proves that he's got what it takes to be the baddest mofo around. Lep is back to the hood and up to no good... again. I'm not an avid Leprechaun fan. In fact, I've never paid much attention to these movies until this year came around. I've seen Leprechaun 1, 2, 3 and now 6 (Back 2 Tha Hood) and I'd say that \"Leprechaun: Back 2 Tha Hood\" would have to be the best of the series. I had seen some parts of part 3 and about half of Leprechaun 4 a couple of years ago but I don't think I'd seen enough to pass judgment. What attracts me to this film the most is that it's so different from the rest of the series. When I say this, I'm thinking of how Jason X was to the rest of the Jason movies. I mean, the Leprechaun isn't used to dealing with these smart-ass ghetto thugs. The jokes used in the movie aren't very original and are either hit or miss. You either like this kind of humor or just think that it's been done before and move on. For me, it was a guilty pleasure. None of the characters in this movie are likable except for the Leprechaun, but if he wasn't likable, he wouldn't have gotten to this many sequels, would he? For the most part, I was happy to see these smart-asses get beaten up and impaled by bongs, stabbed with sharp objects and all harmful acts that happened during the movie. Some of the slow motion was well-placed and made the film evermore funny (i.e. Lep's eye incident) but for the most part, it didn't suit the movie all that well but didn't really harm it either.. The Leprechaun looked so much better in this film, he looks a lot creepier than he used to. Every time I'd see a Leprechaun film, I'd wonder if people actually got scared of him because he was always so comical with his appearance and annoying rhymes. Luckily, I only remember the Leprechaun blubbering out one rhyme in this movie which was a welcomed change, instead of rolling my eyes at another lame one-rhymer. When it all comes down to it, this is an average horror film but a good addition to the Leprechaun series. If you're bored and want some horror fun, check out this film because you got about a 50/50 chance of splitting your sides in laughter like I did or just staring blankly at the screen. I say, give it a chance.",
         "This sequel is so much better than the others, for starters its much darker and the Leprechaun's costume is also much better in this movie. Gone are the stripy socks and bright red pants, instead we have a more 19th century dark, creepy looking Leprechaun. The humour is still there in this film, except that its not cringeworthy like it was in earlier outings and is actually funny. There are very few hokey special effects and the storyline is played out well. They have also brought back the four leaf clover to kill a leprechaun mythology from the first film. Will it win an Oscar? No, but it sure makes up for the last few sequels which completely ignored the fact its supposed to be in the horror genre and instead tried to be too much of a comedy. All the Leprechaun films are fun in their own way, but this one is far less hokey - there's hope for the series yet!",
         "Why ?! I can ask it too many times to the film studios but why did even make a 6th one ? And also one who is almost a copy of the previous one. I would have understand that decision if the 5th one was a success, but it was terrible. And this one was, if possible, more terrible than the last one. What can you further about the last part of this terrible franchise. The storyline was again a huge fail. The leprechaun has a few moment and is defeated again so easily, they can blow him of the roof without having any difficulties with killing it. The acting was to laugh about as well so I rate this film 1/10",
         "I really don't see all of the fuss with this and the other Leprechaun movies.Sure,it's stupid in some parts,but this is actually a very entertaining horror movie.Well,it's more of a comedy than a horror,but you know what I mean.There is a little bit of gore,especially the part where the leprechaun took out a persons heart,and it was still beeping and pumping blood.That's a goof.The one problem with this movie is that it's full of them.For example,when the leprechaun grabbed a cop's leg,he supposedly tore it off.But in the next shot,his other leg is gone.But to say the least,this is a very entertaining piece of film that fans of the others should enjoy. When is 'Leprechaun 7' coming out?",
         "OK. I grew up watching the leprechaun shows. Totally fell in love with them. I used to laugh while my sisters got scared (wusses) The movies were great can't help but laugh at how stupid the leprechaun is. Gawd. You can't help but fall in love. (and want to smack the idiots that run from him. He's gonna get you anyways.) So yea I really recommend watching it. Wicked cool. I give this movie and all the other leprechaun movie's 2 thumbs up. Since I only have 2 thumbs. (pouts) Well bye for now got to go. Ciao Luv always Rhonda",
         "Wow. OK, African-Americans in the united states have invented or contributed to some of the most creative and profound art in the history of mankind (Jazz for example). But why on earth would anyone, of any color for that manner, want to be involved in an incredibly steaming pile of crap like this? I think the producers of Leprechaun ran out of ideas (not that were many great ideas rolling out of these masterminds to begin with), and decided to tap into a different market than just stupid white people from the suburbs watching bad movies like this. There are a few entertaingly bad scenes, like at the party, especially when mr. Leprechaun is on screen, but when he's not I suggest you hit your self in the head with a hammer for awhile, as that would actually be more enjoyable than watching this crap.",
         "IMO this may well be the best in the series. Most movies attempt to integrate humor and horror and end up a calamity while this one blends them very well. The film features Warwick Davis as the malevolent Leprechaun who stalks a group of friends from the inner city after stealing his gold. The actors do exemplorary jobs and there is enough blood and laughs to make it quite enjoyable. It is certainly a breathe of fresh air when put along the likes of Leprechaun 3 and 4. This Film also features Sticky Fingaz and Tangi Miller. Hesitance toward giving this film a chance is quite normal, but believe me it's worth it. Once in a while you find a straight-to-video gem, this is one of those times. If your a fan of Leprechaun, Check it out!",
         "I know that the Leprechaun is a lame villain, but I like him. He's funny and actually somewhat scary, you have to admit that he's scarier than Chucky. While this has the most racial stereotypes, it's still a very funny movie to watch. You have got to admit that it was hilarious when the leprechaun picks up Watson's phone and starts to have a little \"chat\" with his girlfriend. I know it was cheesy and predictable, but this was still good for laughs. Also, I think this was the bloodiest Leprechaun movie out of the 6, so a little gore is cool for horror fans. So, for a good laugh and just a fun time with the Leprechaun, give it a chance. 5/10",
         "Well this one does pick up where the first one left off. this one is campy, very funny, got lots of wanna be gangsters,, the lep firing off guns,, lot's of funny moments,, for instance when the Leprechaun steals a cop car and he says,, aww hell,, he looks down realizes he can't reach the gas pedal,, and when he tries to get a date with one of the brother's friends,, he describes himself to the girl on the phone,, the she asks him for his height,, he says 3 ft. 6 , she hangs up..the storyline has to do with a fortune teller who tells the black youths not to give in to the wealth of all the gold that they find,, but of course these teens are dumb, stupid they don't listen, and get caught up in the Leprechauns' schemes once again,, this one i would say is more on the funny side,, not to be taken seriously by anyone really.",
         "`. . . he's the man behind the mask!' Oh wait, that's the song from F13pt6. Nevermind. Here we are on another visit to the land of horror, where the monsters never die and no two sequels explain the title character the same way, but this is a given for anyone remotely familiar with franchise horror. No, you don't get a cookie for guessing that other than the title character and on-screen references, this film has no narrative connection to its predecessors. In reviewing Leprechaun 5, I expressed my overall disappointment, but stated that `Leprechaun still has enough moments to get my rental at least for one more film.' Well, the Lep's second trip to the hood is far more entertaining than the first. The humor is fresher, more precisely delivered, with plenty of little nudges at the Leprechaun's height which I found the funniest \u0096 especially coming from Warwick, himself, with quite a bit of enthusiasm so it's all in good humor. Okay, that and an ancient creature discovering our technology and customs is interesting (and not painfully done as in the first \u0091Hood' Leprechaun movie). The script/characters are more intelligent than some previous films (don't get your hopes up; it's not saying much) . . . overall it's one of the more entertaining Leprechaun sequels (again, that's not saying much.) I dunno \u0091bout other fans of the series, but Warwick Davis is my interest in the Leprechaun films and anything else that isn't hideous is a bonus. Other than typical complaints and shortcomings that all horror sequels showcase, I didn't have much to gripe about . . . so the sixth Lep outing satisfied my expectations.",
         "I have to admit I wasn't really looking forward to seeing this latest installment of the Leprechaun series. But as much as I love them I just had to. After seeing Leprechaun in Space and Leprechaun in the Hood I was absolutely sure that it would be just as horrible. Luckily I was wrong. I still think going \"back 2 tha hood\" was a bad idea, luckily it seems they went back to the original Leprechaun style - more humor! I laughed so hard at the whole ninja scene, and especially when the Leprechaun got to smoke his first bong! My final opinion is that there should have been more gore/violence, and it shouldn't have been in the hood. Other than that, it's really not that bad of a sequel!",
         "i truly enjoyed this movie , it has everything u want from a leprechaun movie , action,suspense,horror,drama,comedy........man!!!! great movie without a doubt...ive been a fan since the first one of course i did thought part 3 was bad and so was part 4 but they came back good with leprechaun in the hood now this last installment of the leprechaun movies has to be one of the best ones rent it buy it enjoy it i guarantee u will like it ...... warwick davis rules!!!!!!!!!!midget power!!!!!!! lol",
         "I'm asking myself WHY I rented this movie tonight, and I seriously cant come up with an answer. I had seen previous Leprechaun films, which were admittedly hilariously awful, so I should have known what I was getting myself (and my unlucky friend) into. It was about a half an hour to 45 minutes WITHOUT THE LEPRECHAUN (he was at the start, where he clubbed a priest over the knees with something).. our first glimpse of the little fella is when he walks into some guys room (how a grotesque midget dressed in green walked past an ENTIRE PARTY full of people, I'll never know) and started taking bong hits. Cinematic genius, right here. This movie made me die a little on the inside, really. It had a few saving graces though, namely: man getting clubbed at high speed by another man on a motorcycle. leprechaun taking bong hits, then stabbing a man with the bong. leprechaun getting hit by a low rider. leprechaun grabbing onto the bottom of the low-rider, after being hit by it, and getting dragged through city streets. leprechaun tearing a policeman's leg off, then being too short to drive a car (reach the pedals), then using the cops leg for the task. leprechaun managing to jump onto people 4 feet taller than he is. THE LEPRECHAUN LIVING UNDER COMPTON. despite these 7 utterly hilarious scenes, this movie was so god-awful, I (and the unlucky friend that watched it with me) contemplated suicide several times from beginning to end. This is 87 minutes of my life I will never get back, I wouldn't wish a viewing of this movie upon my mortal enemies. WOW.",
         "ok from the looks of this the people on the soundboard before i saw this made it seem like \"oh yeah this new graphics format , this movie will be the best out of the series, bl abla\" and yet when i saw it yeah i understand what they said abotu some cgi graphics format im assuming the intro was that part lol but the first 25 minutes put me to sleep i was watching a whole dumb ghetto movie which bored the living crap out of me FINALLY the leprechaun decides to show up and things didnt get that much interesting i mean soem funyn scenes when the leprechaun was toking on the bong then shoved it into that black guy's stomach muhahaha well overall it was not really that good. yeah how original can you get \"back 2 da hood\".",
         "Leprechaun In Tha Hood (2000) was arguably the worst of the Leprechaun movies (Except the remake) so another one had me fearing the worst. This was also the last official Leprechaun movie, the last one to feature Warwick Davis and it's hardly a fitting end for the little fella. It tells the story of a group who find the Leprecauns gold and become stalked by him. Pretty formulaic stuff, but the main difference here is how dark is. The Leprechaun movies are comedy horrors and aren't to be taken seriously, with over the top death scenes and regular quips they are supposed to be silly fun. This has minimal comedy, Leprechaun doesn't quip and the deaths are far from comedic. That was a really strange decision by it's creators and in this guys opinion and a really really stupid one. If you enjoyed Leprechaun In Tha Hood you might enjoy this but as a final entry to the series this was somewhat undeserving. The Good: Has its moments The Bad: The lack of comedy hurts the film I struggled to care about anyone Things I Learnt From This Movie: No Leprechauns were harmed in the making of this motion picture. The Leprechauns featured in this production were handled with care and concern for their safety and well-being",
         "Well, I'm going to say that this was the worst movie I've seen for Direct To Video Month. I skipped the previous one where he went to the hood first, but I don't care in the slightest. This movie features people in the ghetto finding the leprechaun's gold and he horribly kills them one by one. What makes this movie so stupid is that nothing in it makes any sense. We get a lot of scenes in the beginning that just focus on the human characters and it's all pointless. It's said that the leprechaun's weaknesses are his gold and four leaf clovers. They do in fact use a four leaf clover against him and nothing happens. Well, he gets shot by them but the bullets float out of his body like little yellow orbs. What? At one scene near the end, the leprechaun's gold is thrown into a furnace which should kill him, but for some reason it doesn't? We see the leprechaun melt and then he's back to normal. His gold should have been destroyed, but it's okay too. The leprechaun's chest of gold has this new ability. Whenever it's emptied, it magically refills. Why than, is the leprechaun afraid when people throw the gold coins out? It can just replenish them. I couldn't understand anything in this dumb movie. The leprechaun gives off more gory deaths including a police officer whose leg is ripped off and he doesn't even notice it at first. He also literally rips a girl's upper jaw off. Nice, huh? I admit it did kind of make me laugh with how stupid it was, particularly with how the leprechaun was shot over and over and never died. There's this psychic who tries fighting the leprechaun even though she knows she can't. I understood nothing and didn't want to. *",
         "yes dawg as an origin story I think it sets up the future franchise well: Leprachauns. It's important to understand the religious and moral backgrounds to this tightly interwoven plot. The excitement of the fast paced scenes and special effects right got me going. This film's only weakness are these two things The grammar The wrong leg was gone I like the way he didn't die but then cement killed him"
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Lions Gate Entertainment"],
      "summaries": [
         "The hairdresser Emily Woodrow finds a fortune in golden coins and she shares the amount with her close friends. However, the owner is the evil Leprechaun that returns from Hell to retrieve his treasure back, killing each member of the greedy group.",
         "When Emily Woodrow and her friends happen on a treasure chest full of gold coins, they fail to to heed the warnings of a wise old psychic who had foretold that they would encounter trouble with a very nasty and protective Leprechaun."
      ],
      "budget": 0
   },
   "movielensId": 121261,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-12-30",
      "dvdReleaseDate": null,
      "directors": ["Steven Ayromlooi"],
      "runtime": 90,
      "movieId": 121261,
      "title": "Leprechaun: Back 2 tha Hood",
      "mpaa": "R",
      "actors": [
         "Warwick Davis",
         "Tangi Miller",
         "Laz Alonso",
         "Page Kennedy",
         "Sherrie Jackson",
         "Donzaleigh Abernathy",
         "Shiek Mahmud-Bey",
         "J. Karen Thomas",
         "Willie C. Carpenter",
         "Beau Billingslea"
      ],
      "imdbMovieId": "0339294",
      "originalTitle": "Leprechaun: Back 2 tha Hood",
      "genres": [
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": ["z3Lkgr6XxDQ"],
      "plotSummary": "When Emily Woodrow and her friends happen on a treasure chest full of gold coins, they fail to to heed the warnings of a wise old psychic who had foretold that they would encounter trouble with a very nasty and protective Leprechaun.",
      "tmdbMovieId": 19288,
      "avgRating": 1.27273,
      "releaseYear": "2003",
      "numRatings": 11,
      "posterPath": "/dIyJ9mA3mPW1WEme5tUjaadHrYb.jpg"
   }
}