{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musician",
            "id": 4048
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "music business",
            "id": 10572
         },
         {
            "name": "rock music",
            "id": 11700
         },
         {
            "name": "chef",
            "id": 18293
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt3074780",
      "video": false,
      "title": "Supermensch: The Legend of Shep Gordon",
      "recommendations": [
         46902,
         381080,
         34219,
         228406,
         214711,
         58307,
         259999,
         333278,
         36724,
         365183,
         109048,
         32205,
         37904,
         84291,
         42732,
         84589,
         221557,
         125981,
         32274,
         124423
      ],
      "backdrop_path": "/craUEp6KvOiYzotrjxMvSbP8Li7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5304e19a92514104c41e2e75",
               "name": "Shep Gordon",
               "profile_path": "/lfu8envtdX1fBhcIcPk4Hn41Fns.jpg",
               "id": 56126,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5304e1b292514104c41e2ed1",
               "name": "Alice Cooper",
               "profile_path": "/nyJVaHPZSPMvJyS5aSal7a793qJ.jpg",
               "id": 35824,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5304e1bc92514104d5215f14",
               "name": "Sylvester Stallone",
               "profile_path": "/gnmwOa46C2TP35N7ARSzboTdx2u.jpg",
               "id": 16483,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Herself",
               "gender": 0,
               "credit_id": "5304e1c492514104c41e310f",
               "name": "Anne Murray",
               "profile_path": null,
               "id": 1236806,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5304e1cc92514104be1f95ae",
               "name": "Willie Nelson",
               "profile_path": "/7HmvoLTxsoa9VWsy8s25il0sYtF.jpg",
               "id": 8261,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5304e1d592514104c722acc5",
               "name": "Emeril Lagasse",
               "profile_path": "/b7RJl1H24LiMB1XTSxnnWkewlFD.jpg",
               "id": 183758,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "536e74930e0a2647c8010db2",
               "name": "Майкл Дуглас",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "536e74a10e0a2647c4010b15",
               "name": "Mike Myers",
               "profile_path": "/sa8MMxXZrHgQ85hTAP11WS4N3ik.jpg",
               "id": 12073,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "536e74d60e0a2647d10102fa",
               "name": "Tom Arnold",
               "profile_path": "/udJkmZPrQs4D8NPV8u4BEv3rNLX.jpg",
               "id": 74036,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Himself",
               "gender": 2,
               "credit_id": "55687af792514146c60017e4",
               "name": "Steven Tyler",
               "profile_path": "/tey8qIx6CmLm1AnCu4DBNUrPb9j.jpg",
               "id": 37935,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d65c3a368484e1e6db7",
               "name": "Mike Myers",
               "profile_path": "/sa8MMxXZrHgQ85hTAP11WS4N3ik.jpg",
               "id": 12073,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "556879b992514156b60022fb",
               "name": "Beth Aala",
               "profile_path": null,
               "id": 1257723,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "556879c09251417453001479",
               "name": "Beth Aala",
               "profile_path": null,
               "id": 1257723,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "556879d492514156c7002431",
               "name": "Joseph Krings",
               "profile_path": null,
               "id": 1386427,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "556879e192514146c60017ce",
               "name": "Michael Pruitt-Bruun",
               "profile_path": null,
               "id": 1471722,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "556879f3c3a3686bc30014a1",
               "name": "Andreas von Scheele",
               "profile_path": null,
               "id": 935271,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55687a019251417f3e0006eb",
               "name": "Alice Henty",
               "profile_path": null,
               "id": 222279,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "55687a0ec3a3686b230014ed",
               "name": "Kate Lingley",
               "profile_path": null,
               "id": 1471723,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55687a1d9251417f3e0006f0",
               "name": "Steph Ching",
               "profile_path": null,
               "id": 1471724,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55687a2b92514156c700243a",
               "name": "Anna-Karin Edelbrock Fogg",
               "profile_path": null,
               "id": 1471725,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "55687a3dc3a3681c60002612",
               "name": "John Houlihan",
               "profile_path": null,
               "id": 1471726,
               "department": "Production",
               "job": "Co-Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.308591,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 209416,
      "vote_count": 39,
      "budget": 0,
      "overview": "Supermensch documents the astounding career of Hollywood insider, the loveable Shep Gordon, who fell into music management by chance after moving to LA straight out of college, and befriending Janis Joplin, Jim Morrison and Jimi Hendrix. Shep managed rock stars such as Pink Floyd, Luther Vandross, Teddy Pendergrass and Alice Cooper, and later went on to manage chefs such as Emeril Lagasse, ushering in the era of celebrity chefs on television.",
      "similar": [
         112160,
         858,
         141,
         212778,
         227306,
         634,
         5915,
         437557,
         297762,
         242224,
         27586,
         2539,
         2771,
         43923,
         18221,
         294016,
         9587,
         3134,
         11236,
         31900
      ],
      "original_title": "Supermensch: The Legend of Shep Gordon",
      "runtime": 75,
      "poster_path": "/1spRBeofv0knLliedyqOI8DS7sz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nomoneyfun Films",
            "id": 54414,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "A&E IndieFilms",
            "id": 7315,
            "origin_country": ""
         }
      ],
      "release_date": "2014-06-06",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "https://dogwoof.com/supermensch",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Beth Aala",
         "Mike Myers"
      ],
      "runtime": 85,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3074780/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIyNzc3NDM2N15BMl5BanBnXkFtZTgwNTcyMTk2MTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Shep Gordon, Sylvester Stallone, Michael Douglas | See full cast and crew »"],
      "reviews": [
         "This film is about entertainment manager Shep Gordon, who got his start by agreeing to manage (and, 43 years later, continues to manage) Alice Cooper. He also manages others, and this documentary goes through his life. You hear from people who you don't see commenting in films often, like Michael Douglas, Mike Myers (who also directed) Alice Cooper himself. It glosses over many things, there are no scandals, no moments of jaw dropping revelation, just the story of a man looking back at his career mostly with a smile. The most poignant part of the film are the parts involving the late Teddy Pendergrass, but there is also commentary from an ex's grandkids, whom Shep has all but adopted. Although now semi-retired and living in paradise in Maui, he still sees people all the time. Again, nothing scandalous, just a mostly straight forward telling of a man who mucked through the entertainment industry and still comes out of it well loved and admired. I recommend it to anyone who is interested in the subject, but it really is refreshing to watch a documentary about someone who hasn't been anything but a good person and who is held in high esteem by his friends and colleagues.",
         "You know that famous line from, Almost Famous, \"I am a golden god!\"? That quote pretty much sums up the life and times of Shep Gordon, a would be prison guard turned drug dealer turned one of the most famous managers to some of the biggest musicians of their day. You know that scene from Almost Famous where the plane is going down, and the bandmates blurt out confessions? Shep Gordon was on that plane and so was Cameron Crowe, when he put that true outrageous moment into the movie. Shep Gordon's life is one very outrageous movie and now Mike Myers, in his directorial debut, turns it into a good time love letter and at times, moving documentary movie. More than outrageous, Shep is a legend in his excess of sex, drugs and rock and roll. Not one to miss an opportunity with the ladies, he would wear a t-shirt on tour that said, \"No head, no backstage pass\". But the magic of this film, something that Myers didn't craft on accident, is that the biggest legend of Shep's excess was the capacity of his heart. A kind and very generous man, Shep was every famous person's best friend because, unlike 99% of the music managers with their slimy reputation, he had the biggest heart in the room. After being ostrasized by the fellow prison guards because of his big unkempt hairstyle, Shep found himself holed up in a Hollywood hotel. That hotel turned out to be the infamous Landmark Motor Hotel selling drugs to none other than Janis Joplin, Jim Morrison, and Jimi Hendrix. When Shep knew the heat would catch up to him sooner than later, he stepped away from dealing and got the idea from Hendrix to start managing music. \"You're a Jew aren't you? You should manage music\", and that's how it all started. Shep's first client was Alice Cooper, and they've been inseparable since. Even many, many, years and famous clients later, when Shep decided to retire he didn't retire from his best friend Cooper. It was with Cooper that Shep improvised press out of thin air turning Cooper into a star. Shep was a very adaptable manager who had a diversity of clients that spanned the hard rock stylings of Cooper, to the R&B Teddy Pendergrass, to the Canadian country good girl Anne Murray. He reached beyond music with many film producing credits, and when he became infatuated with the culinary arts, he represented the greatest chef's in the world, inventing the celebrity chef (Emeril Legasse among many others). The insight into each of these clients is truly wild and usually ended up with a happy ending; Pendergrass ending up a mixed bag tale. And while we could listen to Shep's wild tales and conquests forever, Myer's gets us deep access into his personal life, never letting us forget that this is a good human being who really made a difference in so many lives. His want for offspring keeps surfacing throughout. The mix of his earlier promiscuous life with his self sacrificial motivation to bring all of his clients everything they could ever want has left him without an heir to the Gordon empire. Shep gets closest to being a dad when tragedy strikes as an old girlfriend's grandchildren lose their mother and he comes to the rescue not only wildly financially but also as a loving father figure. That selfless deed is where the true legend of Shep Gordon lies, a supermensch, aka a superman. \"this\" selfless deed is where the true legend of Shep Gordon lies, a supermensch, aka a superman. Matthew 7:12",
         "It has been a while since Mike Myers has done anything relevant which I think it was Inglorious Basterds along with that turd The love Guru. Now Myers is back with a documentary about one of the best managers in the entertainment business: Shep Gordon. Thankfully, Myers contributes a lot of energy into this documentary along with providing a spotlight to a very interesting man. Good: Shep Gordon is a very interesting guy and that is what makes this documentary work so well and that is the subject matter. Shep's story from unemployed chump to a world class manager for the biggest musicians in the 60s, 70s, and 80s. His interactions with Jimi Hendrix, Alice Cooper, Janis Joplin, and many other actors and musicians are entertaining and with the addition of reenactments provide plenty of funny moments. It also paints the man as a very humble person along with some serious moments help provide some well placed drama. Overall, this is a very entertaining documentary about a very interesting man as well as being a good comeback for Mike Myers.",
         "\"Supermensch: The Legend of Shep Gordon\" (2014 release; 85 min.) is a documentary (written, produced and directed by Mike 'Austin Powers' Myers) about the life and times of Shep Gordon, one of the legendary managers in the entertainment industry. As the movie opens, and after some general introductory comments from people like Michael Douglas, Sylvester Stallone, Alice Cooper and others, Gordon tells in his own words how it all got started, back in 1968 when he really wanted to become a probation officers, and even took and passed the California Probation Officer exam. But when it became clear he didn't fit in with the others at the CA juvenile facility he was assigned to, he dropped out and drove to LA where he checked into the Hollywood Landmark Hotel, and promptly befriended Janis Joplin and Jimi Hendrix. It was Hendrix who 'pushed' Gordon into managing (\"You a Jewish boy?\" \"Yea\" \"You should become a manager.\" \"Okay\", ha!). Gordon's first important client was Alice Cooper, then still toiling into obscurity, but not for much longer. Gordon was 21 at the time, if you can believe it. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out. Couple of comments: first and foremost, even if Shep Gordon may not be known to you at all, you are in for a finger lickin' good time with this documentary. The man was arguably one of the most connected people in the Hollywood entertainment scene, and apparently one of the most respected and beloved. Besides managing many stars in the music and movie business, Gordon practically single-handedly started the 'celebrity chef' scene when he befriends French chef Roger Verge and later agrees to manage him and many other chefs. Second, given the 40+ year relationship and bond between Gordon and Alice Cooper, we get to see quite a bit of the Cooper saga with fascinating insights on how Cooper was able to break through, with the ideas from Gordon playing a crucial role (and hence it's a nice compliment/contrast to the recent \"Super Duper Alice Cooper\" documentary). Third, the documentary does not shy away from the personal side: while we see Gordon having relationships with Sharon Stone and other well-known women, in the end we see Gordon alone. Says his assistant: when he wakes up after the surgery and sees me beside the bed, it's clear that he wishes it was not me, his paid personal assistant, whom he'd be staring at\", wow. This is not a 'dirty laundry' type of documentary, so if you think you'll be hearing/seeing a lot of gossip on the artists managed by Gordon, you will be sorely disappointed. If on the other hand you are interested in getting a portrait on one of the most successful managers in the Hollywood entertainment business, then this is for you. I enjoyed this from start to finish. Quite a nice debut for first-time director Mike Myers. \"Supermensch: The Legend of Shep Gordon\" is HIGHLY RECOMMENDED!",
         "Shep Gordon has managed many huge acts, first in the music business, and then in other areas ranging from film to cooking. He has also befriended just about every heavyweight in Hollywood. And yet it seems he's managed to do so while still being a good guy, a nice guy, an honorable guy. There are on camera interviews with Alice Cooper (who was Shep's 1st client, and who he has managed for 45 years!), Mick Fleetwood, Michael Douglas, Tom Arnold, Emeril Lagasse, Anne Murray, Mike Meyers, Willie Nelson, Sylvester Stallone and Steven Tyer. But the best interview subject is Shep himself, who has tremendously entertaining, often funny and occasionally tragic anecdotes about his many years in show business. Among the most interesting are the various clever, and sometimes amusingly devious ways Shep would raise his clients' public profiles and help make them stars. There's a genuine wisdom and even a spiritual side to Shep, who befriended the Dali Llama, and spent a week cooking for him as a way of giving back. Ultimately Shep realized, sadly late in the game, that there was more to life than work, and that he was missing out on having kids and a family. Not a 'change your life' film, but it's always engaging, like listening to the most fun and intelligent guest at a great party.",
         "An upbeat and informative documentary about the life of a man who's done a lot of sex, drugs and managing rock & roll. He appears to have rubbed shoulders with so many celebrities, but still remains down to earth. I'm sure he has a 1001 stories to tell,some in the film are really interesting. I think Shep would make a great pick for the old fantasy dinner party scenario. I was engrossed by his journey and the unpretentious honesty of his very interesting life, a true opportunist and marketeer who appears to remain steadfastly loyal to those around him. A funny documentary very different from so many before, loved the graphic reconstructions and the narrations transposed on these, thoroughly entertaining, I learned and laughed a lot.",
         "If you pay an obsessive amount of attention to film, as I do, you may have noticed the absence of comedian Mike Myers in films in the last few years. For the last couple years, Myers has been invested in making his directorial debut, a documentary by the name of Supermensch: The Legend of Shep Gordon, chronicling the life of Shep Gordon, a renowned talent manager who managed everyone from Myers himself to stars like Alice Cooper, Teddy Pendergrass, and Jimi Hendrix. In just eighty-five minutes, Myers, and Gordon, who narrates practically the entire documentary, gives us an in-depth look at the life of a person who likely enters our mind a total, abstract figure and emerges as someone we probably wouldn't mind having drinks with at any given time. In the beginning, Gordon, who looks like a cross between Seinfeld co-writer Larry David and former Canadian Football League coach Marc Trestman, talks about his experiences as a sociology major at the University of New York, Buffalo, which lead him to venturing out to the west coast to become a probation officer. After a traumatizing experience at his first day on the job, Gordon went back to his hotel room, dropped acid, and proceeded to relax and unwind before believing he heard the screams and cries of a woman being raped. When he ran outside to \"rescue\" said woman, he was punched in the face by none other than Janis Joplin, who was doing drugs with Jimi Hendrix. It didn't take long for Gordon to become their manager, predominately based on the qualifications that Gordon was indeed high and knew the drug world all too well. Gordon eventually got connected with Alice Cooper, functioning as his manager by staging outrageous shows that would make headlines and selling drugs in the audience to keep the crowd coming back for more in both the performance and the social aspect of the show. Gordon talks about how he realized early on that kids loved anything their parents detested, so he tried to get Cooper arrested on stage one night by having him perform naked in saran wrap, to which Gordon would respond by calling the police pretending to be an angered parent. By the time the police had arrived at the venue Cooper was performing at, the saran wrap had fogged up from the heat of the massive crowd and the police questioned why they were even called. Gordon is filled with those kinds of wild and crazy stories, and Supermensch is a time when those stories are released and a character is revealed. One of the stories he shares is how he and Cooper sort of pioneered audience participation and liveliness within crowds at rock concerts, going as far as throwing a live chicken in the audience, which would later come back to Cooper a mangled and bloodied mess, or how feathered pillows were scattered throughout the concertgoers. In addition,Gordon talks about how him and Cooper, who have remained lifelong friends since they were first acquainted with one another, recorded Cooper's song \"I'm Eighteen\" in Canada because Cooper's own Straight Records label didn't want to be affiliated with the song. This propelled \"I'm Eighteen\" to be a huge hit in Canada and its success eventually bled into the United States, becoming one of Cooper's most recognized songs. The ideology behind Gordon's business practices revolves around three kickers. One is his basic philosophy, which is \"get the money, remember to get the money, and never forget to always remember to get the money,\" in reference to receiving the promised paycut for the plethora of shows he scheduled for his clients. The second is conducting what he refers to as \"compassionate business,\" where nobody wins and nobody loses but everyone wins and everything works out in the end. Finally, Gordon believes in a system that uses \"coupons,\" or asking favors and repaying them through incalculable kindness, such loaning out his home to people he has known for years, or simply chipping in financially to fund someone's lifestyle at this given time. For somebody who has partied enough and undoubtedly seen every racy, cut-throat side of business there is, the fact that Gordon remains so tender and human is astonishing. Finally, Myers doesn't neglect what the future held for Gordon, as he ventured into culinary arts after meeting French chef Roger Vergé. Gordon states how he enjoyed the freedom and liberation brought forth by the field of culinary arts because once you finished a meal, that was all that needed to be done, whereas managing talent and numerous different acts required constant contemplation of how to approach the next rodeo in a way that would mirror or best the success of the previous venture. In addition, Gordon's tireless work ethic has deprived him of the one thing we see he has needed most in his life - a wife and kids. Watching Gordon in his later years, we see a man not concerned with the party and debauchery lifestyle as he once was, but one looking to settle down and produce somebody who can go on to optimistically live the same kind of caring and open-minded life his father has done throughout his life. Supermensch is a wonderful documentary, thoroughly human and uncommonly entertaining, with numerous celebrities like Tom Arnold and Michael Douglas weighing on what Gordon has done for them. At a simple, eighty-five minutes, Myers chronicles just about all we need to know about Gordon to come to the consensus that this is a man responsible for a lot more than what we have credited him for, and a soul just as charismatic as the talent he manages. Directed by: Mike Myers.",
         "The life and career of the legendary Hollywood insider, Shep Gordon. I had never heard of Shep Gordon before this documentary showed up on Netflix. Now I know he was instrumental in the rise of Alice Cooper and his legend, he helped create the \"celebrity chef\" and he was involved in the Cameron Crowe plane crash story fictionalized in \"Almost Famous\". We learn about the Hollywood Vampires, and the unlikely drinking duo of John Lennon and Alice Cooper. I say unlikely not just because how different they are musically, but the political aspects could have been mind-blowing (though Cooper insists he was apolitical at the time). We learn of the Anne Murray and Alice Cooper connection, which is even stranger than Lennon. Heck, in many ways this is far more a story of Alice Cooper than it is of Shep Gordon. If a Cooper documentary does not exist yet, expect one to come around soon thanks to his role in this. Is the story too positive? That seems to be the biggest complaint, that the film comes off as more of a Mike Myers love letter than a true documentary. Surely someone at some point must have had something negative to say? Maybe, maybe not. At the very least, Myers should be applauded just for getting this out there and letting the world know Gordon exists. Clearly Hollywood knows, but does anyone else?",
         ". . . as Chicken Little used to say. Film director Michael Myers gets a bunch of his buddies to pay homage on-screen to 21st Century Hawaii's version of 20th Century Paris' Gertrude Stein. However, unlike Stein's salon for intellectuals, what the denizens of Hollywood producer\\music artist manager Shep Gordon have in common is that almost ALL of them are filthy rich. They can personally thank Gordon for much of their lucre, as well as their fame. Unfortunately, Gordon himself has been at the forefront of blurring the line between fame and infamy during the past 50 years. As he observes toward the end of SUPERMENSCH, \"There's nothing I've ever seen in my life with Fame that's healthy--it makes it hard to survive.\" This film makes frequent references to ill-fated Gordon intimates, including Janis Joplin, Jimmi Hendrix, and Teddy Pendergrass. The other constant themes are Gordon's thwarted obsession to have a biological child of his own (who could inherit his \"$20 million\" digs on Maui), and Bad Karma (which he attempts to ward off by sleeping in the same bed his role model the Dalai Lama reclined in at a New York City luxury hotel). All this is enough to prompt viewers to shout at the screen, \"But hey, Shep, WHOSE idea was it for Alice Cooper to start slaughtering defenseless chickens on-stage as part of his \"act\"??!",
         "Outstanding documentary. The story of Shep Gordon, a man who, while a brilliant agent in the entertainment industry, is relatively unknown to most people, despite exerting incredible influence in the music and movie industries. Moreover, his personality goes against the image we have of agents, in that he is not just about the money but shows genuine compassion and friendship. The amount of stars in his sphere of influence, and as friends, is amazing. Incredibly well made by Mike Myers, in his directorial debut. He painstaking compiled stills and footage of Gordon for the movie. Some scenes are dramatized but these are generally very humorously done, giving the movie an (appropriate) light-hearted tone. Not just a story of a man, pretty much a \"how to\" manual on publicity. He was a genius at marketing. Surely one of the best documentaries ever made."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Music"
      ],
      "productionCompanies": [
         "A&E IndieFilms",
         "Nomoneyfun Films"
      ],
      "summaries": [
         "In his directorial debut, Mike Myers documents the astounding career of Hollywood insider, the loveable Shep Gordon, who fell into music management by chance after moving to LA straight out of college, and befriending Janis Joplin, Jim Morrison and Jimi Hendrix. Shep managed rock stars such as Pink Floyd, Luther Vandross, Teddy Pendergrass and Alice Cooper, and later went on to manage chefs such as Emeril Lagasse, ushering in the era of celebrity chefs on television. Stuffed with fantastic archive footage the film traces Shep's transformation from the 1970's hedonist to today's practicing Buddhist yearning for a family of his own.",
         "The life and career of the legendary Hollywood insider, Shep Gordon."
      ],
      "budget": 0
   },
   "movielensId": 121227,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-06-06",
      "dvdReleaseDate": null,
      "directors": [
         "Mike Myers",
         "Beth Aala"
      ],
      "runtime": 75,
      "movieId": 121227,
      "title": "Supermensch: The Legend of Shep Gordon",
      "mpaa": "R",
      "actors": [
         "Shep Gordon",
         "Alice Cooper",
         "Sylvester Stallone",
         "Anne Murray",
         "Willie Nelson",
         "Emeril Lagasse",
         "Michael Douglas",
         "Mike Myers",
         "Tom Arnold",
         "Steven Tyler"
      ],
      "imdbMovieId": "3074780",
      "originalTitle": "Supermensch: The Legend of Shep Gordon",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [
         "831jkktrBqE",
         "Zd0VOkPOrV0"
      ],
      "plotSummary": "Supermensch documents the astounding career of Hollywood insider, the loveable Shep Gordon, who fell into music management by chance after moving to LA straight out of college, and befriending Janis Joplin, Jim Morrison and Jimi Hendrix. Shep managed rock stars such as Pink Floyd, Luther Vandross, Teddy Pendergrass and Alice Cooper, and later went on to manage chefs such as Emeril Lagasse, ushering in the era of celebrity chefs on television.",
      "tmdbMovieId": 209416,
      "avgRating": 3.71795,
      "releaseYear": "2014",
      "numRatings": 39,
      "posterPath": "/1spRBeofv0knLliedyqOI8DS7sz.jpg"
   }
}