{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stage",
            "id": 1674
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "barber",
            "id": 189368
         }
      ],
      "imdb_id": "tt0084747",
      "video": false,
      "title": "Sweeney Todd: The Demon Barber of Fleet Street",
      "recommendations": [
         287983,
         44349,
         42088,
         100960,
         46725,
         16877,
         25109,
         19010,
         47945
      ],
      "backdrop_path": "/csrZP0IfSQVYXsUY4hEXh4vr9fm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nellie Lovett",
               "gender": 1,
               "credit_id": "52fe44a6c3a368484e02f22f",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sweeney Todd",
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02f233",
               "name": "George Hearn",
               "profile_path": "/rLGq38BNVsSkHpnQDYZNNb108gz.jpg",
               "id": 38337,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Anthony Hope",
               "gender": 0,
               "credit_id": "54ae8d83c3a3684abf00025c",
               "name": "Cris Groenendaal",
               "profile_path": null,
               "id": 1136871,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Judge Turpin",
               "gender": 2,
               "credit_id": "54ae8d9092514113fa001589",
               "name": "Edmund Lyndeck",
               "profile_path": "/llzcjnIiJRKS2WcrlaRhb03OKMN.jpg",
               "id": 111679,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "The Beadle",
               "gender": 0,
               "credit_id": "54ae8d9d92514170850002fc",
               "name": "Calvin Remsberg",
               "profile_path": null,
               "id": 1236017,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54ae8dadc3a368328e0002c5",
               "name": "Terry Hughes",
               "profile_path": null,
               "id": 15239,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54ae8dc0c3a36817f000036c",
               "name": "Hugh Wheeler",
               "profile_path": null,
               "id": 136149,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54ae8dd7c3a36817f0000371",
               "name": "Christopher Bond",
               "profile_path": null,
               "id": 1376672,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54ae8de6925141152c001797",
               "name": "Bonnie Burns",
               "profile_path": null,
               "id": 1410654,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54ae8df19251417aa70003e2",
               "name": "Archer King",
               "profile_path": null,
               "id": 1410655,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "54ae8dfcc3a36817f000037b",
               "name": "Bill Klages",
               "profile_path": null,
               "id": 1136898,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.089913,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24745,
      "vote_count": 11,
      "budget": 0,
      "overview": "Times are hard in 1846 London and one must make do. Nellie Lovett adds something extra to the meat pies she peddles on Fleet Street. The secret ingredient: freshly murdered victims of her partner in crime, barber Sweeney Todd. Composer/lyricist Stephen Sondheim refashions a macabre tale into a musical masterwork in this dazzling performance of the 1979 Broadway hit originally staged by Harold Prince. In her Tony-winning role, Angela Lansbury plays Nellie. George Hearn turns his stage role of twisted Sweeney into an Emmy-winning triumph. The score coils around itself in every-tightening spirals. The lines ripple with black humor and madness. Enter Sweeney's tonsorial parlor. Attend the tale.",
      "similar": [
         357096,
         15069,
         11423,
         979,
         948,
         75780,
         281,
         281957,
         395834,
         445954,
         21484,
         3134,
         123109,
         984,
         18587,
         26390,
         369300,
         65754,
         238636,
         395990
      ],
      "original_title": "Sweeney Todd: The Demon Barber of Fleet Street",
      "runtime": 140,
      "poster_path": "/loUOqb5fyEeGqfzmUiWiN1rLYG4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Nederlander Organization",
            "id": 43445,
            "origin_country": ""
         },
         {
            "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
            "name": "RKO Radio Pictures",
            "id": 6,
            "origin_country": "US"
         }
      ],
      "release_date": "1982-09-12",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Terry Hughes",
         "Harold Prince"
      ],
      "runtime": 140,
      "synopsis": null,
      "writers": [
         "Hugh Wheeler",
         "Christopher Bond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084747/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1MzYwMjk1Nl5BMl5BanBnXkFtZTcwMzg3MDUyMQ@@._V1_SY317_CR27,0,214,317_AL_.jpg",
      "actors": ["Stars: Angela Lansbury, George Hearn, Cris Groenendaal | See full cast and crew »"],
      "reviews": [
         "Dark and bleak sets, thrilling music that cuts through your spin like aknife (or razor) a perfect cast lead by Broadway greats Hearn and Lansbury. This is exciting theatre flawlessly transferred to the small screen. Sondheim is the most talented songwriter of our age and Todd is his Masterpiece, from the Brechtian opening ballad to the darkly humorous Act I finale- \"A Little Priest\" where Lovett and Todd fantasize about the victims that will wind up in their meat pies , this play never ceases to thrill,excite and satisfy. Betsy Joslyn also excels as Johanna, even she, as the plays ingenue seems slightly mad.Edmund Lyndeck turns in a bravado performance as the corrupt Judge who lusts after Joslyn and is the subject of Todd's vendetta. Lansbury and Hearn command the show as only two great actor/stars can do. Other musical highlights include Todd's \"johanna\" Lovett's \"worst pies in London\" and the Act II opening 'GOD THATS GOOD\", And that is a title to describe this production !",
         "First of all, I have watched this show since I was a little toddler, and I have always loved it. Sure, maybe I didn't understand it when I was that young, but I still enjoyed it! And now that I have been able to understand it for several years, I love it even more. The score of this musical is the most wonderfully detailed score I have ever heard! Every note is perfect, I don't even need to hear the singing to enjoy it! Moving on to this particular production- This is magnificent! Of course no one could play Mrs. Lovett besides Angela Lansbury, and she does it perfectly. And she should, she has been playing this part for several years. George Hearn is absolutely brilliant. The best Sweeney Todd I have ever heard. He has a wonderful voice, yet he can throw his voice so well! His \"epiphany\" is incredible, as you can tell by the audience's reaction to it. The Judge, Toby, Antony, and Pirelli are also so wonderful in their roles. Everyone is perfect! Well, I still have to fast forward through Johanna's Green finch and linnet bird. She just doesn't sing that song well at all. This show CAN be appreciated at all ages, but it is not always accepted. I am not your typical middle-aged theater lover, I am only 15 years old, yet Sweeney Todd has given me a greater appreciation for music than I have gotten from any other musical.",
         "I have only praise for this film. From start to finish it captured the brilliance of Stephen Sondheim's musical. I am not a big fan of musicals most of them are very overdone. This one however changed my mind. I am an actor myself and have actully played Sweeney and I know how hard this role is. George Hearn gave a stunning, masterful and rounded performance worthy of the highest awards that we can give him (He won an Emmy and that's something.) Everything he does he turns to gold. He is so good it will blow your mind why he's not in films winning oscars. Lansbury is also very good and very funny. Sara Woods is creepy and wonderful as the Beggar Woman. All in all a great video. Pick it up if you can.",
         "Even if you're not a \"theatre person,\" I highly recommend that you see this. Based off of a play of the same name by Christopher Bond (which, in turn, had been based off of an old London legend), Sondheim did a wonderful job bringing it to the musical theatre stage. The score is just amazing-- by far Sondheim's best, and probably one of the best scores written for a musical ever. The show was cast extremely well, my only complaint being of Betsy Joscelyn's portrayal of Johanna. It;s good, mind you, and she's a very versatile actress, but she just doesn't sing \"Greenfinch and Linnet Bird\" too well. But other than that, it's all phenomenal-- Angela Lansbury *made* the role of Mrs. Lovette, and she just does it so well. George Hearn was a good replacement for Len Cariou in the title role, and Ken Jennings gives a great performance as Tobias. The ending will give you chills. Top marks for a wonderful show.",
         "I have owned a copy fo this for ages now, on video, but will definitely be buying the DVD release. Angela Lansbury and George Hearne are the unmistakable people to perform these legendary roles. This is suberb theatre at its peak, what a cast, the entire crew, the staging and the lighting are fantastic, as well as the ensemble who provide the extras in this macabe piece of theater. The new work with Patti LuPone and George Hearn is nothing in comparison, except for the lush surround sound provided by todays technology. A must see for any die hard Stephen Sondheim fanatics like me.",
         "Though the video technology may be dated, this classic musical play, now on DVD, is the best version of Sondheim's most important and polished work on Broadway. If you've never seen SWEENEY TODD, then you must buy this DVD. I saw this production in November 1980 at Kennedy Center in Washington--and fell in love with a pre-\"Murder She Wrote\" Angela Lansbury. Subsequently, I tried to find any and all of her work, among them: MOVIES: \"The Harvey Girls,\" \"The Picture of Dorian Gray,\" \"Manchurian Candidate\"; CDs: \"Mame,\" \"Dear World,\" and \"Gypsy\"; and many more. The rest of the cast is flawless, too. All in all, this wonderful DVD gives us the definitive version of Sondheim's opera!",
         "There are no flaws in this production. Perfectly entertaining, fun, and worthy of respect. This is what theatre is all about. Definitely not for the very young, but slightly older kids will get a great kick out of seeing it and can be introduced to theatre this way. Astounding and amazing.",
         "One of Sondheim's most shocking musicals. After seeing it, it's hard to believe this is the same man who's given us musicals like \"A Funny Thing Happened on the Way to the Forum\", \"A Little Night Music\" or \"Passion.\" Lansbury and Hearn are both brilliant in their roles. The music is magnificent. The sets are devilishly grim. Terry Hughes' direction is superb. Hearn won the Emmy for his performance. Lansbury had won a Tony Award for her Broadway performance with then Sweeney, Len Cariou, who also won the Tony under the direction of Harold Prince.",
         "I own a copy of this film and have always loved it. I comment here, however, because I saw the PBS presentation of a concert version of Sweeney Todd earlier this week. That production was put on by the San Francisco Opera and starred George Hearn and Patti LuPone. In the early '80s Hearn replaced Len Cariou as Sweeney (Cariou had won the Tony for his performance). I saw Hearn and Angela Lansbury (who also won the Tony for her performance as Mrs. Lovett) perform Sweeney on broadway. They must have made the film at about the time I saw the show. To this day, the most moving moment I can ever remember in the theatre occurred when Hearn sang \"These are my Friends.\" (\"These are my friends, see how they glisten.\" \"My arm is complete again!\") Hearn's performance in the San Francisco Opera production convinced me that he has lost nothing in the nearly twenty years since I first saw him perform the piece on Broadway and later in the film. What a talent! He is sympathetic, funny, and scary -- all at once; and he can sing, boy can he sing. All of this reminded me of how terrific the film is. Highly recommended. Ten out of ten.",
         "I saw \"Sweeney Todd\" on Broadway in 1980. It starred George Hearn and featured most of the other cast principals who appeared in the national touring company production, which was videotaped for TV in Los Angeles in 1982. Last night I watched the new DVD release of the Los Angeles production, although I have owned the videotape for many years. The production and the performances could have hardly been better but the original tape's age showed because both the audio and video quality are below modern standards, even on a newly pressed DVD. Nevertheless I still give it 10 out of 10 because of the greatness of the work and George Hearns's and Angella Lansbury's startlingly wonderful performances. Even today, my most memorable recollection from a live musical theater performance has to be Hearn's rendition of \"These are My Friends.\" \"You'll drip rubies,\" brrr."
      ],
      "genres": [
         "Musical",
         "Drama",
         "Thriller",
         "Horror"
      ],
      "productionCompanies": [
         "RKO Pictures",
         "Nederlander Organization, The"
      ],
      "summaries": [
         "It's 1846. Sweeney Todd and Anthony Hope, greeted only by a crazed beggar woman, sail into London, where Todd implies he has been before but not in quite some time. Todd heads to his old stomping grounds of Fleet Street, where he runs across the pie shop belonging to Mrs. Nellie Lovett, who professes to make the worst meat pies in London due to the high cost of meat. The upstairs of her building has sat empty since no one wants to rent a space that is considered haunted by its long ago tenant, barber Benjamin Barker who was falsely accused and ultimately sentenced by the sadistic Judge Turpin and who was shipped away to prison in Australia, leaving his wife Lucy and infant daughter Johanna alone in the world. Todd comes to an agreement with Mrs. Lovett to rent the upstairs of her building so that he can open his own barber shop. A series of incidents, including one with rival barber Senor Pirelli, make Todd change his focus slightly away from having a choice encounter with Judge Turpin and his equally sadistic henchman Beadle Bamford, which was one of the reasons he returned to London. Mrs. Lovett believes this change can only help her pie shop. Meanwhile, upon sighting each other, Anthony and Johanna fall in love at first sight. Johanna is now the ward of Judge Turpin, who has his own incompatible wants with her. Todd and Mrs. Lovett's collaboration as well as Anthony's pursuit of Johanna take marked turns with a number of revelations, most specifically about the crazed beggar woman and Mrs. Lovett's motivations.",
         "Benjamin Barker alias Sweeney Todd, returns to London after being deported to find out what happened to his wife and child at the hands of Judge Turpin. When he learns of their terrible fate he joins fortunes with Mrs. Nellie Lovett, the baker downstairs from his barbershop, and sets out to seek revenge.",
         "Times are hard in 1846 London and one must make do. Nellie Lovett adds something extra to the meat pies she peddles on Fleet Street. The secret ingredient: freshly murdered victims of her partner in crime, barber Sweeney Todd. Composer/lyricist Stephen Sondheim refashions a macabre tale into a musical masterwork in this dazzling performance of the 1979 Broadway hit originally staged by Harold Prince. In her Tony-winning role, Angela Lansbury plays Nellie. George Hearn turns his stage role of twisted Sweeney into an Emmy-winning triumph. The score coils around itself in every-tightening spirals. The lines ripple with black humor and madness. Enter Sweeney's tonsorial parlor. Attend the tale.",
         "Benjamin Barker, a skilled barber with a lovely wife who is pregnant with their child, suddenly loses everything. He is sent away on a trumped-up charge to prison at Botany Bay, by the nefarious Judge Turpin, who has designs on his wife. Fast-forward some years later, when Benjamin escapes with help from the steadfast friendly sailor Anthony Hope. Returning to London and taking the name Sweeney Todd, he seeks to find out what has happened to his family. Mrs. Nellie Lovett, the widow who ran the bakery downstairs from Barker's shop, (and always had a crush on him), tells him of their horrible fate, which sends Barker/Todd over the edge into madness, consumed by the thirst for revenge against the Judge. Ever-practical, with the possibility of murder and mayhem afoot, Mrs. Lovett thinks of a fiendishly clever way that they can both make a killing...literally. But she hasn't been forthcoming about everything, unbeknownst to her new partner, and the engines of Fate begin to grind and roar, bearing all the parties involved to an unexpected and devastating denouement...",
         "Sweeney Todd returns to London to uncover the past, along the way meeting Mrs. Lovett, and begins to start his life of crime."
      ],
      "budget": 0
   },
   "movielensId": 121241,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-09-12",
      "dvdReleaseDate": null,
      "directors": ["Terry Hughes"],
      "runtime": 140,
      "movieId": 121241,
      "title": "Sweeney Todd: The Demon Barber of Fleet Street",
      "mpaa": "",
      "actors": [
         "Angela Lansbury",
         "George Hearn",
         "Cris Groenendaal",
         "Edmund Lyndeck",
         "Calvin Remsberg"
      ],
      "imdbMovieId": "0084747",
      "originalTitle": "Sweeney Todd: The Demon Barber of Fleet Street",
      "genres": [
         "Horror",
         "Music",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["RXj-nQDmgnw"],
      "plotSummary": "Times are hard in 1846 London and one must make do. Nellie Lovett adds something extra to the meat pies she peddles on Fleet Street. The secret ingredient: freshly murdered victims of her partner in crime, barber Sweeney Todd. Composer/lyricist Stephen Sondheim refashions a macabre tale into a musical masterwork in this dazzling performance of the 1979 Broadway hit originally staged by Harold Prince. In her Tony-winning role, Angela Lansbury plays Nellie. George Hearn turns his stage role of twisted Sweeney into an Emmy-winning triumph. The score coils around itself in every-tightening spirals. The lines ripple with black humor and madness. Enter Sweeney's tonsorial parlor. Attend the tale.",
      "tmdbMovieId": 24745,
      "avgRating": 3.33929,
      "releaseYear": "1982",
      "numRatings": 28,
      "posterPath": "/loUOqb5fyEeGqfzmUiWiN1rLYG4.jpg"
   }
}