{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mickey mouse",
            "id": 3870
         },
         {
            "name": "minnie mouse",
            "id": 156966
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt2980764",
      "video": false,
      "title": "Get a Horse!",
      "recommendations": [
         76346,
         105325,
         245003,
         197725,
         38580,
         88212,
         352812,
         200481,
         293299,
         13925,
         53387,
         88766,
         142563,
         84582,
         144490,
         129863,
         87200,
         146784,
         13061,
         42510
      ],
      "backdrop_path": "/pHKhvWkI65I579uXvIU2TcIxIRe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mickey Mouse (archive sound)",
               "gender": 2,
               "credit_id": "52fe4e35c3a36847f8283e4f",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Minnie Mouse (archive sound)",
               "gender": 1,
               "credit_id": "52fe4e35c3a36847f8283e53",
               "name": "Marcellite Garner",
               "profile_path": "/6UconXndap6E5Fj0kJYXPLL2Zvx.jpg",
               "id": 232415,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Peg-Leg Pete (archive sound)",
               "gender": 2,
               "credit_id": "52fe4e35c3a36847f8283e57",
               "name": "Billy Bletcher",
               "profile_path": "/wVMoPHj7zTswZJx96VqY1yWgN8j.jpg",
               "id": 31771,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Peg-Leg Pete (voice)",
               "gender": 2,
               "credit_id": "52fe4e35c3a36847f8283e5b",
               "name": "Will Ryan",
               "profile_path": "/uY0oWjp7dxBEh03LpMBqApaswn.jpg",
               "id": 40352,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Minnie Mouse (voice)",
               "gender": 1,
               "credit_id": "52fe4e35c3a36847f8283e5f",
               "name": "Russi Taylor",
               "profile_path": "/3rfnBDgLRc7CjoIw9bGRBlDXxMf.jpg",
               "id": 6035,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Pete's Car Horn (voice)",
               "gender": 2,
               "credit_id": "58d04d2692514129ed000a50",
               "name": "Raymond S. Persi",
               "profile_path": "/xvR6YZ6006VWM8BywRHh4nhpt3Z.jpg",
               "id": 1223658,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Additional Voices (voice)",
               "gender": 2,
               "credit_id": "58d04d3c92514129e7000a18",
               "name": "Bob Bergen",
               "profile_path": "/8MRcVeLPBvzr368tOhvsLz4BDhl.jpg",
               "id": 78317,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e35c3a36847f8283e65",
               "name": "Lauren MacMullan",
               "profile_path": "/fq8tIqjFgnwKbTozQBbRttg6nw3.jpg",
               "id": 1214800,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4e35c3a36847f8283e6b",
               "name": "John Lasseter",
               "profile_path": "/7EdqiNbr4FRjIhKHyPPdFfEEEFG.jpg",
               "id": 7879,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5518e5e79251416f0a00684a",
               "name": "Anthony DeRosa",
               "profile_path": "/9nCAPM8RO3tXyHujcTbJmpgthkI.jpg",
               "id": 1447376,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "587c227bc3a368426e008616",
               "name": "Dorothy McKim",
               "profile_path": "/8I2rddjZYbSrtFSzzpl3cTpd4xi.jpg",
               "id": 16844,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.736965,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 234567,
      "vote_count": 99,
      "budget": 0,
      "overview": "Mickey, Minnie, Horace Horsecollar, and Clarabelle Cow go on a musical wagon ride until Peg-Leg Pete tries to run them off the road.",
      "similar": [
         21385,
         66819,
         10555,
         3933,
         109445,
         31135,
         326359,
         66872,
         533,
         10340,
         10144,
         10193,
         10895,
         9479,
         12230,
         808,
         812,
         10882,
         10530,
         41513
      ],
      "original_title": "Get a Horse!",
      "runtime": 6,
      "poster_path": "/gJD2wDa5gGUTQITW9ZfjckxSBEs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": "/tVPmo07IHhBs4HuilrcV0yujsZ9.png",
            "name": "Walt Disney Animation Studios",
            "id": 6125,
            "origin_country": "US"
         }
      ],
      "release_date": "2013-11-27",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lauren MacMullan"],
      "runtime": 6,
      "synopsis": null,
      "writers": [
         "Lauren MacMullan",
         "Paul Briggs"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2980764/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNDIzMDI3NF5BMl5BanBnXkFtZTcwODE4OTA3OQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Walt Disney, Marcellite Garner, Russi Taylor | See full cast and crew »"],
      "reviews": [
         "When I first heard of this project, I couldn't help but instantly get hyped up. And when I found out the twist, that of Mickey stepping out of his black-and-white world into a color 3D realm, I got even more tense waiting to see it. When I did, I was pleasantly surprised at how the idea was executed. What I got was a hilarious, creative animated short that says that Disney's still got it. The jokes that poke fun at modern society, like Horace walking up wearing a Captain America shirt while using a smartphone and eating popcorn and Milk Duds, are pure gold and the meta-related humor is used in very funny ways to humiliate Pete. The animation on both sides of the screen are fantastic and the best way to see it is with 3D glasses, which gives the short a sense of depth. All in all, this is a must-see cartoon, great for fans of Disney, animation geeks and the general public.",
         "When the film begins, you don't think it's a CGI or 3-D film. It looks like a Mickey Mouse film circa 1929--complete with scratchy film stock! However, when the baddie, Pete, tosses Mickey THROUGH the screen and he becomes a full-color 3-D character, you know you are in for something unique! What's next? See the film--it's well worth it. This is an interesting case where it turns out that I liked the short more than the feature film it accompanied. In the case of \"Get a Horse!\", it was shown before the Disney CGI film \"Frozen\"--a moderately enjoyable full-length film. However, the short was indeed magical and appeared to be a real work of love. I say this because the folks who made the film did a great job of trying to replicate the exact look and sound of the very early Mickey Mouse cartoons--something that is no small feat! Unlike most 3-D films I've seen, I think it's very important you try to see \"Get a Horse!\" in 3-D. This is because rarely has another 3-D film tried so hard to incorporate this sort of camera-work into the film (another exception being the underrated \"How to Train Your Dragon\"). Most 3-D films, to me, seem as if they just tacked on the 3-D at the end and didn't plan for the use of 3-D all along (this is especially true of the live action 3-D films). Overall, a wonderful little film that no doubt will get nominated for Best Animated Short for the Oscars. If it doesn't, I'll be incredibly surprised as the film isn't just fun but an amazing film technically. UPDATE: I just saw this short again as part of the Oscar-nominated Animated Shorts show in selected theaters. Although it was NOT shown in 3-D this time, it didn't really seem to matter. Why I am doing this update is that in comparison to all the other nominees, \"Get a Horse!\" is light-years better. And, because it's so far superior I am changing my original score from 9 to 10. What a wonderful film and I like the rather playful and fun nature of the short.",
         "A blast from the past as Mickey Mouse and friends deal with the lascivious Peg-Leg Pete in this respectful and loving tribute to Walt Disney's early Mickey Mouse cartoons. It's done with a delightful mix of hand-drawn black & white animation in the style of those early cartoons and modern CGI color animation, still holding true to the original models of the characters. I love that they also used some archival audio from Walt, Billy Bletcher, and Marcellite Garner. Frankly, it's the best Mickey short in decades. I've always enjoyed the first Mickey cartoons a lot. The character has long since become the poster child for corny but this short hearkens back to a time when he was fresh, playful, and funny. Kudos to Lauren MacMullan and co. for this creative and clever short that mixes the present and the past in a way that should bring smiles to the faces of young and old alike.",
         "I seen this in the cinemas before Frozen(Disney's highest grossing animated movie of all time btw) was shown and its also on the DVD as well so if you wanna see it be sure and check it out. The short is about Mickey and the gang who are in black and white in a cinema room and Pete is after Mickey. Of course the short then gets turned into CGI form and switches from CGI to Black & White once Pete is after Mickey's friends and they too end up in CGI form as well. Bottom line this was a brilliant short as it has the man himself Walt Disney as the voice of Mickey Mouse and all the old school actors as the other charcthers. What I like about this is like I said the blend of Black & White and CGI animation thrown into the mix. The humor was great,the concept was great overall I really enjoyed this short. 7/10",
         "As a huge fan of classic Disney and as someone who likes a lot of their modern stuff(though there have been a fair share of misfires), Get a Horse was really delightful and while Frozen is a great film and one of their best since the Renaissance this short that preceded it was even better. The animation mixes black and white classic animation and colour CGI, with the crisp and fluid black and white and the colourful and vibrant CGI that moves more naturally than that on Mickey Mouse Clubhouse it not only looks great but it is very cleverly used as well. The soundtrack is lively and with beautiful orchestration and themes that you'll recognise immediately. The sound effects are well-incorporated, some from the very early stuff that are preserved quite well, and are not misplaced or bizarre-sounding. Get a Horse has humorous dialogue and a story that is from start-to-finish boundless fun and energy and it's as clever as the animation too. Just as good are the gags, they're reminiscent of classic Disney but there is also a very modern Disney vibe, so it will appeal to anybody, child and adult, regardless of where abouts they were born. All the characters engage, with a delicious villain in Pete and Mickey who has the kindly quality he has now and also the heroic character in the old classic Disney. Minnie is sweet as well, and it was great to see Horace and Clarabelle, two characters often neglected(or they were for a long time before House of Mouse came on the scene). The voices are fine too, though it was initially a tad odd hearing (modern) Pete voiced by someone other than Jim Cummings, like the sound the original voices are well-preserved. All in all, delightful and recommended without any hint of hesitation. 10/10 Bethany Cox",
         "When me and my movie theatre-working friend went to watch Frozen at the place he works at, this cartoon short was attached to it. Begun in the old school black-and-white drawn phase with the original screen dimensions, when Mickey is thrown off the screen, he becomes a 3-D computer-generated color character filling the rest of the current outlines of the frame. And with that, the real fun begins as many tricks suddenly become possible with various ways of turning the screen-or frames-whichever way one wants it to go! I also was surprised that Walt Disney himself was credited with the voice of his famous mouse before finding out here that the studio not only used vintage tracks of his from previous cartoons but also those of Marcellite Garner for Minnie and Billy Bletcher for Peg-Leg Pete. I found most of the thing quite creatively funny so on that note, I highly recommend Get a Horse!",
         "I have just come from a showing of Disney's FROZEN, for which this was a preceding short. However, from my viewpoint, I just saw this with a typical Disney Princess movie added on, because this is a fine little movie while FROZEN is just another Princess movie. Mickey, Minnie and the rest of the crew from 1928 go on a hay ride, where they meet Pegleg Pete... and Pete, fighting for Minnie, throws Mickey through the movie screen, where he is the modern Mickey, with red pants and three dimensions. The inevitable donnybrook extends through both media and even beyond, with references to intermediate Mickeys, until the point of the movie, the subtext, in between the situations and gags, became clear to me: Mickey remains Mickey, whether in the 1928 silent version, before he learned to whistle, or the modern, three-dimensional, full color version. With all the commercial issues of modern Disney movies, with all the brand extensions and can-we-make-sequels and how can we milk this idea for another ten million dollars, there comes a point at which some creative individual says \"I have an idea\". At that stage it's not commercial, it's not a multi-media franchise, it's just an idea. If it's a good idea, then the money men, essentially non-creative individuals (I should know. That's what I do for a living) will make enough money on it to pay the people with ideas and give them the chance to have more ideas. And the best idea they can have is \"Let's do something the audience will enjoy.\" I enjoyed this one very, very much. I think you will too. Even if, or perhaps especially if you don't worry about subtext.",
         "When I first heard there would be a new Mickey cartoon, I was extremely hyped up and what really got me into it was the fact that it would feature Uncle Walt's archival recordings as Mickey Mouse, and it would mix hand-drawn animation with CGI. When I finally saw it, I was very pleased with the outcome. The comedy is genuine with the imaginative slapstick we loved in the classic Mickey shorts, no gross-out gags whatsoever. It even includes a few pop culture visual jokes like the Apple ringtone and Horace's Captain America T- shirt(usually, it would ruin animated adaptations of the beloved classics *AHEM* The Lorax, but here it worked cleverly). The visuals are also groundbreaking, it is fantastic what they do with combining two different animation mediums. Overall, Get A Horse! was an adorable, hilarious, and faithful short that celebrates the history of the mouse we all know and love in so many inventive ways possible.",
         "A small, square, black and white image introduces us to 1930 Mickey Mouse, out for a day's cart ride with his friends until Pegleg Pete drives up behind them in his car, intent on spoiling their fun. Get A Horse! is the short film which accompanies Disney's 2013 animated feature Frozen, and is reason in itself to go to the cinema. Because this is not an original 1930s short although, when it starts, you would swear that it was. The soundtrack is partially made up of extracts from 1930s shorts (Walt Disney voices Mickey once more!), and the style is absolutely authentic: not only is the look of the thing spot on, the film is also full of sight gags which would have been totally at home in a short from that period. And then widescreen, colour and 3D are introduced, but essentially as further sight gags. These technical anachronisms are used creatively to enhance this wonderful little film and, in so doing, they show Disney Animation Studios once more exercising the creativity for which they were once renowned. This is one of the best uses of 3D I have seen at the cinema. This is an enormously enjoyable short.",
         "'GET A HORSE!': Three Stars (Out of Five) A Disney animated short film that debuted in theaters before the blockbuster 'FROZEN'. The movie is 6 minutes long and is both computer animated and hand-drawn. It's also in black-and-white and color and was released in both 3D and regular 2D versions (like the movie it plays with). It was directed by Lauren MacMullan and features archive voice recordings of Walt Disney as Mickey Mouse! It's the first Mickey Mouse cartoon since 1995's 'RUNAWAY BRAIN' and tells the story of Mickey going on a wagon ride with his friends (Minnie, Horace Horsecollar, and Clarabelle Cow) when the antagonist Peg-Leg Pete attacks them. Mickey and Horace are thrown out of the movie world (and into the theater) where they fight Peg-Leg by flipping the theater screen (and rotating gravity inside the movie). The film is amusing and fun and very reminiscent of classic Mickey Mouse cartoons. Should be nostalgic for fans of the iconic Disney character and entertaining for new (younger) viewers as well! Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=PAefz9rzS5w"
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy"
      ],
      "productionCompanies": ["Walt Disney Animation Studios"],
      "summaries": ["Mickey, Minnie, Horace Horsecollar, and Clarabelle Cow go on a musical wagon ride until Peg-Leg Pete tries to run them off the road."],
      "budget": 0
   },
   "movielensId": 121366,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-11-27",
      "dvdReleaseDate": null,
      "directors": ["Lauren MacMullan"],
      "runtime": 6,
      "movieId": 121366,
      "title": "Get a Horse!",
      "mpaa": "",
      "actors": [
         "Walt Disney",
         "Marcellite Garner",
         "Billy Bletcher",
         "Will Ryan",
         "Russi Taylor",
         "Raymond S. Persi",
         "Bob Bergen"
      ],
      "imdbMovieId": "2980764",
      "originalTitle": "Get a Horse!",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["hiTwhXfgHPc"],
      "plotSummary": "Mickey, Minnie, Horace Horsecollar, and Clarabelle Cow go on a musical wagon ride until Peg-Leg Pete tries to run them off the road.",
      "tmdbMovieId": 234567,
      "avgRating": 3.1375,
      "releaseYear": "2013",
      "numRatings": 40,
      "posterPath": "/gJD2wDa5gGUTQITW9ZfjckxSBEs.jpg"
   }
}