{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0104521",
      "video": false,
      "title": "Into the Sun",
      "recommendations": [147882],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tom Slade",
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6963",
               "name": "Anthony Michael Hall",
               "profile_path": "/eQnkUzHVrO69bQ08W82Qa9idJxp.jpg",
               "id": 1904,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Capt. Paul Watkins",
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e6967",
               "name": "Michael Paré",
               "profile_path": "/g1cVLWWAgl3J1nNFhg67qXs8GUT.jpg",
               "id": 60650,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Maj. Goode",
               "gender": 0,
               "credit_id": "52fe4d64c3a368484e1e696b",
               "name": "Deborah Moore",
               "profile_path": null,
               "id": 201630,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mitchell Burton",
               "gender": 2,
               "credit_id": "57ea499cc3a3687ffd007ff4",
               "name": "Terry Kiser",
               "profile_path": "/lGQSeLgWeLjFGz2gOMWYNlPOM2f.jpg",
               "id": 55267,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lt. DeCarlo",
               "gender": 2,
               "credit_id": "57ea49c4c3a3687ed9000e85",
               "name": "Brian Haley",
               "profile_path": "/oGaZ2sa0nHJ95vW7nN2TgjeeXGM.jpg",
               "id": 10138,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lt. Wolf",
               "gender": 0,
               "credit_id": "57ea49d992514136d8000fe6",
               "name": "Michael St. Gerard",
               "profile_path": null,
               "id": 95090,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dragon",
               "gender": 2,
               "credit_id": "57ea49eb9251413748000e54",
               "name": "Linden Ashby",
               "profile_path": "/thzvdpk4TV5hvmKxGrCKGZPrRkw.jpg",
               "id": 57251,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Female Sergeant",
               "gender": 1,
               "credit_id": "57ea4a149251413748000e6c",
               "name": "Melissa Moore",
               "profile_path": "/vSaCQt6RePbjFCV4MHGAQUlIOBp.jpg",
               "id": 99067,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Lt. Col. Reynolds",
               "gender": 2,
               "credit_id": "57ea4a23c3a3687f17000ee6",
               "name": "Hunter von Leer",
               "profile_path": "/qhfyiLZkfAiuTzO8p7T6B6lzBoP.jpg",
               "id": 119855,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d64c3a368484e1e695f",
               "name": "Fritz Kiersch",
               "profile_path": null,
               "id": 66987,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5aa523939251412793020354",
               "name": "Tony R. Medina",
               "profile_path": null,
               "id": 1995913,
               "department": "Crew",
               "job": "Prop Maker"
            }
         ]
      },
      "genres": [
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 1.150575,
      "production_countries": [],
      "id": 209369,
      "vote_count": 6,
      "budget": 0,
      "overview": "Paul Watkins (Michael Paré) is an American pilot stationed in the Middle East, who is taken away from his normal duties of protecting the skies to show an actor everything he needs to know about being a pilot in the Air Force. The actor, Tom Slade (Anthony Michael Hall), is about to start filming an Air Force movie and wants to \"get the feeling\" for the part. When Watkins takes Slade for a ride in an F-16 fighter, some other American jets are attacked and the pair comes to the rescue. However, it does not go according to the plan.",
      "similar": [],
      "original_title": "Into the Sun",
      "runtime": 101,
      "poster_path": "/wJ8ab8RnvPBTXvdR1LA6Ef2MBkR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1992-01-01",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Fritz Kiersch"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "John Brancato",
         "Michael Ferris"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104521/",
      "coverLink": null,
      "actors": [
         "Anthony Michael Hall",
         "Michael Paré",
         "Deborah Moore"
      ],
      "reviews": [
         "Anthony Michael Hall plays an actor who gets into more than he bargained when he tries to learn how to fly fighter planes from Michael Pare for a new role. While the movie is predictable and not all that great it does have a few good comedic moments and does hold your interest..good lighthearted fare on a scale of one to ten.. a 6",
         "I thought this was better than Top Gun. One of Michael Pare's best performances. Although he gets a lot of flack for his Brooklyn accent, I thought he had a great comedic rapport with Anthony Michael Hall. And yes, if I was pilot, I would want a guy like Shotgun on my side. Someone complained that the script was horribly written. I'm sure there were better, but somehow the actors managed to make the story interesting. The villain was well played and in my opinion, was not stereotypically evil. Rather, he was someone who was opportunistic when he was previously denied. All in all, Into the Sun definitely had me in my seat. I highly recommend it.",
         "The way I feel it, \"Into the Sun\" consists of two partly separated parts. The first part is a drama/comedy-part, where we are introduced to the characters and where the plot starts. The unlucky Captain Paul Watkins has too take care of a rather self-loving actor called Tom Slade, who's going to learn about the life of military pilots. Even though this part of the movie is a bit entertaining, it's not what you're waiting for in a movie like this. Luckily, lots of action kicks in in the second part of the movie. That was what I had been waiting for. The action is surprisingly good for a movie like this, even if it's standard B-action with lots of explosions and evil bad guys getting asskicked.",
         "I rated this a \"9\" because my criteria in judging a movie are adjusted to its genre; and as an action-comedy I felt it approached a Harrison Ford type comedy, which I rate as \"10\" Acting was realistic, photography great, and we even got a bid of sermonizing (how a fighter's discipline works against his ability to be confidential about his feelings). Deborah Maria Moore was a nice bit of frosting on the cake. If you're not jaded as a movie critic, and like light comedy and air force action see this one!",
         "This is an excellent film with two totally charismatic leading actors both exuding personality. The interplay between them is fascinating as it develops. The two characters are totally different and it is interesting to notice what common ground circumstances can cause between two such diverse personalities. The action sequences are exciting and realistic and the prison scenes duly horrific. It is good to see a film not being afraid to illustrate what has become an all-too-familiar real-life situation. The only unnecessary part of the film is the romance which does not, fortunately, spoil the film too much, but it does remain surplus to requirements and adds nothing of value to the movie.",
         "In the early 1990s with movies like Hot Shots parodying Top Gun and The Hard Way parodying actors doing the method, Into the Sun is cheapo film aimed more for the video market, it uses out takes from the Iron Eagle film. Paul Watkins (Michael Paré) is an American pilot somewhere in the Mediterranean who has to show action star Tom Slade (Anthony Michael Hall) how it is to be like a fighter pilot in order to prepare for his next film role. Watkins is put out when Slade hits on his on/off girl at the base but is surprised to discover that Slade is very likable and competent. In fact there is hardly anything he is not good at and manages to do some simulation without any problems. When Watkins takes Slade for a ride in a F-15 fighter they are shot down in the desert and must escape their captors. The first half starts brightly as it rips off Top Gun, Hall is likable as Slade who plays the very competent actor when it would had been easier to make him an ego obsessed actor who is almost useless at everything for easy laughs. Pare is more laid back and subtle here, then again he is reserved for the action/adventure later on. I was not sure whether the latter part of the story when the are hunted by various Arab factions quiet worked and was an uneasy shift in tone from the earlier part of the film. The film looked cheap in places, but a watchable B movie.",
         "loved it because i just love watching Hall act, he's absolutely amazing and natural. plot wise, even though i'm not an action fan, i found it interesting. of course there is cinematic substitutions and allowances, it's not going to be a spot on representation of the army or war but it still managed to capture your interest. if nothing else you'll keep watching to see what Hall's character does or says. it can get a little confusing at times but i guess that just might have been my problem at not fully understanding where the movie was set. a great watch, i don't know why it didn't do better in the box office. AMH is amazing as usual, very natural actor. I am going through all of his films and am completely captivated by him. just watch the film, it really is great.",
         "I rented this movie only because I like Michael Pare, and the box looked nice, and (though I could've easily found something better) it wasn't bad. Anthony Michael Hall (Just as his career was going going down the drain) and Michael Pare are well cast for their roles and the sets were well done. Hall plays a successful Hollywood megastar sent to an air force base to research his upcoming role. Pare is a pilot assigned to show him around and teach him the ropes. Pare instantly dislikes Hall, but can't back out. The two get caught up in the middle of a battle and are forced to crash land in the desert. They are then taken hostage and the movie keeps going, and going , and going. Though it was short, it felt like it was three hours, and going nowhere. + (GOOD THINGS) 1.) Casting of Hall and Pare 2.) Aerial shots 3.) The sets (BAD THINGS) 1.) The bad guys 2.) The length 3.) The pacing TOTAL: 5.5/10",
         "Well this flick is just that a flick. The real stars are the f-16 and some nice air to air footage. There are so many technical errors it's unreal. The whole premise for the shoot down I would say is inspired by the old 1980's airspace dispute with Lybia. There is no way a number of things that happen in this movie could or would happen. Because if it did Dr. Strangelove would have happened and we would be all dead. 1) No way would the USAF allow a civilian a flight in a Hot Zone area as they did just for a movie and PR. That could and would have been done in the US, just to dumb to be believed. 2) I firmly believe that NO USAF pilot would take a civilian into a combat area especially when ordered not to. The writers screwed up big time on that one would have made more sense to have them jumped over the Med. in international waters than a pilot running to the fight. 3) In the dog fight scenes you get great shots of F-16s but they are attacked by a different aircraft with each pass, from a Viggen, to a Mirage, to a A-4, gee unify how the enemy pilots can change aircraft in midair during a dogfight from 3 different countries. 4) Gee Libyan soldiers armed with M-16s another error. 5) The mercenary American pilot, gee a fighter pilot who needs corrected glasses, don't think so. especially thin dainty framed ones that could break apart in high G maneuvers of a dogfight. The script is bearly passable. The only scene missing is the court martial and law suits. John Waynes \"Flying Tigers\" with their lawnmower powered fake P-40s and campy script still beats this flick for overall enjoyment. The only reason I have kept this flick in my collection is for the aerial shots of the planes and they are really the stars of the film.",
         "Script is awful, screenplay ain't good... actors... well, everyone of us can scream and yell. And if you DO a movie and say that it is inspired by top films, then do it right. It's like early 80's when screenplay was lots and lots of explosions but non of realism. It's like when Watkins said that you feel a negative G, but in real world, in that situation, there you WILL feel positive G. Secondly, it made me wonder, how could one Arab country, enemy of US, use M16 in their forces. Unlogical. Thirdly, animated explosions of incoming missile and exploding planes. Well, if missile is shot behind you, why i see a incoming missile, not coming in behind, it's coming from the side. And right, combat aircraft, whatsoever, usually doesn't have bulletproof cockpit... In conclusion, if not to be so picky, if you want to see a movie that has lot of explosions and don't care that it has so many special effects that ignores rules of universe, then it may be a right movie for you. But if you want to see something realistic, then I think that it is a waste of time.",
         "This is a shockingly bad 'action adventure' with an almost entirely unknown cast, ludicrously conceived plot, and some of the worst ham acting I've ever seen. It starts badly, the middle part is very poor indeed, and it really tails off towards the end. 'Into the sun' seems to flit between attempting 'Top Gun' homage and 'Private Benjamin' military satire, although to mention it in the same breath as these movies is to lavish praise upon it and I really wouldn't want to do that. Willing suspension of disbelief aside, the plot is just too implausible to be either funny enough to qualify as comedy, or realistic and exciting enough to be an action adventure. Mixed together with some truly mediocre acting and a handful of stock footage (no doubt purchased cheaply from the US air force) this makes for some pretty tiresome viewing. If I had to choose between watching this film again and eating a raw potato, I'd go for the potato - It'd be more fun and take less time.",
         "The short version: \"Story about a Hollywood actor and the relationship he forms with a top Air Force pilot in preparing for a role.\" Indeed. Competing protagonists - looking like models - in sexy uniforms, plus double entendres in every second line? Reminds you of something? What might be unintentional in Top Gun, is almost certainly not so here. Or is it just the ambiguousness of the early 90's? It's actually lampshaded by Tom Slade (Hall) when he asks Shotgun (Paré) what's with all the entendres and penis talk at the military base (actual wording). Add a bit of unrealistic 90's action - things blow up very easily - and you know what you're in for. The villain further ups the ham factor. Just watch it with your slash goggles on, and you'll have a great time with the cheesy lines, the manly groping, bonding, power struggle and abundance of subtext. Not to be taken seriously, but good fun. \"Move your damn leg!\" \"Move it!!!\" \"Is that it?!\" \"Ow.\" Quotes: Shotgun.",
         "This film doesn't appear to want it's own identity. Instead it steals concepts from other, more successful films. The main theme is the turbulent relationship between Michael Pares character and Anthony Michael Halls which then evolves predictably into some sort of twisted buddy film. If you are interested in this sort of comedy, see The Hard Way, which has a similar plot but is better paced, better scripted and better acted by James Woods and Michael J Fox.",
         "An air force pilot has to show a hotshot actor, who is preparing for an upcoming role, the ropes about life in the military. The former dislikes the latter intensely, but has to tolerate him, especially after they are shot down in hostile enemy territory. The main highlights of this film are the aerial shots and the casting. See it if it grabs your attention. ** 1/2 out of ****"
      ],
      "genres": [
         "Action",
         "Comedy"
      ],
      "productionCompanies": ["Trimark Pictures"],
      "summaries": [
         "Pilot Paul Watkins is stationed in the Mediterranean area to fly patrol and to protect the air space from the expansion tendencies of an Arabian country. But then he's withdrawn from the patrol and gets the order to lead the actor Tom Slade around on their base and explain him everything: The popular star wants to get \"the feeling\" for his next movie. Paul is less than thrilled with this task, although he's impressed by Slade's talent. During a sample flight they get right into an air combat and into the enemy's land. Now they can show who's more of a fighter...",
         "A fighter pilot is reluctantly paired with a Hollywood actor who's researching a role, but are then forced to team up for real after being shot down and thrust into combat."
      ],
      "budget": 0
   },
   "movielensId": 121380,
   "movielens": {
      "languages": [""],
      "releaseDate": "1992-01-01",
      "dvdReleaseDate": null,
      "directors": ["Fritz Kiersch"],
      "runtime": 101,
      "movieId": 121380,
      "title": "Into the Sun",
      "mpaa": "",
      "actors": [
         "Anthony Michael Hall",
         "Michael Paré",
         "Deborah Moore",
         "Terry Kiser",
         "Brian Haley",
         "Michael St. Gerard",
         "Linden Ashby",
         "Melissa Moore",
         "Hunter von Leer"
      ],
      "imdbMovieId": "0104521",
      "originalTitle": "Into the Sun",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Paul Watkins (Michael Paré) is an American pilot stationed in the Middle East, who is taken away from his normal duties of protecting the skies to show an actor everything he needs to know about being a pilot in the Air Force. The actor, Tom Slade (Anthony Michael Hall), is about to start filming an Air Force movie and wants to \"get the feeling\" for the part. When Watkins takes Slade for a ride in an F-16 fighter, some other American jets are attacked and the pair comes to the rescue. However, it does not go according to the plan.",
      "tmdbMovieId": 209369,
      "avgRating": 2.5,
      "releaseYear": "1992",
      "numRatings": 1,
      "posterPath": "/wJ8ab8RnvPBTXvdR1LA6Ef2MBkR.jpg"
   }
}