{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "dubai",
            "id": 9145
         },
         {
            "name": "thief",
            "id": 9727
         },
         {
            "name": "pole dancer",
            "id": 9834
         },
         {
            "name": "heist",
            "id": 10051
         },
         {
            "name": "con artist",
            "id": 10453
         },
         {
            "name": "bollywood",
            "id": 10540
         },
         {
            "name": "diamond heist",
            "id": 40903
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "bar dancer",
            "id": 222053
         }
      ],
      "imdb_id": "tt2461132",
      "video": false,
      "title": "Happy New Year",
      "recommendations": [
         205022,
         283589,
         44977,
         240614,
         14072,
         280690,
         24827,
         8079,
         73582,
         41109,
         185008,
         276935,
         259720,
         273886,
         85985,
         84533,
         21297,
         285803,
         44425,
         79990
      ],
      "backdrop_path": "/7qt9TOS8UNRiVlAvs5kkSPMUeRf.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "TheSRKian",
         "id": "547c80fe9251412d7f002ebb",
         "content": "**Happy New Year Movie Review**\r\n\r\nStarring Shah Rukh Khan, Deepika Padukone, Abhishek Bachchan, BomanGrover, Sonu Sood & Vivaan Shah in lead, _Happy New Year_ is made to tickle your funny bones. Film has been directed by Farah Khan. Though she has only 4 films in her director career,SRK starred in 3 of them and resu  is blockbuster every time! Even HNY broke all the first weekend record of Dhoom 3 and crossed 100 crore in its first weekend which is a big feat for a Bollywood movie. \r\n\r\nBack to the film, this film is about revenge of Charlie, Charlie's father had been killed by Charan Grover played by Jackie Shroff! So made a masterplan of robbing diamonds from the \"Shalimar Vault\" which can be open only by Charan Grover and his son Vicky Grover's finger prints. But to enter the Vault they must participate a dance championship called WDC (World Dance Championship). Why they need to participastanow Charlie's team nominated for the WDC, can they rob the diamonds etc, you will get all the answers by watching the movie! But should you watch this 3 hour long heist thriller? Yes!! Because inspite of the long runtime, film never let you feel bore. Film is funny & first of its kind! Its amazing how a heist film can be so hilarious. First part is funny and has scenes to tickle your funny bones, second half is brilliant! Heist sequence too was superb! Acting wise Shah Rukh Khan stands out to be the best. The role was a cakewalk for an actor of his caliber. Others too did well job, especially Abhishek Bachchan as Nandu Bhide (he had double role) was damn funny. SRK-Deepika's chemistry sizzles once again. \r\n\r\nOverall a nice and rocking entertainer! Just go with a free & fresh mind and have some \"ROFL!\" My ratings would be 7/10.",
         "url": "https://www.themoviedb.org/review/547c80fe9251412d7f002ebb"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "53a1ceffc3a368417a000345",
               "name": "Shah Rukh Khan",
               "profile_path": "/unfoh4zAiPvnQsHeE2CUgpNOX9u.jpg",
               "id": 35742,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Mohini",
               "gender": 1,
               "credit_id": "53a1cf08c3a368418600034b",
               "name": "Deepika Padukone",
               "profile_path": "/kBGmOExBHwbVZDmGegGx3qZWw89.jpg",
               "id": 53975,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Nandu Bhide",
               "gender": 0,
               "credit_id": "53a1cf12c3a3684180000372",
               "name": "Abhishek Bachchan",
               "profile_path": "/1zKoM8rIRqs3vmO8bRIWhBeiurb.jpg",
               "id": 35793,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Charan Groover",
               "gender": 2,
               "credit_id": "53a1cf1fc3a3684183000396",
               "name": "Jackie Shroff",
               "profile_path": "/nbKG1vfnWdSauxBtzzoctuJEpHe.jpg",
               "id": 86014,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Tammy Irani",
               "gender": 2,
               "credit_id": "53a1cf28c3a368417d000385",
               "name": "Boman Irani",
               "profile_path": "/ybhFam8adUpWz3Re49T8uDm8DcT.jpg",
               "id": 35779,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Jag",
               "gender": 2,
               "credit_id": "53a1cf2fc3a3684180000376",
               "name": "Sonu Sood",
               "profile_path": "/yzrNCCx8qvylZeT0oMoX3wrCT4q.jpg",
               "id": 95750,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Rohan",
               "gender": 0,
               "credit_id": "5469942222136e284f00061a",
               "name": "Vivaan Shah",
               "profile_path": "/2ol6218jptD2rUA0wtUtJNBHtT9.jpg",
               "id": 1386199,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Manohar Sharma",
               "gender": 2,
               "credit_id": "5469947022136e68d8002442",
               "name": "Anupam Kher",
               "profile_path": "/kgU5Ap1Kf9RnicB5DMcXEZqed2f.jpg",
               "id": 6217,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "53a1cfdac3a3684189000383",
               "name": "Farah Khan",
               "profile_path": "/l0jw1cr6WvpjF2grO1JBqUOBcEx.jpg",
               "id": 8311,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53a1cfedc3a368417d00038e",
               "name": "Gauri Khan",
               "profile_path": "/p2Bvql0WN7ekTKBx8vvhmY6R70C.jpg",
               "id": 53973,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "53a1d018c3a3684174000374",
               "name": "Sandeep Chowta",
               "profile_path": "/8PKl7khoY2jxpWpLWQ1FBI9n3MY.jpg",
               "id": 37240,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "58ad2203c3a3682fa00025c8",
               "name": "Althea Kaushal",
               "profile_path": null,
               "id": 1763477,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58ad2220c3a3682fde0024e1",
               "name": "Mayur Puri",
               "profile_path": "/q2HnuucbMr0f9MWKfFMvPgEkzAv.jpg",
               "id": 1457344,
               "department": "Writing",
               "job": "Dialogue"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 5.776227,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 277432,
      "vote_count": 86,
      "budget": 25000000,
      "overview": "Six would-be thieves enter a prestigious dance competition as a cover for their larger goal of pulling off a major heist",
      "similar": [
         9762,
         500,
         949,
         35056,
         298,
         43923,
         209247,
         1844,
         2771,
         3134,
         340485,
         63710,
         8079,
         27586,
         10623,
         248774,
         11966,
         11001,
         359412,
         11236
      ],
      "original_title": "हैप्पी न्यू ईयर",
      "runtime": 180,
      "poster_path": "/1wHbuMUjjfoGrTo7YMNjhkgWksg.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Red Chillies Entertainment",
            "id": 2343,
            "origin_country": ""
         },
         {
            "logo_path": "/5WSkzUe6OiyKlpX2hJUghLlWkiU.png",
            "name": "Yash Raj Films",
            "id": 1569,
            "origin_country": "IN"
         }
      ],
      "release_date": "2014-10-23",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Farah Khan"],
      "runtime": 180,
      "synopsis": null,
      "writers": [
         "Althea Kaushal",
         "Farah Khan"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt2461132/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5Njg4NjA1MV5BMl5BanBnXkFtZTgwOTMzOTk0MjE@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Shah Rukh Khan, Deepika Padukone, Abhishek Bachchan | See full cast and crew »"],
      "reviews": [
         "Once again farah khan have failed to entertain, Even Tees Maar Khan was better than this. Basically, the philosophy of the film is vague and in line of the escapist Bollywood cinema. And, we are not even talking about logic yet. A brainless comedy which fails to entertain. Don't go if you value your money and time, but once again i am giving advice to people who loves movies like kick, chennai express, jab tak hai jaan etc and many other craps released throughout the year.Happy New Year is a muddled mess which has its own warm moments but as a package fails to work. Three hours of Shah Rukh flaunting his abs and swagger gets too much to take minus a strong storyline. Farah Khan has redeemed Tees Maar Khan but Happy New Year is her most mediocre work. I am going with 0.5/10. It's a magnum opus which is pretty much hollow from within and remains an all frills, no thrills show.",
         "Honestly after watching this movie, one thing that struck my mind was - Since when Bollywood audience have become so dumb/stupid/senseless that they really want to watch any kind of crap these stupid film makers throw at them. Illogical script mixed with senseless Farah's love towards the incapable Shahrukh coupled with 3 hr duration makes the experience too painful to handle. The actors were terrible except for Abhishek who did surprisingly well. All in all, not worth watching at all and I really feel bad for Bollywood audience who made this movie a success which only result in many more crappier movies like these. God Save Bollywood!",
         "Farah Khan lives up to to her abilities - which is non-existent. Her love for Sharukh Khan has again resulted in a movie that lacks a script at all, and something which she claims to be entertainment. Her love for melodrama and songs, has resulted in yet another disaster called Happy New Year. As she and her like minded directors always do - this movie is high on color and glamor, but has a poor script and dwells on low quality humor. Its the kind of humor which probably a low IQ person would only appreciate. Its a waste of money watching this movie. Please go and spend money on other movies. A consistent feature in such kind of movies is the minimal importance given to female actors. Deepika Padukone plays a dumb damsel in distress. I wonder why a female director would like to portray a female actor in such a light. Such stereotypical projections can only go against he case for women equality in the country. Farah please stick to choreography!",
         "What kind of crap does bollywood make these days.. SRK being such a known actor, how does he do such movies.. There is no flow to the movie. It's just random collections of scenes and dances put together. Story seems to be written by some baboon. More than the movie itself, I'm worried about Indian people who are actually running to the theatre for this crap. I don't know what they're thinking. Songs are okay as well. Acting is over the top. Entire movie is over the top. Heist is stupid. Comedy is slapstick. Edittors did a very bad job. 3 hours was pain. In short, there was not a single thing that was good in this movie. Please donate your money to some poor chap. One word to describe this movie: \"CRINGE\"",
         "Worst Movie.Boring dialogs.THIS Movie is not worth to its price ticket.Nothing new in movie.Three hours of Shah Rukh flaunting his abs and swagger gets too much to take minus a strong storyline. Farah Khan has redeemed Tees Maar Khan but Happy New Year is her most mediocre work. I am going with 0.5/10. It's a magnum opus which is pretty much hollow from within and remains an all frills, no thrills show.illogical script mixed with senseless Farah's love towards the incapable Shahrukh coupled with 3 hr duration makes the experience too painful to handle. The actors were terrible except for Abhishek who did surprisingly well. Pathetic Movie with some non-laughable 'forced' action-comedy sequences. I am Regret that I watch this awful film and waste my time you have chance don,t ever go near that film if you have little sense What happen to bollywood they making worse and worse. I think competition in bollywood that who make worse film that they just just forget. AWFUL 3 out of 10",
         "I have given this movie a rating of 1 because there is no choice to rate it as 0. I cannot even waste time evaluating the story because there is none. The film has no class. Farah Khan is a business woman who dishes out sub-standard movies to suit the people who are hard-up for entertainment. This movie would be appealing to people who don't care for a plot, and who get mesmerized with lot of colors and loud music and exceptionally over-acting. Instead of a spoiler alert, I can give you a Farah alert. I would rather watch a B-Grade than this C-Grade movie. Please do not waste your time watching this mindless so-called comedy which would not even appeal to a 10 year old. Farah, please use your money for some better things and leave film making for people who treat this a work of art. Don't waste good actors like Boman, Deepika in your mind-numbingly stupid movies. I will never watch your movie again.",
         "I had expected a lot from this movie due to the cast it had and the publicity they did, but I had wasted my money, time and mind when I watched the movie. This movie has awful story. Comedy in the movie is nice. The vfx of the movie were nice, but the story could be made awesome, just due to story I gave the movie just one rating. I was not having a vehicle with me, I went with my family and I had to stay even after intermission. It is a hit just because of the cast and comedy ONLY. I actually had an headache after watching the movie. I don't know where is the old Sharukh who had made hits like Swades, Chak de India etc, where ever he is, I hope he comes back soon. I miss you SRK. :(",
         "This is one of the worst movies ever to come out of Bollywood. Just because it made lots of money does not mean that it is a good movie. Most of the money was made due to huge sums of money spent on marketing and shows prior to the release of the movie. Farah Khan and Sajid Khan have the copyrights to make the worst movies in the industry. The story line of this movie is flawed. Why do they always have to characters which are bumbling, drunk, part deaf, have seizures and don't even speak properly. Jackie Shroff (Charan Grover) needed to be robbed, as he was so foolish that he couldn't even recognize Nandu as his son's double. The songs were too many, movie could easily have been cut short by at least 45 minutes. Poor direction and acting. Boman Irani otherwise such a good actor, lost on count of poor script. Vivan Shah was miscast in the movie. I don't think there is negative stars given for any movie, but to this one I give -10 stars. I am so glad did not watch this movie in the theaters.",
         "Not even story, no punches, no acting and none dance except one (manwa laage) rest everything sucked in movie. SRK's eight pack is sure shot graphics and can't be done at all, it is either graphics or some implants. The Jodi of Farah khan and SRK is back but sadly nothing magical came out of it as to from their previous movies like Mai Hu Na. Unnecessary use of dialogues from older movies which were just not necessary. And did'nt understood how these bunch of non-dancers won the final, it was well understood that on humanitarian grounds they were let into finals then how did the emerged as winner at the end. SRK looks just older for the roles he is picking. But for now SEE THE MOVIE ON YOUR OWN RISK!!",
         "I have experienced pain in several forms. I have seen amateur attempts at movie making . I have watched fine art films like Gunda. I appreciate tongue in cheek humor. But this movie is just a bad movie. Period. It is not a movie that one would describe as 'so bad that it is good'. No this is terrible. This is a terrible movie. I did not find it to be humorous - At ALL. I honestly do not know why this movie was made. Notable issues include- The attempt to poke humor at Saroj Khan during one of the dance sequences is terrible. God Save Bollywood! Once again Farah khan have failed to entertain, Even Tees Maar Khan was better than this. Basically, the philosophy of the film is vague and in line of the escapist Bollywood cinema. And, we are not even talking about logic yet. A brainless comedy which fails to entertain. Don't go if you value your money and time, but once again i am giving advice to people who loves movies like kick, chennai express, jab tak hai jaan etc and many other craps released throughout the year.Happy New Year is a muddled mess which has its own warm moments but as a package fails to work. Three hours of Shah Rukh flaunting his abs and swagger gets too much to take minus a strong storyline. Farah Khan has redeemed Tees Maar Khan but Happy New Year is her most mediocre work. I am going with 0.5/10. It's a magnum opus which is pretty much hollow from within and remains an all frills, no thrills show."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Red Chillies Entertainment"],
      "summaries": [
         "A team of losers attempt to pull off mass revenge against a past traitor; required to win a dance competition as part of the plan, they get entangled with the presence of a somewhat unintelligent local dance performer who cannot learn the backstory of the betrayal.",
         "Charlie, a fighter enters a dance competition to take revenge on his old enemy as he had sent his father to jail by blaming him to have stolen costly diamonds. Charlie and his group of friends take a dancer's help to perfect the art. They get to the finals, and according to the plan they steal the diamonds with a mysterious plan. They also win the finals and take a trophy back home along with diamonds.",
         "A team of losers win the love of millions in their quest to pull off the biggest diamond heist ever by team India."
      ],
      "budget": 0
   },
   "movielensId": 121370,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2014-10-23",
      "dvdReleaseDate": null,
      "directors": ["Farah Khan"],
      "runtime": 180,
      "movieId": 121370,
      "title": "Happy New Year",
      "mpaa": null,
      "actors": [
         "Shah Rukh Khan",
         "Deepika Padukone",
         "Abhishek Bachchan",
         "Jackie Shroff",
         "Boman Irani",
         "Sonu Sood",
         "Vivaan Shah",
         "Anupam Kher"
      ],
      "imdbMovieId": "2461132",
      "originalTitle": "हैप्पी न्यू ईयर",
      "genres": [
         "Action",
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["u0mrzMQJMQ8"],
      "plotSummary": "Six would-be thieves enter a prestigious dance competition as a cover for their larger goal of pulling off a major heist",
      "tmdbMovieId": 277432,
      "avgRating": 2.35714,
      "releaseYear": "2014",
      "numRatings": 28,
      "posterPath": "/1wHbuMUjjfoGrTo7YMNjhkgWksg.jpg"
   }
}