{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0454879",
      "video": false,
      "title": "Journey to the End of the Night",
      "recommendations": [
         38299,
         18586,
         176088,
         22633,
         18529,
         324289,
         62255,
         12261
      ],
      "backdrop_path": "/7UibhlHfUychcYI5y4qkRgHkWYm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe46669251416c750770b3",
               "name": "Brendan Fraser",
               "profile_path": "/n8VOWXp94nhIEo5nS9o6bOpUHiN.jpg",
               "id": 18269,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Wemba",
               "gender": 2,
               "credit_id": "52fe46669251416c750770b7",
               "name": "Yasiin Bey",
               "profile_path": "/x51WKi3gxwobt9Sov5HeS5kKHUe.jpg",
               "id": 4239,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Sinatra",
               "gender": 2,
               "credit_id": "52fe46669251416c750770bb",
               "name": "Scott Glenn",
               "profile_path": "/aKUJwCKhl4qCi7j7M7TRpqWLmmO.jpg",
               "id": 349,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Monique",
               "gender": 1,
               "credit_id": "52fe46669251416c750770bf",
               "name": "Alice Braga",
               "profile_path": "/txXdD7DxrzC71cDschQcDtTDwc2.jpg",
               "id": 8602,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Angie",
               "gender": 1,
               "credit_id": "52fe46669251416c750770c3",
               "name": "Catalina Sandino Moreno",
               "profile_path": "/6TsJDZOmhBxfTKFp6ldC68OW65n.jpg",
               "id": 5887,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "The Soothsayer",
               "gender": 0,
               "credit_id": "52fe46669251416c750770c7",
               "name": "Ruy Polanah",
               "profile_path": "/kTZMGkLRTS7Y1PqpIh7wU3yEu4Y.jpg",
               "id": 229254,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "Nazda",
               "gender": 2,
               "credit_id": "52fe46669251416c750770cb",
               "name": "Matheus Nachtergaele",
               "profile_path": "/poC54MfAz9ezqL9VjCNHCpYSnvY.jpg",
               "id": 8600,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46669251416c750770af",
            "name": "Eric Eason",
            "profile_path": null,
            "id": 151092,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.705085,
      "production_countries": [
         {
            "iso_3166_1": "BR",
            "name": "Brazil"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 15558,
      "vote_count": 14,
      "budget": 0,
      "overview": "In a dark and decadent area of São Paulo, the exiled Americans Sinatra and his son Paul own a brothel. Paul is a compulsive gambler addicted in cocaine and his father is married with the former prostitute Angie, and they have a little son. When a client is killed by his wife in their establishment, they find a suitcase with drugs.",
      "similar": [
         3134,
         11564,
         948,
         8810,
         281,
         298312,
         133805,
         2142,
         22323,
         14433,
         1359,
         141,
         185,
         431,
         101,
         205,
         681,
         949,
         12162,
         8923
      ],
      "original_title": "Journey to the End of the Night",
      "runtime": 88,
      "poster_path": "/6LCMGJiiXsiW84HipnMwvx55lJ1.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Millennium Films",
         "id": 10254,
         "origin_country": ""
      }],
      "release_date": "2006-04-21",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Eason"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Eric Eason"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0454879/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BOTUwNTE0NTU1M15BMl5BanBnXkFtZTcwODc4NTgzMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Brendan Fraser",
         "Yasiin Bey",
         "Scott Glenn"
      ],
      "reviews": [
         "In a dark and decadent area of São Paulo, the exiled Americans Sinatra (Scott Glenn) and his son Paul (Brendan Fraser) own a brothel. Paul is a compulsive gambler addicted in cocaine and his father is married with the former prostitute Angie (Catalina Sandino Moreno), and they have a little son. When a client is killed by his wife in their establishment, they find a suitcase with drugs. In the night that they have scheduled a negotiation with African buyers, their African liaison dies while having sex with the travesty Nazda (Matheus Nachtergaele). Sinatra proposes to the Nigerian dishwasher of the brothel, Wemba (Mos Def), to travel to the harbor of Santos, close the business with the drug dealers and in return he would receive a large amount. Wemba accepts but while returning to his car in the harbor, he is attacked by two smalltime thieves and passes out. His lack of contact with Sinatra and Paul leads to a sequence of misunderstandings with a tragic end. \"Journey to the End of the Night\" is a movie about losers that have a second chance in life, but waste it along a night of entwined mistakes. None of the characters is totally evil, they are ambiguous and develop a sort of empathy with the viewer. Scott Glenn plays an owner of a brothel, but also a family man concerned with the future of his son. The addicted and violent character of Brendan Fraser has a deep trauma from his childhood. Angie, played by Catalina Sandino Moreno, is divided between Sinatra and Paul. Wemba, played by Mos Def, is a simple honest worker that accepts to participate in a dirty business to raise easy money. The excellent Brazilian actor Matheus Nachtergaele performs a travesty in a key role. Watching this film somehow I slightly recalled \"After Hours\", a comedy of errors in New York. The lighting uses weird colors (yellow, red, green) and together with the bad weather, highlights the underworld of a poor and dark area in the cold São Paulo, in a film-noir style. The story is predictable, there are many coincidences, but I liked this movie. My vote is seven. Title (Brazil): \"12 Horas Até o Amanhecer\" (\"12 Hours Until Dawn\")",
         "What fun seeing a good ole fashion blood and guts, shoot 'em up noir. I felt like I was seeing a whole other side of the way crime thrillers could be made. This one uses sex, mostly in the backdrop and dialog in a hauntingly unerotic way--which speaks to the characters' misery and inability to feel pleasure. Not even sex or drugs can save them. Journey's plot is secondary to the indelible, painterly images; so much like Christopher Doyle's work that I had to stop the DVD and see who the cinematographer was. Scott Glenn rises to the occasion playing father and husband trying to make one last score so he can get out of the game. The old actor brings a lifetime of experience to the part. And really makes you invest emotionally in his plight. Also strong is Brendan Fraser, jumping out of his comedic pigeonhole and delivering an incredibly nuanced performance, at times funny, frightening and unforgettable.",
         "The film is a second feature by a director who had a film at Tribeca a few years ago which i never saw. This is a gritty pot boiler made in Brazil with an eclectic mix of famous faces and non-professional actors. The film is extremely violent but not without a soul. I particularly applaud Brendan Fraser for a stellar turn as the Bad Guy. Here is a part that he might well be remember for in years to come. Also very good is Scott Glenn and Mos Def. My favorite aspect of the film was the film score which was very emotional. I give it a solid 7 for those that like crime films. Beware there is a lot of blood in this one.",
         "I also watched the film at Tribeca and found it as a whole work to be interesting and entertaining. Sure there were flaws in the film itself but in total I enjoyed the camera work, the colors and the actors. I didn't have a problem with any of the actors on the screen. I thought Brandon Fraser was cast in a role that he normally doesn't play but that didn't take away from the movie if anything it added to it. He definitely had a presence on the screen as did Scott. The characters were also justified in their actions. Don't get me wrong there were flaws in the film I just felt that they were minimal. I went in expecting to watch a film that wasn't going to be very good and I ended up seeing something that I though was entertaining and interesting. The main character was not Brazil, there are movies where the city is the main character and the actors are there to move it along. This was very much character based film.",
         "Film Noir (literally 'black film') was a term created by French film scribes who noticed how 'dark', downbeat and black the textures and themes of many American crime and detective movies finally released in France following the WWII. (Films they hadn't been able to see under German occupation.) These B&W flicks initially came into vogue in the '40s, became more popular in the post-war era (especially as B-films, played behind more conventional cinema from Hollywood) and lasted up until the classic \"Golden Age\" to about 1960 -- or maybe 1958 -- as \"Touch of Evil\" is usually cited (by film professors) as the end of the classic noir period. It's interesting to note that film noir is not a genre, but rather a mood, style, point-of-view, or tone of a film. This tone can be blended with other genre's to form a most satisfying effect (most recently, the film \"Brick\" exploited noir conventions in High School setting!). Caper films, with its intricate plotting and criminal-characters existing on the periphery of society are some of the most significant examples of famous noir works. Most feature a \"tone of pessimism, and darkness\" and mainly share the form's visual style. But their main focus usually lies in the way they detail the strategies of the crime, that typically end up in fatal outcome, suggesting that there is a moral order to the universe, and that bad guys should not succeed. Crime Capers fall into several categories. In recent times, we've seen the jazzy stuff produced by Guy Richie and Soderbergh. In the 70s, we saw the existential masterpieces by Melville. In the eighties, we've seen caper films that were really romantic comedies at heart. Indeed, the fusion of capers has made its way into many a sub-categories heading. The same can be probably said for thrillers, although less fusions exist with classic thrillers. This category usually sticks to increasingly tense dramatic situation and if anything, veers into the realm of action films. Note that both \"Fatal Attraction and \"Basic Instinct\" feature action set pieces that could easily be cut into a Bruckheimer film. JTTEOTN is not a caper film, a thriller, an actioner or even a straight noir -- its all those things, and none of them. \"Journey to the End of the Night\" suffers (wrongly) from being a not \"instantly categorizable\" work (not in the marketing sense, but in the processing sense; i.e, how our brains orient to story: who am I supposed to root for? Brendan Fraser? No. Scott Glenn? No. Mos Def, yes, finally, but not wholeheartedly, because even the saintly Wemba is a drug runner who undertakes his mission solely out of greed). Its these types of transgressions that play against the contemporary mores, and a viewer's desire to enjoin and identity (within the first ten minutes) with a hero. Still and all, I would argue, that it is precisely this break with convention that has such an a lasting effect on the viewer. And makes JTTEOTN a most powerful post-modern noir.",
         "Just came back from the premiere in the Tribeca Film Fest, and I must say I am very disappointed. I was looking forward to this film as it includes great American and Brazilian talent involved, but it all seemed wasted. The audience in general did not seemed thrilled by the movie. An unexciting Q and A followed the screening and even the actor themselves (especially Mos Def) did not seem to be very interested in discussing the movie. The plot is over the top, full of holes. The movie does not strike a balance between in gritty reality and supernatural elements. Many shockers (she-male sex scene, gore) only disgust, but do not add the the narrative power of the movie. Characters jump in and out of scenes without any development and explanation. Unintentional laughs all along the screening. The city of Sao Paulo, Brazil was poorly used. It could have been just any other poor area in a third world country. Little do people know, the city is a megalopolis with much to be explored, but the filmmakers just used it for shock value. It is a poorly executed portrayal of a complex city. They could have very much used a sound stage. The actors are obviously very talented, yet ultimately miscast. Brendan Fraser tries hard, but he is not born to play an asshole role. It just came over as over the top and preposterous. Scott Glenn was solid, as was Catalina. Mos Def is the standout though. The filmmakers do not seem very confident of what language they want to use. While I appreciate the fact that locals spoke Portuguese with subtitles, even English speaking main characters every once in a while changed their language whilst in the middle of dialogue. It sounds phony, rehearsed and plainly sucks. The plot attempts and Tarantino-esquire mish mash of characters that somehow inter wine - but they are so poorly developed that everything seems silly and point out to holes in the plot. Believe me, I was looking forward to this and tried very hard to like it. If you are interested in gritty dramas about Brazilian suburbs, rent City of God, Central Station, heck, Mango Yellow instead. TOO MUCH WASTED TALENT, and honestly, I blame on the director. This had a lot of potential. Gritty cinematography is of high quality though.",
         "\"Journey to the End of the Night\" defies any instant classification. It touches on many genres and plays more like an amalgamation of films. The effect is wonderful and stirring and by the end of the movie you feel like you've been on an emotional roll-coaster. The plot is plain. Brendan Fraser is in love with his father's wife. He wants to run away with her and start over in a new country. Brendan has no respect for the old man because he is essentially a pimp -- (Scot Glen owns a nightclub where girls sell themselves). One night a man is \"offed\" in the club and leaves behind a bounty of drugs. Scot Glen and Brendan decide to sell the drugs rather than hand it over to the cops -- (Scot Glen has his own designs about starting over and getting out of the business). They enlist the help of one of their lowly employees (Mos Def) whom they know very little about. Only that he is Nigerian and that he can speak the same language of their buyer. Mos Def embarks on his mission which takes on a heroic, almost mythic resonance in one of the most humanistic, gentle roles I have ever observed. He progress is derailed by random violence which leaves him without his cell phone to call Scot Glen and Brendan Fraser (who now believe that Mos Def has absconded with the cash). Scot Glen in an act of desperation visits an old Fortune Teller to try to enlist his powers in finding Mos Def. Brendan Fraser begins to panic because his plan on getting away is beginning to unravel. Mos Def is rescued, as it were, by a beautiful young maiden (Alice Braga) who--because of a fight with her boyfriend--is lost in the world with no where to go. Mos Def and Alice team up for a heartbreaking and tragic passage back to the city. We see that despite some affinities there love is not to be. Meanwhile, back at the club Brendan Fraser stews over the missing drug mule, and begins to melt down. He confronts his father in brilliant \"actorly\" moment that redeems his character. We find through classic monologue why he is the way he is (And Fraser does some of his greatest work in this scene). The ending of \"Journey to the End of the Night\" borders on the fantastical and is wildly ambitious. Perhaps overly so and perhaps not entirely convincing. But no less great. The film is chocked filled with energy and passion, bloodshed, car chases, shoot outs, and moments of supreme gentleness. Not for the squeamish. This film is going to become a cult classic.",
         "This is an interesting work in the film noir/gangster genre. The story has to do with the bad blood between father and son, played out over one night in Sao Paulo. The tone and mood of the movie seem to reference many more famous, high profile films that deal with the same topic matter. This one seems very interested in stylization over telling a completely coherent story. And its this stylization that sets it above regular crime dramas. Bredan Fraser plays the loser, coke addicted son without any fear of looking bad. HIs performance is very emotional and wild. Not easy for any actor to pull off. His character is a villain without any morals. Made that way by his father, Scott Glenn, an initially likable, sympathetic sort, who, as the tale unravels, is not so nice a guy after all. By far, the film's hero, Mos Def (the only hero because everyone else is evil or not big enough to really know) gives a winning, career defining performance as a Nigerian immigrant who, out of loyalty to his employer, agrees to partake in a drug deal. The \"raptor\" gives a nuanced, thoroughly believable performance as wemba in maybe his best role as a film actor. The other big star of the film are the colors. The nighttime images and camera. It appears to be heavily saturated and grainy and apparently enhanced through the DI process. Cinematographer aficionados will surely want to see this for the interesting lighting. If the film has a flaw, I would cite an overall bleak and hateful tone of the script. Very anti- human being. The violence feels almost gratuitous with some shots of face slashing feeling too long or ultimately unnecessary. The squeamish will look away! But nothing very troublesome compared to the gore in the horror genre. Recommended to those who like dark material.",
         "A Director Searching for his Signature, March 3, 2007 Reviewer: Grady Harp (Los Angeles, CA United States) - See all my reviews For those of us who found much to admire and appreciate in Eric Eason's 2002 little powerhouse of a film MANITO that placed Franky G in the limelight as a sound actor inside that hunky exterior, the release of JOURNEY TO THE END OF THE NIGHT held much promise. Unfortunately with moving into the arena of 'major features' with popular big actors in a script that is deeply in need of surgery proves a step too quickly taken. While it is easy to see Eason's intentions in this very dark (literally!) film, it is compulsively doctored with phony 'reality ideas' that misfire. The basic story is a family of Americans who are deeply involved in the crime scene (brothels) of São Paulo, Brazil, intricately bound in their crime acts but both planning to escape the quagmire of the dingy life of the city and return to America. The father Sinatra (Scott Glenn) is living with Angie (Catalina Sandino Moreno - the star of 'Maria Full of Grace') and they have a small child: Sinatra's son Paul (Brendan Fraser) is also in love with Angie and plans an escape from the dregs of Sao Paulo after he manages to work a drug pass engineered by his father. The sale is to Nigerians who speak Yoruba and when the 'messenger' meant to pass the drugs for the money abruptly dies in a brothel with a transgender prostitute, the panic begins: who can make the pass that night? Sinatra hires a Nigerian, Yoruba speaking dishwasher Wemba (Mos Def) who agrees to take the drugs to the drop site and it seems Wemba is the only decent character to keep his bargain and his word. Paul is enraged with the death of the original middleman and ends up disfiguring the prostitute present at his death. The drug deal falls into problems, Paul is unable to convince Angie to stand by him (which mean leaving Paul's father and the possible endangerment of her son), and things bog down plot-wise so that story ultimately ends with the only persons to care about are Angie and Wemba. Eason makes his story all happen in one night and the constant factor is a greenish darkness that hides almost everything - and that may be a good thing! The script is Swiss cheese, the acting is for the most part sadly directed, the cast is poorly chosen, and the only real redeeming factor is the chance to watch Mos Def continue to flesh out his career with well executed character roles. Eric Eason holds much promise as a director (he was the awarded best emerging filmmaker by first annual Tribeca Film Festival in New York City in 2002), so perhaps this excursion into the 'big screen realm' can be forgiven as overstepping his material. In the end JOURNEY TO THE END OF THE NIGHT is hopefully just a sidestep for a director who obviously has considerable talent. Grady Harp",
         "It's interesting that so many people either rated this movie a 9-10 or a 1-2. I would suggest that those at the high end were dazzled by the setting and those at the low end were disappointed by the hodgepodge of what occurred there. I can't get excited enough to go to either extreme. I agree with those who said that Brazil was unused except perhaps as a marketing tool for the movie. There was virtually no interaction with the local culture except as a passive backdrop. The acting was uninspired. I didn't think Def was all that great, although at least he underplayed his pathetic role, unlike Fraser who was over the top to the point of ridiculous. In fact the only character that seemed decently played was the relatively obscure blind seer. The plot was full of holes, disjointed, and had no twists of any note. While others have detailed some of the major problems, I would add in the assertion that thieves set upon Def, knock him out, and then ignore the backpack laying next to him and run off without it. And he lays there in what appears to be a high crime district for quite some time and nobody chances by to see what might be in the backpack. You also have to swallow a gang packing all manner of weaponry who decides who they deal with and don't deal with based on which Nigerian dialect they speak. How's that again? I can make a million dollars doing a drug deal with you but only if you speak a specific language from my home country. Otherwise, the deal is off. Right. Then we have Def with a suitcase full of cash but unable to make a phone call. It wasn't clear why that might be exactly, but he never asks anyone for change, tries to change one of the bills in the pack, or does anything else to make what is supposed to be a critical call. Someone said he was cast in a racist and degrading role. I don't know about that, but he certainly seemed to be playing a character who was just plain stupid and unassertive. Quite a contrast with Hitchhiker, in which he was the hip insider. I'll take the latter. Still, there was some action, enough of a plot not to fall asleep on, a few bizarre characters of passing interest, some gore, a touch of sadism, interesting lighting at times ... I didn't fast forward it at any point. Mediocre but sufficiently entertaining to keep your attention. See it if the alternative is reruns on TV.",
         "Journey to the End of the Night has a wonderful cast and an interesting premise. From that starting point, however, its all downhill. The film collapses into such a morass of cliché, confusion, and violence that it leaves you wondering why you bothered to take the journey with it. Set in Sao Paulo, the film is (I guess) striving for a tone of gritty realism. Mos Def is, quite honestly, superb in his portrayal of a Nigerian immigrant drawn abruptly into a world of corruption. He is the only real winner in this sorry affair - the sky is the limit for this wonderfully talented actor. Catalina Sandino Moreno and Alice Braga also do not discredit themselves, but they are playing for a losing team. The film dissolves in a mish-mash of stock characterizations and improbable plot turns. \"Good\" bad girls, corrupt cops, drug deals gone bad - we've seen this all before, but here there is not enough internal logic to make us believe in any of it. Ultimately, in the film's violent, climactic scene, the cliché-level becomes so high that the sounds of laughter you hear are from people laughing at the film, not with it. Sorry to say, but Journey to the End of the Night is not a journey worth taking.",
         "Journey to the End of the Night is garbage. I picked out this stinker in a hurry. The synopsis on the DVD cover seemed interesting at first glance. Scott Glenn was in it. But most of all it was set in Sao Paulo, Brazil. Exotic locations fascinate me. Big mistake! The plot revolves around the owner of a brothel (Glenn) and his degenerate son (Brendan Fraser). The clueless pair stumble across a suitcase full of heroin, plot to sell it and divide the loot. We soon find out the coke-head son plans to double-cross his father. The tale is complicated by the sudden, unexpected death of their co-conspirator, a cocaine-launderer whom the father replaces with a dishwasher he hastily recruits from his brothel's kitchen. The story goes downhill from there. The plot is shot full of holes. As a consequence, I was tempted to pull the DVD and watch cable news. Instead I stuck it out. Another big mistake. Virtually every character in the movie is brain-dead and morally twisted. Fraser and his cronies are about as stupid and believable as the Keystone Cops or the Three Stooges. There is no character development, possibly because characters drop in and out of the story for no apparent reason (destiny?). Consequently, the action is contrived. Predictably, a bunch of characters are destined to be bullet-ridden, but by the end of the film, who really cares? To make matters worse, the script is a poorly written piece of junk. Characters repeat themselves time and time again, either because the writer thinks we're as dumb as his characters or he wanted the film to last more than five minutes. As a result, the actors either sleepwalk (Glenn) through their role or play it so over the top (Fraser) as to be farcical. All the other actors similarly struggle with the poor script and weak plot. What is the point of this pretentious tripe? It's hidden, no doubt, somewhere in the taglines (\"You can escape anything but your destiny,\" and \"Where life is cheap... and hope is priceless.\"). If you can make something out of that nonsense, you're wiser than I. This movie is pure fluff. Oh, and since all the action takes place at night, Sao Paulo, Brazil is nothing but a dark, yellow-orange blur. They could have filmed this crap under sodium vapor lights in the streets of East LA and you couldn't tell the difference. I rate it one star because this dreary journey is thankfully short and finally does end.",
         "A very original dark film that seems inspired by Gabriel Garcia Marquez and American Film Noirs. The story concerns Scott Glenn and his son Brendan Fraser as they scheme to get out of the brothel biz in Sao Paulo. They plan on selling some dope that's fallen into their laps and cashing out. But, boy--do things ever go to hell in a hand basket when their drug mule played by Mos Def gets bashed in the head. All goes haywire and Brendan Fraser chews a lot of scenery--in a good way. You could say that here is the first time that he ever embraced the dark side of his persona and did a damn fine job. Some of his natural humor seeps and refreshes the story. Really the big surprise is Alicia Braga (the niece of Sonia Braga) who has a supporting role of a beautiful young girl who gets entangled in this web by helping out Mos Def's character. She played the part to perfection. I want to see more and more of this actress.",
         "Prospective viewers, beware that this movie is completely devoid of substance and will provide you with a story that is neither intelligent nor coherent, neither insightful nor memorable. The story, which I found interesting for approximately the first 5-10 minutes or so, quickly devolves into foolishness and stupidity and, ultimately, leads nowhere. At one point, a soothsayer actually becomes, or seems to become, a central component of the plot. If that doesn't demonstrate to you how silly this movie is and how little it deserves your attention, I guess nothing will stop you from watching it. Let's assume that you do choose to view it. Just remember that as you watch it and increasingly ask yourself the questions \"where is this plot going?\" and \"is all this going to come together at the end?\", you are in for some nasty surprises. My friends, you are embarking on a long journey to nowhere. Can't say you weren't warned. Remember though: it's never too late to press the \"stop\" button on your remote!",
         "I saw this at the Tribeca FF on Friday night. The cast ensemble is one of the finest, the problem was the bad script and the out of control actors. Catalina looked like a deer caught in the headlines, the director could not seem to get her to emote anything more mild confusion. Brendan Fraser (of whom I'm a big fan) just spun out of control, it was over-acting that should have clearly been reined in. The death scene by Scott Glen at the end elicited many a laugh, which says a lot about the bad script. To suddenly come back to life just long enough to save his love and friend with the final words of \"go....\" before croaking was hilarious; I felt bad but could not help laughing out loud (actually I was hysterical with laughter). A big plus to Mos Def and Alice Braga, they were the saving grace of the film, obviously in little need of direction, I hope to see them all in a better directed film. Agreed that the cast seem uninterested or perhaps defensive during the Q&A session, but I can't blame them after the audience's reactions.",
         "...and it is, without a doubt, one of the WORST films I have ever had the misfortune to sit through. It is a truly awful, offensive, unpleasant, and ham-fisted movie. Let me get the tiny bits of praise out of the way right now. Both female leads are good, but totally under used. The film looks good, but this is achieved by the lazy trick of filming a city at night through different filters (here blue and yellow mostly). Also, Mos Def is good. However, the character he plays is a horrible racist stereotype, the \"good and loyal black servant,\" that I haven't seen in cinema in decades! He's a decent enough actor, and manages to bring some humour and humanity to an essentially one dimensional role, but he must have been embarrassed sitting up there watching his Steppin' Fetchit role unfold. It's lucky for him that he wasn't really on screen that much. Brendan Fraser was AWFUL. I've never seen a good film with him in it, and to be honest I didn't know he was in this (just there to see Mos, or Mr. Def as referred to in the credits!), but he is a terrible actor. At some moments, when he was supposed to be portraying the low point to which his character had sunk, he was overacting so badly that at least four or five people around me started laughing! The character he played was incomprehensible too. In an attempt to have his character merely seem complex, he veers wildly between sobbing schoolboy, brutal sadist, doting boyfriend, and petulant cell-phone destroyer (after he threw his second or third phone out the window, we all started laughing at the idiocy of having the exact same \"lead character is violent and unstable, he destroys phones\" motif repeated again and again). Scott Glen was okay, I suppose. He did what he could with some of the worst dialogue ever committed to film, but his character just didn't have anything going on beyond some very obvious and heavy-handed moments with his young son (\"see, he is a complex man, he is a pimp who loves his son, I am a smart writer/director!). As I said, earlier, both Alice Braga and Catalina Sandino Moreno are good, but have nothing to do except look scared and get battered. By the way, if you ever have the misfortune of seeing this film, please pay attention to the use of language. The clumsy way all the characters, even when it's a Nigerian talking to a Brazilian, transition into English is hilarious! The \"plot\" is a derivative mess of neo-noir clichés, and is so full of holes that I could have driven a bus up the red carpet and through the movie with no problems. I'm not going to dignify the film by summarizing it, but lets just say that it involves a drug deal gone bad, a crooked cop, a few double-crosses, and a wacky shootout where multiple people who've been shot still manage to shoot back and take their own killer out. Total bull, and ripped from so many other movies that I can't even list them, though if you've seen Lock, Stock and Reservoir Dogs (itself a near parody of other noir crime movies), then you've seen everything in this film's plot, done waaaaaay better. Oh, and there's an exotic psychic dude thrown in for good measure, just in case you didn't get the memo that read \"Brazil is exotic.\" And so, we come to the worst part of the movie: its location in Brazil. There is absolutely NO NECESSARY REASON for this movie to be set in Brazil, other than to dress a super-crappy crime film up with exoticized characters (in short, racist stereotypes) and locales. As it began, I was hoping for something that actually engaged with the complexities of Brazil, like maybe City of God, but this film is the polar opposite to that one! Do not believe anyone who says this movie is like City of God! They share nothing in common, Journey to the End of the Night could be set in any city in the world. The hilarious thing is, I was watching it and thinking that here was another example of a filmmaker using an exotic/strange/dangerous setting to make a totally boring movie SEEM more interesting, and then the director, Eason, gets up in the Q&A session and ADMITS IT!!! Someone asked why Brazil, and he basically said \"No reason, just wanted to set the story somewhere exotic!\" And he had the gall to suggest that he was thereby doing something revolutionary, because this was a movie that wasn't about middle class white men! Eh, hello, you hypocrite?? The two leads are middle class white men!! The movie is about them, they just happen to be in Sao Paolo exploiting Brazilians and an African! They're on the screen the majority of time, and are the only characters with any discernible agency. I could go on and on, and I have probably gone on way too long, but I'm procrastinating on some work, and this was easily one of the worst films I have ever, ever seen... and I've seen The Avengers! In sum: the characters are terrible, most of the performances are as bad as the characterizations, the plot is boring and derivative, the dialogue is laughable, and the politics of the whole endeavour are deeply suspect. Eason made a film about some white men exploiting some Brazilians. He somehow missed the irony of his being a white man setting a movie in Sao Paolo JUST to exploit stereotypical ideas about Brazil...",
         "First of all, \"Journey To The End Of The Night\" has nothing to do with the 1934 novel of the same title by Louis Ferdinand Celine. If the script writers borrowed Celine's title for some allusive reason, it escapes me. The movie is an unremarkable and predictable crime thriller/family drama. The dimly-lit and grainy cinematography--set in the seamy red-light district of Sao Paulo, Brazil--is nothing special; and the sentimental sound track, weak plot, and un-inspired dialogue contribute nothing original to the genre. The roles are thankless, and the actors in them give about the performances you'd expect from their B-class status. The worst by far is Brendan Frazer. He makes a fine Dudley Do-Right; but his performance as a ruthless crime lieutenant is laughable. Frazer's baby face, squeaky voice, and limited range couldn't convey threat, malice, or even the weak psychological conflict the script calls for--even on his best days. The other performers are just about as bad. However, there is one astonishing exception to all this lack-luster ness; and that is the performance of rap artist Mos Def, who plays a Nigerian dishwasher turned drug courier (when the real courier--a genuine tough guy--drops dead while having sex with a transsexual prostitute.) Mos Def's character, Wemba, is a retiring young man, a meek, short-statured student with only the most modest of aspirations in life. When we first meet him, his drug-dealing boss asks him about his background. Mos Def replies laconically; but his dropped words, half-finished sentences, and subtle facial gestures convey his melancholy character and difficult and disappointed past to us at once. It's a beautiful morsel of acting. Wemba takes on the job partly out of need, but mainly out of loyalty to his boss. While the written role of Wemba is hardly Shakespearian, Mos Def is brilliant in what he does with it. And while one could barely give a damn what happens to the rest of these flat and unappealing characters, Mos Def creates for his unenthusiastic but diligent courier a vivid, likable, three-dimensional figure--a simple soul who, when push comes to shove, shows unexpected courage—not because he has anything to back it up, but just because he is good guy--the sort of person who naturally does the right thing. He is not smart, or capable, or strong. And when he politely sticks to his guns (figuratively speaking, he is practically the only person in the film--other than the blind soothsayer and his dog--whose isn't popping a cap into someone at some point) and defies the people who threaten him, you know that he certainly won't be rescuing his own behind. Fortunately, (for Wemba, if not for the movie) the writers have thrown a bit of magic and fate (predictable as always) into the story mix here. And it is only that little bit of luck that leaves Wemba as last man standing in this otherwise silly little drug-dealing bloodbath. I know nothing of rap music, or Mos Def's career as a performer. But, if this part is any indication of his thespian potential, I'd say that boy can act!",
         "those are two words to describe this drama/thriller.when drugs and violence take over your life and you spiral out of control,there is no way out.that's the case with Paul(Brendan Fraser)who sees no future and nothing but despair.greed and(self)hatred are his best friends.Fraser puts in in an astounding performance here proving he really has some acting chops.Scott Glenn is also good as Sinatra,Paul's father.but by far,the best actor in my mind is Mos Def,who plays Wemba.he really loses himself in the role.there is a fair bit of very strong language and brutal violence in this film,so be warned.for me,Journey to the End of the Night is an 8/10",
         "\"Journey To The End Of The Night\" is a disappointment. The plot: Paul (Fraser) is a pimp who lives in Brazil with his father Russo (Glenn). They have a drug deal planned. Their mule suddenly dies, and, desperate, Russo asks dishwasher Wemba (Def) to replace him. It doesn't go exactly as planned.... The whole movie feels rushed. Something must have been cut out because it feels disjointed. There's no way this movie is 85 minutes long. If it was 2 hours it would've been better. The actors are good however. Def impresses again with a good performance. Fraser goes a little over the top but it works for his character. Glenn is always worth watching. If you like the actors, JTTEOTN is worth seeing, but overall it's a minor disappointment. For more insanity, please visit: comeuppancereviews.com",
         "Mos Def plays the Bob Cratchit clone, called Wemba here (on his own time, Wemba is studying to follow in Cratchit's footsteps as a bookkeeper, a dead giveaway of director Eric Eason's remake intentions). Wemba works as a dishwasher for brothel owner Sinatra, aka Rosso (Scott Glenn)--the Scrooge-like character. Sinatra gives Wemba a chance at a new life, if he can pull off the sale of a fortune in cocaine left behind at the brothel when the Mr. Fezziwig stand-in (The Russian=Johannes Sioberg) is gunned down in a murder-suicide by Mrs. Fezziwig (Carla Esposito here) in a tragic love triangle involving Sinatra's original drug mule, Baaba (Henry Babatunde Fadayumi). All Wemba need accomplish is to exchange the coke for the money-filled backpack of the Spirit of Christmas Past, aka Bosco Tang (Faroouq Olawale Sadia). Unfortunately, Sinatra's partner (the Jacob Marley character), his son Paul (Brendan Fraser), is still alive, and wants to get his hands on both the coke money and Fanny Scrooge, known here as Angie or the second Mrs. Sinatra (Catalina Sandino Moreno). Paul also believes he's the actual father of his step-brother Tiny Tim, dubbed Lazar (Luke Denis Nolan) in this retelling. In an effort to learn why Wemba is late returning to the brothel, Paul sends his personal thug Rodrigo (Milhem Cortaz, in the Undertaker role) to kidnap the Spirit of Christmas Future, the blind seer (Rui Polanah) to learn which way the cookie will crumble. Meanwhile, Wemba has made the exchange, but he's knocked unconscious by the two Collectors (designated as such in both the 1951 and the 2006 renderings). Fortunately, his cash pack is still at hand when the Spirit of Christmas Present--Monique (Alicia Braga)--comes to Wemba's rescue. Before he can return to the brothel, Rodrigo guns down Monique, as well as the clairvoyant's seeing-eye dog. Back at the brothel, Paul already has sliced open the face of this movie's Mr. Groper, the transsexual prostitute Nazda (Matheus Nachtergale), probably because Nazda had earlier snuffed out Baaba's life. The disfigured Nazda returns to Sinatra's office just after Paul has informed his dad he's confiscating all the drug money if Wemba ever returns. Nazda shoots Paul twice, Paul shoots Nazda once, and then Nazda puts two more bullets into Paul, blasting him to his death in the courtyard way below the broken-out office window. Nazda dies of his own bullet wound a moment before Wemba finally brings home the bacon. Rodrigo is hot on Wemba's heels, but Sinatra and Rodrigo exchange fatal shots, with the brothel owner bestowing his wife and money upon Wemba before expiring. The Seer looks on benignly as Wemba, Angie, and Lazar prepare to depart. Unbelievably, the Spirits have accomplished Wemba's transformation in a single night! While this remake was okay, I still am most partial to the 1951 version of A CHR!STMAS CAROL, aka SCROOGE, starring Alistair Sim in the title role.",
         "This movie is set in Brazil Brendan Fraser is the son of a pimp that owns a nightclub and they are trying to move a deal forward that is risky and has a lot hanging in the balance. The characters are very richly done with lots of tension over a deal and the entire movie revolves around it. A number of characters accidentally cross each other's path and wind up influencing each other and I enjoyed that part of it as well. This is a dark and violent movie but very well acted and a decent script that has an attention to detail you don't normally see these days. The only part I didn't like about the movie is it was unrealistic when Brendan's character actually cared what a fortune teller had to say- it's hard to believe a hardened criminal would worry about what he had to say for a second.",
         "If you ever doubted the impact that music has on movies just listen to Elia Cmiral's score in this film. From the titles on, it creates the perfect mood for this dark thriller set amongst the urban sprawl of Brazil's São Paulo. A combination of elements makes this movie seem better than it really is. Although it has a setting that is more likely to crop up on World Movies with sub-titles, I was surprised to find that it starred Brendan Fraser and Scott Glenn, and is in English for the most part. The film is set over the course of a single night. Sinatra (Scott Glen) runs a brothel in São Paulo. After inadvertently coming into possession of a large quantity of drugs, he is about to make a deal with a Nigerian gang, the proceeds of which will allow him to live comfortably in the US with his wife, former prostitute Angie, and their young son. He has the drugs, and the Nigerians have the money. He intends to hand the brothel over to his older son, Paul (Brendan Fraser). However Paul plans to hijack the deal and steal the money for himself. The plan starts to unravel when Sinatra's Nigerian go-between is killed; the Nigerian gang will only deal with a Nigerian. Sinatra enlists Wembe (Mos Def), a Nigerian dishwasher from the brothel to take the drugs to the gang and return with the money. This arrangement sets off a great deal of paranoia especially in Paul. Then, in the best traditions of the genre, chance intervenes to disrupt everyone's plans. Before the fade out, we are shown that there really isn't much honour among thieves especially down São Paulo way The setting is used to great effect and we get a feeling for the dangerous side of São Paulo. This obscures the fact that there are some fairly standard action scenes, and the downbeat finale also seems fairly standard for this kind of film. Brendan Fraser as Paul, taps his inner bad for this role – addicted to gambling and cocaine, in one scene he slices off the earlobes of a transvestite after a fight, and in another, to prove he is beyond redemption, he has an old man's dog shot. Scott Glenn always brings depth to his roles. He gains sympathy for his character despite the fact that he is not only a brothel owner, but has now also become a major drug dealer – showing how easily movies can distort values. The only character to emerge with dignity is Wembe, an unlikely hero who sticks to his word despite everyone's doubts, and attacks from all sides on the streets of the city. The film is worth a look just for the fact that a fairly typical plot has been transferred from the mean streets of Los Angeles or New York to the even meaner streets of São Paulo.",
         "The pacing is good, the violence serves the plot, and is not over the top. The camera work isn't flashy, and distracting from the story. The lead female is absolutely beautiful, I've seen her else where, will look it up later. Action and gore folks stay away..... I wish there were movies made along this style these days...... PS fellow reviewers, I don't think rehashing the whole story is needed.. That said, I felt very misled by some of the reviews here, I almost didn't watch the movie, glad I did. The Noir analogies made me want to give it a try.....Long live Noir........",
         "Filmed on a budget of six million, this movie made forty nine thousand worldwide and it's not hard to see why. Plot holes the size of Manhattan and a cast of characters that are risible to say the least. The sleaze factor is high (but then who gives a damn if the movie is any good - which it ain't!) Scott Glenn and Brendan Fraser as a father/son duo who own a brothel in Sao Paulo, who enlist the aid of a Nigerian dishwasher to sell a suitcase full of cocaine to fellow Nigerian gangsters. Glenn hands the suitcase over to the dishwasher and sends him on his merry way to do the deal and bring back the money with only the dishwasher's word that he will return. Hmm... Bound to be a doublecross there. Well, guess what? There ain't. And the gangsters hand over the money with no argument, even though they are armed to the teeth, the dishwasher is completely alone and unarmed. Okaaaaay... There's also an old geezer of a fortune teller in the mix, who tells the grandmother of a girl who has absolutely no purpose in the story that her granddaughter is going to die. And she dies. The fortune teller drifts in and out of the story for no apparent reason (is he symbolic of something? Only the writer/director knows.) The dishwasher is mugged but the muggers overlook the backpack full of money he is carrying. Okaaaay... Various complications, including a shootout between Brendan, Glenn and a transvestite who gave such great sex at the start of the movie that the original Nigerian scheduled to make the drug deal dropped dead. Hmm... (Only the writer/director knows.) An unbelievably convoluted plot that careens all over the place with zero credibility. Where the performances are concerned, Fraser does his hardest to flesh out his thoroughly dislikable character, as does Glenn, who has his legs chopped out from under him by the writer/director's unsympathetic backstory. Catalina Moreno as the love interest for both father and son gives a credible performance, though she has little to do, aside from being abused and insulted by Brendan. The one good performance in the movie comes from Mos Def as the dishwasher. Nicely understated. The movie was made on the streets of Sao Paulo, which is five times the size of Paris, but might as well have been made on a couple of backstreets in Brooklyn or Queens for all the scope of the movie. The contrast between the wealthier neighborhoods of the real Sao Paulo and the impoverished backstreets fails to appear in this flick. The dialog is graphic in the extreme, which only produces guffaws of laughter at the writer/director's expectation of shock value in the viewer. If the story was stronger (or more credible) the dialog might have worked. As it is, one merely chuckles at the naughty words. This reviewer virtually NEVER consigns a DVD to the garbage bin (paid good money for the damn thing!) but one viewing of this waste of time was enough. Watching the interviews with the people involved in the making of this movie, one has to wonder what they ever saw in it in the first place. As mentioned at the beginning of this review, it cost six million to make and only earned forty nine thousand at the box office. Those people who paid forty nine thousand would now like their money back.",
         "I find it _extremely difficult to watch a movie or TV program filmed in false color. The 'sepia' tint of 'journey to the end of the night' _immediately convinced me I wasn't interested in the plot. When I walk out into my backyard every morning I see 'roy g. biv' colors provided by the Sun and expect to see those same natural colors in everything I view. I think its a toss-up between CSI and the 'Matrix' movies for the advent of 'green' tinted filming which apparently provided the 'idea' for the red-shifted 'sepia' distraction in 'journey'. It doesn't matter which filters directors and film editors use, its _still not real. Raise your hand if you wondered why CSI's in Las Vegas walked out of _broad daylight into a house (crime scene) and _immediately turned on their _ever available hand-held flashlights rather than turn on the lights in a room ,or even _better, raise the shades. Trying to set 'mood' with false color and 'shading' should have criminal charges attached."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Millennium Films",
         "Equity Pictures Medienfonds GmbH & Co. KG IV",
         "Big City Pictures"
      ],
      "summaries": [
         "In a dark and decadent area of São Paulo, the exiled Americans Sinatra and his son Paul own a brothel. Paul is a compulsive gambler addicted in cocaine and his father is married with the former prostitute Angie, and they have a little son. When a client is killed by his wife in their establishment, they find a suitcase with drugs. In the night that they have scheduled a negotiation with African buyers, their African liaison dies while having sex with the travesty Nazda. Sinatra proposes to the Nigerian dishwasher of the brothel, Wemba, to travel to the harbor of Santos, close the business with the drug dealers and in return he would receive a large amount. Wemba accepts but while returning to his car in the harbor, he is attacked by two smalltime thieves and passes out. His lack of contact with Sinatra and Paul leads to a sequence of misunderstandings with a tragic end.",
         "One of the most dangerous cities in the world is São Paulo, Brazil. It's in the city's underworld of sex, drugs, money, and corruption that a father and son plan to finally escape this vicious and dangerous underworld. Journey to The End of The Night is Eric Eason's gritty sophomore feature, and stars Brendan Fraser, Scott Glenn, Catalina Sandino Moreno, and Mos Def.",
         "The tale of a son and his father separately plotting to escape the desolation of their lives in the lurid underworld of Brazil's sex industry..."
      ],
      "budget": 6200000
   },
   "movielensId": 121444,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-04-21",
      "dvdReleaseDate": null,
      "directors": ["Eric Eason"],
      "runtime": 88,
      "movieId": 121444,
      "title": "Journey to the End of the Night",
      "mpaa": "",
      "actors": [
         "Brendan Fraser",
         "Yasiin Bey",
         "Scott Glenn",
         "Alice Braga",
         "Catalina Sandino Moreno",
         "Ruy Polanah",
         "Matheus Nachtergaele"
      ],
      "imdbMovieId": "0454879",
      "originalTitle": "Journey to the End of the Night",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["wJE1sePq_s8"],
      "plotSummary": "In a dark and decadent area of São Paulo, the exiled Americans Sinatra and his son Paul own a brothel. Paul is a compulsive gambler addicted in cocaine and his father is married with the former prostitute Angie, and they have a little son. When a client is killed by his wife in their establishment, they find a suitcase with drugs.",
      "tmdbMovieId": 15558,
      "avgRating": 2.5,
      "releaseYear": "2006",
      "numRatings": 2,
      "posterPath": "/6LCMGJiiXsiW84HipnMwvx55lJ1.jpg"
   }
}