{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0149677",
      "video": false,
      "title": "War of the Planets",
      "recommendations": [],
      "backdrop_path": "/4PzkzqRW2RLugcmWKk9suDe2XUc.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "talisencrw",
         "id": "56f9cbad9251414deb00067e",
         "content": "This was a very bizarre and poorly-made film, which I can't believe was made after manned space travel, as well as masterpieces such as '2001: A Space Odyssey' and 'Star Wars' really served to up the ante when it comes to these types of film. The dialogue and special effects are terrible, but for the most part it was a fun watch, and I gave bonus marks because of the intriguing 'cosmic love' idea. However, even no-budget filmmakers need to realize that even if they can't afford much in various areas, decent ideas are still free. Just ask people like Edgar G. Ulmer and George Lucas (at least in the early, 'THX 1138', stage of his career).",
         "url": "https://www.themoviedb.org/review/56f9cbad9251414deb00067e"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 20,
               "character": "Captain Alex Hamilton",
               "gender": 2,
               "credit_id": "54f97d2ac3a36878e60012a4",
               "name": "John Richardson",
               "profile_path": "/esmjGJyeVTNyYu39utLcGRSf2fK.jpg",
               "id": 31545,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Meela",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5b5",
               "name": "Yanti Somer",
               "profile_path": "/pV7I3ENmw5K2VV6L1wZIQ8HBRz2.jpg",
               "id": 70625,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Richard",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5b9",
               "name": "West Buchanan",
               "profile_path": null,
               "id": 32917,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Greta",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a5bd",
               "name": "Katia Christine",
               "profile_path": "/oP6EB0ZVXgLFeAN5MQQRX3myyA9.jpg",
               "id": 139129,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Peter Segura",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a5c1",
               "name": "Vassili Karis",
               "profile_path": null,
               "id": 139130,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Oko",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5c5",
               "name": "Eleonora King",
               "profile_path": null,
               "id": 139131,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Max",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5c9",
               "name": "Percy Hogan",
               "profile_path": null,
               "id": 100424,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Marseille",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5cd",
               "name": "Giuseppe Fortis",
               "profile_path": null,
               "id": 139132,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Commander Armstrong",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5d1",
               "name": "Romeo Costantini",
               "profile_path": null,
               "id": 139134,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "McIntosh",
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5d5",
               "name": "Charles Borromel",
               "profile_path": "/9b8Nyko2OghFSfMhh6f1cUNUct4.jpg",
               "id": 7198,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Member of Hamilton's team",
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a5d9",
               "name": "Massimo Bonetti",
               "profile_path": "/6UnOH3XPGJHDJfZRm0674HmGcfO.jpg",
               "id": 128250,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Halla",
               "gender": 1,
               "credit_id": "52fe473ac3a36847f812a5dd",
               "name": "Malisa Longo",
               "profile_path": "/ZtEW6bpgEjVugazUC72YQxgwZc.jpg",
               "id": 99536,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Etor",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a5e1",
               "name": "Aldo Canti",
               "profile_path": null,
               "id": 103613,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Colonel Altman",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a5e5",
               "name": "Fabio Roscioli",
               "profile_path": null,
               "id": 564898,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Jack",
               "gender": 0,
               "credit_id": "52fe473bc3a36847f812a5e9",
               "name": "Daniele Dublino",
               "profile_path": "/hqTa2VKL7nd6S1ElfVGEY8pf5VZ.jpg",
               "id": 919804,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a5a1",
               "name": "Alfonso Brescia",
               "profile_path": null,
               "id": 41147,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe473ac3a36847f812a5a7",
               "name": "Alfonso Brescia",
               "profile_path": null,
               "id": 41147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe473ac3a36847f812a5ad",
               "name": "Aldo Crudo",
               "profile_path": null,
               "id": 103611,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 0.55606,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 47605,
      "vote_count": 4,
      "budget": 0,
      "overview": "A strange signal arrives on the Earth disturbing all communications, while an UFO appears above the Antarctic sea. Captain Alex Hamilton is sent with his spaceship and crew to the space outside the Solar System to find the origin of that signal. They reach an unknown planet where a giant robot enslaved a whole population of humanoids by taking their psychic energies.",
      "similar": [],
      "original_title": "Anno zero - guerra nello spazio",
      "runtime": 89,
      "poster_path": "/68cWPs59rJUw0pXmEXlhWADax95.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nais Film",
            "id": 8431,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Picturemedia",
            "id": 8432,
            "origin_country": ""
         }
      ],
      "release_date": "1977-09-23",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alfonso Brescia"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Alfonso Brescia",
         "Aldo Crudo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0149677/",
      "coverLink": null,
      "actors": [
         "John Richardson",
         "Yanti Somer",
         "West Buchanan"
      ],
      "reviews": [
         "Deserving of a place on anyone's list of the worst films ever made, this hugely enjoyable, hopeless sci-fi rubbish has to be seen to be believed. Made the same year as Star Wars and yet still setting the genre back 30 years, this must surely be the worst film ever to be written by two guys named Al. Most of the fun the film has to offer is to be had reading the credits at the beginning, with a host of hilarious names including Max Bonus and Charles Really. Many of the contributors are only identified by their first initials - undoubtedly a testament to their shame at having participated in this atrocity. A hotshot space captain and his crew are sent on a dangerous mission to investigate a mysterious signal discovered in deep space. They encounter a planet ruled by a malevolent robot who has enslaved the people who created him. Turns out he sent the signal so that someone would come and fix his dodgy circuit board. Mysterious space signals and psychopathic technology are not the only nods to 2001: A Space Odyssey. War of the Planets even boasts a space walk gone wrong, and it's even set to some homemade Strauss. Desperately amateurish performances abound, and are made even sillier by the ridiculous costumes the entire cast wears, although I'll concede that the women do look good in their figure-hugging outfits. Crammed full of some of the most abominable \"special effects\" I've ever seen in a film, this is well worth a look if you're into truly awful cinema.",
         "Am I the only person who enjoyed COSMOS: WAR OF THE PLANETS? I mean, it's not STARCRASH, but it made for an enjoyable 90 minutes or so. The film was clearly inspired by SPACE: 1999, from the costumes to the ship's layout and even the story. How many SPACE: 1999 episodes were there where somebody goes crazy and stalks through Moonbase Alpha, forcing open doors and throttling crewmembers who don't have sense to run? The 2001: A SPACE ODYSSEY swipes were already, mentioned, but how about the homage to Woody Allen's 1973 sci-fi spoof SLEEPER (or, to paraphrase Tony Roberts in STARDUST MEMORIES, \"they just outright ripped it off\")? Remember the Orgasmatron where you can satisfy all your baser needs fully clothed with the help of a computer? COLOSSUS: THE FORBIN PROJECT was a pretty good science fiction movie from 1970 starring Eric Braedon that dealt with the topic addressed in COSMOS: computers becoming sentient and running amok. STAR TREK tackled the topic a few years earlier in \"The Ultimate Computer\" episode with William \"Blacula\" Marshall and his M-5 computer which, like WIZ in this movie, was designed to make man's reasoning and initiative obsolete. COSMOS' Captain Hamilton shares many similarities with Captain James T. Kirk, among them a distrust of machines and a power of seduction over beautiful but icy women. (One more TREK reference: that ancient two-pillared structure sure reminded me of the \"time doughnut\" from \"City on the Edge of Forever\"). One character that really intrigued me and he was gone too soon was Ytor. When he came on board the bridge in uniform I sat up, thinking things were getting even more interesting. But after some really wild kung fu fighting he was gone. Yes, the movie is confusing. I was paying very close attention and still was left confused at points, but it really didn't matter. This was a very episodic movie; in fact I wondered if this wasn't several episodes of an Italian sci-fi series spliced together. It's worth watching, one of those movies where the sum of its parts exceed the whole. The lampooning of the media's distorting and sensationalizing what the military is trying to cover up was fantastic and timely. I saw COSMOS as one of the films in Treeline's 50 SciFi Classics box set and while the print is reasonably clear and colorful the framing is way off. This was obviously a widescreen picture and here it is presented full-frame but with the top and bottoms of people's faces sometimes chopped off as if the image was enlarged and just the center of the frame shot (no pan and scan). One word on the possibly confusing ending (hey, why should it be different from the rest of the movie?). I believe only Hamilton is hearing the ominous voice of the computer. Everyone else is celebrating Crewman Peter's becoming a Dad and their soon arrival back on Earth. But Hamilton hears in the ship's computer the coming of the technophilia that ravaged Ytor's planet. He experiences an epiphany that Earth is following closely in the footsteps of that doomed planet. It's a strong thought-provoking ending.",
         "The Italians are at it again. Crippled by an incoherent script, this Italian-made space opus is lost in the vacuum of space. The title, minus the word \"Cosmos,\" was used a decade earlier during the very 'mod' 60's. The runaway satellite in that film was child's play compared to this leaky albatross. This film deals, badly, with a more lethal out-of-control planet. The man in charge, the director, had to have been on a three-day coffee break. The extras rush and jump around in a swirl of confusion. Some high school productions are more organized. One actor pronounces the word data as \"da-da.\" When the landing party finds living beings on the planet, they all resemble an army of metallic \"Mr. Cleans.\" Crazy. A few of the female crew members are painted into their threads. And the ridiculous skull caps are definite turn-offs. Future technology is represented by scratchy video monitors and blinking boxes of gyros and lights. Organ music saturates the soundtrack with grunts and groans, piped in from a very dark place. The final showdown pits a rabid crewman against the lead Mr. Clean. Both souls are jettisoned out an air lock. Have a nice trip.",
         "This is one of the only movies I can watch over and over and always enjoy. I usually put it on just as I'm going to bed and let it lead me off to dreamy land . . . It's true that many people don't like this movie, or just consider it a poor Italian rip-off of Star Wars or Space 1999, or something else, but for some odd reason that I haven't been able to figure out, it's extremely compelling and really holds my attention. Yes, the sets are cheap, the costumes are pretty silly, and the special effects look extremely fake, but even so, some rare quality seeps through all the external cheesiness and something sticks with you! There are some unique ideas expressed in this film. There is also technology not seen in other movies. For example, the view screen on the bridge of the spaceship MK31 often shows a view of the MK31 itself as it files through space, as though there is some type of remote camera flying behind the ship, or beside it, for the sole purpose of the crew being able to view their own ship in flight. How this is achieved, I don't know. It's obviously a technology far ahead of what we have. It's not the kind of detail you notice right away, but once you do, it's fascinating! There's a lot of food for thought here. I thought about this movie for days after I first saw it and then began to watch it regularly. After a while, all other movies looked weird in comparison. One of the most interesting movies I've ever seen.",
         "I watched this movie broadcast by an Italian local channel some days ago... and enjoyed it a lot! This is a clear example of a b-movie of the seventies with a lot of defects: bad special effects, wooden actors, a weird montage in which some scenes are cut while in the middle of a dialog or an action... But it retains a special fascination if you are capable of watching it from an historical perspective. And some ideas are definitely good, not to say anticipatory: have you ever heard the story of a planet in which machines once built by mankind revolt against their owners and enslave them by stealing their vital energy? It sounds quite like The Matrix, isn't it? Well, don't expect other resemblances. Recommended only to the true science-fiction movies fanatics!",
         "There's something very captivating about this movie. It's not because of high quality, quite the opposite really: you very seldom see lack of quality in this level. I mean scene after scene, you think that the low point has been reached, but it really isn't. There's always a new line of dialog or some random bad cut, or then it just might be the absolutely horrendous, yet in some ways fascinating soundtrack, which is most of the time totally inappropriate for the mood or just plain weird. I couldn't help but to watch, how this ceremony of incompetence unfolded before my very eyes. Like a mouse, who knows he's going to his doom, I couldn't help but to watch it through, unable to witch it off. There was this ticking in the back of my head, that whimpered: It can't be that bad all the time. Surely there must be something good about it. But there wasn't. The acting got poorer and poorer by the minute, while the script kept flowing from sheer silly to borderline mental. A word about the plot: A strange signal from space is received and a stubborn, machine hating captain Hamilton (John Richardson) is sent to investigate. Sure enough, he and his crew encounter some UFO's and are soon forced to land in a barren world. There they encounter some savages and of course, because remember our captain who hates the machines, their computer lord, who is planning the conquest of whole universe. Muaha ha haa. And that's pretty much it. So yeah. Watch it if you like bad movies, which are funny in totally all the wrong reasons. But while watching, keep this in mind: sex is to be had with a help of huge glass ball, and requires no touching (hey, kinda like in Demolition Man\", and if you get infected by malicious artificial intelligence you'r face looks like you have leprosy and your fangs will grow into vampiric proportions. Go figure. Verdict: 1 out of 10. For all the reason given above. There really is very little in it actually resembling a movie. Camp score: 7 out of 10. I mean really, I was laughing even tough I watched this film alone. And usually camp films require some amount of assistance in a form of huge crowd of people. The score is lowered only because of horrendous sound effects and soundtrack.",
         "Either you are into these type of movies or you aren't; it's as simple as that. If you are a sci-fi buff and can appreciate the feel of the older B-movies, this one will most likely resonate with you (it did me). The acting is cheesy, and the story arc a bit shaky, but Cosmos: War of the Planets doesn't fail to entertain. The story is tight enough to keep you enthralled, and the action keeps up at a decent pace. A renegade captain (Kirk-like character) is selected to save Earth from a hostile alien menace. That's basically all you need to have a successful movie in this genre. Several unique ideas were thrown in that were copied by others later (like the simulated sex computer- stolen years later in Demolition Man). It's a classic line when the woman asks the man: \"Would you like it slow or rough?\". His care-free response: \"You decide.\" Love it! The tone of the movie is what really stands out. The sets look good enough and the ending scene delivers some good gore/action. Yes, the costumes are cheesy (what was up with those hats?!), but the women look damn fine in their tight-fitting getups. :-) The movie gives you the feel of the 50s sci-fi films with just enough updates as to not be boring. Definitely better than the low rating it has on IMDb. I think that comes from people who are expecting Cloverfield or Independence Day and just don't get low budget movies. Overall, a tasty slice of Italian sci-fi cheese. 7 out of 10. Seek out a used VHS for a couple clams. Also check out Starcrash and Battle Beyond the Stars.",
         "Aside from a nifty little twist in the plot at the end, this was a horrid little Italian sci-fi movie that just isn't worth your time--it's that bad. Unfortunately, it does not reach the badness of an Ed Wood, Jr. film, so it's not so bad and amateurish that it's good for a laugh---it's just BAD! The film is about a spaceship that is redirected to investigate some weird transmissions. On the way, the ship is attacked by robotic ships and it limps its way to a nearby planet--dominated by an evil robot that looks like a giant slot machine. This horrible robot and the computer that controls it have ravaged this planet and the surviving locals are unable to do anything but hide in caves and hope to survive. Well, the Earthlings are apparently made of finer stuff and one of them tosses a rock at the robot--thus destroying it AND causing a chain reaction that destroys the planet!! Well, this isn't all of it, as the evil computer isn't quite through with this crew, but I don't want to say more lest I spoil the great suspense! So let's talk script. It's just dull and slow until the end. And as for the rest of the film, the costumes are crappy and cheap, the acting wooden (at best) and the special effects were bad for a 50s sci-fi film--let alone one from 1977. This really is a wretched film all around and not worth even a peek. Avoid it at all costs.",
         "When I saw \"Anno Zero\" I was very impressed for what could Italian Cinema do without American effort.It is a b-MOVIE for SF estimators and can be appreciated for what it is. Technically speaking it was outclassed when it was shown first in 1977, at the time public was educated by Space 1999 special effects, very advanced for that age and was preparing to taste Star Wars.By the way The movie was an example of what we can do with few money and an interesting plot. I remember what impressed me was the fantasy in the Plot; for example consider the race of Machines that send a message to earth in a sort of zipped form of a Bach music, perhaps Anno zero guerra nello spazio it is not a masterpiece, but it is better than many other American counterparts",
         "I just finished watching this...and I will be honest...I'd seen a few minutes of it browsing a Digiview DVD compilation...I truly knew from just that few minutes this was probably a stinker, but I watched it because the actresses had tight uniforms. Yes, I know...that's terrible...but I couldn't help myself. Truly, the story was a wash out and watching the girls really was the motivation. I will say that actor, John Richardson was not as bad as everyone else. Too bad he didn't get a film role that he could shine. The ending of the movie is reminiscent of a twilight zone twist, which was a nice touch for those who suffer through it. Directing is almost as good as a high school film production, and a blind grandmother could have done much better cinematography. I read here that a reviewer wrote the special effects were as cruddy as 1950's sci-fi, and I say shame on you for saying that...they not nearly as good as Flash Gordon or War of the Worlds. On the other hand, they are as good as that stuff I just left in the toilet. But seriously, I can't even say that you have to see it to believe it, because in all fairness, you wouldn't believe it. Sadly, this film has been preserved electronically for all to see.",
         "Has a good science fiction film ever come out of Italy? Plenty of bad ones have, and this one might be the worst of the lot. This \"2001\" wannabe has a disjointed script, amateurish acting, inane-looking sets, crappy costumes with idiotic red helmets, supercomputers made of cardboard with flashing lights and robotic voices, and a dubbing job that makes the Gamera films sound professional. The plot: When the Earth receives a mysterious transmission from beyond its solar system, Captain Alex Hamilton and his starship crew investigate. After much tedium, the ship lands on the planet that sent the signal. It has been taken over by a supercomputer that has killed much of the planet's population and frightened the survivors into living underground. The computer sent the transmission because it needed help replacing its burnt-out circuits, and the natives weren't smart enough for the job. Hamilton destroys the supercomputer (by throwing a rock at it!), but in the process causes a chain reaction that blows up the entire planet. Oops! Item: in the space scenes, the stars bear an uncanny resemblance to light bulbs. Item: in several scenes, the background is solid black. Was a bluescreen beyond the budget, or did the director simply not give a damn? Item: the aliens suggest a cross between Yoda and Hare Krishnas, dipped in Rustoleum. Item: in this futuristic world, people have sex fully clothed and with no physical contact, instead laying their hands on a big ball that sits between them. (Hey, don't ask me!) Item: Captain Hamilton takes one of the alien beings, Etor, aboard the ship (for no apparent reason). Once they're in space, Etor watches the destruction of both his planet and species. His reaction? Well, he doesn't actually have one. For all the emotion on his face, Etor might as well have been watching \"The MacNeil/Lehrer Report.\" Item: The film \"climaxes\" with a crew member, who the supercomputer has somehow possessed, attempting to sabotage the ship. His face has sprouted ugly red abscesses, he appears to have grown fangs, he foams at the mouth, and his nose runs copiously. As for how a computer can possess a man\u0085. You can't possibly think this film would provide an explanation! Finally, my two favorites lines of dialogue: 1) \"We disappeared from one place and appeared in another!\" 2) \"Those strange signals are so baffling.\"",
         "STAR WARS has a lot to answer for. When George Lucas' film first came out, it kick-started the sci-fi genre after years of po-faced shenanigans in the wake of 2001: A SPACE ODYSSEY; it revitalised the serial-adventure genre, leading to a plethora of 1980s films like INDIANA JONES; and it 'inspired' a ton of rip-offs around the globe. No country ripped it off more than Italy, and director Alfonso Brescia is best known today for his series of insanely awful attempts at 'space operas', done with no budget, no intelligence, no reason. COSMOS: WAR OF THE PLANETS is one of his worst, an utterly cheesy, often indescribable attempt at an adventure flick that makes no sense whatsoever. At the same time, watched in the right mood, it's a hilarious movie, often providing a ton of so-bad-it's-good entertainment along the way. It's no Turkish STAR WARS, but it comes close at times. Where to start? Our \"heroes\" (including a token black guy who bites it) wear tight-fitting uniforms (great on the girls, not so great on the guys) and even tighter-fitting red helmets that make them look ridiculous. Later on, there's an alien guy who looks like a cross between Yoda and a Hari Krishna, and an absolutely amusing fight between him and an ugly, skin-peeling vampire guy (possessed by a computer?) that seems to come out of a horror film rather than a cheesy sci-fi flick. But it's the special effects that make this movie so very BAD: space scenes where stars are lightbulbs; computers made of cardboard; a killer robot as bad as the ones in Turkish flicks, resembling a big version of those walking toys, which is destroyed by somebody chucking a stone at it; green-painted alien beings; the worst model spaceship since, well, ever and plenty more besides. Square-jawed actor John Richardson carved a career out of these movies and he's as wooden as they come. The rest of the cast aren't much better. Yanti Somer appeared in even more, probably because she looks so good in her tight-fitting costumes. But if awful acting, stilted dubbed dialogue, appalling direction and the worst SFX seen in a film are your cup of tea, then by all means give COSMOS: WAR OF THE PLANETS a go!",
         "Yup .. this piece of cinematic doodie, is terrible. Why, Oh why, do I have soft spot for crap movies .. we'll never know. At least I'm not the only one. Apparently this is a kind of follow on from \"Planet of the Vampires\" .. which although low budget, was quite an entertaining and atmospheric film. It's definitely NOT a Star Wars rip off as it has nothing to do with that. It starts badly, teeters off in the middle, and the less said about the end the better. Best thing to do if you want to see this is with it on youtube .. there's a few places that have it. I certainly wouldn't buy it unless it's on one of those sci-fi movie box sets that contains 100 awful movies. I won't dwell on the 'story' .. but needless to say it's badly made. Awful script ... if awful even comes close to describing it. One can't help but blame the director for a lot of the dumb performances because .. well .. it's his fault! Editing is okay, considering the crappy material they had to work with. But hands down the biggest offence in this film is the music score. Ouch!! .. like being rogered with a prize winning cactus. John Barry proved you could have awesome music in a goody film (Starcrash 1978), so there's no excuse to phone in the score like they did here. Watch it if you dare, or if you're a sucker for bad movie .. like me! This movie could have been saved if the boys and bots at MST3K had riffed it, sadly it wasn't awful enough for them :P Would be a good film for a crap-fest!",
         "Truly bad news. The properties, sets, acting, and effects are all consistently sub-standard. This could be the top of the bottom I suppose all those employed in the movie industry have to work, but, I can't imagine anyone involved in the making of this picture will be proudly telling the grandkids about making this clinker. I LOVE science fiction even the campy stuff. I can excuse the stuff that uses contemporary props in futuristic settings 64 years in the future in 2924,ala \"Beyond The Time Barrier\" from 1960 I remember seeing it when I was 10, great futuristic sets and then M-2 carbines??!! Really? I can honestly say, don't waste your time.",
         "Comparing War of the Planets to Star Wars is like comparing a Rolls Royce to a Robin Reliant, Robin Reliants have a tendency to fall over when turning, two wheels in the back and one in the front. I was surprised to find out both movies came out the same year 1977, I thought War of the Planets came out in the middle 60's. Star Wars had top notch special effects, this movie has bad, cartoon like, laughable special effects, especially COSMIC LOVE, two people on two separate beds moaning and groaning to music. The acting was so bad I'm surprised that anybody had any kind of acting career afterwards.",
         "In all honesty, I'm probably being a bit generous with the rating here, but, though I've only very recently started writing reviews on IMDB, I figure I'm not going to rate something I do still kind of enjoy lower than a 5. Maybe my ideas will change about this as time goes on. Right now, I can't say. This movie is not boring, even though it's rather inept, and even laughable. I've seen almost all of these Bresccia space movies from 77/80 now and theyr'e all real bargain bin stuff, but this one is probably the best of the lot. Whether that is of any significance, depends on you. Regardless, all these films are of the sort of quality that makes the Gamma 1 films from 10+ years before seem like works of majestic artistry. You should probably be scared by that assertion. I can just imagine some drunk producer, having just gotten out of a viewing of Star Wars in 1977, calling up poor Alfonso on the phone and shouting, \"WE GOTTA MAKE A MOVIE LIKE THIS! GET TO IT!\" Alfonso, being a patient, quiet sort of man (ok, I'm really guessing, here), could not make his gentle queries about budgetary concerns and such heard. So, it's off to the junk yard he goes, to pick up any vaguely electronic-looking odds-and-ends he can find. Armed with this and a few bottles of super-glue, and a lot of wire, he proceeds to assemble his motley band of space marines. So, I know it's been mentioned before, but the editing of this film is weird, and makes it seem almost more artistic than it probably is. Scenes from the beginning of the film are never explained, or the consequences only kind of reveal themselves at the very end. A few of the scenes might be out of order -- or they might not be. it's up to you to decide. The result is -- actually kind of cool, in a loopy, doped-up way. What's interesting, too, is that while this may have been intended as a Star Wars cash-in, it's really not much like Star Wars at all. What this resembles, to me, is the original Star Trek series crashing messily into Barbarella. So, basically, this film , ather than being in any way on the cutting-edge of a new sci-fi trend, already looks, feels, sounds -- ten, or even fifteen years, out of date. The fact our man Al was probably asked to do the best he could to simulate Star Wars and came up with -- this -- is actually quite something, isn't it? Also, there are about three trick endings, each more hilarious than the last. At the finish, I swear I almost felt like clapping. They had some balls to pull this off, I'll say that for 'em. if you're gonna watch one of these turkeys, let it be this one.",
         "Despite the fact that they were produced during the same year , \"War of the Planets\" had nothing whatever in common with \"Star Wars\". While the former was definitely an \"A-Picture\", \"War of the Planets\" is strictly \"Grade-Z\". The story is nearly incomprehensible, the writing terrible, the acting wooden and the production values about what one would expect in a high-school play. Some cheesy science-fiction films can be so bad that they are entertaining. however, this example of the genre is simply...bad. About all this film accomplishes is to make the viewer appreciate just how good things like \"Star Wars\", \"Star Trek\" and \"2001: A Space Odyssey\" actually were.",
         "Only the most determined and devoted of science fiction fans will make it all the way through this without reaching for an extra strength Tylenol. You might also get a headache by the red and tan outfits that the astronauts wear in this, with caps to match. The leaders of the mission look like they raided Aquaman's closet and headed to the other direction to avoid discovery. It's in the hands of hot tempered captain John Richardson to figure out what's causing some sort of interference all over earth, and that supposedly has something to do with huge meteor showers flying through space. Tedious from start to finish, this lays there like one of Mars' moons, simply spouting off scientific sounding terms to sound intelligent. What it ends up as is pretentious and phony, really offering no surprises and making absolutely no sense. Unless this was released with the financial assistance of a pain reliever firm, it makes no sense as to how this escaped a movie studio editing booth.",
         "Okay, this movie is definitely for fans of films so bad they can only be enjoyed for their flaws. We have cardboard characters wandering around in the classic futuristic jump suits and spacesuits designed by a Halloween costume designer. The plot ... is there a plot? We have plenty of shots of a model spaceship (whose spaceship ?!) coming or going. Are we watching ourselves come and go or someone else come or go? It seems to be to cut between these shots of a model and volcanoes exploding and the voice of the All-powerful Robot sharing his thoughts of conquering the universe. No redeeming jokes. No redeeming babes. It's really a truly bad film. Only die-hard fans (like me) could power through this flick.",
         "I thinks someone was stuck in the late 1950s though the 1960s when they made this one. It's barely watch able. In 1977 Star Wars came out and so did this film... unbelievable! It looks and feels so much older than Star Wars. It's... cheap, cheesy and just barely watchable (and I say barely watchable being very generous with the film). They look way to \"spaced out\" - like some 1950s sci-fi costumes. I really think more like the late 1930s costume wise. Special effects maybe similar to the 1950s or 1960s. I could be wrong, but I *think* the film might be geared for little kids much more so than for all age groups. 2/10",
         "This was a very bizarre and poorly-made film, which I can't believe was made after manned space travel, as well as masterpieces such as '2001: A Space Odyssey' and 'Star Wars' really served to up the ante when it comes to these types of film. The dialogue and special effects are terrible, but for the most part it was a fun watch, and I gave bonus marks because of the intriguing 'cosmic love' idea. However, even no-budget filmmakers need to realize that even if they can't afford much in various areas, decent ideas are still free. Just ask people like Edgar G. Ulmer and George Lucas (at least in the early, 'THX 1138', stage of his career).",
         "It's true that this is a shoestring, dubbed, Italian move about a space ship that discovers a planet ruled by robots. It's true that it was released in the same year as \"Star Wars.\" It's true that the special effects are risible. We have to add, though, that the babes in their body suits don't look so terrible. And the electronic music, though not nearly so inventive, reminds us of \"Forbidden Planet.\" The model here was clearly not \"Star Wars\" but \"Star Trek.\" The uniforms are similar, the acting ligneous, the plot formulaic -- you land on a strange planet and find its inhabitants in some situation resembling one that Earthlings might be facing in a few years, or already have faced. I couldn't sit through the whole thing, but younger kids might enjoy it. It's not very challenging, and it's colorful and has a lot of motion. What would a kid care if a space ship was obviously a miniature dangling from a couple of wires? For adults, if you really intend to watch it, may I suggest that you chemically alter your brain before the experience? Well, maybe it doesn't matter. If you don't do it yourself, this Grade Z movie is likely to do it for you.",
         "2001 a space odyssey came out in 1968, Nine years later, War of the Planets! It is a mystery for whom this movie was made for. It is so poorly done, one doesn't know where to start. No plot, crummy effects, stilted acting, it looks like it was shot in Italy and dubbed in English, but that does not seem to be the case (maybe I am wrong). Like a star trek plot jumble, this film bounces from tired plot line to inane plot line. No one involved seemed to be taking it seriously, there are 2001 rip offs galore, down to an illogical use of classical music in the score. There are times it tries to be funny and fails, then there are times it tires to be dramatic, and ends up funny. One could argue that it was made for kids, but for the inclusion of an \"orgazmatron\" complete with some blue movie groaning and moaning. The robot villain looked like the grill of some Italian sports car, it had flashing lights, Oooohh! It is also immobile. Do we need to see the crew of the spaceship jump up and down and hug each other, as if their team scored a point, when they are not destroyed by a meteor? Lame movie making.",
         "It mostly re-uses sets, ideas (the stupid toy robot computer; the caves on the planet; attacking alien space ships etc ) and characters from another C-tier, low budget movie (http://www.imdb.com/title/tt0075881/usercomments?start=10 ). The same hippie muzak song from the other movie is recycled (that's waste after all ) here as well, albeit with different words (\"in the space we have brothers\" ). The music best epitomizes this laughable movie: at times sounds like \"Spartacus versus Gamera\" or \"Hercules against the queers\" or whatever C-tier \"colossal\" they were milling in Italy in the 1960s; most of the time, though, like the worst muzak from 1970s answering machines or video games. It \"borrows\" from other movies as well: mysterious space signals sent to earth from an unknown planet (2001-odyssey anyone? ) lure a spaceship to a planet, where they find inhabitants having regressed to cavemen, hiding in terror from mysterious overpowering machines their race had once built to help man live comfortably...but that was before the \"explosion\" (in the cavemen's opinion ); or before an alien invasion (in the toy robot computer's opinion ). As in \"planet of the apes\", these survivors don't talk but use brain waves to communicate. In the end a crew member turns into a raging, murderous psychopath/space monster... There is the angle of the grudge the bada$$ captain holds against computers and their predictive ability. Acting is negligible to laughable. It scores 3/10 versus 2/10 of the other movie because here things are a bit more credible ( at least no funky 1970s jeeps around in supposed year 2300... ). SFX are laughable to negligible. To watch only once."
      ],
      "genres": [
         "Adventure",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Nais Film",
         "Picturemedia (New York)"
      ],
      "summaries": ["A strange signal arrives on the Earth disturbing all communications, while an ufo appears above the Antarctic sea. Captain Alex Hamilton is sent with his spaceship and crew to the space outside the Solar System to find the origin of that signal. They reach an unknow planet where a giant robot enslaved a whole population of humanoids by taking their psychic energies. The robot's got his eyes on the Earth, too..."],
      "budget": 0
   },
   "movielensId": 121533,
   "movielens": {
      "languages": [
         "Italiano",
         "English"
      ],
      "releaseDate": "1977-09-23",
      "dvdReleaseDate": null,
      "directors": ["Alfonso Brescia"],
      "runtime": 89,
      "movieId": 121533,
      "title": "War of the Planets",
      "mpaa": "PG",
      "actors": [
         "John Richardson",
         "Yanti Somer",
         "West Buchanan",
         "Katia Christine",
         "Vassili Karis",
         "Eleonora King",
         "Percy Hogan",
         "Giuseppe Fortis",
         "Romeo Costantini",
         "Charles Borromel",
         "Massimo Bonetti",
         "Malisa Longo",
         "Aldo Canti",
         "Fabio Roscioli",
         "Daniele Dublino"
      ],
      "imdbMovieId": "0149677",
      "originalTitle": "Anno zero - guerra nello spazio",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [],
      "plotSummary": "A strange signal arrives on the Earth disturbing all communications, while an UFO appears above the Antarctic sea. Captain Alex Hamilton is sent with his spaceship and crew to the space outside the Solar System to find the origin of that signal. They reach an unknown planet where a giant robot enslaved a whole population of humanoids by taking their psychic energies.",
      "tmdbMovieId": 47605,
      "avgRating": 3,
      "releaseYear": "1977",
      "numRatings": 1,
      "posterPath": "/68cWPs59rJUw0pXmEXlhWADax95.jpg"
   }
}