{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1764647",
      "video": false,
      "title": "Shadow People",
      "recommendations": [
         14458,
         92395,
         106717,
         165567,
         291866,
         177552,
         28917,
         55045,
         19222,
         199578,
         24116,
         381935,
         128311,
         337085,
         306969,
         194121,
         73588,
         174678,
         33005,
         25329
      ],
      "backdrop_path": "/uOdldehI5KQ7MpSss1QEXGME4Tm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Charlie Crowe",
               "gender": 0,
               "credit_id": "52fe4d73c3a36847f8261aab",
               "name": "Dallas Roberts",
               "profile_path": "/irqfTXfK1rWeF6SNLzB37b6yxAN.jpg",
               "id": 424,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sophie Lacombe",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261aaf",
               "name": "Alison Eastwood",
               "profile_path": "/mRXDleUiPyNFSv3mOF4PNR7nhkY.jpg",
               "id": 389,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261ab3",
               "name": "Anne Dudek",
               "profile_path": "/nOaxjVPuWyfk5OkQc11ib2PhhRs.jpg",
               "id": 24198,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261ab7",
               "name": "Mariah Bonner",
               "profile_path": "/c8zup1I9XwkdtOpPpBqHpkiESwn.jpg",
               "id": 585673,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Preston",
               "gender": 0,
               "credit_id": "52fe4d73c3a36847f8261abb",
               "name": "Mattie Liptak",
               "profile_path": "/5qq5yYF4LEMDfDnJ62aSWdsTrUh.jpg",
               "id": 931104,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe4d73c3a36847f8261abf",
               "name": "Christopher Berry",
               "profile_path": "/fIq5d1S0xLBapW7EZKKknTdgPA7.jpg",
               "id": 1173099,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jeff Pyatt",
               "gender": 2,
               "credit_id": "52fe4d73c3a36847f8261ac3",
               "name": "Jonathan Baron",
               "profile_path": "/As8SvZ8Q2UZu3QM54nJIQXOAVzt.jpg",
               "id": 971802,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe4d73c3a36847f8261ac7",
               "name": "Tony Schiena",
               "profile_path": "/59WTrSZUac68C528rWAxAsADwR7.jpg",
               "id": 132233,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sparky",
               "gender": 2,
               "credit_id": "52fe4d73c3a36847f8261acb",
               "name": "Ritchie Montgomery",
               "profile_path": "/znNRxqrYkOskK3jlm3ftHyAzJDg.jpg",
               "id": 52885,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Professor Fisher",
               "gender": 2,
               "credit_id": "52fe4d73c3a36847f8261acf",
               "name": "Marco St. John",
               "profile_path": "/12DFOaqp5e2deR8yQyrzsXIwE41.jpg",
               "id": 94182,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Coroner",
               "gender": 0,
               "credit_id": "52fe4d73c3a36847f8261ad3",
               "name": "Han Soto",
               "profile_path": "/yNeZnnkO7aux7uKRM7AoOxX3mbG.jpg",
               "id": 1116011,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "TV Anchor",
               "gender": 0,
               "credit_id": "52fe4d73c3a36847f8261ad7",
               "name": "Billy Slaughter",
               "profile_path": "/5YykEE15cNzgexL7d5ewAu5M8XN.jpg",
               "id": 62784,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Gabriella London",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261adb",
               "name": "Angelena Swords",
               "profile_path": null,
               "id": 148994,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Bill Ryder",
               "gender": 0,
               "credit_id": "52fe4d73c3a36847f8261af7",
               "name": "Bryan Massey",
               "profile_path": null,
               "id": 1253910,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "CDC Director",
               "gender": 2,
               "credit_id": "52fe4d73c3a36847f8261adf",
               "name": "Gary Grubbs",
               "profile_path": "/zbSSBFW8oRl4M1u2vyr1PUnWqCw.jpg",
               "id": 68180,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Britney",
               "gender": 0,
               "credit_id": "52fe4d73c3a36847f8261ae3",
               "name": "Raeden Greer",
               "profile_path": "/cJff43RSRvQVK1sETfMUIhTCKdM.jpg",
               "id": 1123886,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Nurse",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261ae7",
               "name": "Jaqueline Fleming",
               "profile_path": "/2cVAq0KxKS3GevXaliX7aEgBYKx.jpg",
               "id": 62072,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Kim Pyatt",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261aeb",
               "name": "Debby Gaudet",
               "profile_path": null,
               "id": 872566,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Donut Shop Employee",
               "gender": 1,
               "credit_id": "52fe4d73c3a36847f8261af3",
               "name": "Monica Acosta",
               "profile_path": null,
               "id": 148995,
               "order": 19
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "5829fe1f9251417b2903ae04",
            "name": "Matthew Arnold",
            "profile_path": null,
            "id": 1260586,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 3.20286,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 176570,
      "vote_count": 49,
      "budget": 0,
      "overview": "A radio talk show host unravels a conspiracy about encounters with mysterious beings known as The Shadow People and their role in the unexplained deaths of several hundred victims in the 1980s.",
      "similar": [],
      "original_title": "Shadow People",
      "runtime": 89,
      "poster_path": "/DclkCjLsZz3IEV8hxnt9U31b7X.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2013-03-17",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Matthew Arnold"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Matthew Arnold",
         "Matthew Arnold"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1764647/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTYwMDk1MzY2N15BMl5BanBnXkFtZTcwNDk5OTU1OQ@@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Dallas Roberts",
         "Alison Eastwood",
         "Anne Dudek"
      ],
      "reviews": [
         "Rarely do I come across anything in my viewing of horror movies that makes me jumpy or paranoid after turning the TV off. Most times I enjoy the film and then go on about my business with no worries. However, every once in a while a true gem of fear comes along and leaves its imprint on me as I shut off all the lights in the house and head to bed. Matthew Arnold's \"Shadow People\" had me searching the walls and windows for ghastly spots of unexplained darkness after watching it. Participants in an experimental sleep study in the 1970s report seeing strange shadowy figures. They and several hundred other individuals die in their sleep soon after. The phenomenon was given the name SUNDS, which stands for \"Sudden Unexplained Nocturnal Death Syndrome.\" Doctors wouldn't talk about the shadows. In the present, failing radio talk show host Charlie Crowe begins receiving calls from a teenager claiming shadowy intruders are coming for him. At first, Charlie believes the kid is mentally ill. His theory is challenged when the boy dies in his sleep. Things get even weirder when listeners of his talk show and people he tells about the mysterious shadowy figures begin dying in their sleep. Are these clusters of deaths a coincidence or are there sinister nocturnal forces at work? \"Shadow People\" takes the sort of ideas our nightmares are made of and puts them in a visual package. Everything you've ever thought about someone or something watching you in your sleep is brought to life in this creepy little indie film. Director Matthew Arnold shows great promise through his mastery of timing. He has a knack for setting up what you would expect to be your typical jump scare and somehow delivering it in an off-tempo manner that leaves the viewer surprised and shuddering. I can't say I completely agree with every choice of filmmaking he used for \"Shadow People.\" The movie is presented in the manner of many true crime TV shows are. It's a re-enactment of \"true events\" with the actual people involved giving their commentary along the way. The concept is interesting but gets a bit distracting as the terror unfolds. Many religious individuals would express their belief that shadow people are demons or evil spirits. Much like in \"The Possession\" or \"The Exorcist,\" the person has brought something into their house that allowed the entity access. I am of that mindset more so than any other concept brought up in this. If I were to compare \"Shadow People\" to other movies out there just as a way to spark people's interest, \"The Ring\" and \"The Apparition\" immediately come to mind. By no means is this a carbon copy of either of those films. They just came to mind as I sat watching it. \"Shadow People\" is that rare horror movie that leaves a lasting impression on its audience. The fear might wear off over time, but you'll never completely stop thinking about it. We all wake up in the middle of the night gasping for air, feeling like something is sitting on us, or thinking we're being watched. Is it just our imagination or could it be the shadow people?",
         "\"How do you stop thinking about something.\" Charlie Crowe (Roberts) is a talk show host who's ratings are slipping and he is worried that he may get canceled. When a young man calls in one night and tells him about a nightmare he is having he thinks its a joke and hangs up on him. After receiving a package from him he takes it a little more serious, then after the next time he calls it changes everything. Charlie is now trying to figure out what he saw. This is a very interesting movie but I wouldn't call it a straight horror movie. The movie is interesting enough to keep you watching and interested but I didn't think it was scary in the classic sense. The only movie I can really compare this to is The Fourth Kind in the way that it mixes \"real\" footage with the movie footage which makes it a little more creepy. It is a hard movie to recommend because it doesn't really fit into a specific genre but I will say that it kept me interested the entire time. Overall, not a bad movie but nothing amazing either. I give it a C+.",
         "I really liked this, first thing is its not a gore/blood fest ( which is a good thing) its more a creep/freak you out movie, I watched it about 2am on my own in the dark and it freaked me out, I thought it was a cool original quite scary idea, with some great writing and ideas and some great acting, it would of been easy to make this feel cheesy and cheap but it doesn't the main character does a superb job of portraying the sceptic to believer, its a shame it has a low score which will instantly put people off this movie as recently especially in this genre it's rare to find something original and so well done, I hate to admit after watching it I actually turned the light on to go to sleep lol I can't remember the last time a movie had that effect, well worth watching just don't expect a slasher or make you jump movie it's more one that freaks you out when thinking about it, which you will do",
         "All I'm gonna say is don't listen to all the negative reviews about this movie, From the trailer i wasn't too amused about watching this, but i love horror movies ill give any a chance until it make me cut it off. But back to this movie, WATCH IT and enjoy scary, informational, just a good movie all around in my opinion. The acting was good, the jump scares were on point. I started searching around on google also after watching this trying to see how true it actually is because i myself do at times seem to see little shadows in the corner of my eye at times. Really had me freaked out but i love it hahahahah. Hope you all enjoy this film when you watch.",
         "Well I liked this movie. This movie is rather documentary and film based on true events type. There are many actual footage scenes. Characters are decent and well developed. Dallas Roberts does good job at playing his characters development through the whole movie. The main plot of the movie is rather similar to movies like \"Ring\". Cameraman did good job so there are no shaky camera scenes, which is rather rare today. Also there is no gore, which is also good, cause we are all sick of watching blood splashing are unnecessary screaming in movies. This movie is not for everybody. I would recommend this movie for audience who likes thrillers based on true events and have enough time to watch it.",
         "Do you scare easily? If the answer is no and you watch a lot of horror then I'm pretty sure the premise in this film will wear on you fast. The film starts by stating that the film has ties to actual events and then goes on to show a few people describing a feeling with similarities & properties as shown in \"The Ring\". That's quite a tall order to fill, considering how \"The Ring\" was one of the most original & effectively creepy films of this century. The trouble starts when a seventeen year old boy sends a mysterious package to a night time radio talk show host. Later that night the boy calls the show and is raving on about how these \"shadow people\" are coming to kill him if he falls asleep. The call ends in a gunshot which turned out to be him shooting at the wall. The boy was taken to the hospital for an evaluation, but was found dead the following morning from unknown causes. Thus the talk show host feels compelled to dig deeper into the mystery surrounding the case and starts to investigate on his own to find answers, his first stop was a public library where he copies pages out of books, after he leaves the librarian finds a paper that was jammed inside of the copier & reads it. Thus she inadvertently unleashes the wrath of the mysterious shadow people onto her. All of this seems to take a long time to get going as it reaches the halfway point without a whole lot of information other than hearing callers accounts of \"sleep paralysis\" & the feeling of having someone in the room with them. The further the film gets the less engaged I became, there was a complete lack of empathy for all characters involved and it's plot seemed to get sillier & less believable as the film progressed. It switches from expert to expert blabbering on about a subject that IMO is just wasn't presented in the correct manner. The fact that this film had the ability to shake up any full grown adult is far more disturbing to me than anything. I believe this topic could have had some serious potential if handled properly & there's nothing worse than wasted potential when dealing with a fresh idea",
         "When at the beginning I saw the 'Reality' footage added in, I thought immediately that I was NOT going to like this (I HATE 'Reality Shows' and most 'Found Footage' films) But, I must say, that it was actually used very judiciously throughout the movie. I don't usually care for Dallas Roberts that much either, but I must admit that he did a decent job in his role. Every time I see the guy, I get this eerie feeling that John Ritter has been resurrected! DAMN! Also, as you actually get to see the real people here involved in the 'True' case, it does have a sneaky way of drawing you into the film. With such a simple concept, the way it was done was decent and moderately effective. When I saw the REAL guy I truly felt quite sorry for him, especially when they show the credits at the end (not to give anything away) I really just felt bad for him. I think the thing that I appreciated most was that the way it was put together and the way it was put across, you never get the feeling that the film makers are exploiting the idea like so many other 'True' stories. Especially with the footage of the real guy, you get a strong sense that they are honestly trying to portray events as they actually 'happened'. A surprisingly interesting and mildly effective film that somewhat surpassed my earlier expectations...",
         "This is a very solid little horror film that does a great job of combining mock-documentary footage and a straight narrative. Also, the filmmakers have seeded the film with subliminal word messages hidden in a few quick cuts and blurry images, which is kind of funny and amusing. It's individual words sprinkled through the film o spell out: NOW YOU WILL SEE THEM TOO!!! I really appreciate this little touch and would love to read or hear about this choice. I watched it on VOD, so now I'll have to pick up a copy of the DVD or blu-ray to see if they talk about this at all. I am a sucker for a good ghost story, and while this isn't \"ghosts\", it is creepy and made the hairs on the back of my neck stand on end more than once. It also reminds me of my college days of staying up late and listening to Art Bell on his spooky AM radio talk show. If you like creepy, slow-burn horror you should defiantly give this a watch.",
         "I watched this last night with my boyfriend and we both really enjoyed it. It is quite like The Fourth Kind in a way...showing both \"actual footage\" mixed in with acting. I found the performances believable and the story line really interesting. The film isn't gory but is a bit creepy and makes you think. Not really sure why it's scoring so low...found it a really good watch and didn't lose interest at all throughout the film. It was one of those where you had to remind yourself that it wasn't actually real, although searching through a video upload site afterwards found a lot of real life similar experiences with the \"shadow people\". Definitely worth a watch.",
         "In the mix of all poorly made movies out there these days this one deserves your attention. Shadow people is full of suspense moments and qualifies as a good mystery after all. Dallas Roberts was amazing in it. Solid storyline and clever filming. Definitely worth watching and makes you think about reality of the events and phenomenon of The Shadow People. Seems like they used some real facts in the movie which makes it even more desirable to watch. Shadow people hit its home run in all aspects - good acting, good writing, good directing and that kind of movie that will make you think about it after it's finished. Most of us had some kind of experience that we could relate to in this thriller.",
         "Let me first start out by saying that I have never given a movie a 10 rating and that this 10 rating is not because of the quality of the movie or the acting skills of the actors but purely on the fact that I was scared shitless after watching it, so much that I was too afraid to go to sleep! This movie was scarier than \"The Conjuring\" but surprisingly never made it to the theaters! I now regret watching the movie because I tossed and turned all last night for fear of closing my eyes! I was so scared! This is ironic considering that I searched high and low for it after seeing a preview of it. I finally found it on Netflix (DVD)and wanted to watch it so bad that I subscribed to the DVD service! \"Shadow People\" is based on true events about a 1971 sleep study gone wrong where people died mysteriously in Kentucky after claiming to see shadow people. The best part about the movie is that throughout the movie, they show clips of the real people and their reactions to the first event (a call to a late night DJ show) that set things in motion! It's all over you tube but since it has been said that those who watch the videos die (in a ring-type manner), I have decided not to venture that way! I ain't ashamed to admit it...I'm just too scared!",
         "This film chills with ideas and suggestions more than with visuals and gore or straight action. The director, IMO, does a great job with a modest budget and pulls out a bag full of skillful director's tricks (lighting, camera angles, shadows, color variations, etc) to achieve his ends. When there is an effect, it happens in shadowy spots of the screen image, reinforcing a spooky ambiance in the film. One of the best low-budget/minimal-FX films I've seen in years. It worked for me. My hat is off to the director/writers and actors for a job well done.",
         "What was enjoyable about this movie for me was that the (HD?) camera work was clean and nicely composed, the direction and acting was entirely competent and the editing was cool too, in what I imagine was a film with a relatively modest budget. A pleasant change from average Hollywood. It was made by people with a real feeling for film. Mariah Bonner as the librarian was a bonus who definitely did not hurt the eyes. Shame she was an early victim. The story wasn't great, though it exploited common enough fears of things that are half-seen (or were they there at all?), and move in the night (as opposed to go bump in the night). And the placebo effect is undoubtedly real, though whether it's killed anyone is questionable, I'd say, certainly in Western cultures. I did once see a shadow person in bright daylight (or did I?). I was about three at the time, and lying in bed. The shadow of a figure ran across the wall, flowed into a shallow recess, slid behind a wardrobe, came out the other side, and vanished. It was more scary than Shadow People, and as you can tell, I haven't forgotten it. However, the good news (for anyone who's worried) is that it hasn't reappeared since, and 70+ years later I'm still here.",
         "What is this movie really about? I don't think it knows. Is it a horror movie? Is it a suspense thriller, a mockumentary or a based on a true story drama? It's no genre busting masterpiece just a movie that doesn't know what its own genre is. Is this a movie about the man or about the shadow people? Is it a warning to mankind or an admission of fraudulent behaviour and a portrayal of questionable character? No. it's a move that doesn't even understand it's own message. Is it a movie that leaves us with questions about what really happened or about the nature of the universe and how we really understand? No, it's a movie that leaves us with the question why? Why did anyone bother to make a film about something they clearly have no understanding of or belief in? I suspect half way through the process the director lost faith in his message so meandered between believer and skeptic. The 'real' footage of interviews with the original people was weak and completely pointless. None of them had anything to say either way and all seemed to be quite confused as to why there were being interviewed at all. It's a very weak movie that doesn't deserve your time.",
         "Cons:About One third of the Movie is so dark That you can Barely tell whats going on. Charlie's constant smoking adds nothing to the Movie. The sudden cutaways to Real Footage is confusing and somewhat aggravating. It should be either a documentary or a Movie. I rented it assuming it would be scary(Its in the Horror Category on RedBox) but this yawner couldn't scare a 4-year-old. One main problem is that other than a few Brief glimpses of Moving Shadows, there is no real Monster or Villain. The people just act scared and make noises like they're being choked, and the next thing you know, The reporter is reporting that They're dead. I also don't understand the connection between the Experiment with the Door and Shadow People. Charlie and The Woman act like this is Very Important. Lastly, I'll emphasize that this movie is not scary. There is no Scratching at the door, or Monster under the Bed. I would recommend picking another movie If You're Looking for a Scary Thriller.",
         "I am a big horror movie fan. I've probably seen too many for my own good. That said, this one is one of the better that have been released in the last few years. It blends aspects of both supernatural and psychological thrillers. The family aspect of the film is underwhelming, and not as well done as other horror films such as The Possession, but the rest of the movie is what this flick is about. Telling the story of a late night paranormal radio host, the main character Charlie runs into some strange happenings when he gets a mysterious call and then a mysterious package from a young man who claims to be seeing shadow people. The rest of the movie builds from there until the end, which was more than satisfying. I would recommend this to any person who wants to get some good chills, see into the human psyche when dealing with fear, or get their girlfriend creeped out to get a bit closer! Awesome. Just bought it on blu ray.",
         "When people who make movies go out of their way to tell the audience that their movie is based on actual events, they set themselves up for criticism from people who want historical accuracy. \"Shadow People\" is another movie that unnecessarily chooses to go that route. This movie was plenty scary, and could easily have stood on its own merits without having to play the \"based on a true story\" card. I am reminded of two other movies that did this: The Fourth Kind, and Phantom. Both went out of their way to tell the audience that their stories came from factual history, and both received a hefty backlash of negative reviews from audience members calling the movie makers out on their claims. Any of these movies would have been better if presented purely as fictional entertainment. If you can put aside this aspect of \"Shadow People\", you will be in for a decent flick, both chilling and eerie.",
         "I never rate anything 1 star, but this movie has got to be the worst movie ever. I would be embarrassed to be the directer of this movie. I saw it not too long ago, but I still can't remember anything about it because it was that bad. There is nothing else to say but I have to write 5 lines so... um... well... saw is a good movie I surest you hmm...",
         "Very few movies are done as well as Shadow People! Great story, and the fact that it is believable instills fear. The story moves along at a good pace. You MUST watch this flick through the first set of credits in order to get the last jolt! I have friends who refuse to watch this movie due to fear of the dark! I loved it, and my skin crawls with just the thought of it! Great job & thank you!",
         "Ignoring the crappy special effects for the \"shadows\" themselves or the overused \"jump scares\" (which got old after the first two jumps), they actually end up explaining the whole shadow people bit scientifically. Well that was frackin fun. Sitting through an hour to realize that the whole movie is based on boring real life disease. There is no horror in whole movie, instead we get a weird fake documentary mix that just makes you wanna punch the director in the mouth. 4/10 (Four cause the premise would've worked well in a good horror movie)",
         "A radio talk show host (Dallas Roberts) unravels a conspiracy about encounters with mysterious beings known as the Shadow People and their role in the unexplained deaths of several hundred victims in the 1980s. I had never heard of shadow people before this film, but a little search turns up two things: they were featured in \"John Dies at the End\" and on the radio program Coast to Coast AM. Now, I will have to assume that the \"John Dies\" is a coincidence, but there is obviously a Coast to Coast connection since this film focuses on a late night talk host... nicely done, folks. And thank you for not making him as wacky as Art Bell. This is a fine effort from Matt Arnold, who has not really made a name for himself in film just yet. Could this be his big break? Perhaps. I missed an opportunity to chat with Arnold, and that is unfortunate... I would love to know about his work on \"Jackie Brown\".",
         "This gets a eight out of ten for a job well done. It wasn't perfect and it didn't blow my socks off, but it was a solidly good movie. This entire movie was on the power of suggestion, which is what the Placebo Effect is, you are told that a sugar pill is an aspirin so you believe it'll stop your headache and it does. Mind over matter - so to speak. The effects weren't cheap, but they weren't top of the line at all. The effects were just above passable, so it does not take away from the movie. The sound work was great and they did a good job with suspense. The shadow people, is a very special subject, as the stories have been around since the beginning of time, so much so, that it almost hardwired into our DNA. Our instincts since birth and as kids, tells us that fear of the dark is not from disorientation or worry that we cant see, so we cant function; we are afraid because somewhere deep in our subconscious we know that there is something in the shadows - there ARE things that go bump in the night and many of them we can't see, especially in the dark. This movie explores some of that, using both film and actual found footage. I would love to see more movies on the subject and more movies about the Mothman. These movies tease us and introduce us but they never really take us on a good journey. We never really fully explore, and that kind of gripe is what took a star or two from the movie, that and how the CDC lady figured it all out, without any actual proof that the power of suggestion is the cause and the cure. I definitely find movies like this better than movies like Paranormal Activity. Watch it alone in the dark or with friends, but not during the day or when the lights are on ... and sleep tight. Don't stare into shadows and don't think about the shadow people.",
         "I have heard the scary stories of shadow people for quite a while now, so when I saw this movie I was very excited to delve right in. Unfortunately, I pretty disappointed. The film started out pretty well, giving us little glimpses of what was to come. However, the outcome wasn't presented well. The scares are far and few in between and only one is memorable. The writing and directing was good, even with the hidden messages throughout the film (the main reason I gave it a 4 instead of a 3). The acting, not so much. Sometimes it felt rehearsed and even in a few moments it was overacted, and to me this was a problem with the film. There were some interesting moments, but not enough to really keep my attention. My biggest problem with this film was a plot hole, and a pretty obvious one. I clicked on the \"Contains Spoilers\" box just in case, but I don't want to reveal anything if I can help it. All I will say is that the plot hole is with the film that they find, and the theory the doctor gives and how that it doesn't fit. To me that was the biggest downfall of this film. I didn't really enjoy it and probably wouldn't recommend it either.",
         "Well the plot device of the film (recreations by actors of \"actual events\" counterpointed with video/audio tape/film of the \"real life\" people who allegedly experienced them) is lifted whole cloth from The Fourth Kind. There's a scribbled sketch of a shadow person in a notebook that looks a lot like the sketches John Klein's wife made of the Mothman before she died in The Mothman Prophecies. The CDC researcher is named Lacombe, the same name as the UFO researcher in Close Encounters of the Third Kind. The darting shadows, electronic noise, and images in the static on the television screen are taken from White Noise. The notion of terrifying death as the result of watching a film is taken from The Ring. I could list more, but this should be enough to demonstrate there isn't a single original idea in the film. What a waste.",
         "This was an interesting little movie. The acting was pretty B grade, and that's probably putting it nicely, and I'm not sure why they added the sub plot of the separated family, but the subject matter was interesting enough that I kept watching despite all that. And yes, I did get the shivers more than once and hope that I won't be thinking about this movie when I go to sleep tonight!!! It's also making me want to research it more, to see if this really did happen... Although I notice at the end they say the radio guy died in 2010, and the question arises, well why didn't the shadow men come for him seeing as he was thinking about them oh so much??? But nevertheless, interesting to watch despite it's flaws..."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Infinity Media",
         "Upload Films"
      ],
      "summaries": ["A radio talk show host unravels a conspiracy about encounters with mysterious beings known as The Shadow People and their role in the unexplained deaths of several hundred victims in the 1980s."],
      "budget": 0
   },
   "movielensId": 121787,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-03-17",
      "dvdReleaseDate": null,
      "directors": ["Matthew Arnold"],
      "runtime": 89,
      "movieId": 121787,
      "title": "Shadow People",
      "mpaa": "PG-13",
      "actors": [
         "Dallas Roberts",
         "Alison Eastwood",
         "Anne Dudek",
         "Mariah Bonner",
         "Mattie Liptak",
         "Christopher Berry",
         "Jonathan Baron",
         "Tony Schiena",
         "Ritchie Montgomery",
         "Marco St. John",
         "Han Soto",
         "Billy Slaughter",
         "Angelena Swords",
         "Bryan Massey",
         "Gary Grubbs",
         "Raeden Greer",
         "Jaqueline Fleming",
         "Debby Gaudet",
         "Claudia Coffey",
         "Monica Acosta"
      ],
      "imdbMovieId": "1764647",
      "originalTitle": "Shadow People",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["mdsV6wEAQ-k"],
      "plotSummary": "A radio talk show host unravels a conspiracy about encounters with mysterious beings known as The Shadow People and their role in the unexplained deaths of several hundred victims in the 1980s.",
      "tmdbMovieId": 176570,
      "avgRating": 2,
      "releaseYear": "2013",
      "numRatings": 20,
      "posterPath": "/DclkCjLsZz3IEV8hxnt9U31b7X.jpg"
   }
}