{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "middle age",
            "id": 176793
         },
         {
            "name": "sugarcane",
            "id": 197810
         }
      ],
      "imdb_id": "tt0053321",
      "video": false,
      "title": "Summer of the Seventeenth Doll",
      "recommendations": [],
      "backdrop_path": "/lgIdhU2hgA8VQRFIOcxw1qWZ857.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Roo",
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e150529",
               "name": "Ernest Borgnine",
               "profile_path": "/kQhcGAc2TgohrvLZSYapT2SHRby.jpg",
               "id": 7502,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Olive",
               "gender": 1,
               "credit_id": "52fe4a63c3a368484e15052d",
               "name": "Anne Baxter",
               "profile_path": "/jOnJoazpO6q2vAVL37IQfzQbjav.jpg",
               "id": 10606,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Barney",
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e150531",
               "name": "John Mills",
               "profile_path": "/5MiJRQj6irdxqCtAhX00YWqmGjZ.jpg",
               "id": 11859,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pearl",
               "gender": 1,
               "credit_id": "52fe4a63c3a368484e150535",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Vince",
               "gender": 2,
               "credit_id": "58c9ce70c3a36841820005a3",
               "name": "Frank Wilson",
               "profile_path": null,
               "id": 75403,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Bluey",
               "gender": 0,
               "credit_id": "58c9ced1c3a368412a000600",
               "name": "Deryck Barnes",
               "profile_path": null,
               "id": 94808,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Emma",
               "gender": 0,
               "credit_id": "58c9cf889251415d9100067a",
               "name": "Ethel Gabriel",
               "profile_path": null,
               "id": 1777290,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e15053b",
               "name": "Leslie Norman",
               "profile_path": null,
               "id": 82334,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a63c3a368484e150541",
               "name": "John Dighton",
               "profile_path": null,
               "id": 11995,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.427417,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 121369,
      "vote_count": 2,
      "budget": 0,
      "overview": "Ray Lawler's hit play inspired this poignant drama about the need to accept middle age despite the longing for youthful passion. The ensemble cast includes Ernest Borgnine and John Mills as Roo and Barney, who get a dose of reality during a holiday. Roo and his longtime girlfriend, Olive (Anne Baxter), cope with changes in their relationship while Barney tries to adjust to new paramour Pearl (Angela Lansbury) after his girl marries another man.",
      "similar": [
         9555,
         26405,
         4657,
         28178,
         68718,
         397422,
         13523,
         862,
         9659,
         8810,
         9355,
         8839,
         2759,
         36040,
         20453,
         19913,
         23168,
         40807,
         858,
         1374
      ],
      "original_title": "Summer of the Seventeenth Doll",
      "runtime": 93,
      "poster_path": "/41h6QqFkbJ6hZX4RY0gxifGs6Bh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Hill-Hecht-Lancaster Productions",
         "id": 14269,
         "origin_country": ""
      }],
      "release_date": "1959-12-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "That was her great longing...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Leslie Norman"],
      "runtime": 93,
      "synopsis": "Two men continue a traditional summer rendezvous only to discover that life has changed for them all.",
      "writers": [
         "John Dighton",
         "Ray Lawler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053321/",
      "coverLink": null,
      "actors": [
         "Ernest Borgnine",
         "Anne Baxter",
         "John Mills"
      ],
      "reviews": [
         "Many years ago I unwisely took part in an amateur production of Thornton Wilder's \"The Matchmaker\". I can still hear the mayhem created by those of us who tried, and failed miserably, to achieve an American accent and those (including, bizarrely, a stray Welshman) who just gave up and spoke their native idiom. Luckily out home-town audience was very forgiving and the local rag took pity on us. This dire experience came back to me when I saw \"Summer of the Seventeenth Doll\", but even so, not having seen the original stage play by Ray Lawler, I didn't realise how badly it had been butchered until I saw a TV performance by the Melbourne Theatre Company. The first reaction of an Australian audience will be to switch off because of the hilarious mangling of their native speech by an all-star cast who deserved better and would have been more gainfully employed on another project. Maybe that wouldn't matter to a foreign audience, but then again, perhaps the resultant strange mixture of assorted Cockney, Bronx and other sounds would have a subtly disturbing effect on any listener. Of more concern is the fact that the play's essence can't be divorced from its Australian roots, which include deceptively dry, laconic and understated speech cadences, without making it pretty meaningless. In fact it's the very antithesis of the overwrought, borderline- histrionic style of \"serious\" Hollywood films of the era. Anyone less like a laconic Queensland canecutter than the furiously emoting Ernest Borgnine would be hard to imagine. And switching the location from Melbourne to more photogenic Sydney settings, while trivial in itself, is symptomatic of the filmmakers' imperfect understanding of their vehicle. I don't know that \"Doll\" is a great play, but it is a good one. However, given the need for some audience-pulling names there was no real prospect of doing it properly in 1959. The accent problem, which is just part of the underlying cultural mismatch, is not to be dismissed, and I've never heard an American or British actor come close to a convincing Australian accent - even Meryl Streep. Even nowadays, with many high-visibility Australians in Hollywood, it would be a problematic vehicle because at bottom it's pretty stagy. It's just one of those movies that shouldn't have been made.",
         "At first glance it seems odd that a play set in a single room in the Melbourne suburb of Carlton in 1953 would have inspired Hollywood to turn it into a movie. At the heart of Ray Lawler's play is the story of people who have a unique relationship, but are aging and trying to recapture happier times. The play had a terrific sense of nostalgia, and the annual gift of the kewpie dolls were sad symbols of a time that was ending. Finally, the characters must come to terms with what they want from each other or what they can never receive. Although the setting is Australian the emotions are universal. There were many changes for the film. Some may have actually tightened the drama: the conflict between old friends Roo and Barney starts much earlier and the character of Dowd is given more to do. However the Luna Park sequence is heavy-handed and the ending is softer. Ernest Borgnine gave a passionate performance as Roo, but he struggled with the accent and he was never laid back enough. Australian Vincent Ball who played Dowd probably could have played the part, but he was hardly international box office. A year later, in \"The Sundowners\", an American star did play the type of Australian represented by Roo - Robert Mitchum. He got the accent about right, and he caught the tone; what might \"Doll\" have been with him in the role? Anne Baxter fared best. Although the accent slipped here and there, she created a warm and disarming Olive. The accent probably would have been pretty close four years later after she had lived that time on a property near Gloucester in NSW with her American husband. She was a brilliant woman on many levels who wrote of her experiences in \"Intermission\" - a fascinating outsider's view of life in rural Australia in the early 1960's. Accents aside, John Mills seemed a little too hyper anyway, but Angela Lansbury otherwise hit the right note as Pearl. The whole production has the feel of a British Ealing production, especially Benjamin Frankel's score, which is similar to his work for British films. The location was changed to Sydney opening the action out from the play. The exterior of Olive's house was in Glen Street, Milsons Point - the whole street is now high-rise apartments and office blocks although the view over Luna Park can still be recognised. I still find the film interesting, flaws and all. Both play and film are set in an Australia that is hardly recognisable now, but both capture feelings of loss and fear of change that are as relevant today as they were then.",
         "Ray Lawler's play about two tempestuous sweetheart couples coping with the layoff season in Sydney, Australia comes to the screen without much humor and a misguided heart. Sugar cane cutters Ernest Borgnine and John Mills take Kewpie doll collector Anne Baxter and manicurist Angela Lansbury to South Australia to rest up and look for holiday work--but trouble brews with Borgnine, who has mysteriously left his job after fifteen years. Practically without plot, this character study has become, on film, a visual journey rather than an emotional or personable one. Paul Beeson's cinematography is certainly striking, even as the entangled relationships and mercurial tempers at the forefront of the story quickly wear themselves out. Forget about accents, these actors (interestingly, if unsuccessfully, cast) don't even look like Aussie natives. Borgnine's strong sense of character and natural way with a complicated chunk of dialogue nearly saves him, but it was a fundamental error to surround these stars with unknown players who really do sound like Australians. The lively section at the amusement park is full of raucous vitriol and Beeson's playful visual composition, but every scene back at the boarding house is a lost cause. A very strange project, indeed. ** from ****",
         "I recently watched this movie, believing it was an important Australian contribution to the world of cinema. How wrong I was! It certainly is a well-known film, but perhaps that is only because of the play on which it is based received much publicity. Or perhaps because of its leading cast of well-known Hollywood etc stars. This movie, originally titled \"Summer of the 17th Doll,\" was in my opinion very disappointing. Firstly, I found the sound so distorted it was difficult to understand the dialog. The accents, mentioned here by other reviewers, were deplorable, and I will never understand why Australian actors weren't used in an Australian working-class story. I suppose the producers wanted \"big names\" in the important roles, but as hard as they tried, most of the cast never sounded convincingly like Aussies, so all I heard was a changing jumble of false working- class English accents. The movie itself had some welcome humorous moments, if one could ignore the above comment, and the story line was interesting and believable. What was UNbelievable was the exaggerated and histrionic reactions of the characters to their every frustration. I expected more than melodrama from actors of this calibre. It could have been so much better.",
         "The single most obvious problem with this film is that you have to go so far down the credits before actually finding an Aussie. The four leads, the old lady, Bubba, even the boxing promoter are all foreign actors. I can vaguely picture a big dumb Yank as played by Mr Borgnine doing some work as a canecutter, but John Mills just doesn't look the part. I have watched him in so many movies and this is probably the first I have ever thought him miscast. If you are from Sydney there is some great footage of Luna Park in its former glory, the old ferries, Central Station and so on. I believe the play is a mix of humour and drama but there is very little humour in this film. Anne Baxter is probably the best of the four leads, playing a rather desperate sweetheart. Vincent Ball's character is a little too smarmy and one is left wondering why anyone would find him appealing. It would be very interesting to see a remake with Australian actors in it, although it's doubtful whether the era could be captured as well again. Watch the movie for the locations but don't expect too much from the performances.",
         "I read with some interest the comments by Aussie reviewers on this film before writing my own review. They seem to think the spirit of Ray Lawler's play was cut right of the film version of The Summer Of The 17th Doll. My own view just as it was the producer's choice to hire American and British leads it was also his choice to bow to American censor requirements and omnipresent Code still in force. I sympathize with the the Aussies who complain that one of their own should have been in the lead. Certainly Chips Rafferty who was the biggest name in Aussie cinema at the time could have taken Ernest Borgnine's part. He sure had the size for it. Summer Of The 17th Doll casts Borgnine and John Mills as a pair of sugar cane cutters who are now at liberty as the occupation is seasonal. Borgnine's size and strength make him respected while Mills reputation and identity come from his love 'em and leave 'em attitude with women. Both have their steady girls Anne Baxter and Angela Lansbury as anchors of a sort. But these two women are getting tired of being a pair of Adelaides for their Nathan Detroits. Plain and simple these two won't acknowledge they're not young any more. Plain and simple they won't grow up. And that's a universal situation not necessarily an Australian one. If Summer Of The 17th Doll were remade today I can see Nicole Kidman as one of the women and Guy Pearce as one of the men. And the Code restrictions would be off. Still while it's not all it could be, Summer Of the 17th Doll is a fine bit of film making.",
         "I Have read the play and seen the film, Ray Lawler wrote the play extremely well. He did something interesting, in writing the play with accents. This is something i haven't seen before. Leslie Norman however did a poor adaptation of the text version, simple things like getting the city wrong that the play was set in and Australian accents. The accents were bad, the actors did not even seem to try to talk like an Australian. Ernest Borgnine was the main culprit. He had a full blown yank accent happening during the whole film. This film was a waste of my time, and a waste of everyone else's time who has ever watched it. I does not even deserve a 3 out of 10.",
         "It's odd that in this Australian film set in that beautiful country that none of the stars are, in fact, Australian! You've got two Americans (Ernest Borgnine and Anne Baxter) and two Brits (John Mills and Angela Lansbury) starring in this one! Sadly, the Aussie actors just weren't all that famous at the time and in a bid to get international box office money, they cast foreigners in this very Australian tale! If made today, at least they could have used Paul Hogan or Dame Edna, as they both are known internationally! Sadly, Borgnine sounded about as Australian as Charles Boyer, though the others at least sound reasonably good to this untrained ear. As far as the story goes, it's about a couple guys who work the cane fields and then come back to the big city to have a good time with their mistresses. Not especially bad or good...and a film that never really impressed me one way or the other. This, combined with the casting, make this one I could easily have skipped.",
         "Ernest Borgnine and John Mills star in this butchering of the Ray Lawlor play about cane cutters in the off - season. Borgnine, known at the time as the star in \"McHale's Navy\", is the middle aged labourer (actually about 33 years old or so in the play) past his prime and Mills is his mate. Angela Lansbury plays herself as a widow replacing Mills' girlfriend. In the play she was more salty than high class. In the play, \"Barney\" - played by Mills - was still a fairly young man (still in his mid-ish twenties). There is an odd scene where Bubba, the young ingenue is a barmaid filling up schooners with dregs (a Scottish bar ?). Product placements - Peters Icecream (twice), Brylcreem, Toohey Old (twice), TAA (airlines), Tooths (beer) and Bex (twice - aspirin)."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Hill-Hecht-Lancaster Productions"],
      "summaries": ["Two Australian sugarcane cutters spend their annual five-month vacations in Sydney with their mistresses."],
      "budget": 0
   },
   "movielensId": 121855,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-12-01",
      "dvdReleaseDate": null,
      "directors": ["Leslie Norman"],
      "runtime": 93,
      "movieId": 121855,
      "title": "Summer of the Seventeenth Doll",
      "mpaa": null,
      "actors": [
         "Ernest Borgnine",
         "Anne Baxter",
         "John Mills",
         "Angela Lansbury",
         "Frank Wilson",
         "Deryck Barnes",
         "Ethel Gabriel"
      ],
      "imdbMovieId": "0053321",
      "originalTitle": "Summer of the Seventeenth Doll",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Ray Lawler's hit play inspired this poignant drama about the need to accept middle age despite the longing for youthful passion. The ensemble cast includes Ernest Borgnine and John Mills as Roo and Barney, who get a dose of reality during a holiday. Roo and his longtime girlfriend, Olive (Anne Baxter), cope with changes in their relationship while Barney tries to adjust to new paramour Pearl (Angela Lansbury) after his girl marries another man.",
      "tmdbMovieId": 121369,
      "avgRating": 0,
      "releaseYear": "1959",
      "numRatings": 0,
      "posterPath": "/41h6QqFkbJ6hZX4RY0gxifGs6Bh.jpg"
   }
}