{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "israel",
            "id": 536
         },
         {
            "name": "egypt",
            "id": 1160
         },
         {
            "name": "religion and supernatural",
            "id": 3684
         },
         {
            "name": "epic",
            "id": 6917
         }
      ],
      "imdb_id": "tt0053290",
      "video": false,
      "title": "Solomon and Sheba",
      "recommendations": [
         43012,
         75130,
         52772,
         28758,
         80027,
         42668,
         27505,
         35009,
         36677,
         119819,
         37222,
         23356,
         50153
      ],
      "backdrop_path": "/cOi8BwdlT58goH3HDQfSx4FqiEo.jpg",
      "revenue": 12200000,
      "reviews": [{
         "author": "John Chard",
         "id": "55d97eafc3a36831f40044f6",
         "content": "It is said that Solomon is wise. But no matter how wise he may be, he is still human, with a human weakness.\r\n\r\nSolomon and Sheba is directed by King Vidor and collectively written by Anthony Veiller, Paul Dudley, George Bruce and Crane Wilbur. It stars Yul Brynner, Gina Lollobrigida, Marisa Pavan, George Sanders, David Farrar, Harry Andrews, John Crawford and Laurence Naismith. Music is by Mario Nascimbene and cinematography by Fred A. Young.\r\n\r\nA fictionalised screenplay cribs from parts of the Bible, where the story here follows the relationship between Solomon of Israel and the Queen of Sheba, a problem because initially Sheba is in league with Israel's enemy, Egypt. All that and Solomon has to deal with his nefarious brother, Adonijah, who is a little miffed that Solomon has inherited the crown of Israel. \r\n\r\nFamously it was the production that saw the sad death of the leading man, Tyrone Power, while Vidor was so disillusioned about the whole film he quit making feature length films. It's a very mixed bag, very much showing the good and bad sides of the big historical epics that dominated Hollywood back in the day. In part it's a grandiose melodrama, in others it's cheap looking and given to campy histrionics (the orgy operatics sequences are just awful), while the screenplay jostles with itself as to being biblical blarney or potent pontifications.\r\n\r\nCostuming and colour photography smooths the eyes, but then the optical nerves are shredded by set design so poor a child making paper mache boulders could have done better. The cast are also in and out, Brynner is fine as Solomon (broody, brainy but troubled), as is the lovely Lollobrigida (stoic, smart and sexy), but the support slots barely convince. Sanders is badly miscast as Solomon's warrior brother Adonijah (he was 53 at the time), 10 years earlier in Samson and Delilah his villain turn worked, but not here.\r\n\r\nSword fighting choreography is poor, as are the miracle effects work, but conversely the big battle that crowns the story is smart in writing and in execution, where not even the model work can dim the thrill of it all. Released in the same year as Ben-Hur obviously does it no favours by comparison! But then so many other big swords and shields epics would also struggle as well. Vidor's movie is just above average in the genre pantheon, but the faults are irritable and hardly render it as a must see film for genre enthusiasts. 6/10",
         "url": "https://www.themoviedb.org/review/55d97eafc3a36831f40044f6"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Solomon",
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d519",
               "name": "Yul Brynner",
               "profile_path": "/bRA6b94H7Aak8PESLbtJ5LzHATU.jpg",
               "id": 14528,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sheba",
               "gender": 1,
               "credit_id": "52fe4609c3a368484e07d51d",
               "name": "Gina Lollobrigida",
               "profile_path": "/eTS3APBHcmbfJhXYa5qDnj0Fddx.jpg",
               "id": 19534,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Adonijah",
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d521",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Abishag",
               "gender": 1,
               "credit_id": "52fe4609c3a368484e07d525",
               "name": "Marisa Pavan",
               "profile_path": "/mjwKdJqaa2wvo5yG48b4TLA30EG.jpg",
               "id": 117617,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Pharaoh",
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d529",
               "name": "David Farrar",
               "profile_path": "/il0n5aLYEB9ahGAcJJDXrI08O0R.jpg",
               "id": 91617,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Joab",
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d52d",
               "name": "John Crawford",
               "profile_path": "/wyBwzmRGML0PoIxJ2DnQAOBgmqu.jpg",
               "id": 15693,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d531",
               "name": "Finlay Currie",
               "profile_path": "/4ezZVGhlabVRIeavptVayV1VJGC.jpg",
               "id": 10027,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Baltor",
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d535",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Ahab",
               "gender": 2,
               "credit_id": "55759d839251413fd2003ca4",
               "name": "José Nieto",
               "profile_path": "/kYSao5l51IRxv0svjYBTsXfuBlV.jpg",
               "id": 14822,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d509",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d50f",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4609c3a368484e07d515",
               "name": "Anthony Veiller",
               "profile_path": null,
               "id": 67447,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.541631,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29996,
      "vote_count": 16,
      "budget": 5000000,
      "overview": "Under the rule of King David, Israel is united and prosperous although surrounded by enemies including Egypt and its allies. The aging King David favors his younger son, Solomon, as his successor, but David's  elder son Prince Adonijah, a warrior, declares himself King. When David learns of this, he publicly announces Solomon to be his successor. Adonijah and Joab, his general, withdraw in rage. Israel prospers under King Solomon's wise and benevolent rule and is seen as a threat to more tyrannical monarchs in the region. The Pharaoh of Egypt agrees to cede a Red Sea port to the Queen of Sheba in a plot to undermine Solomon's rule. Sheba is to seduce Solomon and introduce Sheban pagan worship into Jerusalem. Meanwhile, Prince Adonijah, now banished, also conspires with Pharaoh and is given an army to defeat Solomon. The film is a highly fictionalized dramatization of events depicted in The Bible -- First Kings chapter 10 and Second Chronicles chapter 9.",
      "similar": [
         6844,
         10661,
         612,
         409,
         564,
         85,
         691,
         1495,
         9334,
         1734,
         1966,
         18,
         652,
         665,
         947,
         597,
         205584,
         8329,
         346,
         9552
      ],
      "original_title": "Solomon and Sheba",
      "runtime": 139,
      "poster_path": "/dDDSs4DSVBTG5s452w5IMZpZYHb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Edward Small Productions",
         "id": 13479,
         "origin_country": ""
      }],
      "release_date": "1959-12-25",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Only once in 3000 years...anything like...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["King Vidor"],
      "runtime": 141,
      "synopsis": null,
      "writers": [
         "Crane Wilbur",
         "Anthony Veiller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053290/",
      "coverLink": null,
      "actors": [
         "Yul Brynner",
         "Gina Lollobrigida",
         "George Sanders"
      ],
      "reviews": [
         "Holy Cow! I watched \"Solomon and Sheba\" the other day on TCM, and I totally LOVED it! It is very Biblically inaccurate (there was NOTHING between Solomon and the queen of Sheba, just a conversation!), but a lot of fun! Yul Brynner is one of my favorite actors to watch on screen; he is sexy, charismatic, over the top, and has that whacked out ambiguous accent. His ability to believably play just about any nationality and role is very evident in his role as the Hebrew king in this film; even though he seems a little out of place. I wonder why they chose him to replace Tyrone Power? Is it just me, or did he never smile in this or any other movie? Sexy!!!!! Gina Lollobrigia is waaaaaaaaaay hot in this movie! As the erotically inclined, temptress queen, she heats up the screen and blows everyone else out of the water! She and Brynner look very good together, and their love scenes are some of the HOTTEST I've seen in a 50's movie (especially the incredible steamy one at the pagan orgy-WOW!)! Gina has Vulcan eyebrows! I've never seen her in anything else, but I hope I can! She's as va-va-voom as Sophia Loren! Other than these two hot actors, everybody else in the movie SUCKS. George Sanders is like a dull imitation of a villain-yawn! I got bored with the overlong battle scenes, most of which had no Historical basis at all! Errrrrggh! Overall, I give \"Solomon and Sheba\" an 8 out of 10, it should be a 6 but the sexiness and eroticism of the love story brings it up to an 8. If you like pointless epics with some sexuality thrown in, then I definitely recommend this movie to you. It is a great way to waste a boring afternoon alone!",
         "I saw this on its original release as a child. My mother, a great movie buff, was greatly excoriated by other members of the family for taking me along when she went shopping in downtown Manila and decided to see it. The reason? It was classified as either for adults only or more likely as \"Objectionable in part for all\" by the Legion of Decency. Why? There was this exotic belly dance by Gina Lollobrigida. Then there was this bathing scene which although did not show much skin had her rising out of the pool while her serving maids obstructed the view with a large cloth. As she wrapped the cloth around her shapely body, she said in a very sexy voice and tone: \"Dry me.\" I narrated this scene to my poor friends who couldn't afford to go to a first run movie but they didn't get excited. I saw a re-run of the movie on a religious channel recently and I didn't see the belly dance scene. This is the only other movie where I saw Yul Brynner with hair. He also had hair in The Sound and the Fury. But now let's get serious. There is no mention in the bible of the Queen of Sheba as a temptress and spy for the Pharoah. All it says is that she was an admirer of Solomon who brought him lots of valuable gifts when she visited him to learn from his wisdom. If there should be a re-make of this film, it is suggested that Sheba be played by a black actress as we now know that Sheba was in what is now modern Ethiopia and even in those days, the inhabitants of that area were black. Also, Sheba was not the name of a queen but of the country that the \"Kandake\" (a title from which the name Candace is derived) ruled. Other than her title, therefore, we do not know the name of the Candace of Sheba.",
         "King Vidor, one of the most famous figures in movie history, the director of Tolstoy's classic on screen (WAR AND PEACE), was not known for making biblical epics. Nobody associates him with this genre that much as we do Cecil B DeMille or D.W.Griffith, for instance. Yet, his last film, SOLOMON AND SHEBA, has a straight reference to the Bible. Nevertheless, the movie can hardly be seen as a biblical epic due to one important factor, its content. Solomon...what can we say about him from the Bible?...a famous third king of Israel (after Saul and David), a man known for exceptional wisdom, a builder of the splendid first temple of Jerusalem... there is indeed much about him in the Old Testament. But Sheba? All we know is that she, as a queen of a distant land (today's Yemen), paid a visit to Jerusalem in order to see the splendor of the city and of the entire kingdom as well as to admire the wisdom of its king. However, what we find in the movie deals primarily with Solomon-Sheba relations: first a conspiracy, evil intentions, then weakness, desire, treason, finally sacrificial love and mercy. And now we would have to ask ourselves \"is it a historical movie or a fairy tale with some historically accurate background?\" I think that in order to understand the director's intentions, we have to look deeper at the cinema of that time and King Vidor himself. SOLOMON AND SHEBA with its title refers to a 1951 Henry King's movie, \"David and Bathsheba.\" Making films at that time was much like this: the producers picked up some aspect from history or the Bible and created a movie out of this containing lavish costumes, great cast, campy spectacle but barely any historical accuracy - all for entertainment. And this is clearly noticeable in SOLOMON AND SHEBA. Besides, there is one more factor that helps get the idea of this film...the content of SOLOMON AND SHEBA was partly inspired by a long ago forgotten movie, one of the most gigantic spectacles of all time, still presumed lost, THE QUEEN OF SHEBA (1921) with Betty Blythe and Fritz Leiber. A love affair of the wise Israeli king and an exotic lustful queen was something particularly entertaining for 20th century viewers. Therefore, we cannot treat Vidor's film as a biblical epic, it's only INSPIRED by the Bible. However, while many people concentrate on the film's weak points: inaccuracy, unnatural battle scenes, etc, I rather feel compelled to focus on some of its strong points. It is, indeed, a lavish spectacle. There are many scenes that reveal the spirit of grandeur. Here, it seems necessary to mention the two consecutive moments: Solomon enters the temple of luxury devoted to the only God (he says his famous prayer) and the next moment in the Land of Sheba where its queen is surrounded by the luxurious sets, a dedicated servant and a parrot. This contrast has its roots in one major factor Israel differed from other kingdoms and nations: the Israeli king was a servant of God while other rulers were masters of their own. That was the genius and righteousness of the Israel of that time! Another moment worth seeing is the Israel-Egypt battle and the shields shining in the sun. Quite an interesting idea... The performances are worth consideration. Yul Brynner is different than in his other films (primarily due to hair on his head) but does a nice job as Solomon. He expresses the pride, power, wisdom but also desire that he is driven by. The best scene played by Yul in this movie is, I think, when Solomon is tempted to take part at Ragon celebration. Although virtuous Abishaq (Marisa Pavan) tries to discourage him from joining the orgy, he is not able to listen to her. Consider his face and the whole performance... masterpiece! Gina Lollobrigida plays well but she holds one disadvantage. Most people (particularly men) focus on her sex appeal forgetting that she has one primary task as an actress: to act and feel the role. The similar problem is, nowadays, with Monica Bellucci (also Italian). Men cannot be objective in the evaluation of her performance because the sex appeal steps in and makes them blind to possible shortcomings in acting. I liked Gina Lollobrigida in the role not only because of her beauty but also because of her good acting, sometimes exposed to difficulties! The moment Solomon is making love to Sheba in a cave at the pagan celebration dedicated to god Ragon is quite freely treated for the 1950s... The supporting cast also give memorable performances including George Sanders as Adonija and Harry Andrews as Baltor, the queen's second. I also liked the whole atmosphere. Although there are historical inaccuracies in the reconstruction of Jerusalem, the film has a charm and historical mood. It is definitely not the perfect one but I could not evaluate this as a movie without any entertainment. If it weren't for the ridiculous ending (Sheba miraculously healed and speaking with God Jehova???), the film would be equal to such epics as DEMETRIUS AND THE GLADIATORS (1954), SAMSON AND DELILAH (1948) and THE CRUSADES (1935). It's not that great but, in its inaccuracy, it definitely cannot be compared to Bruce Beresford's movie (1985) since we do not expect the biblical story from SOLOMON AND SHEBA that much as we do from a movie entirely described as a biopic of king David. Not a bad film and worth seeing particularly for epic movie fans. Moreover, it is one of the rare films that shows one down to earth fact: wisdom does not mean that desire is conquered... 6/10",
         "Breathtaking story set in Biblical times with emphasis in lavish costumes and crowds . Justly before his death in ancient Israel King David (Finlay Currie) has a vision from God saying him that his younger son Solomon (Yul Brynner) should succeed him as king . His other son Adonijah (George Sanders) is mean and promises to achieve the kingdom by whatever way . King David names his younger son, Solomon his heir , facing his older son Adonijah. King Solomon acts with wisdom and benevolent and his government is seen as a threat to more tyrannical monarchs in the region . Meanwhile the Egyptian Pharoah agrees to give up a Red Sea port to the Queen of Sheba (Gina Lollobrigida) if she can encounter a manner to overthrow Solomon . Sheba, Pharoah, Adonijah, the leaders of the Twelve Tribes and his own God make life dangerous for Solomon . Meantime the Queen of Sheba arrives in Jerusalem, supposedly for a friendly meeting , Solomon slowly falls in love with her. In fact, the Queen is in covenant with the Pharaoh of Egypt (David Farrar) and her aim is to destroy the twelve tribes of Israel and he utilizes the ambitious Prince Adonijah in her schemes . An overblown all-star treatment of the stories in the Old Testament dealing with David , Salomon , Sheba and Adonijah . Lavish spectacle about Solomon and his lover Sheba based on hokey historical events. Brynner and Lollobrigida play a sultriest couple , including some sexy scenes very erotic for the 50s . Tyrone Power died during the shooting in Spain and some shots still show him , he was replaced by Brynner who remade his early scenes .There's so much visual padding full of armours , weapons, carriages , feathers and crowd scenes . Director Vidor gives this film the feel of a Cecil B. De Mille spectacle , but there is little human touch to any of the deeds. Very good photography in super Technirama 70 by the classic cameraman Freddie Young filmed in Madrid, Valdespartera, Zaragoza, Aragón, Spain . Evocative and impressive musical score by Mario Nascimbene . King Vidor's last movie that is recently restored to 139 minutes . Vidor realized an excellent career plenty of classics as ¨Bird of paradise , Champ , Our daily bread , The citadel , Duel in the sun ; also directed another super-production as ¨War and Peace¨ . Rating : 6 , passable and acceptable.",
         "A heavy budget, a star that died with 75% of the movie completed. Recipe for disaster right, not in this case as Yul Brynner, the \"great bald one\" as he was known , except with hair here makes a convincing Solomon and Vidor scores in his direction. This movie sets itself up from the beginning as the story of two brothers and a case for redemption for that is what this movie is about. Solomon as everyone, Christian or not knows was wise as the common adage states. He inherited the Kingdom of Israel from his father as chosen by God to replace his older brother, the warrior played by the great supporting and sometimes leading man George Sanders in one his nefarious performances. Solomon prays for wisdom which God grants him and Israel prospers. Neighbors become jealous and scared as a redeemed Sanders courtesy of Brynner builds Israel's army to a sizable number. They also fear their teachings of equality to all men and their notion of One God. Sheba is sent or chooses to tempt Solomon with riveting consequences. The problem with these movies in our modern eyes is that the writers have them talk in the way texts and related scriblings depicted dialogue back then which is as poetry with innuendoes and rhyme. This today is often seen as camp, such the case of recent Swords and Sandals like Gladiator avoiding these dialogue. The movie also bears a certain resemblance to De Mille's classic Samson and Delilah which kickstarted the whole genre. That said, a \"Shield of light\" action sequence is worth a look to see how it was staged and shot. Gina Lollobrigida is absolutely stunningly photographed and the performance is quite good. All in the one, one of the master's last can be your first intro into his ouevre.",
         "Solomon and Sheba has come down in Hollywood lore not for the quality of the film, but for the fact that Tyrone Power died while making it. I was in the 5th grade and well remember the huge news for days when that tragedy happened. I didn't know who Tyrone Power was then, but I learned and learned to appreciate the body of his work. I often wonder if Ty had a sense about this film and what a dud it proved. He was the unnamed producer of this as well. Maybe he just didn't want to face the critics. Good thing Power actually went out with Witness for the Prosecution although you can see him in long shots if you look close. What we have here is a biblical stew that probably would baffle the great Solomon himself. Several incidents described in the Bible that the Bible treats separately are woven together into one plot with a few additions tossed in by Hollywood. The actual story about the Queen of Sheba is that she went on a trade mission to the Kingdom of Israel, chatted Solomon up a bit, came back with a lot of trade goods and that was that. The story of a romance between her and Solomon is of legend. The ancient kingdom of Sheba is about where Yemen is now and her people purportedly moved to the African continent which is how Ethiopia was founded. The Queen never witnessed Solomon's famous case involving the two women with separate claims for a baby, nor was she involved with the building of the First Temple. Nor was she around for the destruction of same. For that matter neither was Solomon. And she was not involved in the dispute over the succession when Solomon's brother Adonijah put in a counterclaim. That is the heart of this film. Adonijah upon hearing the news that King David is dying declares himself king. Of course David rallies temporarily and says that God came to him and said Solomon should succeed him. When David hears about what Adonijah did, he says that's what got God all bent out of shape, Adonijah being greedy. After that Adonijah gets to plotting. Things seem to come full circle in that Ty Power collapsed on the set while dueling with George Sanders as Adonijah. Sanders and Power were rivals in many films, most particularly in Lloyds of London which was Power's breakthrough role. If Sanders is not quite the jaded sophisticate he was in Samson and Delilah, he's still Sanders the biblical cad. When Power died Yul Brynner was brought in to play Solomon and given a wig so that existing footage of Power in long shot could be salvaged. Brynner invests the dialog with the proper dignity, but I think he probably regretted doing the pinch hitting. Gina Lollobrigida is the Queen of Sheba and she is alluring as a biblical temptress in the Cecil B. DeMille tradition. She seems not to have any real conviction and my guess is she was shocked at Power's sudden demise and having to do it all over again. Marisa Pavan as Abishag may give the best performance in the film. The real story with Adonijah is not as elaborate as this film. He disputed with Solomon for the succession and gathered around a group of some of King David's court as supporters. Solomon pardoned them once and then Adonijah asked for Abishag in marriage. Abishag in the Bible and here was an adopted daughter of King David in his old age. When Solomon hears that, he decides Adonijah is getting greedy again and has him killed. The Bible mentions someone named Berniah who was going around basically doing contract hits on Adonijah's supporters. What we have in the film is a spectacular climax involving a miracle that I searched for and couldn't find. It came from the fertile imagination of director King Vidor who ended a long and distinguished career on a sour note. It was a question of Vidor trying to out do Cecil B. DeMille in biblical spectacle. He didn't make it.",
         "Right this moment I am watching this movie on TV here in Tokyo. Beautiful scenery, beautiful sets of biblical proportions, beautiful costumes, beautiful color, beautiful Gina. Great climactic scene when God destroys the Sheban idol and a lot more with de Millean thunderbolts at the moment when Yul and Gina are about to consummate their love. Yul does a halfway decent job of delivering his lines, though he sounds a lot like Yul delivering his lines as Ramses or Taras Bulba. George Sanders sounds like George Sanders playing George Sanders. Given the limited range of acting she is asked to display in this role, Gina does a good job, though by the time the movie ends, she is completely converted into a demure remorseful lass and looks likes she might be playing in a biography of Mother Teresa. I guess thunderbolts will do that to you, but it is almost breathtaking how quickly she jettisons her own beliefs for her new religion. The supporting players are mostly awful, lacking credible emotion and timing. The usual big battle scenes, what passed for lascivious dances in 1959, and an orchestra blasting out plenty of trumpet calls behind a huge chorus singing lots of \"Ah's\", but none of it quite of topnotch Hollywood quality. The final swordfight between Brynner and Sanders is at the laughingly low skill level of a junior high school play. The film is one big piece of eye candy but not much more.",
         "Previous reviewers did not like this film, but it kept my attention to the end. Compared to other great biblical spectacles, this one has some true moments, due mainly to the strong cast and the director's restraint. This was King Vidor's final film. Remember, he made \"The Great Parade,\"\"The Crowd\" and other early silent hits. What I liked about this film was Brynner's dignity and kingliness. For someone born a gypsy, Brynner had an innate aristocracy and gravitas; in any scene, he holds your attention and roots the action. And he could deliver the lines elegantly. Could you imagine Tyrone Power in this role? It would be a bit of fluff by comparison (remember him as the feckless husband in \"Witness for the Prosecution\"?), or perhaps, one might say, Power would have been an equal to George Sanders'surface play of the role. Another thing going for the film is the consistent delivery of lines by all the actors. Most of the other players were English (Harry Andrews, David Farrar) or Italian (Lollobrigida, Pavan), or foreign, and that gave the dialogue a certain musicality. If all actors had been been \"amurican,\" the tone of the dialogue would have been flatter and much less interesting to listen to. Probably the weakest actor was Lollobrigida, with her masklike visage. She delivered her lines credibly, but there was really no frisson between her and Brynner, (certainly not as there was between Brynner and Deborah Kerr), so that the love scenes came across as a tad dull. As for the combat and action scenes, Vidor's background in silents shows in the way he holds back with the soundtrack, even as horses, chariots and warriors are running headlong over a cliff. The final sword fight between the brothers was certainly no 10-minute \"Prisoner of Zenda\", but it was not the fighting itself that was important, but the confrontation between the brothers themselves, reliving the Caine and Abel tragedy. The director is presenting the story as a parable of a failed brotherhood (regardless of how it jives or not with the Biblical text or historical accuracy) that bows before allegiance to a single God and social covenants, so the action is on a straight and simple level that some viewers may find too simple. This sense of the parable guides the actors' delivery of their lines, all with a distinctly measured rhythm that some may consider artificial, and others elevating, as if it were verse. One can compare Vidor's approach in this film with the many other Biblical spectacles before and after (such as \"David and Bathsheba,\" \"Ben Hur,\" even \"Spartacus\"), and this movie comes out very \"clean\" in the battle scenes and refusal to focus on the blood and gore of battle. Vidor's pacing in the dialogue (not quite Shakespearean, but close to it) is consistent with the overall sense of restraint that he excercised. The clarity of the film's message is reinforced by the costumes, which are openly differentiated as to Egyptian or Israelite,making it easy to distinguish the sides in the battle scenes. Of five *****, three and a half, it's still worth watching as the swansong of one of Hollywood's great directors.",
         "\"Solomon and Sheba\" was the kind of film that you just had to go and see back in the late 50's when I was a kid: a biblical epic spectacular with well known performers, unusual costumes, lots of extras and battle sequences. So I went to see it; but I remember that back then \"Solomon and Sheba\" didn't impress me at all, which was a strange thing since I had enjoyed a lot \"The Ten Commandments\", \"Quo Vadis\", \"Helen of Troy\" and others. The point is that when you are a kid you disregard things in pictures that adults don't (bad acting, for instance) and you are easier to please with warriors in their armors, battles, sword duels and action, so if your'e not impressed then something is wrong with a product of this genre. This film, though it has some of such features, is definitely standard and average. Yul Brynner's wooden performance as the Hebrew king doesn't even light when he has voluptuous and half naked Gina Lollobrigida dancing around him provocatively. She is better and renders an acceptable acting. George Sanders doesn't look interested in what he is doing, and Marisa Pavan (Pier Angeli's twin sister) doesn't add at all as a sort of Brynner's conscience. The final sword duel between Brynner and Sanders is just for the plot and lacks interest and intensity (it had to filmed, that's all). Not a good farewell for director King Vidor, Solomon and Sheba will probably be remembered as Ty Power's last unfinished picture.",
         "Mostly uninvolving biblical mumbo-jumbo that drags on for well over two hours. The only thing that saves this film from God's wreath (and there is only one God, remember) is the unintentionally funny dialog, and a good battle scene which comes far too late in the movie. For most of the two hours until the action scenes there is too much talking; the dialog is so inept that the movie just begs to be spoofed by MST3K. George Sanders is absolutely awful; one of the most animated, overly-theatrical performances I've ever seen. Brynner isn't much better; his stiff, wooden acting, combined with the horrendous fortune-cookie wisdom utterings make for a rather boring and silly Solomon. It seems that every time Brynner opens his mouth something oh-so wise and ridiculously high-and-mighty comes out. To an extent it's not Sanders's and Brynner's fault, because of the crappy, comical dialog and the typically biblical one-dimensional characterization, but they made little effort otherwise. Brynner's accent even reminds a bit of Schwarzenegger's; this is not a plus. Only Lollobrigida manages to avoid embarrassing herself, by playing the role with more conviction and in an appropriate way which befits a role in such a silly film. To describe these biblical characters as one-dimensional would be too give them undeserved credit; the characterization is half-dimensional.",
         "Historical materials coming from Hollywood have to be seen with certain reservation. Normally these are coming with plots totally different from the reality or versions given in books. If you doubt about this statement, you may like to see `The Robe' (1953) or `King David' (1985) and several others, for sure you will agree with us that these materials may be somewhat similar to what is said in bible, original gospels and other books, but they are altered purposely to provide some excitement. This film may also be different from the real history. The acting of Yul Brynner (Solomon) and Gina Lollobrigida (Sheba) is not the best in my opinion. Brynner was often shown in the film looking seriously and saying nothing, while Lollobrigida acted as if she was delivering a poem each time mixed with some mad reactions when she was angry. The photograph and camera work of the film were excellent, and probably the producers spent a lot of money to make all epic scenes here, but the film could have been much better with more natural acting.",
         "I do like epics and I wanted to see it for Yul Brynner, George Sanders, the master of suavity, smarmy menace and charisma and the fact that apparently this was the film where Tyrone Power died on set. However, despite some obvious good things, Solomon and Sheba just didn't do anything for me, and I feel really apologetic for saying that because it was a film I genuinely wanted to like. I will start with the good things. The film is exquisitely mounted, with photography that is ravishing, sets and scope that are well and truly lush and costumes that are beautifully tailored and elegant. The music also does a fine job with enhancing the mood, and the climax is great and the only scene of the film that I would call riveting. And there are two good performances, The King and I's Yul Brynner who is very charismatic and sexy, and I Pagliacci's Gina Lollobridgida, who is alluring and to say she is smoking hot is an understatement in itself. Unfortunately I cannot say the same for the rest of the actors, whose performances range from just okay to lousy. Yes, this is including the normally good Sanders, this is a role he should have been perfect for but mainly because the character is written in such a clichéd and uninterested fashion, all he becomes is seemingly a sad caricature of his former self. Solomon and Sheba feels much too long for me too especially in the battle sequences which are too long-winded for their own good. I wouldn't have minded this so much if the pace and script were any decent and the story at least interesting, but to me the film doesn't succeed in any of those areas. I am not going to go into the numerous inaccuracies there are in the story as I would be here all day, but that is the least of its problems. The story is just so dull and didn't engage me in any way, and this is further disadvantaged by really stodgy pacing, awkward direction and a horrendously stilted script. In all honesty I wasn't taken with the belly dance scene either. It wasn't like Salome, which had Dance of the Seven Veils, which apart from Hayworth was that film's highlight, but not only was the dancing here rather unexciting but I felt it wasn't done with any passion and only had the sensuality of Lollobridgida going for it. All in all, there are moments but they aren't enough to save Solomon and Sheba from leaving me cold. 5/10 Bethany Cox",
         "Back in the early history of Hollywood, during the 1950's, movie producers and gifted directors were often constricted and restricted in their efforts to produce memorable films. Take this one for instance. The film is called \" Solomon (Yul Brynner) and Sheba (Gina Lollobrigida) \" Some say they succeeded, others, especially modern critics used to a more tolerant set of guidelines, snicker at their censored efforts. The story is of the Bibical encounter between the wisest of all kings and the sultry queen from Sheba. Although many facts are distorted, the magnificence within the movie are surprisingly spectacular. Indeed, while viewing the gorgeous setting, elegant costumes and splendid scenery a plethora of questions arise. Things like, Solomon having a hundred wives, yet pursues Sheba like a lion after a kill. The Queen is given permission to have a pagan ritual to her God, however modern audiences view their exotic gyrating dance with yawing amusement. Still the cast of this film did a great job. George Sanders, David Farrar, John Crawford and Finlay Currie as David give this film it's legitimacy. Together they establish this colorful film as a movie original. ***",
         "As biblical epics go this one is not at the top of the list.Even King Vidor's directing skills could not elevate the film. Corny script and rather indifferent performances drag it down. Looking for authenticity in a Hollywood bible story is like looking for veracity from a politician. But nevertheless S&S is a fun movie to watch. The sets are lavish and the costumes are extravagant. After replacing Ty Power Yul Brenner does his best as the wise king smitten by Sheba. Who wouldn't be if she looked like Lollobrigida. She was at the peak of her loveliness if not her dramatic skills. If one wants a closer look at Gina's assets try to get hold of the uncensored European version.",
         "It wasn't until I looked at the trivia section that I found out that the original producer/star of this movie Tyrone Power died during its making . This no doubt explains why everyone on screen seems to have their minds on other things , a symptom of which appears in a very early scene involving a battle that can only be described as pathetic . You know when you've been painting a wall until you're completely bored ? Well that's the sort of expression the combatants have on their face when they're swinging their swords in a highly unconvincing manner The plot centres on Soloman the King of Israel having an affair with the Queen of Sheeba and his people not being happy about it . You can't really blame them since there's few things more beautiful in the world than those Israeli moteks , though the Israeli women here all seem to look like Cherie Blair ! Modern day Israel is also very cosmopolitan with the majority of Israelis being born outside the country but would this have been true a couple of thousand years ago where everyone speaks in European and American accents After much talking and a dance sequence that has to be seen to be believed ( And no that's not praise ) we have a climax where the heavily outnumbered Israelis have to defend themselves against a massed Egyptian army who can't read a map otherwise they would have known there was a canyon in front of them . This is what I don't get - Even though their blinded by the sun the Egyptians spend ten minutes charging towards the Israelis never ever realising they're charging towards a gaping ravine ! Isn't this somewhat illogical ? It's also something of a revealing error since the horses , chariots and men falling into the canyon are obviously miniature figures Anyway the film ends with Soloman killing his treacherous brother and praising God for his victory . But who needs Moshe Dayan , Arik Sharon or God when you've got an idiotic enemy who can't see a ravine in front of him or waves a sword like he paints a wall ?",
         "Though never up to paar with its predecessor, The Ten Commandments, this film has its moments and its low points. Yul Brynner as King Solomon is an attempt to portray him a conflicted and complex ruler, as well as a dramatic vehicle for Brynner who had earlier appeared as the evil Pharaoh Ramses in The Ten Commandments opposite Charleton Heston's Moses. That film appears on TV every Easter and is the superior movie. This movie suffers of being over-the-top and high-brow while really nothing more than an extended drama about King Solomon and his love for the enemy the Queen of Sheba. The Biblical account of the Queen of Sheba is brief. She visited King Solomon when she heard of his great wisdom and wealth and gave him gifts. That's it. Apocryphal legends have turned the story around. In other versions, they were lovers and allies. It is also suggested that she was the mysterious Beloved of whom Solomon wrote about in The Song of Solomons. This romance is the focus of this movie. Lush cinematography and cast of thousands. Deserts, palaces, crowd scenes, battles and other such gimmicks were the latest craze in the late 50's to draw people away from the new invention of television and bring them back to the movie palaces and theatres. Gina Lollabrigida, an Italian sex symbol of the 50's, stars as the Queen of Sheba. Though she is lacking dramatic power and her acting sounds like mere poetry and stilted, she truly acts the pagan Queen with much appeal. It is a role that is out of her repertoire. Her scenes with Yul Brynner as Solomon are impressive. Brynner was always criticized for being an actor who looked and sounded serious but was really a ham and old-fashioned Shakespearean kind of actor. The movie is an attempt to reflect the glory of The Ten Commandments but fails to do so. Nevertheless, if you're a fan of Biblical epics on the screen, and there are many, among them King David starring Richard Gere, and several Passion Of The Christ movies, as well as \"The Bible..In The Beginning\" which covers the accounts of the Flood, Sodoma and Gomorrah and many other tales...then this is the movie for you. It is the kind of movie most appreciated by Christians or biblical scholars.",
         "Solomon and Sheba is directed by King Vidor and collectively written by Anthony Veiller, Paul Dudley, George Bruce and Crane Wilbur. It stars Yul Brynner, Gina Lollobrigida, Marisa Pavan, George Sanders, David Farrar, Harry Andrews, John Crawford and Laurence Naismith. Music is by Mario Nascimbene and cinematography by Fred A. Young. A fictionalised screenplay cribs from parts of the Bible, where the story here follows the relationship between Solomon of Israel and the Queen of Sheba, a problem because initially Sheba is in league with Israel's enemy, Egypt. All that and Solomon has to deal with his nefarious brother, Adonijah, who is a little miffed that Solomon has inherited the crown of Israel. Famously it was the production that saw the sad death of the leading man, Tyrone Power, while Vidor was so disillusioned about the whole film he quit making feature length films. It's a very mixed bag, very much showing the good and bad sides of the big historical epics that dominated Hollywood back in the day. In part it's a grandiose melodrama, in others it's cheap looking and given to campy histrionics (the orgy operatics sequences are just awful), while the screenplay jostles with itself as to being biblical blarney or potent pontifications. Costuming and colour photography smooths the eyes, but then the optical nerves are shredded by set design so poor a child making paper mache boulders could have done better. The cast are also in and out, Brynner is fine as Solomon (broody, brainy but troubled), as is the lovely Lollobrigida as Sheba (stoic, smart and sexy), but the support slots barely convince. Sanders is badly miscast as Solomon's warrior brother Adonijah (he was 53 at the time), 10 years earlier in Samson and Delilah his villain turn worked, but not here. Sword fighting choreography is poor, as are the miracle effects work, but conversely the big battle that crowns the story is smart in writing and in execution, where not even the model work can dim the thrill of it all. Released in the same year as Ben-Hur obviously does it no favours by comparison! But then so many other big swords and shields epics would also struggle as well. Vidor's movie is just above average in the genre pantheon, but the faults are irritable and hardly render it as a must see film for genre enthusiasts. 6/10",
         "Note One. \"Sheba\" was the name of a country, not a person. Calling the heroine of this film \"Sheba\", therefore, is about as logical as making a film about Cleopatra and calling her \"Egypt\", or about Queen Victoria and calling her \"Great Britain\". The Queen's personal name is not recorded in the Bible, but tradition gives it either as Bilqis/Balkis or as Makeda. Note Two. The Queen of Sheba would have been black, or at least much darker skinned than Gina Lollobrigida. Hollywood squeamishness about interracial love affairs is doubtless to blame for this piece of miscasting. Note Three. What is a blue-and-gold macaw (native to South America) doing in the ancient Near East? Epic films based upon the Bible were popular in the 1950s, but sometimes they were only very loosely so based. \"Solomon and Sheba\" is a case in point. The biblical account of the Queen of Sheba's visit to Solomon is a very brief one, but this film uses it as the basis for a particularly complicated plot. In this version Sheba is an ally of Solomon's arch- enemy, the Pharaoh of Egypt, and conspires with the Pharaoh to undermine him. The idea is that she will seduce him and persuade him to allow pagan worship in Jerusalem, thus provoking his own people to rebel against him. The plan comes close to success, but Sheba begins to fall in love with the man she has sworn to destroy. There is also a sub-plot involving Solomon's jealous brother Adonijah who covets his throne. Cecil B. DeMille, the man whose \"Samson and Delilah\" is often regarded as marking the beginning of the fifties epic cycle, once wrote \"I am sometimes accused of gingering up the Bible with large and lavish infusions of sex and violence. I can only wonder if my accusers have ever read certain parts of the Bible.\" There certainly seemed to be an unofficial rule that epics were exempt from the strict rigours of the Production Code, provided the film as a whole conveyed some improving religious or moral message. Sexiness was next to godliness. In \"Salome\", for example, Rita Hayworth was able to get away with performing a provocative dance because in this version of the story (contrary to the Biblical one) Salome is a virtuous heroine who is trying to save John the Baptist's life. \"Solomon and Sheba\" was made six years after \"Salome\" and goes a lot further than that film, or than anything made by DeMille, in its intermingling of sexiness and godliness. The film even includes an orgy scene which was virtually pornographic by the standards of fifties Hollywood, but its overall message is essentially \"Judaeo-Christianity good, paganism bad\". The orgy is presented as a \"love feast\" in honour of a Sheban god, with an implied subtext that those who do not acknowledge the one true God will lack moral strength and be unable to resist sexual temptation. The film ends with Sheba's conversion both to the worship of Jehovah and to the paths of virtue. The film was hit by tragedy when the original Solomon, Tyrone Power, died suddenly during filming; Yul Brynner was hastily drafted in to replace him and Power's scenes had to be re-shot. The director, King Vidor, seems to have been unhappy with Brynner, who he thought was too calm and self-assured; he felt that Power would have been better at portraying the conflict in Solomon's nature between love and duty. The best acting contribution comes from George Sanders (generally a decent villain) as the villainous Adonijah. (Sanders also played the Philistine King in \"Samson and Delilah\"). There may have been some truth in Vidor's criticism, but I felt that Brynner was not too bad, bearing in mind that he had inherited his role from another actor with a rather different style of acting. La Lollo, however, is weak as Sheba; it is all too clear that English is not her native language and her lines were sometimes difficult to understand. I assumed that the role of Abishag (an innocent young girl in love with Solomon) was being played by Pier Angeli, who seemed to specialise in sub-standard epics (she also had parts in \"The Silver Chalice\" and \"Sodom and Gomorrah\"), but in fact the role was taken by Pier's twin sister Marisa Pavan, whose English is no better than Lollobrigida's. Or for that matter than her sister's. The film was made in 1959, the same year as \"Ben-Hur\", one of the greatest epics, but the two films are in nothing like the same class. \"Solomon and Sheba\" was made on less than half the budget of the other film, and at times it shows. When the Temple in Jerusalem is struck by lightning, it is obvious that what we are seeing is a model (probably one put together by a child playing with Lego bricks). The acting is variable in quality and the plot at times defies belief, especially during that scene (not found in the Bible) where the entire Egyptian army are so dazzled by the sunlight reflected from the shields of the Israelite soldiers that they plunge to their deaths in a canyon. (And remember: the Israelites of this period would only have had bronze shields, not polished steel ones). DeMille might have been able to acquit himself of gingering up the Bible; the verdict against Vidor and his scriptwriters on this charge must be \"guilty\". 5/10",
         "King David of Israel dies.Before he dies he announces Solomon would be his successor.His older brother Adonijah had already declared himself the new king, and therefore becomes his brother's biggest enemy.Egyptian Pharaoh has given a mission to Queen of Sheba to destroy Solomon.She uses her own sexuality to seduce him and introduces Sheban pagan worship into Jerusalem.But she finds it hard to resist Solomon's charm and falls in love with him.Solomon and Sheba (1959) is the last picture directed by King Vidor.The actors do fairly good job, with Yul Brynner and Gina Lollobrigida taking the lead.And Gina does look pretty hot! Tyrone Power would have been the original male star, but he died of a heart attack during the filming.George Sanders plays Solomon's brother Adonijah.Marisa Pavan plays Abishag, probably my favorite character in the movie.David Farrar plays Pharaoh.Finlay Currie portrays David.The movie has gotten a lot of bad criticism.However, it is not near as bad as has been said.That is my opinion, anyway.The love affair between Solomon and Sheba is portrayed very nicely.There's the orgy scene that works.Not showing as much, obviously, as would be shown if the movie was made today.The movie also portrays the Judgment of Solomon, which I actually played one time at school.So it's very nice to watch it in a movie.If you're a fan of biblical movies, you should take a look at this.",
         "In cinema, we have always lost as well as gained. In the post war era we got a load of upcoming sprouts with new ideas. Changing social mores gave greater latitude in the kind of stories we could tell. And yet the older generation, for whom movie making was purer, unpretentious and above all visually orientated, were still alive and, once in a while, kicking. Now, Solomon and Sheba is a dead-looking production if ever I saw one. Even though it was released the same year as Ben-Hur, one of the most successful ancient world epics ever made, you can still see the format is getting a little tired. This isn't so much Sunday school story come-to-life as cheap and somewhat half-hearted excuse for a bit of bare flesh and erotic dancing of the kind that they really went in for in the 50s. For a production of this kind, it is woefully low budget. The sets look like you could punch holes in them, and the costumes look like they were cut up from old curtains (net curtains in Gina Lolobrigida's case). The screenplay too is utter trash. Complete changes in character and drive are crammed into single scenes. The dialogue is not bad as such, it is merely bland and unmemorable. And then there are the actors. Yul Brynner, standing in for Tyrone Power (who was dead at the time) giving a reasonably understated performance, but doing little more than sitting around looking thoughtful. Screen brother George Sanders simply looks worse the wear for age, and it appears likely he simply couldn't be bothered any more, especially for something like this. Finlay Currie, now something of a fixture in the biblical flick, makes a brief and fairly run-of-the-mill appearance. The rest of the cast are so dull they are not even worth a mention. But does any of this really matter? Well, of course yes it does to some extent. We expect a little quality control even in a picture like this. But when you're watching a colourful adaptation of some millennia-old mythology, it's acceptable for realism and dramatic intensity to play second fiddle to the power of the images. And this is where our afore-mentioned old-school approach comes in. This was the final feature film of veteran director King Vidor. Vidor had been handed one crummy project after another for the past decade or so, and yet unlike Sanders he never lost his professional interest – in spite of a rather troubling experience on this particular production. Solomon and Sheba is packed with the kind of visual splendour that Vidor had been crafting since the early 20s. In the battle sequences he works round the small number of extras by focusing on dynamic snippets of action, often having fighters surge towards the camera for that added impact on the audience. In Brynner and Lolobrigida's boat scene the eerie willow fronds add a layer of atmosphere that makes up for any deficit in the acting. All of this is enhanced by the sublimely moody cinematography of Freddie Young – the only other outstanding name in the production crew. Best of all Vidor does this without resorting to any fancy camera tricks. Is Vidor's compelling imagery enough to save Solomon and Sheba? Not quite. Nothing could really turn back the tide of paltriness that washes over every other aspect of the picture. But Vidor's efforts at least make it easy on the eye. With that in mind, you can quite happily enjoy this as pretty no-brainer entertainment, just as you can the pictures of Cecil B. DeMille (although Vidor is far more surreal and spiritual then the earthy DeMille). If you keep your eyes peeled for things like that jolly conga line snaking its way through the surprisingly risqué pagan rite, or a soldier getting a round shield pinned to his face like a bronze-age emoticon, you might even find a few laughs in this ostensibly serious feature.",
         "This movie and several other movies from the 1950s with a religious overtone, such as The Robe, Quo Vadis, and Samson and Delilah, unfortunately depict all pagans or anybody who isn't a Jew or Christian as morally depraved and decadent. The focus is only on biblical-related stories that ignore the world outside the Bible. As far as they are concerned, nothing good came from pagan Egypt, Greece or Rome. Any movie that preaches about the \"one true god\" gives a short shift to freedom of religion. The movies ignore the fact that ancient Judea's lack of religious freedom made it a fertile ground for religious extremism. Most 1950s religious movies also overlook the loss of freedom the occurred after Christians assumed political power in the 4th century.",
         "tyrone power died in spain when he was filmig \"Solomon adn sheba \". He was replaced by Yul brynner . The movie wast the last Vidor´s work. Solomon and sheba is a very beauty film, with great scenes, romantic and epic . King Vidor, one of the greatest directors of all times uses a very interesting theme : the fight between good and evil, the love and the passion . fernando alonso barahona author of \"King Vidor \" , among many more books about cinema in spain .",
         "Yul Brynner and Gina Lollabridgida are \"Solomon and Sheba\" in this 1959 Biblical epic directed by King Vidor. Also starring are George Sanders, Marisa Pavan and Finlay Currie. The main problem with \"Solomon and Sheba\" is that a) it's bad; and b) no one infuses any energy into it, understandably. When Tyrone Power died during the swordfight with George Sanders, the producers decided to cash in the insurance check and start over. A mistake. It's hard to imagine what these actors went through, standing in a freezing cold Madrid studio, watching the 44-year-old star, who had a pregnant wife, die suddenly, and having production shut down amidst tremendous publicity. On top of which, Brynner asked for rewrites, and believe me, they weren't for the better. Lloyds of London stipulated, on payment of the insurance, that Power could not appear in any part of the film. Obviously the producers weren't about to shoot those battles scenes again, so Power IS in the longshots. Tyrone Power was a co-producer of this movie, and it was part of his deal with Arthur Hornblower, who wanted him for Witness for the Prosecution and this. Power knew that audiences were used to seeing him in this type of film, and he had given up on Hollywood and committed himself to theater work. This was his one film a year where he could make big bucks and then spend the rest of his time doing plays. One thing about Power that no one can ever take away from him - he could make the world's worst dialogue sound absolutely believable. Brynner, alas, though very dignified in this role, didn't have that gift. Power had to develop it fast working for Zanuck. I've seen some of the footage of Power in this role - he was much more energetic and intense than Brynner. Having done Shakespeare and recorded poetry, he had a real feel for this language as well. It's not Brynner's fault - I'm sure no one wanted to do the movie once Power died. Brynner couldn't have known how it would have felt to be in that atmosphere ahead of time. There are spurts here and there - one of the battle scenes is very good, and Gina is gorgeous (Power referred to her as \"Lolly\" in his letters). She's just not really into it. The audiences who saw it in the theater undoubtedly weren't either.",
         "Two Outstanding Set-Pieces, the \"Orgy\" Ritual and the Final Battle Highlight this Slow, Talky, sometimes Dull Display of Hebrews, Egyptians, and for Spice the \"Queen of Sheba\" around a Thousand Years B.C. Taken from a few Snippets in the \"Old Testament\" it tells the Extra-Biblical Story of Solomon (Yul Brynner) and the Queen of Sheba (Gina Lollobrigida). \"Sheba\" (as she is called here) is sent by Pharaoh to Spy and Seduce Solomon into Revealing His Secrets. Speaking of Revealing. Sheba is Shown in an Array of Alluring Apparel to the Delight of Solomon and 1950's Audiences. There is much Prancing and Dancing. The Movie is Typical Cornball for the Genre that was about to End its Cycle a Year Later with \"Ben-Hur\" (1959) and although that Film Swept the Oscars the \"Biblical Epic\" and the Cheap Sword and Sandal Imitators were Designed for the Dustbin of Hollywood History after a Ten Year Run. This one is Worth a Watch with Low Expectations and for Eye-Candy Enthusiasts. Note...Tyrone Power died of a heart-attack during filming and was replaced by Brenner. The production does have a faded glow residue."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance",
         "War"
      ],
      "productionCompanies": ["Edward Small Productions"],
      "summaries": [
         "Shortly before his death in ancient Israel King David has a vision from God telling him that his younger son Solomon should succeed him as king. His other son Adonijah is unhappy and vows to attain the throne. Meanwhile the Egyptian Pharoah agrees to cede a Red Sea port to the Queen of Sheba if she can find a way to destroy Solomon, whose wisdom and benevolent rule is seen as a threat to more tyrannical monarchs in the region. Sheba, Pharoah, Adonijah, the leaders of the Twelve Tribes and his own God make life difficult for Solomon who is tempted by Sheba to stray.",
         "Just prior to his death, King David names his younger son, Solomon, his heir ahead of his elder son Prince Adonijah. Solomon is wise and rules his kingdom well but when the Queen of Sheba arrives in Jerusalem, supposedly for a friendly visit, he slowly falls in love with her. In fact, the Queen is in league with the Pharaoh of Egypt and her aim is to divide the twelve tribes of Israel and uses the disaffected Prince Adonijah in her plans. Over time however, she too falls in love with King Solomon choosing to side with him against the Pharaoh.",
         "After becoming king of ancient Israel, Solomon faces threats coming from his jealous dispossessed brother Adonijah, the Egyptian Pharaoh and the scheming Queen of Sheba."
      ],
      "budget": 5000000
   },
   "movielensId": 122084,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-12-25",
      "dvdReleaseDate": null,
      "directors": ["King Vidor"],
      "runtime": 139,
      "movieId": 122084,
      "title": "Solomon and Sheba",
      "mpaa": "",
      "actors": [
         "Yul Brynner",
         "Gina Lollobrigida",
         "George Sanders",
         "Marisa Pavan",
         "David Farrar",
         "John Crawford",
         "Finlay Currie",
         "Harry Andrews",
         "José Nieto"
      ],
      "imdbMovieId": "0053290",
      "originalTitle": "Solomon and Sheba",
      "genres": [
         "Drama",
         "History",
         "Romance",
         "War"
      ],
      "youtubeTrailerIds": ["_sgJPI1QOmk"],
      "plotSummary": "Under the rule of King David, Israel is united and prosperous although surrounded by enemies including Egypt and its allies. The aging King David favors his younger son, Solomon, as his successor, but David's  elder son Prince Adonijah, a warrior, declares himself King. When David learns of this, he publicly announces Solomon to be his successor. Adonijah and Joab, his general, withdraw in rage. Israel prospers under King Solomon's wise and benevolent rule and is seen as a threat to more tyrannical monarchs in the region. The Pharaoh of Egypt agrees to cede a Red Sea port to the Queen of Sheba in a plot to undermine Solomon's rule. Sheba is to seduce Solomon and introduce Sheban pagan worship into Jerusalem. Meanwhile, Prince Adonijah, now banished, also conspires with Pharaoh and is given an army to defeat Solomon. The film is a highly fictionalized dramatization of events depicted in The Bible -- First Kings chapter 10 and Second Chronicles chapter 9.",
      "tmdbMovieId": 29996,
      "avgRating": 3.5,
      "releaseYear": "1959",
      "numRatings": 4,
      "posterPath": "/dDDSs4DSVBTG5s452w5IMZpZYHb.jpg"
   }
}