{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "high school",
         "id": 6270
      }],
      "imdb_id": "tt0905994",
      "video": false,
      "title": "The Haunting Hour: Don't Think About It",
      "recommendations": [
         40706,
         58664,
         349849,
         356482,
         50636,
         117942,
         140652,
         34204,
         58096,
         39564,
         216016,
         61717,
         295723,
         35759,
         338514,
         297472,
         49847,
         7513,
         110588,
         34560
      ],
      "backdrop_path": "/wobboExVxFAdGAsdBJ7eQEZCSon.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Priscilla Wright",
               "gender": 1,
               "credit_id": "52fe442dc3a368484e013fbd",
               "name": "Brittany Curran",
               "profile_path": "/2YDGhHc9STMGBpWoZkYC8mBKyE.jpg",
               "id": 88072,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Max Keller",
               "gender": 2,
               "credit_id": "52fe442dc3a368484e013fc1",
               "name": "Alex Winzenread",
               "profile_path": null,
               "id": 88073,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eileen Keller",
               "gender": 1,
               "credit_id": "52fe442dc3a368484e013fc5",
               "name": "Michelle Duffy",
               "profile_path": "/iAifIdDuHZKcnmq9nQw4T99obyA.jpg",
               "id": 88074,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cassie Keller",
               "gender": 1,
               "credit_id": "52fe442dc3a368484e013fc9",
               "name": "Emily Osment",
               "profile_path": "/7Uhb0bJp7v3sqnSBkxXjya8UeXO.jpg",
               "id": 82785,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jack Keller",
               "gender": 0,
               "credit_id": "52fe442dc3a368484e013fcd",
               "name": "John Hawkinson",
               "profile_path": "/2hJm1jzylL4U8OKtoDCbgMGEUCc.jpg",
               "id": 87057,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sean",
               "gender": 2,
               "credit_id": "52fe442dc3a368484e013fd1",
               "name": "Cody Linley",
               "profile_path": "/1YunTeHzptp24p51EALXUW0ZBlb.jpg",
               "id": 88076,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe442dc3a368484e013fd7",
            "name": "Alex Zamm",
            "profile_path": "/wjhqVO41S4tdZGtEal71yI56xlj.jpg",
            "id": 88077,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.355431,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21935,
      "vote_count": 29,
      "budget": 3000000,
      "overview": "Cassie, a 13 year old Gothic girl, is trying to fit in at her new school. To entertain herself, she plays a series of pranks on the popular kids and her younger brother, Max. When she goes to a Halloween store looking for new tricks, she finds a little book called \"The Evil Thing\"",
      "similar": [
         89185,
         37725,
         9880,
         272693,
         10625,
         133805,
         10206,
         19840,
         2105,
         449176,
         286987,
         9655,
         277217,
         3597,
         26123,
         36599,
         17130,
         201676,
         10314,
         325189
      ],
      "original_title": "The Haunting Hour: Don't Think About It",
      "runtime": 87,
      "poster_path": "/beKslL2pfNrmWiafC4oG8hd4Zgh.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Hatchery",
            "id": 7613,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Universal Studios Home Entertainment Family Productions",
            "id": 3436,
            "origin_country": ""
         }
      ],
      "release_date": "2007-09-04",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.rlstineshauntinghour.com/home.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alex Zamm"],
      "runtime": 87,
      "synopsis": "written by KrystelClaire A young boy, Max (Alex Winzenread), feels terrified: he can't sleep in his room because everything scares him, from the twigs tapping on the window to the door of his walk-in wardrobe. He constantly calls for his mum and dad, and consequently, they can't sleep at all. Finally, Dad/Jack Keller (John Hawkinson), promises him to buy his longed-for videogame if he sleeps quietly on his own. The young boy promises to try, but then, the door to his closet opens up again. He leaves bed to close it up, but then, a green hand appears. The boy screams and his parents come once again. This time, we can see it was his sister Cassie Keller (Emily Osment) The film now focuses on Cassie. She is a fifteen-year-old teenager Goth full of angst. She dresses as if it were Halloween all year around, and her mother Eileen (Michelle Duffy) can't convince her of wearing even one of the pretty clothes she has bought for her teenaged daughter. Back at her new high school the following morning, she tries to talk with the boy she likes, attractive but dumb Sean (Cody Linley). Priscilla Wright (Brittany Elizabeth Curran) is the most popular girl in school, and she expects to be crowned Pumpkin Queen in the approaching high school ballroom. Priscilla humilliates Cassie by throwing food over her in the school canteen, as she wants to mark her territory with Sean. He will go to the ball with Priscilla because she has offered to do a class assignment for him. In frustration, Cassie wants to buy a new Halloween outfit, although Mum tells her she is too old to go trick-or-trading. Cassie finds a new costume shop at the end of a corridor. The weird shop assistant, (Tobin Bell), tells her that he only opens in Halloween. Cassie buys the only book on store, entitled The Evil Thing. The first page clearly states DO NOT READ ALOUD. Cassie becomes more aggresive, and she spoils Priscilla's moment when, after having been crowned as Pumpkin Queen, she tears open a piñata and worms fall on her. Cassie has to baby-sit Max while their parents are away. He insists on being read a horror story, something which Cassie doesn't want to do at first because she knows that Max will have nightmares later on. Max insists and he turns her computer off, making her lose the horror Hollywood story she has been writing for some time. Cassie is angry. A noise is heard outside: she goes to look what happens, and a witch doll falls on her. She screams, and suddenly, Priscilla and Sean appear from the shadows: she has told him to record Cassie's terrified screams, and the next day, all high school will see the video and laugh about Cassie. Angry, Cassie reads The Evil Thing aloud and then tells Max to wash his teeth and go to sleep. A huge monster appears. theoretically, it only appears if you believe on it. It has two heads, with one it sucks blood and with the other one it tears flesh out to eat it. It also picks people and puts them into coccoons until its children are born and eat the humans. The monster captures Max, the pizza guy and Priscilla. It's Cassie and Sean's turn to do something. Cassie remembers the shop assistant, but he doesn't want to help her. He explains that his shop appears at Halloween for one day and disappears the rest of the year. He says that he opens the shop close to the home of the child who wants to scary everybody the most, and this year, Cassie has won over the other \"contestant\", a ten-year-old who loves Halloween as well. He tells her to use two heads instead of one. Sean finds a solution: make one head of the monster eat the other one. Cassie and Sean go to the gutter where the monster is nesting. The eggs are about to hatch. They find Max easily, and they free him, but the monster appears. It's Max who has to throw blood all over the monster. When Cassie encourages him, Max can eventually carry out the plan. The monster attacks itself and the babies are easy to kill. Priscilla, freaking out because she is covered in slimy goo, gets angered at Sean, but seems to be cleverer that what everybody thought, but not quite. The pizza guy invites Cassie, Sean and Max for pizza, but Priscilla wants to walk home on her own in the night. Back and safe at home, Cassie burns the book in the chimney. Her parents come back, and they find Cassie and Max hugging each other, so they are contented. Jack sees something in the chimney - it's the book The Evil Thing. He reads it aloud, and the monster wakes up once again.",
      "writers": [
         "Dan Angel",
         "Billy Brown"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0905994/",
      "coverLink": null,
      "actors": [
         "Emily Osment",
         "Brittany Curran",
         "Cody Linley"
      ],
      "reviews": [
         "The cartoon network is not my normal source for Sunday night movies but when I saw the previews for this new movie based on the R.L. Stein book it reminded me of my days of reading Goosebumps and decided to give it a try. I must say that I was pleasantly surprised as it was a fun movie with its share of spooky moments that children will love around Halloween time. The acting by the kids is well done, and Emily Osment (of Hannah Montanna) is great in the lead role. I recommend this to all parents wanting to watch a spooky movie with their kids. The version of the movie I saw was a special version in which Emily Osment did commentary along with the movie so that was pretty interesting too..I am not sure if this is on the DVD version but if it is it's an added bonus.",
         "I thought The Haunting Hour: Don't Think About It was amazing. Emily Osment was able to pull the far stretched character of Cassie, the goth girl very well. The movie is family oriented. The fact it is a horror/comedy meant for the family seemed odd to my opinion, but The Haunting Hour: Don't Think About It is now my favorite movie, granted I am a HUGE Emily Osment fan. Anyway, the movie was able to creep me out, without being grotesque. Although, I must admit the yellow monster goop towards the end of the movie was kind of weird looking. The nice part was, after being scared, a bit after there would be a part that would make you laugh a lil'. Whether it was Sean (Cody Linley) acting goofy with a shocker pen or Cassie (Emily Osment) saying her amusing lines. The movie also shows a bit of a lesson as well. That you should be yourself and that it's okay to be weird, lol. For instance, at the end Sean (Cody Linley) says to Cassie (Emily Osment) to \"Stay weird.\" I personally loved the movie and hope you all do to. But one thing that did annoy me was the movie's script at certain points. For example, a bit before the end of the movie Sean (Cody Linley) says \"Oh dang, gotta jet.\" I must admit, the line made me giggle but seriously, who speaks like that? Haha, anyway this is a great movie and worth watching on TV/buying the DVD. FYI, this is the opinion of a fourteen year old girl, if you were wondering(:",
         "I'm not usually one to watch Cartoon Network, but I decided to make an exception for this movie. Young actress Emily Osment stars in this flick alongside Cody Linley and Alex Winzenread. The acting is very, very good in this movie.. Better than I expected it to be! Tobin Bell was also amazing as the shopkeeper. The storyline was exciting and mysterious. I liked that things didn't always work out for the characters the first time they tried it, like in most movies. The worst thing about this movie was the effects. The Evil Thing was clearly obviously fake, and the baby Evil Things looked like they were being pulled by string! But since that is the least of my complaints, I give this movie 7/10.",
         "First of all, the movie was pretty good, but there are two drawbacks: 1 They overdid the whole \"halloween\" tone of the movie 2 This is what really bothered me: has anyone seen \"Godzilla 2000 Millennium? Well, if you have, compare the evil thing to Godzilla's opponent: Orga. They both have the same build, They have the same type of teeth, granted, the evil thing had overlapping teeth (they did this so no one would notice the similarity), They had the same hands too. the only things different: the fact that its head separated into two, and the eggs that it carried on its back. still, I enjoyed the movie, I liked it better than the Goosebumps series, no offense intended, Everyone's entitled to their opinion.",
         "Cassie is a thirteen year old goth girl attending her new school where a preppy and rich snot named Priscilla goes out of her way to make Cassie's first days a misery. Meanwhile at home, Cassie has to try and convince her parents to accept her Gothic lifestyle, and also enjoys scaring the head off her little brother, Max. One day while going to the local library, clad in the stereotypical goth black cloak and carrying an armload of horror novels, Cassie comes across a secluded Halloween store and her curiosity gets the better of her. She meets a creepy old salesman who sells her a book called 'The Evil Thing', and she also gets her revenge on Priscilla at the school dance by filling Priscilla's pinata full of cockroaches. Everybody begins calling Priscilla the Cockroach Queen, so Priscilla dares Cassie's crush, Sean, to read her diary. While babysitting Max on Halloween night, Max accidentally deletes Cassie's homework (kids, write by hand, you'll save more time), and to scare him she reads him 'The Evil Thing'. Sean apologizes for Priscilla's jerky behavior but it isn't long before the Evil Thing monster comes to life... can Cassie and Sean rescue Max, Priscilla and the local pizza dude from becoming food for a monster's newborn babies? For kids this certainly isn't a bad movie. It's a horror movie but no one dies aside from the monster, there is very little, if any, gore and it isn't very scary. Of course, this probably varies by the audience. The soundtrack is excellent and the acting was okay, and it has the name of the kids' horror author R. L. Stine attached to it, the creator (or at least inspiration) for Goosebumps, the Nightmare Room, Fear Street, and recently a Haunting Hour TV series. The pros? Original plot, great and catchy (yet sadly unreleased) soundtrack, no swearing or sex jokes, creative characters. The cons? Well... Alright, there's the matter of Cassie herself, her character is highly unrealistic. Not only did they hire a well-known actress/singer to play her role, but they try to pass her off as a thirteen-year-old. Cassie, Sean and Priscilla all look to be high schoolers, not to mention the school itself has a high school appearance. You can't tell me that these characters are thirteen, they don't look the part. The scenes at the school are like something out of a Lifetime anti-bullying film, and Cassie is too stereotypical, as if all goths do is act depressed, hate their parents, throw on a pair of headphones to listen to alternative rock, borrow horror novels and constantly think of death and creepy things. And if you think I don't know what I'm talking about, I only graduated high school a year ago so I definitely know what real kids act like, it most certainly isn't this. The acting was okay but they hired well-known actors/actresses, giving the film an unrealistic feel. Priscilla's snob personality was way too overdone, as was Cassie's goth personality, to the point where both characters seemed incredibly fake. That being said, The Haunting Hour isn't a bad kids' film, although I liked R. L. Stine's two-part TV movie Goosebumps: Welcome to Dead House (1997) much better. If this movie was ever remade, I think they should tone down the Wednesday Addams act from the role of Cassie. Either way, check it out, it's not too bad and for kids who like horror but you're afraid Stephen King or George Romero might be too much for them to handle, this is a great compromise.",
         "I know I'm 3 days late, but this was a really good children's Halloween movie. It can be for adults like me who is still a kid at heart. Emily Osment was very hot as the Gothic chick, Cassie. Cassie's younger brother, Max is annoying and is afraid of everything. Cassie is new in school, and made fun of for looking and acting different than the preps, except for Sean, who likes her for being weird. After an embarrassing episode in the school's cafeteria, she runs into The Stranger, who sells her a book called The Evil Thing. On Halloween night, the Evil Thing comes alive and attacks anyone who gets in its way. It's up to Cassie, and Sean to save everyone and stop the Evil Thing. I highly recommend THE HAUNTING HOUR: DON'T THINK ABOUT IT!!!",
         "i watched this when it first came out with my sisters, i wasn't a fan of goosebumps, and since it was Emily osment i was expecting a girly Halloween movie. I was so wrong, this movie made me pumped for Halloween, with all of its atmosphere, decorations, and a awesome song. \" i cant wait until Oct 31\". Surprisingly, the dialogue is really mature, i mean, not little kiddish, and they took the high school scenes kind of serious. Emily is supposed to be a goth, and i could sense she did have some hidden issues, thats how good her portrayal was, the other characters are funny, except for her little brother who kind of annoyed me with his cowardice, but towards the end when he faces his fears, i was very pleased with him. And now, for the best part of the movie, Emily is walking down a street and looks into an ally and sees a secluded Halloween store, the minute she walks in, i was in awe, they put a lot of work into it, and then she meets the shopkeeper, who is very creepy but mysterious, and hes played by none other than jigsaw from the Saw franchise! of course i didn't know this when i was a kid, but later when i found out it was the same guy i realized he had the same demeanor, in fact it felt like it was jigsaw, his motives were very similar as well! And last but not least, the monster. this thing gave me nightmares for weeks, its aesthetics were so good, and for a children's movie it looked super real, also i felt the dread when Emily was told never to read the evil book out loud, just like from the evil dead! And the worst part is, you cant think about it or else the creature will come to life, lets just say me and my sibling actually tried not to think about. this a great Halloween movie, that is funny and scary, but not grotesque in any way, it was perfect when i was a kid, and it made me like horrors films after that. And every year me and my siblings still like to watch this movie to get us all in the mood, watch this movie, and remember don't think about it...",
         "Horror-obsessed Cassie Keller (Emily Osment) likes to scare his afraid little brother. She's the new student at Knoxville Jr High. She has a crush on Sean (Cody Linley). When she offers to help Sean on his Edgar Allan Poe book report, jealous Priscilla Wright (Brittany Curran) starts bullying her. Cassie buys a book \"The Evil Thing\" at a mysterious Halloween store from a mystery man (Tobin Bell). Priscilla wins Pumpkin Queen at the Halloween dance and Cassie plays a prank on her. Priscilla returns the favor on Halloween night. Cassie reads the book to her little brother despite the warning \"Do Not Read Aloud\" bringing forth something evil. R.L. Stine is a widely liked kiddie horror series. It's usually similar to adult horrors without the grotesque or sexuality and at a lower horror level. This one is perfectly fine but the monsters look really cheesy. Emily Osment is able to walk the line between victim and pouty teen. It really needs to work on the creature effects. Actually, I would like mature horrors with children as protagonists. This could be that kind of horror if it's scarier with more grotesque realistic creatures.",
         "Emily Osment steps outside of her goody goody personae as a goth girl who has had to move with her family to another town. As with almost all goth's she is not a happy person. She crosses wires with the school bitch and gets embarrassed. She gets even at the Halloween dance when the queen smashes open the pumpkin piñata and gets dowsed with a mixture of candy and roaches. She then gets tasked with watching her brother on Halloween and when he accidentally turns off her computer she reads him a special book. This book brings forth \"The Evil Thing\". Now her brother is a super wuss and I did not like his character at all. It is okay to be afraid of things but not like this kid is in this movie. Of course the Evil Thing shows up and kidnaps the brother, a pizza delivery guy, and the queen of the dance. The queen's boyfriend, from coercion more than any thing else, is really a good guy. He ends up dumping the queen and goes to Emily's house to get her to save the prisoners. To make a long story shorter Emily and the boyfriend use the blood from a roast to get the Evil Thing to eat itself. This frees the kidnapped ones and all live happily ever after, almost, kind of maybe.",
         "I was a little skeptical when I saw this on TV, but despite those feelings, I watched it anyway. I'm very proud to say I was wrong to suspect that this film was a stinker. It was a lot better than I imagined. It is perfect for children and I think kids will get a kick out of this movie. It's not too scary and it leaves a lot to their imagination. I had a great time watching this film. The acting in the movie was pretty good. At first, it was a little difficult to see Emily Osment as a goth, but I feel she pulled it off very well. It was a stretch for her and I think it's great she's expanding her roles. Overall, great family movie!",
         "I happened to catch this movie on the Cartoon Channel - a first for me -when it first came out. I remember buying the R.L. Stine books for my daughter when she was a teenager, but had never read any myself. I was pleasantly surprised by this movie. Okay, I had never seen Emily Osment, either (although I knew she was Haley Joel's sister, for which I should be awarded some points, I think), but I thought she was excellent, as was all the cast. Guess what: when Halloween came around this year, I found myself looking for this movie again! It is silly, fun, and definitely has its scary moments. It is entertaining for kids, older kids and adults, and I recommend it highly for just about any age group (the icky monster stuff may be too much for really small kids), and as a family watch-it-together movie. I rate it 8/10 and have just bought a copy on Amazon just in case the Cartoon Network has moved on to other things in October 2009.",
         "It was in-between bad and horrible. I excepted much more from this movie, it wasn't even the least bit scary. And 'The evil thing?' come on.. couldn't they have thought of something more original? I did however enjoy a few parts, and the actresses/actors were pretty good at their roles. The thing that made me bring this movie down a few stars then i would have is the little brother, he is such an annoying pest and is scared of the silliest things. Emily Osment looked completely different in this movie compared to her character in Hannah Montana, it was pretty cool to see her dressed as a goth. The plot was unsatisfying but at least it ran smoothly. I would rate this movie 5 out of ten stars.",
         "Cool Movie! well, the starting was kinda boring and clichéd. ya know, the high school stuff, this dominating girl who grabs Cassie's crush and all.... but the middle gets good. And the end is the best part. the story's all about this goth girl (Cassie) who loves reading horror. she finds this out of the blue shop, where she bought herself a book called 'the evil thing' from a white haired weirdo. It turns out that this books so called 'evil thing' turns alive if you read it aloud. So soon, this evil monster grabs Cassie's brother Max, a pizza boy and the 'Pumpkin queen' Priscilla and locks them up in a spider web cocoon. What seriously gets on your nerves are the effects. they seem pretty cheap for a Universal movie. Anyways, Its typical R.L Stine stuff and that's exactly why its worth a watch!",
         "I thought this movie looked good in commericals and when I saw it a knew it was no box office it, but it was good. Emily Osment did an amazing job playing Cassie. It was really great seeing her play a total different role from Hannah Montana. Cody Linley, who played Sean also did a really nice job. I've always been a fan of his, so I was coming into this liking him already. I loved watching him play with the shock pen. That got a laugh out of me. I will agree that some of the jokes were cheesy, but some were kinda funny. Now, onto \"The Evil Thing\". I thought that they could've come with a better name, but that was in the book(?) so, that's fine. Also, it was really really fake looking. And I think the ending could've been a little better, but I saw that the title said \"Vol. I\" or something..so maybe a sequel? Even though it was really fake looking, I have to say parts of the movie I did get creeped out. All in all, it was a great Halloween movie. A fun thing to watch with your family or something.",
         "I had my doubts about this movie, I'll admit. Of course, after I saw it, I actually enjoyed it. Emily Osment's character Cassie, is a welcome change from the normal female protagonist: a goth! Finally! As much as I liked this movie though, there was something that bothered me, and this has probably been mentioned before: the ending. It starts the whole thing over. The good news is that it was really well-scripted and just plain funny and fun to watch. Other than that one minor hitch, this movie is excellent. 9/10",
         "had it not been for the commentary! If Emily wasn't giving away upcoming events in the film, she was talking over dialog and killing the mood of the scene. My son and I found it very annoying. I checked Tivo to see if there were any other showings of this movie, in case they showed it without the commentary. Hopefully the DVD will give viewers a choice between watching with commentary and without. The plot was interesting. The parts were played well and the kids did a good job bringing the characters to life. Good balance of drama and edge-of-your-seat suspense. All in all, remove the commentary, and this is a very good Halloween movie!",
         "\u0085made me want to physically shoot myself in the face. It is so bad that by the end of it I can guarantee you will have completely lost all faith in a decent horror movie. It started and I didn't know what to expect, within five minutes I was thinking \"God, this is terrible!\" and after fifteen minutes I had become heavily depressed and was on medication! The cast: The main characters are an extremely annoying family of four made up of: two parents who add literally nothing to the story and who seem not to care for their children whatsoever and leave them alone for basically all of the film; their daughter, a Goth who has less acting talent then Johnny Rotten on crack cocaine and who always plays tricks on her brother; who in turn is an excruciating boy with the most irritating accent I have ever heard who constantly screams for his mother. He's nothing but a spoilt brat (and if I were his sister, I would spend less time playing pranks on him, and hang him!). The plot: The plot of the film is less interesting then a nine-month-old baby's dream. The family move house and the daughter is put into a chavy new school where she meets the \"boy of her dreams\" (a blonde, retarded young fellow who walks around aimlessly, constantly wearing a false, sycophantic smile which makes you want to punch him in the face.). Anyhow, random things happen (whilst the audience falls asleep with boredom) - the retarded, blonde kid goes out with the Goth's new rival (who has another irritating accent) and the two brattish girls prank each other in unimaginative ways. Then the Goth buys a horror book and her brother (while still screaming for his mother) begs her to read the book. Upon reading it, she unleashes a monster. The \"monster\" is like something that Monster A Go-Go chucked out! It's basically just a huge cardboard cut-out that lumbers along, growls and savages people. Shocking! I went on IMDb to read some terrible reviews on this film, and have a laugh, but when (for some reason I can't explain) they were all positive, I decided to do my part. I have an obligation as a citizen of the world to warn you against this film. If you watch it, it will destroy your health and your sanity. It is without doubt the worst film I have ever seen and I didn't even watch it to the very end (thank God!). I didn't choose to put it on, I saw it at a friend's party (the poor soul not only has seen it all the way through, he keeps the wretched thing in his house!!!!!!!!!!!!!) Please don't watch this thing. It should be burned. I could make a better film than this, and if you don't believe me then give me a job as a director! I have only just recovered from this film and I would happily line everyone involved in it up, tie them up and force them to watch endless repeats of \"Manos: The Hands Of Fate\" for eternity.",
         "I ought to start by saying that Halloween is my favorite holiday. It is only 4 months away. I miss being a kid where you'd go from house to house trick or treating. I haven't gone since I was 14. Over the years, they've made lots of Halloween movies, usually kids movies and you can find them on TV like on ABC Family during Halloween. You can also find some random Halloween movies you haven't heard of like at RedBox during Halloween. Most of the Halloween movies are kids movies, and a lot of them seem more cheesy than they are scary. This movie is a great Halloween movie, and I could consider it the best one. It seems like a more entertaining film to watch on a big screen than Hocus Pocus which is like the most watched Halloween movie and which made the movie theaters. So, I watched this movie today after my work shift got cancelled because of the bad weather. It wasn't the only time I had seen it, I saw it a few years ago on my computer. I bought my own copy of the DVD at the SuperMarket during October 2013 but I hadn't watched my DVD copy of it yet and I decided to watch it today. This movie seemed to entertain me more today than when I watched it on my computer. Enough where I'd give it a 10. I even thought of the movie as a little scary, and there was a scene that made me move back on my chair and gasp. It definitely felt worth my time. I like this movie as it's an entertaining Halloween movie. The characters in the movie seem realistic. We have Cassie who is played by Emily Osment and instead of being the blonde we recognize her for she is a goth. We also have her little brother Max who wants to be close to his older sister, but she gets annoyed at him and he is scared of everything. We have Sean who is the cool guy in the school and Priscilla who is a popular school girl, but enemies with Cassie. This movie makes you feel a little at home and can even get you in the Halloween spirit early. It's also cool how this movie was filmed in my home state, Pennsylvania in Cranberry Township where my sister used to live by Pittsburgh. I felt like this was better done than most of R.L. Stine's work. Or, I would even consider this number 1 of what he made and possibly the best Halloween movie. We seem to get to know the characters better in this one, and you can even find out which character you're like on the DVD menu by answering questions about how you'd handle scary situations. But, the real thing that helped me from this movie in a positive way. Lots of movies will try to leave you with good messages that can be helpful in life and characters that can be role models or characters we can relate to. This movie will show messages like caring for family, and bravery, but here is how the movie helped me for a more personal example. I've graduated from college, and I'll admit I'm not the best at doing homework assignments without help, at times it can be hard for me to understand the material and I've had lots of tutors over the years. Even at college, my mom had set me up with a tutor who was even younger than I am. I used to feel super embarrassed that she was my tutor feeling like none of the other students had one. I tried to keep working with her a secret and felt ashamed at myself for having tutors in life. But, then there's Sean is this movie. He is a cool handsome friendly guy that's like every girls dream in the school. He needs help on a paper coming up that he's afraid if he doesn't get it he'll fail the paper as it's one of his weaknesses. He isn't afraid to ask for help as he knows he needs it. Though, we don't really think less of Sean because of it. He doesn't even seem to have a disability just not a strength at writing papers like Cassie and Priscilla. But, that doesn't keep him from being a cool likable character. So, this R.L. Stine movie had a character who helped me out in real life where I figured if I needed help I should ask for it, and I don't have to think less of myself because of it or have to hide it anymore. It's nice if movies can impact your life that much, it's a really positive thing you get out of the movie if they do impact your life in a positive way!!",
         "After trying to scare her brother with a tale of a monstrous creature, a teen finds that the titular creature has been released into the world and must try to stop it before it consumes more people from their town. This one ended being a pretty interesting teeny-bopper horror film that's quite fun. This is mostly due to the fact that it's more of teen drama in the first half before it focuses on the book and the creature being released, yet strangely none of this is really all that bad or boring. Though a majority of these scenes serve as the building of their relationship and home-life that gives their relationship a nice touch with all their teasing and tormenting, and the school troubles thrown in there's a great balance here of acceptable teen melodrama with the flirtings of a decent horror story. However, once the switch-over occurs, it's a lot more enjoyable here, starting with a creepy legend at the center of the film told within the book that's all quite fun overall. Moreover, this lead-up into a fantastic creature back-story allows for some highly enjoyable attacks scenes here which enable this one to really become worthwhile here, as the initial attack on the delivery-man and the later encounter in the park where it captures her friend with a rather tense and chilling stalking scene amidst the wooded area surrounding the park all coming off as pretty fun encounters. The creature' stalking them in the house is even more fun with some great stalking and a couple close-encounters while setting up the manner of defeating the creature found in the finale in its sewer-cave underground which is quite fun with the chilling crawl through the webbed tunnel the creature left behind, the confrontation in the pit with the hatched infants and the big confrontation with the creature that puts their knowledge learned earlier that gives this quite a fun amount of action. Along with a main creature that looks fantastic and has a lot of realism to it being a live-action creation and an overall sense of fun that arrives from the whole affair, there's not a whole lot to dislike here. However, due to the teen appearance and all of the focus surrounding them still making it entertaining despite the lack of focus on the horror angles, it doesn't have the air of danger it really should since nothing's going to get too frightening or dangerous for them and it won't really wallow in the usual trappings the genre normally dishes out, which makes for the film's one big flaw. It might make for a strained viewing getting past that once those get brought out and start holding up the plot somewhat. Otherwise, it's still not all that bad of a film. Rated PG: Violence and children-in-jeopardy.",
         "This movie is so very suited for Halloween, especially if you are a kid, teenager or if you got a family with kids. The movie is just the right amount of scary and thrilling to be great for family entertainment for the most spooky of Halloween eves. From the creator of Goosebumps, R. L. Stine, comes the thrilling tale of 13-year old Cassie who is stuck with her younger brother Max on Halloween. Being fed up with her brother and his mishaps, Cassie decides to tell him a scary story from a book that she acquired from a very odd Halloween store. Being spooked out of his mind, Max's imagination runs rampart, but the Evil Thing is not only a thing of his imagination. The acting in \"The Haunting Hour: Don't Think About It\" was really great, and the actors/actresses really brought the story to life on the screen. Emily Osment (playing Cassie) really carried the movie. Now, not being overly familiar with Hannah Montana, then I had no pre-assumed view of her roles. So for me, she was doing a great job in this particular family movie. \"The Haunting Hour: Don't Think About It\" tells a really good story that will keep the entire family entertained from start till end. The creature in the movie was great as well. Of course, it wasn't super CGI effects like in those blockbuster Hollywood movies, but still, the creature looked nice and was nicely made. It worked well enough for this kind of family movie. I am sure that this movie will go well with most viewers, especially young teens and families. If you got 1 hour and 23 minutes to spare on Halloween, then \"The Haunting Hour: Don't Think About It\" is well worth watching, be it alone or with your family.",
         "I simply love this movie! It's a fun flick that I enjoy watching anytime of the year. I especially like the fact that it was shot here in the Pittsburgh area. The boy who plays Ralph in the movie should have had a bigger part. He should have gone to fight the evil thing with the rest of them. Anyway, you should see him now!!! He's 16 and he has grow into quite a hottie!!! He is performing now with a group called the UNDALRDS. He performs under the name Z1Nation, and one of his hits is called Black Superman. To find out more about him, you search for him on google or youtube. His videos can be found on laydash's channel."
      ],
      "genres": [
         "Fantasy",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Studios Home Entertainment Family Productions",
         "Hatchery, The",
         "Steeltown Entertainment"
      ],
      "summaries": [
         "Cassie's life changes when she moves and attends a high school ruled by the most beautiful girl in school, Priscilla, and her beautiful sidekicks. Priscilla immediately takes a dislike to Cassie, and soon it's a battle between the two. But when Priscilla goes missing, along with Cassie's younger brother, Max, Cassie must go on an adventure and search for them before it's too late...",
         "When the Gothic new girl, Cassie, moves into the town, Priscilla the most popular, beautiful girl in school plots against her. But when Priscilla is kidnapped along with her brother, Cassie has no other choice but to search for them.",
         "Cassie, a 16-year old Gothic girl, is trying to fit in at her new school. To entertain herself, she plays a series of pranks on the popular kids and her younger brother, Max. When she goes to a Halloween store looking for new tricks, she finds a little book called 'The Evil Thing.'",
         "Bullied by her peers, tired of her parents and bugged by her little brother, goth girl Cassie decides to get some harmless revenge by reading a scary book to her brother - summoning a monster in the process."
      ],
      "budget": 3000000
   },
   "movielensId": 122043,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2007-09-04",
      "dvdReleaseDate": null,
      "directors": ["Alex Zamm"],
      "runtime": 87,
      "movieId": 122043,
      "title": "The Haunting Hour: Don't Think About It",
      "mpaa": "PG",
      "actors": [
         "Brittany Curran",
         "Alex Winzenread",
         "Michelle Duffy",
         "Emily Osment",
         "John Hawkinson",
         "Cody Linley"
      ],
      "imdbMovieId": "0905994",
      "originalTitle": "The Haunting Hour: Don't Think About It",
      "genres": [
         "Fantasy",
         "Horror",
         "Family"
      ],
      "youtubeTrailerIds": ["gFPta_CQRR8"],
      "plotSummary": "Cassie, a 13 year old Gothic girl, is trying to fit in at her new school. To entertain herself, she plays a series of pranks on the popular kids and her younger brother, Max. When she goes to a Halloween store looking for new tricks, she finds a little book called \"The Evil Thing\"",
      "tmdbMovieId": 21935,
      "avgRating": 2.7,
      "releaseYear": "2007",
      "numRatings": 10,
      "posterPath": "/beKslL2pfNrmWiafC4oG8hd4Zgh.jpg"
   }
}