{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prohibition",
            "id": 947
         },
         {
            "name": "scandal",
            "id": 3692
         },
         {
            "name": "inheritance",
            "id": 10911
         },
         {
            "name": "pre-code",
            "id": 156764
         }
      ],
      "imdb_id": "tt0021087",
      "video": false,
      "title": "Loose Ankles",
      "recommendations": [],
      "backdrop_path": "/avDaRbxlZQlyh7zUDm1MN6DXFT.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "fbacher",
         "id": "5ac37a270e0a260c2a03973b",
         "content": "Loose Ankles is an early B-grade, pre-code, comedy talkie starring Loretta Young and Douglas Fairbanks Jr.. Like many films of during the transition to talkies the plot is convoluted, the script weak and with mostly poor acting. Still, the film has appeal to those interested in this era.",
         "url": "https://www.themoviedb.org/review/5ac37a270e0a260c2a03973b"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ann",
               "gender": 1,
               "credit_id": "52fe4b819251416c751050af",
               "name": "Loretta Young",
               "profile_path": "/g5IlFLATSLpINVlaoV8Ncce2RCA.jpg",
               "id": 85848,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gil",
               "gender": 2,
               "credit_id": "52fe4b819251416c751050b3",
               "name": "Douglas Fairbanks Jr.",
               "profile_path": "/A8hI3VdDpt40pFQqljlc6WidrJv.jpg",
               "id": 51762,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Katherine",
               "gender": 1,
               "credit_id": "52fe4b819251416c751050b7",
               "name": "Louise Fazenda",
               "profile_path": "/4xlvZn1aUO3HtjiUozQz29lsNGC.jpg",
               "id": 97989,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Major",
               "gender": 2,
               "credit_id": "52fe4b819251416c751050bb",
               "name": "Otis Harlan",
               "profile_path": "/dvoCiNNoupmtAh3qUfBX5zOOO1P.jpg",
               "id": 5465,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Aunt Katherine Harper",
               "gender": 1,
               "credit_id": "5424339e0e0a263b81003b4e",
               "name": "Ethel Wales",
               "profile_path": "/6lp2gojcb2LYb8z9DEOT7rgxyyX.jpg",
               "id": 1016037,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Agnes",
               "gender": 0,
               "credit_id": "542433ad0e0a263b77003b33",
               "name": "Daphne Pollard",
               "profile_path": "/5RkfekMeGqCeZqY10uYuVvMgkuC.jpg",
               "id": 131431,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Betty",
               "gender": 1,
               "credit_id": "542433b9c3a3680880003aa5",
               "name": "Inez Courtney",
               "profile_path": "/niV0wt1LnlEqvdI9k0dvy9r9C3x.jpg",
               "id": 34244,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Andy Martin (as Eddie Nugent)",
               "gender": 2,
               "credit_id": "582add05c3a368360f043e22",
               "name": "Edward Nugent",
               "profile_path": "/qurCHN7gLek8HhEHJt567nE8MU1.jpg",
               "id": 30006,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mr. Berry from Logan (uncredited)",
               "gender": 2,
               "credit_id": "582add289251417b26043d35",
               "name": "Billy Bletcher",
               "profile_path": "/wVMoPHj7zTswZJx96VqY1yWgN8j.jpg",
               "id": 31771,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b819251416c751050ab",
               "name": "Ted Wilde",
               "profile_path": null,
               "id": 143558,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5424337cc3a3680883003ae7",
               "name": "Sam Janney",
               "profile_path": null,
               "id": 1367582,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "54243388c3a368088700378b",
               "name": "Gene Towne",
               "profile_path": null,
               "id": 284695,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.109637,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 146449,
      "vote_count": 2,
      "budget": 0,
      "overview": "To the dismay of most of a greedy, rich, extended family, grandmother's will  leaves her fortune to a few, mostly to her great-niece Ann (Loretta Young). Ann will only receive her inheritance once she marries, with the approval of three of her stuffed-shirt relatives and without scandal. Otherwise the estate goes to the cat and dog hospital. Ann, not needing the money, rebels by seeking scandal with a gigolo.  Director Ted Wilde's 1930 comedy stars Loretta Young, Douglas Fairbanks Jr., Louise Fazenda, Ethel Wales and Daphne Pollard.",
      "similar": [
         10112,
         3082,
         55787,
         209244,
         82633,
         117,
         497,
         1585,
         111,
         4147,
         149870,
         3078,
         244,
         6522,
         293,
         75900,
         379,
         9378,
         11775,
         596
      ],
      "original_title": "Loose Ankles",
      "runtime": 67,
      "poster_path": "/6Cd6AKli36T5ShldkQxGEjzgL7f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "First National Pictures",
         "id": 3245,
         "origin_country": ""
      }],
      "release_date": "1930-02-02",
      "vote_average": 2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Ted Wilde"],
      "runtime": 69,
      "synopsis": null,
      "writers": [
         "Sam Janney",
         "Gene Towne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021087/",
      "coverLink": null,
      "actors": [
         "Loretta Young",
         "Douglas Fairbanks Jr.",
         "Louise Fazenda"
      ],
      "reviews": [
         "This film, based on a 1926 stage play, is extremely funny and fun to watch. It is also somewhat hard to find. I was fortunate to see it screened at Cinevent 39. The story concerns a group of society people hearing a will read to them. The deceased's niece (Loretta Young) has most of the luck when an estate is left to her under the condition that she find a husband and no scandal be brought to the family. Everyone else's inheritance depends on this clause, but Ann (Young) doesn't want her share. In fact, she's determined to force everyone out of theirs because she thinks the family is too greedy. Off she goes to put an ad in the paper for a boy to \"compromise her.\" Andy (Edward Nugent) finds it in the paper and thinks he'd be perfect for the role, but instead thinks maybe his room mate Gil (Douglas Fairbanks Jr.) would be better suited. In a very funny scene, Gil goes to Ann's home and is taken advantage of by the maid (Daphne Pollard). Somehow, they all end up at a speakeasy where Ann's uptight aunts Katherine (Ethel Wales) and Sarah (Louise Fazenda) steal the show during a drunken spectacle where Andy tries to control his laughter. This film is certainly a pre-code. Aside from outright illegal drunkenness, we see Andy taking a bath and women disrobing men, along with the generally racy storyline. Possibly the reason they got away with so much (besides being made during the pre-code era) is because this film is based on a play. Thankfully, the camera-work does not make the film's roots evident. Of course, there are many shots that look like characters on a stage, but we also have a moving camera and many close-ups to take advantage of the beautiful stars. Young and Fairbanks struggle with their dialogue, but there are enough scenes with the character actors to make up for their scenes.",
         "This film is a little known entry from the early days of \"talkies\" that deserves better recognition. Not a masterpiece by any means, it is still a forerunner of the screwball comedies of the later 30s and 40s and, as such, is pleasant and delightful in its own way. The cast is very good. It is hard to believe that Loretta Young, playing an heiress who wants to create a family scandal, was only sixteen or seventeen when this movie was made. She has a charm and sensuality that belies her years. Douglas Fairbanks, Jr., who was nearly as young, does a nice job as a bumbling wannabe gigolo who falls in love with Loretta. Also, as noted by other reviewers, Louise Fazenda, as Young's aunt, and Daphne Pollard, as the \"helpful\" maid, give very funny performances. The next time that this movie is on TCM, try to catch it or tape it. There are a lot worse ways to spend an hour or so.",
         "A free spirited young heiress with LOOSE ANKLES shocks her rapacious relatives by embarking on a scandal with a naïve paid escort. Loretta Young & Douglas Fairbanks, Jr. star in this forgotten pre-Code comedy. Heady with too much dialogue, as were so many of the first talkies, it tends to creak badly, leaving the performers to strain a bit for laughs. Very little more is required from the two leads than to look attractive and recite their lines. However, there are some fun performances from the supporting cast which makes the film worthwhile. Louise Fazenda & Ethel Wales are a hoot as two stuffy old prunes who loosen-up when liquored-up at a fancy speakeasy--Fazenda's flat-on-the-floor wrestling match with gigolo Eddie Nugent is worth sitting through the rest of the movie. Spunky little Daphne Pollard (the occasional cinematic bane of Oliver Hardy's life) scores as Miss Young's feisty maid; watching her divest Fairbanks of his trousers so as to cinch the scandal is hilarious. Otis Harlan appears as a blustery Major. Movie mavens will recognize silent comic Billy Bletcher, uncredited as the diminutive relative from Logan.",
         "After receiving a \"foot powder\" (as director Ted Wilde has the camera caress her beautiful legs), pretty Loretta Young (as Ann Harper Berry) is ready to attend the reading of a wealthy grandmother's will. She inherits a fortune, but Ms. Young must marry a nice young man and avoid scandal in order to collect. Young decides to advertise. She finds good-looking and unscrupulous Douglas Fairbanks Jr. (as Gil Hayden) through an escort service. However, their business arrangement gets complicated by love and scandal... Young's sexy opening is followed by the beautiful actress appearing in slinky attire. Not to be outdone, Mr. Fairbanks is stripped of his clothing by zealous maid Daphne Pollard (as Agnes), in order to assume a \"compromising\" position. However, it is cute gigolo Eddie Nugent (as Andy Martin) who gets the naughtiest scenes. Introduced in a bathtub, Mr. Nugent later appears without his pants; apparently, for no other reason than to exchange more personal foot spankings with fellow escort Norman Selby (as Terry Todd)... The cast winds up in the wicked \"Circus Cafe\", with leggy dancers and plenty to drink. Straight-laced aunts Ethel Wales (as Katherine) and Louise Fazenda (as Sarah) don't know the punch is spiked. Also appearing are snorting Otis Harlan (as Rupert Harper), smoking Inez Courtney (as Betty), and studly Raymond Keane (Linton Harper). Young and Fairbanks become mechanical as the supporting players take over the screen. \"Loose Ankles\" is stolen from them, especially by Nugent and Ms. Wales. ******* Loose Ankles (2/2/30) Ted Wilde ~ Loretta Young, Douglas Fairbanks Jr., Edward J. Nugent, Ethel Wales",
         "... but overall it was a delightful little precode with Loretta Young seeming much more mature than her 17 years would have you expect. The film opens with a close up of Loretta's ankle swaying to the beat of the title song \"Loose Ankles\" her foot is wearing only an ankle bracelet as a man's hand caresses her leg and foot. The camera pans back and we see that the man is just a pedicurist surveying his work. That's the fun about precode. Nothing has to happen. By today's standards nothing really does. It's the possibilities and the implications. The back story here is that Grandma Berry has just died and her already wealthy relatives are drooling for more on this, the day of the reading of her will. Ann Harper Berry (Loretta Young) turns out to be the recipient of the lion's share of the estate, but she must marry and also bring no scandal - as in nothing in the newspapers - to the Berry name in order to fully inherit. To incentivize the rest of the family, they cannot inherit their portion of the estate until Ann marries. Ann rebels against the entire set-up and puts out an ad for a \"young unscrupulous man\" to compromise her and cause a newspaper-worthy scandal so she and her greedy family will be barred from the inheritance. Gil Hayden (Douglas Fairbanks Jr.) is the man who applies for the job at the cajoling of his male escort roommates who are trying to get him back into the workforce, and Ann is under constant watch by the rest of the family to make sure she causes no scandal. The scene in her bedroom as an inexperienced Ann tries to figure out the actual mechanics of creating a scandal with Gil with the help and advice of her obviously quite experienced maid is worth the price of admission. This film runs 69 minutes and probably would have been better paced if it had been about 15 minutes shorter. It features a nightclub scene that drags on way too long with not much going on during a large portion of that time. Louise Fazenda is a hoot as one of Ann's aunts, but it is odd that Warner Brothers had her dressed up as a bit of a vixen the year before in \"On With the Show\" and here she is playing a woman in her 50's - she was only 35 at the time. It's obvious they have her wearing some kind of body suit to make her look much heavier and older than she is. The dancing act in the nightclub - \"The Circus Cafe\" - is unique among nightclubs with lots of toe dancers and clowns doing acrobatics. It's not every day that you see circus themed entertainment in a Prohibition era speak easy, and quite frankly it was very reminiscent of the final scene in \"Gold Diggers of Broadway\". If this one was a little faster paced I'd give it an eight, but as it is I give it an entertaining seven as it makes the excellent point that people are neither as wild or as tame as they might seem on the surface or as they imagine themselves to be.",
         "Loose Ankles (1930) ** 1/2 (out of 4) Rich girl Ann Harper (Loretta Young) inherits her grandmother's fortune but she must get married and have the man approved by two of three selected people as well as avoid any scandal. Feeling the entire thing is a bunch of junk, Ann decides to \"hire\" Gil Hayden (Douglas Fairbanks, Jr.) to make some trouble and cause her the inheritance. LOOSE ANKLES starts off on a very good path but it quickly falls apart during the second half but there's still plenty of reasons to check this out. If you're a fan of Douglas or especially Young then this here is going to be a must see because the two of them have some nice chemistry together and this helps keep the film moving at a good pace. This is especially true for Young who is very good in the part and the director wastes no time showing off her beautiful legs. The film certainly fits the pre-code standard of allowing more frank situations to enter and there's a very funny scene where Young is trying to undress Fairbanks but not really knowing how. Another funny scene is the will reading where Young really gets a chance to shine. The supporting players are also good and help keep this film moving. I think the film starts off well but begins to fall apart in the second half because things get a tad bit too silly for their own good. Still, fans of the stars or pre-code films should still have plenty here to enjoy.",
         "I was really looking forward to this one. Ted Wilde directed my all-time favorite Harold Lloyd picture, Speedy (1928), and another of my top five Lloyd bests, namely The Kid Brother (1927). So I've always been curious about the other three features he directed before his early death in late 1929, namely Babe Comes Home (1927) – Babe Ruth that is, of course – Clancy in Wall Street (1930) and Loose Ankles. Now Loose Ankles proved a little disappointing for me first time around, but, oddly, it improved a lot on a second viewing. I particularly enjoyed young Loretta Young's performance on both occasions, but I thought young Doug Fairbanks' more subtle playing improved no end on my second view. Interestingly, Loretta had acted with young Fairbanks in a Clayton's murder thriller – the murder you have when you don't have a murder – The Careless Age (1929) in which young Doug was the star and Loretta's role of little importance (even though she was billed fifth). Getting back to Loose Ankles, Otis Harlan's stagey over-acting seemed even more superficial on a second viewing. And the same goes for Louise Fazenda. Although obviously filmed on a tight \"A\" budget, nevertheless the movie's attractive costumes and bright photography were both impressive. Available on an excellent Warner Archive DVD.",
         "A good friend loaned me a copy on tape and I am grateful! This is a rare film so catch it if you can! SPOILERS:A young woman stands to inherit a million bucks in this comedy. The deal is thus: her aunts will give her a cool million if she can stay out of trouble and marry a reputable man with a clean background whom her benefactors approve of. The girl eagerly advertises for her mate, and she finds a handsome fellow with whom she falls in love. The trouble is the man is a gigolo and the aunties most definitely do not approve. Fortunately for him, his buddies intervene and threaten to make public an embarrassing incident involving the ladies and a certain raided cafe. They quickly change their minds and happiness ensues.",
         "I enjoyed so many of the performances in this movie. The plots been summarized in other reviews, so let me just mention my favorites. Louise Fazenda as Aunt Sarah lets loose with some great physical comedy. According to IMDB she was 45 when this was made, but had performed in Mack Sennett comedies and her training shows in this. I also enjoyed the maid (Inez Courtney?) who responds to Loretta Young's comment that she \"must have been in a comprising position at one time\" -- \"Oh, the position wasn't so bad.....\" The help she provides to the young and innocent Loretta as she tries to involve herself in scandal is quite funny. A very enjoyable way to spend just over an hour.",
         "\"Loose Ankles\" has a lively start (certainly any movie that opens with a close-up of Loretta Young's legs starts on the right foot - pun intended), Young and Jr. (Douglas Fairbanks Jr., that is) are appealing, and Inez Cortney is a joy as Young's cousin. But when the focus switches to Young's two middle-aged aunts and their two \"professional escorts\", especially in the extended \"circus cafe\" segment, the film becomes dreadfully unfunny. ** out of 4.",
         "Based on a successful play and moderately pre-Code, this look at 1930 Flaming Youth has Loretta Young as a not-that-interesting heiress and Douglas Fairbanks Jr., looking younger than I've ever seen him, as the nice boy forced to pose as a gigolo by his roistering buddies. There's some amusing pre-Code clucking about overnight guests of the opposite gender, and a lot of footage given over to Louise Fazenda, as a too-prim aunt unwittingly given some liquor and turning into a loose woman; this was the era when alcohol was still automatically hilarious. Warners peddles its own contemporary hit songs in the background (\"Am I Blue?\", \"Painting the Clouds With Sunshine\") and there's some clunky choreography in the nightclub sequence, but the focus is mostly on Loretta and Doug, who are quite charming together. His lack of experience shows, but he's convincingly a young man in love, and what young man could wish for a lovelier conquest than Loretta. An undemanding time capsule, with sufficient spirit.",
         "During 1930-31 Loretta Young churned out 14 films, none of them were that good and her acting bland at best. She once said of these movies - \"I was coasting on my youth and I knew it\" and the titles tell the tale ie \"Loose Ankles\", \"I Like Your Nerve\", \"The Truth About Youth\" etc. \"Loose Ankles\" was a film considered so trivial that it didn't even rate a New York review - Loretta may have been the star but the film only came alive when the supporting players were given the spotlight. That included bouncy Inez Courtney who introduces the jazzy song \"Loose Ankles\" at the film's start and even though the first shot was of Young's rather loose ankles being massaged, the film didn't live up to it's racy start!! The film starts off when beautiful Ann Harper (Young) finds the only way she can capture her inheritance is on the death of her husband but being a carefree flapper she doesn't even have a steady beau!! The real kicker is that if she finds herself caught out in a public scandal the whole estate will be given to a dog and cat home!! Of course because she has no interest in money she immediately sets about to get her picture in the papers!! She advertises for a handsome but unscrupulous man and it is instantly seen by a trio of male escorts!! This is when the fun starts - as Eddie Nugent takes centre stage, with his mad mugging and eye rolling, he is a riot!! Sure, he'd love the job but he decides to offer it to young Gil (Douglas Fairbanks Jnr.) a decent chap who is down on his luck job wise!! Wouldn't you know it, it is love at first sight for Ann and Gil and after a farcical bit containing lost pants and hiding in closets, helped immeasurably by Daphne Pollard's resourceful maid - everyone heads to the Circus Café. Ann has now engaged the services of one of the other escorts, Lin, who is big on unscrupulousness but small on niceness. She is hoping to meet up with Gil because she found the tickets in his pants - the only problem is, they weren't Gil's. After a pretty bizarre circus/cabaret dance routine along comes third billed Louise Fazenda as straight laced Aunt Sarah and most of the rest of the movie consists of that old faithful \"drunk routine\"!! You know the one, where two maiden aunts of the \"lips that touch liquor shall never touch mine\" variety proceed to get well and truly plastered and claim that they can do the dance better than the two professionals out on the dance floor!! The film really opens out at the club which has a very similar look to some of the sets from \"Gold Diggers of Broadway\" but the film betrays it's stagey, early talkie origins when the whole cast gathers to pair off at the finale!!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["First National Pictures"],
      "summaries": ["In this light romantic comedy, 17-year old Loretta Young is cast as Ann Harper, a wealthy socialite who has inherited a fortune provided the family is involved in no scandals appearing in print, and her two aunts and uncle consent to the marriage. Put off by all this, she is determined to cause a scandal so that none of the family will receive any of the inheritance. An arrow-straight Fairbanks is volunteered to be the one to \"compromise\" her, but the two end up falling for each other. Upon being discovered in Loretta's boudoir, Fairbanks makes a hasty exit out of the nearest window. The romance seems destined to fail, but Fairbanks (and his two friends) have other ideas, which are accidentally \"aided\" by the two prudish aunts."],
      "budget": 0
   },
   "movielensId": 122009,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1930-02-02",
      "dvdReleaseDate": null,
      "directors": ["Ted Wilde"],
      "runtime": 67,
      "movieId": 122009,
      "title": "Loose Ankles",
      "mpaa": "",
      "actors": [
         "Loretta Young",
         "Douglas Fairbanks Jr.",
         "Louise Fazenda",
         "Otis Harlan",
         "Ethel Wales",
         "Daphne Pollard",
         "Inez Courtney",
         "Edward Nugent",
         "Billy Bletcher"
      ],
      "imdbMovieId": "0021087",
      "originalTitle": "Loose Ankles",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["jYL-uP_8wIs"],
      "plotSummary": "A young woman tries to scandalize her snotty family by romancing a gigolo. Director Ted Wilde's 1930 comedy stars Loretta Young, Douglas Fairbanks Jr., Louise Fazenda, Ethel Wales and Daphne Pollard.",
      "tmdbMovieId": 146449,
      "avgRating": 2.75,
      "releaseYear": "1930",
      "numRatings": 2,
      "posterPath": "/6Cd6AKli36T5ShldkQxGEjzgL7f.jpg"
   }
}