{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "soccer",
            "id": 13042
         },
         {
            "name": "teenager",
            "id": 13130
         }
      ],
      "imdb_id": "tt0469429",
      "video": false,
      "title": "Her Best Move",
      "recommendations": [
         374606,
         39213
      ],
      "backdrop_path": "/cnxLPz8BgniHDkb5Zqq2AsI1AX4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sara Davis",
               "gender": 1,
               "credit_id": "52fe47899251416c7509cfcb",
               "name": "Leah Pipes",
               "profile_path": "/6j3w5G3e9aDZA11hkqSdCEhQ1CP.jpg",
               "id": 83285,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gil Davis",
               "gender": 2,
               "credit_id": "52fe47899251416c7509cfcf",
               "name": "Scott Patterson",
               "profile_path": "/tXrO1CHnuR6zjpHh2JXNtozW0XC.jpg",
               "id": 50020,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Julia Davis",
               "gender": 1,
               "credit_id": "52fe47899251416c7509cfd3",
               "name": "Lisa Darr",
               "profile_path": "/suaqO1IP94WPbBZHX9CkHaeDlQc.jpg",
               "id": 83286,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Josh",
               "gender": 2,
               "credit_id": "52fe47899251416c7509cfd7",
               "name": "Drew Tyler Bell",
               "profile_path": "/vVkMB4jFFyBPVInjlwGzDp1RHYS.jpg",
               "id": 23497,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tutti",
               "gender": 1,
               "credit_id": "59b5f3759251417cca006e32",
               "name": "Lalaine",
               "profile_path": "/8yiFkScw8D3IRnyTdiYQr6v4Enw.jpg",
               "id": 125047,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47899251416c7509cfdd",
            "name": "Norm Hunter",
            "profile_path": null,
            "id": 591410,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.429386,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18598,
      "vote_count": 12,
      "budget": 0,
      "overview": "15 year-old soccer prodigy, Sara Davis, has a chance to join the U.S. National Team, but she must juggle high school, romance, sports, and parental pressure while deciding her own priorities.",
      "similar": [
         13416,
         9655,
         10637,
         18172,
         192132,
         2108,
         8363,
         8193,
         9291,
         8456,
         22881,
         8923,
         2300,
         10229,
         85350,
         272693,
         315635,
         449176,
         10625,
         9880
      ],
      "original_title": "Her Best Move",
      "runtime": 101,
      "poster_path": "/ehGsxfFUx5PuP6Xj0NchxodXHaD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Summertime Films",
            "id": 3510,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Her Best Move LLC",
            "id": 3511,
            "origin_country": ""
         }
      ],
      "release_date": "2007-03-31",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Norm Hunter"],
      "runtime": 101,
      "synopsis": "15-year-old female soccer prodigy Sara Davis (Leah Pipes) has the chance to join the U.S. National Team, but she must find a balance with high school, romance, sports, and parental pressure while realizing her own priorities. High school life is crazy enough, but for Sara, it's about to escalate. A national calibre soccer prospect with skills honed by her father Gil (Scott Patterson), a women's soccer coach, Sara has sacrificed her interest in dance, photography and of course boys to concentrate on her sport. With the encouragement of best friend Tutti (Lalaine), Sara begins a growing relationship with Josh (Drew Bell), the cute but shy photographer on the school newspaper, and learns more about herself each day. As National Team scouts watch her every shot, Sara faces the challenge of discovering her true self, so she can make the best move of her life.",
      "writers": [
         "Norm Hunter",
         "Tony Vidal"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0469429/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgwMDU5NjcyMF5BMl5BanBnXkFtZTcwMTc0NTY3MQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Daryl Sabara",
         "Leah Pipes",
         "Lisa Darr"
      ],
      "reviews": [
         "This film is about a teenage girl pursuing her dream to become the youngest player in the national soccer team. \"Her Best Move\" is a typical teen flick. The lead character, Sara, faces school, parents, romance and pal problems. It's predictable and formulaic, but I enjoyed it. It's light hearted and fun, jokes are good, and most importantly it is not stupid or vulgar like some teen flicks are. It's even got a serious subplot of parental conflict! The final tournament is well made, it is actually exciting even to a person who is completely indifferent to the sport. \"Her Best Move\" is a n above average brain off film to kill time with.",
         "Young teen Leah Pipes is your normal average teenage girl with all kinds of interests, music, dance, and of course boys. But her dad Scott Peterson wants her to devote herself completely to women's soccer because he feels she's got the right stuff to be on the USA national team. Her life is all messed up because of Dad's single mindedness. But of course in the end it all works out for Pipes and she even gets the school newspaper photographer, Drew Tyler Bell which is sure no consolation prize. Nothing terribly out of the ordinary about this Disney Channel movie. But the cast is easy to take and the film's a decent slice of teen life.",
         "15-year-old Sara Davis has a chance to make the national soccer team, something even Mia Hamm didn't do at that age. She already plays on a U-19 team (and focuses on making herself look good rather than on the team), as well as working out with a team coached by her father Gil. The U-19 team is on its way to the California state championship; coach Laurie was a player on one of Gil's college teams. Gil pushes Sara hard and insists she make soccer her no. 1 priority, even though Sara isn't all that enthusiastic and could have other interests. and one drawback to making the national team--they practice in Florida, 3000 miles from home. Sara has no social life outside of soccer, though she does have a quirky best friend Tutti who has weird taste in clothes. The boys don't think she is pretty, but she is. She just doesn't try hard to show it. There is one boy Josh who is an old-school photographer for the school paper and yearbook--he develops photographs in a dark room. He has been spending a lot of time taking Sara's picture, and there is a dance coming up. Speaking of dancing, Sara's dance teacher thinks Sara should audition for a school production. But how will Sara find the time? In addition to everything else she works at an ice cream place with the annoying Doogie. But somehow Sara tries to make it all work. Meanwhile, her father never seems to be at home anymore. It is her mother Julia who is actually taking care of her, and Julia feels Sara shouldn't push so hard if soccer isn't what she wants. Gil disagrees since one doesn't get to the Olympics without a total commitment. There is nothing that special here. It's an enjoyable movie and Sara is easy to like. The romantic stuff is pleasant most of the time, but like a WB/CW teen drama this movie has its depressing moments with equally depressing music. And along with the comedy, there is some drama resulting from jealousy and rumors. On the subject of music, for someone like me there is bland synthesized background music, but most of the so-called music is designed for the young people, and often quite loud. One positive is the fact so much of the music seems to be from when I was in high school, though it is still loud. I know Scott Patterson mainly as the likable curmudgeon from \"Gilmore Girls\". Here, there's not much to like about him at first. He is driven and lacks personality. But that changes later. One relationship I would like to have seen more of is that of Regina and her father. Regina also has the potential to go far as a soccer player, if Sara will stop trying to be the star. Regina's Papá cares more about her brothers than her, and she wishes he would pay more attention to her. But he is a loving father and I can see this from only a few lines. Lalaine and Daryl Sabara stand out from the rest of the cast, but for different reasons. Tutti is merely quirky but likable, while Doogie is just plain annoying, but enjoyable to watch at the same time. This is a family film with nothing offensive. It's nothing groundbreaking but still a pleasant experience.",
         "Sara Davis (Leah Pipes), a 15-year-old female soccer prodigy, has a chance to join the U.S. National Soccer Team. Her daily life is extremely hectic, as she finds a balance between high school, romance, sports, and parental pressure while realizing her own priorities. Sara, coached by her father Gil (Scott Patterson), sacrifices her interest in dance, photography, and her social life to concentrate on her sport. With the encouragement of her best friend Tutti (Lalaine), Sara begins a relationship with Josh (Drew Bell), the solitary photographer on the school newspaper. As she takes control of her life, Sara faces the challenge of discovering what she really wants, so that she can make the best move of her life.",
         "Sara (Leah Pipes) is 15 year old, obsessed with soccer, and is a top prospect. She is rejected for the National Team development squad at first but after an injury, they're looking for a replacement. Her dad (Scott Gordon-Patterson) is almost as obsessed although her mom (Lisa Darr) isn't as sure. The family life suffers. Her best friend Tutti (Lalaine) tries to get her back to normal life. And high school photographer Josh (Drew Tyler Bell) keeps hanging around the soccer field. The production is pretty weak and so are the jokes. This starts off badly with the boys claiming that Leah Pipes is undateable. That's pushing it too far. The high school stuff is so high school. The fights and complications are all very lame. The puppy love has its charms. Leah Pipes is a perfectly nice actress. That plus the fact that the movie's heart is in the right place. It's not a complete waste of time.",
         "Like I said before, this week is finals weeks, so I will not have time to watch long movies at all this week\u0085so I decided to watch a kids movie that lasted a little over an hour. Her Best Move was a story of a young girl who pushes herself to be the best soccer player\u0085mainly because of her father. It was an interesting movie\u0085but poorly acted. I wouldn't recommend this movie, mainly because it really wasn't worth watching it in the first place. You could tell it was a made for TV movie\u0085or a straight to DVD movie. I'm not going to get a good selection of movies this week because of the time restriction\u0085but we'll have to see. For daily movie reviews visit: htt;//kimsmoak.com/"
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "Summertime Films",
         "Her Best Move LLC"
      ],
      "summaries": [
         "The story of high school soccer prodigy Sara Davis as she juggles life, love and sports on her way to becoming the youngest player ever selected to the U.S. National Team. Conflicts arise as Sara deals with her over-zealous sports dad, a free-spirited boyfriend and her hectic existence in the social quicksand commonly known as high school. Blends comedy, romance, and soccer footage.",
         "15 year-old soccer prodigy, Sara Davis, has a chance to join the U.S. National Team, but she must juggle high school, romance, sports, and parental pressure while deciding her own priorities."
      ],
      "budget": 2400000
   },
   "movielensId": 122033,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2007-03-31",
      "dvdReleaseDate": null,
      "directors": ["Norm Hunter"],
      "runtime": 101,
      "movieId": 122033,
      "title": "Her Best Move",
      "mpaa": "G",
      "actors": [
         "Leah Pipes",
         "Scott Patterson",
         "Lisa Darr",
         "Drew Tyler Bell",
         "Lalaine"
      ],
      "imdbMovieId": "0469429",
      "originalTitle": "Her Best Move",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["QobrDZTSAFI"],
      "plotSummary": "15 year-old soccer prodigy, Sara Davis, has a chance to join the U.S. National Team, but she must juggle high school, romance, sports, and parental pressure while deciding her own priorities.",
      "tmdbMovieId": 18598,
      "avgRating": 3.25,
      "releaseYear": "2007",
      "numRatings": 2,
      "posterPath": "/ehGsxfFUx5PuP6Xj0NchxodXHaD.jpg"
   }
}