{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gold",
            "id": 1321
         },
         {
            "name": "christmas eve",
            "id": 33965
         },
         {
            "name": "scrooge",
            "id": 33966
         },
         {
            "name": "miser",
            "id": 33969
         },
         {
            "name": "doom",
            "id": 33970
         }
      ],
      "imdb_id": "tt0123179",
      "video": false,
      "title": "Mr. Magoo's Christmas Carol",
      "recommendations": [
         43517,
         5745,
         83671,
         33454,
         50717,
         17278,
         46955,
         38716,
         25953,
         48741,
         63439,
         304878,
         73901,
         52120,
         91847,
         186585,
         19319,
         3931,
         57849,
         55441
      ],
      "backdrop_path": "/fZmoZ8MHLpHXWQgx3wA8Vp8O3d4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Ebenezer Scrooge / Mr. Magoo (voice)",
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140ad9",
               "name": "Jim Backus",
               "profile_path": "/iBZLbwdnnT9pFnBIlBZPfT6n06b.jpg",
               "id": 2771,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Brady / James (voice)",
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140add",
               "name": "Morey Amsterdam",
               "profile_path": "/AvVdSuIf5xnBhwaH0cATLRTLMmj.jpg",
               "id": 105637,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Bob Cratchit (voice)",
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140ae1",
               "name": "Jack Cassidy",
               "profile_path": "/2MYYxEj5MX0zyjn4DfciT4oguj6.jpg",
               "id": 111989,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Marley's Ghost (voice)",
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140ae5",
               "name": "Royal Dano",
               "profile_path": "/5kHyvS5Xaa97Lulrxy0ZgtqHqMI.jpg",
               "id": 19968,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Stage Director / Charity Man / Fezziwig / Eyepatch Man / Tall Tophat Man (voice)",
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140ae9",
               "name": "Paul Frees",
               "profile_path": "/ey4xNbw7AfFW7brHnb3C9ADL34Q.jpg",
               "id": 16417,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tiny Tim / Ghost of Christmas Past (voice)",
               "gender": 1,
               "credit_id": "52fe47a4c3a36847f8140aed",
               "name": "Joan Gardner",
               "profile_path": "/k3YteYmjUOtoXNCgUdBNwjySFZS.jpg",
               "id": 142724,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Belle (voice)",
               "gender": 1,
               "credit_id": "52fe47a4c3a36847f8140af5",
               "name": "Jane Kean",
               "profile_path": "/fpuUpzY01kfaJXqC0NpCfQBQmDo.jpg",
               "id": 142726,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Young Scrooge (voice)",
               "gender": 1,
               "credit_id": "52fe47a4c3a36847f8140af9",
               "name": "Marie Matthews",
               "profile_path": null,
               "id": 142727,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mrs. Cratchit (voice)",
               "gender": 1,
               "credit_id": "52fe47a4c3a36847f8140afd",
               "name": "Laura Olsher",
               "profile_path": null,
               "id": 142728,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Ghost of Christmas Present (voice)",
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140b01",
               "name": "Les Tremayne",
               "profile_path": "/mWXxR42D22b4vRLCUOqC4zyIPs.jpg",
               "id": 2648,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Billings / Stage Manager / Milkman (voice)",
               "gender": 0,
               "credit_id": "541062d4c3a3685ea1001ba9",
               "name": "John Hart",
               "profile_path": "/zgKm6Qtpd3dcrNPc3TsQ2s7NJpe.jpg",
               "id": 1362785,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140ac9",
               "name": "Abe Levitow",
               "profile_path": "/51YA4HFfosLUptdam64lFncTK8d.jpg",
               "id": 100890,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a4c3a36847f8140acf",
               "name": "Charles Dickens",
               "profile_path": "/doxkq5losIrz2UyBm6ijmw5biYI.jpg",
               "id": 3557,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a4c3a36847f8140ad5",
               "name": "Barbara Chain",
               "profile_path": null,
               "id": 142723,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.791564,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49742,
      "vote_count": 18,
      "budget": 0,
      "overview": "An animated, magical, musical version of Dickens' timeless classic \"A Christmas Carol.\" The nearsighted Mr. Magoo doesn't have a ghost of a chance as Ebenezer Scrooge, unless he learns the true meaning of Christmas from the three spirits who haunt him one Christmas Eve.",
      "similar": [
         962,
         10147,
         296100,
         17979,
         562,
         3090,
         1581,
         1585,
         818,
         284,
         8871,
         49524,
         858,
         10530,
         508,
         634,
         671,
         6637,
         9654,
         1572
      ],
      "original_title": "Mr. Magoo's Christmas Carol",
      "runtime": 53,
      "poster_path": "/v373WxuWPaUlincYeu6AIzcZUV8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Productions of America (UPA)",
         "id": 8409,
         "origin_country": ""
      }],
      "release_date": "1962-12-18",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Abe Levitow"],
      "runtime": 53,
      "synopsis": null,
      "writers": [
         "Charles Dickens",
         "Barbara Chain"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0123179/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2NjA0OTAwMF5BMl5BanBnXkFtZTgwMDU4Njc1MzE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jim Backus, Morey Amsterdam, Jack Cassidy | See full cast and crew »"],
      "reviews": [
         "This wonderful animated film is timeless. I had the special privilege of working with those talented individuals in this production. (I was the voice of young Ebenezer Scrooge.) Jim Backus, Royal Dano, Paul Frees, and all the rest were pure magic working together. You can imagine the antics that went on during rehearsals and taping. We were laughing almost as much of the time as we were performing our parts! The music (Walter Scharf, Bob Merrill, Jule Styne) had a style all its own which perfectly matched the characters and settings. It's no wonder this production has been so popular year after year. I'm sure it will continue to bring enjoyment to families for many years to come.",
         "Right now I am trying to figure out what to do this Christmas, since the family tradition is a-tremor. The thought of being alone on Christmas deeply saddens me, and I think it goes back to seeing little Ebenezar Scrooge left behind in boarding school while all the other kids had families to go home to for Christmas. I cried just like Mr. Magoo's older Scrooge did when he saw himself as a kid singing: When you're alone, alone in the world When you're alone in the world Blown-away leaves get blown in the world Swirled-away leaves get swirled A hand for each hand was planned for the world Why don't my fingers reach? Millions of grains of sand in the world Why's mine a lonely beach? Where are the heels to click to my clack? Where is the voice to answer mine back? I'm all alone in the WOOOOORLD!!! None of the other versions caught this scene the way this one does. Not Bugs Bunny, Bill Murray, Albert Finney, Mickey Mouse. Maybe Alistair Sim, sort of. Simplistic, yes, but it's the scene that still sticks in my throat as I choke back an adult tear. It's the scene that makes this version, truly unique, all alone in the world.",
         "Like others, I too had vivid memories of watching this as a child in the 60's. I could still remember the \"razzleberry dressing\" lines and the disembodied mouths singing the \"Despicable\" song some 30 years later when I finally saw it being broadcast again, and was able to record it off the air. Over the past ten years I've watched that tape repeatedly, and never cease to be amazed at the portrayal and the remarkable music and lyrics. But it wasn't until I got the DVD version as a Christmas gift that I realized nearly ten minutes had been cut from that broadcast version. Imagine my delight to watch the DVD and \"discover\" three whole scenes (including two complete songs) that I'm sure I hadn't seen since the original prime time airings in the 60's. The DVD quality is excellent as well (in contrast to the annoying \"speed change\" glitches in the broadcast soundtrack). If, as I do, you consider this a Christmas \"classic\", don't rely on broadcast showings -- get the DVD, and enjoy it in its entirety.",
         "This has always been one of my favorite Christmas specials; however, one of the scenes that makes it so memorable has been cut out of the newest release. When I watched this growing up in the late 70's and early 80's, I never saw the opening and closing \"Broadway\" scenes. Users on IMDb and other websites have commented that they were delighted to have these missing scenes in the latest version. Unfortunately, I do not share their enthusiasm. I find these book ending scenes annoying and darn-near un-watchable. The \"Back, back, back on Broadway\" number that opens the special makes me want to leave the room. The slapstick is completely unrelated to the tone of the play and distracting. I must come clean that I have never been a big fan of Mr. Magoo cartoons ... except this one. That is only because he isn't acting like Mr. Magoo for the vast majority of the show. I half-joked to my wife that they should just call it Jim Backus's Christmas Carol. In any case, the one scene that I looking forward to seeing has been cut out of this version. After the \"Winter Was Warm\" number, the Ghost of Christmas Past tells Scrooge that there \"is one shadow more.\" And then we get this strange wavey cut to the scene where the Ghost leaves him and the Ghost of Christmas Yet to Come appears. Within that wavey cut is the missing scene I am referring to. In the scene, the Ghost takes Scrooge to a large country home. In it we see an older Belle. Her husband and children come home, and it is obvious that they are a happy family getting ready for Christmas. Belle's husband remarks to Belle that he \"saw an old friend of yours in town today.\" He saw Scrooge and tells Belle how mean and unhappy he looked. Belle turns and stares at the snow falling outside the window and you can hear the tune from \"Winter is Warm\" being reprised. This scene always struck me as a child. Not only does it show the happiness that Scrooge missed out on ... which is obvious. But it also demonstrates the loss that Belle still feels even though she lives such a good life. The fact that no one has mentioned this scene in all the user reviews for this special had me half-believing I had imagined it. However, I have verified that the scene is in the Dickens's original story (I have never read the original all the way through and only discovered this scene when I was searching for it in connection to this \"Magoo problem\"). Furthermore, before the wavey cut, the Ghost states he has \"one shadow more.\" I do not believe he is referring to the Ghost of Christmas Future. The \"shadows\" are not the ghosts, they are the shadows of the past. Is there anyone out there who also remembers this scene or am I completely mad!?!",
         "I saw this last year for the first time in at least 30 years, and also still remember parts of it from when I was a child (razzleberry dressing, the \"Despicable\" song in the junkshop, and the achingly poignant \"All Alone in the World\"). My 8 year old really enjoyed it, a great intro to the classic story. He commented on how sad he felt for the young Scrooge in the schoolhouse scene. To see a modern kid as moved by that song as I remember being, is a real credit to the songwriter. And, the song in the Crachit house, where despite not being able to afford a tree or a holiday meal, they \"prize what we have now\" by having a loving family together for the holiday. What wonderful concepts presented in a simple yet effective holiday cartoon for kids and adults.",
         "I join the many other writers who remember and treasure \"Mr. Magoo's Christmas Carol\" with great fondness. Like others, I remember seeing it on its first night 40 years ago. Indeed, a time that seems simpler and nostalgic now. This week,I viewed a VHS tape copy I received and was really charmed and impressed by its quality. The animation is sweet, gentle and from an earlier time. The story adaptation from Dickens is excellent. The concept of Magoo on Broadway performing the \"Carol\" is really inventive and works well. What I strongly recommend to all is the outstanding and, at times, poignant music There is music and lyric here to equal and surpass much more famous shows. I hope that this wonderful treasure can be re-discovered and enjoyed by a new generation in the years to come. It deserves to be remembered and appreciated.",
         "I just watched the new DVD of `Mr. Magoo's Christmas Carol,' and it seems as good a representation of the program as we're ever likely to see. I doubt it looked much better when it originally aired in 1962, but considering the video technology of that time, no home viewers would have seen it at its best then. There may have been some very infrequent white specs on the image, but if you're not consciously seeking them, you're not likely to see them. They are so few, they're barely noticeable. The colors may seem washed-out at first, but I simply turned the color intensity up on my TV, and the colors looked solid and well-balanced throughout the program. I directly compared this DVD to a copy of the laserdisc edition, which has been much sought-after by collectors since going out of print years ago. They are almost identical, except for a slightly sharper image on the DVD. An audio re-mix, maybe even in stereo, would have been great, but certainly costly. I wonder if the original studio tracks are even available for this anymore. In any case, the mono soundtrack works fine, and is practically distortion-free. If you watched this as a kid, and haven't seen it since then (like me), I can only say: Wow, what a strong jolt of nostalgia it is! I find it hard to agree with the editorial reviewer at Amazon, who characterizes the songs in this production as `forgettable.' That may be because I first heard them in 1962 at around the age of nine, and haven't quite forgotten them since. I suspect I'm not alone in this, either. This program isn't high art, and an adult who doesn't have that nostalgic connection to it may not be able to embrace it, but for those who remember, it leaves you with that warm, fuzzy feeling. I'm very happy to have become re-acquainted with it.",
         "Those of us fortunate enough to grow up in the late 50's remember Mr. Magoo with a special warmth, and this version of \"A Christmas Carol\" is the main reason. This remains a superior re-telling of the story and holds it's own against the George C. Scott and Alaister Sim versions, despite being only 50 minutes long and animated. The ghost of Marley is as scary as they come, and the villains are convincingly menacing. Mr. Magoo, thanks to the avant-garde UPA animation and the unparalleled voice talents of Jim Backus, emotes as effectively as a real person. The songs could not be better; they are Broadway quality and are sung with a heart-felt enthusiasm that adds as much to the film as the actor's voices. Jack Cassidy is perfect as Bob Cratchit, and Royal Dano as Marley holds the viewer spellbound with his sepulchral intonations. This adaptation holds a special place in my memory, thanks to the excellence of the production and the great voices. Each year my husband and I (and our grown children) watch it several times, marveling at how it can still entertain and enthrall after so many years. Do not pass this up, if you can find it; it's a truly timeless classic. The film has been released on DVD, and this offers an extremely good-looking presentation of \"Mr. Magoo's Christmas Carol.\"",
         "Cartoon Network just showed this film yesterday, and I must agree with the previous reviewer. This is a great movie. What really works is the use of the Broadway show format and its clever music. I love the song about being \"despicable\" sung by the Undertaker, Charwoman and Laundry Lady. There's a definite early-1960s-Broadway feeling to this that could have quickly become outdated had it not been a Christmas program. It has a certain nostalgic flavor that its creators could not have forseen. Like \"Frosty the Snowman\" and \"Rudolph the Red-Nosed Reindeer\", \"Mister Magoo's Christmas Carol\" should become part of the annual Christmas TV programming tradition.",
         "While my favorite live action version of A CHRISTMAS CAROL is George C. Scott's 1984 version I would have to say that even that good film comes in second to this wonderful film. Charles Dickens certainly wrote a story that would be retold in various forms 100's of times. However, MISTER MAGOO'S CHRISTMAS CAROL really captures the viewers imagination both young and old alike. Emphasis on the young viewer. Children, much like myself 25 years ago, really respond to this films animation and great songs. I still enjoy singing along with the various songs in this film as do my children. They are very catchy. All the important aspects of the book are here in this version. Even though I like other film versions of this story this version holds a special place in my heart. Also, for all those that think RUDOLPH THE RED-NOSED REINDEER was the first animated Christmas special, think again it was this film. Lastly, I firmly believe you will like this film. Trust me, Mr. Magoo brings the house down!!!"
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Drama",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["United Productions of America (UPA)"],
      "summaries": ["An animated, magical, musical version of Dickens' timeless classic \"A Christmas Carol.\" The nearsighted Mr. Magoo doesn't have a ghost of a chance as Ebenezer Scrooge, unless he learns the true meaning of Christmas from the three spirits who haunt him one Christmas Eve."],
      "budget": 0
   },
   "movielensId": 122240,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-12-18",
      "dvdReleaseDate": null,
      "directors": ["Abe Levitow"],
      "runtime": 53,
      "movieId": 122240,
      "title": "Mr. Magoo's Christmas Carol",
      "mpaa": "G",
      "actors": [
         "Jim Backus",
         "Morey Amsterdam",
         "Jack Cassidy",
         "Royal Dano",
         "Paul Frees",
         "Joan Gardner",
         "Jane Kean",
         "Marie Matthews",
         "Laura Olsher",
         "Les Tremayne",
         "John Hart"
      ],
      "imdbMovieId": "0123179",
      "originalTitle": "Mr. Magoo's Christmas Carol",
      "genres": [
         "Animation",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "An animated, magical, musical version of Dickens' timeless classic \"A Christmas Carol.\" The nearsighted Mr. Magoo doesn't have a ghost of a chance as Ebenezer Scrooge, unless he learns the true meaning of Christmas from the three spirits who haunt him one Christmas Eve.",
      "tmdbMovieId": 49742,
      "avgRating": 3.05556,
      "releaseYear": "1962",
      "numRatings": 9,
      "posterPath": "/v373WxuWPaUlincYeu6AIzcZUV8.jpg"
   }
}