{
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 178,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0168355/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NzIxNDcwNF5BMl5BanBnXkFtZTcwMjIwMzMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jon Voight, Mary Steenburgen, F. Murray Abraham | See full cast and crew »"],
      "reviews": [
         "I now know what eternity would be like. This incredible mess occupied four hours I will never get back. My kids wanted to watch it. They liked the animals. I am no Old Testament scholar, but the way the script played fast and loose with the details, was really disappointing. I'm sure all of us remember Lot! He's the guy who left the city of Sodom with his wife. She looked back and was turned into a pillar of salt. I never realized he kept her finger in a jar after that. I also didn't know that he later became a pirate and tried to board the ark. If Noah had gone up the mountain to get the Ten Commandments, I wouldn't have been surprised. You can imagine a screenwriter, trying to adapt about two Bible chapters into a four hour mini-series. Still, with imagination and effort, it could have worked. The characters are ridiculous. This has got to be the lowest that Mary Steenbergen has gone. Her character is a mawkish idiot, spouting 1960's June Cleaver dialogue. Noah, played by John Voight, is a buffoon, and then they have these three sons who shovel dung and complain. Except for Japhet, who is the artist. He sits around and ponders. One of them develops a ventriloquist act and talks to an orange for about an hour. The animals are superimposed using computer graphics but not very well. I know it is a mini-series, but visually it is awful. Most of the film involves the Noah family sitting around being bored. There is this thing about not putting a rudder on the boat so they are floating around, as if they knew where they were going anyway. The Lord was my favorite. He had this silly conversational voice, somewhat indecisive and flippant, sort of like George Burns. The scene where the whole family goes temporarily insane is when I finally gave up. I am as open minded as the next person, but I'd like to hear some sort of justification for this mess. Was it entirely tongue in cheek? Did I miss the whole point because no-one was supposed to be serious. Oh, well, I am interested to see other comments about this thing.",
         "This was on the children's shelf at our local video store. BIG mistake; there's enough violence in this to give an adult nightmares, let alone a child, and more sexual references than I'd care to explain to my innocent six year old. We did a lot of fast forwarding in the beginning. That said, even as an adult movie, this is a completely unredeemable film. The script is stupid, and the story is so twisted and convoluted that it would hardly be recognizable as a Bible story at all if it weren't for the big boat and the pairs of animals. If they wanted to do a Sodom and Gomorrah movie (not that I think that would go over well in today's political climate, but I'd like to see it anyway), they could have done one, and not tried to throw that event (which was a good thousand years, at least, after Noah's Flood) in with the flood. The script is tasteless and stupid, the acting (especially by Mary Steenburgen) is wooden. Even the scene with the animals, which is prettily-enough done, isn't enough to make this a movie worth watching. Give this one a miss, and definitely DO NOT get it for your kids.",
         "NBC had a chance to make a powerful religious epic along the lines of \"The Ten Commandments\" and \"The Greatest Story Ever Told,\" and instead they chose to make some halfhearted cartoon that was more like \"Waterworld\" than anything else. I don't recall a Bible passage where Lot turns into a pirate and attacks the ark, nor do I remember one where Noah's son develops a serious friendship with an orange, nor do I remember Noah being some crazy old loon who suddenly acts like he's commanding a naval fleet and runs around shouting nautical terms like \"hoist the mainstay!\" This was possibly the worst marketing decision in history. Obviously the majority of people watching this were going to be Jewish and Christian parents with their kids, so why on earth make the movie so offensive to those people? If they were intentionally trying to offend, why not advertise it that way and at least reel in the right audience?? I hope they make a REAL Noah movie someday, one done seriously and thoughtfully, one that actually appeals to people and makes money. Until then, don't waste your time with this trash.",
         "I've spent quite a while going through all the reviews for this film. I'm in total agreement with almost every reviewer in saying that Noah's Ark is crap, crap, crap, crap, crap! Don't the executives at NBC have any class? I feel sick to my stomach for actually watching both parts of this mini-series. The script is so dumb, so pointless, and yes, TOTALLY INACCURATE! I can understand making a few changes for dramatic purposes, but this film changed just about everything in the story. God himself is going to go through the trouble to kill off the entire Earth's population, but he somehow misses one guy that's sailing around trying to sell stuff to Noah. Give me a break! And what was up with Noah's sons acting like Indiana Jones, saving girls in distress? If all that isn't bad enough, there's the part where God apologizes to Noah and says \"I'm sorry Noah, I was wrong\". Newsflash NBC, GOD CAN NOT BE WRONG! This film is the most tasteless and disgraceful Biblical film ever made.",
         "Sorry about that. But if you have seen this \"epic\", you will obviously know of the utter disregard for the actual text of the Bible. Now, I'm not exactly the next in line for sainthood, but I do know the basics. And the basics were this. God wanted to wipe everyone of the face of the Earth because he believed they have been corrupted to the point of no return. He chose Noah, the diamond in the rough, and his family to be spared due to their uncorrupted ways. Noah builds an ark as instructed by God to house he, his family, and two of every creature while he floods the rest of the planet. Those are the basics. In this movie, you have other people roaming around the seas such as peddlers and pirates. But I thought that EVERYONE was wiped out. I guess the executives at NBC have never been to church. There are other inaccuracies, I'm told, but being the average Joe, I have no idea what they are. Sorry. Back to the movie, it was inaccurate, as stated before, the acting stunk, but some of the effects were good, I'll give it that. But as a whole, I've seen a better and more tasteful rendition of the story done as a little scene on The Simpsons. God help the NBC executives come judgement day. 3/10",
         "This is one of the worst mini-series I have ever seen on TV. I sat through the first half hoping it would improve but it only went from bad to worse. Needless to say I could not bring myself to sit through the torture of a second nights viewing. What was Jon Voight thinking when he made this?????",
         "I'll dispense with the obvious review of factual inaccuracies. They are too numerous to name. A much shorter list would be what they got right. 1. Dude named Noah. 2. Ark with animals on it. If you want a much more accurate portrayal of Noah's Ark and the destruction of Sodom, go rent \"The Bible\" (1966). It depicts the story of creation through Abraham attempting to sacrifice his son Isaac. It's a much better movie, and it may be that the abomination called \"Noah's Ark\" (1999) drove you to seek just such a film. http://www.imdb.com/title/tt0060164/ I really couldn't stomach watching the whole movie. From reading other comments, I can see that even the atheists found it grossly inaccurate. As a Christian, it was intolerable to me. Possibly the worst movie ever made. No real point to this movie either, except maybe to showcase their sub-par computer animation. Was it a complete waste? Maybe not. God can use evil to work good. Romans 8:28 says, [28] And we know that all things work together for good to them that love God, to them who are the called according to his purpose. Genesis 50 says, [20] But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive. In the second example, Joseph's brothers meant to kill him, but God turned their evil into a very great good. He may have done the same thing with this movie. People were so astonished by its lack of Biblical foundation, that they probably broke out the dusty old Bible and read the story for themselves. To find out about Lot and Sodom, they would have to go the whole way up to Genesis 19 before God destroys Sodom and Gomorrah. By then, they have read almost half of Genesis, so they might want to finish. The next book is Exodus, which the movie \"The Ten Commandments\" was based on (and much more accurately). If they have seen that movie, then Exodus becomes an easy read. So now they have read at least two whole books of the Bible, just because they watched a pathetic movie about Noah's Ark. I'm sure this actually happened to someone out there. God works in mysterious ways.",
         "Mini-series' are usually average at best, but this feeble minded rip-off is the single worst TV outing I have ever experienced. I wonder if the writers had ever looked at this seriously. The talents of Jon Voight and Mary Steenburgen are wasted in this awful shoddy piece of Hollywood trash. I am an Australian and I was watching this (as it was filmed here) and I thought to myself what a terrible misrepresentation of the Australian people and what an embarrassment to the film industry. Not to mention the 'poetic license' line used at the start of the show. Fair enough it is really only a few chapters in the Bible but c'mon since when was Lot a scumbag, Lot wasn't even born when Noah was around. IT WAS ABRAHAM THAT PLEADED WITH GOD. I could say more but I won't just avoid this useless excuse for show.",
         "After struggling for an hour and 45 minutes (including many commercials,) I concluded that this theological hodge-podge coupled with \"B\" movie Hollywood \"glitz\" was insulting my intelligence, plain inane, and boring. Jon Voight was much more exciting in Midnight Cowboy, Coming Home and Deliverance. I hope we have seen the last of this one and the producers will not waste their time producing a video for sale and rent. I must admit that the animal computer simulations were extremely well done and thoroughly enjoyed by my four year old grandson!",
         "I know the bible inside out and from the onset, it was obvious this movie was not meant to be taken seriously. The variations to the truth were crazy. eg. It was Abraham, not Noah who was advised by 3 angels Sodom was to be destroyed but it was good cinema photography to see the fire and brimstone falling out of the sky in the same movie as the flood. The most hilarious scene was Noahs wife trying to throw out spiders in glass jars out of the arks window. Also how some of the wicked survived the flood and came after Noah in Viking ships only to be destroyed by a sudden sea tornado! I laughed through out and recommend this movie to anyone who needs a laugh and isn't expecting an exact biblical account. If you want that, read the bible!"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Babelsberg International Film Produktion",
         "Hallmark Entertainment"
      ],
      "summaries": [
         "In the Biblical story from Genesis, God floods the world as Noah rescues his family and the animals in a gigantic ark.",
         "The events from \"Genesis\" are reordered and compressed in this re-imagination of the biblical story. Sodom and Gomorrah face God's wrath, and only Noah and his friend Lot are chosen to escape from the sinful cities. The best of friends, Lot and Noah separate when God takes Lot's wife from him. When God expands his wrath to create the legendary flood, Noah alone is chosen to save his righteous family. Once aboard, the Earth becomes flooded, and Noah must lead his family to salvation and survival - even if it means facing his former friend Lot, now a leader of desperate...pirates."
      ],
      "budget": 0
   },
   "movielensId": 122230,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-05-02",
      "dvdReleaseDate": null,
      "directors": ["John Irvin"],
      "runtime": 160,
      "movieId": 122230,
      "title": "Noah's Ark",
      "mpaa": "",
      "actors": [
         "Jon Voight",
         "Mary Steenburgen",
         "F. Murray Abraham",
         "Carol Kane",
         "Mark Bazeley",
         "James Coburn",
         "Jonathan Cake",
         "Emily Mortimer",
         "Sydney Tamiia Poitier",
         "Sonya Walger",
         "Alexis Denisof"
      ],
      "imdbMovieId": "0168355",
      "originalTitle": "Noah's Ark",
      "genres": [
         "TV Movie",
         "Drama"
      ],
      "youtubeTrailerIds": ["MBX7TaE39HU"],
      "plotSummary": "In the Biblical story from Genesis, God floods the world as Noah rescues his family and the animals in a gigantic ark.",
      "tmdbMovieId": 63039,
      "avgRating": 1.875,
      "releaseYear": "1999",
      "numRatings": 4,
      "posterPath": "/bgRyCslIEiyVn2k4TEMurqImZH8.jpg"
   }
}