{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1577055",
      "video": false,
      "title": "Mask Maker",
      "recommendations": [
         114789,
         125040,
         364088,
         338520,
         10256,
         119255,
         297472,
         28314,
         160128,
         32585,
         209780,
         36600,
         30384,
         76730,
         23515,
         10076,
         46467,
         60965,
         33926,
         94841
      ],
      "backdrop_path": "/cagqjUlBaOwkhaiNzSgnQubT65K.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jennifer",
               "gender": 1,
               "credit_id": "52fe4692c3a368484e09819f",
               "name": "Nikki DeLoach",
               "profile_path": "/h8lP9YDAksFxBSBiSjhclc8h2qt.jpg",
               "id": 59750,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Evan",
               "gender": 2,
               "credit_id": "52fe4692c3a368484e0981a3",
               "name": "Stephen Colletti",
               "profile_path": "/lAwVQHmMFYaFmqGLMZE1t16KIqi.jpg",
               "id": 141180,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Annette",
               "gender": 1,
               "credit_id": "52fe4693c3a368484e0981a7",
               "name": "Anabella Casanova",
               "profile_path": null,
               "id": 549014,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe4693c3a368484e0981ab",
               "name": "Ross Britz",
               "profile_path": "/tf5gaDx7JJHzI52uJzNKsLmTONT.jpg",
               "id": 149000,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Peck",
               "gender": 2,
               "credit_id": "52fe4693c3a368484e0981af",
               "name": "Terry Kiser",
               "profile_path": "/lGQSeLgWeLjFGz2gOMWYNlPOM2f.jpg",
               "id": 55267,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Hillary",
               "gender": 1,
               "credit_id": "58c31b13c3a36850f1003b1a",
               "name": "Mariah Bonner",
               "profile_path": "/c8zup1I9XwkdtOpPpBqHpkiESwn.jpg",
               "id": 585673,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "58c31b20c3a36851030037b9",
               "name": "Lara Grice",
               "profile_path": "/aZarz4uBJ8chtvQAEiQIimVnkc7.jpg",
               "id": 94428,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Fred",
               "gender": 2,
               "credit_id": "58c31b0ac3a36850e1003c6c",
               "name": "Michael Berryman",
               "profile_path": "/kqIQo7IqpW5DLcMmWD7mkxokyLX.jpg",
               "id": 7073,
               "order": 7
            },
            {
               "cast_id": 7,
               "character": "Mr. Tucker",
               "gender": 2,
               "credit_id": "52fe4693c3a368484e0981b3",
               "name": "Treat Williams",
               "profile_path": "/uKejRJTEVOy6IOsJX2mJH3SwbTl.jpg",
               "id": 4515,
               "order": 8
            },
            {
               "cast_id": 8,
               "character": "Arthur Brown",
               "gender": 2,
               "credit_id": "52fe4693c3a368484e0981b7",
               "name": "Jason London",
               "profile_path": "/z4eSvvH51WsZppswHVHcqFJJm6L.jpg",
               "id": 52474,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5358e2020e0a260684008f1c",
               "name": "Griff Furst",
               "profile_path": "/rRAtuKLOq27DFZ0MWu6FCVbbhS8.jpg",
               "id": 76021,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "587d70fdc3a3684a4a02170b",
               "name": "Jake Kennedy",
               "profile_path": null,
               "id": 105976,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "587d710d9251413e9201eb67",
               "name": "Griff Furst",
               "profile_path": "/rRAtuKLOq27DFZ0MWu6FCVbbhS8.jpg",
               "id": 76021,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "587d714ec3a36847e80209bf",
               "name": "Eric Miller",
               "profile_path": null,
               "id": 81694,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "587d72e19251414101013b43",
               "name": "Scott Bolon",
               "profile_path": null,
               "id": 1740216,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "587d73b19251413eec01e437",
               "name": "Kenneth M. Badish",
               "profile_path": null,
               "id": 589183,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "587d73c5c3a368426e013acd",
               "name": "Brad Southwick",
               "profile_path": null,
               "id": 587841,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "587d73d79251414143012c69",
               "name": "Kenneth M. Badish",
               "profile_path": null,
               "id": 589183,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "587d7404c3a368426e013af9",
               "name": "Ewerhard Engels",
               "profile_path": null,
               "id": 67232,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "587d743ac3a36849ff01cc70",
               "name": "Daniel Lewis",
               "profile_path": null,
               "id": 589184,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "587d744b9251413eec01e49c",
               "name": "Daniel Lewis",
               "profile_path": null,
               "id": 589184,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "587d74739251413eec01e4cf",
               "name": "Charlotte Gabler",
               "profile_path": null,
               "id": 1740217,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.275789,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62904,
      "vote_count": 14,
      "budget": 0,
      "overview": "A lucky couple hits the jackpot when they purchase a 19th century plantation home for pennies on the dollar. Determined to get rich quick, they invite their friends up for the weekend to celebrate their good fortune. It’s quickly apparent that the plantation home’s former residents have not left and the unlucky youths suddenly find themselves running for their lives!",
      "similar": [],
      "original_title": "Mask Maker",
      "runtime": 90,
      "poster_path": "/ezteEVfZ1ej2lHRPhLcdLixO7uD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-01-01",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Meet Your Maker",
      "adult": false,
      "homepage": "http://www.maskerademovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Griff Furst"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Eric Miller",
         "Jake Kennedy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1577055/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTE1ODIzNTgxNF5BMl5BanBnXkFtZTcwNjUzNTEzOQ@@._V1_UY268_CR13,0,182,268_AL_.jpg",
      "actors": [
         "Nikki Deloach",
         "Stephen Colletti",
         "Anabella Casanova"
      ],
      "reviews": [
         "Please don't get me wrong, I did enjoy this movie. I just wanted to enjoy it a lot more than I did. See, in an age of remakes, I feel like it's really hard to find fun, original material so it makes it so much more rewarding when you do. But there's few things worse than feeling like you got the old bait and switch. And that's sort of how I feel about this movie. Sure, the story and plot aren't exactly a rip off, it's just that someone wasn't trying hard...at all...to make it original. It's a stalk-and-slash movie (Haloween, Friday The 13th) where a guy makes masks out of his victims at an old, abandoned farm house (Texas Chainsaw Massacre). I wish there were more to it, but not really. That being said, don't let that alone turn you off of this movie. It really isn't without it's charms. The kills are fun, the actors actually do a pretty good job in their roles, and the effects are surprisingly good. If you want to just sit on the couch (preferably with some sort of adult beverage) and have some fun, this isn't the worst way you could do it. You just have to get past the relatively well-tread plot.",
         "While not overly great, the movie \"Maskerade\" wasn't overly bad either. It had enough material to prove entertaining enough for a single watching. The story in \"Maskerade\" is fairly horror / slasher movie cliché. Roughly summarized; a group of young people go to an old house (in this case, they buy it) with a vile, dark history. They awaken something wicked from its slumber, unintentionally. And now they are being killed, one by one. End of story. And it is pretty much straight from the 'how to make a slasher movie' handbook. Nothing new here in those terms. The acting in the movie was good, and there were some interesting names on the cast list. Those including Michael Barryman (playing Fred), Terry Kiser (playing Mr. Peck), Treat Williams (playing Mr. Tucker) and a very short appearance by Jason London (playing Arthur Bronw). These people were the most impressive, but the young cast did a good job as well. Most memorable was Nikki Deloach (playing Jennifer), though. As for the gore and guts in the movie, well it isn't a splatter-fest. The movie has just enough gore and gruesomeness to keep you interested, without being too much. The biggest turn-off in the movie, if you will, was how it too much like other classic horror / slasher movies such as \"Friday the 13th\" and \"Halloween\". How you ask? Well, the \"Halloween\" part would be with the mask. Sure, Meyers used a firm-set rubber mask, while the killer in \"Maskerade\" wears a mask from people's faces. Oh wait, back it up here, can you say \"Texas Chainsaw Massacre\" anyone? And as for the \"Friday the 13th\" part, well when Jason Voorhees saw what he believed to was his mother, he froze up and stopped, as did the killer in this movie when Jennifer was wearing his mother's old dress. No, no, no! You do not \"borrow\" these things from classic movies, you make up your own stuff. This really brought the movie down in value and worth. One thing that the movie should get praise for, though, was the ending. Now, I am not spoiling it in anyway by revealing stuff, but I will say that it is a typical Hollywood horror movie ending, but with a really great 'twist'. I liked that ending, and it almost, just almost, brought justice to all the other stuff that went wrong in the movie. Overall, then \"Maskerade\" is good for a single watching, so if you have nothing better to do one evening, and if you like horror / slasher movies, then give \"Maskerade\" a chance. Despite its faults, it still is a decent enough addition to the genre.",
         "Not quite the slasher film I was expecting but I still enjoyed it. A young couple and their friends start renovating an old house they have just bought, but not before unleashing the dead face stealing killer buried in the garden cemetery. Through use of flashbacks from the killers perspective and our heroin reading exerts from the killers mothers diary we get an insight into the happenings leading up to the creation of the stalking brute. Not the most original plot as it's a cross between Halloween and the Texas chainsaw massacre but with less gore than those two movies. What really saved this film for me was the dialogue between all of the friends and the acting from such a young mostly unheard of cast. It made the characters relationships more believable than I'm used to seeing in this sort of movie and I actually liked all of them. Usually there's a couple of characters I hate and can't wait to see them get murdered, but I found myself quite disappointed to see some of them go. It was also great to see Michael Berryman again as well as Treat Williams even if they only had small roles. The movie doesn't go all out on the gore front. A couple of the kills are almost off camera. The few kills you do see are done quite well but some quick cuts hamper you seeing exactly what you're looking at. What the film really relies on is the atmosphere created by the creepy house and the dank surrounding woodland. This really works as the setting is very remote and only adds to the feeling of dread. We have the killer Looming around the side of buildings in the background of some shots just like Michael Myers an often over used trick but done very well in this instance. The only thing I didn't like was the ending a couple of things didn't quite work for me at the end but it didn't spoil my enjoyment of the movie overall. All in all this was a good little horror which I would recommend to fans of the genre.",
         "What if your dream turned out to be a nightmare? After Jennifer's (Deloach) boyfriend Evan (Colletti) surprises her with a new house for her birthday strange things begin to happen. This is a hard movie to review. It is not that bad, but it drags, a lot. It's another haunted house because of something buried in the land movie that is not that bad, but it would have been a good \"Fangoria Series\" movie at an hour long, trying to stretch it out for an hour and a half really hurt the movie. If you are looking for a decent horror movie that is a cross between suspense and a slasher, this is a good choice. If you are looking for a very scary movie then I would go for something else. Not terrible, not great. I did like the ending though. I give it a C. Would I watch again? - I doubt it.",
         "This movie was fun to watch although it drags on a bit at times. I have to say that I was more impressed with the acting in this low budget horror flick than the majority of the cookie-cutter characters I'm used to seeing in horror movies. If you are looking for a movie full of blood and guts, this may not be your cup of tea. But, if you want to watch a fun movie with good acting and some decent scares, this is your kind of movie. If you are looking for a decent horror movie that is a cross between suspense and a slasher, this is a good choice. The house that we are at for a majority of the movie has a pretty creepy look to it. I wish the director would have milked the kills a bit more and built a little more tension as there weren't as many jump scares as I expected. All in all, it is definitely worth the watch.",
         "Okay. We've another of those hacking movies here , with young hotties in an isolated house and a disfigured human monster tearing them apart one by one. And I think such movies will continue to be made as audience for such genre or tastes aren't gonna fade away anytime in the near future. One thing I appreciate about the Mask Maker is that it gets down straight to business! Not many typical clichés as seen in most horror flicks. The ugly dude(character Leonard) just wants to kill & peel skins off which he does in a no-nonsense manner and without grumbling :) I call him Mr. Skin for that! You may have seen such plots many times before, either in a Jason movie, Wrong Turn or Hatchet but trust me, you don't get bored. It's neither new but not bad either. Just another slaughter flick you can enjoy with your drink late at night :) Can't say anything special about the acting. All of 'em do a neat job, I mean every actor here. That's surprisingly good as many average terror flicks have only one or two lead actors screaming their face off while the rest look either plain bored or wooden. But, I do feel sad though for star Treat Williams. 13 years ago, he was the dashing hero in the popular monster flick, Deep Rising. Today he's hardly on screen for a few minutes and looks very old. Verdict: Mr. Skin shows you how to peel faces without a mess. Take some free lessons :-)",
         "When Jen's boyfriend buys her an old farm house sitting on top of 40 acres, she's at first mortified that he'd be so utterly stupid' but when she sees how hurt this makes him, she attempts to make the most of it not knowing that the child of the previous occupants still resides around the area and I've very productive of his mom old house. Tired, generic slasher derivative that brings nothing at all new to the table. The back-story is a rather small variation of Jason Vorhees, the kills which one would think would be where Inovation could at least peek through is sadly lacking, almost every kill is mainly the same. I'd be hard pressed to even recommend this movie even to slasher genre aficionado, much less anyone else.. Eye Candy: Mariah Bonner shows some T&A, Anabella Casanove is briefly topless",
         "PG13, really wasn't much gore. But the story was pretty solid. This film pays homage to several older films, including The Hills Have Eyes and Halloween. I kind of liked it. Although, I still felt it was a bit tame. A couple buys an old farm house that just happens to have a cemetery out back. And, of course, the old occupant is woken up and out for blood. The movie spends a lot of time trying to give a backstory to the killer. The rest of the movie is pretty average. It's really only interesting for the little homage bits. After seeing so many bad movies, this one really wasn't that bad at all. It just could have used a bit more gore, maybe a bit more action. But it's better than a lot of the junk that's out. It was worth sitting through.",
         "So, shall I really mark this review as the one with the spoiler? You know there is absolutely nothing to spoil. You have seen this movie over and over. So, lets just mention the generic plot in points: 1) There is ugly mute kid that is impossible to kill somehow. 2) It kills and kills and kills. 3) There is old drunk who knows how to destroy it but seems to never try it for real. 4) There is a bunch of university idiots who wants to party. 5) The mentally disturbed killer has very boring flashbacks. 6) He kills them all. 7) He is almost killed at the end but he is saved by clueless police. Then he kills the police and the remaining crew. So the evil lives on and threatens us with another craptastic adventure of impossible to kill dummy and its idiotic victims. Oh no, please. No more.",
         "Are there any movies out there being made that don't screech of utter grimness and hopelessness? I am so sick of movies where every character dies no matter what they do. \"Blair Witch\" pulled the trick off nicely, for me, anyway. But now the idea is so overused that it comes across as hackneyed and trite. If you haven't seen this movie, and don't want to know how it ends, don't read any further. On the other hand, if you want to spare yourself of the experience of watching it, do read on. Needless to say, all of the characters die, hacked to pieces and cranially skinned by a character than seems half Leather Face from the Texas Chainsaw franchise, and half Michael Myers, or Jason Voorhies. Because he is hideously disfigured, he kills people, and skins their heads... face, lips, hair, ears, everything... and then he pulls this flesh bag over his own head to cover his face. Yes, he does this with both the male and female victims. In the end, he is killed by the female lead, who pierces him through the torso with some sort of voodoo spear or stake. Of course, as the coroner's office is about to take his body away, someone removes the spear/stake/lance/whatever. Next scene is our heroine and survivor driving away in her slain boyfriend's Jeep. Overcome with grief, she pulls over to the side of the road to cry. A police car pulls up behind her, and it's driven by guess who... the killer! He has on another skinned mask, and he walks on up to her, and breaks her neck, killing her. At this point, questions beggar. When last seen, the killer was being loaded into the back of an ambulance. Where did he get the police car? Did he arise from the dead and kill all of the policemen and other first responders? If he did, he killed a whole bunch of people in no time flat, as he caught up with our heroine only a few minutes after she'd left the scene of the murders. Secondly, he was a resurrected corpse that had died some 50 or 60 years before. He was considered a dullard when he was alive and mortal. How and when, upon his first resurrection in the movie, did he learn to drive a car? There is no evidence in the movie at any time that he can handle anything more technologically advanced than an axe or a pitchfork. Rather than watch this movie, see, perhaps, if you've a friend or a relative who has a DVD of their colonoscopy. It would have much less crap in it than this movie had.",
         "The fact that any reviewer here can give it more than 2 stars proves they are fake reviews implanted by the studio. This slasher flick isn't gouge your eyes out horrible but it's only worth seeing to laugh at how the slasher genre is. In other words, it's a drinking game MST3K movie. 'Mask Maker' embodies all the (bad) stereotypes of slasher flicks. A young couple buy a southern plantation for only $10,000 since the local yokels think it's haunted. As with every slasher film IT IS and the local yokels try and warn the kids. Most amusingly the local yokels are played by comedian Terry Kiser/Bernie and Lomax Michael Berryman 'The Hills Have Eyes'. Surprising this walking dead duo aren't playing the bad guys. Make no mistake, they are the best (only) actors in the whole film. \"Whatever you do, don't dig up the backyard.\" they warn. Of course what's the second thing the kids do? Dig up the backyard right where the deformed serial killer's body is kept buried by an Amerid mojo. I'm not letting this go. Since it's established that the plantation is \"14 acres\" is size, it's really really really bad luck that they find the exact spot and start digging it up! Also, who digs up their own yard? I've never even dug up my own yard! Several other plot elements are so bizarre that it's impossible to tell if they were intentionally added to show the characters' stupidity. Or if they were merely the result of the \"writers\" own stupidity. For example, the first thing they say when moving in is, \"There's no electricity? That's odd. I make sure the power company turned it back on.\" Or words to that effect. Okay, when the power company turns the electricity back on the breakers must be in the \"off\" position. Hence, after power is restored they must be turned to the \"on\" position. They should said, \"There's no electricity? Let's find the breaker box.\" Second, although the plantation is supposed to have been abandoned for 30+ years it's amazingly well maintained with clean windows and even fresh paint. Third, in a silly twist the property turns out to be worth a cool $1,000,000 even due to a wine cellar with wine bottles dating back to at least 1864. What kind of paper and ink left in a rotting basement stays legible for 146 YEARS? NONE! Fourth, the property has the working plumbing necessary to for the nude bathing scene. WTF!!!? AGAIN! The plantation would have been on a septic system which will build up toxic fumes if the plumbing is not used on a regular basis. After 30+ it would be ridiculous to think that anyone would even be able to breath in doors, let alone have working plumbing. Fifth, this isn't actually bad writing but just bad film making. When the couple drive down the freeway in their convertible there's bad blue screening and no wind. Yes, no wind. Their hair doesn't move in the first scene, but it does in the second. WTF? Anyway...... the couple invites over more young dumb friends to help them fix up the place. Let's face it, if it looks this good after being completely abandoned for 30+ years there's nothing to fix up. IT HAS FRESH PAINT! The fornication and drunkenness of the friends gives ample opportunities for the psycho slasher to kill the kids and use their faces for masks. Wow, scary. How with they stop him? He isn't scary, he's just a deformed guy with an axe. Sure he can't stay dead but all they have to do is run away and never return to the plantation. All that fresh paint and wine isn't worth losing your life over. In conclusion, unless you're planning to drink heavily with some friends while laughing, there is no reason to ever ever ever see the horrible film making in 'Mask Maker.' The fact that any reviewer here can give it more than 2 stars proves they are fake reviews implanted by the studio. Any real viewer wouldn't be sober enough to write a positive review.",
         "Creepy rustic farmhouse, spooky basement, graveyard, sepia tinged back story explanation(including voodoo), indestructible boiler suited killer, victims fornicating in barn, killers creepy underground cavern .... if you think that is original then you haven't seen too many slasher movies. How does bilge like this get funding to be made in the first place?. Usually you can forgive airhead victims in horror if they are teens but some of these clowns are in their 30's. It's a strong emotion but i have to say i absolutely hated the characters in this movie and wanted them all to get pitch forked. All the clichés were present and correct. When players went missing everyone just got on with things until they were next in line to die. Like how did the creep who came to turn on the power actually get to the house - no vehicle, guess he must have walked and thats why no one noticed he was missing. And if anyone turns up at my house at the next family bereavement evaluating my silverware they're gonna get pitch forked too.",
         "What a pile of dog entrails! You have seen this movie 50 times. There is not an original idea in this movie. You have never heard of any of the actors or actresses. Can you say Friday the 13th or Sleepaway Camp VI? The characters are one dimensional. They have porridge for brains. What 20-somethings plays with a bird skull on a stick?! These weirdos do. The townspeople are 10 times weirder than the \"heroes.\" The villain is an uninteresting dolt and has the typical supernatural powers to drive the plot when necessary. Betcha the characters get picked off one at a time because they are cognitively delayed (retarded). Red Box is full of movies like this with interesting covers and C-grade plots. Avoid for your own good.",
         "I stumbled across this movie by accident and I was greatly surprised on how much I enjoyed it. If you watch horror movies on a regular basis, are a fan of typical slasher type movies or clam to have \"seen them all\", I recommend you check this movie out. It probably will not become your favorite movie, but it is definitely worth the watch. When I started the movie I thought it would just be like any other horror movie and have the same classic slasher twist. Young couple buys an abandoned house to later find out people were killed in it. Then someone comes back from the dead or returns for revenge. And it did. But once it gets into the movie a little bit more you start to find out the legend behind the character and how he came to be. It's quite twisted and goes into great detail about the antagonist, his family and the town. It made the movie more interesting to watch. This movie has some similarities to the Friday the 13th movie series, as the antagonist is out for revenge on the people who had killed his mother and anyone who gets in his way. Just replace the Camp with the antagonists family home and its pretty much the same plot. I will say that there are some lines that some of the characters say will make you cringe more than any of the gore or killings. One of the things one of the male characters says is something I would have never thought I would have heard in a somewhat newer movie. Some people will find it funny, But a lot will not. As I said in the start of this review, If you like slasher type movies you should check this one out. It's worth a watch.",
         "We have a poor deformed man who has a wretched past and had to watch his mother die right in front of him. He also dies that very same day! Already we feel bad for the poor guy, we might actually be cheering for him if he went after the people who originally did his family wrong. But years later a boyfriend buys his girlfriend a house for her birthday, what a sweet guy. The only problem is this is the house that the poor deformed boy lived and died with his mother and is (of course) buried on this same property. Now , we bring in some good friends of theirs to help clean the old house, you know get the old haunted house feel out of the home. I swear immediately, someone has to mess around that damn graveyard and pull out something that looks ancient American Indian. Come on, you know NOT to screw around with graveyards and their contents, right? Well apparently this person never got the memo. Of course this brings deformed psycho back into the picture intent on getting revenge for his mothers death. Which would be well deserved, if it had been the people who actually did the damage. Well, revenge is blind and a little dumb too. Poor bandaged deformed psycho goes on a sweet little killing spree going through everybody from the electrician to that sweet boyfriend. And as per title, he is ripping off their faces to wear as masks. I love it when he has the chicks \"mask\" on with that long hair flowing, too funny! He keeps pretty busy during the whole movie, he's as fast and efficient as Jason and Michael Myers, he really gets around. You really start to pity him during the back story of his life, so the killing is not so heartless, he just loved his mommy. So that makes it okay. Kill away sweet deformed psycho, kill away. Yes, we have seen this kind of masked maniac before, but I felt the acting was well worth the watch, so was the story. I really got into the plot and enjoyed the whole darn thing! I give this movie 4 Hatchets! By the way. loved the ending, can't wait to see sequels! If you like this review and want more of them visit: www.HatchetHorror.com .",
         "I know they remade Friday 13th, but Mask Maker feels almost like they've remade the remake. Seriously, 'modern' slasher films, i.e. those with a - seemingly - indestructible undead serial killer have been around for nearly forty years, yet, in that time, film-makers don't seem to have been able to come up with anything more inspiring that 'teenage couples have sex and die.' If any couple partakes in pre-marital sex, you can write them off the cast list (same goes for any nudity at all). Mask Maker is about your average undead serial killer, stalking a load of annoyingly-attractive American teens in a big house two of them have recently bought. There are attempts at explaining why he's undead, but it doesn't really matter. His 'gimmick' is that he doesn't really have a face and he rips off victims' faces and uses them as his own (didn't they do that in Texas Chainsaw?). It's worth noting that if you're wearing an ill-fitting, blood-soaked, torn-off mask of someone, all your friends will instantly think you're really them and not bother asking questions until you've hacked them to bits. Talking about hacking people to bits, the death scenes are particularly uninspiring. Yes, there's a bit of blood, but nothing very original. It's predictable too. No major plot surprises here. The clichés come thick and fast, especially with the 'locals who always know something' about the horror that is to come. Basically, if you're into films with undead killers stalking dumb teens, just stick to Friday 13th. It may be a little old by now, but it's still better than this. Oh, and if you're thinking of buying a property, get your solicitor to check that no psychotic undead serial killers aren't buried somewhere on the premises. If you find out there are, I recommend returning to the estate agents and looking for somewhere else.",
         "Slashers are a dime a dozen in the B-movie horror genre, so when a good one gets released, we should celebrate it. There's no point in telling the story as it's one we've heard times & times before. What differentiates this slasher from the thousand others on the market is the great acting & writing. I found myself smiling more than I few times to one-liners, delivered by the able leads and supporting cast. My hat goes off to the female lead for being a great addition to the Final Girl mythos. She does tip her own hat to Amy Steel in the pop-psychology finale. For once, the group of friends actually act like real friends, not just a salade composée of geeks, bimbos, punks and jocks. The face-ripping shtick is a wink to \"Texas Chainsaw\" and some of the cinematography is straight out of \"Halloween\". But \"Maskerade\" stands on its own. Slasher fans MUST check it out.",
         "I went into Maskerade otherwise known as Mask Maker with low expectations, the cover looks highly generic and the premise sounds like a lot was taken from the Texas Chainsaw Massacre franchise. Immediatly you are introduced to your usual group of 20 somethings, 3 girls and 3 guys including our obligatory \"Final girl\" It's all very standard stuff. It tells the story of a young couple who buy a house in the middle of nowhere (More cliches) It has a dark history involving murder and witchcraft, one which they accidentally find themselves digging up. We have an antagonist, we have the fresh meat and thus we have our standard slasher style death scenes. The whole thing is very play by numbers, but I'd consider it above par thanks to being not only well made but having a surprisingly good back story. Don't expect any shocks but if you like the genre you can do considerably worse than this, in fact I wouldn't mind seeing this become a franchise. The Good: Nikki Deloach Couple of great characters Great finale Decent plot The Bad: Jason London is wasted Lot is taken from other films Things I Learnt From This Movie: People in their 30's are still cast to play college kids",
         "Another slasher film. They still make them, I still buy them for about 10 pence. This one involves an annoying couple who have just bought a house that needs a bit of fixing up. You know, a bit of re-wiring, some double glazing. They might want to think about getting rid of undead serial killer in the back garden too. No serial killer is worth anything unless he has some victims, so this couple's annoying mates show up to get killed. You know the type – They're younger than you, better looking than you, have more sex than you. Kind of makes you want to kill them, remove their faces, and wear them as masks yourselves. So just like recent slasher films such as Stitches (okay), Blood Cabin (good), Madison County (pretty poor), The Bunnyman (ok) and The Rockville Ripper (ok), the killer chases folks around the house/barn/garden, they get the drop on him and fail to do anything about, blah blah you know the drill. Nothing much new to see here, although the 'using the victims faces as masks' thing kind of works.",
         "It's basically your typical slice 'n dice direct to video flick. It homages quite a few of the greats: Friday the 13th, TCM, Halloween. As well as having a few nice cameos from some Horror Stars: Treat Williams (Deep Rising, Dead Heat), Micheal Berryman (The Hills have Eyes, The Guyver), Terry Kiser (Friday the 13th 7) & Playing the \"Masked Monster\" Jonathan Breck (Jeepers Creepers 1&2). It has some good kills, some nudity, nice bits of gore. Without giving away too much as you all know I hate to read \"SPOILERS\". It's about a diseased young man who sees his mother killed for being a witch, fast forward to many years later a couple buys the land & the farmhouse which sits on the property but before they get too settled in the locals & the previous owner decide that the property belongs elsewhere..... The best bit is the ending...it's so great & (pardon the pun) a hell of a twist, you'll understand the pun once you watch the movie. I recommend this movie as a nice lil gory popcorn treat for this holiday season.",
         "I'm not a fan of scary movies but occasionally I am rewarded. Many scary movies prove to be so much more, and that was true in this case. I thought I was in trouble when the opening was very, very dark and everything looked green, but then the action switched to a college campus, where the intelligent, determined and pretty Jennifer is showing what she is capable of in a business class. This almost seems like a light-hearted comedy for a while, which is fine with me. And when the friends show up at the house, it's an enjoyable comedy once again, thought somewhat raunchy too. But we know that won't last. Then it's time for Jennifer to join her friends, and particularly her boyfriend Evan. There are serious problems with the sound, which I attribute to the frank sexual talk that apparently ventures into territory inappropriate for broadcast TV. These kids also apparently use the F-word a lot; I'm just guessing. Evan has a surprise for Jennifer--he has bought a creepy old house on 40 acres out in the middle of nowhere (actually, Jennifer's name is on the deed). Jennifer, who has a high-energy, go-getter attitude, doesn't seem like she would be comfortable outside the big city. But Jennifer is remarkably adaptable. Once she sees the house she is excited, though sort of reluctant. And Evan wants them to live there. The house can be fixed up, with some effort. And they have their friends to help. But why did Evan get such a good deal? The hints can be found in those disturbing scenes in green. All we really know is that a boy named Leonard was very sick and a woman is very upset with the parents, who had premarital sex, which in her eyes makes the boy evil. And Evan and Jennifer soon find out something is wrong with the house. When they go into town, a man there named Mr. Peck is very shaken by the idea someone will be living in that evil house. He eventually warns them they should stay away. And let me be clear: they should have listened! I'll leave it to actual fans of scary movies to evaluate that part of the movie. To me it was plenty scary and quite violent. I never saw the great classics like \"Halloween\" and the Freddy Krueger movies but this seems similar; that's not necessarily a bad thing. It's a formula used many times. One decapitation is quite realistic. I thought that person's head was real (on a 13-inch screen), but there is no way it could have been done without creating a fake head. Nikki Deloach is quite good. She is not only smart and capable of handling nearly any situation, but also easy to like. You wouldn't expect her character to fall apart but she does that admirably. And we do get to see her topless from the back; I'm not entirely sure what she has on under that t-shirt after she gets out of bed, because I thought I saw panties, but she's not quite covered by that t-shirt. Terry Kiser also stands out. His character has a history with this house which must be dealt with. He's quite scary, but we later learn this is justified. The other leading actors are talented as well. One of the girls can't resist the old-fashioned bathtub. I do wish we had seen more background of just what happened in the house in the early years. And I have to question how, if that house has been abandoned for 50 years as everyone said, did it still look so good? No dust or anything. And how did everything work so well? And did these kids actually sleep under sheets that hadn't been changed for 50 years? It was like the place had been occupied in the previous month. I also have to question how one character healed so fast. This person was in obvious pain and limping, but then when it becomes urgent that a miracle take place, this person can run. And where did the movie's title come from? I saw no one making masks. It's not a classic, but it can be enjoyable if you can stand the violence.",
         "I was looking for a decent horror movie today and this caught my eye. It does have an interesting plot, and is overall an okay movie. It doesn't ooze blood and guts, but there are certainly some moments where you may look away (at least I did). Most of the characters really don't grow on you, but the couple the movie revolves around certainly does. I found myself going, \"run he's right there.\" Maybe it was just me but I did develop a sort of connection. The killer had some story behind him which was nice. Unlike some movies where you really don't know why they are killing people. So I thought that was nice. Overall though it was an alright movie. I personally did not like the end of the movie, but go ahead and watch it and decide for yourself!",
         "I watch horror movies all the time. After reading all of the comments about this movie I was taken back on how much this movie was disliked. The gore was cool, there could've been more though. I did like how no one lived..you don't see that in a lot of movies (except some zombie movies) and I like to see a change. All in all, I thought the movie was pretty good. Compared to a lot WORSE I have seen over the years...Most of these crappy movies make you want to turn them off 5 minutes into it. The actors where so much better than others, that's for sure! I don't think I would ever watch it again but I don't regret watching it. I would have to say my favorite part in the movie is when he puts the faces on. Also, at the end, when the face gets ripped off..that was cool :-) I think more squirting blood could've made it better.",
         "I liked this movie. A lot of lower-budget horror films have a lot of actors that are lacking, but in this case, the acting wasn't too bad. In fact, it's good enough to concentrate on the story, and not on the terrible deliveries. (Although that skinny girl who likes to do accents could have been MUCH better. I guess it's good that she's offed early in the film.) I guess, the best way to summarize this film is: \"The Texas Chainsaw Massacre Happened on Friday the 13th (in the Home of a Murdered Baby-Killing Voodoo Priestess in Louisiana).\" Which is good, if you liked Jason and Bubba, and are yearning for more. As previously mentioned by another reviewer, not a lot of on-screen gore (which, in reality is good -- too many slasher films go all out to get the shot, whereas this one gives you a little and lets your mind fill in the blanks ... very Hitchcockian if you think about it ... and something I expect from up-n-coming director Griff Furst, who also wrote the film)."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Active Entertainment",
         "Bullet Films",
         "XXX Filmproduktion GmbH & Co KG"
      ],
      "summaries": ["When a young, deformed boy witnesses his mother's death, he comes back to take revenge on anyone who dares enter his property."],
      "budget": 0
   },
   "movielensId": 122345,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-01-01",
      "dvdReleaseDate": null,
      "directors": ["Griff Furst"],
      "runtime": 90,
      "movieId": 122345,
      "title": "Mask Maker",
      "mpaa": "R",
      "actors": [
         "Nikki DeLoach",
         "Stephen Colletti",
         "Anabella Casanova",
         "Ross Britz",
         "Terry Kiser",
         "Mariah Bonner",
         "Lara Grice",
         "Michael Berryman",
         "Treat Williams",
         "Jason London"
      ],
      "imdbMovieId": "1577055",
      "originalTitle": "Mask Maker",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["krUxKLK_TrI"],
      "plotSummary": "A lucky couple hits the jackpot when they purchase a 19th century plantation home for pennies on the dollar. Determined to get rich quick, they invite their friends up for the weekend to celebrate their good fortune. It’s quickly apparent that the plantation home’s former residents have not left and the unlucky youths suddenly find themselves running for their lives!",
      "tmdbMovieId": 62904,
      "avgRating": 2.5,
      "releaseYear": "2010",
      "numRatings": 8,
      "posterPath": "/ezteEVfZ1ej2lHRPhLcdLixO7uD.jpg"
   }
}