{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0301526",
      "video": false,
      "title": "The Land Before Time VIII: The Big Freeze",
      "recommendations": [
         25556,
         24102,
         24554,
         39961,
         17337,
         24556,
         31933,
         19165,
         19164,
         19004,
         15997,
         57355,
         110395,
         339526,
         26542,
         25913,
         34942,
         40212,
         234325,
         68486
      ],
      "backdrop_path": "/9qrRl8o5efX7CBpe0Kb8IlhX3y0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Narrator / Cera's Dad",
               "gender": 2,
               "credit_id": "52fe44d0c3a368484e0388df",
               "name": "John Ingle",
               "profile_path": "/d7RnwWIuBjMpDRSpz3mTaCHMmOc.jpg",
               "id": 44052,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Spike / Stegosaurus Leader (voice)",
               "gender": 2,
               "credit_id": "52fe44d0c3a368484e0388e9",
               "name": "Rob Paulsen",
               "profile_path": "/hHgifZsqtTchMvpxGspoKGnqvmZ.jpg",
               "id": 43125,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Littlefoot (voice)",
               "gender": 2,
               "credit_id": "52fe44d1c3a368484e038911",
               "name": "Thomas Dekker",
               "profile_path": "/1wDz8UVkG7rx6t96QKuMrKCo9wj.jpg",
               "id": 34199,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Cera (voice)",
               "gender": 1,
               "credit_id": "52fe44d1c3a368484e038915",
               "name": "Anndi McAfee",
               "profile_path": null,
               "id": 35224,
               "order": 3
            },
            {
               "cast_id": 22,
               "character": "Petrie / Corythosaurus (voice)",
               "gender": 2,
               "credit_id": "5402d5810e0a2658de006edc",
               "name": "Jeff Bennett",
               "profile_path": "/bms3A7TA0QItjtUlB28qv4MFFAH.jpg",
               "id": 34982,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Tippy's Mom / Ankylosaurus (voice)",
               "gender": 1,
               "credit_id": "52fe44d1c3a368484e03891d",
               "name": "Susan Krebs",
               "profile_path": "/bmMA8XShMcolpmNTtWIEaYBbX7L.jpg",
               "id": 156617,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Tippy (voice)",
               "gender": 2,
               "credit_id": "52fe44d1c3a368484e038921",
               "name": "Jeremy Suarez",
               "profile_path": "/ktydBVBvNUlmfJj56aYwJ0O31JN.jpg",
               "id": 61959,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Grandpa / Lambeosaurus (voice)",
               "gender": 2,
               "credit_id": "52fe44d1c3a368484e038925",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Grandma (voice)",
               "gender": 1,
               "credit_id": "52fe44d1c3a368484e038929",
               "name": "Miriam Flynn",
               "profile_path": "/6VKACA883vyve6uuviO4I6QpluL.jpg",
               "id": 35109,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mr. Thicknose (voice)",
               "gender": 2,
               "credit_id": "52fe44d1c3a368484e03892d",
               "name": "Robert Guillaume",
               "profile_path": "/6lXvLF1v4wpW1uLDIjti3WuSoAX.jpg",
               "id": 8294,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Ducky (voice)",
               "gender": 1,
               "credit_id": "52fe44d1c3a368484e038931",
               "name": "Aria Curzon",
               "profile_path": "/ae2PTYLqCVdt5Qy0DjJaKe3Ahpc.jpg",
               "id": 91022,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Ducky's Mom / Petrie's Mom (voice)",
               "gender": 1,
               "credit_id": "52fe44d1c3a368484e038935",
               "name": "Tress MacNeille",
               "profile_path": "/nUURm7MBAvKNq79gBhOVfs7Zlhl.jpg",
               "id": 34983,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d0c3a368484e0388e5",
               "name": "Charles Grosvenor",
               "profile_path": null,
               "id": 90864,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d0c3a368484e0388ef",
               "name": "John Loy",
               "profile_path": null,
               "id": 30692,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d0c3a368484e0388f5",
               "name": "Charles Grosvenor",
               "profile_path": null,
               "id": 90864,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d0c3a368484e0388fb",
               "name": "Daniel J. Wiley",
               "profile_path": null,
               "id": 91028,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d0c3a368484e038901",
               "name": "Michael Tavera",
               "profile_path": null,
               "id": 58289,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d0c3a368484e038907",
               "name": "Danik Thomas",
               "profile_path": null,
               "id": 91021,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d0c3a368484e03890d",
               "name": "Devon Bowman",
               "profile_path": null,
               "id": 1141618,
               "department": "Sound",
               "job": "Production Sound Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.810956,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25587,
      "vote_count": 55,
      "budget": 0,
      "overview": "When the dinosaur families get trapped in a valley by an ice storm, one family of \"spike tail\" dinosaurs volunteers to leave since they consume more food than the others. Meanwhile, the young dinos and a new adult dinosaur named Mr. Thicknose, head out to bring back their friend Spike, who has left his friends to be with members of his own species.",
      "similar": [],
      "original_title": "The Land Before Time VIII: The Big Freeze",
      "runtime": 75,
      "poster_path": "/AsWol0XNnQhwSQYeyuOz6uhnVEk.jpg",
      "spoken_languages": [
         {
            "name": "Dansk",
            "iso_639_1": "da"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Universal Cartoon Studios",
         "id": 4285,
         "origin_country": ""
      }],
      "release_date": "2001-12-04",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": "/alkvR9vTtuZEmd5ygsayOfxYOMa.jpg",
         "name": "The Land Before Time Collection",
         "id": 19163,
         "poster_path": "/n1bjdBVThBezxR6nEf2dy43sTtV.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Grosvenor"],
      "runtime": 75,
      "synopsis": null,
      "writers": ["John Loy"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0301526/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3OTM5OTIwMF5BMl5BanBnXkFtZTcwODY2MjQyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: John Ingle, Aria Noelle Curzon, Rob Paulsen | See full cast and crew »"],
      "reviews": [
         "The title says it. The action is not exactly long, but I think \"Family\" makes up for it. (SPOILER) Snow falls on the great valley and there are a few days of snow fun. Spike and Ducky get a bit mad at each other and Spike goes off with a migrating herd of Stegos. The kids enlist the help of know-it-all fraud Mr. Thicknose to guide them through the Mysterious beyond. They are reunited with ducky and face a rex. Their joint efforts pull through. They find a hot spring and green food. Thicknose admits his fibbing. Later, they go to the great valley to show the others the spring. They are soon joined by the spiketails.(SPOILERS END) I still can't help praising \"Family\" for its significance to the plot.",
         "Unfortunately, this LBT has a spoilt, usually positive Ducky who is now grumpy and a storyline that is good for teaching but not very good for a LBT film. Luckily, the plot is all right and the songs are good, especially \"Family\" and the learning songs. The animation is quite good as well, sort of in between LBT 7's animation and LBT 9's animation. The new characters are entertaining. Mr. Thicknose is a wise threehorn (they are all dinosaurs) who likes to teach Littlefoot and his friends. While he talks to them again, Ducky is angry at Spike and Littlefoot is worried that he is seeming to upset Mr. Thicknose. The film continues on as a pretty good learning adventure and an adventure good for an animated film. The best character in this who is one of the main five is Petrie. Ah well. Enjoy \"Land Before Time VIII: The Big Freeze\".",
         "Although the original film (10/10) can never be matched, this heartwarming sequel comes close. This time Ducky & Spike take centre stage as their \"sibling\" relationship is tested. They love each other but know that they are different. Spike faces a difficult decision when a herd of spiketails, including a cute infant, invite him to join them. The friends see snow for the first time and learn how it can be good and bad. The story has laughter, tears & adventure. The characters are as loveable as ever and the songs are not unpleasant. I am proud to own all 8 films and this is one of the best. (9/10) I look forward to future releases. Long live the Land Before Time!",
         "While a long way from being the worst, this sequel isn't the best either. It does benefit from some nice colourful animation, a sweet story and a sterling vocal turn from Robert Guillaume(who also voiced Rafiki in \"The Lion King\"). Actually in general the whole voice cast was very well done. However, while sweet the songs aren't exactly memorable, some of the dialogue is a little on the corny side and the film is too short. I may be alone as well in thinking the singing was a tad weak, Guillaume has done much better singing before. Overall, I do recommend it for kids, they will definitely love it. However depending on whether you loved the first film, I did, or how old you are, others may find it disappointing. It does do the right thing though, provides decent entertainment for its target audience. 5.5/10 Bethany Cox",
         "Boy that Universal really knows how to milk (or should I say \"Mine\") a franchise to death, these sequels seem to get cheaper & cheaper every time, it's really sickning that one of Don Bluth's classic mytho's is getting buchered more & more with near low quality sequels like this, I wonder how Don feels about this? I'm sure glad MGM didn't take The Secret Of Nimh to the same direction as Land Before Time (hey, one dog ugly sequel was bad enough), if there's ever a Land Before Time 9, I think they should try \"Land Before Time IX, The Mushroom Cloud\".",
         "this movie is probably one of THE most amazing movies ever ... some of my friends laugh cause i still watch these movies to this day ... I've been watching them for 15 years and i never get sick of them. .i hope that they end up making at least 20 .. because i know that i will still be watching them . and to the person that insulted them before YOU SUCK .. cause I'm sure almost everyone agrees how AWESOME all the Land Before Times are : ) me and my friends watch it all the time .. and were 15 and 16 years old. and we STILL love it i think that everyone should watch this movie .. because land before time is RED HOT !!!!!!!! :D:D:D:D:D",
         "Ah, I remember the good old days. 1988 it was, I was a little kid and had just been taken to see a great movie called Land Before Time. I really enjoyed it and wanted to see more of the cute talking dinos. Be careful what you wish for! Each sequel to the film has degenerated farther and farther from the original nice story into pure theatrical sludge. The characters have become increasingly more annoying, the plots are trite, the songs make you pray for the ice age and those are the series's GOOD points. As for this latest cinematic suppository, I can't help but say, in all honesty, that I would rather be castrated with a rusty pizza cutter then sit through it again. Five minutes of Land Before Time VIII can turn your brain into cottage cheese. This is the worst case of sequelitus I have ever seen. It's high time these dinosaurs became extinct!",
         "The Land Before Time VIII: The Big Freeze, the eight installment in the Land Before Time series. I can't believe how many more movies there are to this series, it's a bit crazy, I feel like I'm on a Lord of the Rings type journey. But still it has been a decent one, you know each time I go onto the home page of the new Land Before Time sequel, the rating is low and the reviews are all very bad, just saying how sick everyone is of this franchise. Personally though I've enjoyed it, each film as silly as it may be, has a very good message and I think is just a great family film. Something that both the kids and the adults can enjoy together. After all it may be cheesy, but look who this was made for, the kids. I like these stories, they're very cute and always teach something. Littlefoot and his friends are being tutored by a dinosaur named Mr. Thicknose who claims that he's been there, done that, seen it all, heard it all, etc. When Littlefoot questions him, he gets angry and Grandpa tells Littlefoot that they all respect Mr. Thicknose and his \"experiences\". Ducky is also getting annoyed with Spike lately, she can't get any sleep because of him, but when Cera tells her to express herself, she takes it the wrong way and gets angry with Spike letting him clearly know on how angry she is with him. When the dinosaur families get trapped in a valley by an ice storm, one family of spike tail dinosaurs volunteers to leave since they consume more food than the others. Meanwhile, the young dinos and Mr. Thicknose, head out to bring back their friend Spike, who has left his friends to be with members of his own species. Spike also starts to miss Ducky, but they have bigger problems when the food is extremely scarce. But realizing that Mr. Thicknose may not exactly know all, Littlefoot and his friends are now facing this challenge head on facing the extreme cold weather. The Land Before Time VIII: The Big Freeze I think is a film definitely worth watching. I loved watching Ducky and Spike's relationship being renewed, that they can get annoyed with each other but still end up loving each other more than ever in the end. I also thought it was kind of funny with the story between Littlefoot and Mr. Thicknose, sensing that Mr. Thicknose was somewhat jealous of Littlefoot's curiosity and questions. This is a good sequel to the series, yeah, I agree that there are a lot of these movies, but each one has been good for different reasons. So I would recommend watching this one, so far all the sequels have been good, so I don't know what to expect in the next sequel, but I still have good hopes since this has been a great series to get into. 5/10",
         "I loved the Land Before Time (first one). I love Don Bluth movies in general. I would like to point out The first LBT was the ONLY one that Don had a hand in. You will notice that it is a new director every 3 or so movies after that. It is so sad that it has become the norm now to take something that was wonderful and heartfelt and turn it into a marketing scheme =(. I have only seen this sequel, and I don't plan on seeing any of the others, I prefer to leave my childhood memories of Littefoot, Petrie, Cera and the others intact. I miss animated movies that had imagination and an obvious amount of thought and effort put into them, most movies now a days are cranked out for the soul purpose of making money. So sad.",
         "This one was made in 2001, a year after the 7th's release. I remember this one. The story is about where Snow falls in the great valley for the first time, Spike meets a new friend called Tibby. Tibby's mother asks Spike's mother permission if he could go with Tibby and his family on a long walk to where they lived. Ducky gets jealous as she thinks that Spike doesn't want his intrests in Ducky no more."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family"
      ],
      "productionCompanies": [
         "Universal Cartoon Studios",
         "Universal Studios"
      ],
      "summaries": ["When the dinosaur families get trapped in a valley by an ice storm, one family of \"spike tail\" dinosaurs volunteers to leave since they consume more food than the others. Meanwhile, the young dinos and a new adult dinosaur named Mr. Thicknose, head out to bring back their friend Spike, who has left his friends to be with members of his own species."],
      "budget": 0
   },
   "movielensId": 122413,
   "movielens": {
      "languages": [
         "Dansk",
         "English"
      ],
      "releaseDate": "2001-12-04",
      "dvdReleaseDate": null,
      "directors": ["Charles Grosvenor"],
      "runtime": 75,
      "movieId": 122413,
      "title": "The Land Before Time VIII: The Big Freeze",
      "mpaa": "G",
      "actors": [
         "John Ingle",
         "Rob Paulsen",
         "Thomas Dekker",
         "Anndi McAfee",
         "Jeff Bennett",
         "Susan Krebs",
         "Jeremy Suarez",
         "Kenneth Mars",
         "Miriam Flynn",
         "Robert Guillaume",
         "Aria Curzon",
         "Tress MacNeille"
      ],
      "imdbMovieId": "0301526",
      "originalTitle": "The Land Before Time VIII: The Big Freeze",
      "genres": [
         "Adventure",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["CoBez6DwrFg"],
      "plotSummary": "When the dinosaur families get trapped in a valley by an ice storm, one family of \"spike tail\" dinosaurs volunteers to leave since they consume more food than the others. Meanwhile, the young dinos and a new adult dinosaur named Mr. Thicknose, head out to bring back their friend Spike, who has left his friends to be with members of his own species.",
      "tmdbMovieId": 25587,
      "avgRating": 3.11111,
      "releaseYear": "2001",
      "numRatings": 18,
      "posterPath": "/AsWol0XNnQhwSQYeyuOz6uhnVEk.jpg"
   }
}