{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "outlaw",
            "id": 9503
         },
         {
            "name": "loot",
            "id": 155239
         },
         {
            "name": "ghost town",
            "id": 166701
         }
      ],
      "imdb_id": "tt0051848",
      "video": false,
      "title": "The Law and Jake Wade",
      "recommendations": [
         179087,
         48409,
         83099,
         44921,
         39295,
         47019,
         31736,
         83136,
         64866,
         118653,
         17677,
         19946,
         86608,
         31658,
         43114,
         48740,
         5063,
         83122,
         42402,
         43380
      ],
      "backdrop_path": "/ltZF07qrnTWGRRpn7dYDLhwaIHm.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "592065729251414ab1045955",
         "content": "More than meets the eye in John Sturges' excellent Oater.\r\n\r\nJake Wade, a former thief and gunman is now the town marshal. Out of a need to clear a debt, he breaks a former accomplice of his, Clint Hollister, out of jail, and almost immediately starts to regret it. It seems that Wade hid some monetary spoils out in the hills and Hollister wants his hands on it. So along with his gang, Hollister forces Wade and his fiancée to go out searching for the cash. But not only is there conflict within the group, there is the small matter of the deadly Comanche to worry about as well.\r\n\r\nThe Law And Jake Wade comes with some pretty solid Western credentials from the off. Directed by John Sturges (Gunfight at the O.K. Corral/The Magnificent Seven), starring Richard Widmark (Warlock/The Alamo), Robert Taylor (Saddle The Wind) and photographed by Robert Surtees (Oklahoma!/Escape from Fort Bravo). Widmark is on prime bad guy form as Hollister, and Taylor, who was often accused of being stiff, is perfect foil playing sedate off of Widmark's borderline evil. The cinematography is luscious from Surtees, both Death Valley and The Alabama Hills in California are as imposing as they are beautiful, with Sturges framing his blurry good vs bad characters amongst them to great effect. What action there is {this is primarily a talky picture in reality} is handled adroitly by the wily Stugess, with a Comanche attack on our protagonists in a ghost town, particularly exciting. It's very rare to see arrows and spears glide so gracefully on their path to pain as we do here, all crisply enveloped in MGM's choice of Metrocolor.\r\n\r\nBut really it's with the story itself that the film lifts its being to rank with the better genre offerings. William Bowers' screenplay, adapting from the Marvin H. Albert novel, on the surface looks like a standard good guy-bad guy dovetail piece, but things are purposely left unanswered to fully form the issues (yes you read it right). Is it for nothing that Wade, our law man, the \"good\" guy, is all in black throughout the piece? With Hollister all shiny in denim blue! Why is the money out buried in the hills after all this time? And come the finale you should be forced into a rethink about the law and all its little peccadilloes. There really is more on offer here if you give it your undivided attention. Some minor itches aside {Patricia Owens love interest looks lost for example}, The Law And Jake Wade is a fine genre piece that deserves better than being called a weekend time filler. 8/10",
         "url": "https://www.themoviedb.org/review/592065729251414ab1045955"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jake Wade",
               "gender": 2,
               "credit_id": "52fe469bc3a36847f8108165",
               "name": "Robert Taylor",
               "profile_path": "/wrtbJwt7K9i3mzfH2TVAea9WGEY.jpg",
               "id": 82216,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Clint Hollister",
               "gender": 2,
               "credit_id": "52fe469bc3a36847f8108169",
               "name": "Richard Widmark",
               "profile_path": "/whrZ2aEg3FghVaDJf0JRrEhFLWl.jpg",
               "id": 12149,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Peggy",
               "gender": 1,
               "credit_id": "52fe469bc3a36847f8108179",
               "name": "Patricia Owens",
               "profile_path": "/nsCjG8tobJl0Giq0gL1PxRH6xUb.jpg",
               "id": 70564,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Ortero",
               "gender": 2,
               "credit_id": "52fe469bc3a36847f810816d",
               "name": "Robert Middleton",
               "profile_path": "/qjEpwxigGaaf32cDbSNL143I4in.jpg",
               "id": 29363,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rennie",
               "gender": 2,
               "credit_id": "52fe469bc3a36847f8108175",
               "name": "Henry Silva",
               "profile_path": "/wSDmsMhQ95utBggMaHOCALMM9CC.jpg",
               "id": 14731,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Wexler",
               "gender": 0,
               "credit_id": "52fe469bc3a36847f8108171",
               "name": "DeForest Kelley",
               "profile_path": "/fUL1BY8XjLsQihueDD1UUAm0Qy6.jpg",
               "id": 1750,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lieutenant",
               "gender": 2,
               "credit_id": "57449c439251414f9800003e",
               "name": "Burt Douglas",
               "profile_path": null,
               "id": 167371,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Burke",
               "gender": 2,
               "credit_id": "57449c549251414f89000041",
               "name": "Eddie Firestone",
               "profile_path": null,
               "id": 12423,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe469bc3a36847f8108161",
               "name": "John Sturges",
               "profile_path": "/69nD2UYoNGFpDBYUKrEiutWKDgO.jpg",
               "id": 14520,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe469bc3a36847f810817f",
               "name": "William Bowers",
               "profile_path": "/31257PgXpPD7npsbBlO9eZoKgXK.jpg",
               "id": 69948,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe469bc3a36847f8108185",
               "name": "Marvin H. Albert",
               "profile_path": null,
               "id": 16889,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 1.6067,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44766,
      "vote_count": 12,
      "budget": 0,
      "overview": "Jake Wade breaks Cling Hollister out of jail to pay off an old debt, though it's clear there is some pretty deep hostility between them. They part, and Jake returns to his small-town marshal's job and his fiancée only to find he has been tracked there by Hollister. It seems they were once in a gang together and Jake knows where the proceeds of a bank hold-up are hidden. Hollister and his sidekicks make off into the hills, taking along the trussed-up marshal and his kidnapped bride-to-be to force the lawman to show them where the loot is.",
      "similar": [
         13496,
         49849,
         9086,
         11967,
         7299,
         4512,
         253,
         429,
         33,
         1368,
         44896,
         755,
         57201,
         76640,
         5698,
         11509,
         11886,
         588,
         196,
         11897
      ],
      "original_title": "The Law and Jake Wade",
      "runtime": 86,
      "poster_path": "/dKUT6UDardg67QbaFqUVIWF1gqK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1958-06-06",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The girl is a captive hostage at the mercy of the West's most notorious bandit-killer.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Sturges"],
      "runtime": 86,
      "synopsis": "We meet Jake Wade (Robert Taylor) as he sneaks into a jail and holds up the Marshal to spring Clint Hollister (Richard Widmark) who has been imprisoned for robbery and murder. With his aiding Clint in escaping from prison Jake has ostensibly paid back an old debt owed the man from the days when the two rode together as outlaws as members of Quantrill's Raiders, shooting their way into towns after the Civil War to rob and loot for their own profit. Jake has since used his abilities to good use becoming a Marshal himself, but satisfying his own personal justice by taking care of this one last thing before he settles down with the nubile young Peggy Carter (Patricia Owens) for domesticity. Clint still holds a grudge for Jake's running out on him with $20,000 dollars from their last bank job, from which Jake carries guilt from believing he had shot and killed a young boy. Clint gathers together a gang and kidnaps Peggy and coerces Jake into taking them to when he has hidden the money and during the trip the group runs into blood-thirsty Comanche Indians. Will any sense of loyalty emerge from Clint before Jake gives up the money, or will the savagery of the untamed Western landscape take its toll?",
      "writers": [
         "William Bowers",
         "Marvin H. Albert"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051848/",
      "coverLink": null,
      "actors": [
         "Robert Taylor",
         "Richard Widmark",
         "Patricia Owens"
      ],
      "reviews": [
         "I just learned that Richard Widmark passed away at the age of 93. Widmark was on a short list of my all time favorite actors, sharing top billing with Fred MacMurray, George Peppard, and the brilliant (in my opinion) supporting actor Martin Balsam. The best actors seem to adapt their roles to themselves, so that they never lose their off-screen persona. Frank Sinatra was always himself in his movies, as was John Wayne. And so was Richard Widmark. Why do we like \"bad guys\" so much? Possibly because we get the feeling that in their private lives they are neither good nor bad, but rather, something even better: genuine. Richard Widmark never divorced. He outlived two wives, one marriage lasting 55 years until his first wife passed on. So we know he was not a loner, although his life style was private, as he never appeared on TV talk shows to promote his movies or himself. Buoyed by his inimitable personal qualities, he carved a unique niche for himself in film, and ran with it for a half- century. The Law and Jake Wade made a strong impression upon me, seeing it for the first time, as a 16-year old, shortly after its release in 1958. This film had a 3-D quality, and a horror film quality which really grabbed its audience, at that time. By 1958 the 3-D fad was long gone, but, I swear, when the Indians attacked Widmark's gang at night with bows and arrows, it seemed like 3-D revisited as the arrows seemed to be coming right through the screen at the audience. Even knowing it was a movie, I was petrified, so realistic is this scene. Unfortunately, this realism cannot be duplicated via DVD or any lesser medium. Abetting all this excitement is the contrast in style of Widmark and Robert Taylor. While Taylor had adopted family values and professional law man responsibility following his maverick Civil War renegading in partnership with Widmark, Widmark, as the years passed, would have none of the maturing and sobering process to which most men evolve, after having sown their wild oats. So that when Widmark and Taylor locked horns due to a conflict of interest and values, long after the war's end and the demise of their gang, there could be no reconciliation as their cross-purpose came to a head. Widmark's upbeat, anti-social mores neatly bounce off Taylor's low-key, conventional manner, right up to their inevitable show-down. And it doesn't matter whether Widmark prevailed in the end, his is the character which makes this an enduring film-going experience. *****",
         "Some of the best westerns of the Fifties and Sixties were directed by director John Sturges. Sturges's films combined that rare blend of action for the kiddies with adult problems and issues. Here the problem is a debt owed or at least that's what Marshal Jake Wade feels towards Clint Hollister. Before Jake broke with the Hollister, it seems that Hollister saved him from a hangman's noose back when he ran with Hollister's gang. Jake hears about Hollister being arrested and sentenced to be hanged so he rides a piece and breaks him from jail. That squares it as far as the Marshal is concerned, but the outlaw leader has other ideas. Seems Jake ran off with the proceeds from the last job. No good deed goes unpunished in this life. Hollister re-unites with his gang and they kidnap the Marshal and his fiancée and force him to lead them to the money. You have to watch the film for the rest of this. If you're any kind of a fan of westerns, I think you'll know how this turns out. Robert Taylor plays the upright Marshal Jake Wade who could have let the whole thing slide and let outlaw Richard Widmark hang, but he feels a debt. It's a good part for Taylor as he was winding down his contract at MGM. Unfortunately Taylor doesn't figure that Widmark owed him something for running off with the loot. The two leads play well off each other. Rounding out the cast is Patricia Owens who is your typical crinoline western woman and the rest of Widmark's gang which included DeForest Kelley, Robert Middleton, and Henry Silva among others. Nice Saturday afternoon fare for all fans of the American western, like me.",
         "\"The Law and Jake Wade\" was made in 1958 and starred Robert Taylor as a former outlaw who gave up the life of crime and became Marshal Jake Wade. Taylor's character is chased by a former outlaw associate, Clint Hollister, eagerly portrayed by Richard Widmark, who returns with two intentions; first, to find the stolen bank money that Wade had hidden in a job they did together, and then kill Jake Wade for causing him so much trouble in the first place. The outlaw gang's portrayers are Henry Silva, Robert Middleton, Eddie Firestone, and before his days in \"Star Trek\" DeForest Kelley, and all set out to find the missing money. There is, however, some Comanche Indians on the warpath, and the trek where Taylor is leading them to is also in the territory controlled by the Indians. All the elements for a watchable western are included in this one, and the viewer can also take in some views of the western wildlands. A nice 7/10",
         "In his second Western of 1958, after \"Saddle the Wind,\" Taylor again is a reformed outlaw who has deserted Widmark's gang, taking along the proceed from a bank robbery... Taylor becomes a highly respected marshal of a small New Mexico town... He discovers that his old gang leader Widmark faces hanging nearly on a murder charge... Since Taylor owes his companion an ancient favor, he decides to help him escape from jail, but lives to regret it... Widmark kidnaps Taylor and his sweetheart Patricia Owens and he and his four confederates (Robert Middleton; Henry Silva; DeForest Kelley and Burt Douglas) force them across the Sierras to a deserted ghost town where Taylor has hidden a buried loot... Taylor and Owens attempt to escape but Widmark drives them into the town to recover the money... The Comanches were there on their backs... A well-staged Indian raid follows plus the final showdown.. With good shots of the High Sierras and Death Valley, \"Law and Jake Wade\" is a good standard Western filled with irony dialog and sardonic humor, enjoyable throughout, but with no outstanding merits...",
         "Seems to me Widmark's character would have been money ahead to simply knock off another bank rather than go into injun country where the chances of dying were pretty high. However, this probably wouldn't have made any better of a film. Plenty of shooting, flying arrows, nasty killers, and as usual Widmark gives a stellar performance as a psychotic gunman intent on having his way no matter what.",
         "Robert Taylor stars as Jake Wade, former outlaw gone straight who must battle his old partner, Richard Widmark as Clint Holister, the leader of a band of outlaws wanting to find stolen bank money, the location of which only Jake Wade knows. Robert Taylor does a competent job in the lead, but Richard Widmark really steals the show as the menacing leader of the gang. The movie is exciting, fast paced and leads to a satisfying climax. Good solid western.",
         "Reformed marshal helps former cohort escape from prison, but comes to regret it. Taylor is fine as the stoic marshal trying to escape his outlaw past. Widmark makes a terrific villain, without resorting to the giggling psycho persona that marked many of his earlier performances as bad guys. He even has some funny lines. The enigmatic Silva is notable as a member of Widmark's gang. Sturges made a number of Westerns during the 1950s. This is another solid entry in the director's Western filmography, although it's not as good as the one that preceded it (Gunfight at the O.K. Corral) or the one that followed it (Last Train from Gun Hill).",
         "'Old' Westerns aren't my favourite type of film - never have been, but if I had to make an exception for a classic example, right now this would be it. One thing in its favour from my point of view is that it tells a simple story which really boils down to one man versus another. Sure, both the title character and the baddie have cohorts, but the crux of the matter is that there's a score to be settled between the two leads. Joyfully, there isn't a posse in sight (unless you include the Indian encounter.) There's nothing' better than a man trying to atone for his past getting caught up once more with an old accomplice who won't let him forget it. What some call a wooden performance from Robert Taylor, I prefer to call 'relaxed'. I've seen him harshly judged in some quarters, but to me he was a likable presence - although it's true to say that of the two, Richard Widmark takes top honours. The final showdown is tense and competently strung out by Sturges. While it's not quite mano a mano, it IS one on one... To me, that's a good thing.",
         "Was there ever a more suitable cowboy than Robert Taylor? I think not! Again Taylor plays the man with a hidden past, as he did in Undercurrent and Conspirator. This time he is a marshal in a small town, who owes his former companion, Clint Hollister, a menacing and dangerous man on the run, played wonderfully well by Richard Widmark. He breaks him out of jail just as Widmark had done for him a year previous. The mistake is that he finds Jake and takes him and his fiancée on a torturous trip to get the money Jake hid from a bank hold-up. Patrcia Owens as Peggy, is angry and confused, when she finds out about his past, even though she had told him in the beginning that anything he had done before she \\ met him was of no interest. There is plenty of action in this western, and the scenery is glorious. Good against evil, or bad ethics on Taylor's part. You may wonder, what was he thinking? Supporting cast is great with Henry Silva in an early role, which shows you are great actor in the making. Old standards are Robert Middleton, who made many films with Taylor, and DeForest Kelley who went on to television fame in Star Trek. Taylor plays his part with quiet reserve, as the opposite of Widmark's hostile and outwardly evil character. If Taylor had done any- thing else with the part the story would not have seemed as credible. I don't think that Robert Taylor ever got enough credit for being an actor who could be anyone for anybody. Every man, a common man, therefore playing good guy or bad guy, he was always believable. Watch it, you will not be disappointed.",
         "I watched this out of the new Warner's DVD set tonight, I had caught it on TV about a month or so ago under a less that ideal setting. This time it had a proper viewing and my undivided attention. The film was Directed by John Sturges, and I can't recommend more that you see this alone for the gorgeous cinematography by Robert Surtees. Here is a Western that in outdoor locations and settings looks perfect. The sagebrush engulfed ghostown at the end is really impressive. Either they went to the trouble of building a partially collapsed wooden aqueduct to a water tank or the set was an actual real ghostown . These locations are all in Lonepine, Death Valley, and The Alabama Hills. Why no recent Westerns in the last 30 years have not been shot there is beyond me, but using those locations would be like slipping into a comfortable old pair of shoes and would also give a certain cachet to a work. Those locations are not as singularly iconic as the Buttes of Monument Valley, but they actually represent even more the West as a whole because they provide an infinite variety of jagged peaks, flat plains, alluvial fans, eroded badlands, and boulder fields. The film stars Robert Taylor as Jake Wade , a reformed outlaw, Richard Widmark as Wade's old partner in crime Clint Hollister from the Civil War Kansas/Missouri border war. Patricia Owens is Peggy Wade's fiancé who knows nothing of his past. Robert Middleton plays Ortero a member of the old Wade-Hollister Gang. Henry Silva is in one of his stock quasi lunatic hothead roles he played so well, as new gang member Rennie. De Forest Kelley (Bones from Star Trek) is again playing a heavy (very similar to what he played in Warlock) gang member Wexler, Eddie Firestone is I believe minor gang member Burke who rounds out the main cast. The story is basically that a reformed Wade finds out that Hollister has been captured and held in a jail awaiting a hanging close enough nearby to allow Wade to break him out in order to pay back a dept owed (Hollister saved his life). After accomplishing this Wade splits with Hollister to go back to his reformed ways, things don't quite go as planned. It seems that on the last job Wade & Hollister pulled Wade disappeared with $20,000. *note bene those who watch this the way they take no chances and bind this Wade's hands behind his back in stark contrast to the stupid remake of 3:10 to Yuma. The only minor things keeping this Western out of a top ten list are that the night time scenes are all shot on obvious sets one of which has a ridiculous backdrop painting of Monument Valley, looking very out of place. Another is that though all the clothes of the actors who have been on the trail supposedly for days are suitably well dusted up, none of the actors have any stubble or the beginnings of beards. And finally the way Robert Taylor looks & plays his part seems just a tad off the mark (old Hollywood style), its like the difference between Sturges' \"Gunfight at the OK Corral\" and his \"Hour Of The Gun\" the way in the former Lancaster appears as Earp with the way in the latter Garner looks as Earp. This is a definitely a Western to own.",
         "Any movie that adds significantly to my lexicon is tops in my book. Richard Widmark is so good at being so bad. He doesn't do it any better than in this movie. And ever since I've seen this move (many years ago) I always say, \"More of that doin' without thinking'\" whenever I do something mindless and/or stupid. Watch the movie and you'll see what I mean! I read the comment about Robert Taylor being a bad actor. He is rather stiff, but it doesn't seem to bother me. I had a friend say the same thing about Tony Curtis. I guess it is a subjective thing. Either it bothers you or it doesn't. All I really had to say was in the first paragraph. The rest was necessary to fulfill submission guidelines. What's wrong with a short review. Sometimes less is more!",
         "An awesome rugged Western masterfully directed by John Sturges including good main cast and agreeable secondary actors in which Marshal Taylor tangles with nasty bandit Widmark over a buried loot . It deals with outlaw Clint Hollister (Richard Widmark) getaways from prison with the help of a lawman with a dark past called Jake Wade , because once Clint did the same for him . Jake left Clint just after , but Clint finds him back and forces Jake by kidnapping his girlfriend called Peggy (Patricia Owens) to lead him to a loot Jake buried one year ago when he abandoned Clint . Hollister and his sidekicks (Robert Middleton, DeForest Kelley , Henry Silva) tie Jake and survey to no escape . Then Peggy learns all too quickly about Jake's dark past . When they arrive in the ghost little town where Jake hid the money, they have to fight off a bunch of marauding Indians . This exciting as well as robust Western contains tension-filled , juicy atmosphere , thrills , suspense , gun-play and an impressive final on a dead little town which was one of filmmaker Sturges's best moments . Magnificent western from the John Sturges/Richard Widmark team and their second collaboration , after ¨Backlash¨ and considered one of their best . Colour , music , scenarios , landscapes all marks well in this thrilling story about a compulsive outlaw who contends his old friend as well as his nemesis . It describes a long journey in which there are extreme characters combined with psychological observations and enriched by eventual ambiguity and a tense picture about dishonesty and badness . This particular Western only starred by a few characters contains an interesting screenplay by William Bowers based on the novel by novel Marvin H. Albert . By that time (1958) the picture was considered quite strong , tough , surprisingly violent ; today is deemed a classic film . And seems to be a great influence of wide range such as violence , a hard battle of wits among gunslingers and scenarios . The two stars , Robert Taylor and Richard Widmark , make nice adversaries . They are accompanied by a good support cast such as Robert Middleton , Henry Silva , Burt Douglas , Eddie Firestone and intimate ¨Bones¨ DeForest Kelley of Star Trek . Filmed in Cinemascope in colorful cinematography by Robert Surtees who gets to take from nature the maximum impacts as deserts , valleys , mountains , being wonderfully photographed . Being filmed on location in Alabama Hills , Lone Pine, Death Valley National Park,California, USA . Breathtaking background scenarios , dramatic close-up along with shining illuminations , all of them perfectly mingled with a tale full of violence , tension , intrigue and shoot'em up . This top-drawer Western drama was compellingly produced by William Hawkes and stunningly realized by the master John Sturges , infusing the traditional Western with psychological confusion , including his characteristic use of landscape with wonderful use of Natural Parks which is visually memorable . Sturges established his forte with magnificent Westerns almost always plenty of action , violence , and splendid outdoors . Sturges began his directing career at Columbia Pictures, where from 1946-49 he he worked on \"12-day wonders\" (\"B\" pictures shot on a 12-day schedule). From there he moved on to MGM where he filmed more \"B\" pictures, albeit on a larger budget . He established an independent production company in 1959, releasing through United Artists. From 1960-67 he worked under contract for United Artists. His first major hit was the western Dog Day at Black Rock (1955) , which he shot in just three weeks, wrapping up virtually every scene in a single take . He specialized in robust action pictures, particularly westerns. He excelled at bringing to life tautly written stories about tough characters facing difficult circumstances . Throughout his career he regularly alternated hits with misses . He has also been criticized for his lack of stylistic trademarks , though his best films remain exciting to watch . Sturges was expert on all kind of genres , but especially warlike such as : ¨Great Escape¨, ¨Ice Station Zebra¨ and ¨Eagle has landed¨ and Western such as ¨Last train of Gun Hill¨, ¨Magnificent Seven¨, ¨Backlash¨, ¨Law and Jake Webb¨, ¨Joe Kidd¨ and Chino¨, among others . This high-level and Western will appeal to Robert Taylor and Richard Widmark fans .",
         "Jake Wade, a former thief and gunman is now the town marshal. Out of a need to clear a debt, he breaks a former accomplice of his, Clint Hollister, out of jail, and almost immediately starts to regret it. It seems that Wade hid some monetary spoils out in the hills and Hollister wants his hands on it. So along with his gang, Hollister forces Wade and his fiancée to go out searching for the cash. But not only is there conflict within the group, there is the small matter of the deadly Comanche to worry about as well. The Law And Jake Wade comes with some pretty solid Western credentials from the off. Directed by John Sturges (Gunfight at the O.K. Corral/The Magnificent Seven), starring Richard Widmark (Warlock/The Alamo), Robert Taylor (Saddle The Wind) and photographed by Robert Surtees (Oklahoma!/Escape from Fort Bravo). Widmark is on prime bad guy form as Hollister, and Taylor, who was often accused of being stiff, is perfect foil playing sedate off of Widmark's borderline evil. The cinematography is luscious from Surtees, both Death Valley and The Alabama Hills in California are as imposing as they are beautiful, with Sturges framing his blurry good vs bad characters amongst them to great effect. What action there is {this is primarily a talky picture in reality} is handled adroitly by the wily Stugess, with a Comanche attack on our protagonists in a ghost town, particularly exciting. It's very rare to see arrows and spears glide so gracefully on their path to pain as we do here, all crisply enveloped in MGM's choice of Metrocolor. But really it's with the story itself that the film lifts its being to rank with the better genre offerings. William Bowers' screenplay, adapting from the Marvin H. Albert novel, on the surface looks like a standard good guy-bad guy dovetail piece, but things are purposely left unanswered to fully form the issues (yes you read it right). Is it for nothing that Wade, our law man, the \"good\" guy, is all in black throughout the piece? With Hollister all shiny in denim blue! Why is the money out buried in the hills after all this time? And come the finale you should be forced into a rethink about the law and all its little peccadilloes. There really is more on offer here if you give it your undivided attention. Some minor itches aside {Patricia Owens love interest looks lost for example}, The Law And Jake Wade is a fine genre piece that deserves better than being called a weekend time filler. 8/10",
         "How can a movie go wrong with a hero like Robert Taylor, a villain like Richard Widmark, glorious western scenery, and a director like John Sturges? It can't, until they put the music to it. I can't recall who the composer for this was, but he had definitely done better work. Music can make an excellent film a great one, take a marginal film and make it a memorable one, but occasionally the music drags it down. Sadly, this is the case with this one. For more than thirty years I've wished this was scored by Bernstein or Tiomkin or Goldsmith. They're all gone now. If there was a way to strip the music out and replace it with something by the likes of Bruce Broughton or James Newton Howard this could be one of the great westerns of the '50s!",
         "The John Sturges western \"The Law and Jake Wade\" is a solidly made, entertaining 1950's era oater that stands out as one of the earliest 'take-me-to-the-buried-treasure' plots. Indeed, Robert Taylor is rather wooden as Jake Wade, but after all, Taylor is the hero and Wade is a lawman who represents the status quo. Richard Widmark said in an interview that he thought the movie was bad but he enjoyed the character of villainous Clint Hollister. The cast is uniformly excellent,especially De Forest Kelly with his Southern drawl and Henry Silva as the crazed kid Rennie. Aside from one obvious studio bound scene around a night camp fire, this western was filmed in the rugged outdoors at Lone Pine, California, and in Death Valley. \"The Law and Jake Wade\" opens traditionally with a lone horseman riding through scenic terrain until he enters a clapboard western town and reins up in front of a marshal's office. Quietly, Jake Wade (Robert Taylor of \"Quo Vadis\") dismounts and walks into the office and thrusts the muzzle of a shotgun into the lawman's back. Clint Hollister (Richard Widmark of \"Kiss of Death\") is lounging in the calaboose when he spots Jake with a shotgun in the marshal's back. \"Well, who'd have thought,\" he marvels as his old friend forces the lawman to unlock the cell. Hollister complains about the terrible food that he has been served and slugs the lawman, knocking him out cold. As he is buckling on his gun belt, two deputies walk in unexpectedly, and he cuts loose on them with lead. Jake Wade, who has been trying to get them both out of town with the least amount of commotion, knocks the gun out of Clint's hand. They ride out with the townspeople firing shots at them. As it turns out, Jake and Clint once rode together as partners in crime. Their lawless days came to an end when Jake thought that he had gunned down an innocent child during a daylight robbery. Jake took the loot from the robbery and never looked back. Indeed, he rode away and buried the money and then created a new life for himself. Now, he serves as a lawman himself with a prospective bride-to-be, Peggy (Patricia Owens of \"Seven Women from Hell\"), awaiting marriage. Jake rides with Clint for a ways then decides to split up. Clint is happy to see Jake but he feels betrayed by Jake's stashing the loot and leaving the gang. Jake explains to Clint that he saved his old outlaw buddy from a date with the noose because Clint had rescued him from being hanged in the old days. Clint wants to shoot it out now with Jake, but Jake refuses to give him a gun. When Jake returns to town, he spots a suspicious cowboy, Rennie (Henry Silva of \"Sergeants Three\"), loitering on front street. Later, Jake dresses up in his best suit and rents a buggy to visit Peggy. They quarrel because Jake wants her to move with him away somewhere else. Peggy doesn't want to leave and storms away from a dinner table. Jake rides back to town and an inquisitive Rennie visits him at the jail. Something about Rennie spooks Jake, and he slugs the kid without warning. Before he realizes it, another old friend Ortero (Robert Middleton of \"Cattle King\") pulls a derringer on him. It seems that Jake's deputy had locked up Ortero for sleeping off a drunk in the gutter, but he forget to frisk him. The rest of Clint's gang arrive, including Wexler (De Forest Kelly of \"Star Trek\"). Wexler isn't too happy with Jake either for pulling out on them and taking the money. Jake explains that he took the money, buried it, and refused to look back. Clint wants Jake to take them to where he buried the loot. Initially, Jake says no until Clint takes Peggy hostage, and Jake has to lead them to the loot. \"Bad Day at Black Rock\" director John Sturges doesn't waste a moment in this character-driven epic. Everybody has that tough leathery look and these are no-nonsense characters. No sooner have they left for the badlands where the loot is buried than they learn that the Indians are on the warpath, adding to their woes. Jake tries to escape at one point, but Clint is just too sly for him. Eventually, when they reach the ramshackle ghost town where Jake buried the money, we learn he stashed it in the local cemetery, anticipating a similar burial of stolen gold in Sergio Leone's \"The Good, the Bad, and the Ugly.\" Three-time Oscar winning lenser Robert Surtees of \"PT-109\" and \"Thirty Seconds over Tokyo\" photographed this western in widescreen and it looks terrific! Some of the long shots will just blow your mind, but then anybody who watches Sturges' westerns will know that the director loved to shoot really long, long shots. Ferris Webster, another Sturges' favorite, edited \"The Law and Jake Wade.\" The screenplay by William Bowers of \"Support Your Local Sheriff\" provides some flavorful dialogue. Widmark excels as the villain. The last shoot-out seems to prematurely end, still \"The Law and Jake Wade\" ranks as one of those memorable, widescreen western from the 195os. Okay, \"The Law and Jake Wade\" isn't the greatest western ever made, but it is competently-down, suspenseful and a wonderful way to burn 86 minutes.",
         "The film is a little too short perhaps and the love interest subplot wasn't as well developed as it could have been. However, there is a lot to recommend The Law and Jake Wade. As a western and a film, it is fine and suitably tense, and I didn't mind the Indian attacks actually, they weren't outstanding but they weren't awful that they make you think \"oh god this is appalling\". Plus the climax, the Comache attack on a ghost town, I thought was well choreographed. The Law and Jake Wade is beautifully photographed, and the scenery is luscious. The score is lovely as well, and I was impressed with the clever screenplay and the acting. Robert Taylor I can find dull, like in Ivanhoe(that is of course my opinion) but he has enough charisma and grit to carry the picture, and Richard Widmark is all nasty and sneering as his adversary. John Sturges's direction is superb, and the story is very well-constructed. Overall, underrated and well done, not perfect but definitely worth watching. 8/10 Bethany Cox",
         "Let's face it, Robert Taylor is an awful actor. It just seems like somebody needed to fill this role quickly and grabbed a paunchy old stage hand from sweeping the floor, saying you'll do ! The guy just can't act ! How did he get by for so long in Hollywood with no talent, when there were other superb actors around like Spencer Tracy , Kirk Douglas, Richard Widmark etc... Robert Taylor must have read many scripts turned down by the proper actors of Hollywood just to get work. He is actually billed as the lead in this movie ! Even John Wayne on a bad day could act this man under the table. The definition of a Superstar is the star that carries the movie. Without Richard Widmark's presence billed as second lead, this movie would have fallen completely flat. Is this movie really directed by the same man who made \"Bad day at Black Rock\" and \"The Great Escape\" ? John Sturges must have been having an off day. Although he didn't have much to work with. The poor script and leading man to name but two. In Bad day at Black rock you have of course the master and arguably the best screen actor there has even been , Spencer Tracy. In this movie you have Robert (the statue) Taylor. Without a good leading man a movie is sunk before it begins. John Sturges should have been more like William Wyler in his approach to directing Robert Taylor. To at least coax a mediocre performance from the man, rather than this exhibition of rocking horse excellence. Nice to see Dr McCoy though, playing yet another heavy, he is a very good actor, obviously, although he never liked beaming down to planets.",
         "I got fooled into watching this because I'm a Richard Widmark fan and it was featured on Turner Classic Movies. My expectations were raised by the fact that TCM's host, Robert Osborne, even gave it a brief introduction. Apparently it was so honored because it was directed by John Sturges, who made some pretty good Westerns. \"The Law and Jake Wade\" isn't one of them. The main problem with the movie is that the basic motivations of the central character, the reformed outlaw turned sheriff, Robert Taylor, don't make any sense. It's hard to believe Taylor would go to a town just a few days ride from his own town, brazenly walk into the jail house in broad daylight (unmasked!), and break out Widmark, a ruthless killer from whom he stole $20,000 seven years earlier. The movie tries to explain that Taylor is motivated by a deep sense of honor. Widmark had broken Taylor out of jail once himself and Taylor feels obligated to \"square\" accounts with him. We're supposed to like this guy right? Isn't honor supposed to defend some higher purpose? He's freeing someone he knows to be a ruthless killer. In the great balance of honor going on in Taylor's psyche, where does the dishonor of betraying his obligation to uphold the law fit in? His actions are virtually suicidal also. If Widmark hadn't shot two of the law officers, Taylor would have been caught and exposed. Not only would this have deeply hurt and humiliated his fiancé, he surely would have been hung for trying to break Widmark out of jail or for his previous crimes. OK, Taylor is willing to sacrifice his own life to stay true to his warped sense of honor. Why put his fellow lawmen in a neighboring town at risk? Two are shot by Widmark during the escape. Where's the honor in that? Come on, this isn't close to believable. Also, how isn't he recognized by the neighboring townsfolk and law officers? The town is fairly close by to his own. When he returns, the news of Widmark's escape is the talk of his own town. Next is the matter of the $20,000 he and Widmark stole from a bank. Taylor made off with the loot when he went \"straight\" and buried it in a secret location. Why? Apparently his honor would not allow him to spend it. Then why didn't he throw it away or anonymously return it to the bank he stole it from? Give it away to charity maybe? Nope, he buries it. Even worse, for some unknown reason he tells Widmark that he buried the money and knows where he can get his hands on it. Why? How stupid is this guy? Is it his honor? Can't tell a lie? Then why has he been lying to this fiancé and the town he sheriffs for the last five years? I don't think it's asking too much of a movie for the basic plot to be credible. This movie had very few bright spots: A couple of good shots from some high ridges in the Mojave desert. Widmark desperately tries to save the movie by playing a charismatic outlaw. Nice effort, but he doesn't have much to work with and he is overwhelmed by the mediocrity of the plot and script. DeForrest Kelly, \"Bones\" from Star Trek, is cast in the role of a heavy. If you feel a burning desire to watch a reformed outlaw get kidnapped by his old gang, watch \"Man of the West\", which incredibly came out the same year. They churned out so many Westerns in the late '50's, here were two major productions released simultaneously with almost identical plots. \"Man of the West\"'s plot also has some issues, but makes more basic sense. And the acting is much better, with Gary Cooper and Lee J. Cobb in the roles of Taylor and Widmark. Interestingly, it has its own supporting actor who would go on to '60's TV fame: Jack Lord playing the exact same gang hothead that Henry Silva plays in \"Jake and Lawman\", but doing a much better job of it.",
         "When \"Bad Day at Black Rock\" was released back in 1955, director John Sturges was hailed as the master of Cinema-Scope suspense. Despite a somewhat unconvincing climax (mostly caused by Spencer Tracy's refusal to spend any more time on location, which meant that the scene had to be shot on a studio sound stage), the film was hailed by all as a gem of jeopardy. Certainly Millard Kaufman's taut script and a fine array of support players led by Lee Marvin and Ernest Borgnine helped. Some critics feel that Sturges' abilities gradually declined after this and that he never topped \"Bad Day...\", but to me \"The Law and Jake Wade\" proves these suspicions wrong. How brilliantly Sturges uses CinemaScope here to obtain his effects! The very landscapes (and there are a great many of them, thanks to extensive location shooting) seem not only hostile and threatening, but they are made to close in on our protagonists like a prison. The few interiors reinforce this motif. Prison cells and the eerie, cramped quarters of a ghost town are relieved by just one dinner-table scene, which is the only sequence in the movie which doesn't quite succeed. (An ill-judged, distorted close-up of Robert Taylor doesn't help). Perhaps most of the instant-information dialogue in the earlier scenes is a bit too obviously pat, but otherwise the William Bowers script is not only tautly exciting, but offers excellent opportunities to support players like Middleton, Silva and Kelley. In the flashier star role, Richard Widmark pulls out all stops to impress, but I found the less flamboyant, more subtly skilled acting of Robert Taylor more appealing. It's difficult to maintain sympathy as the good guy when you're on the receiving end all the time and your opponent has all the snappy dialogue, but Taylor comes through this ordeal with flying colors. And the writer does relent at the end when he hands Taylor a neat rejoinder to Widmark's aggrieved protest, \"I was going to hand you your gun!\" Taylor replies: \"But then you always liked me much more than I liked you!\"",
         "No question that the end is important to a film but also it takes only a couple of minutes. The last scenes of Jake Wade are too conventional and not in the same level . John Sturges is here at his best with a story full of surprises and with the excellent Richard Widmark . Robert Taylor is Jake Wade, a man driven by guilty feelings. Guilt can lead you to crazy acts and that is what Jake does when he saves Clint (Widmark) from being hanged. Instead of being grateful Clint and his gang kidnap Jake and his girlfriend Peggy (Patricia Owens) and will kill him after he shows them where he hid the money. If Jake would escape from that, would his conscience make him give Clint another chance? Would he make the same mistake he made before? Jake has troubled feelings because Clint had saved him from being hanged in the past. His guilt and sense of fair play will determine his actions.",
         "The film begins with a man breaking into a jail (Robert Taylor) to rescue and old friend (Richard Widmark). Oddly, however, it turns out they aren't friends any more and you know that they'll soon reunite and blood will be shed. It turns out Taylor is a sheriff and Widmark is his old partner in crime. This, sadly, is about the only twist in the film that caught me off guard. Despite having Widmark and Taylor in the leads, this is yet another tired old Western--and in so many ways practically indistinguishable from the countless number made in the 1950s. That's because the film is so predictable and takes no chances--it's only assets are the stars. Plus, since it's by-the-numbers, you know that by the end of the film, there will be the clichéd shoot-out between Taylor and Widmark. And, in between, there is the rather dull girlfriend, the \"hot-headed\" young punk and an attack by addle-brained Indians--who, naturally, ride past the cowboys single-file in order to give them a better chance to shoot them! My advice is find a better Western to watch. While this one isn't bad, it sure isn't good. Plus seeing a middle-aged and paunchy Taylor playing the action hero is a bit of a stretch. My advice is to find a Randolph Scott western--particularly from the 1950s--his best and most exciting period. Now those are some westerns well worth seeing.",
         "See the movie..Don't let yourself be swayed by one or two bad reviews for this under-rated late 50's western with Robert Taylor playing the title character..Jake Wade ..town Marshall..and Richard Widmark as his ex-gang buddy(?) from back in the day..Civil War and post war years..a few have said the score sucked..maybe because of the strike in 1958..I can neither confirm nor deny..if that's the case, it must have been short lived as other films were released the month before(5) and a month later (1) ..big budget movies were released all year with great scores..by this time Robert Taylor was no longer the young handsome face of the 30's and was a veteran actor and a lot like Gary Cooper..played darker,more serious roles late in his career. More gritty..more realistic..the same year he did Saddle The Wind with John Cassavetes..and as gritty as Gregory Peck's The Bravados the same year..1958 and Peck's The Big Country..Cooper also played a town Marshall marrying someone younger in High Noon..he was a star and under played his role here letting Richard Widmark get most of the best lines until the last three minutes of the movie..\"I would have handed you your gun\" followed by Taylor's response..\"you always liked me more than I like you\"..good line..great acting..great supporting cast..great scenery filmed on location..but this movie is a sleeper and a keeper..and worthy of some attention..it deserves a look-see..from a good movie year..one of the better performances from that year..",
         "A so-so western from director John Sturges but then even a so-so western if often a lot more entertaining than many a better director's more 'serious' pictures and this one has the added bonus of Richard Widmark at his nasty best. It also features that great character actor Henry Silva as one of Widmark's gang. The star, however, is that plank of wood, Robert Taylor while the leading lady is the nondescript Patricia Owens. It has a reasonably decent plot, some great scenery and a fair amount of action which, in the end, is as much as you might want from any horse opera so while this is no classic by any stretch of the imagination, it is never less than watchable.",
         "In order to even an old score, town Marshal/reformed criminal Robert Taylor makes the mistake of busting old partner Richard Widmark out of jail, little realizing that the wily outlaw would not only be unappreciative the gesture, but track Taylor down and force him to go hunting for some stolen loot he got rid of before going straight, taking them and Taylor's girl right into dangerous Comanche territory. Personally, I always liked Widmark better when he played a heavy. Here, he's nasty, glib, and nicely matched up with psychotic Henry Silva and blustery saddle-tramp DeForest Kelly. The colorful villains threaten to steal the movie away from the heroes this time around! There's some nicely photographed panoramas and a hard-boiled script full of tough-talking and more than enough gunshots (and arrows), well directed by the great John Sturges. This also has a neat final act and a suspenseful climax in a ghost town.",
         "Made when the era of the western was coming towards its end, this hard working horse opera entertains throughout, despite its one flaw - Robert Taylor. A good plot, some fine location shooting and well directed action scenes all contribute to this. Richard Widmark gives a truly convincing performance as the psychopathic Clint Hollister and Henry Silva is a standout as the equally nasty Rennie. The only problem is Robert Taylor's po faced and mournful effort in the lead role. Thanks to TCM I have now seen quite a few Robert Taylor vehicles but I'm yet to see one in which he's any good. Who ever thought this guy could act just mystifies me."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Western"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Outlaw Clint Hollister escapes from jail with the help of Marshal Jake Wade, because once Clint did the same for him. Jake left Clint just after, but Clint finds him back and forces Jake to lead him to a loot Jake buried one year ago when he quitted Clint's gang.",
         "Now a respected frontier Marshall, the reformed bank robber, Jake Wade, is engaged to a beautiful, nice girl, Peggy, eager to live a decent life away from crime. Nevertheless, Jake's criminal past will soon catch up with him in the person of his old companion, Clint Hollister, who still has his mind on the high-value $20,000 loot from their last heist. With this in mind and determined to have the treasure for himself, Clint forces Wade to lead a posse of outlaws where the money is buried, strong-arming the Marshall by capturing the innocent Peggy. But to get to the ghost town in the middle of the desert where the booty is, the men will have to ride through the perilous Comanche territory. Is the gold worth their lives?",
         "Jake Wade breaks Cling Hollister out of jail to pay off an old debt, though it's clear there is some pretty deep hostility between them. They part, and Jake returns to his small-town marshal's job and his fiancée only to find he has been tracked there by Hollister. It seems they were once in a gang together and Jake knows where the proceeds of a bank hold-up are hidden. Hollister and his sidekicks make off into the hills, taking along the trussed-up marshal and his kidnapped bride-to-be to force the lawman to show them where the loot is.",
         "Jake Wade is a one-time outlaw who has gone straight and is now the Marshall in a small town. His past catches up with him when his former partner, Clint Hollister, takes him prisoner in order to get his share of the loot from their last job together. To make sure Jake cooperates, they also take his fiancée Peggy along for the trip. Peggy learns all too quickly about Jake's past. When they reach the ghost town where Jake hid the money, they have to fight off a band of marauding Indians.",
         "Marshal Jake Wade aids outlaw Clint Hollister escape jail but Clint wants to know where Wade hid an old hold-up loot taken while both men were outlaws in the same gang."
      ],
      "budget": 1538000
   },
   "movielensId": 122403,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1958-06-06",
      "dvdReleaseDate": null,
      "directors": ["John Sturges"],
      "runtime": 86,
      "movieId": 122403,
      "title": "The Law and Jake Wade",
      "mpaa": "",
      "actors": [
         "Robert Taylor",
         "Richard Widmark",
         "Patricia Owens",
         "Robert Middleton",
         "Henry Silva",
         "DeForest Kelley",
         "Burt Douglas",
         "Eddie Firestone"
      ],
      "imdbMovieId": "0051848",
      "originalTitle": "The Law and Jake Wade",
      "genres": [
         "Action",
         "Western"
      ],
      "youtubeTrailerIds": ["vx8PgF7mvgQ"],
      "plotSummary": "Jake Wade breaks Cling Hollister out of jail to pay off an old debt, though it's clear there is some pretty deep hostility between them. They part, and Jake returns to his small-town marshal's job and his fiancée only to find he has been tracked there by Hollister. It seems they were once in a gang together and Jake knows where the proceeds of a bank hold-up are hidden. Hollister and his sidekicks make off into the hills, taking along the trussed-up marshal and his kidnapped bride-to-be to force the lawman to show them where the loot is.",
      "tmdbMovieId": 44766,
      "avgRating": 0,
      "releaseYear": "1958",
      "numRatings": 0,
      "posterPath": "/dKUT6UDardg67QbaFqUVIWF1gqK.jpg"
   }
}