{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0140340",
      "video": false,
      "title": "The Love Letter",
      "recommendations": [52221],
      "backdrop_path": "/7qa7SngcWw1L0zQ6I405zAJDfNg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Scott Corrigan",
               "gender": 2,
               "credit_id": "52fe494dc3a36847f81934c5",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elizabeth Whitcomb",
               "gender": 1,
               "credit_id": "52fe494dc3a36847f81934c9",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Everett Reagle",
               "gender": 2,
               "credit_id": "55e506e1c3a3681405000a01",
               "name": "David Dukes",
               "profile_path": "/3mGdu1jF7TO66rUbyI6seaH5ahP.jpg",
               "id": 29792,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Beatrice Corrigan",
               "gender": 1,
               "credit_id": "55e5070792514137a200095b",
               "name": "Estelle Parsons",
               "profile_path": "/cBw9l1de3bKjr0LpGEGplJuJmPc.jpg",
               "id": 6461,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe494dc3a36847f81934cf",
            "name": "Dan Curtis",
            "profile_path": null,
            "id": 29648,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.284984,
      "production_countries": [],
      "id": 57943,
      "vote_count": 4,
      "budget": 0,
      "overview": "20th century computer games designer Scott exchanges love letters with 19th century poet Elizabeth Whitcomb through an antique desk that can make letters travel through time.",
      "similar": [],
      "original_title": "The Love Letter",
      "runtime": 98,
      "poster_path": "/t49uHFwfWcyQoiuBzsoT0yRvbVi.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-02-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A letter from the past would change their future forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dan Curtis"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Jack Finney",
         "James S. Henerson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140340/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5NTMwNjMzNV5BMl5BanBnXkFtZTcwNTI1NjAwMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Campbell Scott, Jennifer Jason Leigh, David Dukes | See full cast and crew »"],
      "reviews": [
         "I first saw The Love Letter on Hallmark Hall Of Fame in 1998. I found it to be the most fascinating love story I had ever seen. As much as I was impressed, I gave it little thought until recently when I ran across a copy of it at the library. I took it home and lost count of the number of times I played it. Each time, I found something new and experienced a different emotion. Maybe because of this story, I've become very interested in the Civil War and spend much time doing research on the subject. I had to get the video and I have. Back to the story...Jennifer Jason Leigh and Campbell Scott are both great actors. They make you believe that they are the characters they portray. With them, you run the gamut of Scott's and Lizzie's emotions, the strongest being their love for each other. This romantic fantasy is one I would recommend to anyone who has the ability to remove themselves from this world and retreat to the fantasies of this story. They will never forget it. Watch it when there is no distractions.",
         "\"The Love Letter\" was written by Jack Finney. If you are familiar with his classic time-travel novel \"Time And Again\", you will definitely love this TV version of his short-story \"The Love Letter\". The leads are very competent. Campbell Scott, for those who don't know, is the son of the late George C. Scott...one of America's Greatest Actor's. Campbell has come into his own, and does very well. Jennifer Jason Leigh and Daphne Ashbrook are perfect as the female time-travel counterparts. Remember: this IS a fantasy. But a beautifully constructed one at that. If you've ever wanted to reach back into the past for a long-lost love, this story will surely tug at your heart strings. And the ending is \"just right\" and very touching in its own way...there may not be a dry eye in the room when it's over with. And that's okay. PS: Jack Finney also wrote one of the greatest Sci-Fi Thrillers of all-time: \"The Invasion of the Body Snatchers\". In addition, if you like \"The Love Letter\" and want more of the same, treat yourself to the above-mentioned \"Time And Again\" ! Time-Travel, Romance, Mystery, Fantasy...all wrapped-up in the full-blown novel that has become a true Cult Classic.",
         "My wife and I were very tired, after a long day of work and coming home from dancing. We decided to have a quick look at the TV movie I taped, to see if it was worth keeping. What a surprise: it kept us awake late at night, in spite of our tiredness. A lovely movie! There are a few annoying flaws. The music at the beginning was out-of-date and I don't know how the director let a few shoddy scenes slip by, but they were probably on a tight budget. These are mainly due a script that, while generally good, was too stilted in parts. However, considering this is a made4TV movie, it is exceptionally good. So get your loved one, cuddle up, and have let some warmth into your hearts with this little gem.",
         "I love romance movies. I'll spend boring weekends just popping them in the VCR. I love time travel romances and after watching SOMEWHERE IN TIME for the 10th time spent an entire weekend debating where \"the watch\" originated with my husband and friends. I happened to catch THE LOVE LETTER on cable one rainy afternoon and by the end of the movie I had gone through an entire box of Kleenex. The \"romance\" between Scotty and Lizzie was so touching. I did think that the poems Lizzie wrote were pretty sappy but we're talking about the 19th century here. Whenever you watch a time travel movie or read that type of book, you really have to learn to suspend disbelief, but the way this movie was handled it seemed so possible. That they could actually feel each others presence across time was so beautifully handled. The music was hauntingly beautiful as well. My only quibble with the whole story was if the time portal worked from the past to the present, why couldn't it work from the present to the past. I felt so sad that Lizzie had to live all those years without Scotty. All in all it's a great movie. I would, and have, recommended it to anyone who loves romance.",
         "\"The Love Letter\" is a deeply touching, wonderful film. I love the story, first and foremost. It has been well written, and it is very believable, in the way that it is presented...in a fantasy type way. The director gets the most out of his actors, and in such a way that keeps you glued to the television. Miss Leigh and Mr. Campbell are Elizabeth and Scott...across time, in the present, in the past, wherever they are! I think that the thing that I like most about this film is the Civil War time period, that Scotty's letters travel back to, and the fact that he and Elizabeth are so believable in their actions and reactions. The settings are beautiful, the costumes divine! I have seen this 8 times, and I never tire of it!",
         "I came across this title in the IMDb as I have so many others -- by accident. The concept intrigued me, so I browsed Amazon.com and was lucky enough to find a relatively inexpensive used copy. I must admit, to begin, that I was a bit biased, in that I am a time-travel fanatic at heart. So, when a movie is themed as such, I am a sucker for it from the beginning. Though the actual traveling in this movie is mostly by way of a seemingly \"magic\" desk and an unusually efficient U.S. Mail service (Wouldn't that be nice?), it nevertheless fell within my realm of my fascination. I won't recap the story, as the IMDb does a good job of that already. My only comments are of the quality of the movie. I was pleased with the movie overall. Myself being a 29 year old male, anyone who sees this movie will plainly tell you that I was not the demographic that they were aiming for. It is a love story and I found myself very drawn into it, even with it's implausible premise -- but, we must remember that this movie IS a \"fantasy\" and it should be viewed with that in mind. Those who are looking for a good sci-fi flick should look elsewhere, because science does into enter into the picture here. It is a human story about two people who are separated from each other by time. It is well acted, beautifully filmed and well worth a look if you can pick it up at your local library, video store or online somewhere. I give it 9 out of 10. My only critiques would be Scotty's coma 'dreams' which left me scratching my head a bit and the ending -- but I won't spoil it for you. Watch, enjoy and you be the judge.",
         "I saw this movie on Hallmark with my daughter and until this day, it is our most favorite romantic movie. We saw him at least 3 or 4 times.It is about a man and a woman who are living in different centuries. The scene I like best is when they both go up the stairs and they feel on another, strange but so romantic. And when she goes to him when he is at war and she found him very much hurt, I needed a tissue. I can't wait to buy him on DVD. But in Belgium he is not yet available. Can someone tell me when he would be released in Belgium? I be the first the buy this movie. I like to read about the American History and The Civil War is one of my favorite theme's. Both actors: Campbell Scott and Jennifer Jason Leigh are very good in the movie. They really touched my heart. I hope I can see this movie again soon. I really hope they release him soon in my country.Many greetings Ria Mertens",
         "It really says something when a TV station like the Hallmark station can fund a better, more emotional and memorable film than 99% of the tripe that passes for entertainment today in the movie theaters. This little movie has real heart and class. Please seek it out and watch it. I loved the picture. Filmed on location in Virginia (not Massachusetts where it is supposed to take place), and even showcasing a wonderful re-enactment of the battle of Gettysburg, and a charming, believable cast, it just captivates you immediately and you are drawn into its time travel plot device without any problem. It's probably most similar to \"Somewhere In Time\" that way, which was also lovely to look at, and boasted those period locations and authentic dress. Campbell Scott was superb as Scotty, who buys an antique desk complete with old love letters addressed to a \"mystery man\" from the 1860's. Jennifer Jason Leigh was lovely as Elizabeth Whitcomb, and you feel for her character all the way. When she stops on the stairs and reaches out for Scotty (more than 100 years away from her in distance in the future), I cried. It was so bittersweet. Estelle Parsons was great as Scotty's mom, always nice to see her. She's such a natural actress. Daphne Ashbrook was also excellent as Scotty's fiancé, who unfortunately gets hurt as the growing relationship between Scotty and Elizabeth develops. She shows a real vulnerability here and doesn't behave revengefully. Wonderful. If I would change anything I would have had the film end with the grave scene, and not with the girl and her dog, to do otherwise is to suggest that Scotty won't be as faithful to Elizabeth as she was to him. 10 out of 10. Addition: And to the commentator janeellen, above, who was critical of my review, I would add that even if the story was trying to suggest reincarnation, it doesn't work, and it makes the story less poignant to insist on it. Just as with cloning, no one is EXACTLY the same person or being, or has EXACTLY the same SOUL. So for Scotty to go off at the end with the modern girl and her dog, a girl without the same 19th century sensibilities or soul as Elizabeth Whitcomb, is a disappointment. Scotty should stay just as true to the memory of ELIZABETH through the years, as she remained true to him until her death. That would have been the PERFECT ending.",
         "I gave this movie the highest rating for at the end there is two questions that the viewer is left to answer.....Why did these events happen and why to these two people..? The answers are there but you are left to find them. An antique desk is purchased. Inside, in a secret compartment, is a letter written 100 years earlier. The letter is to a phantom man. The secret love created in the mind of a lonely girl. A young mans finds the letter and feels the pain the girl who wrote must have felt when waiting for a love that wasn't there. A strange occult mother convinces her son to answer the letter and comes up with a scheme to do it. Thus begins a love affair where the participants are separated by 100 years in time.",
         "This is is a real tear-jerker, the type of show I thought I was immune to. Turns out I was more weepy than my wife throughout the whole movie. What a great story and the actors were superb. I found myself to be in love with Elizabeth Whitcomb and despising David Duke's (RIP)character. I truly felt sorry for Scott's fiance, however, and could empathize completely with her conclusion that Scott was perhaps a little bit nuts. I rated this show a 9 (out of 10), downgrading only because the railroad train used was common around 1915, not 1863. Why couldn't they have used a 4-4-0 American locomotive and light weight wooden coaches typical of the Civil War era? Other than that minor glitch, the movie was exceptionally well done and will occupy a prominent place in my movie collection."
      ],
      "genres": [
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Hallmark Entertainment",
         "Hallmark Hall of Fame Productions"
      ],
      "summaries": [
         "Scotty Corrigan buys an antique desk and finds a Civil War-era letter inside it, written by a woman who died over a hundred years ago. Fancifully, he writes and mails a reply...only to have it reach its destination in the past. As Elizabeth and Scotty continue their remarkable correspondence, they find themselves falling in love, and more than restless about their impending, respective, marriages.",
         "20th century computer games designer Scott exchanges love letters with 19th century poet Elizabeth Whitcomb through an antique desk that can make letters travel through time."
      ],
      "budget": 0
   },
   "movielensId": 122423,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-02-01",
      "dvdReleaseDate": null,
      "directors": ["Dan Curtis"],
      "runtime": 98,
      "movieId": 122423,
      "title": "The Love Letter",
      "mpaa": "",
      "actors": [
         "Campbell Scott",
         "Jennifer Jason Leigh",
         "David Dukes",
         "Estelle Parsons"
      ],
      "imdbMovieId": "0140340",
      "originalTitle": "The Love Letter",
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "20th century computer games designer Scott exchanges love letters with 19th century poet Elizabeth Whitcomb through an antique desk that can make letters travel through time.",
      "tmdbMovieId": 57943,
      "avgRating": 2.96154,
      "releaseYear": "1998",
      "numRatings": 13,
      "posterPath": "/t49uHFwfWcyQoiuBzsoT0yRvbVi.jpg"
   }
}