{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "hotel room",
            "id": 922
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "shower",
            "id": 1879
         },
         {
            "name": "restaurant",
            "id": 1946
         },
         {
            "name": "rain",
            "id": 2217
         },
         {
            "name": "underwear",
            "id": 3508
         },
         {
            "name": "overweight man",
            "id": 4539
         },
         {
            "name": "kiss",
            "id": 5091
         },
         {
            "name": "christmas tree",
            "id": 5570
         },
         {
            "name": "studies",
            "id": 5948
         },
         {
            "name": "tenderness",
            "id": 6056
         },
         {
            "name": "foot",
            "id": 7600
         },
         {
            "name": "deception",
            "id": 9758
         },
         {
            "name": "dress",
            "id": 9991
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "promiscuity",
            "id": 10505
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "old man",
            "id": 10938
         },
         {
            "name": "cigarette smoking",
            "id": 11732
         },
         {
            "name": "crying",
            "id": 12544
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "university",
            "id": 13160
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "kissing",
            "id": 15055
         },
         {
            "name": "rock band",
            "id": 18001
         },
         {
            "name": "unpaid bill",
            "id": 33665
         },
         {
            "name": "car",
            "id": 33885
         },
         {
            "name": "waiter",
            "id": 40950
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "gag",
            "id": 159812
         },
         {
            "name": "misogynist",
            "id": 165288
         },
         {
            "name": "financial problem",
            "id": 169358
         },
         {
            "name": "flirting",
            "id": 171183
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "maid uniform",
            "id": 187791
         },
         {
            "name": "money problems",
            "id": 188259
         },
         {
            "name": "college student",
            "id": 207844
         },
         {
            "name": "google",
            "id": 211318
         },
         {
            "name": "video chat",
            "id": 211357
         }
      ],
      "imdb_id": "tt1570970",
      "video": false,
      "title": "Student Services",
      "recommendations": [
         207941,
         212927,
         324213,
         68174,
         52371,
         302104,
         91122,
         266425,
         196967,
         70264,
         4839,
         69666,
         69646,
         84314,
         46989,
         88224,
         14634,
         47841,
         150146,
         30767
      ],
      "backdrop_path": "/5EU3ZEGUSfDzFQpHvjW4vBfGHSy.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "MoHA",
         "id": "551211669251410445000403",
         "content": "I generally enjoyed this film - based on the 'true/shocking' revelations of a (French) female university student who turned to the world's oldest profession to help finance her way thru school. It is, perhaps, the 'expose' angle of the movie that slants the general tenor of the piece towards a negative vibe - as the viewer is introduced to the story's lead character, Laura, and follows her down a path of personal denigration as she barters her youthful body for some spending cash & millennial trinkets.\r\n\r\nThe 'shock value' of the source book from which the screenplay was derived is based on the (purported) 'epidemic' levels of prostitution engaged in by female college students to make ends meet - so it is not surprising that the director has seemingly gone out of their way to make sure that the sexual 'pay for play' activities of the film's star are not made to look 'enjoyable'. In this, at least, they have managed to succeed!\r\n\r\nThe lead actress, Deborah Francois, IS lovely - in just the right way to provide a vulnerable heroine for the sordid tale... and she sure doesn't appear to like what she's doing in the sexual realm - so much so - that after a while I found the plot to become rather disingenuous and dis-engaging. Despite many scenes where Ms Francois fully reveals her attractive body and participates in sexual congress with a variety of sorta 'flawed' male individuals - there is nothing arousing about any of it. Could the girl be any more 'bored' & repulsed?! It really makes one wonder why her one repeat customer 'Joe' keeps coming back for more... or why she sticks it out for as long as she does.\r\n\r\nWithout treading into the politically/morally dicey territory surrounding the whole issue of prostitution - I felt that this film presents a sort of mono-dimensional and moralistic take on the situation. Some reviewers compare 'Student Services' to the likes of \"Pretty Woman\" and extol its' virtues for presenting a more 'realistic' portrayal of the disagreeable aspects of prostitution - personally I might suggest that a more relevant comparison could be to the cable TV series \"Diary of A Call Girl\" based on the 'true' adventures of London escort (AND student!) Belle de Jour. 'Belle' also exhibits a 'conflicted' character in trying to reconcile the two sides of her life in the face of society's general disdain for sex workers - but she, at least, takes 'some' pleasure in her craft, and on occasion even finds her sexual skills to be of 'service' in helping individuals overcome personal problems. Admittedly, the 'clients' that Laura encounters in \"Student Services\" are portrayed as a particularly loutish lot - but 'where's the love'?! Ultimately I began to sympathize w/ her self loathing and sorta lost interest in the 'story' - such as it was. There are obviously 'bigger issues' of youth poverty and socioeconomic inequality at play - but none of them get meaningfully addressed/answered in this film. On a strictly prurient level - worth a look for the fetching form of Ms Francois in the buff - but nothing to get too excited about.",
         "url": "https://www.themoviedb.org/review/551211669251410445000403"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Laura",
               "gender": 1,
               "credit_id": "52fe470dc3a368484e0b254d",
               "name": "Déborah François",
               "profile_path": "/hErAL9U3i4PvBJ2fvEGibCjQ6Az.jpg",
               "id": 54228,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Benjamin",
               "gender": 2,
               "credit_id": "52fe470dc3a368484e0b2551",
               "name": "Mathieu Demy",
               "profile_path": "/f1e9ZAhnnsHnwhIFyJsp2xa80jv.jpg",
               "id": 64751,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Joe",
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2555",
               "name": "Alain Cauchi",
               "profile_path": "/jZ59ADmqMbASo4eFWubxSXS7Dy2.jpg",
               "id": 543835,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Manu",
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2559",
               "name": "Benjamin Siksou",
               "profile_path": "/2JdS2950LHzkdAFjcLXKUEYnHwo.jpg",
               "id": 543836,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Fanny",
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b255d",
               "name": "Anna Sigalevitch",
               "profile_path": null,
               "id": 19122,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe470dc3a368484e0b2549",
               "name": "Emmanuelle Bercot",
               "profile_path": "/6qlcTXvdSlTHPjZuWjCYZLzOb4e.jpg",
               "id": 25340,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe470dc3a368484e0b2563",
               "name": "Antoinette Boulat",
               "profile_path": null,
               "id": 4406,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2569",
               "name": "Laurent Brett",
               "profile_path": null,
               "id": 543837,
               "department": "Crew",
               "job": "Digital Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b256f",
               "name": "Julien Leloup",
               "profile_path": null,
               "id": 543838,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2575",
               "name": "François Kraus",
               "profile_path": null,
               "id": 543839,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b257b",
               "name": "Denis Pineau-Valencienne",
               "profile_path": null,
               "id": 543840,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2581",
               "name": "Coralie Cournil",
               "profile_path": null,
               "id": 543841,
               "department": "Crew",
               "job": "Post Production Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2587",
               "name": "Hervé Duhamel",
               "profile_path": null,
               "id": 543843,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b258d",
               "name": "Angeline Massoni",
               "profile_path": null,
               "id": 543844,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe470dc3a368484e0b2593",
               "name": "Frédéric Fortuny",
               "profile_path": null,
               "id": 543846,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "553e240792514138a900a4cd",
               "name": "Éric Barboza",
               "profile_path": null,
               "id": 1152093,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "553e225dc3a3683e14007b2c",
               "name": "Christophe Offenstein",
               "profile_path": "/3huaP2OpPmEyGWECV5NB1ZaMmiR.jpg",
               "id": 66842,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "553e24199251415852002b9e",
               "name": "Marité Coutard",
               "profile_path": null,
               "id": 579047,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "553e2476925141687400752c",
               "name": "Emmanuelle Bercot",
               "profile_path": "/6qlcTXvdSlTHPjZuWjCYZLzOb4e.jpg",
               "id": 25340,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.982689,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 65496,
      "vote_count": 52,
      "budget": 0,
      "overview": "Laura is a 19-year-old university freshman who desperately wants to do well in school. She works a part-time job but cannot make ends meet. One evening in which she is short of funds, she answers a personal ad online by \"Joe,\" 57, who seeks a female student for \"tender moments.\" The pay is 100 euros per hour. Laura pledges to do this just once, and three days later, she goes to a hotel room with Joe. And then her spiral begins.",
      "similar": [
         51828,
         97630,
         133805,
         71859,
         398181,
         23160,
         1359,
         2502,
         2503,
         11005,
         13,
         38,
         59,
         12162,
         8923,
         769,
         773,
         4771,
         600,
         281
      ],
      "original_title": "Mes chères études",
      "runtime": 101,
      "poster_path": "/ozKPo7l668X8yatgg4wIummpmQG.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Les Films du Kiosque",
         "id": 2951,
         "origin_country": ""
      }],
      "release_date": "2010-01-18",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Emmanuelle Bercot"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Emmanuelle Bercot"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt1570970/",
      "coverLink": null,
      "actors": [
         "Déborah François",
         "Alain Cauchi",
         "Mathieu Demy"
      ],
      "reviews": [
         "This French movie is based on a supposedly autobiographical story about a young and incredibly naive university student (Deborah Francois) who has to resort to prostitution to pay for her studies. This movie certainly doesn't glamorize prostitution from the female perspective as the girl's johns are presented as decidedly unattractive, pathetic, and borderline dangerous. It kind of DOES, however, tend to glamorize prostitution from the male perspective as Deborah Francois (\"The Page Turner\", \"Female Agents\") is very attractive and spends half the movie in various stages of undress. Moreover, she is (often pretty unbelievably) sweet and naive and probably nowhere near as cynical and hard-bitten as the kind of person who would be working as a prostitute in real-life. I'm sure most of the potential male audience of this movie can't honestly say they are watching this purely out of social concern that gorgeous but financially strapped French co-eds might be turning to prostitution (at least I know I can't). There's always a danger in a film that, on one hand, is this sexually explicit, but is also, on the other hand, trying to generally condemn the sex trade. They've actually made a few films like this in America recently. \"About Cherry\" (with another unbelievably gorgeous model/actress, Ashley Hinshaw) runs into the same problems as this one. But both are vastly preferable to \"On the Doll\" where the decidedly PG-13 content manages to add to an already ridiculous and laughably unbelievable \"expose\" content. Only the obscure recent American indie film \"Smile Pretty\" successfully manages to be bold enough to tackle this kind of touchy subject without being so explicit as to slip into exploitation itself. I certainly DON'T want to take anything away from Francoise, however, who is quite good in this (and it's certainly not HER fault she's far more naturally beautiful than any real prostitute probably would be). I don't know is she speaks English well, but if so she certain has the talent to compete with most young Hollywood actresses (who would never be brave enough to tackle a sordid role like this). She could be the next Marion Cotillard (who tackled a number of French films like this before becoming a rising star in Hollywood), or at least the next Ludivine Sagnier (a big star in France who has occasionally been successful outside it). She is definitely one to watch.",
         "Okay, you can compare Student Services (what a horrible, porno name in the first place) to Lolita or The Lover, but what makes this different than Looking For Mr. Goodbar I suspect is the fact that the woman who becomes the prostitute does not die or otherwise meet her downfall, but instead, regardless of the horrible things she is forced to go through, she achieves, passes her college exams and moves on in life. That is the most horrible aspect of this film, what I suspect is behind the negative reviews of it, that are not judging the quality of writing, acting or direction--all of which are superb--but instead that judge the morality of the story, which instead of handing us some Christian values, hands us a glimpse of a possible truth. She didn't fall for that final offer and good for her. Good movie. Check it out.",
         "\"Student Service\" or \"Mes Cheres Etudes\" is the 2010 film that sheds light on a modern epidemic afflicting thousands and thousands of French college students. Skyrocketing costs of higher education and living expenses have forced many bright young students into selling their bodies to make ends meet. This is the true story of one such girl who wrote a book under the name Laura D. Directed by Emmanuelle Bercot and starring the mesmerizing and talented Deborah Francois who plays the girl named Laura. Even while living with a roommate/boyfriend and working as a telemarketer Laura is unable to maintain the very basic needs of life. She starts to peruse a French version of Craig's List and finds quite a few guys looking to pay for \"companionship\". The first guy she meets is Joe an older man who pays her 100 Euros an hour. Laura is obviously shy and nervous and can't believe she has fallen to this level. These scenes are not made out to be sexy as we take Laura's point of view and are as nervous and insecure as she is. Joe seems to be your average guy, but you know he is just as disgusting and revolting as you think he is. She starts to build up a sort of client base of photographers, fetishists and perverts while the psychological strain starts to take its toll. She leaves her boyfriend and quickly finds a replacement in Benjamin, who is not one of her clients. Laura is betrayed by Joe who goes to far at one of their hotel encounters. While Benjamin is aware of what Laura does its only a matter of time before the jealousy becomes too great. It becomes a sort of bizarre love triangle between the three. Joe's continues to offer her more money for more dangerous work and after another brutal betrayal Laura hits bottom. The ending seems to be a little tacked on, because it happens so fast. She moves to Paris and finds this great job as a waitress and has an almost instant loving family of co workers. She passes all of her exams at school and starts to live her life like nothing happened. A swift happy ending but is it really? The filmmakers make the sex scenes as unsexy and unsettling as possible, not using any music and drenching it in nervous energy. Deborah Francois really inhabits Laura and holds nothing back as a girl willing to do anything to get what she wants. She also co- stared in the Cannes Film Festival Palm d'Or winning film \"L'enfant (The Child)\" in 2005. \"Student Services\" is available to watch on Netflix watch instantly. For more reviews visit www.RockportFilm.com",
         "Mes chères etudes – Student Services – CATCH IT (B-) Based upon Mes chères études (My expensive studies in English) is a 2008, an autobiographical book by an anonymous author known as \"Laura D.\", who is a modern language student at a Paris university. The book has drawn national attention in France with its controversial contents, in which the author claimed that she had to go into prostitution to financially support her studies. (Wiki) French movies are sexually expletive and they don't hesitate in holding back. This goes for this one as well. It's at times very disturbing a young girl doing things with old man, getting raped, message or just lying naked. Anyways Déborah François did a great job because it didn't occur to me for a second that she is just an actress. The thing about the movie I didn't like that it's slow and spend too much time in the bedroom at times.",
         "Laura is a student living with her boyfriend in an apartment. They barely make ends meet. One night she tries to get intimate with him but he refuses so she checks out online classifieds for men seeking women and ends up replying to a guy who wants only non-sexual physical contact. She meets him, he's an older gentler guy who wants to talk and caress her but she doesn't really let him. Still, he thinks she's amazing. He becomes a regular for her. Her second client is much more sexually aggressive yet she acts as if she's not there to have sex. By now she starts making money and can afford the luxuries she sees other college girls having. But she doesn't go crazy shopping or anything of the sort. Aside from finer clothes it doesn't look like she's living a better life. Her boyfriend is clueless about it all but when she comes clean he's supportive and offers his help. This girl is a terrible prostitute making it very clear to her clients that she's not interested in anything and she doesn't even act or pretend to enjoy her encounters. Not only that but she also has her customers pay her after the fact. And eventually it backfires when a guy pays only a fraction of the agreed fee. That drives her mad and puts a strain on her relationship. When she needs a laptop she again meets with her first regular. He wants to do more kinky stuff, but she refuses, runs away in disgust, still she takes the laptop, and he pays her on top off that. Now she's starting to have second thoughts about this career. But she agrees to meet the guy one last time. He takes her to some sex club. He knows all the guys there. He takes her to the dungeon there where two much older guys wait. Next we see her leaving in disgust. Presumably he made her have sex with the two? We don't know. This time he only pays her a part of her fees. When she decides to move to Paris the old guy calls her again with sob stories that he's got cancer and that he wants to see her one last time, and pay her thousands. In Paris, she gets a job as a waitress but she finds it all so difficult. Still she thrives. She returns to her hometown to take her exams. She studied languages and passes the exams. The movie begins and ends with Laura in a wig, doing some TV interview. The movie aims to alert the society how precarious the situation is for French college students and how many girls have to resort to prostitution. However, Student Services makes a very poor case for whatever point it's trying to make. I saw this movie years after seeing Young & Beautiful, another lackluster French movie about the exact same topic but that one was a bit more compelling. Student Service has little going for it in terms of characters, story, or titillation. Déborah François is cute in a normal girl sort of way but that's about it.",
         "It's one of most important movies I've ever seen. I thought it would be about horny girl, who wants to get some extra money. Trailer, honestly, doesn't put a good picture what this movie is about. On the other hand, maybe it's because it wants to attract average audience to the truth about prostitution and not just people, who feel concerned about different social issues. I think the film is done really well in meaning it pictures all nuances of prostitution very precisely and realistically without getting too heavy psychologically. It's not a thriller or erotica, it's just a story of life of one girl, who took a decision to try out prostitute services. What's important, she's smart, and sees things not through the lenses of a young naive girl, but someone with in-depth outlook on this job. I definitely recommend it for everyone, who wishes to know, what prostitutes actually go through.",
         "The movie is a bit strange and portrays the girl as very naive It starts out with a student fainting in class, turns out she haven't been eating in a while cause of poor economy, from there on the main story starts. After seeking advice from what I believe is the school Counsellor whom basically tell her to sue her parents or get more jobs. Than she somehow get the idea of trying prostitution. (At this point I sort of miss and explanation as to why she choose it so fast) It supposed to be a one time thing, but soon she spends all the money and she need to do it all over again. You get to see how she spends her hard earned money, while she's spending them. Dinner out with her friends paying for their drinks etc All the while you get to see these small cash signs in the air with a price tag of what the item cost her, It was and interesting way to illustrate how money just fly away sometimes. When you've been broke for a log time, you often fantasies about what you gonna spend all the money on when you get on the up and up. But once you get there you soon realize easy come easy go. So soon she needs money again and one client leads to another and another and so on and so forth. One thing that struck me as odd though, was that with every client she usually just lay there like a corpse while they do their thing. I may not know much about prostitution and the life of the average hooker, but I assume when you pay for sex you want some spark in it, however fake that spark must be. I'm pretty sure nobody pays a hundred Euros for a girl to lay there playing dead while you hammering away at her. Not unless you got some weird fantasy about them being dead, I'm pretty sure they would expect her to fake it at least Also the average client was usually men in their 50; it would have been nice with some diversities Another odd thing with the main character is that she seems to get more stupid/naive for each client she takes on. Which is usually quite the opposite of what normally happens in that line of work There are also bits and pieces that doesn't really go anywhere, which is a bit confusing But all in all not a bad movie,",
         "Under the title \"Student Services\", I watched this film, not realizing it was a made-for-TV-movie based upon a true story. The actress who portrays the main character, Laura, acquits herself fine. She plays a college student who has trouble paying her bills, so she turns to adult on-line ads to find meet men who will pay her for sexual favors. The film is not erotic. Laura, for the most part, detests what she does. The film may have been designed to put forth a political point of view--that too many students have financial problems, so they turn to illegal activities. Someone who lives in France might understand a political solution to this French problem, but others probably will not. It is certainly no documentary. And it does not try to be. As a drama, it offers little that is new to the genre, and Laura's path is marked by detours and confusing behavior, defusing the drama.",
         "After picking up the terrible British Sex Comedy Not Tonight Darling I started looking round on Ebay for films that a friend would be keen in picking up.Catching my first glimpse of her recently in the exquisite Populaire,I was pleased to spot an \"Erotic Drama\" starring Déborah François,which led to me getting ready to find out what the \"student services\" are. The plot: Studying in university,Laura finds herself struggling to pay the student fees and cover all of her other bills.Looking for tips on how to pay the fees,Laura ends up stumbling on a prostitution website.Seeing the cash that men are willing to pay in order to meet women,Laura decides to dive in,and agrees to a meeting with Joe.Meeting Joe,Laura soon finds herself struggling with being happy with the cash,but deeply troubled by what she has to do in order to raise the fees. View on the film: Made as a TV movie,writer/director Emmanuelle Bercot and cinematographer Christophe Offenstein present the sex in a surprisingly bare manner,with Laura being shown fully naked,and her clients being left topless (although Bercot shy's away from going below the belt with the guys,despite being fine going there with the women!) Stylishly bringing Laura into the \"adult business\" world with quirky pop-up E-Mails and comedic \" running meters\" Bercot freezes the viewer in witnessing the pain that Laura suffers,as tough close-ups lock in on the anguish cast across Laura's face. Adapting an infamous bio by \"Laura D\",the screenplay by Bercot attempts to thread a tough Drama with flirty Sexploitation nods.Whilst Bercot strips off the fragile state Laura is in as her relationships start to crumble,Bercot sadly fails to make the comedic edges sparkle,due to Bercot keeping a distance from Laura's lighter side,and also giving Laura no one good to react to,as all the men are shallowly drawn as total,2D scum. Displaying bravely in the deeply uncomfortable sex scenes, Déborah François gives a superb performance as Laura,thanks to François delicately balancing Laura's weaknesses with burning desire to complete her student services.",
         "Deborah Francois I must say, is one of the sexiest girls to get her gear off. Her sexy and magical presence is worth the view alone. SS is an enjoyable film, for that fact, but we've been around this course, many a stories before (Slovenian Girl, 2010's Girls, or loosely the Aussie offbeat Sleeping Beauty- 2011). This is a tasty film which really works with, or relies on the scenes with uni hottie Laura, (Francois) making ends meat, by becoming a private escort and companion, through the internet, with a middle aged, enigmatic and menacing regular, Joe. The more demanding or weird he gets, the more dangerous aura we feel around the guy, where we fatally see a path for Laura that won't end well here. He pays her good, but they come with a price. He has some sick tastes, none more than an orgy scene with some dirty repulsive types, near the end, he sets up. At first Laura, thinks the service will just be a one off, but like a candy to a baby, she's get sucked into this business, which has us pondering, does she keep doing it, cause she enjoys it, or is purely for the money. The answer is both, she just doesn't want to admit she enjoys it. In short bits, we see her service other men, one a corpulent, background middle aged guy, where they share a slow moving dance, that scene kind of becomes humorous. One scene earlier in, has a client who picked her up at a bar, get dangerous. But really the film focuses on Laura and Joe's interludes. I mean does she like this guy, or seek a kind of friendship from him. The film doesn't really cut deeper than that, where honestly, I preferred a darker ending instead of the unsatisfying one I got here which really slumped. Seeing Francois in the raw, is one hell of a privilege, and she stokes up the screen. Here's another of these foreign flicks, with frank nudity, some of them dangerous, push bounds scenes, and if you're in the mood for a tasty dirty foreign flick, SS like 2004's Greek title, Hardcore will satisfy sexual hungry appetites."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Les Films du Kiosque"],
      "summaries": ["Laura is a 19-year-old university freshman who desperately wants to do well in school. She works a part-time job but cannot make ends meet. One evening in which she is short of funds, she answers a personal ad online by \"Joe,\" 57, who seeks a female student for \"tender moments.\" The pay is 100 euros per hour. Laura pledges to do this just once, and three days later, she goes to a hotel room with Joe. And then her spiral begins."],
      "budget": 0
   },
   "movielensId": 122464,
   "movielens": {
      "languages": [
         "Français",
         "Italiano"
      ],
      "releaseDate": "2010-01-18",
      "dvdReleaseDate": null,
      "directors": ["Emmanuelle Bercot"],
      "runtime": 101,
      "movieId": 122464,
      "title": "Student Services",
      "mpaa": "",
      "actors": [
         "Déborah François",
         "Mathieu Demy",
         "Alain Cauchi",
         "Benjamin Siksou",
         "Anna Sigalevitch"
      ],
      "imdbMovieId": "1570970",
      "originalTitle": "Mes chères études",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["UDkx9MtvtX4"],
      "plotSummary": "Laura is a 19-year-old university freshman who desperately wants to do well in school. She works a part-time job but cannot make ends meet. One evening in which she is short of funds, she answers a personal ad online by \"Joe,\" 57, who seeks a female student for \"tender moments.\" The pay is 100 euros per hour. Laura pledges to do this just once, and three days later, she goes to a hotel room with Joe. And then her spiral begins.",
      "tmdbMovieId": 65496,
      "avgRating": 2.9,
      "releaseYear": "2010",
      "numRatings": 10,
      "posterPath": "/ozKPo7l668X8yatgg4wIummpmQG.jpg"
   }
}