{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120135",
      "video": false,
      "title": "Since You've Been Gone",
      "recommendations": [
         96314,
         29691,
         36290,
         24649
      ],
      "backdrop_path": "/16qvTu57EPe7Mfqg88eBBIopRe5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Grace Williams",
               "gender": 1,
               "credit_id": "52fe4648c3a368484e088267",
               "name": "Lara Flynn Boyle",
               "profile_path": "/wAVWGJefzTgXWgop58H1ttHS5H6.jpg",
               "id": 6684,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maria Goldstein",
               "gender": 1,
               "credit_id": "52fe4648c3a368484e08826b",
               "name": "Teri Hatcher",
               "profile_path": "/xnvUJvf0vjHliYa2PlXyLGaJe9l.jpg",
               "id": 10742,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Robert S. Levitt",
               "gender": 2,
               "credit_id": "52fe4648c3a368484e08826f",
               "name": "David Schwimmer",
               "profile_path": "/aOW62VZJMGXjiPvwP43xCHS9X4r.jpg",
               "id": 14409,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Zane Levy",
               "gender": 2,
               "credit_id": "52fe4648c3a368484e088273",
               "name": "Joey Slotnick",
               "profile_path": "/wB9PUDkSVlv0McLq8VyNp5qmOHM.jpg",
               "id": 9998,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jordan Cardozo",
               "gender": 2,
               "credit_id": "55e80360c3a3682c5d001b9d",
               "name": "Harry Lennix",
               "profile_path": "/uwpRytLjzz1IvjNanYNlplPVal9.jpg",
               "id": 9464,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sally Zalinsky",
               "gender": 1,
               "credit_id": "55e8037b9251413e32001909",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Todd Zalinsky",
               "gender": 2,
               "credit_id": "55e80388c3a3682c760017bd",
               "name": "Jon Stewart",
               "profile_path": "/88UHrwCXTPOrrsG2A33G4fMvN62.jpg",
               "id": 12219,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Roger Dorn",
               "gender": 0,
               "credit_id": "55e803949251413e3e001a9f",
               "name": "Temple Williams",
               "profile_path": null,
               "id": 1504489,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Debbie Johnson",
               "gender": 1,
               "credit_id": "55e803a4c3a3682c6400170a",
               "name": "Christine Dunford",
               "profile_path": "/vhMhDSK5D6csFtK1uI8ktnkuSyR.jpg",
               "id": 150061,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Fred Linderhoff",
               "gender": 2,
               "credit_id": "5ab69a1f925141395e00e17d",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4648c3a368484e088263",
               "name": "David Schwimmer",
               "profile_path": "/aOW62VZJMGXjiPvwP43xCHS9X4r.jpg",
               "id": 14409,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55e803169251413e2f00194d",
               "name": "Jeff Steinberg",
               "profile_path": null,
               "id": 1504488,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "TV Movie",
            "id": 10770
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.825156,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61168,
      "vote_count": 11,
      "budget": 0,
      "overview": "The story of a 10th anniversary High School reunion, told through the eyes of a doctor who was humiliated on graduation day by being badly beaten up by a fellow graduate.",
      "similar": [],
      "original_title": "Since You've Been Gone",
      "runtime": 96,
      "poster_path": "/3lCCoDRcQwl2CflxVSkiAwONq0G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Miramax",
            "id": 53009,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "FilmColony",
            "id": 1811,
            "origin_country": ""
         }
      ],
      "release_date": "1998-06-06",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Schwimmer"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Jeff Steinberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120135/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjA3NzU4NzU2OV5BMl5BanBnXkFtZTcwODQwMTEyMQ@@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Philip Rayburn Smith",
         "Joey Slotnick",
         "Joy Gregory"
      ],
      "reviews": [
         "I came across this one while channel-surfing and since it was just starting I left it on. I didn't expect much from it but have to admit I did find it engaging, maybe because I am a graduate of the class of '87 and I never attended my 10th reunion I am more susceptible to this films charms. While the movie covers all the bases by representing all personality types it was nice to see some of the characters weren't truly stereotypical. I also did find myself laughing out-loud at many of the mean-spiritedness of Lara Flynn Boyle's character....her performance alone was worth the watch. Be on the lookout for cameos by Molly Ringwald as \"Claire\" (coincidence?) and Jennifer Grey (post nose-job) and a funny stint by Liev Schreiber. Overall a pleaser in my humble opinion.",
         "This movie is so funny that it inspired me to attend my high-school reunion. The movie's high school reunion takes place in Chicago with the requisite high school stereotypes in attendance. Although the characters are typical, their dialogue is not. I ended up balling in laughter at the originality of the well-delivered lines. Check out Lara Flynn Boyle who plays the class psychotic. In one scene, an overbearing, married couple can't stop boring the dinner table with stories about the joys(!) of parenting. The Boyle character slinks away to the hotel lobby, calls their house, and threatens to kill their babysitter. When she returns to the dinner table, the married couple is receiving a cell-phone call from the terrified babysitter. Unfortunately for all, they have to run home to save their babies in the suburbs. P.S. Don't let the director, David Schwimmer of \"Friends,\" scare you away from this gem. This is one film he got right.",
         "Since You've Been Gone is a relatively decent film with a cast of relative unknowns with the exception of a few. Kevin is a doctor who attends his ten year high school reunion with his wife and best friend and to face the trauma of an incident that happened at his graduation. An unemployed, balding man and his psycho friend visit where they come in contact with a plane crash survivor/speaker who has a thing for the balding man. A woman in search of a man only to find herself in a funnily painful injury. David Schwimmer plays the class president, a conceited, quick witted jackass whom the psycho friend has a vendetta against. Lara Flynn Boyle is funny as a total psycho who falls for the psycho friend. Jon Stewart, Marisa Tomei, and Jerry Springer make cameos in the film. David Schwimmer is good as the guy who always finds himself prone to insulting signs on his back. Kevin comes to realize why the incident happened in the first place because of how he is towards people. Since You've Been Gone is definitely a lot stranger and a lot more offbeat than you might think.",
         "Personally, I really liked this movie. A lot of people didn't though. But, you do need to have the right sense of humor in order to like some of the jokes in the movie. Some of the humor is very dry, but then there are some jokes that had me laughing out loud. It is an off-beat comedy and some people need to realize that. The whole thing is just about a high school reunion all of the many mishaps. Kind of like CAN'T HARDLY WAIT only it's at a high school reunion. Just one big party movie. The jokes were well crafted and Hollywood favorite David Schwimmer does a half way decent directing job. There were small sections of the movie that I didn't care too much for, but other than a flopping one or two scenes, I really found this film enjoyable. There is a gigantic all-star cast, and the only reason why Philip Rayburn Smith (who is the main character) probably didn't recieve star billing is because he still isn't very well known. But, still the cast is all-star and the film is highly entertaining. SINCE YOU'VE BEEN GONE: 5/5.",
         "I loved this movie! It was so awesome! It had some moments that were kind of slow, but it was overall a wonderful movie..Especially Lara Flynn Boyle. She was hilarious while torturing people for no reason, and it just kept escalating, from gum in the hair to giving away someone else's baby. She was great. I think this is a very cool movie that you shouldn't miss!",
         "Class reunion films always have the potential to be good entertainment, unfortunately most don't deliver. 'Since You've Been Gone' thankfully does.. .And doesn't. It has its moments of genuine humor, but it also tries to be quirky and even sentimental. It doesn't always succeed, but more than not. It helps that it has a talented cast. Relative unknowns Phillip Rayburn Smith, Laura Eason, and Thom Cox give standout performances, while the more recognizable faces of Teri Hatcher and David Schwimmer (who also directed) do not have much to go on. Surprisingly, the films scene-stealer is its most under-written character, Grace, the class beauty/psycho. You can't help but chuckle when Lara Flynn Boyle comes on screen. It's then you know you can count on a laugh. No reason is ever given for her wicked behavior, but after a while, you won't care. Just further proof that the always sexy Boyle handles comedy just as easily as the heavy stuff. Look for inspired cameos from Marisa Tomei, Jon Stewart, Molly Ringwald and the post nose-job Jennifer Grey (whom after watching this with friends realized I am the ONLY person who recognized her).",
         "This movie struck my adolescent home... and hard! The story line is rather brief in the drama department, mostly consisting of characterization \"sketches\" held together by the 10th reunion event. But I must declare, these vignettes were very much as I remember the angst of high school socializations. Every now and then I desire to watch this movie and usually end up watching it 2 or 3 times in one session. I think a good many people who have seen this movie dislike it because of the accurate recollections of those painful, \"glory lost\" or awkward years in high school. David Schwimmer's character as the class president reminds me of the social strata that necessitated the need to endure extreme torment. The trivial yet paradoxically significant feud between doctors McEldowney and Prince poignantly points out those events which act as a great social forge in our personal developments. There are so many personalities represented in this movie, and these personalities are highly representative of my friend's and my own high school years. I highly recommend this movie to anyone who can look back into their personal past and laugh at those formative semi-adult years in life.",
         "This movie should definitely be rented, not your typical movie all the actors do a brilliant job as well as the great direction. It was also nice to see a regular looking cast not some overly handsome and beautiful cast who are picked just for their star power. Furthermore, this film really sucks you into the story of the characters lives as well as the night that they all spend together. It is once again, HILARIOUS but then at the same time doesn't take its self to seriously. This film also does a great job of incorporating several sub characters that don't take away from the general flow of the film. Do yourself a favor and rent this one, however i imagine if you are reading this you might have already seen it so good for you. Mike",
         "High school reunions can be pointless and painful, that pretty much describes watching this movie. What were these actors thinking when they made this film? The jokes are boring and stale, the story line is stale and sophomoric, and the situations are uninteresting. David Schwimmer directed and starred in this flounder and couldn't have been more predictable as the smarmy class president. The characters are unlikable and annoying. It's an absolute waste of such well-known stars as Teri Hatcher, Lara Flynn Boyle, David Schwimmer, Jon Stewart, Marisa Tomei, Molly Ringwald, Jerry Springer, etc. The only highlights I found were Joey Slotnick's character singing his new hit song; very poignant moment and Grace (Lara Flynn Boyle). Grace is viciously hysterical. Her dry calmness as she calls the babysitter with a death threat simply to get rid of an annoying couple is sinister.",
         "this film was lame, it was a TV movie stretched out to long...it was not the actor's fault, all of them were good, i just didn't have a chance to care about any of the characters, there was no motivation, nothing, it was just \"here they are, aren't they clever?\" i only rented it cause it had molly ringwald, tomei, jennifer grey in it and yes, all of 5 minutes...am suprised they didn't add peter sellers on the credits... pass on this one, not worth your time or money cause for all the money and skill and talent involved, they could have made something a bit more imaginative... Q",
         "by Dane Youssef It's astonishing that Schwimmer turned down the lead in \"Men In Black\" (the Will Smith role) for this. He might have been the one to have a lasting career after \"Friends.\" Or at least appear in something good. No such luck. \"Since You've Been Gone\" is yet another movie that showcases the 10th Anniversary High School Reunion. Wow, how many movies are they make around those? Not merely reunions, I mean, everyone deals with those at some point. But the 10 year post mark is usually when reunion time comes rolling around. I'm not sure to begin saying everything that's wrong with this movie. Many already have. Many have condensed the problems into a blurb or a couple of sentences. The critic on Epinions.com wrote: \"Cons: Bad Acting, Half-Baked Development of Characters, Lack of Direction and Focus in Storyline.\" But I disagree. What about the gaping lack of humor, energy and insight? Still, I guess that's too much for a nutshell. Aside from Jeff Steinberg's rough-draft script, David Schwimmer's directing is also a chief flaw. And I am about to explain why: Whenever actors try to direct, there's always a danger that this Thespian-turned-helmer could try to turn the movie, show or whatever into just a bunch of filmed performances. This director will just focus entirely on performances and skim or completely omit just about everything else. You know what I mean. Ever notice whenever an actor makes his directorial debut, he has a tendency to turn it into pretty much just a taped collage of actors acting? Kinda like a portfolio or a resume' on tape? Think about EVERY movie directed by an actor you've ever seen? We're just observing some people act, not a real movie. But to be fair, that's not ALWAYS how it turns out when an actor directs: (\"Braveheart,\" \"Unforgiven,\" \"Zoolander,\" \"Sling Blade,\" \"Now You Know\" and \"Confessions of a Dangerous Mind\"). And whenever SCREENWRITERS get behind the camera, many have a tendency to just focus on the actors delivery of their dialog and little plot points, twists and morals. But enough of that crap. Jeez, I'm supposed to be reviewing a movie, not writing a handbook on a director's workshop. David Schwimmer's other directorial credits include numerous episodes of \"Friends,\" so it's understandable why he kinda cocks up here. The camera is mostly on auto-pilot. The whole movie is like a boring workplace party with elevator muzak playing. The actors (all from Schwimmer's Lookingglass Theatre Company) all come together and recite easy sit-com one-liners and sit-com situations with sit-com payoffs. Once again, this COULD be funny and worth-watching. But it's all done with an absolute minimum of energy. The most Schwimmer DOES bring to the movie is his character Robert S. Levitt, an obnoxious dick who was all the rage in high school, getting apparently popular by pissing people off (Hey, that's why I did! Seriously. I never realized I was such a rotting asshole). He berates the people who were losers in high school and are losers now. Schwimmer SHOULD get some credit as shedding his Ross-image, despite Schwimmer's many mannerisms: Clipped speech (William Shattner vocalizations), hoarse and drunken voice and Dustin Hoffman persona (but none of Hoffman's character acting). Schwimmer's range is pretty limited and sit-coms and soaps are the perfect showcase for the mediocre, yet determined. All the usual types are here. The token gay guy. The geek who's still kind of a geek, but successful. The one who wants his revenge. The former school bully. The high-strung bitch. The neurotic nebbish. All true-to-life. Probably. But no fresh material, no insight or real digging into what's going on. They're all too cartoonish, yet not given any real jokes to deal with. The movie would just rather sit there and be quirky rather than say or do anything in particular. It never surprises you, delights you or interests you very much. It doesn't even really make you laugh. I can see why Schwimmer must've liked it. All of the vague \"jokes\": a guy finding \"Kick Me\" signs on his back, a woman chipping a tooth and looking deformed, a guy \"geeked-up\" and dancing horribly even for a white guy on purpose. This is all sit-com level stuff. But for some reason, it's easier to take with a laugh-track, commercial-breaks and all in a half-hour. Fellow \"Friends\" alumni Lisa Kudrow did the 10th High School Reunion better in \"Romy & Michelle's High School Reunion.\" Rent that instead. But all bile aside, here's hoping Schwimmer manages to score next time at bat. And gets a good ACTING showcase as well. In a nutshell, it's just a dull and horribly under-developed and lifeless movie. IS... there life after \"Friends?\" For David? I hope so. Let's all hope... pray deep and hard. by Dane Youssef",
         "I taped this from TV, so didn't have to pay a penny to see it. I thought it worked as a series of scenes, held together really only by the fact that everyone was there for the reunion, and alternating scenes with the main characters with little vignettes focusing on minor ones and quirks of character. So it was a bit sit-com'ish: who cares? It wasn't intended to be some major drama. There were many amusing moments, and one couldn't help feeling pleased that the doctor reconciled with his wife, the woman desperate to find someone did meet up with the man who wanted to see her, the unemployed man got offered a job after almost inadvertently putting a lot of people in touch with each other and also began a relationship, that the singer got to sing his song (apparently taken over and turned into a hit for someone else by a music company that ripped him off) the way he wanted and was applauded for it, also that the obnoxious class president, who seemed to be using the whole reunion to get work for his family's businesses, got his. But not \"heartwarming\" all the way, no: the tricks of Lara Flynn Boyle's character were sometimes unpleasantly vicious, and the last was a discordant note in the otherwise fairly upbeat ending (though it could probably have been sorted out eventually). We were evidently meant to see her as an unpleasant practical joker from way back (references to class outings in which some disaster had happened), but never shown why. Romy and Michelle's High School reunion was better, yes - but this wasn't so bad.",
         "If you have two hours to spare out of your precious life and you think Teri Hatcher is nice eye candy, watch this movie. I did. I won't again, she's hot but not that hot, I don't know if any woman is. This movie to me was created as a vehicle for David Schwimmer to build on his success from Friends. The characters are never developed, Schwimmers acting if you want to call it that is stiffer than the reaction just looking at Teri Hatcher has on me. It is formulaic, predictable and stereotypical. All the things I love in a movie. At least it was a made for TV movie so no one ever spent any money to see it. The only redeeming nuggets that I gleaned were the cameos. It was nice to see some good people trying to help bail out the sinking ship.",
         "David Schwimmer is a talented guy and by directing this TV movie he was clearly trying to show the world that he wasn't just Ross from 'Friends'. He certainly pulls in a good cast, with Teri Hatcher, Marisa Tomei and even a sadly brief cameo from the ever lovely Molly Ringwald, but this equally sadly doesn't make for a good film, and it remains a sluggish watch throughout. I do wish that Schwimmer would direct more films though.",
         "Terrified Babysitter? Check! Stolen Baby? Check! A-hole ex-students? Check! Crazy glued toilet seats? Check! Sad, mad, bad and stupid peeps all over? Check! This is so hilarious... I know some of these people... they were at my reunion, too. A good and silly film, for when you feel good and silly. They have a ten line thing with these reviews and sometimes it's hard to fill it up. This movie is not a ten-liner, but has so much charm that I want to say it's good. Another film you may like is Grosse Point Blank... also fun and silly, also featuring a reunion. Girls with Gaps!",
         "Again, we are faced with still another high school reunion film, this time dealing with some very unhappy people, including two men who fought at graduation. While both became doctors, they engage in fighting once more at the reunion in a memorable battle. Yet, the married doctor and his wife come to reveal their true love for each other as the film concludes. We have an embittered woman who plays all sorts of nasty tricks on her fellow alumni. Placing Krazy Glue on the toilet seat in the bathroom is already the limit. The high school president of the class leads the way and promptly gets what's coming to him at the end of the film. This is basically a feel good film highlighting the problems of individuals caught up at their reunion.",
         "i saw this one for the second time on cable this morning whilst flicking thru the channels. a movie about a typical high school reunion - with a twist. the characters dont all turn out how you expect them to be from the way they look. sure, the D&D nerds are still annoying, the head cheerleader and star quarterback are still together (hehehe) and the class psycho is still psycho, but everyone seems to be trying to be something they're not, and some are doing better (or much worse) than others. you'll ask yourself \"where have i seen that actor/actress before??\" many times through out the film. look out for some 80's stars cameoing as well (as well a cameo by jerry springer!) the best character? well fred of course! cuz \"you've gotta dance!!\"",
         "The film is very watchable, but the story seems to lack direction. At the end of the movie not everyone is living happily ever after. But thats perhaps why it feels original. The story's a comedy about a class reunion where people find out how much they have changed and how they have not. I liked the movie. They should have more like this.",
         "This movie was fantastic. The acting was terrific, from the high strung Electra Pollack (Laura Eason) to the arrogant Kevin MacEldowney (Phillip Rayburn Smith). Most of all, Grace Adler (Lara Flynn Boyle), the class psychotic. Not as terrible as most reunion flicks this is one to watch. 8/10",
         "This movie is a very entertaining. The writers nail the stereotypes that exist in everyone's high school class, and continue to exist 10 years later. Thank God they tend to disappear as we get older. The writing is quick witted and doesn't dummy down. While it's star studded, it's not played up. It's one of those movies you'll sit and watch the credits, to see \"What's that guy's name?\" David Schwimmer is the perfect arrogant ass. Molly Ringwald adorable in her cameo. The music is great for a quick glimpse back to the 80's. I highly recommend finding a copy of it to view before you attend any reunion.",
         "Lara Flynn Boyle was hysterical, she played that psycho role so naturally. The Actor Philip Rayburne Smith needs to be seen more in movies and/or television. He has some qualities, looks and acting. The movie was a good movie if you need a few laughs. I don't want to spoil the movie for you but, it seemed so surreal. I hated David Schwimmers role, but then again with his nasal whiny voice, I guess he can't play many roles. The Gay character Zane or Lane, I forget the name, was a really good portrayal of a real live gay man! I gave it a 10 because it was a very funny movie. The cameos were cute too, you get to see Jennifer Grey(Dirty Dancing) post rhinoplasty. Molly Ringwald with her fantastic sarcasm about being a teen film star. You must see Since You've been Gone!",
         "With a simple, yet elegantly interwoven storyline, SINCE YOU'VE BEEN GONE entertains with comedy, emotion, and the subtle brilliance of David Schimmer. Following a clique of high school friends around their 10 year reunion, the film takes up complex issues that include personal success, fleeting popularity, the loneliness and confusion of adulthood, and mixes them with 'kick me' signs, re-kindled romance, and an 80's cover band. Familiar and unfamiliar actors give several perfectly nuanced and superb performances that add an unforgettable quaintness to the film. (In fact, these are the only major roles for main characters Heidi Stillman, Thom Cox, and David Catlin.) Cameos by John Stewart, Molly Ringwald, Marisa Tomei, a post-plastic surgery Jennifer Grey, and Schwimmer's mom also add to the light-hearted humor. Between directing this film, his performance in KISSING A FOOL and his role in BAND OF BROTHERS, it's apparent that Schwimmer is nothing short of a genius (a fact recognized only by a handful of people, including Larry David). A must own film.",
         "This movie lacks any sort of direction what so ever. It has no plot, the acting is lame, the characters are lame, the jokes are lame. It is one of the top 10 worst movies I have ever seen. If you like movies that aren't funny and have no plot, then go rent this movie tonight.",
         "OK, first thing to clear up. Schwimmer's name is top billing for the simple reason that he is the most famous in the movie. Just like Marlon Brando in Apocalypse Now, and Richard Harris in Harry Potter. OK, now the good stuff. I dunno how else to say it, but this movie is amazing. You just smile all the way through, except when you are laughing your head off. Its such a warm movie, ya cant help but get so involved with every other character. It is more like an Alan Bennet play than a made for TV film. You see things in the background that carry the story along, every single character is involved with every other character. Everything is just, perfect. Thats all i can say. If you want to spend two hours feeling great, watch this movie. I cant understand why everyone slates this movie, coz it really is a damn fine movie, and one worth seeing, even if its just for the soundtrack!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "FilmColony",
         "Miramax"
      ],
      "summaries": [
         "The story of a 10th anniversary High School reunion, told through the eyes of a doctor who was humiliated on graduation day by being badly beaten up by a fellow graduate.",
         "Kevin MacEldowney, a struggling doctor, doesn't look forward to his ten-year high school reunion ever since he was humiliated on graduation day after being beaten up by the school bully Pat Prince. But at some urging, Kevin reluctantly attends with his wife Mollie and their gay family friend Zane, a struggling singer/composer. At the reunion, Kevin not only encounters his former nemisis, but an assortment of troubled people each with their own agendas who include: lonely psychopath Grace, business loser Duncan, angry publisist Clay, writer/therapist Holly, back-luck streak Electra, wealthy European business woman Maria, and the obnoxious host and former class president Rob Levitt."
      ],
      "budget": 0
   },
   "movielensId": 122474,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-06",
      "dvdReleaseDate": null,
      "directors": ["David Schwimmer"],
      "runtime": 96,
      "movieId": 122474,
      "title": "Since You've Been Gone",
      "mpaa": "R",
      "actors": [
         "Lara Flynn Boyle",
         "Teri Hatcher",
         "David Schwimmer",
         "Joey Slotnick",
         "Harry Lennix",
         "Rachel Griffiths",
         "Jon Stewart",
         "Temple Williams",
         "Christine Dunford"
      ],
      "imdbMovieId": "0120135",
      "originalTitle": "Since You've Been Gone",
      "genres": [
         "TV Movie",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of a 10th anniversary High School reunion, told through the eyes of a doctor who was humiliated on graduation day by being badly beaten up by a fellow graduate.",
      "tmdbMovieId": 61168,
      "avgRating": 3.5,
      "releaseYear": "1998",
      "numRatings": 2,
      "posterPath": "/3lCCoDRcQwl2CflxVSkiAwONq0G.jpg"
   }
}