{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "haiti",
            "id": 5518
         }
      ],
      "imdb_id": "tt0061502",
      "video": false,
      "title": "The Comedians",
      "recommendations": [
         70806,
         92819,
         84944,
         86616,
         18929,
         185494,
         20372,
         26252,
         26378,
         43013,
         67521,
         48599,
         54195
      ],
      "backdrop_path": "/rh4mFGMFzNFnzoQ8J4mAZAZ1jGY.jpg",
      "revenue": 5200000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Brown",
               "gender": 2,
               "credit_id": "52fe49709251416c910ad40b",
               "name": "Richard Burton",
               "profile_path": "/fRoBAQQP9sfnIYuqw546yFs3qKn.jpg",
               "id": 5341,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Martha Pineda",
               "gender": 1,
               "credit_id": "52fe49709251416c910ad40f",
               "name": "Elizabeth Taylor",
               "profile_path": "/kLSHCsowVnTvIbDD5Virb0yfLCW.jpg",
               "id": 3635,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Major H. O. Jones",
               "gender": 2,
               "credit_id": "52fe49709251416c910ad413",
               "name": "Alec Guinness",
               "profile_path": "/nv3ppxgUQJytFGXZNde4f9ZlshB.jpg",
               "id": 12248,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mrs. Philipot",
               "gender": 1,
               "credit_id": "52fe49709251416c910ad417",
               "name": "Gloria Foster",
               "profile_path": "/8peApNX6ms84dK07Xguf84CNFJK.jpg",
               "id": 9364,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Henri Philipot",
               "gender": 2,
               "credit_id": "52fe49709251416c910ad41b",
               "name": "Georg Stanford Brown",
               "profile_path": "/vvPXgJ1BzPJiSuSuBe3dlJcxErN.jpg",
               "id": 14065,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dr. Magiot",
               "gender": 2,
               "credit_id": "52fe49709251416c910ad41f",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Ambassador Manuel Pineda",
               "gender": 2,
               "credit_id": "52fe49709251416c910ad423",
               "name": "Peter Ustinov",
               "profile_path": "/8Lv4g3ZPVSM1ckKk15OnryX8sL7.jpg",
               "id": 14501,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Smith",
               "gender": 2,
               "credit_id": "544d3234c3a36872d200288a",
               "name": "Paul Ford",
               "profile_path": "/g9TzewO2JSSGabTV59UtBcQczuA.jpg",
               "id": 127641,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Mrs. Smith",
               "gender": 1,
               "credit_id": "544d32420e0a2608be0029b1",
               "name": "Lillian Gish",
               "profile_path": "/vMDJptAwODMUpgrYsfgaphAq7CS.jpg",
               "id": 8828,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Petit Pierre",
               "gender": 2,
               "credit_id": "544d325f0e0a2608d0002949",
               "name": "Roscoe Lee Browne",
               "profile_path": "/m0Q5VCyjcXXN5w6MHulOMD1r6ZK.jpg",
               "id": 24368,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Captain Concasseur",
               "gender": 2,
               "credit_id": "544d327ec3a36872d8002a30",
               "name": "Raymond St. Jacques",
               "profile_path": "/a3vR8Ju5HJUKrCf6Zkxr1QtD7DQ.jpg",
               "id": 54565,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Marie Therese",
               "gender": 1,
               "credit_id": "544d3291c3a36872d200289d",
               "name": "Cicely Tyson",
               "profile_path": "/j7j7Qc1qi3W6JOqmPVWqqs5awjt.jpg",
               "id": 18249,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Michel",
               "gender": 2,
               "credit_id": "544d32af0e0a2608bb002a8c",
               "name": "Zakes Mokae",
               "profile_path": "/sxzqrmSm7Kd7eSHzos7UeiT0mke.jpg",
               "id": 47458,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49709251416c910ad407",
               "name": "Peter Glenville",
               "profile_path": "/5OGbXgJ6Gx89VSvfH6mkuolwtV4.jpg",
               "id": 86659,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49709251416c910ad429",
               "name": "Graham Greene",
               "profile_path": "/cz2Nnw7YASKCOHB5B9cgHT7mZuH.jpg",
               "id": 15379,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe49709251416c910ad42f",
               "name": "Graham Greene",
               "profile_path": "/cz2Nnw7YASKCOHB5B9cgHT7mZuH.jpg",
               "id": 15379,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 7.655479,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 86059,
      "vote_count": 11,
      "budget": 0,
      "overview": "Set in the Haiti of \"Papa Doc\" Duvalier, The Comedians tells the story of a sardonic white hotel owner and his encroaching fatalism as he watches Haiti sink into barbarism. Complications include a friendship with a rebel leader, politically \"charged\" hotel guests, an affair with the wife of a European ambassador, and the manipulations of a conniving British arms dealer.",
      "similar": [
         120467,
         132344,
         48650,
         5,
         255,
         7303,
         1278,
         88,
         786,
         539,
         3594,
         153,
         612,
         254320,
         97630,
         258480,
         82023,
         27205,
         37710,
         9029
      ],
      "original_title": "The Comedians",
      "runtime": 152,
      "poster_path": "/ozOzkzkmGqvcwyqFU7FE7N5nKEy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Maximillian Productions",
            "id": 16912,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Trianon Films",
            "id": 16913,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1967-10-31",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "They lie, they cheat, they destroy… they even try to love",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Glenville"],
      "runtime": 150,
      "synopsis": "Chapter One: Arrival A cruise ship arrives in Port-au-Prince, Haiti with four passengers: Major H. O. Jones (Alec Guinness), a British businessman with a letter of invitation to do business with the government; an elderly American couple, Mr. and Mrs. Smith (Paul Ford and Lillian Gish) who have the idea to invest in the nation to set up a vegetarian complex for education and nutrition for the locals; and the central character, a cynical, washed-up individual named Brown, (Richard Burton). Upon arrival Major Jones presents his credentials to Captain Concasseur (Raymond St. Jacques), a law enforcement officer, who notices that the official who invited Jones has been deposed and imprisoned. Concasseur and his men rough up and imprison Jones. Brown has been bequeathed a hotel in the capital from his late mother but has been unable to sell it in his trip to New York. Brown also has an ongoing affair with Martha (Elizabeth Taylor), the wife of the British ambassador Pineda (Peter Ustinov). When Martha and Brown have an argument, Brown goes to Mere Catherine's brothel where he discovers that not only has Jones been released, but he's a guest of Captain Concasseur and is being treated to enjoying the hospitality of Brown's favourite tart, Marie Therese (Cicely Tyson). Jones has gained the favor of the new 'Papa Doc' Duvalier regime who are keen to receive a supply of arms that they have paid a down payment on. Jones claims the weapons are impounded in a warehouse in Miami, but the weapons may be imaginary and a confidence trick by Jones. Once bitten, twice shy, the government will not allow Jones to leave the island until they are sure the weapons exist. Meanwhile, Mr. Smith, a former Vegetarian Party candidate for the Presidency of the United States against Harry S. Truman, is given a tour of a suburb of Port-au-Prince, an empty shantytown called Duvalierville. During the evening he and Mrs. Smith follow a local procession that they believe is a religious ceremony but turns out to be an audience for executions by firing squad. The evening's fun and frivolities continue as Captain Concasseur and his men enter Brown's hotel and beat him up until Mrs. Smith bluffs the thugs into leaving by announcing that she will inform her husband, the American Presidential Candidate. The Smiths depart from Haiti the next day. Chapter Two: Brown's Friends Over the next few weeks, Brown watches as the Duvalier regime seeks to put down any dissent with an iron fist. He becomes friends with Dr. Magiot (James Earl Jones), a rebel leader. As Brown becomes a reluctant participant in the planned insurrection, the rebels recruit Major Jones to provide military leadership. Jones has been regaling the other expatriates with his tales of heroism as a Commando officer in the World War II Burma Campaign that Brown does not quite believe, comparing him to Errol Flynn in 'Objective, Burma'. Brown hosts a meeting of the group, including Magiot, Jones, and Ambassador Pineda. But trouble ensues soon thereafter--Duvalier spies from the Tonton Macoute are watching Brown's Hotel Trianon and his every step. The day after the meeting, three assassins confront Magiot while he's performing surgery, and cut his throat with a scalpel knife in the operating theatre. Upon learning of the brutal murder, Brown reluctantly agrees to drive Jones, who escapes by dressing as Brown's female cook wearing drag and blackface, into the countryside to the rebel base under the cover of night. When picking him up that evening, he realizes that Jones has apparently become involved with Martha Pineda. Brown leaves town with him in a jealous rage, and the inebriated Jones makes matters worse by bragging about his conquest. Driving carelessly up the treacherous, winding road, Brown hits an embankment and breaks the cars front axle. The two continue their journey on foot, arriving at a remote cemetery, the designated meeting point, too late. They settle in for the night with Jones admitting that his jungle war stories were total fabrication; his wartime career was running a cinema in India. In the morning, the omnipresent Captain Concasseur and a Tonton Macoute accost Brown as he tries to find rebels in the area. They demand to know where Jones is, but Brown denies that the Major is there. As soon as Brown has finished speaking, a sleepy Jones approaches, unaware of the Macoutes presence. The two command him to stop, but Jones turns around and runs uphill into the cemetery. They open fire, killing Jones. Then they order Brown to get into their jeep with them. As he does so, shots from rebels ring out, and the two drop dead. Chapter Three: Helpful Outsider Upon being asked about Major Jones, Brown tells the two rebels in dismay: \"You arrived two minutes too late.\" He then shows them the body of Jones. The taller of the two, after hearing that Magiot has been eliminated as well, comments: \"They have killed the best of us.\" The two rebels then plead with Brown to assume the role of Jones, seeing this as the only hope they have left. Brown hesitates, commenting that he is no military man. But he finally relents after being asked whether he wants to continue living like this. After a long walk, the three meet up with a small, ragtag group of poorly equipped rebels. The group buys the deception, believing that Brown is Jones, and he gives a cynical, taunting speech, apparently without being understood, since the rebels speak Creole French and Brown only speaks English. The camera then cuts to the Pinedas, as they are about to leave the island. Petit Pierre (Roscoe Lee Browne), a journalist friend of Brown, sees them off, telling them about a battle between government troops and rebels, and stating that two rebels have been killed and noting that one of the rebels was the bellhop at Brown's hotel and the other rebel was \"unidentified\". The Pinedas plane takes off, and Martha notices smoke on a hillside of the island. The question whether Brown has survived the skirmish remains unanswered, although Petit Pierre's cryptic remarks on the two rebels killed in the recent battle between government forces and rebels seem to indicate that Brown was the unidentified rebel who was killed in the fighting.",
      "writers": [
         "Graham Greene",
         "Graham Greene"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061502/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMGJhZDcyYjUtYmQwZi00ZDIzLWJhZDItZTI0M2FiY2VmOTE4XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Richard Burton",
         "Elizabeth Taylor",
         "Alec Guinness"
      ],
      "reviews": [
         "Based on the novel by Graham Greene, The Comedians is a look at Haiti that nearly 40 years later remains the same - political unrest, poverty, corruption, and brutality. Set during the time of Papa Doc, the story centers on Richard Burton as the white owner of a hotel left to him by his mother. He is in love with the wife (Elizabeth Taylor) of an ambassador (Peter Ustinov) and has managed to remain apolitical. However, events force him to enter the fray. The Comedians holds one's interest, although it's on the long side. The cast is remarkable: Burton, Alec Guinness, Peter Ustinov, Taylor, James Earl Jones, Lillian Gish, Georg Stanford Brown, Roscoe Lee Brown, and, in a small role, Cicely Tyson. Taylor is very beautiful, although her accent is all over the place. She sounds French in the beginning, then English, then like Elizabeth Taylor, and then in the middle of the movie, we find out she's German. Though Burton went the schlock for cash route in his career, he was a wonderful, handsome actor with a remarkable voice. Towards the end of the film, he has a scene with Guinness that is well worth the wait - two great actors in a subdued and remarkable scene. The Haitian scenery belies what lies underneath. It's a film that is perhaps more timely today than it was in 1967.",
         "After delighting audiences in director Franco Zeffirelli's 1967 hit adaptation of Shakespeare's THE TAMING OF THE SHREW, the Burtons' popularity with audiences seemed to be on the wane as their next film, Peter Glenville's THE COMEDIANS (1967) became their first full-fledged box office disappointment. There was much publicity surrounding the political thriller as it shot in Africa (masquerading as Haiti) and the fact that Taylor accepted half her usual salary and took second billing behind Burton kept gossips wagging for months (she reportedly only took the part out of fear of being replaced with Sophia Loren). But when the film opened, critics found it slow and talky and audiences simply seemed uninterested. Although the film is never quite as interesting or as suspenseful as it could have been, I dare say that THE COMEDIANS probably plays a great deal better today without the heavy expectations of the time surrounding it. Graham Greene does a respectable job of paring down his complex novel for the screen, and director Glenville keeps the film moving at a reasonable pace in spite of its lengthy runtime of 150 minutes. The film is always interesting and occasionally gripping, although Greene and Glenville keep the audience at a relative distance which prevents the picture from striking as hard as it could have. Burton is in good form, and Alec Guinness, Paul Ford, and Lillian Gish all turn in top notch support (only Peter Ustinov feels under utilized). Unfortunately, Taylor is dreadfully miscast as a German military wife \u0096 complete with a woefully unconvincing accent \u0096 and her ill-fitting presence creates several lulls in the film as the number of scenes between her character and Burton's character are increased (in order to give the diva her proper screen time) which hampers a few long stretches of the film and slightly undermines what could have been a first-rate effort.",
         "The Comedians one of the many films that starred that legendary screen team of the 60s, husband and wife Richard Burton and Elizabeth Taylor is set in that troubled stepchild of the western hemisphere Haiti. At the time Haiti was mired in the worst poverty on this side of the globe with the overwhelmingly brutal dictatorship of Papa Doc Duvalier. Duvalier and his family are gone now, but the brutality and poverty remain. The title from the original Graham Greene novel refers to the various white people here who are very different, but who handle what they see in Haiti by making a lot of bad jokes. Whatever else this is, The Comedians is not a comedy. Burton and Taylor play the owner of a hotel in Port-Au-Prince and she is the wife of an ambassador from some foreign country unnamed. They're having an affair, she's married to Peter Ustinov. Paul Ford and Lillian Gish are a husband and wife and he once ran for president on the Vegetarian Party ticket. He wants to start a business, a vegetarian resort of sorts. These two are totally clueless, but so are the Haitians they deal with, they actually treat Ford like a big deal. Alec Guinness plays a part similar to the part David Niven had in Separate Tables, he's an arms dealer who's been dealing with someone now out of favor with the regime. But while at first he's clapped in prison Guinness makes a deal with another faction who think he's a big deal with his heralded background of being a war hero in the Burmese campaign in World War II. If you've seen Separate Tables than you can equate Guinness with Niven. These name players however take a back seat to some of the black performers in The Comedians. Roscoe Lee Browne, Cicely Tyson, Gloria Foster, Georg Stanford Brown all are different types of Haitians from different levels of society there. But the guy to really watch is Raymond St. Jacques. As a captain in Duvalier's police he is one truly malevolent being. St. Jacques steals all the scenes he's in. Of course Papa Doc didn't allow The Comedians to be shot in Haiti, but the country of Dahomey one of the new African Republics served well as a place with a poverty level similar to Papa Doc's little satrapy. The Comedians which was not a big hit at the time is maybe more relevant today as we can see things there without the filter of the Cold War between two superpowers. Liz and Dick did a good one here, one for the ages.",
         "When I bought \"The Comedians\" in DVD, I had never heard before of that movie, although I am a fan of the cinema of the specific era. Moreover, it surprised me I didn't know anything about a film with such an excellent cast: it isn't easy to find Burton, Taylor, Guinness, Ustinov, Gish and Ford in the same movie. And there was something else: it was based on a novel and written for the screen by an author whose work I admire: Graham Greene. Therefore, I was curious to find out why a movie with so many virtues flopped and was so soon forgotten. After watching it, I understood: \"The Comedians\" is a movie that was made for the general audience, a film that should be fun, fast and easy to digest, a typical Hollywood epic. However, it contains none of the classic ingredients: a) it isn't fun, it is a serious political drama, with a deeply British, cynical and black humour, b) it is not melodramatic enough and the love story between Burton and Taylor evolves quite unorthodoxically, without any clichés, c) it isn't fast at all, it's almost three hours without impressive action scenes and much - quite sophisticated - dialogue, d) it isn't easy to digest, it is a sad and bitter movie with an ambiguous ending. These are the reasons why \"The Comedians\" flopped, but they are also the reasons that make the film exceptionally interesting. Set in Tahiti during the dictatorship of Francois Duvalier (\"Papa Doc\"), an ideal location for Graham Greene's stories, it demonstrates the cruelty of the regime, through the story of 6 Westerners and some locals in the background. It is a big, flawless production providing food for thought accompanied by excellent cinematography, professional directing and a slow, but strong and memorable scenario. The claustrophobic atmosphere of the brutal dictatorship is exceptional, the actors give magnificent performances and it is also one of the few films that end without an answer, without a typical happy or tragic ending. I recommend it to viewers that enjoy films that provide more than a pleasant evening.",
         "A ship of fools docks in Port-au-Prince, and the disembarking passengers include a local businessman, an idealistic former U.S. presidential candidate and his wife, and a self-confident British major. The film's credentials are incredible; the cast includes Richard Burton, Elizabeth Taylor, Alec Guiness, Peter Ustinov, Lillian Gish, and James Earl Jones; Graham Greene wrote the script from his own novel; and Peter Glenville provided the taut direction. Given the talent involved, perhaps expectations raised the bar for \"The Comedians\" too high for any film to reach. Although the results do not represent a pinnacle for any of these artists, \"The Comedians\" is an engrossing tale set against the nightmarish backdrop of Papa \"Doc\" Duvalier's repressive regime in Haiti. A thick tense atmosphere envelops the film from the outset. Arrests, beatings, corpses, intimidation, bribes, murders, and threats paint Duvalier's Haiti in shades of blood and terror. In 1967, the Taylor-Burton romance was still in the tabloids, and the film's illicit romance depicted by the world-famous pair was still titillating. However, time has dimmed the scandal, and the film has benefited. Greene's story and the acting talent are no longer over-shadowed. The still ravishing Taylor, who affects a German-accent as the wife of Ustinov, a cuckolded foreign ambassador, is involved with Burton, a local hotel owner. While arguably the least-interesting aspect of the film, their liaison is integral to the story. Meanwhile, Paul Ford and his wife, Gish, seek to establish a vegetarian center in Duvalierville, a never-will-be Utopian community, and a shady braggart with the wrong connections, Guinness, attempts an arms sale to Duvalier's henchmen. The visitors, the diplomats, and their local connections are embroiled in Haitian political conflicts and dangerous encounters with Duvalier's thugs, the dreaded Tonton Macoute. Greene's script is literate, and the performances are effective. The bevy of international stars is enhanced and ably supported by such pros as Paul Ford, Cicely Tyson, Raymond St. Jacques, Roscoe Lee Browne, and George Stanford Brown. Although short on action, \"The Comedians\" is long on suspense and tension. While the film certainly remains a staple for fans of Taylor and Burton, Glenville's fine production deserves to be seen and appreciated, not only for its lustrous stars, but also for throwing a spotlight on Haiti's nightmarish past.",
         "As a restless wife of a South African ambassador, the mother of a whining child and the mistress of an empty shell of a man, Liz is a woman who's unlucky in love\u0085 Graham Greene's explosive novel, which mixes adultery with political turmoil in the midst of Haitian corrupt dictatorship of \"Papa Doc\" Duvalier, could hardly been filmed on that Caribbean island\u0085 It tells the story of a small group people caught up in a reign of fear\u0085The political intrigue in exotic settings has some interest and the atmosphere is astonishingly well caught\u0085 On his own, playing the cynical hotelier who unwillingly gets involved in revolutionary activity, Burton is sensible and his scenes with Alec Guinness as a cowardly soldier of fortune and with Paul Ford and Lillian Gish as two impossibly innocent American tourist, have a fine, sharp edge\u0085",
         "Burton, Taylor, Guinness, and Ustinov are a heady combination but I will not remember the film for any one of their \"acting\" capabilities as much as the four wonderful main characters woven by Graham Greene and Peter Glenville. There is almost an unrecognizable James Earl Jones whose fabulous voice is overshadowed in this film by those of Burton and the suave Guinness. \"I have no faith in faith,\" rants Brown (Burton) the anti-hero of the film--a typical Greene character (compare with Greene's 'The Burnt-out case'). Cynicism is turned into comedy. The splashes of Catholic motifs made in passing reference (\"defrocked priest\") hark back to Burton's earlier role in \"Night of Iguana.\" Guinness' reference to looking like a \"Lawrence of Arabia\" recalls his own role as Prince Faisal in Lean's movie. Not having read Greene's book, I am not sure whether Greene introduced these clever details into the script to suit the actors or whether the details had previously existed in the book. The gradual unmasking of the Major (Guinness) is a treat creatively captured by Glenville and Greene. The final speech made by Burton to his group of ragged rebels seem to have a common \"comic\" thread with George Clooney's speech to his soldiers towards the end of the recent Mallick's \"The Thin Red Line\". Ustinov's diplomat and Taylor's vulnerable diplomat's wife, who admits to her lover that he is the fourth \"adventure,\" are both comedians--Greene's likable misfits who cannot change their destiny and are strangely reconciled to accept their inevitable end. All the four main characters are \"prepared\" for their destiny they have designed for themselves as a consequence of previous actions in life. The closing shot of the film is a shot of a suggestive blue sky, redeeming the foibles of the comedians on terra firma. I admit that when I saw the film some 20 years ago, I did not appreciate the film as I do now. I was missing the forest for the trees. This film does not belong to Burton, Taylor, Guinness, Ustinov, Jones or Lillian Gish. It belongs to Greene, Glenville and the French cinematographer Henri Decae. I do not imply that Burton was not good--but George C Scott said one should evaluate a performance by remembering the character more than the actor. It is in that context that I remember the four main characters. Burton's kisses are different here than say in \"Boom\" or \"Cleopatra\"--only to add detail to the character. Taylor is strangely subdued only to add power to her smoldering role. Guinness gradual unmasking is pathetic yet endearing only to add more substance to the character. Decae's camera captures details that shocks--e.g., empty drawers in desks to collect bribes, public executions of rebels watched by school kids... I am surprised that this film, to my limited knowledge, has never been taken seriously for what it offers--a superb script, commendable acting, good direction, and some fine camera-work.",
         "This had all the making of a first rate political drama. There is an acclaimed novelist whose novel this was adapted from, an exciting premise (British expatriates in Haiti, brutally ruled by the brutal and eccentric \"Papa Doc\" Duvliar's, get caught up in political oppression and rebellion), an star-studded ensemble cast, and exotic locations. So why does it fall so flat? Part of the problem is that it the film is overlong, lasting for around two and a half hours. The result is a story which moves very slowly with a lot of excess chat. Also, there is too much emphasis on the dreary soap opera love triangle of the three main characters (Richard Burton, Elizabeth Taylor, and Peter Ustinov). The Burton character, a cynical hotel owner of British decent, is obviously copied on the Humphrey Bogard character in \"Cassablanca.\" The film also fails to take advantage of the official oppression and corruption which is the cause of the country's problems. There is little sense of danger until the last half hour, and even then the action is sporadic. There is also a failure to take advantage of the locations. The film was shot in Benin, an African country which isn't a convincing substitute for Haiti, though there was obviously no way this could have been shot in Haiti itself. But the photography is pretty ordinary. There are a few good scenes, including a voodoo ceremony and a shootout in a cemetery. Also, some supporting characters are actually rather interesting, helped by fine performances by James Earl Jones as a surgeon who supports the rebels and Raymond St. Jacques as a sinister police commander who tortures and murders people as casually as most people would order a take-out lunch. Unfortunately, but most of the film is a case of missed opportunities. It's passable, but overlong and never worthy of the talent that went into it.",
         "The comments by the reviewer from Dubai, UAE, are much to the point, also recognizing the subtle jibes to the actors' roles in previous films. That Graham Greene wrote both the book and the screenplay, and was on hand during the shooting in Dahomey (information from a brief trailer on the recent TCM showing), gives a depth and complexity to the film that remind one also of Bunuel and Tavernier, in whose hands ironic humor and deadly politics are inevitably a subtext. Peter Glenville seems not to have been a prolific director, and even his handful of films are not well know to American audiences (possibly \"Becket\" is an exception, though it has not been replayed in years), but his few works stand out for their dramatic quality, literacy and superb casting. He favored several of the seasoned actors seen here (many Shakespearean trained), Guinness (Prisoner, Hotel Paradiso), Burton (Becket). Once again, when the points of the magic triangle of script, director and cast come together in balance, the result is a superior film (of course we cannot omit the cinematographer, as chosen by the director). \"Comedians\" has an unfortunate title that may have contributed to its demise for a popular audience. Its blatant irony belongs in the category of films in which the political matrix is the setting for the revelation (or non-revelation) of character. To name some outstanding examples: \"The Third Man,\" \"Spy who came in from the Cold,\" \"Day of the Jackal,\" \"Night of the Iguana,\" \"Wages of Fear.\" In this film, the pacing and structure are subtly conceived: even though there is a lot of random killing depicted, the quiet exchange between Burton and Guinness during the latter's escape is the eye of the tornado, with all else raging around it. The young James Earl Jones and other black actors give strong support, and are a match for the sad ennui of Ustinov's diplomat. Taylor, who sports a German accent as Ustinov's wife (the only time she's been called upon to do so?), discharges her role creditably, due in no small part to her chemistry with Burton and to his personal gravitas. In all, this film and the director Glenville really ought to be better known. It is a sad commentary that a movie made about dictators in 1967 could still be so prescient. A four **** movie.",
         "Peter Glenville's \"The Comedians\" is a very difficult film for the average viewer. Based on a Graham Greene novel, it's about the political atmosphere in Haiti while under French rule. It was a box office flop in 1967 and is pretty much forgotten today. That's sad, because this is an important film. Since the departure of Duvalier, the film has the added historical value it didn't have in 1967. It is another entry in the canon of Taylor-Burton collaborations. It also may be the only film in which Alec Guinness, Peter Ustinov, Elizabeth Taylor and Richard Burton all appear in together. Plus, how can you trash a film that flaunts its' Haiti exteriors so joyfully? The vast Panavision photography will be lost on TV screens, especially in the horrific pan and scan format. The best way to see this film is on a big screen and even that may be impossible these days. The title will confuse many (most will think it's about comedians in a comedy club), but it does have a hidden subtext: these people are \"comedians\" in a sense. They kid each other endlessly to avoid reality. In that context, \"The Comedians\" succeeds. It could benefit from some trimming, but that's a small complaint. I can't think of anyone else who would even attempt to make such a challenging film in such a chaotic climate. ***1/2 out of 4 stars",
         "Haiti has been suffering like no other part of the world for decades. \"The Comedians\" takes aim at one of its most awful periods, the late-1960s misrule of \"Papa Doc\" Duvalier. The heart is in the right place, but the film suffers from its commitment to bear witness to unrelieved misery and hopelessness at the expense of story or believable characterization. Brown (Richard Burton) is trying futilely to offload his Haitian hotel and make a clean break from a life spent in furtive sex with Martha Pineda (Elizabeth Taylor), wife of a foreign ambassador (Peter Ustinov). Brown doesn't care about politics, but politics has a way of caring about him. Soon he finds himself pressed for help by noble rebels fighting a hopeless cause, as well as a shady arms salesman (Alec Guinness) who bites off more than he can chew. One of the more misleadingly titled films ever, \"The Comedians\" has barely a laugh on offer, except for the risible sight of Guinness in drag and blackface somehow sneaking past a couple of suspicious black policemen. Its dire tone is a weight, and so is its 150-minute running time. With such a great cast and a script by Graham Greene adapted from his own novel, the film is never a complete bore, but it doesn't engage, either. As other reviewers here note, it comes off as a kind of muddy replay of \"Casablanca,\" without that classic's snappy dialogue or sense of hope. Burton and Taylor were of course the couple of the moment when \"The Comedians\" came out, and the film plays to this shamelessly. The film's first half focuses on their pathetic relationship. Burton's Brown is so jealous of Martha he can't even bear the thought of her spending time with her husband and son. Martha struggles with his growling idiocy because, well she's Taylor and he's Burton and it's what audiences were supposed to have wanted. He seems to be coasting on his sullen, broody charm, while she wrestles with a dicey accent and lack of motivation. Poor Ustinov is reduced to a few moments of cow-eyed impotent sympathy. At least the film looks great, thanks to Henri Decaë's sharp cinematography and the sun-drenched splendor of Dahomey, today Benin, which stands in for Haiti rather well. Director Peter Glenville likes too much shots of people talking to each other for long stretches, but he works in some sharp transitions which cut the torpor factor down somewhat. The main problem with the film is Greene. He does change the story up some from the novel, but leaves in a silly subplot about a couple staying at Brown's hotel who plan to export their vegetarian ideals to Haiti (\"This could be the beginning of our greatest achievement\" Greene has the husband say to the wife as they step off their ship, apropos of nothing) only to discover Haiti is a place where dreams go to die. Paul Ford and Lillian Gish add luster to the sterling cast, but they slow down the story for more grief about poor Haiti, a point the film presses at every turn. Graham also saddles his cast with some bad lines in furtherance of this point. \"Haiti means hate, hate!\" yells one grieving widow when her husband's body is stolen by some Tontons Macoutes. \"He lives for them, and they die for him,\" Brown muses about Papa Doc. Guinness's character, H. O. Jones, is another odd duck. \"If you can't be good, be careful,\" he tells Brown at the outset, before proceeding to be neither. We discover in time that he's a bit of a fraud as well as a cheat, yet for a globe-trotting bounder he has no apparent survival skills other than calling on Brown to bail him out on the basis of their shared Englishness. When he begins to win Martha's affections, Brown naturally finds new cause for his jealousy. The best part of the movie, like others say here, is a scene late in the movie where Brown and Jones have a heart-to-heart and Jones shows real remorse over a misspent life. Here both actors manage some memorable work, and Glenville also keeps things interesting in an understated way by making us wonder about Brown's motives, which involves some clever misdirection. It's not quite enough to save the film, but it makes it feel like less of a waste. Roscoe Lee Browne and Raymond St. Jacques are also notable in minor roles, Browne so minor as a journalist you might miss him except for the way he seems to gracefully speak for a better Haiti without committing himself to anything dangerous. St. Jacques, with his crisp bearing and hard glare, steals every scene he's in as a nasty captain, Concesseur, so much so you wish Greene gave him a bit of ambiguity. Instead, he just kills a lot and tells Brown white people disgust him because their skin reminds him of \"a toad's belly.\" You get the point long ago. Haiti is a bad place. Unfortunately, \"The Comedians\" never advances much from that position, and the result is too often labored, if never entirely as hopeless as its message.",
         "I saw this movie many years ago and it left me cold. When it came up again on cable, the combination of the stellar cast - Alec Guinness, Richard Burton, Peter Ustinov, Peter Ford, Lillian Gish, James Earl Jones, Liz Taylor - and a script based on a Graham Greene novel, prompted me to give it a second look. Maybe because I'm a lot older now I can appreciate its many qualities. Graham Greene's cynical, post-Catholic sensibility is clearly in evidence here. The production qualities are high, and the story line is engaging. The portrayal of the misery of Haiti and the terror of the Duvalier government with its tontons macoutes secret police, is chilling. It is still true today that if you look up \"Third World Hell Hole\" in your Funk & Wagnalls, there will be a picture of Haiti. The characters are well-drawn. Burton's character, Brown - who seems to be missing a first name - is a sardonic, cynical and jaded hotel owner who puts one in mind of Rick in Casablanca. His character transformation, involving the shedding of his cynicism, is very effectively portrayed. Mr. & Mrs. Smith (Ford / Gish) might have been portrayed to be the slightly silly and naive characters they appear to be, but in the end they demonstrate a touching bravery and idealism. The weak spot here is Elizabeth Taylor's Martha Pineda. Her attempt, as an ambassador's European wife, at an accent is simply ridiculous, ranging from French (sorta), to British, to German (kinda) depending on the scene. In addition, the film makers decided that extra dollops of Rich and Liz's lovemaking scenes would be an added draw; not a good idea, as they slow down the action and force us to endure listening to Taylor. It's a long movie but it keeps us going to its tragic finale.",
         "Not one reviewer noted the effective performance of perennial comic straight man Paul Ford, here cast against type in the only serious movie part he ever played. As the naive but heroic Smith, Ford projects all the better attributes imputed to the American character by the notoriously anti-American Graham Greene Smith and his wife--portrayed by the still elegant Lilian Gish who actually was a star in silent films--are veterans of the civil rights movement in the U.S.A. They like and respect Black people and want to help them, which is why they have come to Haiti with money to invest. They are idealists whose ideals are shattered by what they see in Papa Doc Duvalier's Haiti. Ignorant, even deluded, when they arrive, they learn fast. And the Smiths are not intimidated by the regime's thugs, the infamous **Tonton Macoutes**, who have everyone in the country terrorized. For those who grew up seeing Paul Ford as the perennially befuddled Col. Hall on the old Phil Silvers comedy TV show, or in movie parts as some blow-hard figure of ridicule, this very surprising performance is worth renting this movie for.",
         "Richard Burton and Elizabeth Taylor find themselves together just a year after arguably their best film together, Who's Afraid Of Virginia Woolf? Sadly, The Comedians is not one of the best films they ever made as a pair, nor is it one of the best film adaptations of a Graham Greene novel (even though Greene himself penned the screenplay). There are still pleasures to be had from a viewing of The Comedians, such as some very strong acting and amazing photography by the great Henri Decae. Plus, of course, the film is set in a time and place that have been very rarely visited in cinematic terms, so the political turmoil of 1960s Haiti lends the film a sense of freshness. Alas, the story takes too long to unfold and is done is such a low-key style that it frequently lapses into tedium. No Graham Greene story should ever be looked upon as tedious. A disillusioned white hotelier named Brown (Richard Burton) returns to Port-au-Prince, Haiti, to save his troubled hotel business. But the ruthless regime of Papa Doc Duvalier has strangled the life out of Haiti, and Brown finds himself returning to a country in dire political turmoil. As he steps off the boat, Brown witnesses a British visitor named Jones (Alec Guiness) being seized by officials and dragged away to be beaten. Then a dead body turns up in his hotel swimming pool \u0096 a local politician who has made a drunken rant against Papa Doc's regime and been killed by the Tonton (Haitian secret police). Brown is determined to keep out of the political troubles but events conspire to drag him into the struggle. The deterioration of his affair with married woman Martha Pineda (Elizabeth Taylor) has Brown looking for adventure, perhaps to impress her, but more likely to find something to fill the void in his life when they inevitably break up. He helps the British guy Jones, who introduces himself as a soldier-of-fortune/arms dealer and seems to be playing the Haitian government soldiers off against the island's guerillas. Jones is eventually exposed as a compulsive liar, a 'nobody' without a shred of military experience. His tall tales have put him in a real dilemma \u0096 Papa Doc's men want him dead because they perceive him as a threat, the guerrillas want him to supply them with arms (something he can't do) in their fight for freedom! Brown's involvement with Jones drags him deeper into the struggle, forcing him to take a political standpoint and face up to his inner demons. The Comedians suffers from a lot of inter-related subplots that don't work cinematically. In the book these subplots added layers to the story, but on film they slow down an already heavy-going narrative, making it very hard to plough through the movie. A good example of this is the American couple played by Paul Ford and Lillian Gish \u0096 key players in the novel, but so peripheral in the film that they might as well have been omitted for the sake of narrative drive. Taylor is also flawed in this film \u0096 she flits in and outs of accents, her love scenes with Burton seem stifled, and her character makes no sense. Burton and Guiness emerge with the acting honours here, especially in the fabulously acted scene where Jones confesses his various lies and connivances. The film has memorable music by Laurence Rosenthal, and looks terrific throughout thanks to the afore-mentioned Henri Decae cinematography. But Peter Glenville's direction is remarkably staid, and seems virtually at odds with the powerful and urgent themes than underpin the story. Worth a look, but it's unlikely you'll come back to the film once you've satisfied your curiosity.",
         "This movie is another of the many forgotten ones. The story line, though highly condensed, is faithful to the novel on which it is based. Both the novel and the film have relevant political lessons in spite of the writer's sanitized view of the communist party. I first saw this movie at a theater with my mother who presumed it would be funny. It frightened me since I was a second-grader who thought the atrocities were occurring in Florida because of the palm trees and proximity to the sea.",
         "Readers of Graham Greene will fall for this movie, and in particular the portrayal of Brown by the late Richard Burton, who may well play the perfect Greene anti-hero. Burton brings a subtlety to the role which may well be beyond the skill level of any actor working today. His is a haunting, yet totally convincing performance of a cynic, sinner, and dissolute sort searching for an excuse to remain alive, and initially finding that excuse only in pleasures of the flesh. The film seems to have been lost in the shuffle, and that is unfair. While not easy to grasp---at least for those unfamiliar with the works of Greene---it is full of outstanding performances by some of the industry's former greats. Amongst Alec Guinness, Peter Ustinov, James Earl Jones, Burton and Elizabeth Taylor, the only one who comes up short---delivering a wooden and uninteresting performance that makes an elicit romance unattractive out of boredom rather than sin--- is Taylor. Everyone else is superb, including the sidebars played for both a touch of humor and moral rectitude by Paul Ford and Lillian Gish. Action junkies will be unimpressed with the pace of the film and its low key approach to the violence, but anyone who has experienced a land where brutality and oppression rule the day will find the seeming banality of evil, as portrayed in the film, remarkably realistic and properly underplayed.",
         "Let's face it. There are some cultures and political regimes that the rest of the world (especially the lovers of peace) will never understand, and probably aren't supposed to. The lives of the people in Haiti during the regime of President Papa Doc Duvalier are explored through the presence of half a dozen outsiders who find the culture there as strange as most viewers will. Richard Burton plays a Welsh hotel owner who returns to find the government under Duvalier's control and political turmoil for many. He is surrounded by a cast of major stars in secondary roles, which includes his real-life wife Elizabeth Taylor as his married mistress, Peter Ustinov as Taylor's ambassador husband, Alec Guennis as a British Major seemingly in cahoots with the president, and for comedy relief, the team of Paul Ford and Lillian Gish as a former presidential candidate and his flighty, nosy wife. To play the Haitans, some of America's best black theatrical actors were cast, and they include Cicely Tyson, James Earl Jones, Roscoe Lee Browne and Raymond St. Jacques. In spite of the presence of all of these stars, the film is entirely too long with its focus on details that would fit perfectly into a travelogue but will seem bizarre to standard audiences. Those expecting a Liz/Dick movie will be truly disappointed; Her role is superfluous to the plot other than to give Burton a love interest. Lillian Gish's Billie Burke like matron makes references to fellow silent star John Barrymore who allegedly stayed in Burton's hotel. After being paired with Shirley Booth in \"The Matchmaker\", Hermoine Gingold in \"The Music Man\" and Maureen O'Sullivan in \"Never Too Late\", comic character actor Paul Ford adds Gish to his list of eccentric co-stars. In a sense, this seems more the type of movie that Otto Preminger was directing in the mid to late 1960's with its off the wall casting, bizarre plot lines and racial tensions. At least with Preminger, you could count on a little camp. Sadly, that's missing here. Whats not missing is boredom.",
         "I was lucky enough to catch this on TCM, and I'm really glad I did. First off, I've only seen two movies \"set\" in Haiti, this one and \"White Zombie\" (was \"Live and Let Die\" in Haiti? that would be three than). So of the movies about Haiti this is the only one that actually addresses life there. I've actually got some relatives that live there and I tell myself when I think of them, there is no freakin way I'm ever living in Haiti, I don't care how much of a king I'd be, there is no freakin way. Was the movie a truthful account? God I hope not, but having traveled all over the place, something tells me there is probably a lot more truth here than fiction. I've read some reviews here about this being a very boring flick, a disaster etc etc; well let me just sum up some of the scenes and if that sounds boring than go back to CGI land where you belong. First, it looked like a real chicken that this Voodoo priest bites the head off, and that looked like real chicken blood squirting from it. Second I know the effect looked a little cheesy but I rarely ever see peoples neck's slit open like James Earl Jones's is in this movie. So you could say that the atmosphere that these whites in Haiti were living in was just a little precarious, wouldn't you? I currently live and walk among vast hordes of natives and often am the only white around and occasionally I'll think of a bad situation of me trying to escape a mob, so I really was drawn into this flick as Burton stays around because he has nothing else to go to; he just stays in this hell. It was just the madness of it all that I found so entertaining and kept me watching, than you throw in the 2 graphic (especially for the middle 60's!) scenes of the chicken and slit throat, I was really impressed! If you watching for Liz than you will be disappointed but the scene where Burton tries to get some in her house with her husband downstairs was a good exchange. I think some of these reviews are coming from this bitterness that despite all the advances the world has made you still have a whole hell of a lot of crap holes around the world (many with blacks as the majority, sad to say), and they don't like that being portrayed on film. Add to that a far left couple of characters that are so righteous and disillusioned by pouring money into a \"vegetarian city\" that goes nowhere but soaks them of their money, and I can see where some who support all that peace and love jive would hate this flick. I like the way the ending is left to us to wonder of Burton's fate, I would have hoped he hiked over to the other side of the island and gotten out of that hell hole called Haiti. Good to watch, at least once.",
         "After three months in New York, English-accented Richard Burton (as Brown) returns to Haiti. He has been unable to sell his luxury hotel to the Americans. Also arriving on the boat are three friendly travelers; Mr. Burton has offered each of them rooms in his Haitian hotel. Unexpectedly, nice Alec Guinness (as Jones) is arrested and thrown into jail. The other two guests, elderly vegetarians Paul Ford (as Smith) and Lillian Gish (as Mrs. Smith) arrive safely and take Burton's \"John Barrymore Suite\"... In a possibly pre-arranged meeting, Mr. Burton meets French, then German-accented Elizabeth Taylor (as Martha) for sex in a car; the lovers must sneak around because she is married to Ambassador Peter Ustinov (as Pineda). Later, they are able to find a bed... Upon arriving at his hotel, Burton finds a dead body in his drained swimming pool. Haiti is under the iron-fisted rule of dictator \"Papa Doc\" Duvalier; this explains the dead body, abduction of Mr. Guinness, and other things. The decision to adapt Graham Greene's novel is commendable, and the location convincing; however, the film is too long and fails to sustain interest. Many in \"The Comedians\" contribute engaging work, but Burton, Ms. Taylor and Mr. Ustinov often appear bored - and it's contagious. ***** The Comedians (10/31/67) Peter Glenville ~ Richard Burton, Elizabeth Taylor, Alec Guinness, Peter Ustinov",
         "Director Glenville's fondness for TV-style close-ups seems deliberately designed to emphasize the inadequacies in Elizabeth Taylor's performance. The scenes between Taylor and Burton are particularly slow and tedious. At least two of their clinches have even been step-printed to make them run longer! When they have a chance to strut their stuff, the support players fare much better. True, they all have far more interesting material to work with, although Elizabeth even manages to make one of her scenes with Peter Ustinov boring. Fortunately, Guinness delivers one of his best performances. Lillian Gish and Paul Ford are along mainly for laughs and exit halfway through. After their departure, the film literally staggers to an inconclusive and unsatisfying conclusion. An effective use of natural locations is about the only strong feature in this dull, uninteresting, long-winded effort.",
         "The Comedians is a film best enjoyed by those who are 30 years or older and who enjoy the wonderful stars of the 1960s. This movie is worth watching for the wonderful stars of Elizabeth Taylor, Richard Burton, Alec Guinness, James Earl Jones, and Peter Ustinov. These alone make the movie. I enjoy watching the on-screen romance between the Burton and Taylor, knowing that off screen they were also in love. The movie is a prime time movie, even competing with today's movies. The biggest problems with this movie is that it is too long and too predictable. The movie is a bit slow at many points. However, I still enjoy watching and listening to the stars in the film. Enjoy the film with any snack or even with a TV dinner. I give it 4 thumbs up.",
         "Talky and rather dull combination of political thriller and history lesson. When natty politico Alec Guinness is thrown into jail upon his arrival in strife-ridden Haiti, local welcoming factor Richard Burton helps him through the red tape; Elizabeth Taylor plays Burton's lover, Peter Ustinov is Taylor's husband. Rather a bit like Liz and Dick's \"The V.I.P.s\"--with the soap opera trimmings intact--although Guinness is very good and the location shooting is interesting. Burton hardly knows a subtle moment; he is so full of hot air that his spouting-off seems rote. Taylor looks as though her main concern was trying to stay attractive in the wilting heat. Graham Greene adapted the screenplay from his own novel, and sadly bears most of the blame for the overripe characters and dialogue. *1/2 from ****",
         "A disappointment for Greene fans, or at least this one. I found this movie conscientious, slow and obvious, and the acting duo of Burton and Taylor didn't help. Burton's usual tired self loathing seemed phoned in. Taylor's lack of depth gave him nothing to play off of, assuming he was ready to try. She was so carefully made up and coiffed that one was always aware that it was a star turn for Taylor. And the movie is long. What would have been interesting, and might have made an effective movie, would have been to cast Guinness in Burton's role and Burton in Guinness' role. Yes, Haiti was awful then. And, yes, Haiti is awful now. But no matter how serious the message, a movie's first responsibility is to be well made and effective. The Comedians tries way too hard to be \"meaningful.\"",
         "The Comedians Richard Burton & Alec Guinness star in this Graham Greene scripted tale of colonial decadence and state violence in Haiti. Hipster-creole thugs menace Alec upon his arrival, strip off his clothes, and toss him into a cell. Richard smolders morosely in a taxi marked 'publique' and passes a billboard on the highway emblazoned with the name Papa Doc. \"He lives for them and they die for him,\" Richard sneers contemptuously. Cut to Alec in shirtsleeves, manhandled by a goon in sunglasses, van Dyke, and porkpie hat. Cut back to Richard, now in Liz's powdered arms, damp with booze and middle- aged lust. They're in the back of her touring car, talking about desire. She says something about having a baby, asserting a preternatural insight guaranteed by her womb-knowledge. The breeze lifts her Technicolor chiffon scarf. They kiss. \"nothing has changed.\" \"no, nothing.\" Richard looks fairly young here, pre-cirrhosis, his sideburns tawny-grey. He plays the owner of a palatial hotel in Port-au-Prince. Returning to the hotel after his assignation with Liz, he looks down into the empty pool at a bloody body. It is the president, his assistant, Joseph, informs him as the frogs acapella in what surely must be a humid night. Things grow increasingly desperate. The Haitian secret police consist of cooled out hep cats in short sleeve shirts. A brutal officer directs Alec's beating. James Earl Jones is impressive as an idealistic Haitian doctor whose throat is cut over the body of a patient during an operation. Alec knocks boots with Liz, much to Richard's chagrin. Richard, betrayed, accosts Liz. Her response is devastating: \"When you want me I am a woman. When I hurt you I'm always a German.\" Yes indeed. Turns out Daddy was convicted of war crimes and her marriage to Peter Ustinov a desperate means of escape. Regardless, Alec and Richard decide to join a nascent revolutionary moment. Alec is gunned down by the officer. Richard leads his ragtag band of lumpen-proletarians against the state. I fall asleep.",
         "This movie has such a marvelous cast and a very moving love affair between the two leading characters and real life couple but the plot is so similar to \"Casablanca\"'s.See: dictatorship,immigrants,the two secret lovers,the poor husband,the underground the separation even the plane in the end.Obviously Mr.Greene should be a great \"Casa\" fan that he was deeply influenced.As far as the direction goes it's good but nothing really special though very realistic with some very good shots. Burton and Taylor gave a very passionate performance since during that period there were this way in real life.Alec Guinness made the twist with this very interesting character of \"Jones\".and i suppose that's all folks,watch the movie (or better observe it) and recall elements of Casablanca.Am I wrong?"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Maximillian Productions",
         "Trianon Films"
      ],
      "summaries": [
         "Set in the Haiti of \"Papa Doc\" Duvalier, The Comedians tells the story of a sardonic Welsh hotel owner and his encroaching fatalism as he watches Haiti sink into barbarism and poverty. Complications include his inability to sell the hotel so he can leave, a friendship with a rebel leader, some politically \"charged\" hotel guests, an affair with the German-born wife of a South American ambassador, and the manipulations of a British arms dealer who's in over his head.",
         "A cynical Welsh hotel owner secretly romances a diplomat's wife in Haiti under the violent reign of the despot \"Papa Doc\" Duvalier."
      ],
      "budget": 0
   },
   "movielensId": 122484,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-10-31",
      "dvdReleaseDate": null,
      "directors": ["Peter Glenville"],
      "runtime": 152,
      "movieId": 122484,
      "title": "The Comedians",
      "mpaa": "NR",
      "actors": [
         "Richard Burton",
         "Elizabeth Taylor",
         "Alec Guinness",
         "Gloria Foster",
         "Georg Stanford Brown",
         "James Earl Jones",
         "Peter Ustinov",
         "Paul Ford",
         "Lillian Gish",
         "Roscoe Lee Browne",
         "Raymond St. Jacques",
         "Cicely Tyson",
         "Zakes Mokae"
      ],
      "imdbMovieId": "0061502",
      "originalTitle": "The Comedians",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["sxQXtKktsAM"],
      "plotSummary": "Set in the Haiti of \"Papa Doc\" Duvalier, The Comedians tells the story of a sardonic white hotel owner and his encroaching fatalism as he watches Haiti sink into barbarism. Complications include a friendship with a rebel leader, politically \"charged\" hotel guests, an affair with the wife of a European ambassador, and the manipulations of a conniving British arms dealer.",
      "tmdbMovieId": 86059,
      "avgRating": 3.66667,
      "releaseYear": "1967",
      "numRatings": 3,
      "posterPath": "/ozOzkzkmGqvcwyqFU7FE7N5nKEy.jpg"
   }
}