{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1666318",
      "video": false,
      "title": "The Delay",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "María",
               "gender": 1,
               "credit_id": "52fe4bb3c3a368484e19597d",
               "name": "Roxana Blanco",
               "profile_path": null,
               "id": 995008,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Augustin",
               "gender": 0,
               "credit_id": "52fe4bb3c3a368484e195981",
               "name": "Carlos Vallarino",
               "profile_path": null,
               "id": 1107952,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Nestor",
               "gender": 0,
               "credit_id": "52fe4bb3c3a368484e195985",
               "name": "Oscar Pernas",
               "profile_path": null,
               "id": 1107953,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bb3c3a368484e195989",
               "name": "Cecilia Baranda",
               "profile_path": null,
               "id": 1107954,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bb3c3a368484e19598d",
               "name": "Thiago Segovia",
               "profile_path": null,
               "id": 1107955,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4bb3c3a368484e195991",
               "name": "Facundo Segovia",
               "profile_path": null,
               "id": 1107956,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bb3c3a368484e195973",
               "name": "Rodrigo Plá",
               "profile_path": null,
               "id": 78880,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4bb3c3a368484e195979",
               "name": "Laura Santullo",
               "profile_path": null,
               "id": 78884,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "55acb2a69251411e0b008644",
               "name": "María Secco",
               "profile_path": null,
               "id": 966787,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.223782,
      "production_countries": [],
      "id": 133491,
      "vote_count": 3,
      "budget": 0,
      "overview": "Agustín forgets things; he is aging and he knows it. María is never alone: she watches over everyone, sleeps very little, and works too much. She’s increasingly overwhelmed. One day, on impulse, María decides to abandon Agustín. The tightening grip of old age and the guilt of familial responsibility loom over this absorbing drama from rising director Rodrigo Plá. With an exacting gasp of the internal and external struggles María must endure, Plá explores the challenges of a timeless issue and society’s conflicted responses to life’s central questions. (Hamptons International Film Festival)",
      "similar": [],
      "original_title": "La demora",
      "runtime": 84,
      "poster_path": "/1z93pcoEDZRAxZHht5N5dkRRb3Q.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-06-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Uruguay",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Rodrigo Plá"],
      "runtime": 84,
      "synopsis": "A single mother with 3 kids working from home as a tailor for a big textile firm. She is left with taking care of her aging father and gets no support from her sister on this. The welfare societies turn down her request for taking in her father due to her not being below poverty line. One day while returning home with her father, at the spur of moment she abandons her father in a park bench after asking him to wait there while she gets water. Going home anonymously she calls an orphanage to have the old man picked up, but when they go the old man turns them down saying his daughter will certainly come back go get him. The kids keep asking where is Grandpa and feeling remorse she searches for him throughout the city through the night.",
      "writers": ["Laura Santullo"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1666318/",
      "coverLink": null,
      "actors": [
         "Néstor Guzzini",
         "Fernando Amaral",
         "Roxana Blanco"
      ],
      "reviews": [
         "Rodrigo Plá's third feature narrates the story about a single mother's struggle to support her three children and her elderly father who suffers increasing symptoms of Alzheimer's disease. The narrative grows steadily, slowly revealing a series of tense circumstances which make the protagonist, María, come to feel tired and desperate about her difficult struggles to take care of her household, her children and her father, all by herself. Then, after a failed attempt to intern her father at a rest house for elders and her sister's reluctance to help with the situation, her despair climaxes into an impulsive action: she abandons her father, leaving him out all alone on a public street. The gravity of the situation increases María's anxiety and leads her on an anguished quest to find him. But while her burdens seem hopeless, one might not think her behavior is justified enough. Her decision to find a resolution through an easy and uncaring way out only brings about worse consequences and more desperation at the climax of the film. For such a reason, I do not sympathize with her suffering towards the end. Marías own mistaken actions bring about her own detrimental consequences. Instead, one does sympathize with her father, Agustin, an old man who now lives with dying memories. This is a decent slice of life drama, probably influenced by European Cinema and similar styles. The stillness of its shots and passivity of its storytelling add to the narrative's dramatic buildup. Plá is still a very good director, concentrating on telling a dramatic story with engaging characters and tense atmospheres. 7 out of 10.",
         "Familial duty and sacrifice are fruitful grounds for dramatists, providing a rich vein of stock for analysis and psychology. This feature from Rodrigo Pla explores the tribulations of a single mother fighting to maintain composure and security for her family home, in a bleak essay on the consequence of desperate times calling for desperate measures. Maria (Roxana Blanco) works as a seamstress. She struggles to provide a home for her three children and her ill father, who is requiring more and more attention. Her salary does not offer adequate cover for this bustling household, with its demand of care and comfort. Seeking advice from the authorities for assistance in the care for her father, she is confronted with a dead-end. This forces her into making a tough decision, and the implications might break the family for once and for all. This is an austere drama, skirting away from the impulses of a mainstream melodrama, by keeping a distance from all of the protagonists, not least the mother. Pla does not make her an overly sympathetic figure. On the one hand, this heightens the realism (not everyone is postcard perfect), but it also requires some adjustment on behalf of the viewer to attempt to process the thought patterns running through the mind of this daughter. The bumpy and emotionally removed start paves way for a stronger second half, that leads to a gripping finale. The father, Agustin (played by Carlos Vallarino), oozes vulnerability and expertly encapsulates the innocent confusion caused by dementia. Although not perfect, this film prompts discussion, and that is one of the beauties of cinema. It is disappointing that the first half does not match the second, but it is an interesting picture and worth seeking out. for more film reviews: toomuchnoiseblog.com and www.huffingtonpost.com/greg-wetherall"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Malbicho Cine",
         "Lulu Producciones",
         "Memento Films Production"
      ],
      "summaries": ["A middle-aged, single mother of three cares for her eighty year old father, and they are pushed to the breaking point."],
      "budget": 1400000
   },
   "movielensId": 122599,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-06-01",
      "dvdReleaseDate": null,
      "directors": ["Rodrigo Plá"],
      "runtime": 84,
      "movieId": 122599,
      "title": "The Delay",
      "mpaa": null,
      "actors": [
         "Roxana Blanco",
         "Carlos Vallarino",
         "Oscar Pernas",
         "Cecilia Baranda",
         "Thiago Segovia",
         "Facundo Segovia"
      ],
      "imdbMovieId": "1666318",
      "originalTitle": "La demora",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Agustín forgets things; he is aging and he knows it. María is never alone: she watches over everyone, sleeps very little, and works too much. She’s increasingly overwhelmed. One day, on impulse, María decides to abandon Agustín. The tightening grip of old age and the guilt of familial responsibility loom over this absorbing drama from rising director Rodrigo Plá. With an exacting gasp of the internal and external struggles María must endure, Plá explores the challenges of a timeless issue and society’s conflicted responses to life’s central questions. (Hamptons International Film Festival)",
      "tmdbMovieId": 133491,
      "avgRating": 3.5,
      "releaseYear": "2012",
      "numRatings": 1,
      "posterPath": "/1z93pcoEDZRAxZHht5N5dkRRb3Q.jpg"
   }
}