{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2207778",
      "video": false,
      "title": "The Underneath",
      "recommendations": [
         171045,
         100024
      ],
      "backdrop_path": "/4mcIgKmHMjNbfntsV9S59EEvrWn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wayne",
               "gender": 2,
               "credit_id": "52fe4f11c3a36847f82bb1a3",
               "name": "Holt Boggs",
               "profile_path": "/A0NyClAmSd7rsPJjHVQ0cWDKcpW.jpg",
               "id": 963313,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Climber",
               "gender": 2,
               "credit_id": "534ac9400e0a2640c80020b1",
               "name": "Bryan Chatlien",
               "profile_path": "/6zharYPl6bW1B1pEPcokVRsNaEY.jpg",
               "id": 1309682,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kendall",
               "gender": 0,
               "credit_id": "534ac94f0e0a2640bc001ce8",
               "name": "Larry Jack Dotson",
               "profile_path": "/nHdugQPPN77zzffkNdwjdbkv4aP.jpg",
               "id": 1094672,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Creature",
               "gender": 1,
               "credit_id": "534ac96a0e0a2629dd000d7e",
               "name": "Ashlynn Ross",
               "profile_path": "/el0GQUjIe6r4MnegmkvFKVQoohR.jpg",
               "id": 978996,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jessie",
               "gender": 1,
               "credit_id": "534ac9790e0a2640cb0020b6",
               "name": "Natalie Makenna",
               "profile_path": "/n6sBEBLPngFwQSHqYuEwR2EmyYc.jpg",
               "id": 1106543,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Young Creature",
               "gender": 1,
               "credit_id": "57043872c3a3686989000cc9",
               "name": "Rebekah Kennedy",
               "profile_path": "/4s42w82j6SKUcR9mNR85DH5QaZc.jpg",
               "id": 143549,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4f11c3a36847f82bb1a9",
               "name": "Brian T. Jaynes",
               "profile_path": null,
               "id": 936425,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "534ac98d0e0a2640bc001ceb",
               "name": "David Wilson",
               "profile_path": null,
               "id": 199199,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54e89f9b9251412eb1001ec0",
               "name": "Frederic Doss",
               "profile_path": "/nOZmclIokEu23scnGvzKNNNxI7d.jpg",
               "id": 209680,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "54e8a18ac3a36836ea002051",
               "name": "Brian T. Jaynes",
               "profile_path": null,
               "id": 936425,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.614746,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 246218,
      "vote_count": 3,
      "budget": 0,
      "overview": "A young newlywed couple find themselves trapped in a network of underground caves. With her husband injured, the new bride is forced to find her way back to the surface in order to save his life. In the process, they discover a terrifying truth about the \"underneath\", they are not alone. Something evil is hunting them.",
      "similar": [],
      "original_title": "The Underneath",
      "runtime": 88,
      "poster_path": "/gIzDaBtHXpoKCXw6vcz9mDbhlPD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Monument Pictures",
         "id": 4199,
         "origin_country": ""
      }],
      "release_date": "2013-12-19",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Brian T. Jaynes"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["David Wilson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2207778/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI3MjI2NzQwMF5BMl5BanBnXkFtZTcwMTk2NDU4OQ@@._V1_SY317_CR13,0,214,317_AL_.jpg",
      "actors": ["Stars: Holt Boggs, Bryan Chatlien, Larry Jack Dotson | See full cast and crew »"],
      "reviews": [
         "Okay, so there are actors who can act and there are those whom you can SEE that they're really trying to act. This is one such case. The leading man, Holt, is one of the stiffest, woodenest (neologism), over acting, under actors I have ever seen. He might be used to stage acting where one must exaggerate the part so those in the back rows can see and hear, but in movies, one shouldn't do that. He apparently didn't get the memo. It ruined the flick for me, it could have been a good flick, but he shouldn't have been cast anywhere near this film. The leading girl was good. If you watch this film, try to fast forward through his lines and predictably the film will not lose an ounce of entertainment value, and will gain in the absence.",
         "SPOILER ALERT...this movie will make you want to stop watching TV and start reading books. Don't even bother watching this and wasting your time, just download the real deal movie DESCENT 1 and 2. Underneath is just a cheap a** version of the movie DESCENT which was one of the best horror movie i have watched. The final minutes, when you actually get to see the screaming ¨monsters¨ underneath is just CRAP. The only good thing about this movie is the main actress (HOT DAMN). Stop making this crap movies. They are just a waste of information space online.",
         "The Underneath, in general, storyline was interesting, different, but somehow almost identical in certain aspects. Actor's both played strong and believable, although i kept thinking i was watchin some prequel of the British Horror Movie 'The Descent'2005. called something like: The Descent: The Beginning- 'When Honeymoons Go Bad!! 2014 As above when i mentioned the Actor's it was not their fault that the script they were given, spoiled their chance to show their true potential. It lacked atmosphere and characters showed watch should have been, the viewers reaction immersed into the fear, terror, and suspense,the movie had captured..And instead turning into a film where, you have a lot of sudden moments throughout this movie and end up in moments where your, scratching your head thinking \" Eh? That last shot, showed the couple the first good look and a full frontal lit up vision 3 feet from their nose .. what the unknown creature looked like, Yes they looked a little shocked and ran into small tunnel, to safety .. to which , for me , Id be saying \"What... The..... HELL!! Was That!!????? .. but neither showed what should have been overwhelming reaction of terror that a human, who just experienced an up close and personal look into the face of what in one scene earlier in the film wife looking at her husband with a look of a disturbing ominous 6th sense and realising something was very wrong down in this cavern and almost in a whisper say to him \"SOMETHING IS DOWN HERE , WE ARE NOT ALONE!! \" The effects throughout this movie,created a good quality, and a truly believable environment, creature creations able to scare the average person. I rated a 5 because the only thing that had dampened the feel of the movie was the lack of passion and actual human behaviour of typical psychological reactions, if anyone had been placed and plunged into an environment to what us viewers saw for ourselves .. if I had been a victim of those circumstances i don't think i would effectively be in full logical state of mind, and showing my layed back approach ..of \" Oh not again, yawn\" mental state... excellent movie with lack of emotion and psychological atmosphere created from actors performance. So blame the script writer.. ..",
         "I must admit that about twenty minutes into this disaster I figured it couldn't't't get much worse and decided to stay with it...bad idea. I don't know why movies like this are made, because there can't be any profit involved. I don't know why anyone likes movies like this, since only the most ardent lover of this genre (is this trapped underneath stuff concept a genre?)couldn't't't find anything positive to take away from a viewing. No specifics are necessary, no spoilers here, this is just very, very bad stuff. I can't call it horror but I can call it horrible. You know how sometimes you run across small racks of movies in the oddest retail environments? Like you are at Ace Hardware, back near the hazardous solvent section, and you see titles like 'Hercules in Hell' or 'The march of the 20 foot Delbert' and you say to yourself 'hmmm, maybe, just maybe it has some hot actress in it' so you buy the thing, take it home and yes she is fine but no it just isn't worth it? Done that? OK, this is that kind of movie. My sincere regrets to all involved.",
         "\"The Underneath\" turned out to be a lot creepier than expected. What I thought was going to be a lame low budget horror flick turned out to be creepy as hell, giving me chills to see the creatures underground. This left images in my head that will come to mind the next time I am rock climbing or in the woods. I would not recommend watching this alone or before bed - you will not sleep! Actress Natalie Wilemon gave an excellent performance in this horror flick. She brought Jessie's character to life and adequately expressed the distress and desperation she was going through. Keep an eye out for this girl because she will be something big!",
         "This movie is a total waste of time .. all of it is pure darkness .. i felt like am listening to the movie not watching... story line is so weak and i strongly recommend you not to watch it at all . the movie is so boring , maybe the story would be better if they added another 30 minutes of darkness ... i hope they never try to produce another movie or any kind of videos . but , the actors did well .. the sound effects is good . Another thing , since the whole movie is only 70 minutes long , why did they waste 15 minutes in the beginning on romantic stuff between the two of them ? and the end is awful .. what happened to the girl ? dead or alive ? she killed 4 creatures .. could the last one kill her ?? Any way in the end , its the worst movie i have ever seen in my life and i wasted 70 minutes on it"
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Origin Cinema Group",
         "Monument Motion Picture Group",
         "Underneath Pictures"
      ],
      "summaries": ["A young newlywed couple find themselves trapped in a network of underground caves. With her husband injured, the new bride is forced to find her way back to the surface in order to save his life. In the process, they discover a terrifying truth about the \"underneath\", they are not alone. Something evil is hunting them."],
      "budget": 0
   },
   "movielensId": 122593,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-12-19",
      "dvdReleaseDate": null,
      "directors": ["Brian T. Jaynes"],
      "runtime": 88,
      "movieId": 122593,
      "title": "The Underneath",
      "mpaa": "R",
      "actors": [
         "Holt Boggs",
         "Bryan Chatlien",
         "Larry Jack Dotson",
         "Ashlynn Ross",
         "Natalie Makenna",
         "Rebekah Kennedy"
      ],
      "imdbMovieId": "2207778",
      "originalTitle": "The Underneath",
      "genres": [
         "Horror",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["NLcJUsofDhc"],
      "plotSummary": "A young newlywed couple find themselves trapped in a network of underground caves. With her husband injured, the new bride is forced to find her way back to the surface in order to save his life. In the process, they discover a terrifying truth about the \"underneath\", they are not alone. Something evil is hunting them.",
      "tmdbMovieId": 246218,
      "avgRating": 1.75,
      "releaseYear": "2013",
      "numRatings": 4,
      "posterPath": "/gIzDaBtHXpoKCXw6vcz9mDbhlPD.jpg"
   }
}