{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1083470",
      "video": false,
      "title": "The Rainbow Tribe",
      "recommendations": [],
      "backdrop_path": "/c1lrWyhU2NlMyUInCAKDkBy61ff.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "Morgan Roberts",
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3fe3",
               "name": "David James Elliott",
               "profile_path": "/lhURUaxfhpPdqKmIKiwsUsfMwd7.jpg",
               "id": 84522,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Calvin",
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3fe7",
               "name": "Grayson Russell",
               "profile_path": "/mgpxDDI7uqhdPgT0VoMSW28dh4y.jpg",
               "id": 111921,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Sunny",
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3feb",
               "name": "Ed Quinn",
               "profile_path": "/9FLoMLG0lAG7RlSwoKXjIdWMASG.jpg",
               "id": 53922,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Lauren",
               "gender": 1,
               "credit_id": "52fe46cac3a368484e0a3fef",
               "name": "Julie Ann Emery",
               "profile_path": "/dyJwK5JveLV4ydct8MmrFkn9PmF.jpg",
               "id": 55256,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Mrs. Murray",
               "gender": 1,
               "credit_id": "52fe46cac3a368484e0a3ff3",
               "name": "Rebecca Mader",
               "profile_path": "/p8lCaSxNjM8a7JuyiPH3zKnuWUx.jpg",
               "id": 54679,
               "order": 4
            },
            {
               "cast_id": 1007,
               "character": "Ryan",
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3ff7",
               "name": "Noah Munck",
               "profile_path": "/azP86nJZHgtpX2hNagzx8VVJSNT.jpg",
               "id": 221125,
               "order": 5
            },
            {
               "cast_id": 1008,
               "character": "Boo",
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3ffb",
               "name": "Max Burkholder",
               "profile_path": "/8tM61XfapNvBnXum2WcBKlmDDeE.jpg",
               "id": 81083,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3fd9",
               "name": "Christopher R. Watson",
               "profile_path": null,
               "id": 238636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46cac3a368484e0a3fdf",
               "name": "Daniel S. Frisch",
               "profile_path": null,
               "id": 238637,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.657707,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CZ",
            "name": "Czech Republic"
         }
      ],
      "id": 64130,
      "vote_count": 4,
      "budget": 0,
      "overview": "Morgan Roberts, a middle aged adult in crisis, reunites with his best friend when he returns to the summer camp of his youth. His troubles seem to magnify when he is joined by a rag-tag group of 10 year old campers. Through their struggles they collectively overcome their personal problems and exchange them for one of the best summers of their lives. is.",
      "similar": [],
      "original_title": "The Rainbow Tribe",
      "runtime": 90,
      "poster_path": "/9Wla3XCNCPkpaIVFRuw1zSGjlu3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "International Production Company",
         "id": 1507,
         "origin_country": ""
      }],
      "release_date": "2011-02-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Czech Republic",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Christopher R. Watson"],
      "runtime": 90,
      "synopsis": "Morgan Roberts, a man with brain cancer, decides to go back to be a counselor at his old summer camp, where he learns that sometimes miracles can happen to those who believe.",
      "writers": ["Daniel Frisch"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1083470/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE4MzA5NDc5Nl5BMl5BanBnXkFtZTcwNDYyMzEwMw@@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "David James Elliott",
         "Grayson Russell",
         "Ed Quinn"
      ],
      "reviews": [
         "I definitely recommend this movie for your whole family. While the whole summer camp troubled youth bit has been done 100 times, this is a great one that will put a smile on your face and take you back to a summer in your childhood when you went to camp and grew as a young man or woman and got the first taste of being away from home. I'm not going to even comment on the technicalities of movie making, because they don't matter one bit. The only thing that matters is that you smile, laugh, and even maybe tear up just a bit watching this movie. Grab your kids, make some popcorn, and just relax and enjoy this cool movie.",
         "Full disclosure, I totally thought this film was going to be the quintessential loser camp vs. jock camp flick that has been done a hundred times before. While many familiar elements are there, the story stands on its own as a tale of one man overcoming his own fears and seeding positive change amongst a group of rag-tag misfits\u0085 wait a second\u0085 okay, yeah, maybe it was closer to my original guess than I had previously thought. Regardless, the Rainbow Tribe was an enjoyable family comedy I would recommend you watch if you have 90 minutes to kill (with family) and don't mind being shamelessly manipulated from laughter to tears. The plot for the Rainbow Tribe is campy at best (no pun intended), yet it works to simply set the stage for the viewer to autopilot into the film. Troubled counselor + troubled kids + summer camp = hilarious situational comedy! Because it isn't necessary to spend a whole lot of time setting up the plot of the film, more time can be spent enjoying sight gags, childish antics, and subtle adult humor. While the characters of the Rainbow Tribe are presented rather \"cookie cutter-esk,\" they are given enough fluff to make them more than just two-dimensional carbon copies of summer camp-goers of yore. Since the aforementioned plot requires little heavy lifting, more time was spent in the movie seeding character tidbits which eventually came to fruition either in the form of laughter, tears or both. The acting for this movie was somewhat mixed. However, I feel it only fair to address the adult actors and child actors separately. To begin with, David James Elliot (whom my mother loves from JAG) provided a lot of heart to this film and, arguably, puts up with a lot of punishment from its production. His ability to maintain a serious undertone to his otherwise lighthearted acting helps bring his character (internal struggles and all) to life. He plays off of the supporting cast very well, especially the child actors whom he is constantly surrounded by and appears to have a genuine bond with. Ed Quinn and Julie Ann Emery play the sort of supporting cast that is strong in all the right places. Very rarely are you going to find child actors who can act in a family comedy without them seeming a little cheesy or scripted. No offense, but typically the scarily amazing method acting child genius prodigies reserve their talent for more\u0085 *cough* \"serious\" roles than this film provided. That being said, I felt the talent pool of child actors in this film had some real depth to it. Special mention needs to be made to Grayson Russell and Max Burkholder. Russell, reprising a role eerily familiar to Texas Ranger from Talladega Nights (albeit less hostile), has a good sense of comedic timing and a colorful presence on camera. Burkholder, to his credit, manages to nonverbally communicate a surprising range of emotions and quietly creeps his way into your heart (where he snuggles for the rest of the movie). From a technical standpoint, the movie has a few bugs. A couple of the mid and far away stunts appear cluttered, while a few of the more close up stunts look like they actually brought physical harm to one or more of the actors. The inconsistency is forgivable, however, because the overall tone of the film leads it to focus less on the serious and more on the humorous. The musical arrangement was nothing special, but it wasn't distracting either. In closing, if you are looking for an explosion ridden action adventure blockbuster or a deeply layered mind-freak... don't watch this film. If you want a feel-good movie that doesn't compromise the film's characters by completely subverting their initial core character quirks and instead embraces the idea you can change your behavior without changing who you are, give this one a go. I promise, you will either love it, hate it, or something in-between. Score 8 out of 10. If this film was a sub-sandwich, it would be untoasted and filling but with a few dry bites.",
         "This is one of the most realistic camp movies. There are two basic stories. A 40 year old man who recently had a heart attack decides to be a counselor at his old sleep-away camp to bring back his childhood memories. He is put in the cabin with the most difficult kids, who are all just misunderstood. \"Chief\" as he likes to be called, never gives up and is able to connect with all of the kids and by the end of the movie makes them all better people. The other story revolves around Calvin, a ten year old boy who is always getting into trouble (played by Grayson Russell). At the beginning of the movie he is seen bullying his little brother and playing a trick on his bus driver. It his clear that he is undervalued by his parents and his school, which might be why he acts out. When he is forced to attend camp he learns to make friends and trust others and the harsh consequences of pulling pranks. He finally feels like someone understands him after he connects with Chief. The other campers in the cabin include Ryan (fat kid with anger issues), Charles (spoiled rich kid), Boo (silent kid), Josh (nerd), and Sampson (the other kid). As someone who attended camp for many years, I can say that these are all realistic camp stereotypes. My favorite character was Ryan (played by Noah Munck). His character seemed so real. At first he seems violent and angry at the world, but he turns out to be really sweet and forms a bromance with Charles, the rich kid. It is amazing how many great child actors they could get for this movie.",
         "It was a great movie! The kids made me want to have them all in my life! I don't know if I would have been as patient as the Chief, but I would have welcomed them all :D I have to add more lines for this to be printed so I will tell you that I did cry. I guess great movies need to have some hardship in order to see the great part of it. But the interactions alone with the kids made it a great movie for me. When I searched for the movies in Netflix it came up in the goofy category. This was one listed and I am so glad I watched it. Sometimes it is good to cry for happy. I would love for there to be a sequel that shows how the kids are doing in the future. I really would love to see what happens to one of the kids. I don't want to put a spoiler here so let me just say that I hoped that the chief would adopt him."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": ["International Production Company"],
      "summaries": [
         "Morgan Roberts, a middle aged adult in crisis, reunites with his best friend when he returns to the summer camp of his youth. His troubles seem to magnify when he is joined by a rag-tag group of 10 year old campers. Through their struggles they collectively overcome their personal problems and exchange them for one of the best summers of their lives.",
         "Six rat bag kids on summer camp in Northern Minnesota discover their beloved camp councilor 'Chief' has a life threatening secret...",
         "A rag-tag group of children at a sleep away camp help their counselor overcome a personal crisis."
      ],
      "budget": 5000000
   },
   "movielensId": 122651,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-02-01",
      "dvdReleaseDate": null,
      "directors": ["Christopher R. Watson"],
      "runtime": 90,
      "movieId": 122651,
      "title": "The Rainbow Tribe",
      "mpaa": "",
      "actors": [
         "David James Elliott",
         "Grayson Russell",
         "Ed Quinn",
         "Julie Ann Emery",
         "Rebecca Mader",
         "Noah Munck",
         "Max Burkholder"
      ],
      "imdbMovieId": "1083470",
      "originalTitle": "The Rainbow Tribe",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["Uv8PLGvr4kM"],
      "plotSummary": "Morgan Roberts, a middle aged adult in crisis, reunites with his best friend when he returns to the summer camp of his youth. His troubles seem to magnify when he is joined by a rag-tag group of 10 year old campers. Through their struggles they collectively overcome their personal problems and exchange them for one of the best summers of their lives. is.",
      "tmdbMovieId": 64130,
      "avgRating": 3.75,
      "releaseYear": "2011",
      "numRatings": 2,
      "posterPath": "/9Wla3XCNCPkpaIVFRuw1zSGjlu3.jpg"
   }
}