{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "painting",
            "id": 5918
         },
         {
            "name": "tahiti",
            "id": 6611
         }
      ],
      "imdb_id": "tt0035078",
      "video": false,
      "title": "The Moon and Sixpence",
      "recommendations": [
         109881,
         26533,
         89551,
         23283,
         29477,
         38395,
         52362,
         108843,
         3010,
         46531,
         26701,
         160660,
         14689,
         62655,
         78315,
         43514
      ],
      "backdrop_path": "/kJfcyda5FYMejarxFUJXy2pzLhJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Charles Strickland",
               "gender": 2,
               "credit_id": "52fe48efc3a36847f818158f",
               "name": "George Sanders",
               "profile_path": "/6fvK8vUTgSMRvuw77PjjuIOMl6.jpg",
               "id": 3361,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Geoffrey Wolfe",
               "gender": 2,
               "credit_id": "52fe48efc3a36847f8181593",
               "name": "Herbert Marshall",
               "profile_path": "/jLi1edH2FEV3Hrmoa3j7QwYcaDx.jpg",
               "id": 2435,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Blanche Stroeve",
               "gender": 1,
               "credit_id": "52fe48efc3a36847f8181597",
               "name": "Doris Dudley",
               "profile_path": "/fBd4mR0KRyZWzdUmK7GMJJpmood.jpg",
               "id": 290159,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Capt. Nichols",
               "gender": 0,
               "credit_id": "52fe48efc3a36847f81815a7",
               "name": "Eric Blore",
               "profile_path": "/t4W3lDUxEkrfFG9AEFHhmAhjPFy.jpg",
               "id": 30184,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dr. Coutras",
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815ab",
               "name": "Albert Bassermann",
               "profile_path": "/79zxWdvhb2KWhMG6GwChyEqi1R0.jpg",
               "id": 29137,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tiare Johnson",
               "gender": 1,
               "credit_id": "52fe48efc3a36847f81815af",
               "name": "Florence Bates",
               "profile_path": "/88b2ljcVKqcIiInibVvQWriXRLP.jpg",
               "id": 3367,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dirk Stroeve",
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815b3",
               "name": "Steven Geray",
               "profile_path": "/bYHgnE8wv3zXhMoZAAmZjNes7in.jpg",
               "id": 30847,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Ata",
               "gender": 1,
               "credit_id": "52fe48efc3a36847f81815b7",
               "name": "Elena Verdugo",
               "profile_path": "/2ns730pMfIjD4puazYPT6X1rPmq.jpg",
               "id": 133788,
               "order": 7
            },
            {
               "cast_id": 31,
               "character": "The Leper (uncredited)",
               "gender": 2,
               "credit_id": "555e8cd69251417e5f00137c",
               "name": "Rondo Hatton",
               "profile_path": "/zir0SuHwhFb2Sj7feQgIeMecG8m.jpg",
               "id": 931198,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48efc3a36847f818158b",
               "name": "Albert Lewin",
               "profile_path": "/sj4EQdm5Fz1ebgGSUM27fr2nZBU.jpg",
               "id": 30252,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48efc3a36847f818159d",
               "name": "David L. Loew",
               "profile_path": null,
               "id": 1021591,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815a3",
               "name": "W. Somerset Maugham",
               "profile_path": "/mseHL0TUkLcRXds5Pwjmbec8hyt.jpg",
               "id": 27916,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815bd",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815c3",
               "name": "John F. Seitz",
               "profile_path": "/6hvivkKP5H5NpPcAViAfUMFgqsu.jpg",
               "id": 8620,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815c9",
               "name": "Frank Paul Sylos",
               "profile_path": null,
               "id": 118254,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe48efc3a36847f81815cf",
               "name": "Ray Heinz",
               "profile_path": null,
               "id": 1021592,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "52fe48efc3a36847f81815d5",
               "name": "Ferrol Redd",
               "profile_path": null,
               "id": 106014,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "52fe48efc3a36847f81815e1",
               "name": "Albert Deano",
               "profile_path": null,
               "id": 1021594,
               "department": "Costume & Make-Up",
               "job": "Other"
            },
            {
               "gender": 0,
               "credit_id": "52fe48efc3a36847f81815e7",
               "name": "Richard L. Van Enger",
               "profile_path": null,
               "id": 120518,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f0c3a36847f81815ed",
               "name": "Nina Saemundsson",
               "profile_path": null,
               "id": 1021595,
               "department": "Art",
               "job": "Sculptor"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f0c3a36847f81815f3",
               "name": "Dolya Goutman",
               "profile_path": null,
               "id": 1021596,
               "department": "Art",
               "job": "Other"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f0c3a36847f81815f9",
               "name": "Barbara Gray",
               "profile_path": null,
               "id": 1021597,
               "department": "Writing",
               "job": "Other"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f0c3a36847f81815ff",
               "name": "Devi Dja",
               "profile_path": null,
               "id": 1021598,
               "department": "Crew",
               "job": "Other"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f0c3a36847f8181605",
               "name": "Stanley Kramer",
               "profile_path": "/5kE8vJSdtX9OJvWngNWZ5imrhdv.jpg",
               "id": 4081,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f0c3a36847f818160b",
               "name": "Albert Lewin",
               "profile_path": "/sj4EQdm5Fz1ebgGSUM27fr2nZBU.jpg",
               "id": 30252,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f0c3a36847f8181611",
               "name": "Gordon Wiles",
               "profile_path": null,
               "id": 94166,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f0c3a36847f8181617",
               "name": "George Hively",
               "profile_path": null,
               "id": 1182098,
               "department": "Editing",
               "job": "Supervising Film Editor"
            },
            {
               "gender": 2,
               "credit_id": "57bc9e1ac3a368227c0088c1",
               "name": "Ern Westmore",
               "profile_path": null,
               "id": 1249179,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "555cb5ffc3a3682d8200163a",
               "name": "Albert Lewin",
               "profile_path": "/sj4EQdm5Fz1ebgGSUM27fr2nZBU.jpg",
               "id": 30252,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.303635,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 56146,
      "vote_count": 4,
      "budget": 401000,
      "overview": "Loosely inspired from Gauguin's life, the story of Charles Strickland, a middle-aged stockbrocker who abandons his middle-classed life, his family, his duties to start painting, what he has always wanted to do. He is from now on a awful human being, wholly devoted to his ideal: beauty.",
      "similar": [
         306819,
         509885,
         1281,
         12627,
         19899,
         12159,
         40807,
         269795,
         913,
         152742,
         120467,
         340666,
         258230,
         263472,
         5876,
         37724,
         9292,
         426,
         59436,
         339877
      ],
      "original_title": "The Moon and Sixpence",
      "runtime": 89,
      "poster_path": "/qCX3M0x47Mkb2g0QRCxxcxqdlsi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "David L. Loew-Albert Lewin",
         "id": 17139,
         "origin_country": ""
      }],
      "release_date": "1942-10-27",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Strange DREAMS - He had ideas he never told her about...He didn't dare!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Albert Lewin"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "W. Somerset Maugham",
         "Albert Lewin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0035078/",
      "coverLink": null,
      "actors": [
         "George Sanders",
         "Herbert Marshall",
         "Doris Dudley"
      ],
      "reviews": [
         "While the beginning of this film is a bit slow, with a few touches of humour sitting a bit uncomfortably, soon we are treated to a simple but effective treatment of this extraordinary story. As the Gauguin-like painter Charles Strickland, Sanders actually does a bit more than play his 'typical cad', but relishes his character's poking fun at a hypocritical society, and shows real passion in describing to the Maugham-like figure exactly WHY he leaves his ordinary London existence. We absolutely believe him when he insists \"I HAVE to paint\". Wisely, the director doesn't let us see any of Strickland's canvases, and we are only limited by our own imaginations as to how powerful they must be. The only exception comes at the end, and without spoiling anything, I believe that it's handled extremely well. Other performances are a delight, particularly in the entertaining vignettes of turn-of-the-century Tahitian life.",
         "A creator of such intellect as Albert Lewin, the director/adapter of The Moon & Sixpence, rarely had the opportunity in classic period Hollywood to showcase such a unique talent as he had and we are fortunate to have had him. There were only a handful like him that beat the odds and actually were allowed to produce true art instead of common trash -- Sternberg, Ulmer, Sturges come to mind -- and in many ways Lewin stood apart because he worked the system without challenging the former tailors and junk dealers that ran Hollywood. He made a quartet of films that express his unique style magnificently. These are, in order: The Moon & Sixpence, The Picture of Dorian Gray, The Private Affairs of Bel Ami and Pandora And The Flying Dutchman. The common threads are stateliness, pacing and intelligence, with literate dialogue that has a sophistication that belies the commercialism of the time. His lead of choice was George Sanders, who was perfectly cast in the first three titles as a symbol of an age. The Moon and Sixpence is the first of this quartet and showcases what a small budget but superior talent can create. Each film was an improvement on its predecessor, and I recommend that those out there interested in stylized film follow Lewin's work chronologically to observe the course of aesthetic refinement, beginning with The Moon & Sixpence.",
         "This film is a good one to add to MOULIN ROUGE, LUST FOR LIFE (especially LUST FOR LIFE), THE NAKED MAJA, and THE AGONY AND THE ECSTASY, as one of the few to tackle the great artist struggling to perfect his art (interestingly none of the films look at female artists, such as Rosa Bonheur or Mary Cassatt). In this case it is based on a novel by W. Somerset Maugham of the same title as the film. The novel is different. To begin with, Maugham is clever enough to add little touches to the story that suggest it is a biography, not a novel. For example, he includes footnotes to non-existent literary studies on the works of Charles Strickland. I did not think that anyone did that sort of thing except the \"Devil's Lexicographer\" Ambrose Bierce. But the basics of the story are the same: Charles Strickland is a middle class stock broker, living in apparent Victorian respectability with his wife and children. Then, without warning, he deserts his wife and becomes totally bohemian, and when confronted by her and her family he repudiates their middle class morality and insists he wants to paint, and only paint - he is not interested in stocks and bonds. Throughout the rest of the movie we see Strickland use and drop people like old laundry. He is a detestable cad (and is played by moviedom's most detestable/fascinating cad, George Sanders). But he is a painter of genius. And we watch as he moves from London to the continent to the South Seas for the stunning conclusion of the film. Yes it is based in part on the career of Paul Gaughin (whom we last saw as Anthony Quinn in LUST FOR LIFE, shrugging off that nut he was living with in Arles who mutilated his ear lobe). But Maugham apparently also included some details with a less recalled artist who was a friend of his, Sir Augustus Johns. Johns too had a bad reputation of using friends, and was also determined to be free to paint (I suspect Joyce Carey may have had him in mind too for Gully Jimson in THE HORSE'S MOUTH). The business of Strickland going to the South Seas is pure Gaughin, although not the final chapter of Strickland's last masterpiece. That is pure invention. I remember when I saw this film back in the 1970s the conclusion was one of the versions that showed Strickland's final work in color, and it is basically Gaughin's work or style. It is a breathtaking moment of artistic splendor (sorry if I am being a bit explosive, but you'd have to see it to understand). And given the circumstances of the artist when it was achieved, and the ironic conclusion to the story, the effect does knock the viewer for a loop. Sanders gave his best to the role, never apologizing for his using people. Herbert Marshall is okay as Somerset Maugham, but his role is relatively simple and drab, as a type of narrator. Best in support is Steven Geray, that always reliable supporting player who all too infrequently was not used enough (see him in GILDA or THE MASK OF DEMETRIOS to see him when he had a well written role). Here he is a man who finds that Sanders stole his woman and his happiness from him, but when the woman dies after Sanders deserts her, Geray visits Sanders and says he forgives him (getting a sneer back from Sanders as his reward). As I said it is a very fine film.",
         "I will not attempt to write a \"complete\" review of this movie. Just note a couple of highlights. I recently saw this movie for the first time on TCM. It is one of the most \"startling\" and highly original movies I have seen from that era of filmmaking. Almost never does a movie affect me emotionally--not only as I saw it but even a couple of weeks later I am still affected by it. Among the many things that are so powerful is the relentless negativity of the George Sanders' character throughout. And yet he makes us feel he is on a mission to be true to himself and to fulfill his destiny without apology. To combine these elements in one character is something I have never seen in any movie. It left me confused emotionally and yet felt admiringly of someone who can eschew all human concern for others(with one exception which I will not spoil) to relentlessly pursue what he perceives as his truth and destiny. It is a brilliant achievement in George Sanders' acting and for the directors' unapologetic vision of the movie. I have to be careful not to spoil, but among many amazing surprises is how another artists' wife(Blanche Stroeve played by Doris Dudley whom I knew in real life) reacts to Sanders after she, at her husband's insistence, nurses him back to health. It is an amazing scene. Yet somehow we understand that Sander's purpose is so well-defined and his masculinity is so caveman-like that she cannot help but respond to him. Definitely not politically correct. I cannot imagine a scene like this even being allowed to be shot in this way in any modern movie. Speaking of political correctness, other surprises abound in this area particularly during the time the Sanders character moves to Tahiti. Not to spoil but listen closely as a certain older woman who interacts with Sanders describe her long ago love affairs and the character of the men she was involved with. If any woman was to pine for love affairs like she describes in today's world, she would be denounced by every women's group on the planet. And yet she pines for those days with infectious gusto and enthusiasm. A movie shot like this today would set women back a couple of hundred years. It could not be remade today and still retain all the wild political incorrectness. Protests and boycotts would stop the movie from being made if word got out of it's script's contents. A great, emotionally draining, disturbing and thoroughly unique movie that will always stand alone and cannot be remade without huge rewrites. One brief note of interest. One of the female leads, Doris Dudley, lived about a quarter mile from me in the early 1980's. The location was a little community called Jacobia, Tx. Her obituary says Greenville, Tx. which is also correct. She invited me and my parents to some kind of little get together at her modest country home. She was outgoing, friendly and yet had a powerful energy to her that somehow made me understand why she was an actress. She told me she was in the movies many years ago and her movie/stage name was Doris Dudley. She originally introduced herself as Doris Jenkins. She mentioned that she knew Cary Grant. She may have said she worked with him but I'm not sure. She was in her mid 60's and long since retired from being an actress by the time I met her. She loved her dogs. And shortly after I met her she learned she had terminal cancer and died shortly thereafter. When I asked her about it, I was struck by how unafraid she was of dying. I brought her a little newspaper article about someone beating cancer I thought might cheer her up. But she did not need any help. Her courage in facing death infused me with courage. I shall never forget her. There is only one biography of her I can find on the internet. She was a lovely, dynamic woman. She was terrific in this movie. I miss visiting with her.",
         "Fair adaptation of W. Somerset Maugham's novel, loosely based on the story of artist Paul Gauguin, concerns a 40-year-old stockbroker in London, anti-social and misogynistic, who leaves his wife and children for life as a painter in Paris; soon, he's ruined more lives, and just as swiftly moved on to Tahiti, brushes and canvas intact. For an episodic tale of an inscrutable artist who destroys everyone he touches, this literate, well-cast and well-made film starts out in a surprisingly light key. Herbert Marshall is the curious writer (and the film's narrator) who befriends the maddeningly aloof George Sanders, and the first half of the picture is quite strong. However, once the action turns to the islands (with handsomely tinted black-and-white photography), interest in the central character wanes. The finale isn't as gripping as it should have been, though this is no reflection on Sanders or Marshall, both excellent. ** from ****",
         "The story alone is worth viewing. The very idea of a person abandoning their family in order to follow one's dream, is compelling enough. George Sander's performance as well as Herbert Marshall as Somerset Maughm are both fist rate. No one could have done a finer job at playing the tortured cad then Sanders. If they had another one of those silly top 100 lists, this one for best type casting in a film about cads, then Sanders would win in a trot. He was in real life it appears, the very cad that he played so convincingly on screen. A book was even written about him by an actor friend, Brian Ahearne. The title of the book is \"A Dreadful Man\". The actor Ronald Coleman would not even allow Sanders in his presence, as he found his disdain and pessimism to much to bear. At the age of 65 Sanders committed suicide in a Paris hotel room just as he had promised actor David Niven years earlier, claiming that by that time he would no longer have interest in women or anything else. (Consult Niven's book \"Bring On The Empty Horses\") I can understand one user's previous comment about this being Sanders only great role. But Mr. Sanders won an Oscar for playing another cad, the rascal theater critic in \"All About Eve\". One of my favorite lines in that movie is when he replies to a very beautiful young starlet(Marilyn Monroe) who he has accompanied to a dinner party saying \"You have a point. An idiotic one, but a point none the less\".",
         "George Sanders goes Gaughin in this film based on the Somerset Maugham novel about a well respected man who decides to drop out of society and paint to his hearts delight. Leaving a wife and children behind in England he first moves to Paris where he is befriended by a kindly successful hack painter who in return is re payed with ridicule and cuckoldry. George Strickland's dream is to get to Tahiti though and be done with Western society. He eventually does but at great final cost. Sanders is perfectly cast as the insensitive and coldly indifferent Strickland who really just wants to be left alone. He asks for nothing but exploits kindness to its fullest when forced upon him, especially by the artist Stroeve. In a leading man of the era's hand the role would more than likely have been diluted and suffered but with Sanders you get a bored condescension and disdainful inflection like no other. Unfortunately the rest of Sixpence lags a good distance behind Sander's spot on performance. Director Albert Lewin employs very little scope and camera movement with little attention payed to set design and lighting. The sepia tint of the film washes out in some scenes and was more than likely employed by Lewin to display Strickland's magnum opus at the end but even this disappoints. Herbert Marshall is dry and drab as the narrator and the rest of the cast flat and stiff. Combined they lack the life and conviction to be found in Sander's performance which might have even soared further had Lewin applied the expressionistic flourishes to be found in his The Picture of Dorian Gray a far more successful picture with a less secure actor.",
         "If what you are looking for is a standard film story about a painter, look elsewhere. This is a strange story and a strange movie. But don't take that as criticism. I found it very compelling. They say that the story was about Gauguin...and if so, then I can't say he was a very admirable fellow. Here \"he's\" Charles Strickland, a middle-aged businessman who abandons his wife and children so he can paint in Paris. His tale is told through the eyes of Herbert Marshall. Could there be a worse human being than George Sanders as Charles Strickland. Virtually no redeeming qualities...at least until he gets married to a girl in the South Pacific. Of course, life always pays one back, and Strickland declines into leprosy. The cast here is intriguing. This is one of the best -- though not likable -- performances given by George Sanders. Herbert Marshall is perfect as the eyes of the story (watch for scenes where he is walking...you can notice a limp due his real artificial leg). Elena Verdugo is interesting as the South Seas girl...you may remember her best from her recurring role in \"Marcus Welby, M.D.\" Florence Bates (usually the nagging mother-in-law type) has, perhaps, the most unusual role of her career. Albert Bassermann, as the South Seas doctor, is interesting, though I'm not sure he was any great actor. But his career story is something worth looking up on Wikipedia. I guess we should thank the George Eastman House for restoring this film, although I'm not sure if the nitrate copies were so badly decomposed to explain the relatively poor quality of the print (as shown on TCM), or whether they just did a poor job of restoration. The images are not crisp, and the color scenes in Tahiti are terribly deteriorated. Nevertheless, this is a film to watch. It's unusual and intriguing.",
         "There have been few other actors, before or since, who could play the part of a cad better than George Sanders, and he was at his best in this film. Nothing will ever alter the fact that he gave a very fine performance in a film which any movie-goer is likely to find rewarding, and I recommend it to any IMDb users who happen to have so far not seen it. It is based on a great fictional work by Somerset Maugham that is clearly and openly acknowledged to be a non-biographic fictional reconstruction of the life of the artist Paul Gauguin who walked out on his wife, family and friends in Paris to spend the last days of his life in a wild painting spree in Tahiti - so poor that many of his final works were painted on the walls of his hut because he could not afford to buy more canvasses. Similarly Maugham's artist, named Charles Strickland, was a well to do Englishman, and the book starts by picturing the build up of frustrations he found in his very conventional life there. He eventually walked out of it to spend many years of penurious and bohemian living as an artist in Paris before his culminating mad dash to the South Seas finally provided a sense of release and freedom through the copious colours and lifestyle changes he found in his final destination. It is a book I first read as a boy and have always loved, but it is a long time since I last read it so I should now download or purchase another copy. This said, my expectations exceeded what this film provided. The film of this book appeared during the war in 1943 - a time when many of us were experiencing symptoms of escapism. It can perhaps best be described as having achieved modest success. For many years I did not want to spoil my fading memories of Maugham's great book by watching another version presented on celluloid - many others may have felt the same. But I vividly remembered reading a review of it which described the tremendous visual impact it achieved when the black and white images associated with Strickland's drab life in Europe finally gave way to the riotous colours he found in Tahiti. I immediately felt that here was a perfect example of how monochrome and colour sequences could be integrated into the same film to increase its emotional impact. By then early home videos of this film had been released entirely in monochrome, this seemed to me to miss the whole point of filming the book so I never bought one. A DVD claiming to present the complete cinema version of the film as it had been originally screened, finally appeared in 2007. I bought it with great expectations and waited with breathless excitement to see the transition to colour when Strickland reached Tahihi. Unfortunatelty the report on which I based this expectation proved a little misleading - only the almost final sequence was in colour, and this showed only the paintings Strickland had completed on the walls of his hut before his death, not the third or so of the story which took place on the island. I still enjoyed the film and this relatively small difference should not affect any viewers coming to it with no prior expectations, but for me it was not the film I had been waiting to see for so many years. I believe a great opportunity was missed here for creating a visual impact that would perfectly compliment the emotional impact experienced by Strickland when he changed his lifestyle. Whilst I still have no hesitation in recommending this DVD to IMDb users who are interested in art, this has been one of the extremely few occasions where I felt that I would like to see a film remade. True today's directors would probably film the European sequences in muted colour with a heavy sepia over-wash rather than in black & white, but with enhanced colouring used for Tahiti the overall effect would be the same. Sadly such a future film could not star George Sanders, but maybe Michael Douglas would step in here.",
         "Herbert Marshall plays W. Somerset Maugham in fact if not name in The Moon And Sixpence as he narrates the story of how his life intersected with that of George Sanders a man who left middle class respectability to do his thing with painting, first in Paris and then the South Seas. Marshall is his erudite best and Sanders once again is a cad. When Marshall first knows Sanders he's the soul of Victorian rectitude, no one suspecting what is beneath the surface. So when one fine day he up and leaves his wife Molly Lamont to go live the Bohemian life as a painter in Paris it shocks everybody. In fact Lamont prevails on Marshall to go to Paris to see what brought this about. Somerget Maugham's view on human relations and the creative soul are once again given an airing in The Moon And Sixpence. Maugham was a gay man, but there are certain gay men who truly do not like women on most levels. They make too many demands on the creative man, fascinated though they might be by him. That view is in full force when dealing with Lamont and with Doris Dudley who plays a married woman who leaves her husband Steven Geray to take up with Sanders in Paris. His ideal woman is Tahitian Elena Verdugo, pretty and sexy without too much education who takes care of man's physical needs with no demands. Women were not Maugham's favorites. You can see that in work like Of Human Bondage with Mildred Rogers or in Rain with Sadie Thompson. And I can't forget The Razor's Edge and the part that Gene Tierney plays. Sanders is a caddish as he ever has gotten on the big screen for the first two thirds of the film. But in Tahiti with no demands on him he becomes a mensch. For myself staying a mensch when life does make demands on you is the true test. But what do I know? The Moon And Sixpence is Maugham at his misanthropic best. Sanders and Marshall top a fine cast in a film that could have been a real classic with a bigger budget from an A list studio. Herbert Marshall would be the narrator author W. Somerset Maugham again in The Razor's Edge which is a better film. This one in fact did get an Oscar nomination for Dimitri Tiomkin's musical scoring. The Moon And Sixpence can definitely hold its own.",
         "George Sanders stars in \"The Moon and Sixpence,\" a 1942 film also starring Herbert Marshall, Doris Dudley, Eric Blore, Steven Geray, and Albert Basserman. Loosely based on the life of Gauguin, the screenplay by Albert Lewin is based on the book by Somerset Maugham. As in the later \"The Razor's Edge,\" Maugham, here also played by Herbert Marshall, serves as narrator for most of the film. Sanders is the unpleasant, self-involved Charles Strickland, a stock broker who deserts his family and leaves London to go to Paris and become a painter. There he meets Dirk Stroeve (Geray), who becomes a friend. When Strickland becomes ill, Stroeve over the strong objections of his wife Blanche (Dudley) moves Strickland to their home to nurse him back to health. Stroeve then gets the impression that his wife is in love with Srrickland, and that Strickland has no intention of leaving. So he throws him out. His wife says that she's leaving with him. Stroeve leaves instead. Strickland eventually tires of Blanche and then leaves for Tahiti. There he continues to paint and even falls in love with a native girl, Ata (Elena Verdugo). There Dr. Coutras (Bassermann) picks up the narration. As the unapologetic user obsessed with his work, George Sanders is excellent. Like many in the studio system, he was typecast into playing one type of role, but he was capable of so much more. Another revelation in this film is Eric Blore, who was always typecast as a butler. Here he is a different kind of character and is absolutely wonderful. Herbert Marshall does not register much in what is basically a thankless role - he had more to do in The Razor's Edge. Good movie. If this and Lust for Life are any indication, Gauguin, even if this character just hints at him, was a most unpleasant character.",
         "The most extraordinary feature of this film is the incredible smoothness it adds to the story line; it's a masterpiece of great dialogue and incredible actors to deliver the story. Who has ever seen any better, and unobtrusive, acting than that of the likes of Saunders, Marshall and the relatively unknown but great actor Steven Gary (who plays Dirk Strouve) ? One will never see another film to exceed this one in these respects.",
         "Somerset Maughn always seemed to have as his trademark the idea of bitter, mean people who don't care who they hurt. We saw this in Mildred, as the cocktail waitress, in \"Of Human Bondage,\" and her male counterpart could be George Sanders in this film. Narrated by Herbert Marshall, who also co-stars, it details the life of a stockbroker who gives everything up to paint. After a while, his wife becomes indifferent after he leaves her and their children. Another theme of Maughan is played out here when again we see kindness paid by cruelty and ultimate tragedy. As a Tahitian matchmaker, Florence Bates looked absolutely ridiculous here. This is the ultimate story of an indifferent man finding ultimate happiness after causing misery to so many, then only to find tragedy ending that happiness.",
         "The print of this film (shown on TCM) suffers from the ravages of time. I wish I could say that the genius of the film shines through, but I cannot. It is an interesting film. Certainly a curiosity. The unusual use of different film stocks and the selective use of color make it a unique experience. The subject of the film, a misanthropic painter who offers little in the way of redeeming value, makes the film an interesting story with a hollow center. Charles Strickland (George Sanders) is a man who sacrifices everything in life to retire to Tahiti to paint. Based loosely on the life of Gaugin, the film has an interesting cast of characters that surround Strickland, notably Herbert Marshall as Geoffrey Wolfe and Steven Geray as Dirk Stroeve. One might feel compelled to watch the story of so unusual a protagonist, but he is not merely indifferent to others; he often goes out of his way to denigrate or insult them. When we finally see the artwork that has driven this man's obsession--if that's what it is--it is anticlimactic. This work of fiction could have made Strickland a hero, fighting for his artistic vision. Instead, he comes across as little more than a craftsman who does even value his own work. This is disappointing.",
         "*Spoiler/plot- The Moon and Sixpence, 1942. Possibly inspired from Paul Gauguin's life life living in Polynesia. The story of a fictitious 'Charles Strickland', a middle-aged stockbroker who abandons his middle-classed life, his family, his duties to start painting in Tahiti. He always wanted to paint and exile himself from society. He's personally a terrible to others in his doings, an awful human being. He learns to be devoted to his ideal: beauty while battling leprosy everyday. *Special Stars- George Sanders, Herbert Marshal, Doris Dudley, Albert Basserman, Florence Bates, Elena Verdugo. *Theme- Art can come from the knowledge of ugliness and pain. *Trivia/location/goofs- B & W. Made during ww2. B&W until art and art set burning in fired family hut. ending. *Emotion- A rich film of drama and painting. Interesting bit of historic storytelling with an interesting use of color inside a black and white film to highlight the Polynesian painting of Gauguin. *Based On- Loosely based on the life of Gauguin, the screenplay by Albert Lewin is based on the book by Somerset Maugham.",
         "As far as I know, this is George Sanders first starring movie and it hits a home run. It is based loosely on Paul Gauguin's life. Mr. Sanders is superb and is backed by a terrific supporting cast. Too bad Mr. Sanders wasn't given the chance to star in better movies. The only other good movie that he starred in was \"Village of the Damned\", a very scary science fiction movie. .",
         "As far as I know, \"The Moon and Sixpence\" is George Sanders first starring movie and it hits a home run. It is based loosely on Paul Gauguin's life. Mr. Sanders is superb and is backed by a terrific supporting cast. Too bad Mr. Sanders wasn't given the chance to star in better movies. The only other good movie that he starred in was \"Village of the Damned\", a very scary science fiction movie. .",
         "This story is very loosely based on the life of the painter, Gauguin. Both are amazingly selfish and nasty fellows, though there are a few differences. Sanders' character (Charles Strickland) is British instead and in the end he is stricken with leprosy--not syphilis (which they weren't even allowed to mention in films in the US in 1942). Otherwise, the tone of the character's life is similar to Gauguin--though Gauguin also had a penchant for violence that you also don't see in this film. Either way, you'd probably NOT want either guy to be your husband or best friend! The film is told from the viewpoint of an acquaintance of Strickland--played by Herbert Marshall. Through much of the film, this friend disdains the life Strickland is leading but, oddly, continues to associate with a man he didn't like. This really made little sense. Regardless, the main thrust of the film is to show what a major jerk Strickland is as well as how gifted he was as well. An odd sort of dichotomy, I know. Overall, this was only a fair movie to watch. Part of this is because the film was awfully sanitized. Part of it was because you can't like his character in any way, so when he dies you are left not caring in the least. But for me the biggest problem is that Sanders later played the same sort of guy in \"Death of a Scoundrel\"--and this latter film was much, much more interesting and florid! An okay time passer, I suggest you see this other film instead--it's a doozy!",
         "As a George Sanders fan I was disappointed to see him in this poorly written, directed and acted film. Not only is he insensitive, he is unsympathetic. In 'Samson and Delilah' he plays an antagonist. Because the script is good and the direction is at DeMille's best, Sanders' performance is sympathetic, and you like both the protagonist and the antagonist. In 'Ivanhoe' he plays the antagonist, Bois Guilbert. He is likable and sympathetic because the writing is good, and Richard Thorpe's directing is at his best. Therefore Sanders' performance is sympathetic. This is a successful anti-hero, but his performance in this film is anti- sympathetic. He is totally unlikeable, and there are no redeeming qualities in the film whatsoever. I'll have to read the novel to see if it is as disappointing as the film."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["David L. Loew-Albert Lewin"],
      "summaries": [
         "Loosely inspired from Gauguin's life, the story of Charles Strickland, a middle-aged stockbrocker who abandons his middle-classed life, his family, his duties to start painting, what he has always wanted to do. He is from now on a awful human being, wholly devoted to his ideal: beauty.",
         "Charles Strickland is a middle-class, apparently happily married man living and working in London. On what seems to be a spur of the moment decision, he leaves his wife and his life behind and flees to Paris where he hopes to pursue his interest in painting. Over the course of many years, he becomes a more that capable artist but his selfishness apparently knows no bounds. He takes a friend's wife but then discards her when he has no further use for her. He eventually makes his way to Tahiti and married but ultimately finds there is a price to pay."
      ],
      "budget": 401000
   },
   "movielensId": 122671,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-10-27",
      "dvdReleaseDate": null,
      "directors": ["Albert Lewin"],
      "runtime": 89,
      "movieId": 122671,
      "title": "The Moon and Sixpence",
      "mpaa": "",
      "actors": [
         "George Sanders",
         "Herbert Marshall",
         "Doris Dudley",
         "Eric Blore",
         "Albert Bassermann",
         "Florence Bates",
         "Steven Geray",
         "Elena Verdugo",
         "Rondo Hatton"
      ],
      "imdbMovieId": "0035078",
      "originalTitle": "The Moon and Sixpence",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Loosely inspired from Gauguin's life, the story of Charles Strickland, a middle-aged stockbrocker who abandons his middle-classed life, his family, his duties to start painting, what he has always wanted to do. He is from now on a awful human being, wholly devoted to his ideal: beauty.",
      "tmdbMovieId": 56146,
      "avgRating": 3,
      "releaseYear": "1942",
      "numRatings": 3,
      "posterPath": "/qCX3M0x47Mkb2g0QRCxxcxqdlsi.jpg"
   }
}