{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gunslinger",
            "id": 75
         },
         {
            "name": "ranch",
            "id": 2752
         },
         {
            "name": "johnson county war",
            "id": 5780
         }
      ],
      "imdb_id": "tt0064409",
      "video": false,
      "title": "Heaven with a Gun",
      "recommendations": [
         145966,
         217565,
         40685,
         72472,
         167769,
         270748,
         145691,
         64139,
         124400,
         48409
      ],
      "backdrop_path": "/5HnRYBsrL05A2EDOPExZQZO4XNR.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "55c7ce89c3a3682496002cbf",
         "content": "You gotta doctor in this town? Go get him!\r\n\r\nHeaven with a Gun is directed by Lee Katzin and written by Richard Carr. it stars Glenn Ford, Carolyn Jones, Barbara Hershey, John Anderson, David Carradine, J.D. Cannon and Noah Beery Jr. Music is by Johnny Mandel and the Metrocolor/Panavision cinematography is by Fred Koenekamp. \r\n\r\nThis is a good ole late 1960s Oater, not one to rush out and see immediately, or quickly part with your cash to buy or rent - or go out and steal. But it has Glenn Ford, who maybe in the twilight of his career, but still a bad mutha with gun, shovel and a pulpit! Yep, the punching preacher indeed. \r\n\r\nLambs to the slaughter. \r\n\r\nIt's the town of Vinegarroon and a war is raging between cattle and sheep breeders. Into this walks Jim Killian (Ford), a famed gunfighter who has come to build a church and preach the bible. However, Pastor Jim is not afraid to use his guns in the name of the Lord! \r\n\r\nThe God Squad. \r\n\r\nIt is what it is in that respect, the cheeky kicker here is that Killian is unorthodox in his methods, anyone wanting to come to church will be guaranteed safety, important since Killian is trying to convince the cattle and sheep barons that they can co-exist, that the animals (all God's creatures of course) can do it, and thus so can the humans. Naturally some are more keen to give it a try than others - cue intimidation and bloodshed, Killian clearly has his work cut out here... \r\n\r\nThe musical score is a touch out of place, one big turn of events feels completely unnecessary, while the delectable Hershey works hard but never comes close to convincing as a girl of Indian blood. Converseley the Arizona locales are nicely prominent, while Anderson does his stuff, Carradine fits well as a dastard hot-head and Beery Junior is a reassuring presence. As is Ford, a Western actor that fans can rely on, to feel safe around, it is he that keeps this on the good side of good. 7/10",
         "url": "https://www.themoviedb.org/review/55c7ce89c3a3682496002cbf"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Jim Killan",
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390d9",
               "name": "Glenn Ford",
               "profile_path": "/t6lpxAmhOrRJ22d2xnQ1uB0CJf6.jpg",
               "id": 3381,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Madge McCloud",
               "gender": 0,
               "credit_id": "52fe4315c3a36847f80390e9",
               "name": "Carolyn Jones",
               "profile_path": "/2MiUzB4xpwjFQhAq3aF5VNxsNA.jpg",
               "id": 19109,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Leloopa",
               "gender": 1,
               "credit_id": "52fe4315c3a36847f80390e1",
               "name": "Barbara Hershey",
               "profile_path": "/gaimK3QeNS32Wjryw03QC0PXWKO.jpg",
               "id": 10767,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Ase Beck",
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390f1",
               "name": "John Anderson",
               "profile_path": "/pM45pKyjU1c9nkO087hEr2dCNPw.jpg",
               "id": 19111,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Coke Beck",
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390d5",
               "name": "David Carradine",
               "profile_path": "/wCvrY9PUKtN6NwkmLHWLJivCCov.jpg",
               "id": 141,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mace",
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390dd",
               "name": "J. D. Cannon",
               "profile_path": "/mgZsKMd5zg0g5yQ7UUkfvsLkGJd.jpg",
               "id": 19106,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Garvey",
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390f5",
               "name": "Noah Beery, Jr.",
               "profile_path": "/dgKPU1Vbq0UiwkT2UyCicpbPEMf.jpg",
               "id": 30297,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Gus Sampson",
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390e5",
               "name": "Harry Townes",
               "profile_path": "/ek8jJ5glOZhNFvb4uqKISAeIoTy.jpg",
               "id": 19107,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Bart Paterson",
               "gender": 2,
               "credit_id": "58d07bae9251415a12002e38",
               "name": "William Bryant",
               "profile_path": "/pDCdDtLA4hmrdLtXoB4ZzexMPEp.jpg",
               "id": 97281,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Mrs. Patterson",
               "gender": 1,
               "credit_id": "52fe4315c3a36847f80390ed",
               "name": "Virginia Gregg",
               "profile_path": "/kekj3Jr2u34qr28Deq30AIdHQM.jpg",
               "id": 19110,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Mrs. Andrews",
               "gender": 1,
               "credit_id": "58d07bf19251415a12002ea8",
               "name": "Barbara Babcock",
               "profile_path": "/gKQge0krT6yuh4zTOOWQlsTfRBf.jpg",
               "id": 15746,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Emily",
               "gender": 1,
               "credit_id": "58d07cbc92514159f6002ef3",
               "name": "Angelique Pettyjohn",
               "profile_path": "/zKROnp74ta1CLyS205HGuDCk73w.jpg",
               "id": 98241,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Leeloopa's Father",
               "gender": 0,
               "credit_id": "58d07ce2c3a368674f0030bc",
               "name": "Al Wyatt Sr.",
               "profile_path": "/8Vh3IHU75JDzeJLf0NwTTJDaCxi.jpg",
               "id": 196258,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4315c3a36847f80390a7",
               "name": "Frank King",
               "profile_path": null,
               "id": 19099,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4315c3a36847f80390ad",
               "name": "Maurice King",
               "profile_path": null,
               "id": 19100,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390b3",
               "name": "Lee H. Katzin",
               "profile_path": null,
               "id": 19101,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390b9",
               "name": "Fred J. Koenekamp",
               "profile_path": "/yxTbBWproHj24o8yrTLEjtzlF9u.jpg",
               "id": 19102,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390bf",
               "name": "Johnny Mandel",
               "profile_path": null,
               "id": 9796,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4315c3a36847f80390c5",
               "name": "Paul Francis Webster",
               "profile_path": null,
               "id": 19103,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4315c3a36847f80390cb",
               "name": "Dann Cahn",
               "profile_path": null,
               "id": 19104,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4315c3a36847f80390d1",
               "name": "Richard Carr",
               "profile_path": null,
               "id": 19105,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.857748,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1790,
      "vote_count": 5,
      "budget": 0,
      "overview": "Glenn Ford plays Jim Killian, a preacher who arrives in a town divided between cattlemen and sheep herders. But Killian isn't just any preacher. He is a former fast gun who has set upon a different path.",
      "similar": [
         9394,
         12501,
         9028,
         11072,
         11829,
         9086,
         12160,
         33,
         5176,
         44896,
         49849,
         353491,
         11697,
         6644,
         11509,
         1368,
         142,
         8068,
         755,
         115
      ],
      "original_title": "Heaven with a Gun",
      "runtime": 98,
      "poster_path": "/BPBYqRfuJbZU4d23QcDeSB5FJf.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "King Brothers Productions",
            "id": 3760,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1969-05-20",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Jim Killian killed like an artist. This is the story of his masterpiece.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lee H. Katzin"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Richard Carr"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064409/",
      "coverLink": null,
      "actors": [
         "Glenn Ford",
         "Carolyn Jones",
         "Barbara Hershey"
      ],
      "reviews": [
         "Glenn Ford turns in a fine performance, contrary to what some have said. Who better to portray a reluctant hero, a reformed gunfighter/preacher? Clint Eastwood--John Wayne? Don't be ridiculous. Ford is perfect for the part, just as Clint was perfect for the Man with No Name and Dirty Harry, and the Duke was perfect for the lead role in The Cowboys and True Grit. If you don't like Glenn Ford, fine. But don't belittle his acting. I'm a fan of Eastwood and Wayne, but Ford is a better actor than either. David Carradine turns in a top notch acting job also as a villain/foil to Ford as hero. True Western fans will appreciate this film.",
         "After watching quite a few Westerns with the cattle vs. sheep rancher theme, this is the first time I've ever seen one in which an attempt was made to get the two factions together by demonstrating that both animals could live together side by side. I wonder why no one else ever got that idea, until Glenn Ford came around as preacher/gunman Jim Killian. Pastor Jim plays it fairly straight down the middle for the picture's entire run, cleverly inviting the opposing forces to join his congregation while they try to settle their differences. I have to give some casting credit here to the roles of John Anderson and David Carradine as father and son, positioned as the main heavies to oppose Pastor Killian. The younger Beck had almost as good a resemblance to his movie father as he did to his real dad, John Carradine. It makes me curious now if the Carradines in question ever did portray themselves as father and son. There's also decent support work here with Noah Beery Jr. as a Beck henchman, and Carolyn Jones and Barbara Hershey in somewhat adversarial roles for the affection of the good pastor. It's not played that apparently, and Killian seems to be above it all, but the picture could easily have gone in either direction. I'm always impressed with the expressiveness of Indian names; Hershey's character was a Hopi Indian named Leloopa - 'Life From Faraway Star' - very mysterious and romantic. Hey, how about that scene where Pastor Jim blasts Beck henchman Mace (J.D. Cannon) in that under the table gunfight. It had all the earmarks of Greedo vs Han Solo, but done eight years earlier. Can you imagine that?",
         "I became a movie buff at age 13, (now 63), and would have crawled to the local theater over broken glass, to see any cowboy movie showing, if I had to. By the time I was 16 years of age, I was a devout Randolph Scott, Audie Murphy fan, but when I saw \"Heaven With A Gun\", Glenn Ford instantly became my number 1 cowboy hero, and me old mates Randolph and Audie had to take a back seat. For me, due to the humble, yet determined character Glenn Ford played so beautifully, this movie offered some great moralistic encouragement, and at the same time, stimulated an enthusiasm to believe in myself against all odds and \"stick to my guns\", as the expression goes. You will relate to this expression if you watch the movie. If anybody knows where I can buy this difficult-to-purchase movie, please let me know. (noel@youngnoel.com). I would do absolutely anything to add this movie to my collection. If you want to be truly entertained, this is a \"Must-see\" movie.",
         "A late 60's western about ruthless cattle ranchers and their ranch hands who terrorize helpless sheep ranchers, with the action alternating between the range, the ranch, and the town, itself with a thriving saloon/brothel where a lot of the action is centered. Into this arrives an ex gunfighter turned preacher played by Glenn Ford who wants to bring peace. The script nearly does the film in, although the story and late 60's permissiveness keep one watching. As well, even though the screenplay verges on being ridiculous, the acting by Ford, John Anderson (as the ruthless big cattle rancher with a sadistic son played by David Carridine) and some other parts (J.D. Cannon chews some serious scenery as hired gun Mace) elevate the entertainment quotient, and the film's ending doesn't make one feel remorse about watching this.",
         "Heaven with a Gun is directed by Lee Katzin and written by Richard Carr. it stars Glenn Ford, Carolyn Jones, Barbara Hershey, John Anderson, David Carradine, J.D. Cannon and Noah Beery Jr. Music is by Johnny Mandel and the Metrocolor/Panavision cinematography is by Fred Koenekamp. This is a good ole late 1960s Oater, not one to rush out and see immediately, or quickly part with your cash to buy or rent - or go out and steal. But it has Glenn Ford, who maybe in the twilight of his career, but still a bad mutha with gun, shovel and a pulpit! Yep, the punching preacher indeed. Lambs to the slaughter. It's the town of Vinegarroon and a war is raging between cattle and sheep breeders. Into this walks Jim Killian (Ford), a famed gunfighter who has come to build a church and preach the bible. However, Pastor Jim is not afraid to use his guns in the name of the Lord! The God Squad. It is what it is in that respect, the cheeky kicker here is that Killian is unorthodox in his methods, anyone wanting to come to church will be guaranteed safety, important since Killian is trying to convince the cattle and sheep barons that they can co-exist, that the animals (all God's creatures of course) can do it, and thus so can the humans. Naturally some are more keen to give it a try than others - cue intimidation and bloodshed, Killian clearly has his work cut out here... The musical score is a touch out of place, one big turn of events feels completely unnecessary, while the delectable Hershey works hard but never comes close to convincing as a girl of Indian blood. Converseley the Arizona locales are nicely prominent, while Anderson does his stuff, Carradine fits well as a dastard hot-head and Beery Junior is a reassuring presence. As is Ford, a Western actor that fans can rely on, to feel safe around, it is he that keeps this on the good side of good. 7/10",
         "Passable western looks like movie-backlot goods, but does feature a very fine performance by young Barbara Hershey (in only her second picture), and also by Hershey's future-squeeze David Carradine, in this melodramatic story of a new preacher in a tumbleweed town who is eventually forced into taking on the bad guys. Glenn Ford has the lead and he's solid as usual (Ford never really disappoints, but rarely did he try anything new; even as the heavy in \"3:10 To Yuma\" he was in fine form and yet unsurprising). Admirers of Hershey should take a look, she's really terrific. ** from ****",
         "... I thought as I waited for 6AM to come so I could record a documentary on Bette Davis that is not on DVD yet. Having a bad habit of falling asleep in the middle of a movie in the wee hours, I dared not change the channel at 4AM lest I fall asleep and wind up recording \"Fox and Friends\" instead of the documentary for which I had set my DVR timer. Thus began the 100 minute or so ordeal of watching this film. It would almost be worth buying the DVD - if it existed with commentary - to see how a film with such excellent actors and acting could so misfire in the plot department. You get down to the seventh bill before you even get to Noah Beery Jr. with the players in the upper bills including the excellent Glenn Ford, David Carradine, Carolyn Jones, and John Anderson, all turning in solid performances while spouting gibberish - endless gibberish - with literally no action. Meanwhile Barbara Hershey seems to be doing a screen test for a bit part in \"Billy Jack\" and somehow wandered on to the wrong set. It is supposed to be the time-honored western tale of cattlemen versus sheepherders, but everyone just stands around, talking. The hippie spirit of \"Easy Rider\" got injected into this one, but \"Born to be Wild\" just sounds silly on horseback.",
         "Fair western drama/action movie about 19th century western feud between cattle ranchers and shepherds gone astray.Good acting by lead actors and Hershey is as sexy as ever.This movie would have been much better with a better lead actor besides Glenn Ford and the directing,screenplay and cinematography was only average.Too bad because the story and script was good and deserved a much better production effort.......",
         "After a solid first hour, \"Heaven With a Gun\" thins out and becomes slightly more than routine. The movie could have used less sadism and sensationalism; while a topless Angelique Pettijohn is appreciated, gratuitous nudity tends to put off the very audience attracted to this kind of western. Carolyn Jones is nearly wasted, and I really wanted to know more about her prior relationship with Ford. Barbara Hershey does a fine job as the half-breed Hopi whom Ford protects. Ford and Hershey's relationship could have also used a little more sexual tension; and Hershey, to her credit, seemed ready to provide it. Production values are good, if not spectacular, and director Lee Katzin, while no Sergio Leone, keeps things moving nicely. \"Heaven With a Gun\" is a cut above most of Glenn Ford's later western. Too bad MGM didn't put a little more into the story and running time. I give \"Heaven With a Gun\" a weak \"7\".",
         "Solid acting (Noah Beery Jr, John Anderson, Glenn Ford, Barbara Hershey, and David Carradine) is compromised by formulaic direction and a script that zig-zags, forgets, remembers, and improvises, but the action occasionally rises, and the preacher-gunman conflict keeps things on track just enough to keep one watching till the end. From the distance of 2010, 60s cultural interest is raised by the film's brief, gratuitous, and confusing nudity, as well as Barbara Hershey's hippie depiction of a half-Hopi girl, but the biggest surprise may be that this otherwise predictable western was produced as late as 1969. Except for those 60s flashes, I could imagine my parents and their siblings enjoying something similar in 1955, while I would have wished for a hero less earnest and boring than Ford. Among the film's skewed lines, the oddest may be that the sheep-herder side of the range war is first identified with American Indians but is then shifted to a polygamous Mormon. I'd like to go back to 1969 and be 18 again, but no wonder I felt confused.",
         "Slightly better than formulaic script never really explores the moral tension inherent in the central character: a gunslingin' preacher played by Glen Ford with his usual professionalism. The moral/spiritual dilemma is pretty well ignored until Carolyn Jones directly confronts Ford and compels him to make a choice: gunslinger or preacher. The acting is always good. I like Glen Ford and Carolyn Jones. This is actually one of David Carradine's better performances. He is a very good sadistic old-west punk. Barbara Hershey is easy to look at. I guess she turns in a fair performance as a half-breed speaking stereotypical pidgin English. The most interesting scene is the gunfight in the saloon between a nasty hired gun and Ford while they are SEATED opposite one another at a poker table. The movie earned more originality points for that twist than for the paradoxical plot revolving around the gunslingin' preacher character.",
         "In many ways, this movie is mediocre and formulaic. There is a conflict between cattlemen and sheepherders. As usual, the sheepherders are good and the cattlemen are bad. Enter Jim Killian (Glenn Ford), the gunfighter who wants to hang up his gun and become a pastor, but not before he uses his gun one last one last time. Finally, there are some whores with a heart of gold, headed by Madge (Carolyn Jones). At the same time, the formula has been modified to suit the late 1960s. To begin with, there are a couple of Native Americans that are also sheepherders, consisting of a father and daughter. The father is hanged by a couple of the cattlemen, one of which is Coke (David Carradine), leaving Leloopa (Barbara Hershey) orphaned. When Killian walks into the small house he just bought, he finds Leloopa inside, cooking some baby rattlesnake. Because Killian cut her father down and buried him, she says that she now belongs to Killian, otherwise Hopi law says her father's soul will wander forever. Killian is forced to relent. The fact that they will be living together in a one-room house creates a little taboo tension: They are not married, she is a minor, they are of different races, and we are not sure whether she thinks of herself as a daughter to Killian or as his wife, giving us a tinge of incest. However, Killian leaves at night to sleep somewhere else, presumably at the hotel. Leloopa mentions that her mother was white, a captive whom her father married. In the old days, her mother would have been raped, but movies were trying to portray Native Americans in a more favorable light by this time. Because of this trend of treating Native Americans in the movies in this way, it shocks us a little when Killian tells her she is going to have to take a bath, and she has no idea what a bath is. Leloopa says it was her mother who taught her English, but her mother apparently didn't bother to teach Leloopa about bathing, so I guess her mother went completely native. But why, we ask ourselves, would a movie made as late as 1969 suggest that Hopi Indians are a bunch of dirty, smelly savages? The answer is that the movie wants to titillate us some more. You see, when Barbara Hershey is in a movie, it is usually just a matter of time before she gets naked. In fact, when Killian tells Leloopa that in order to bathe, you first have to take your clothes off, we are not surprised when she starts undressing right in front of him. He stops her, however, and leaves the house so she can have some privacy. Later in the movie she manages to get raped. Coke starts making advances to her in the street. Instead of remaining in the street where there are plenty of people around, she gets the bright idea of running into a barn, which means that Coke can rape her in private. We figure, \"All right, this is where we get to see Barbara Hershey naked.\" But she is only partially undraped as she leaves the barn. Killian beats up Coke. Finally, that night, when he gets home, Barbara Hershey is sitting outside completely naked, although we only get to see enough of her body to give the movie an M rating (\"M\" for mature, a designation eventually replaced by PG). She says she knows he is trying to find her another place to stay. After he puts her to bed, she asks if he will stay with her, which was probably the real reason she got naked and not all that Hopi nonsense she was spouting. But he leaves. After Killian kills Mace (J.D. Cannon), the gunslinger that had been hired by chief cattleman Asa Beck (John Anderson), Madge convinces him that if he really wants to hang up his guns and become a pastor, he must stop killing. That makes sense. But what to do about all those evil cattlemen threatening to wipe out all the sheepherders? Here we see another influence of the 1960s. Killian gathers together all the townspeople, including the wives and children of the cattlemen, and they all go to the lake where there was to be a showdown, placing themselves in what would have been the middle of a battle between cattlemen and sheepherders. It is suggestive of the civil disobedience, civil rights marches, and nonviolent resistance so characteristic of the 1950s and 1960s. Finally, it becomes clear that Killian is going to allow Leloopa to stay with him, presumably as husband and wife, though that is not explicitly stated. This too is a change from the old days. Normally, Leloopa would have been off limits for Killian, not so much because they were of different races, but because she had been raped. Miscegenation was something of a taboo in the old movies, but it did happen from time to time, as in \"Broken Arrow\" (1950). But a raped woman was damaged goods, and the movies usually figured out some way to keep the protagonist from marrying her, as in \"Man of the West\" (1958), assuming she was even allowed to be alive by the end of the movie. The idea of a raped woman marrying a man and living happily ever after was just too offensive in the old days. Maybe it still is. But this movie doesn't see it as a problem.",
         "Known gunfighter Glenn Ford arrives in the town of Vinegarroon a name made famous as the seat of Judge Roy Bean's court. But here the local power is the local Ponderosa owner John Anderson and his punk of a son David Carradine. Some sheepman have been intruding on government range and Anderson isn't having any. When Ford comes to town he takes a lease on an old barn and then reveals he's now a minister as well, but ready to back his sermons with gunfire if necessary. He tries to bring peace to the cattlemen and the sheepmen. His main allies though are the women of the locale. Two women prominently figure in this film. One is Carolyn Jones who runs the local watering hole. In keeping with the times the film is quite specific about what the women are there for. Jones and Ford have history. Looking to make some history with Ford is Barbara Hershey who is a young Indian girl he rescues. Also in keeping with the abolition of the Code is one brutal rape scene involving her and her real life husband David Carradine. Despite the sexual frankness Heaven With A Gun has an old fashioned look to it. It's not in the same league as some of Ford's earlier westerns like 3:10 To Yuma, Jubal, or The Violent Men. But his fans should be pleased. The climax is borrowed some from Destry Rides Again and some from Duel In The Sun."
      ],
      "genres": ["Western"],
      "productionCompanies": ["King Brothers Productions"],
      "summaries": [
         "In the small western town Vinegarroon the conflict between cattle and sheep breeders escalates. When a stranger appears in the town, the ranchers suspect he's a gun man, hired by the sheep breeders. But Jim Killian turns out to be a priest - a tough one however, who soon shall make unscrupulous rancher Esa Beck's life quite harder.",
         "In a frontier town, gunslinger-turned-preacher Jim Killian is caught in the middle of a violent range war between cattlemen and sheep-men."
      ],
      "budget": 0
   },
   "movielensId": 122677,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1969-05-20",
      "dvdReleaseDate": null,
      "directors": ["Lee H. Katzin"],
      "runtime": 98,
      "movieId": 122677,
      "title": "Heaven with a Gun",
      "mpaa": "",
      "actors": [
         "Glenn Ford",
         "Carolyn Jones",
         "Barbara Hershey",
         "John Anderson",
         "David Carradine",
         "J. D. Cannon",
         "Noah Beery",
         " Jr.",
         "Harry Townes",
         "William Bryant",
         "Virginia Gregg",
         "Barbara Babcock",
         "Angelique Pettyjohn",
         "Al Wyatt Sr."
      ],
      "imdbMovieId": "0064409",
      "originalTitle": "Heaven with a Gun",
      "genres": ["Western"],
      "youtubeTrailerIds": ["F7pacY6RxUw"],
      "plotSummary": "Glenn Ford plays Jim Killian, a preacher who arrives in a town divided between cattlemen and sheep herders. But Killian isn't just any preacher. He is a former fast gun who has set upon a different path.",
      "tmdbMovieId": 1790,
      "avgRating": 3.5,
      "releaseYear": "1969",
      "numRatings": 1,
      "posterPath": "/BPBYqRfuJbZU4d23QcDeSB5FJf.jpg"
   }
}