{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "supernatural",
            "id": 6152
         },
         {
            "name": "possession",
            "id": 9712
         },
         {
            "name": "killer car",
            "id": 33984
         },
         {
            "name": "occult",
            "id": 156174
         },
         {
            "name": "ghost",
            "id": 162846
         }
      ],
      "imdb_id": "tt0080853",
      "video": false,
      "title": "The Hearse",
      "recommendations": [
         112481,
         84419,
         83519,
         98106,
         42689,
         49158,
         28586,
         30773,
         54875,
         179254,
         35662,
         42593,
         221660,
         39154,
         85498,
         31280,
         30935,
         29389,
         29318,
         34078
      ],
      "backdrop_path": "/ipH7gjYiRmjD73VS98h6hhTkWI8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jane Hardy",
               "gender": 1,
               "credit_id": "52fe4884c3a36847f816b89f",
               "name": "Trish Van Devere",
               "profile_path": "/dOwodvtNzNw1yJ1bohEbulIBxH2.jpg",
               "id": 74636,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Walter Prichard",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8a3",
               "name": "Joseph Cotten",
               "profile_path": "/bTUTrTnzacCQV4F0rs1xH4QaETf.jpg",
               "id": 7664,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Tom Sullivan",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8a7",
               "name": "David Gautreaux",
               "profile_path": "/jqvxI1AbuQKehAk3tEQ4Y0TiBla.jpg",
               "id": 168269,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Reverend Winston",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8ab",
               "name": "Donald Hotton",
               "profile_path": "/qCLOFZbktP5X0ChZDrHj5B0qsYN.jpg",
               "id": 14854,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sheriff Denton",
               "gender": 0,
               "credit_id": "52fe4884c3a36847f816b8af",
               "name": "Med Flory",
               "profile_path": "/etO8uGlxHrV9oMRNxkzJ3Bt5fxF.jpg",
               "id": 19483,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Luke",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8b3",
               "name": "Donald Petrie",
               "profile_path": "/skokYnTDYIKogfeH7DU49dfhRsj.jpg",
               "id": 18281,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pete",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8b7",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Paul Gordon",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8bb",
               "name": "Perry Lang",
               "profile_path": null,
               "id": 124783,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mr. Gordon",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8bf",
               "name": "Frederic Franklyn",
               "profile_path": null,
               "id": 1002848,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mrs. Gordon",
               "gender": 1,
               "credit_id": "52fe4884c3a36847f816b8c3",
               "name": "Olive Dunbar",
               "profile_path": null,
               "id": 1235154,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Bo Rehnquist",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8c7",
               "name": "Al Hansen",
               "profile_path": null,
               "id": 160486,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "The Driver",
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b8cb",
               "name": "Dominic Barto",
               "profile_path": "/20vkhxfA3NriMVIYOAuzwNKXyfz.jpg",
               "id": 16647,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b88f",
               "name": "George Bowers",
               "profile_path": null,
               "id": 11454,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4884c3a36847f816b895",
               "name": "William Bleich",
               "profile_path": null,
               "id": 141383,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4884c3a36847f816b89b",
               "name": "Mark Tenser",
               "profile_path": null,
               "id": 1015439,
               "department": "Writing",
               "job": "Idea"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.71911,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53950,
      "vote_count": 17,
      "budget": 0,
      "overview": "A schoolteacher moves into her deceased aunt’s house in a small Californian town, and is harassed by unfriendly locals and a mysterious hearse.",
      "similar": [
         561,
         91586,
         409297,
         293670,
         19592,
         9552,
         77949,
         10014,
         79694,
         288158,
         2655,
         620,
         335796,
         27770,
         622,
         675,
         138843,
         201085,
         396422,
         452507
      ],
      "original_title": "The Hearse",
      "runtime": 99,
      "poster_path": "/vkeBhwkp4RyFNcZalTvKGrhZlUs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Crown International Pictures",
         "id": 1009,
         "origin_country": ""
      }],
      "release_date": "1980-06-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "The Barrier Between Life and Death is no Greater than the Thickness of a Door...and now that Door is Open!",
      "adult": false,
      "homepage": "http://www.crownintlpictures.com/hktitles.html",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Bowers"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "William Bleich",
         "Mark Tenser"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080853/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NTg3OTI4NF5BMl5BanBnXkFtZTYwMTY0MDI5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Trish Van Devere, Joseph Cotten, David Gautreaux | See full cast and crew »"],
      "reviews": [
         "I have read reviews good and bad for this film and find that I cannot disagree with any of them, for The Hearse is good in certain respects and not so good in others. Watching this film recently, for the first time in many years, I was reminded of other stories that came both before and after it, 1963's The Haunting and 2001's The Others coming immediately to mind. There is nothing better than a good ghost story with mood and imagination and The Hearse claims these properties to some degree. That it is an over-cliched film with comic relief that doesn't quite fit counts against it, as does the unlikely and disappointing ending. Trish Van Devere, a competent if not supremely talented actress, and the always pleasing Joseph Cotton are the lead players, although Ms. Van Devere's screen love interest, David Gautreaux as Tom, came close to stealing it from both of them. I did not feel that Joseph Cotton had enough screen time to please his fans, but as they say, `Always leave them wanting more!' The story: Jane, portrayed by Ms. Van Devere, inherits an old house in the country. Jane's aunt had practiced Satan worship in it and the local town folks were not pleased to see her niece move in. In a nice addition to the storyline, we learn that Jane had a nervous breakdown after a messy divorce and her mental stability quickly comes into question. Jane sees images in the house and is convinced that somebody is stalking her in a sinister looking funeral home hearse. Throughout the course of the story she has interesting encounters with such diverse people as the local estate attorney, hardware store operators and their son, an oddball minister and her new love interest. Who was after her, and why did he/she want Jane out of her aunt's house? There are many red herrings and barely enough chills and thrills to attract the younger audiences that were just then, in 1980, two years after Jamie Lee Curtis and Halloween, making their presence felt at the box office and soon-to-be neighborhood video stores. As stated, the ending was a real letdown after it seemed the film had come to a satisfying conclusion. Perhaps that is why this film generates strong emotions; it tries to be too much to too many. That it has something for everybody and, for the most part, succeeds in putting it all together is one of it's major strengths. The fact that this also causes it to be disjointed and somewhat awkward at times is the downside of this, but remember, The Hearse was never intended to be a summer blockbuster. That a film such as this can still generate intelligent discussion 22 years after its release is remarkable in itself.",
         "\"The Hearse\" is a low-budget, bottom-of-the-barrel little shocker. It's uninvolving throughout, and never terrifying. The hopelessly cliched story, with all the familiar \"haunted house\" tricks, would be enough to sink this movie, but the job is completed by the poor direction and the murky look of the film, which often makes it hard for us to understand what's happening onscreen. The ending leaves almost everything unexplained and is just as arbitrary and nonsensical as the rest of this film. The good performances can't save it by any means.",
         "When Jane Hardy's late aunt leaves her a house in the country, she decides to spend the summer there to get over a nasty divorce and near-breakdown. There she begins putting the pieces back together with the help of a new romantic interest named Tom. But the town people are curiously less-than-friendly to her. Jane soon finds a reason why in her aunt's diary--the mysterious man her aunt fell in love with, who drew her aunt into darkness. Then strange things start happening--and the hearse begins showing up in the middle of the night. This movie is wonderfully creepy without being camp, and has some scenes that are particularly unexpected and unnerving. More suspense horror than gore, it's guaranteed to keep you awake at night. The love story between Jane and Tom will keep sentimental people glued, and the terror gets all the rest. The piano-oriented title music is haunting, and suits the seriousness of the film well. This movie clearly had a low budget, yet it still ranks as a first-class movie. All in all, something worth watching and worth owning.",
         "The Hearse is an almost-perfect specimen of B-movie horror writing. The writer, Bill Bleich, clearly possesses genius for the genre. The characters are superbly drawn, and the notion of history repeating itself is perfectly blended into the story. Definitely check out this smart, well-constructed supernatural thriller!",
         "Some childhood memories may best be left in your childhood. I watched this movie several years ago and remember the creepy hearse. Sadly, it was the only thing going for this movie. The concept of the movie is very creepy and builds suspense with the mysterious hearse. I like a slow build which this movie had. The only problem about a slow build is that it needs to build to a solid ending. Sadly, the ending was pathetic is this movie. Some of the build didn't work very well either due to poor acting. I wasn't too enthralled with Trish Van Devere as the lead actress or David Gautreaux as her love interest. The best character in the movie was the creepy hearse driver. Of course, they couldn't give him much screen time or the movie would lose its suspense. There are much better movies in the ghost / haunted house subgenre. I would only watch this one after exhausting the higher quality ones.",
         "Jane Hardy (Trish Van Devere) decides to vacation at her late aunt's country home after suffering a breakdown. She unearths and starts reading her aunt's diary, discovering that her aunt was into satanism! A handsome, mysterious stranger appears, and soon, her life begins to parallel what she's reading in the diary. Oh--and someone driving a hearse appears to be stalking her. Should she call her shrink in the city...or face the fact that events in her life have taken a supernatural turn? That's THE HEARSE--if you analyze it, it doesn't deliver big on story. It's more about the set-up than the payoff. It gives you just enough of a situation to make you nervous, and then, straight into the scares. Then it wraps up in a vague manner that doesn't answer your questions, but if you're on the film's wavelength, this really doesn't matter. This was one of several movies I saw as a kid in the early 80's, and this particular one I came back to see a second time, dragging a friend along to share the popcorn fun. Seeing this in a theatre was amazing--imagine yourself going to see a PG-rated film in the early 80's, and watching the audience around you literally jumping out of their seats with fright, over and over again. This film actually generated one of the strongest audience reactions I've been witness to. The film established a very unnerving vibe, and made the audience worried about the vague \"evil forces\" that were lurking out there in the darkness. And when the creepy hearse driver finally showed up and started doing his menacing thing, the audience was primed up and ready to scream. And scream they did. There is also the strong feeling that the sleepy, secluded town the story takes place in is REALLY far away from everywhere else in the world, and that these strange supernatural-ish events could really happen here without too many people even noticing. This is fun on home video, but if you ever have a chance to see it at a revival theatre (not likely but you never know!), go check it out. Maybe the days of really good popcorn budgeters are gone but this was very effective in its day. Nice musical score, too. Trish Van Devere and the whole rest of the cast are excellent. I thought Perry Lang was especially good as the local boy who takes a shine to Jane and experiences some misfortune because of it. An inexpensive, non-gory horror movie that does its job. It was worth the $2.50 and popcorn money.",
         "Before watching it, I decided to give the trailer a look and liked what I saw. But when it came to actually watching the feature. Well that was another story. Even with such a novel idea, it couldn't escape its roots that hang heavily in this old-hat haunted house format. No surprises or shocks here. The pallid story never grips or inserts much interest, as it becomes a wearisome tale of never-ending, suspicious tedium. The slow grinding pace doesn't help matters either. It seems to be all build up, but director George Bowers' predictable touch can't seem to raise much in the way of suspense and really overuses the usual scare tactics with miserable results. This even goes for Webster Lewis' generically telegraphed score. One or two effective surreal set-pieces (involving the hearse and its driver) and Mori Kawa's nicely atmospheric photography, just can't make-up for the lame, weak and overly boring presentation. Performances feel wooden and terribly uninterested, and it seems to show. Trish Van Devere fluffs about, and Joseph Cotton adds his two bobs worth. Put it under the very forgettable files.",
         "the Hearse came out in the middle of 1980 at a time when R-rated horror features were pulling in most of the box office money. the Hearse is rated PG and was one of the few films I was able to see without adult supervision. Looking through old newspaper ads from 1980, I noticed this film was often paired up on a double bill with DON'T ANSWER THE PHONE throughout 1980 and again in 1981 at a local second-run cinema! Talk about mis-matched couples! I first actually saw the film when it premiered on Showtime in 1982...and I watched every broadcast after that. The new DVD is quite a surprise as it's widescreen and it's enhanced for widescreen TVs! I tend to watch the beginning of the film often because there is a shot of a famous row of houses I live across the park from (one of those homes was used as Brooke Adams' home in 1978's Invasion of the Bodysnatchers and countless other films and TV shows). Also, I walk by the house where Trish Van Devere is carrying her luggage down the steps to her car just about everyday. The rest of the film is a rather classy ghost story which is intriguing and non-exploitive. There's no gruesome violence that, say, DON'T ANSWER THE PHONE had and it's refreshing. I think anyone over the age of 10 can appreciate this film and it's somewhat suitable for the whole family. Trish Van Devere is a strong lead and very appealing in her role. She carries the movie just fine and in a distinguished female lead. Joseph Cotton plays an obnoxious nemesis and pretty much sets the stage as to how the rest of the small town reacts to her being there. They are far less than hospitable and it's not until further on in the film she finds out why. It's at this time a mysterious, menacing hearse appears to be showing up at her country retreat on a nightly basis or following her on one of her quiet drives. Recovering from a previous breakdown (after a messy divorce), and soon feeling as though she may have a relapse when the nightly hauntings start to wear down her nerves, she finally gets a little braver and starts investigating the ghostly goings on. In the meantime, she finds herself attracted to a mysterious young man who seems to know a lot more about the history of the town and her house than the townsfolk are willing to share. There's more, but I'll stop there - view the film (at least RENT IT!) and see for yourself. It's a decent film and may be just the ticket if the usual horror trends in violence or overdone special effects have worn your nerves down. Even in 1980, a good ghost story was hard to find - by that, the Hearse is still a refreshing feature.",
         "A stressed school teacher moves into her deceased aunt's mansion for the summer where strange things happen, in particular visits from a mysterious old hearse. Creepy film has potential, but comes off as a `B` movie due to the bad acting from supporting cast and a disappointing ending.",
         "This one is only remarkable for its dreadfulness. I recorded it because of Joseph Cotten's performance, but even this wonderful Hollywood actor couldn't rescue this stinker. I sort of believed the hearse more. What was with all the screaming of the lead actress? There was no one to hear in the big house she lived in alone. The spooky chauffeur wasn't spooky. Suddenly without any explanation Tom was driving the hearse, how did that make sense? Who didn't figure out that Tom was Robert? Who was repairing the doors inside the house if it wasn't Paul? Guess Paul's dad was right to want him to stay away, huh? There was never any explanation for the hatred of the townspeople for the heroine. What's up with that? It's understandable that they hated the Satan-worshiping aunt (it wasn't her fault, she was under a spell), but the house then passed to the mother before the niece received possession. Did Joseph Cotten's character poison their minds against an innocent woman? This film is neither scary nor frightening. Unfortunately it's not entertaining, either, unless you enjoy bad acting, boring scripts and lame plots. For the most part it was only annoying until the end finally arrived. I've been more afraid this week of the escaped Egyptian cobra in the Bronx zoo, and I'm in Florida. I had hoped for more from this one."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Marimark Productions",
         "Marimark Productions"
      ],
      "summaries": ["Jane Hardy decides to stay the summer in the house her aunt left her when she died, to try and recoup from a bad divorce. Little does she know, her aunt practiced witchcraft and is still thought of very badly by the town's citizens. As soon as she moves in, she is haunted by a old black hearse and it's creepy driver. Is she going insane or is she truly being menaced? She meets a friendly young man and becomes involved with him, but is he and the creepy driver one and the same?"],
      "budget": 0
   },
   "movielensId": 123099,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-06-01",
      "dvdReleaseDate": null,
      "directors": ["George Bowers"],
      "runtime": 99,
      "movieId": 123099,
      "title": "The Hearse",
      "mpaa": "PG",
      "actors": [
         "Trish Van Devere",
         "Joseph Cotten",
         "David Gautreaux",
         "Donald Hotton",
         "Med Flory",
         "Donald Petrie",
         "Christopher McDonald",
         "Perry Lang",
         "Frederic Franklyn",
         "Olive Dunbar",
         "Al Hansen",
         "Dominic Barto"
      ],
      "imdbMovieId": "0080853",
      "originalTitle": "The Hearse",
      "genres": [
         "Horror",
         "Mystery",
         "Drama"
      ],
      "youtubeTrailerIds": ["PQcC8K_4qT4"],
      "plotSummary": "A schoolteacher moves into her deceased aunt’s house in a small Californian town, and is harassed by unfriendly locals and a mysterious hearse.",
      "tmdbMovieId": 53950,
      "avgRating": 2.2,
      "releaseYear": "1980",
      "numRatings": 5,
      "posterPath": "/vkeBhwkp4RyFNcZalTvKGrhZlUs.jpg"
   }
}