{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "prison",
         "id": 378
      }],
      "imdb_id": "tt0034163",
      "video": false,
      "title": "Sealed Lips",
      "recommendations": [],
      "backdrop_path": "/gv0DhbqCjU4Lh2BEejj8XMFFeNk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Lee Davis",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487c3",
               "name": "William Gargan",
               "profile_path": "/b0MLBWskl7cUtbT2BVJ9Lc2U6IH.jpg",
               "id": 87697,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Lois Grant",
               "gender": 1,
               "credit_id": "52fe4519c3a368484e0487c7",
               "name": "June Clyde",
               "profile_path": "/sM2RLfwvEn0Vy3FcaKF2XAOwjAj.jpg",
               "id": 96287,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Mike Rofano / Fred Morton",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487cb",
               "name": "John Litel",
               "profile_path": "/kpNAy4IYFE3OXaOG60RPhkyp70d.jpg",
               "id": 16766,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mrs. Fred (Mary) Morton",
               "gender": 1,
               "credit_id": "52fe4519c3a368484e0487cf",
               "name": "Anne Nagel",
               "profile_path": "/umJoymalS4sZTPeFEd34iwSWz6O.jpg",
               "id": 34471,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Mrs. Ann Morton (Fred's mother)",
               "gender": 1,
               "credit_id": "52fe4519c3a368484e0487df",
               "name": "Mary Gordon",
               "profile_path": "/u4QD0zsgBgXTi3At0e0ow8VdiEi.jpg",
               "id": 2934,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Lips Haggarty",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487e3",
               "name": "Ralf Harolde",
               "profile_path": "/heTEu0r97pIdhES3OlRNxpkTxFR.jpg",
               "id": 101886,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Chief Charles R. Dugan",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487e7",
               "name": "Joseph Crehan",
               "profile_path": "/ax389ejoXYCtFONwwaGoz2FcVgy.jpg",
               "id": 89729,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Chief Gary Benson",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487eb",
               "name": "Addison Richards",
               "profile_path": "/ztihdDQTNfW1ASDKkMUBGDlRonc.jpg",
               "id": 97007,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Dr. Charles Evans",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487ef",
               "name": "Russell Hicks",
               "profile_path": "/hRRM5ni87mxjlDV2G9jr4GCxFew.jpg",
               "id": 13969,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Warden (as Ed Stanley)",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487f3",
               "name": "Edwin Stanley",
               "profile_path": null,
               "id": 33705,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Attorney Emanuel 'Manny' T. Dixon",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487f7",
               "name": "Charles Lane",
               "profile_path": "/wu5fTupk5atyJlCsHhXPGcdf8Mg.jpg",
               "id": 29579,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Dist. Atty. Slater",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487fb",
               "name": "William Gould",
               "profile_path": "/2K0Bi9wrem2IzsQkLJAvzuGYwnP.jpg",
               "id": 33856,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Investigator Gene Blake",
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487ff",
               "name": "Walter Sande",
               "profile_path": "/f00AxGufQUX1EaO8gKswFUQPyDG.jpg",
               "id": 94293,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487b9",
               "name": "George Waggner",
               "profile_path": "/mXPDqaZCPjFBioLN1IJCltrD4Za.jpg",
               "id": 30129,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487bf",
               "name": "George Waggner",
               "profile_path": "/mXPDqaZCPjFBioLN1IJCltrD4Za.jpg",
               "id": 30129,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487d5",
               "name": "Stanley Cortez",
               "profile_path": null,
               "id": 7648,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4519c3a368484e0487db",
               "name": "Arthur Hilton",
               "profile_path": null,
               "id": 7649,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Crime",
         "id": 80
      }],
      "popularity": 0.611209,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26801,
      "vote_count": 2,
      "budget": 0,
      "overview": "There's something very odd about Romano (John Litel), a notorious gangster serving time in the federal pen. For one thing, Romano doesn't sound much like himself. For another, he always seems to be hiding something. Detective Lee (William Gargan) suspects that something's amiss, and he's probably right! A pedestrian effort with excellent cinematography by Stanley Cortez.",
      "similar": [
         278,
         1701,
         10734,
         29381,
         29259,
         107846,
         1429,
         76640,
         38234,
         9291,
         5925,
         2832,
         1368,
         708,
         5924,
         398175,
         5971,
         6075,
         769,
         500
      ],
      "original_title": "Sealed Lips",
      "runtime": 62,
      "poster_path": "/SAwX67WRysBifCOMe11XvEi8p8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1942-01-02",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Master criminal or missing citizen?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["George Waggner"],
      "runtime": 62,
      "synopsis": null,
      "writers": [
         "George Waggner",
         "George Waggner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0034163/",
      "coverLink": null,
      "actors": [
         "William Gargan",
         "June Clyde",
         "John Litel"
      ],
      "reviews": [
         "This programmer stars William Gargan, June Clyde, Ralf Harolde, Anne Nagel and John Litel in a dual role. Gargan is a California State G-man who gets a rather strange assignment. He is to check on a NY gangster, John Litel, who is about to be released from prison. Gargan's boss, Addison Richards, cannot shake the feeling they have had the wrong man locked up. The guy is just too calm, even after a jail-house attempt on his life. Gargan does a fingerprint check and they match. He decides to humor his boss anyway and pays a visit to San Quentin. He finds Litel planting flowers of all things. Gargan quizzes Litel on his lack of aggression etc during his jail stay. \"I've turned over a new leaf. I'm going straight.\" Litel responds. Gargan and his aide, Ralf Harolde, now grab a flight to NY to check files at a big NY newspaper. The paper has extensive files on Litel going back decades. Gargan uses an insurance man cover to gain access to the files. Newswoman June Clyde is assigned to help Gargan. Gargan goes back 12 years and discovers a article about a man who looked just like the gangster. The police had grabbed the double while looking for Litel. The police had discovered their mistake and released the man. Gargan checks out the name of the double and finds the man has died. He was burned to a crisp in a fire. The corpse had to be identified by his dental records. Gargan decides to pay the man's mother, Mary Gordon, and widow, Anne Nagel, a visit. Again he pretends to be an insurance man checking details on the death. Nagel tells him he was always smoking in bed. Gargan talks Gordon into giving him a book of her sons. Gargan says thanks and heads back to the station to grab a train back to NY. He meets Clyde outside who offers him a ride by car instead. Gargan knows Clyde saw through his cover as she starts to grill him on Nagel. Gargan agrees to give Clyde a story if she will just hold off a while. Gargan needs to check out a few things first. Using the book he just received, he lifts some fingerprints and checks them against the files. The prints match the man in San Quentin. Gargan and Harolde grab a flight back to the west coast for another chat. A couple hours of third degree and the Litel double folds. \"If I did not play ball with Litel, he is going to kill my wife. He told me to do the time and there will be some cash afterwards\". Gargan and partner hop another flight back to NY. They want a word or two with the dentist, Russell Hicks. He had obviously switched the records of the dead man with the double. While all this is happening, we find out that gangster Litel (in a beard) is in hiding till his double's term is up. Litel also knows about Gargan from his prison contacts. Litel even sent a couple of thugs out to rub him out but the hit had misfired. The next day, Gargan has Harolde wait while he checks out the dentist's office. Gargan gets a surprise when he discovers Nagel working in the office. Gargan is shown into Hicks office where several of Litel's thugs grab him up and render him unconscious. It seems Hicks is in Litel's pay and had called Litel when Gargan showed up. The thugs hustle Hicks, Nagel and Gargan out the back to a waiting car and split. When Gargan recovers, he finds himself face to face with the bearded Litel . After a couple of hours of questions, Litel has Gargan locked in a room. Gargan had told him nothing. Litel now sends his two pet gunsels to grab a flight to San Quentin. They are to pick the double up when he gets released in 48 hours. They are to take him for a \"ride\" and then dispose of the body. Litel will follow in his private plane and meet them in California. Then he will make a grand return to NY as a free man. A couple of hours go by and Litel heads off to grab his flight to the coast. Harolde, waits an hour for Gargan to return then bulls his way into the dentist's. He finds the place empty of course. The building janitor tells him about everyone leaving out the back. Harolde knows Gargan has been grabbed but is not sure what to do about it. He runs into Clyde who has come up with a phone number of a house Hicks was always calling. Into a car and off they go to check out the house. Needless to say it is the house where Gargan is being held. Gargan sees Harolde outside and jumps his guard. Gargan hustles Nagel out and sends her off with reporter Clyde to the Police to be safe. Gargan and Harolde now rush after Litel who they catch just before take-off. They then fly Litel back to the west coast. Litel is handed over to the San Quentin warden. He gives Litel some prison garb and a buzz job by the prison barber. The double is put on the phone to NY to talk with his wife, Nagel. Now that he knows she is safe, he agrees to testify against Litel. The NY D.A. calls, because of legal technicalities, Litel cannot be charged in California. Litel is brought back to the warden's and told he can go. Into his suit and out the prison gates the smiling (and beardless) Litel goes. Waiting out front of course are the two gunmen he had sent earlier. Though he claims he is the \"real\" Litel, the heavies just laugh and take him for the \"ride\".",
         "1941's \"Sealed Lips\" was a George Waggner production during a stellar year which included \"Man Made Monster,\" \"Horror Island,\" and his greatest triumph, \"The Wolf Man,\" all of which ended up together in Universal's popular SHOCK! television package issued in 1957. This being one of the infrequent nonhorror titles, it has understandably gone under the radar ever since. John Litel does double duty here, as imprisoned Fred M. Morton, shortly due to be released, and lookalike killer Mike Rofano, casually roaming free despite his many crimes, because he's been looking after Fred's lonely wife Mary (Anne Nagel), who hopes that by cooperating she will eventually be reunited with her real husband. Although the villains are played by such fine character actors as Russell Hicks and Charles Lane, they get shortchanged in screen time, with the investigators receiving most of the footage. The dependable William Gargan heads up the cast, but the dull June Clyde provides zero comic relief, so the most interesting character is the deaf Lips Haggarty (Ralf Harolde), no doubt the inspiration for the title, whose lipreading abilities help crack the case. Harolde usually played shifty gangsters, so this was a welcome change of pace for him, with solid support from Addison Richards, Mary Gordon, Joseph Crehan, and the unbilled Alan Bridge. The pretty Anne Nagel is always worth watching, and was coming off her two best known horror titles, \"Black Friday\" and \"Man Made Monster.\" A victim of tragedy (husband Ross Alexander committed suicide in 1936), the unhappy actress became an alcoholic and died in 1966 at the youthful age of 50.",
         "I didn't know that busy screenwriter \"Joseph West\" was a pseudonym for George Wagner, but IMDb put me right! For this particular movie, however, Wagner receives not only both a director and a writer credit, but a producer credit as well! Some sources say that this film is based on either a 1930 or a 1934 movie entitled \"Beyond the Law\", but that is incorrect. Their respective scenarios bear absolutely no relationship at all to the story in this movie. And it's a good story too, with some really bizarre touches in the writing, the direction and also in the really superb photography by Stanley Cortez (one of my top favorite cinematographers). Admittedly, the movie is inclined to be a bit too talky, but it certainly has a great cast led by William Gargan (pronounced \"Garrigan\"), and the lovely June Clyde, who never really got the breaks she deserved – she was wonderful in the lead role of \"Intimate Relations\" (1937). June was married twice to director Thornton Freeland, from 1930 to 1947, and then from 1950 until his death in 1987."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Mystery"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "The warden of a California prison suspects that a New York gangster who is about to complete his sentence and be released is in reality a double for the real criminal, despite fingerprints and evidence that prove otherwise. The detective assigned to the case, aided by a girl reporter, ultimately establish the correctness of the warden' suspicions, following some adventures, misadventures, a couple of killings and some light romance along the way.",
         "A detective begins to suspect that a man may be in prison for a crime he didn't commit."
      ],
      "budget": 0
   },
   "movielensId": 123028,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-01-02",
      "dvdReleaseDate": null,
      "directors": ["George Waggner"],
      "runtime": 62,
      "movieId": 123028,
      "title": "Sealed Lips",
      "mpaa": "",
      "actors": [
         "William Gargan",
         "June Clyde",
         "John Litel",
         "Anne Nagel",
         "Mary Gordon",
         "Ralf Harolde",
         "Joseph Crehan",
         "Addison Richards",
         "Russell Hicks",
         "Edwin Stanley",
         "Charles Lane",
         "William Gould",
         "Walter Sande"
      ],
      "imdbMovieId": "0034163",
      "originalTitle": "Sealed Lips",
      "genres": ["Crime"],
      "youtubeTrailerIds": ["okoJOXFLyWE"],
      "plotSummary": "There's something very odd about Romano (John Litel), a notorious gangster serving time in the federal pen. For one thing, Romano doesn't sound much like himself. For another, he always seems to be hiding something. Detective Lee (William Gargan) suspects that something's amiss, and he's probably right! A pedestrian effort with excellent cinematography by Stanley Cortez.",
      "tmdbMovieId": 26801,
      "avgRating": 3,
      "releaseYear": "1942",
      "numRatings": 1,
      "posterPath": "/SAwX67WRysBifCOMe11XvEi8p8.jpg"
   }
}