{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1235837",
      "video": false,
      "title": "Happily N'Ever After 2",
      "recommendations": [
         5393,
         44874,
         210288,
         89524,
         13285,
         16962,
         61563,
         21597,
         128841,
         13283,
         161143,
         400649
      ],
      "backdrop_path": "/vPr41JZNJbNF2xLlqtBGDzXWCEd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Little Red Riding Hood",
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c39",
               "name": "G.K. Bowes",
               "profile_path": "/ptMwgN0yj7BkXIEW7GwhiGMSfk1.jpg",
               "id": 563376,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "King Cole / Peter / Humpty Dumpty",
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c3d",
               "name": "Kelly Brewster",
               "profile_path": null,
               "id": 563378,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Pied Piper",
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c41",
               "name": "Doug Erholtz",
               "profile_path": null,
               "id": 94247,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Old Woman in Shoe",
               "gender": 1,
               "credit_id": "52fe46e29251416c75086c45",
               "name": "Jennie Fahn",
               "profile_path": null,
               "id": 166610,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Snow White",
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c49",
               "name": "Helen Niedwick",
               "profile_path": null,
               "id": 563379,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Lady Vain",
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c4d",
               "name": "Cindy Robinson",
               "profile_path": null,
               "id": 219486,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Priest / Rumpelstiltskin",
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c51",
               "name": "David Lodge",
               "profile_path": null,
               "id": 571220,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c29",
               "name": "Steven E. Gordon",
               "profile_path": null,
               "id": 87169,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c2f",
               "name": "Boyd Kirkland",
               "profile_path": null,
               "id": 35267,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e29251416c75086c35",
               "name": "Chris Denk",
               "profile_path": null,
               "id": 109541,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56a9587c9251417dcb0021b3",
               "name": "Jay Oliva",
               "profile_path": "/y7EbnuoKFMvU7uZ4aD50jThyNoF.jpg",
               "id": 105643,
               "department": "Writing",
               "job": "Storyboard"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 3.277724,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 16652,
      "vote_count": 67,
      "budget": 0,
      "overview": "Fairy tales collide when Mambo and Munk tip the scales of good and evil once again.",
      "similar": [],
      "original_title": "Happily N'Ever After 2",
      "runtime": 75,
      "poster_path": "/7E745fZd156nAVoZxrfcO6mi11B.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/hNeuloz4V2nPqBHtnH9cUCyyTEk.png",
            "name": "Kickstart Productions",
            "id": 2526,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "BAF Berlin Animation Film",
            "id": 87859,
            "origin_country": ""
         }
      ],
      "release_date": "2009-03-24",
      "vote_average": 4.2,
      "belongs_to_collection": {
         "backdrop_path": "/fw6YfVOmK0tVtaSUGb3GvLzEmvK.jpg",
         "name": "Happily N'Ever After Collection",
         "id": 141084,
         "poster_path": "/aPjLYxKIBys6dlxXMZrDi8VowQK.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Steven E. Gordon",
         "Boyd Kirkland"
      ],
      "runtime": 75,
      "synopsis": null,
      "writers": ["Chris Denk"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1235837/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYTQ1Mjg5ZWUtODA2Ny00ODgxLWFmOTktMGZkMWQyZTM2NjFiXkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_UY268_CR5,0,182,268_AL_.jpg",
      "actors": [
         "G.K. Bowes",
         "Kelly Brewster",
         "Doug Erholtz"
      ],
      "reviews": [
         "In the Fairytale Land, King Cole is married with his beloved Queen Grace, who is loved by everyone in the kingdom due to her altruism and goodness. Their daughter Snow White mirrors in the example and moral values of her mother, promising to become a fair queen when she grows up. When Queen Grace is seriously ill and finally dies, the widower King Cole raises Snow White alone. The spoiled Snow White becomes a selfish and snobbish teenager for the disappointment of her father. When she goes to an opening party a club with her three best girlfriends Red Riding Hood, Goldilocks and Little Bo Peep, King Cole recommends her to return before the rooster crow. Snow White meets and has a crush on Sir Pete, a handsome young man that was raised in an orphanage supported by Queen Grace that worships her, and arrives in the castle late in the morning. When her father reads in the news that she had cut line in the club, he decides to get married to have assistance in her education and he joins a dating service looking for a wife. Meanwhile, Mambo and Munk accidentally touch the scale of good and evil affecting the fairy tale. The evil Lady Vain teams up with Rumpelstiltskin and using the power a magic mirror, she becomes a replica of Queen Grace. Then she gives an apple with a hex to Snow White, and when she bites the fruit, she tells gossips about her friends and peasants raising hatred by everyone in the realm. Snow White runs away to the woods where she meets the seven dwarfs, who also loved Queen Grace, and they decide to help Snow White to retrieve her mother's values and receive gratitude in return. But the evil Lady Vain is preparing to the luxury wedding in Fairy Tale Land. \"Happily N'Ever After 2\" is an underrated animation with a funny and entertaining story that gives positive messages in a modern way to children in the end. I did not see the prequel; therefore I was not familiarized with the clumsy and hilarious Mambo and Munk, but I liked this update of the classic fairy tale. The voice of Snow White is delightfully amusing and this animation is a nice family entertainment. My vote is six. Title (Brazil): \"Deu a Louca na Branca de Neve\" (\"Snow White Gets Crazy\")",
         "I didn't like Happily N'ever After. I didn't hate it as some did, but it was very bland and lacklustre with the voice work the only real thing to salvage it plus I loved its idea. Happily N'ever After 2 isn't really a sequel I guess, despite the title. Other than Munk and Mambo, there isn't really a connection to Happily N'ever After. I will say I liked the idea, an ironic take on Snow White was a cute and clever idea, and children will like its message which is quite a strong and positive one. It is in the execution though where Happily N'ever After 2 really falls down, just like Happily N'ever After. The animation is very lazy, the colours are plentiful and pleasing but some of the backgrounds are rather plastic-looking and the characters look very forced and move around aimlessly. The music is overdone too and feels out of place, while the film lacks punch and pizazz when it comes to the pace. None of the characters are particularly likable or are given enough time to shine, Munk and Mambo are okay I guess but they are overused a bit and their material doesn't make them very funny in my view. The story is predictable and weak with few surprises, while the jokes and dialogue are pretty much wretched, very derivative and as for those terribly unfunny and obnoxious Hoolla Girls, don't get me started. This time around, even the voice work made little impression, either being bland or having voices that don't suit the character with exception of Lady Vain, her voice actress is quite good. So overall, awful. To be honest, I wasn't expecting otherwise, but I saw it out of curiosity being a lifelong fan of animation and my low expectations weren't dashed. Not the worst animated movie, sequel or movie I've seen, but other than the idea and message not one I'd recommend. 2/10 Bethany Cox",
         "Happily N'Ever After 2 feels a little forced and slightly lame but I think I liked this one a little bit more than the original. Not because it was better but it was easier to watch. You can relate to the idea better and it seemed more believable. It follows a traditional fairytale format that works. By no means would I recommend you watch this movie but it's alright. There are many flaws that are still present including the awkward dialogue and slow-paced storyline. It still shocks me that a sequel was even made as it was never going to save the series' reputation. Just another movie that needs to stay in the bargain bin where it belongs.",
         "I had to watch this movie to believe they could still make a more horrible movie after Happily Never After! And YES, they actually managed to do so. It's really frustrating to read reviews rating this movie 7 stars and more. If you give this movie more than 6 stars, then what are you going to do with the really good ones?! I think they should reinvent the rating system for this particular one. Giving this movie a good rate is actually a slap in the face for all those passionate and creative people who make wonderful stuff with an equally low budget. This movie is just LAZY! Imagine you're in high school and you spent weeks reading a book and writing a really good book report and a fellow student just copy-pastes a book review from the internet without even touching a book, prints it and gets equal marks. That's how creators of great animation must feel when reading any positive review on this movie. There are so many great series and movies for children (not even just Disney, Pixar and Dreamworks films or Don Bluth movies) available that I would never recommend this! It's not like children don't deserve quality. They WILL be able to tell the difference.",
         "this straight to video movie is not really a sequel to the first one.in fact it has little to do with the first one.this one is more of a morality play.it's basically a lesson for the younger set on what really mater in life.it can com across as preachy,but i think tit's supposed to in order to get through to its target audience.it is nice to see a movie that has a positive message once in a while adults may find it tedious though.young children will probably enjoy it and find some education value out of it at the same time.it will probably be lost on most teenagers though.if you have little ones,they will likely enjoy it.",
         "Snow White is a typical teenager who appears very self centred and always seems to be going out with her friends Red Riding Hood, Goldilocks and little Bo peep. Once again Mambo and Munk tip the scales of good and evil and soon Lady Vain and Rumplestiltskin begin making trouble trick snow white into spreading rumours across about the townspeople. With the help of the seven dwarfs Snow White soon learns to restore the people's faith in her and truly learns to care about other people. It is an unusual take on the common fairy tale and in some aspects is a completely new story altogether. It is an enjoyable family film that gets the message of the story across in a unique way. Its story is simple but essentially is an enjoyable film to watch for all of the family. The characters are enthusiastic and great fun watch and a modern day twist on the usual versions of themselves.",
         "There are so many things wrong with this movie. The first was amazing/funny. 1st: The animation was horrible and lots of things were wrong. Also, why was the dwarf's house so big inside? Snow white could easily walk through the door, it was her size perfectly, it should of been much smaller and harder to get in. 2nd: The characters were way too off character, at least Cinderella was like herself and not some brat. This movie felt like it was The Bratz. Why did Peter look almost exactly the same as the guy in the first movie? (forgot name sorry.) Where was Mumbo and Jumbo's boss? There was a lack of him which I hated. 3rd: The voice acting was terrible and not always in sync, why couldn't they keep the voices the same? (for Mumbo and Jumbo)I guess they voice actors could've of changed for a reason but it was really sad when I heard Mumbo's voice had changed, I used to love it so much. 4th:The storyline was just plain horrible. Extra: Snow whites father, the king was offered a drink, he didn't even take a sip, he picked it up and turned around then put it back down. Snow white's red head band was over her ears when she was a kid but when she grew up it was behind her ear? Surely she didn't keep the same head band all those years otherwise it would be dirty and broken at least in some manner.",
         "Such a children's piece like this shouldn't be judged like an intricate masterpiece, but instead, like the nursery rhymes and short stories that we were all used to while growing up. Straight to the point and in a clever way so as to remember the message we are supposed to come away with. This movie is exactly what I was hoping it to be, a cute story that will repeat and three-peat a message that I think so many of our children are not understanding. Such gossip trash and vanity importance should be looked down upon and not taught to our youth. The importance of helping others and being true to yourself is a huge part of life and this movie helps to reiterate such life lessons. This movie is meant for our youth and it's straight to the point. Don't over think this movie and if you are, it's not meant for you.",
         "Did you Remainder Happily N'Ever After? It's so funny in my opinion, But The Bad thing is That Happily N'Ever After got a sequel instead of Valiant despite Valiant having some positive reception from Audiences, and This The Main Reason Why This is the Worst Animated Sequel of all time: 1. Why Did they mandated to get a sequel when The First Happily N'Ever After bombed at the box office, Valiant should get one, because it was a box office hit in the US and The UK (Valiant's organ country) and have Positive Reception from Audiences, What did they put The Valiant Sequel on hold to focus on other stuff, The Long Wait for the Sequel is a Hellhole! 2. The Film's Animation is worse than Foodfight and Norm of the North, It Looks like it's suitable for a PlayStation 1 Game and also, The Film's has loads of errors like when Goldilocks talks, the background moves but not the woman behind her and she disappear in one flame, Why is The Dwarfs' House looks big for Snow White to Go In There Why are they too lazy to make the house so small for the dwarfs, The film's Cheap Animation was so bad that makes Delgo look like a 5 Star Masterpiece and The Emoji Movie look like The Lego Batman Movie, 3. The Story looks like the Writers were on Drugs, Why Did The Fairy Tale Kingdom have Modern Stuff like Cellphones, They don't have that kind of stuff in Fairy Tales, Didn't They research the fairy Tales or something, There's also mean spirited scenes in most parts include Snow White saying rude things about people in the ENTIRE Kingdom, And Despite The Title, There's No Connection to the First Happily N'Ever After, Just a Rehash of the First Movie's Plot but with a few changes, It's More of a Teenage Drama rather than a Comedy that they used in the Original Happily N'Ever After, 4. The use of The Characters are Horrendous as Most of the Characters from the First Happily N'Ever After did NOT Appear, They Replaced them with newer characters such as Snow White which looks like The New Rodrick from The New Diary Of a Wimpy kid Movie The Long Haul, King Cole, Lady Vain, and Others, The only Characters that Appeared in the First Film returned for the sequel are Munk, Mambo, Rumpelstiltskin, The Fairy Godmother and the Dwarfs, But Too Bad that the old Characters appeared in the first film makes Cameos in the sequel, That makes Space Chimps 2 Zartog Strikes Back looks like The First Ice Age, 5. The Voice Acting sounds bad as The Original voice Actors of Munk, Mambo and Rumpelstiltskin are replaced with newer ones, Munk's New Voice Actor sounds nothing like his old and sounds more like a Fat Cow Rather than his Old Voice Actor, Mambo's New Voice Actor sounds nothing like his Old Voice Actor who did Boingo from The Hoodwinked Films and it was so bad that it was Mambo's New Voice Actor's Only Role, and Rumpelstiltskin sounds more like one of Von Talon's Henchmen from Valiant instead of His Old Voice Actor, Almost None of The Voice Actors from the First Movie returned, 6. Vanguard Animation The Creator of Projects Like Valiant and Space Chimps, Have no Interest in the Sequel is Because They Were Busy doing some Other Stuff, Instead The Other Company Made The Sequel Without the help of Vanguard Animation which i got mad about Vanguard Animation NOT Getting Valiant a Sequel and instead Happily N'Ever After got A Sequel. This Movie deserves an 1 Star for Putting Valiant 2 on Hold until They feel like making it, This Is Emily The Cartoon Reviewer, Goodnight",
         "Happily N'Ever After 2 is a slight guilty pleasure. I found it quite humorous to watch one of the most beloved fairy tales get butchered and twisted because I'm just that kind of guy. Apparently, the theatrical release of the first film didn't pay off well enough to merit a big-screen sequel. It did, however, justify the studio milking the concept in a direct-to-DVD format. No voice actor from the original returns – not even the guys who did Mambo and Munk's voices. Imagine, if you will (or care to), a collision between Snow White, Fractured Fairy Tales, and Bratz. Can you picture it? Basically, what you've got is a sort of modernized version of Snow White that still takes place a long time ago in Fairy Tale Land. Somehow, though, all the characters know contemporary slang and even carry cell phones. When Snow and her friends hang up with each other, they say things like \"Holla!\" Now are you getting it? Lucky you. They also go to nightclubs with techno dance music throbbing and disco balls spinning. Sounds like a visual mess, doesn't it? Speaking of a visual mess, let's move on to the animation. It might be passable if it were the year 1995. It just seems plain and aged. Definitely nothing new or attention-grabbing. The only real tie that I could see between the first film and this one are the two \"storytellers\", Mambo and Munk, who control the balance of good and evil. Of course, one of them has to bump the scale over into evil to cause some kind of forward motion in the plotting of this thing. They pretty much end up having absolutely no bearing on the outcome of the story and their segments serve as nothing more than annoying distractions. I guess in closing you have to take into account who this was made for – the kids. Will they be entertained? Most likely. Will it leave a lasting impression on them? Probably not. Let's hope they don't start yelling \"holla!\" at each other. It will no doubt make the studio some extra spending cash. And after all, isn't that what straight-to-DVD releases are REALLY all about?",
         "This is a great sequel. Lots of fun surprises and great characters. The animation looks classic but cool. Definitely recommend this twist on the Snow White tale. It was fun. There were some really hilarious supporting characters. I wasn't expecting much--just considering the first one was really smart and how sequels can be so lame--but in the end I was totally impressed. It had a sweet message that I think a lot of girls will appreciate. And also relate to just growing up and wanting to feel like they fit in. They should definitely make more fairy tale updates like this one because they have actually really smart messages. All in all, this is a fun film.",
         "Are you into fairy tales? This sequel of Happily N'Ever After (Happily N'EverAfter 2) takes a modern twist on the original version of Snow White. In this movie, Snow White is a teenage girl who likes to party and have fun, but does not fulfill her duty as a benevolent princess like her mom. Unfortunately her mom passes away due to sickness, so her dad tries to find a wife who can guide Snow White in the right direction. However, he ends up choosing a beautiful woman who has terrible intentions for Snow White. Can Snow White prevent their marriage and straighten her attitude as well? The idea of this movie is quite creative. Initially I thought this movie would be suited more for young children, but I actually found it a little amusing since some of the characters are teenagers who reminded me a bit of my friends. The movie also conveys positive messages, such as true beauty comes from within. I recommend this movie to kids 7 and up. The animation of the movie is simple, so the facial expressions of the animated characters are easy to comprehend. In addition, the storyline is not complex. Reviewed by Gabriella Chu, age 15, KIDS FIRST! Film Critic",
         "I forgot I hated Happily N'Ever After I. I forgot I hated the stupid creatures, Mambo and Munk. I forgot how bad the animation is. (Compared to other contemporary animations. Barbie is better... and that's much said.) But I'm glad I did, because \"Another Bite @ the Apple\" was better than the first one. In this, Snow White is a spoiled, vain, egocentric brat. She lost her good and kind mother when she was just a kid, and now her life is all party, fun and looks. Her father decides she needs a woman's touch, so he decides to remarry. There is this ugly girl who was told that the Queen was loved by everyone because she was beautiful, so she tried to be as beautiful as the queen had been. The Magic Mirror makes her that. She looks exactly like the Queen, and the King wants to marry her. Snow White isn't happy about it, and mopes, so Lady Vain gets an enchanted apple from the Mirror. She gets Snow White to eat the apple. The apple doesn't kill her, it makes her share her innermost thoughts. This Snow White has something nasty to say about everyone living in the town, and Lady Vain lets everyone know what Snow White thinks about them, and they get angry and Snow White flees from the town. (Remember, the apple didn't twist her mind, she really, truly thought that way.) She finds her way to the Seven Dwarfs, who remember well the Queen, and because of her they decide to teach Snow White a lesson, and they manage to make her change her shallow ways to being as good and kind as her mother had been. So she goes back to the town just in time to interrupt the wedding, and her father decides he doesn't need to marry anymore, now that Snow White has changed. Lady Vain gets ballistic and uses the mirror as a weapon. Earlier Snow White had met \"Sir Peter\", an orphan who grew up in one of Queen's orphanages, and who adores the Queen, and doesn't much appreciate Snow White. Now, that Snow White has changed her ways, Peter notices that he likes her after all. When Lady Vain starts shooting magic around, he jumps in to rescue Snow White, and is knocked out of the way. (and he stays knocked out!) Her father joins the battle but he is old, and is just about to fall, when Snow White joins him and steadies his hand. Together - even Mommy Queen gets to be part of the family union, as they use her picture to guide the magic flare - they break the mirror and Lady Vain is ugly again. They are just about to hang her, when Snow White interferes and tells her outer beauty is not worth much, it's only inner beauty that matters, and the dwarfs agree to teach her the same lesson they taught Snow White. Happy End. Now, it wasn't anything one will regret missing... it's more the other way around. One might regret seeing it... Especially if one paid to see it. It has a nice message - helping others is what makes you beautiful, not clothes and make-up and hairdo. Also, the villain, even though she tried to kill Snow White, is not evil, just misguided, and there's hope for her. Animation, as said, was pretty bad. The king is a poor version of the king in Disney's Sleeping Beauty, and he wears Burger King crown... The wedding is accompanied with Wagner's wedding march, the bride is wearing a white dress, and the priest reads the Christian wedding ceremony... I suppose people wouldn't know otherwise that it's a question of a wedding. And even though the prince... er... Sir Peter, the orphan, I meant, had to fetch Snow White to the wedding, and found her in the middle of the forest fixing Humpty Dumpty, and then they galloped back to the castle and had to get over hurdles to get to the church in time, Humpty Dumpty, and everyone else was in the church already... just in time to witness in favor of Snow White, when Lady Vain claimed she hadn't changed. But if you can ignore such small details, it's not a bad movie. It's not good either."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "BAF Berlin Animation Film",
         "Kickstart Productions"
      ],
      "summaries": [
         "Fairy tales collide when Mambo and Munk tip the scales of good and evil once again. This time Princess Snow White is a misguided teenager who'd rather have fun with friends Red Riding Hood, Goldilocks and Little Bo Peep than help peasants. When Snow White's father is matched up with Lady Vain - a scheming witch brewing to rule the kingdom - Snow White becomes a thorn in Lady Vain's side. Snow White is soon tricked by Lady Vain (with Rumpelstiltskin's help) into spreading vicious gossip about the townspeople, forcing her to flee. Through rebuilding the three little pigs' houses with the seven dwarves leading the way, Snow White learns the value of helping others. Only Snow White can foil her dad's wedding to stop Lady Vain. With Mambo and Munk in tow, Snow White proves she can rule the kingdom, while bringing balance back to the scales of good and evil.",
         "In the Fairytale Land, King Cole is married with his beloved Queen Grace, who is loved by everyone in the kingdom due to her altruism and goodness. Their daughter Snow White mirrors in the example and moral values of her mother, promising to become a fair queen when she grows up. When Queen Grace is seriously ill and finally dies, the widower King Cole raises Snow White alone. The spoiled Snow White becomes a selfish and snobbish teenager for the disappointment of her father. When she goes to an opening party a club with her three best girlfriends Red Riding Hood, Goldilocks and Little Bo Peep, King Cole recommends her to return before the rooster crow. Snow White meets and has a crush on Sir Pete, a handsome young man that was raised in an orphanage supported by Queen Grace that worships her, and arrives in the castle late in the morning. When her father reads in the news that she had cut line in the club, he decides to get married to have assistance in her education and he joins a dating service looking for a wife. Meanwhile, Mambo and Munk accidentally touch the scale of good and evil affecting the fairy tale. The evil Lady Vain teams up with Rumpelstiltskin and using the power a magic mirror, she becomes a replica of Queen Grace. Then she gives an apple with a hex to Snow White, and when she bites the fruit, she tells gossips about her friends and peasants raising hatred by everyone in the realm. Snow White runs away to the woods where she meets the seven dwarfs, who also loved Queen Grace, and they decide to help Snow White to retrieve her mother's values and receive gratitude in return. But the evil Lady Vain is preparing to the luxury wedding in Fairy Tale Land."
      ],
      "budget": 0
   },
   "movielensId": 123093,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-03-24",
      "dvdReleaseDate": null,
      "directors": [
         "Steven E. Gordon",
         "Boyd Kirkland"
      ],
      "runtime": 75,
      "movieId": 123093,
      "title": "Happily N'Ever After 2",
      "mpaa": "",
      "actors": [
         "G.K. Bowes",
         "Kelly Brewster",
         "Doug Erholtz",
         "Jennie Fahn",
         "Helen Niedwick",
         "Cindy Robinson",
         "David Lodge"
      ],
      "imdbMovieId": "1235837",
      "originalTitle": "Happily N'Ever After 2",
      "genres": ["Animation"],
      "youtubeTrailerIds": ["omxbDkvXhXI"],
      "plotSummary": "Fairy tales collide when Mambo and Munk tip the scales of good and evil once again.",
      "tmdbMovieId": 16652,
      "avgRating": 2.29167,
      "releaseYear": "2009",
      "numRatings": 12,
      "posterPath": "/7E745fZd156nAVoZxrfcO6mi11B.jpg"
   }
}