{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0129119",
      "video": false,
      "title": "The Golden Age of Comedy",
      "recommendations": [],
      "backdrop_path": "/22MZwBErraaWinX6LctsWqqowLo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f385",
               "name": "Stan Laurel",
               "profile_path": "/cYrYC6qpRng0aB34zscpxMGxdx3.jpg",
               "id": 89670,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f389",
               "name": "Oliver Hardy",
               "profile_path": "/abqNQE8qBjUIB4NMQE4OiIOulmI.jpg",
               "id": 78057,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f38d",
               "name": "W.C. Fields",
               "profile_path": "/hPUjAJE8HAzMJhH1oc2p3mdDAVj.jpg",
               "id": 13954,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f391",
               "name": "Harold Lloyd",
               "profile_path": "/aE1pPjEoYOVeG9BtqoYkKePzgCd.jpg",
               "id": 88953,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4752c3a36847f812f395",
               "name": "Buster Keaton",
               "profile_path": "/8weZnW4cxkbMxtFAtO1NhfTrM9D.jpg",
               "id": 8635,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4752c3a36847f812f39b",
            "name": "Robert Youngson",
            "profile_path": null,
            "id": 1022676,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.339191,
      "production_countries": [],
      "id": 47993,
      "vote_count": 1,
      "budget": 0,
      "overview": "A compilation featuring comedic stars of the silent era including Laurel and Hardy, Buster Keaton, W.C. Fields and Harold Lloyd.",
      "similar": [],
      "original_title": "The Golden Age of Comedy",
      "runtime": 79,
      "poster_path": "/1Q1aIJ5nToyKAK0YdXfwUbh5wEd.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1957-12-26",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "Any age is the golden age for...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Youngson"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Robert Youngson",
         "René Clair"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0129119/",
      "coverLink": null,
      "actors": [
         "Stan Laurel",
         "Ward Wilson",
         "Oliver Hardy"
      ],
      "reviews": [
         "This film was a lot of fun to watch--with some wonderful clips of Laurel and Hardy, Charlie Chase and others. What a lot of fun stuff! However, there is a BIG, BIG problem with the film. Nowhere in it do you see clips of Chaplin, Keaton or Lloyd--the three biggest film comedians of the 1920s. This is akin to a documentary about the 1960s without mentioning Vietnam or The Beatles! It's obvious that Robert Youngson just didn't have access to these other clips or he simply slapped them together without considering this. In his next film, WHEN COMEDY WAS KING, you DO get to see clips of Chaplin and Keaton--but, unbelievably, there is no Harold Lloyd! Well, if you JUST watch the film for its entertainment value, it's great. If you watch it for a historical overview, it is sadly incomplete and gives a false impression of the era.",
         "In 1957 Robert Youngson directed The Golden Age of Comedy which is a documentary with clips from the silent movies with our favorite comedians.You can see Stan Laurel and Oliver Hardy as jail birds who escape and they have to prove that they are painters.And in one clip Laurel and Hardy are having problems with cars and especially with the ones who are driving them.And who could forget the legendary pie throwing scene.The baby face Harry Langdon, offers lots of funny moments in the train.Billy Bevan and Mack Sennett's Cameo dog are hilarious.There are also clips from actors such as Will Rogers, Carole Lombard, Jean Harlow and the cross eyed Ben Turpin.For true silent comedy lovers it is impossible to get bored with The Golden Age of Comedy.Watch these golden clips from the silent era and have fun!",
         "From the age of the Pie Fight comes this marvellous compilation by Robert Youngson.Watching it you can judge how much sheer joie - de vivre has been lost with the so - called \"sophistication \"of movie comedy in the ensuing decades.And where are the geniuses to rival Mr Chaplin and Mr Keaton?Who,today,is as universally loved as Mr Laurel and Mr Hardy whose masterwork \"Big Business\" is featured here? Feel free to laugh uproariously.....\"For Ghosts may be listening.\" \"The Golden Age of Comedy\" used to be a staple of Christmas Day TV. Sitting there watching it with a mince pie and a glass of port must be the nearest thing to paradise this side of the Elysian Fields.",
         "THE GOLDEN AGE OF COMEDY was producer-director Robert Youngson's first compilation feature film consisting of clips from silent era comedy shorts. The movie was a surprise hit in 1957 and led to six more films of this nature spanning into 1970 as well as 1964's THE BIG PARADE OF COMEDY with clipped MGM feature films. This obviously isn't the best way to see silent comedies but it's very good and was a very rare chance for the general public in the 1950's and 1960's to see silent movie footage, particularly on a theater screen and certainly Youngson's films were an invaluable contribution to the burgeoning popularity of these vintage films which had begun to find their way onto the home movie market via Super 8, 8mm, and 16mm. A number of the reviewers here have panned or given limited praise to this film because of the conspicuously missing silent era legends like Chaplin, Keaton, and Lloyd however the movie never suggests it is an definitive look at silent comedies just a \"memory book\" of what the era was like and the type of wild humor audiences enjoyed some thirty earlier. The clips all come from either Hal Roach or Mack Sennett films and are actually limited to 1920's films, nothing from the 1910's that I can tell. Laurel and Hardy enjoy the most footage with an extended abbreviation from TWO TARS (an interesting look at 1920's road rage which we are told is one of the acknowledged classic shorts but actually seems one of the less funny of the segments given it's fairly repetitive and predictable). I think the boys are better served by footage as ingenious prisoners who paint their way to an escape, a short but funny bit about the perils of reading street signs in the dark, or walking city streets with open manholes. There's also footage from the classic DOUBLE WHOOPEE thanks to Jean Harlow's legendary appearance in the short in her shorts. Harry Langdon called \"one of the great four comedians of the screen\" (the other three are not mentioned by name but we know who they are) in a segment that is cute but underwhelming. At least it's better than the seldom funny Ben Turpin or Will Rogers' surprisingly not too successful attempts at burlesquing movie heroes from the short UNCENSORED MOVIES. Lovely teen-aged Carole Lombard is shown in footage from RUN GIRL RUN where most of the comic gags are played by pint-sized coach Daphne Pollard or fat girl Madelyne Field. One of my favorite comedians, Charley Chase is seen in an amusing segment with a brat kid and a circus lion. Surprisingly much of the funniest footage comes from unheralded (and often uncredited here) comics in various early bits as well as a checkers-playing cat and poker-cheating dog. There is an extended quite funny pie fight riot as well as pants-pulling, knee-kicking street war led by Laurel and Hardy as well as such stock silent comedy staples as the horse-driven fire engines, train tunnels, criminals on the loose on a train, houses falling apart like paper, et al. Do try to see these comics in unedited form in their original films but if you get a chance don't miss checking out Youngson's historic films that introduced silent comedy to a whole new audience a half-century ago.",
         "This is one of Robert Youngson's compilation features from the early 1960's. Youngson took clips from the silent slapstick films and spliced them together in a nostalgic look back at comedy of yester year. Youngson turned out a good number of these films and they all work to varying degrees.Here Youngson concentrates on some of the lesser known comedians from the era with varying degrees of success. The biggest names in this film are Laurel and Hardy and the section of the film that concentrates on their film appearances consists of an edited version of their classic silent film Two Tars. Two Tars consists of a giant traffic jam that deteriorates into a battle between drivers where everyone begins to wreck everyone else's cars. It's a very funny film that has been very craftily cut down to about one third of its running time. It's a good film but possibly the weakest of Youngsons films that I've seen. That said it still supplies a good many laughs and is worth your time",
         "Film compilations like this are a treat for modern day viewers who weren't around when the stars of the 1920's made their mark in silent films. When I read that sentence, I realize there's virtually no one left today who was born that long ago and still with us. The clips in this picture were put together in 1957 by Robert Youngson, and if you don't mind the exclusion of Chaplin, Keaton and Lloyd, it's a nice little foray into the movie world of directors Mack Sennett and Hal Roach. The lion's share of the film is devoted to Laurel and Hardy, although a real life lion shows up in various bits for some amusing visuals. All the clips are silent of course, haling from the 1920's and presenting many of the celebrities of the era. Clips featuring Will Rogers, Douglas Fairbanks, Tom Mix, Carole Lombard and Jean Harlow come and go rather quickly. A bit more time is spent on comics like Ben Turpin and Harry Langdon, considered by the narrator as one of the four greatest comedians of all time. Well, that was back in 1957, we've had a lot of time since then to produce a whole lot more. Langdon seems to be all but unknown today compared to his unnamed contemporaries I mentioned earlier. There are some amusing bits here, one of the better ones comes from Laurel and Hardy's \"Double Whoopee\" featuring the Harlow skirt pull scene. If one's tastes run to the old pie toss routine, the all time extravaganza involving an entire neighborhood is presented courtesy of our pals Stan and Ollie once more. They're also at the center of a massive street brawl where just about everyone loses their pants. Get your mind out of the gutter, it wasn't like that; this one ended with the boys leaving the scene in a single pair of slacks, almost like a bicycle built for two. For animal lovers, there's even a handful of scenes featuring some furry friends, with a checkers playing cat outwitting his human opponent, and a wily canine adept at cheating in a poker game. The animals seemed pretty talented for what was required of them, leading me to wonder why we don't see more clever critters in movies today. Then again, who wants to be upstaged by a cute kitty.",
         "This well-meant but misleading compilation celebrates the glory days of silent film comedy, for the most part through mediocre excerpts from the Max Sennett and Hal Roach Studios, which even at their peak could never match the sophistication of a Chaplin, Lloyd, or Keaton two-reeler. The repertory of Sennett and Roach gags rarely extended beyond mild parody, primitive slapstick, and artificial trick effects, giving an entirely false but lasting impression of silent comedy as nothing but frantic pratfalls and pie fights. The exception here is Laurel and Hardy, whose deliberate methods of wreaking mayhem overturned the time honored formula of fast and furious chases. Happily, the film gives them extra attention, but the majority of footage is devoted to second-rate clowns like Billy Bevan and cross-eyed Ben Turpin. Even the great Harry Langdon is represented only in a clip from a minor Sennett short which gives little indication of his unique talents, and the enthusiastic voice-over narration underlines his lackluster antics with forced wit and too many puns.",
         "Robert Youngson's first big compilation of silent comedy clips holds an important place in the history of film. Before this film, silent films were viewed as creaky antiques, suitable only for the occasional sneering jeer, like the \"Goofy Movie\" series and the rare fond memory of old-timers. It was only beginning in 1949, with Walter Kerr's article on the \"Four Greats\" of silent comedy, that a reappraisal began. If, as some reviewers complain, there is no Lloyd, Keaton or Chaplin available here, well, their place was already being reestablished or, in Chaplin's case, had never been questioned. If the movie begins with a series of clips from the Sennett studios, it was surely Sennett's reputation which had sunk lowest, until he was recalled only as a purveyor of primitive pie fights in worn-out prints. Here, Youngson offers them in clean copies with admiring voice-overs and good musical accompaniment. If they're not the way the audience was intended to see them -- as complete films -- this surely shows them off to advantage as they had not been seen in thirty years. If nowadays the purist sneers at the film's perceived shortcomings, he should recognize that without Youngson's daring and surprisingly successful offering here, that purist would probably have never heard of those talents; given that almost all that survives of the Laurel & Hardy THE BATTLE OF THE CENTURY exists only because Youngson put most of its second reel here....",
         "BY THE TIME that this first celluloid primer on the screen clowns of the Silent Screen hit the movie houses, the movies had been talking for about thirty years. It was 1957 and the USA was enjoying probably the most prosperous of times ever. We all had the marvels of Televisioon, right in our own living rooms. SO WHY, YOU may ask, just why were we invited to our local neighborhood movie shows to view a 79 minute compilation of what was now considered obsolete, old hat, passé? All of us kids were familiar with \"Old Time Movies\" from their being screened on the various TV stations around the country. Names such as: Snub Pollard, Harry Langdon, Bobby Vernon and even the Mickey McGuire Series (starring a young Joe Yule, Jr.*) were all known to us. BEING AN OBVIOUSLY Silent Film buff, Producer/Writer/Director Robert Youngson, set out to pay proper tribute and respect to both the Art Form and to those Men & Women who made it what it was. THE GOLDEN AGE OF COMEDY was his first installment. THE CRAZY QUILT of a movie is made up of a multitude of clips taken from shorts featuring a array of actors' finest work. Getting high billing were names like: Will Rogers, Carole Lombard, Jean Harlow, Ben Turpin, Harry Langdon, Charley Chase, Billy Bevan and Andy Clyde. Stan Laurel & Oliver Hardy were given a Lion's share of the screen time; Mr. Youngson obviously being a buff. WE REMEMBER SEEING the \"coming attractions\" at a Saturday Matinée, and the kids all enthusiastically cheered for Laurel & Hardy when they were mentioned. Once again, they were familiarized to us through the miracle of the Television Tube. WE DID PAY our two bits to see it and very much enjoyed the samplings of clips from so many movies with so many unknown names. The narration was very informative, the music was both appropriate and acted as a very fine instrument for amplifying the visuals before us. UPON FURTHER CONSIDERATION, all these decades later, we now have noticed something about THE GOLDEN AGE OF COMEDY that very well may not be readily observed before. Although what we saw was great in its own right, where were the big stars? THERE IS OBVIOUSLY omissions of what has been called the \"Big Three\" of the Silent Screen Clowns; those being: Charlie Chaplin, Bjuster Keaton and Harold Lloyd. ALTHOUGH THIS WAS most likely done deliberately, we believe that there was no malice involved. FIRST OF ALL, availability of films would be the prime moving force here. If they ain't out there, no one can get them. The accessible films must also have a price tag on their licensing that is within budget.(That makes two reasons). THIRD WE BELIEVE that time constraints would not allow the proper attention to be given to the major Stars. A compilation such as this is, after all, an anthology; as well as being a sort of overview or survey, if you will. LASTLY, THIS MID to late fifties was only a few, short years removed from that era of hearings by the House Committee on Un-American Activities and the staunch Anti-Communist sentiments of the day. It was in 1952 that the now very prosperous Mr. Charles Chaplin refused to fill out a declaration for American Officials; opting to stay in Europe, rather than returning to the U.S. MOST OF THESE shortcomings were remedied in the very next Youngson production, WHEN COMEDY WAS KING; which prominently displayed works by Keaton and Chaplin. Harold Lloyd was still absent, tough. Owning the rights to most of his major films, he opted for a compilation of his own, HAROLD LLOYD'S WLORLD OF COMEDY (1962)."
      ],
      "genres": [
         "Comedy",
         "Documentary"
      ],
      "productionCompanies": [],
      "summaries": ["A compilation of scenes featuring some of the best-known comics from the silent era in their best films."],
      "budget": 0
   },
   "movielensId": 123042,
   "movielens": {
      "languages": [""],
      "releaseDate": "1957-12-26",
      "dvdReleaseDate": null,
      "directors": ["Robert Youngson"],
      "runtime": 79,
      "movieId": 123042,
      "title": "The Golden Age of Comedy",
      "mpaa": "G",
      "actors": [
         "Stan Laurel",
         "Oliver Hardy",
         "W.C. Fields",
         "Harold Lloyd",
         "Buster Keaton"
      ],
      "imdbMovieId": "0129119",
      "originalTitle": "The Golden Age of Comedy",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A compilation featuring comedic stars of the silent era including Laurel and Hardy, Buster Keaton, W.C. Fields and Harold Lloyd.",
      "tmdbMovieId": 47993,
      "avgRating": 3.33333,
      "releaseYear": "1957",
      "numRatings": 3,
      "posterPath": "/1Q1aIJ5nToyKAK0YdXfwUbh5wEd.jpg"
   }
}