{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "black people",
            "id": 577
         },
         {
            "name": "slavery",
            "id": 2831
         }
      ],
      "imdb_id": "tt0026966",
      "video": false,
      "title": "Sanders of the River",
      "recommendations": [],
      "backdrop_path": "/2EXPKLuX7snM4nKu3N4NCWwQf2u.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bosambo",
               "gender": 2,
               "credit_id": "52fe49aa9251416c910b4af9",
               "name": "Paul Robeson",
               "profile_path": "/7C2v4rYZcrdzAWMZNRWt9v7Owgb.jpg",
               "id": 98568,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Commissioner R.G. Sanders",
               "gender": 2,
               "credit_id": "52fe49aa9251416c910b4afd",
               "name": "Leslie Banks",
               "profile_path": "/3gElBkEymTBwbLX8sWyOSAP7cgG.jpg",
               "id": 20502,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Lilongo",
               "gender": 1,
               "credit_id": "5436b1d0c3a3681131002a88",
               "name": "Nina Mae McKinney",
               "profile_path": "/w63YewOOZMiCQwEHV14wyGhKYbE.jpg",
               "id": 127560,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Lieutenant Tibbets (as Robert Cochrane)",
               "gender": 0,
               "credit_id": "5436b1e80e0a2624b90028a2",
               "name": "Robert Cochran",
               "profile_path": null,
               "id": 1372534,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "J. Ferguson",
               "gender": 2,
               "credit_id": "5436b1f6c3a36842210027df",
               "name": "Martin Walker",
               "profile_path": null,
               "id": 157336,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49aa9251416c910b4b03",
               "name": "Zoltan Korda",
               "profile_path": null,
               "id": 65852,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5436b1ab0e0a264d7300292f",
               "name": "Lajos Biró",
               "profile_path": null,
               "id": 71789,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5436b1b60e0a264d6600296f",
               "name": "Jeffrey Dell",
               "profile_path": null,
               "id": 228809,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5436b1c3c3a368340700291d",
               "name": "Edgar Wallace",
               "profile_path": "/oRCR5rawKozaHLmFm27qfJn7rl4.jpg",
               "id": 3485,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.197233,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 86956,
      "vote_count": 2,
      "budget": 0,
      "overview": "British District Officer in Nigeria in the 1930's rules his area strictly but justly, and struggles with gun-runners and slavers with the aid of a loyal native chief.",
      "similar": [
         967,
         76203,
         869,
         871,
         12437,
         553,
         4982,
         497,
         1579,
         37430,
         873,
         74,
         98,
         299687,
         147441,
         131631,
         595,
         6844,
         17610,
         1372
      ],
      "original_title": "Sanders of the River",
      "runtime": 98,
      "poster_path": "/o9x5pvAVQyrUDdE6qtZe1g6cm2M.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "London Film Productions",
         "id": 659,
         "origin_country": ""
      }],
      "release_date": "1935-05-10",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "He Breaks Loose in the Jungle!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Zoltan Korda"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Lajos Biró",
         "Jeffrey Dell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0026966/",
      "coverLink": null,
      "actors": [
         "Paul Robeson",
         "Leslie Banks",
         "Nina Mae McKinney"
      ],
      "reviews": [
         "Viewed today, 74 years after the film came out Sanders Of The River is a paradoxical film with the good and bad of British colonial attitudes of the 19th century. It's based on the first novel by Edgar Wallace, prolific British author who spent much time in Africa during the latter 19th and early 20th century. Sanders played by Leslie Banks is the local administrator of an area of what is now Nigeria and a man who is confidently shouldering the white man's burden as he saw it. Nevertheless he's probably the best representative of his type in the area, someone the British see as the best in themselves. He's taken the trouble to study the languages and cultures of the various tribes in his area and mixes in the local politics judiciously and fairly. When one of the tribal kings, Tony Wane, starts resorting to the slave trade which the British fought vigorously to suppress, Banks comes up with his own instrument of enforcement. His instrument is rival king, Paul Robeson of a different tribe and on that the plot of Sanders Of The River turns. Robeson was over in the United Kingdom at the time because he could not get the kind of film roles he wanted in the USA with America hung up on stereotypical blacks. Though the film is a salute to the judiciousness and fairness of British colonial role, Robeson took the part because I believe it gave him a chance to show the real Africa. There is no way America was ever going to make this kind of film. After MGM's near disaster with Trader Horn, American companies shied from location shooting until there until The African Queen and King Solomon's Mines. Though taking place in the Nigeria area, the film was shot on location in the Kenya colony and we learned that the first Kenyan president, Jomo Kenyatta actually was an extra in this film. Robeson gets a chance to sing a couple of songs written by Mischa Spoliansky and Arthur Winder, but are as good in the black idiom as Gershwin's Porgy and Bess. No way Paul Robeson would have sung them if they weren't. Robeson is joined in the vocal department by Nina Mae McKinney who scored big in King Vidor's Hallelujah, but was then unable to find decent roles for a beautiful black singer. That would wait until Lena Horne came on the scene and not altogether satisfactorily done there. She plays Robeson's wife and mother of his child and her capture by the rival king sets off a potentially nasty blood bath. Sanders Of The River though incredibly dated should be seen quite frankly because of that. Robeson's singing voice is at its best here and this is a picture of Africa you won't get in Tarzan films.",
         "Paul Robeson is the star in this Ripping Yarn, with the British keeping the 'picaninnies' under control in Nigeria. A number of pastoral African scenes of the National Geographic variety (if you know what I mean) are included in this story of the conflict between two tribes in the African heartland. Don't believe the undergraduate comments here - this is nowhere near as racist as the B grade American films made in the same era (\"The Jazz Singer\" for instance, and it's ilk), or TV series of the fifties - the Africans are dead glamorous and brave, and the British characters wooden and two-dimensional.",
         "I have mixed feelings about this film. First off, like one reviewer, I was surprised at the topless natives. I would have thought the censors would have cut that out. Paul Robeson played a man who made himself a chief so he could run a tribe. In the movie, only the British could authorize a man to become a Chief. I guess the natives were not authorized to make their own Chief--I thought that was strange! Even stranger, a British authorized Chief had to be given a medal on a chain to wear around his neck--kind of what a rapper would wear today. This medal indicated an authorized Chief. Sandy did try to rule in a fair manner, learned native customs, and learned some native languages. I did dislike how the natives had to call the British Lord and to act like children. The British treated the natives like children. The part that Robeson played was of an extremely smart man. Everything the British told him to do after making him Chief he had already thought of and done on his own. The look on Robeson's face was of a man purposely acting like a child while all the time he was ten jumps ahead of the white man. The look on the British was he knew Robeson was smart and Robeson knew the British knew but each had to play their own part. I thought the movie was worth watching.",
         "The lines are often unintentionally funny (\"My king -of England - is the greatest king on Earth!\" \"I'm sending you to Sandi\" ) and the movie is Tarzanesque,with its evil chief rubbing his hands before killing a good guy .The natives are big irresponsible children who desperately need the help of the white men and above all Lord -Sandi-Sanders.When he's away (they say he's dead),there's no law anymore;but when he's back,so is the law.It speaks volumes about the paternalistic side of this obsolete work:English colonizers are here to bring justice,peace,love and understanding,their intentions are so pure their black protégés (the good ones that is) cannot make up their minds without Father Sandi's piece of advice. The good chief's songs are closer to Negro spirituals than to African folklore .And the lullaby his wife sings to her little black dove would fit nicely in a Disney cartoon,such as \"the Lion King\" .",
         "Although the title refers to the British commissioner of the N'Gombi district of Nigeria during the Colonial days of the British Empire, Paul Robeson's magnificent rich baritone voice is easily the highlight of this well-made but dated film. Looking at it from the 90's perspective, I was appalled to see the native blacks treated as savages and children at the same time. Paul Robeson expected a different kind of film and unsuccessfully fought its release after it was completed. Leslie Banks plays Commissioner Sanders, called \"Lord Sandy\" by the natives, and oversees the various competing and sometimes hostile tribes. In the last five years, there has been peace among the tribes due mostly to the respect and fear of him. Robeson is a prison escapee who has been chief of the Ochuri tribe for the last five months, an illegal act without permission from Banks. He goes to Banks to claim that chiefdom, and Banks, knowing who he really is, and sensing he is a good man, proclaims him chief on the basis of those last five months. It pays off when word comes that Chief Mofolaba (Tony Wane) has been raiding other tribes to gather slaves, and Banks has Robeson and his warriors capture him and free those captives. It's a humiliation that Mofolaba swears he will revenge. Among the captives is lovely Nina Mae McKinney, who Robeson takes for his wife, and who bears him two children during the next five peaceful years. When Banks decides to take a year's leave of absence to return to London to get married, two villains spread the word that Banks is dead and there is now no law. They expect to profit by selling guns and gin to the natives. Mofolaba kills Banks' replacement and has his men kidnap McKinney to use as bait to lure Robeson to his land so he can have his revenge. Meanwhile, word gets to Banks, who hasn't yet left for London, about his replacement's death and the general lawlessness that now prevails, and he starts to return to Mofolaba's land. And Robeson takes Mofolaba's bait, but is captured and tied to a post next to the post that McKinney is tied to. Mofolaba promises him a slow death after he witnesses McKinney's death.",
         "This British release from 1935 gets a mixed review from me. On one hand, it is wonderful to see Paul Roberson in a film role, but that enjoyment is tainted somewhat by the way the film portrays native Africans. Sanders is the white man in charge of the district. He treats all of the tribal chiefs and their subjects as if they were his black \"children\". This theme is repeated so frequently in the film that it seems the filmmakers were--rather defensively--trying to make a point. On the other hand, such arrogant hogwash is routinely part of colonialism wherever it is manifest, so the film's depiction of such racism is accurate. In my opinion, the best part of the film are the many shots of native life, especially native dances and rituals. We also see various African animals in their natural habitats, even if they are sometimes being stampeded by low-flying aircraft. The plot of this film was not very engaging. But it is worth noting that the real villains of the film are two white men who wish to stir up the tribes by giving them gin and rifles--apparently just because their only goal in life is to stir up trouble. The African chiefs and kings seem too Anglicized, and Robeson sings some songs that feel out of place in the mouth of a chief. But I found enjoyment in pieces of this film, if not in the whole.",
         "\"Sanders of the River\" is trapped in the time of its creation like an insect in amber, but it's worth seeing if only to understand the expectations of that time. The British characters are supposed to be the heroes of the tale, but they are wooden and unsympathetic, even interchangeable. It is impossible to care about them. They even chase animals from a plane Just For Fun. Africans are portrayed as simple minded, but they are also clearly loyal, brave, loving individuals with some (limited) depth to them, which is more than can be said of the cardboard cut-out white characters. In fact, the real rotters of the tale are trouble-making whites.",
         "In reviewing films involving African-Americans in chronological order for Black History Month, it's now 1935 when singer/actor Paul Robeson has gone to England for this movie produced by Alexander Korda's London Films with direction by Korda's brother Zoltan. It takes place and is partially filmed in Africa and concerns a British colonialist (Leslie Banks) who places Robeson in charge of keeping peace among various tribes especially when the tribal king (Tony Wane) seems intent on abusing his power. Later on, Robeson meets Nina Mae McKinney and makes her his wife and they have a couple of kids. I'll stop there and just say despite some questionable politics that permeate the film, this was quite a rousing adventure to watch what with many of the wonderful scenery along the countryside with various beautiful animal shots not to mention the wonderful singing voices of Robeson and, in one instance, Ms. McKinney. And the sequences of the tribes, whether chanting or going into battle, bring plenty of excitement to bear. So on that note, Sanders of the River is at the very least, well worth a look.",
         "I recently saw THE MOST DANGEROUS GAME recently and was slightly disappointed by it , a fact not helped by Leslie Banks performance . Banks was supposedly a well regarded actor but it should be remembered that GAME was a very early screen performance from him . SANDERS OF THE RIVERS is a film produced and directed by the Korda brothers , two Hungarians who moved to Britain and became major players of British cinema in the 1930s . Looking through the cast list now it's probably not the names of Banks or Korda that'll grab your attention but Paul Robeson . If you've got a film called SANDERS OF THE RIVER and it stars a black singer you don't need a Masters degree in geography to see where the film might be heading SANDERS OF THE RIVER is painfully dated in its social mores . Putting it in to context the British Empire was alive and well and if Britain hadn't conquered most of Africa then it would have been conquered by the French and who wants to be ruled by the French ? Or indeed the Spanish or the Americans ? There is a strong element of casual racism to this scenario but it's certainly no worse than those dreadful Tarzan movies and the dated elements do have an entertainment value to them that are unintentional . One thing that is genuinely shocking watching it now is the female African natives who are topless As expected the production budget couldn't involve taking the crew to deepest Africa so to hide this fact the designers have stuck some African looking huts in a field in England and editor Charles Chrichton - who went on to become a highly regarded director - splices in some stock footage of African landscapes and wildlife trying to but not quite convincing the audience the locations are real . The story itself is very basic and involves Sanders mentoring Robeson's jolly good egg Chief Bosambo that rival tribes are causing trouble and need to be taught a lesson . Cue The Killing Song which involves \" When the enemy comes be ready to fight . On in to battle make a lot of rattle mow them down like cattle ... \" Robeson himself supposedly disowned this film due to the racist stereotyping but looking this up on the internet there's some dispute about this and he perhaps had another reason for disliking it . Certainly it's difficult to believe before filming started that Robeson wouldn't be playing an African stereotype . That said Robeson is the best thing about the film and you'll remember The Killing Song for days afterwards . All together now \" on in to battle , make a lot of rattle , mow them down like cattle ...",
         "Impossible to watch through 21st century eyes,\"Sanders of the river\" belongs to the \"Saturday Morning Pictures\" school of movies.I saw dozens like it in my local Odeon (Our Dominion Extends Over Nations) as a small boy.Wise white man benevolently ruling over spear waving savages,chattering monkeys,trumpeting elephants,and other denizens of the Dark Continent.Most of the savages had bones through their noses and danced round the cooking pot chanting gibberish.They were badly-made,with unsteady scenery,crackling soundtracks and startling inadvertent jump-cuts.Nobody you ever heard of was in them and we forgot about them as soon as we got out into the daylight. Unfortunately there were some well-known actors in \"Sanders of the river\" it was well made and very popular in its day.Now it seems slightly hilarious to give it the broadest possible benefit of the doubt. If you go to see it don't take Spike Lee.",
         "Leslie Banks stars as the title character, a British officer who manages to keep the peace between the African tribes loyal to His Majesty and those loyal to the African king. His right-hand man, one of the tribal leaders, played by Paul Robeson, does all he can to help Banks maintain the peace, but when Banks takes a trip away from the region, all heck breaks loose. Robeson tries his best to stem the tide of revolution against the British in Sanders' absence. Zoltan Korda directed this surprisingly lesser-quality film, but actually wanted to make a more positive film in regards to its portrayal of Africa, but sadly he was dissuaded. Also, it is sad to see Robeson, such a political force for equality in real life, play a stereotypically subservient role to Banks. The film was based on Edgar Wallace's novel at the urging of the film's producer and director's brother, Alexander.",
         "I am rather surprised that a man of Paul Robeson's convictions would agree to star in this film. That's because this British production STRONGLY reinforces that colonialism is good as well as the paternalistic view of black Africans. In other words, the people of Africa, according to the film, are too violent and dumb to rule themselves. And, when the British aren't there, the folks quickly regenerate to tribal warfare. While there is some truth to the stabilizing influence of the British, this film seems to say that the ends DOES justify the means. So, taking over the nations and running them is okay according to the movie. And, considering how strongly Robeson fought for racial equality, it is odd indeed that he'd been in a film like this--and play a part of a character that completely buys into this system. Apart from the message reinforcing the status quo, is the film worth seeing? Well, yes. Technically it looks really good--far better than most African films of the era (which often showed irrelevant stock footage at every turn) and it was nice to hear Robeson's melodious voice. And, it is entertaining. By the way, Robeson's name in the film was Bosambo! With this and the plot, you can see why he disowned the film when it debuted!",
         "Tells the story of an outsider(Paul Robeson, as Bosambo) who migrated into central Nigeria(then part of British West Africa), along the Niger River, and soon became a chief of the Ochuri people(sounds very unlikely). He is tall and robust: a good warrior when he has to be, but prefers to promote peace among and between the various tribes of the region, against raids for slaves and wives. Hence, Bosambo has become a favorite of the district commissioner: Sanders. He hopes to make him chief of all the tribes along this stretch of the river, as a first step toward detribalization of the region. Opposing this plan is King Mofolaba, who wants to continue raids for slaves and more wives. He is especially angry at Bosambo for making him give up the people in his last raid. Among these people was Bosambo's future wife: Lilongo(Nina Mae McKinney). In the temporary absence of Sanders from the region, Mofolaba wants to capture and kill Bosambo, using his captured wife as bait. His wife is captured, and Bosambo decides to treck alone to Mofolaba's village to negotiate the release of his wife, a very dangerous move. He is also captured and tied to a stake, ready to be killed. But, Sanders has returned, and is commanding a gunboat, making the difficult journey up the rivet to Mofolaba's village. He arrives just in time to free Bosambo and his wife, spraying machine gun bullets toward the village(although,I didn't see any warriors fall, just runaway!). After Mofolaba is dispatched, at a gathering of all the chiefs in the region, Sanders asks them to accept Bosambo as their higher chief. I should mention that 2 white men were smuggling rifles and liquor to the natives. They spread the rumor that Sanders had died, thus inducing Mofolaba to resume his slave raiding. But, when he found out this wasn't true, Mofolaba had these 2 killed. It was interesting seeing the native people being themselves, including their ritual singing and dancing. Robeson sang several warrior songs: \"The Song of the Spear\", and \"The Lion Song\". Nina Mae McKinney sang the lullaby \"My Little Black Dove\" to her infant child. Paul Robeson was very appropriate to play Bosambo. He was born in America, but came to spend much time in Britain and Europe, away from the racial prejudice of America. He was a superb athlete, and genius: learning many languages and was valedictorian of his Rutgers class. He was an accomplished singer and actor, having sung \"Ole Man River\" in the 1936 film version of \"Showboat\". Later, he became involved in civil rights, and flirted with Communism. After finishing the present film, he was sorry he had participated in it, feeling that it rationalized colonialism more than bringing the native African to the attention of American audiences. Nina Mae McKinney, who played Bosambo's wife, was also born in the US and also spent much time in Europe, getting away from the prejudice in America, and especially Hollywood. She was regarded as quite beautiful, and talented in acting and singing. Her beauty was actually a handicap for Hollywood roles, at this time.",
         "Sanders is a British officer who has picked up the white man's burden and made Nigeria a better place for the Africans who populate it. We know they are happy, because they are always singing. The British do not sing, however, because running an empire is serious business. There seems to be a cult of personality, however, since the place falls apart as soon as Sanders goes on vacation. As word spreads that he is dead, we see animals running about, so apparently even they are upset. War breaks out, and Sanders has to return. While he was gone, a couple of smugglers had been selling gin and rifles to the natives, which is against the law. But the rifles don't seem to do the natives any good, because they continue to use spears. As the boat Sanders is on races to save Bosambo, a good African chieftain who loves being ruled by Sanders and the British Empire, an officer commands an African worker who is operating the boiler to put more wood on the fire for more speed. The African replies that the boiler will blow. But the stiff upper lip of the British officer is not cowed by mere physics, and he contemptuously dismisses the warning. The boiler backs down and humbly submits to British authority, just like everything else."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Music"
      ],
      "productionCompanies": ["London Film Productions"],
      "summaries": ["British District Officer in Nigeria in the 1930's rules his area strictly but justly, and struggles with gun-runners and slavers with the aid of a loyal native chief."],
      "budget": 0
   },
   "movielensId": 123235,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1935-05-10",
      "dvdReleaseDate": null,
      "directors": ["Zoltan Korda"],
      "runtime": 98,
      "movieId": 123235,
      "title": "Sanders of the River",
      "mpaa": "",
      "actors": [
         "Paul Robeson",
         "Leslie Banks",
         "Nina Mae McKinney",
         "Robert Cochran",
         "Martin Walker"
      ],
      "imdbMovieId": "0026966",
      "originalTitle": "Sanders of the River",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "British District Officer in Nigeria in the 1930's rules his area strictly but justly, and struggles with gun-runners and slavers with the aid of a loyal native chief.",
      "tmdbMovieId": 86956,
      "avgRating": 2.5,
      "releaseYear": "1935",
      "numRatings": 2,
      "posterPath": "/o9x5pvAVQyrUDdE6qtZe1g6cm2M.jpg"
   }
}