{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "rome",
            "id": 588
         },
         {
            "name": "parent child relationship",
            "id": 970
         }
      ],
      "imdb_id": "tt0056183",
      "video": false,
      "title": "Light in the Piazza",
      "recommendations": [
         53712,
         62655,
         84119,
         14689,
         94529,
         298664,
         37222,
         18050,
         42603,
         43385,
         63096,
         48155,
         43801,
         38805,
         34187,
         29481,
         43837,
         38724,
         30080,
         32075
      ],
      "backdrop_path": "/9vVKtagovqPrlRU1B8qNeBSlhFp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Meg Johnson",
               "gender": 1,
               "credit_id": "52fe46b8c3a36847f810e707",
               "name": "Olivia de Havilland",
               "profile_path": "/rnMSdk6OZvRdimYbFHjiaYOtIlt.jpg",
               "id": 8725,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Signor Naccarelli",
               "gender": 2,
               "credit_id": "52fe46b8c3a36847f810e70b",
               "name": "Rossano Brazzi",
               "profile_path": "/bhFXDKu6ldldNFowgS0xE5a27cE.jpg",
               "id": 29327,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Clara Johnson Naccarelli",
               "gender": 1,
               "credit_id": "52fe46b8c3a36847f810e70f",
               "name": "Yvette Mimieux",
               "profile_path": "/si2xHsf2wwHsT7OQXXm6AGrdDJ9.jpg",
               "id": 21876,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Fabrizio Naccarelli",
               "gender": 2,
               "credit_id": "52fe46b8c3a36847f810e713",
               "name": "George Hamilton",
               "profile_path": "/2ryjNrkHMMyxwFQ4Z2cEIdiBvvh.jpg",
               "id": 3267,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Miss Hawtree",
               "gender": 1,
               "credit_id": "52fe46b8c3a36847f810e717",
               "name": "Isabel Dean",
               "profile_path": "/b5OnyOCs09dv47LYkxW3L9AlE5v.jpg",
               "id": 132719,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "The Minister",
               "gender": 2,
               "credit_id": "52fe46b8c3a36847f810e71b",
               "name": "Moultrie Kelsall",
               "profile_path": null,
               "id": 132720,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Signora Naccarelli",
               "gender": 1,
               "credit_id": "52fe46b8c3a36847f810e71f",
               "name": "Nancy Nevinson",
               "profile_path": null,
               "id": 24707,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Noel Johnson",
               "gender": 2,
               "credit_id": "52fe46b8c3a36847f810e723",
               "name": "Barry Sullivan",
               "profile_path": "/kRuBQnFWbrqwwbIh5BCD34uq2JF.jpg",
               "id": 40433,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b8c3a36847f810e729",
               "name": "Guy Green",
               "profile_path": "/4VXrsfYOOTCwrFujwJ29g0T6q5z.jpg",
               "id": 67619,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46b8c3a36847f810e72f",
               "name": "Elizabeth Spencer",
               "profile_path": null,
               "id": 1170784,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b8c3a36847f810e735",
               "name": "Julius J. Epstein",
               "profile_path": null,
               "id": 2665,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5844a296c3a36844df00f16f",
               "name": "Arthur Freed",
               "profile_path": "/dzPxN7pBVeSgW46YEOuCzcDbIv2.jpg",
               "id": 9055,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.056096,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 45247,
      "vote_count": 5,
      "budget": 0,
      "overview": "A young American woman traveling in Italy with her mother is slender, blonde, beautiful and there is something charmingly naive about her. Fabrizio Naccarelli seems to always know where the mother and daughter will sightsee next. Signor Naccarelli is just as concerned about where this will lead as Mrs. Johnson is. Then she starts thinking that perhaps her daughter can be a wife of a wealthy young man in a society where all she has to do is look beautiful. What happens if Signor Naccarelli finds out who his prospective daughter-in-law really is?",
      "similar": [
         334,
         8272,
         931,
         175,
         8967,
         2288,
         4347,
         11631,
         88,
         319,
         1164,
         2024,
         773,
         858,
         13,
         111,
         142,
         242,
         112160,
         80752
      ],
      "original_title": "Light in the Piazza",
      "runtime": 102,
      "poster_path": "/sEEniIjRIkkYu4uByZQtogOqEbH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1962-02-07",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Guy Green"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Elizabeth Spencer",
         "Julius J. Epstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056183/",
      "coverLink": null,
      "actors": [
         "Olivia de Havilland",
         "George Hamilton",
         "Yvette Mimieux"
      ],
      "reviews": [
         "I watched this one \"by accident\" (by discovery) and was very moved by the film. The wonderful performances by Olivia and Rossano definitely elevate it, and the youngsters were sympathetic. I was, frankly, surprised by Hamilton's controlled and sensitive performance as Fabrizzio. This movie deserves better treatment from the former reviewer. While definitely a travelogue and clearly a period piece, it still has something timeless to say about happiness and the human condition; that the inability to love and be loved may be the biggest disability of all.",
         "Olivia de Havilland is traveling with her daughter in Italy when romance strikes in \"The Light in the Piazza,\" a 1962 film based on the novel by Elizabeth Spencer. The story was also made into a highly successful Broadway musical of the same name. De Havilland's costars include Yvette Mimieux,Barry Sullivan, George Hamilton and Rossano Brazzi. Because her adult daughter has the mental age of 10, Meg Johnson (de Havilland) keeps very close watch over Clara (Mimieux), a beautiful blonde who, despite her impairment, is very much a woman and attracting a lot of attention in Italy. (This is extremely realistic - blondes do great over there.) In Florence, Clara is pursued relentlessly by an enthusiastic suitor, Fabrizio. His parents (Brazzi and Nancy Nevison) approve of the relationship. What's waiting for Clara back home is an institution, though a good one, that her father (Sullivan) is insisting upon in hopes of rekindling his lost relationship with his wife. Meg is in a dilemma and makes a bold decision. Set against the magnificent backdrop of Florence and with a beautiful performance by de Havilland, \"The Light in the Piazza\" is a marvelous film and the story of a perfect love. Though Meg is protective of Clara and always with her, when she sees that her daughter has a chance at a normal life, she lets go - giving both of them a chance at a life they're missing. One can argue the ethics of Clara's decision but given the Italian scenario: servants in the home, the constant attention of the in-laws, the place of the wife in the home, I believe that Clara will be happy with this loving family. She is mentally impaired due to an accident but that doesn't make her a slow or impaired 10-year-old - she is, in fact, very bright, mastering Italian with ease, and she has all the normal, healthy feelings of a woman. If she has a child's outlook on laughter and fun, that is something to be prized. The most telling moment for me in the film was when Clara asks her mother to read to her \"one last time,\" knowing that her husband is not going to like the kinds of stories Meg reads to her. Then the camera shows one of her beloved stuffed animals on the floor. Clara knows her life is changing; she's in love and ready for it. De Havilland, one of the truly great film actresses, was 47 at the time of the filming and very attractive. She conveys not only the needed maternal qualities but a womanliness and uncommon strength. \"I made the right decision,\" she whispers at the wedding, looking at her lovely, serene daughter. \"I KNOW I did.\" She will always be available to Clara - but now, she will be available to the rest of her family as well. Yvette Mimieux does a fine job as Clara, capturing her childishness very well. Hamilton is in his element in the light role of Fabrizio - he wasn't really capable of much more, and this suits him. Rosanno Brazzi is very charming, sexy, and funny as Fabrizio's father. But the film belongs to de Havilland's anchoring performance. This is a well-directed film, beautiful to look at, with a very touching story. Highly recommended.",
         "I just watched this film today and I had not seen it for probably 20 years. I remembered it fondly and was happy that a friend taped it for me from TCM (which I do not have unfortunately) I was so thrilled to get to see it again after all these years- This is one of the most enchanting films I have seen. The love story is so sweet, and I enjoyed George Hamilton as an Italian. As an Italian myself, I found him to be very realistic and the accent was not all that bad. Olivia DeHavilland is as usual beautiful and her acting is so natural that you really believe that she is Clara's mother. I can only hope that someone at MGM will see their way to get this wonderful film on DVD- If you have the chance to see this movie, get so popcorn and sit back & enjoy!!",
         "Olivia de Havilland is a worried mother travelling through scenic Italian locations with daughter Yvette Mimieux, who is mentally retarded. When a young Italian starts courting her daughter and showing up in the most unlikely places, de Havilland's predicament becomes apparent. Should she tell the truth or let her daughter marry the rather simple-minded Italian boy? The situation was better described in the novella by Elizabeth Spencer, but the Epstein brothers have given the screenplay some grace and humor--and de Havilland is superb as the doting mother. Rosanno Brazzi adds his brand of charm to the boy's father and there is a light touch of romance between him and de Havilland. George Hamilton is surprisingly convincing as the smitten Italian youth, Yvette Mimieux does well enough as the girl and Barry Sullivan does what he can with the thankless role of her stubborn father who would rather see her placed in an institution. All of it is nicely photographed in Italian locales and in wide-screen technicolor (see the letterbox version if you can). This unappreciated film is a minor gem--poignant, touching and humorous.",
         "My chief reason for seeking out this movie was the fact of being very much captivated by Adam Guettel's score for his musical adaptation. Without having seen the stage production, the overall impression is that it's a deeper far more intense treatment of the novel than is the movie. But in fact, the film's greatest achievement is that while not skirting the issues it refuses to seep into melodrama. It's a strange amalgam; a family's dealing with a retarded child, together with Hollywood's version of carefree, emotive Italians filmed on location in sunny Italy. The story concerns the difficulties in dealing with retarded children. This is a serious, complex topic and one that is a constant challenge to the many families who have to deal with children who are mentally handicapped. A particularly problematic junction is the onset of adulthood for such a child. The pivotal role in the movie is that of the mother, superbly played by Olivia de Havilland. She focuses on her daughter's inherent kindness and goodness and has a developed a down to earth, decidedly non tragic attitude towards the situation. The critical decision of whether to marry her off to an unsuspecting Italian family or placing her in an institution (her husband's choice) is not one she wrestles with. The blossoming of young romantic love is overwhelming and her daughter, like everyone else, has a right to taste these fruits. With great satisfaction she feels she's done the right thing. One has to be cautious not be too judgemental, but despite the happy ending, one is left with an uneasy feeling that the couple's future may not be as rosy as is suggested. (I am no doubt influenced by the knowledge of a similar real life situation which did not fare well.) There is a discrepancy between this complex topic and the feel of the movie itself. Italy and the Italians are portrayed in the same glowing, carefree spirit as many other movies depicting the romantic antics of American's falling in love with locals , (\"Come September\", \"Buona Sera Mrs. Campbell\", \"Time of the Cuckoo\"). But the fact that the poignancy of the story is not compromised is the movie's triumph. De Havilland gives a layered, knowing, almost underplayed performance. She's simply terrific and possibly the best reason for seeking this one out. The rest of the cast fare pretty well. (George Hamilton is surprisingly competent.) While far from essential, it's a Hollywood oddity with definite interest value.",
         "Olivia de Havilland is regal and lovely in this slow, but rewarding drama about the mother of a mentally backward young woman seeing her child in the midst of a serious romance and unsure whether to inform the handsome beau of her condition. With beautiful Florence, Italy locales and sweet Yvette Mimieux in support, the movie is lovely to look at, but it's just a bit poky. I shared this with a friend who loves everything Italian, but she shut it off after 30 minutes. For those who stick with it, that final sequence at the church is emotionally heart-rending. Maybe I'm just a sucker for this stuff, but I found it extremely moving. **1/2 from ****",
         "Caught this one on Turner Classic, and for the longest time was stuck in a battle of the wills - turn it off and walk away, or allow inertia to force me to be on the couch through the whole thing. After all, I have better things to do with my time than watch George Hamilton attempt to play a young Italian lover. Inertia chalked up an embarrassing victory. Inertia had help. This movie grew on me, because it danced the Hollywood formula for romance in front of me and then backed away from the pat and added a layer of depth to the situation. The story, in brief is as follows: DeHavilland and Mimieux are the mother and daughter from a monied American family (shares in a tobacco company) on an extended vacation in Italy. There is something wrong with the daughter. With a daughter who looks like Yvette Mimieux it is not long before a young Florentine, Hamilton, sees her and is smitten, and if you aren't familiar with who Yvette Mimieux is, suffice it to say that she was one of the most gorgeous and kittenish actresses of the early 1960's, all flaxen blonde hair, blue doe eyes and curves. To say her Clara character is a bit simple and sweet is an understatement. With his broken English, Hamilton's character does not detect anything is wrong and pursues the romance anyway, getting the concierge to tip him off as to where the mother and daughter will be going that day and just happening to show up uninvited, to Mimieux's delight and Dehavilland's growing consternation. The mother is conflicted - the boy wants to marry her daughter, but she can't let him (and his family) take her without knowing the truth. This film is carried by DeHavilland's complex and powerful performance as a woman who has buried her hopes for her child only to see them being struck alight very much against her will. And in spite of numerous opportunities to do so, Epstein's script manages to hold off surrender to bathos, providing an interesting ending that left me surprised. Not to say that this film had everything going for it. Casting George Hamilton as a young Italian can best be described as adventurous. Mimieux's Clara really does grow in Italy, but anyone familiar with her wide-eyed acting will know that she was an unlikely candidate to ever effectively portray a rocket scientist. Their pairing as the lovers had to have been concocted by the studio marketing department. Since the charisma supply on the lovers is not exactly overflowing the dike, DeHavilland's performance becomes even more important. Some wonderful vistas are rendered of Florence, one of the world's loveliest cities. Coupled with DeHavilland's slow and patient explanations to the befuddled Mimieux of what they are looking at and how it is important, the film also provides a short travelogue of Florence that even an Englishman could follow.",
         "Compared to the other sentimental tear-jerkers of the late 1950s and early 1960s this is way above average. Olivia de Havilland provides another outstanding pivotal performance that brings extraordinary intelligence and credibility that more than compensates for any weaknesses in the story. All of the supporting performances are excellent, including wonderful work by George Hamilton and Yvette Mimieux who seem so natural and unforced, and so unlike most of their other performances. The Italian locations and production are gorgeous! The story is quite original and avoids so many of the clichés of the time. The dialogue is intelligent and unsentimental, allowing the performances to create the pain and joy. De Havilland's role is quite progressive in the portrayal of a mother willing to take risks to allow her retarded daughter to have a chance at happiness.",
         "While vacationing in beautiful Italy, Olivia de Havilland (as Meg Johnson) watches lovely daughter Yvette Mimieux (as Clara) and handsome Italian George Hamilton (as Fabrizio Naccarelli) fall hopelessly in love. Although the two seem perfect for each other, Ms. Mimieux suffers from a secret disability. Aching for her daughter to lead a normal life, Ms. de Havilland is unable to tell Mr. Hamilton or father Rossano Brazzi about Mimieux' condition. Father of the potential bride Barry Sullivan (as Noel Johnson) is against the wedding... You've got to stop wondering why nobody but her parents seem to notice or care about Mimieux' delicate condition, especially Hamilton; and, moreover, since it's not a problem, how it could matter. Director Guy Green and cinematographer Otto Heller give \"Light in the Piazza\" some beautiful scenery. Hamilton and Mimieux are an incredibly good-looking couple. And, de Havilland is marvelous to watch, filling her conflicted wife and mother character with enough to have warranted some \"Best Actress\" consideration. ******* Light in the Piazza (2/7/62) Guy Green ~ Olivia de Havilland, Yvette Mimieux, George Hamilton, Rossano Brazzi",
         "This film walks a fine line between touchingly sweet romance and unintentional hilarity. It comes out on the better side of quality drama thanks to some sincere acting by de Havilland and the wry romanticism of Brazzi. Ms. de Havilland is a wealthy tourist on an extended stay in Florence, Italy with her beautiful, but childlike daughter (Mimieux). Mimieux has suffered an accident which left her with a stunted mental age and de Havilland has taken her abroad to keep her out of trouble as she blossoms physically and attracts men. (With this in mind, Italy may not have been first stop on most people's itinerary!) Hamilton is a very eager and adorable young Italian who falls head over heels for Mimieux and eventually furrowed-browed de Havilland must determine whether to move on or allow her daughter a chance at happiness, at the possible expense of her suitor. Brazzi stirs things up as Hamilton's father and Sullivan adds some welcome conflict as de Havilland's hard-nosed husband. Mimieux does a very fine job presenting this difficult character. She is definitely inappropriately childish, yet lovely and sweet. She has one particularly effective scene in which she becomes overexcited and nearly hyperventilates. Hamilton is charming and appealing and Brazzi is ever-suave. Ms. de Havilland (decked out in crisp, tailored, Christian Dior clothes throughout) projects the right amount of concern and longing for her daughter's happiness. She even gets a carriage ride that is only slightly less rough than the one Vivien Leigh took her on in \"Gone With the Wind\"! She is the emotional core of the film. (People continually refer to her tan in the film, but she looks as pale as a cameo most of the time!) A must in widescreen format, the location filming adds much flavor to the film (which makes it all the more jarring when background screens are used...thankfully very little.) From a certain perspective, the film's message could be quite offensive. It seems to suggest that if a retarded girl wants to be happy, get married and have a family, she only has to go to Italy where no one will be able to tell and she won't have to do much of anything anyway!",
         "American Olivia De Havilland is vacationing in Italy with mentally impaired daughter Yvette Mimeux when fate intervenes. They meet up with George Hamilton who is instantly attracted to Mimeux. Seemingly oblivious to the reason for her childlike enthusiasm he falls for her. This causes some consternation for her mother. Should she encourage this pairing or not? After the girl's father shows up the mother finds herself having to make a decision will affect her daughter's life. A very well acted drama. George Hamilton is fine in an early role. Olivia De Havilland does another magnificent turn as the over protective mother. Check this one out.",
         "I think this film is among the most underrated of its era. It has what is likely Yvette Mimieux' finest performance, and it's in a difficult role as well. Though the story centers around Clara (Mimieux), who is 26 but has the mind of a child, it is really her mother Meg's story, nicely played by Olivia de Havilland. Meg has brought Clara to Florence, Italy, to get her daughter away from a boy back in the states Clara had gotten close to. What drives the plot is Meg's desire for Clara who had been kicked in the head by a pony at age 10 and is mentally stunted, to have a normal life. When Clara is pursued by a young Italian Fabrizio (George Hamiliton), Meg doesn't really know what to do. On the one hand, she doesn't want Fabrizio and his family to discover Clara's \"condition,\" but on the other, Fabrizio has an amazing effect on Clara. They are truly in love. Things get more complicated when Meg meets Fabrizio's father, who takes more than a friendly interest in Meg. She is very capable of taking care of herself, though. What really upsets her is a visit by her husband (Barry Sullivan), who has long ago given up on the idea that Clara could have any semblance of a normal life. Though Mimieux and de Havilland shine, the whole cast works well, including Hamilton as Fabrizio. Hamilton seems to be the whipping boy of the critics. I'm not sure why, but perhaps it's his good looks and that he looks privileged. It may be acerbated by the fact that he often played characters of privilege. Two years before he was a rich playboy in MGM's \"Where the Boys Are,\" so perhaps critics couldn't buy him as an Italian. Nevertheless, Hamilton is really appealing in \"Piazza.\" Even his Italian accent blends with the real Italian actor who plays his father, Rossano Brazzi. Hamilton's scenes with Mimieux often surprise with their level of emotion. If you haven't figured this out already, this film is for romantics, and if you find these sorts of films corny, you'll probably have the same reaction here. However, for those of us who enjoy a nicely told romance in an idyllic setting, \"Light in the Piazza\" is hard to beat. It's much better than Warner's \"Rome Adventure\" the same year, a film full of beautiful locales but more soap than genuine opera. In \"Piazza\" director Guy Green unfolds the drama naturally, and keeps a tight grip on this character driven story all the way to the glorious ending. Green continued working with Mimieux in her next film, \"Diamond Head,\" where she plays the sister of Charlton Heston. It's another exotic love story, but not as successful as \"Piazza.\" Yvette Mimieux, who made a big splash in George Pal's \"The Time Machine\" and \"Where the Boys Are\" in 1960, never really reached her full potential, but she came awfully close to giving a great performance in \"Piazza.\" To play a 26 year old who throws tantrums, has physical fits and sleeps with teddy bears without garnering audience disdain, is quite a feat. A role like this could easily become obnoxious or succumb to treacle, but Mimieux manages to make us care and root for her. As crazy as the idea of a girl so mentally stunted ever having a normal life might be, we come to want it for her. We never lose our affection for Clara, as crazy as some of her actions are. Mimieux plays her as a likable, lovable daughter and an appealing lover. A pleasant person. As Mimieux' performance shows us, it's clear why Fabrizio fell for her. Meg is the anchor of \"Piazza,\" and de Havilland pulls us through the twists and turns of the story with a likable display of perseverance. Her scenes with Clara are filled with warmth, but tinged with unease, as they should be. de Havilland and Brazzi have many wonderful and amusing scenes together as they get to know each other, while at the same time keeping secrets from one another. The lush score by Mario Nascimbene is very much of its time, but is well suited to the film. It never seems to intrude, but adds that touch of European exotica appropriate for the time and place. Following \"Piazza\" and \"Diamond Head,\" director Guy Green went on to do what is probably his best film, \"A Patch of Blue,\" another unusual romance. He apparently liked them. There are things in the film that date it, primarily the use of rear screen projection for the scenes with de Havilland and Brazzi driving around in a small car. The filmmakers even removed the windshield so as not to block the view of the actors and this makes the scenes so ridiculously fake they are laughable. Interestingly, I recently saw 2010's \"Letters to Juliet,\" which is also a romance that takes place in Italy, and the car scenes were done the same way. The only difference is that technology has gotten much better and the effects were harder to spot. Nevertheless, I spotted them. For some reason, some films made at MGM in 1962 were poorly received and heavily criticized. \"Mutiny on the Bounty\" with Marlon Brando, and \"Four Horsemen of the Apocalypse\" with Glenn Ford (and Mimieux as his sister), are two other examples. This was the same year as \"To Kill a Mockingbird\" and \"Lawrence of Arabia,\" both of which were well received. \"Bounty\" and \"Horsemen\" seemed to have been reassessed in recent years and if you read comments on both they are much better appreciated these days. Perhaps the reason \"Piazza\" is late in being reassessed is because until now, it has not been available. The Warner Archive has finally put this film on DVD and for those romantics willing to take a chance, they will probably enjoy it immensely.",
         "\"Light in the Piazza\" is the story of an overprotective mother, Meg (de Havilland) and her daughter Clara (Mimieux) who are traveling in Florence, Italy. While there, they meet Fabrizio, a young, rich native who immediately falls for Clara. Meg has severe reservations about the courtship, however, because as a child Clara had a riding accident that left her mentally impaired; essentially with the mind of a 10 year-old. Clara's charm and genuine innocence is one of the things that draws Fabrizio to her, and after Meg meets and approves of Fabrizio's family, his father in particular (Brazzi) she allows the courtship to continue, with some reservations. It isn't until she sees that their love is true, and finds that, back in the States, her husband has signed Clara up for a \"special school\" that she begins to consider that Clara may be better off marrying Fabrizio. I'm a huge fan of de Havilland, but I'm a bigger fan of good drama. Unfortunately, I wasn't treated to anything above average in \"Light in the Piazza\". The performances were fine, and Mimieux in particular was charming, but something about the film didn't click with me. Perhaps it was a very slight story that was drawn out into a full-length film, or it could be the slightly generic direction by Green (who three years later made the excellent \"A Patch of Blue\"). The film's greatest asset by far is the scenery, obviously filmed on location. Imagine sitting at a café less than 100 feet from Michelangelo's statue of David; that is the kind of atmosphere we are treated to. Though made forty years apart, I saw a similarity between this film and \"Under a Tuscan Sun\" in that there wasn't much to do during the film other than look at the gorgeous Italian scenery. \"Light in the Piazza\" is not a terrible film by any means, but there isn't anything about it thematically that makes it anything better than average either. I would recommend it if you enjoy Olivia de Havilland, which is why I watched it, but anyone who isn't a die-hard fan would probably be disappointed. 5/10 --Shelly",
         "Eileen and I enjoyed this movie very much. It is a very accurate story of how parents worry about the future of their adult children. It is best to watch the movie without knowing too much about it. The acting is excellent. It is interesting to watch a young George Hamiltion in his first few years of acting. The young woman is strikingly beautiful and does a great job also. She is Weena from the original Time Machine movie. The American father is the typical 1950s father who does not want to be involved in the details but wants to make all the critical decisions. While in Italy, the American Mother grows up as much as her daughter during the film.",
         "Is lovely in this film, I cannot believe she was forty-seven, and such a classic, believable actress for the times. While this story is a bit predictable, it is well worth watching for deHavilland and the idyllic scenes of Florence, its architecture and natural beauty. The story is a basic romance with a twist. Yvette Mimieux portrays deHavilland's daughter, who is mentally impaired, although she seems highly functional, and other than being passionate and in love with a young Italian (improbably portrayed by a very young George Hamilton), frankly, the portrayal of an emotionally disturbed person seems rather archaic. (The approach to mental illness in this era was rather abstruse, watch \"Tender is the Night\" with Jennifer Jones and Jason Robards, the portrayal of her as schizophrenic was unrealistic, to say the least). Still and all, this is an enjoyable film, with deHavilland sacrificing for her daughter, feeling she has done the right thing. deHavilland has such a presence and lends credence to any role she endeavors. recommended. 8/10.",
         "MGM deserves credit for producing a magnificent film The Light In The Piazza starring a classic star Olivia De Havilland and featuring two of MGM's brightest contract stars George Hamilton and as the key player in the film Yvette Mimieux as a learning disabled Girl who for the first time is treated like an adult and is romanced by a handsome man who because of the language barriers does not realize her disabilities. A remarkable film beautifully filmed in Italy by the fine director Guy Green. Having seem this film I am going to review and study more of Mr. Green's films. Of course it goes without saying that Olivia De Havilland often nominated and winner of 2 Oscars gives a brilliant performance of Yvette Mimieux's mother. George Hamilton is fine as the Lothario. A courageous film and a credit to the MGM Studio",
         "In this film, Yvette Mimieux plays a beautiful young lady who, as a child, was kicked in the head by a horse, and whose mental development has been slowed to the level of a 10 year old...except when she is rapidly picking up a new language and in certain other social settings. (Interestingly, just one year later, Mimieux played the socially slow and naive wife of Dean Martin in \"Toys In The Attic\"). That's the first problem with this film -- an inconsistency with Mimieux's character. She is in Florence, Italy with her protective mother (the grand and gracious Olivia de Havilland). While there, they are stalked...well in 1962 it wouldn't be considered that...by an Italian suitor -- George Hamilton. Hamilton's limited ability as a serious actor was beginning to show by the time he made this -- his ninth credited film...but he gets by here. Is Hamilton on the level? Apparently so, since his family is relatively wealthy. His father is played by Rossano Brazzi. Barzzi is his normally suave self here, and rather enjoyable, although this film is not one of the highlights to his career. And then along comes Daddy...a very worn-out looking Barry Sullivan, long past his prime in film (if there ever was one). Apparently he was gotten on the cheap here, and they didn't even want to spend money for a little makeup. Daddy, by the way, wants to put daughter in a \"country-club\" institution. As a result of Daddy's plans, with a couple of stumbles along the way, Mama does everything she can to make the wedding happen, and when it does she says, \"I know I did the right thing!\" It's a bit distracting in places to watch this film due to what may be a deterioration in the film, or as shown on TCM, a bad print. Nevertheless, despite its flaws, this is an interesting film worth a couple of hours of your viewing time.",
         "Stunning vistas of Florence, Italy, and the Italian countryside draw you into what is, overall, a fairly slow and ordinary film. \"Light In The Piazza\" is nice to look at. And the performances are nice. And the story is nice. There just isn't anything spectacular beyond the glossy facade. The movie is just...well...nice. Olivia de Havilland plays a wealthy American on vacation in Italy with her beautiful 26-year old daughter, Clara(Yvette Mimieux),who, due to a childhood accident, has the mentality of a 10-year old. Once Clara meets a handsome Italian named Fabrizio, played surprisingly well by George Hamilton, her mother becomes increasingly overbearing and pulls out all the stops to keep the two of them apart. However, once Clara's cold-hearted father arrives in Italy, will de Havilland have a change of heart? Olivia de Havilland saves this film. She brings tremendous grace to the screen and compensates for any of the movie's shortcomings. Also very good is Rosanno Brazzi as Fabrizio's father. Brazzi is shamelessly handsome and de Havilland and Mimieux are beautiful. But where does all of this beauty get you? Not far. The story is limp and full of holes. And you keep wanting it to come to a climax(or at least the end). Interestingly, the ending is a real tear-jerker. I was completely caught off guard by how touching the story's conclusion is. Despite the highlights, however, \"Light In The Piazza\" is sweet, nice, and incredibly forgettable. But it is a great ad for Italy's Department of Tourism.",
         "As she got older Olivia DeHavilland picked and chose her roles a lot more carefully. An absence of three years such as the one she had before accepting Light In The Piazza was not unusual for her. I think it was in part a reaction to her days at Warner Brothers where she was put into a whole lot films she didn't like. At the time she made Light In The Piazza Olivia was living in France with her then husband Pierre Galante and raising their children. So a location shoot in Rome and Florence was no big move. Rome saw its share of films extolling the beauties of the Eternal City. But in this one the Renaissance beauty of Florence got its share of cinema immortality. The color cinematography of Light In The Piazza was its greatest asset. Olivia is on a mother/daughter holiday in Florence with Yvette Mimieux who when she was 10 was kicked in the head by a horse and has stayed at that age emotionally. But her physical development wasn't arrested any and she gets the attention of young Florentine George Hamilton. There's a whole lot of concern from both families because Hamilton is the same way. In addition to her daughter's romance, Olivia gets courted by Rossano Brazzi who is Hamilton's father. Some of the plot of A Summer Place is borrowed here as we glimpse into their married lives, Brazzi with the eternally crying Nancy Nevinson and DeHavilland with stuffed shirt Barry Sullivan who wants to institutionalize Mimieux because she's becoming an inconvenience. Light In The Piazza got an Oscar nomination for Best Sound. It was produced at MGM by Arthur Freed who was now out of the musicals business. Still this film has some of the decorative gloss that an MGM Freed musical you would expect to have. Yvette Mimieux may have given her best screen performance here. I think you'll agree.",
         "Excellent supporting performances are given in this 1962 film by Yvette Mimieux, as a mentally impaired young lady and by George Hamilton as her Italian suitor. The subject nature of the film is most interesting. A woman, whose own marriage is faltering, takes her daughter to Italy where the latter unexpectedly finds romance. What is difficult to take is that the young Fabrizio(Hamilton) and his family fail to realize that Clara (Mimieux) is mentally impaired. The dialogue reveals this in about 10 minutes into the film. Barry Sullivan has the under-stated role of Olivia De Havilland's husband, a tobacco executive, who briefly appears when he is summoned to Rome. What is also hard to embrace is the very sudden turn around by the mother (De Havilland) who at first does everything possible to break up the romance only to wholeheartedly endorse it. Some major social problems are dealt with here, especially what to do with mentally impaired children when the parents are no longer here. I found the ending to be more of a cop-out.",
         "Oliva De Havilland, (Meg Johnson), \"Airport 77\", plays a mother from the East Coast who has a daughter, Yvette Mimieux,(Clara Johnson) \"The Black Hole\", who was hit by a horse when she was very young and it seemed to effect her growth as a woman. Mother and Daughter take a trip to Italy and meet up with a charming young man named Fabrizio Naccarelli,(George Hamilton),\"Off Key\", and Clara & Fabrizio get to like each other very much. Rossano Brazzi, (Signor Naccarelli), \"Fear City\",' is the father to Fabrizio and becomes interested in Meg Johnson, whose husband is played by Barry Sullivan who is very seldom seen in this film. There are plenty of laughs and some light drama to go along with a very Light Headed Film.",
         "I didn't realize this was supposed to be a tear-jerker until I read some of the comments here. LITP is an okay little cheesy film to waste one's time to, but it didn't jerk any tears. Not even close. (But maybe when one is a jerk, tears cannot be jerked out of oneself?) Emotionally the movie is rather flat, resembling a casual picture-postcard stroll through the streets of Florence i.e. not at all a storm of gut-wrenching plot-twists played by over-actors. LITP has a very convincing De Havilland, plus a relatively cute Mimieux being good playing a somewhat retarded woman. (We're told it's an IQ of a 10 year-old, in other words somewhat higher than Tom Cruise's and slightly lower than Sean Penn's.) Of course, before you shower Mimieux with undue praise, keep in mind that nearly all Hollywood bimbos have very low IQs (WITHOUT having been hit in the head by ponies) hence portraying such characters is like shooting fish in a barrel for them. Even easier than couch-casting. And of course I mustn't forget George Hamilton. What a legend. What a presence. No, not really... Casting this Anthony Perkins Clone School reject as a flirtatious Italian is the height of silliness. Sure, compared to casting Di Caprio as a man or Jennifer Aniston as a \"hot babe\" it's nothing dramatically bad, but it still makes you wonder how it's possible that they couldn't find a dark-haired, big-nosed Southern-looking chappy to play Mimieux's love-interest. Even Charles Bronson looks more the part than Hamilton. John Cassavetes? Why not. That snide grin would have given this story a whole new perverted twist... LITP has the usual old-school Hollywood clichés about Italians: charming, fun-loving, always thinking about sex, etc. The movie even suggests in a very subtle way (barely noticeable) that Italy might be a great place for a retarded American woman to blend in perfectly. I mean, no-one noticed that there's something wrong with her! Now, if that isn't insulting, I don't know what is...",
         "This is an almost perfect movie. The glorious setting in Florence, romantic musical score and perfect actors make this a classic. It is not dated at all. The story is a fascinating study of the differences between American and Italian cultures and values. It is a very finely observed showing the subtle differences between the societies. And the best is it has a happy ending. Everyone got what they wanted. Olivia de Havilland is perfect as the worried mother trying to find happiness for her emotionally backward but very pretty daughter played with just the right charm and innocence by Yvette Mimieux. Brazzi is perfect as the suave Italian in law. Even George Hamilton does a surprisingly good job as an Italian beau. This is enjoyable and involving from start to finish. By the way, I saw the musical on Broadway - it didn't quite capture the nuances of this movie. A play on stage would have been better than the musical.",
         "Directed by Oscar winning cinematographer Guy Green, and with a screenplay from Julius Epstein, this average drama features a recognizable cast and tear-jerking story. Olivia de Havilland plays a mother whose beautiful twenty something daughter, played by the perfect actress for the part - Yvette Mimieux, is emotionally immature. While vacationing in Italy, the two are pestered by a young local, played curiously by George Hamilton. Hamilton's character is naturally attracted to Mimieux's innocence and naivete and wants to introduce them to his family. His father, played by Rosanno Brazzi, is of course attracted to de Havilland and, being Italian, is unencumbered by the fact that they are both married. De Havilland's husband, a busy businessman played by Barry Sullivan, joins his family in Italy and we learn that their daughter is mentally retarded, permanently 12 years old. He is aghast that his wife appears to be thinking she can marry her daughter into the Italian family she has charmed. When he leaves to return home, de Havilland's character must decide whether to \"come clean\" with Brazzi's, revealing her daughter's handicap and risking their engagement. Of course, given its director, this beautiful country is lovingly photographed.",
         "During the 50s and early 60s, there were several movies about young to middle-aged women touring in Italy and falling in love with Italian men, and I often get these movies mixed up. ---Katharine Hepburn being romanced in Venice by Rossano Brazzi in David Lean's Summertime (1955). ---Vivien Leigh being sought after by Warren Beatty in Tennessee Williams' The Roman Spring of Mrs. Stone (1961). ---Rosano Brazzi is part of the cast in Three Coins in the Fountain (1954). In THIS movie, Yvette Mimieux portrays a 27-year-old woman, Clara, who is brain damaged due to a childhood accident in which her pony had kicked her in the head. As a result of the accident, she has the emotional innocence of a 10-year-old girl with the body and hormones of an attractive 27-year-old woman. For years, Clara's mother and father, Meg and Noel Johnson (Olivia de Havilland and Barry Sullivan), have been struggling with each other as to what to do about her future. This struggle has only recently been exacerbated when Clara innocently had jumped into the arms of a mature male stranger her age. Since Noel Johnson is wealthy tobacco executive from Winston-Salem, North Carolina, he and Meg have the money to delay the decision by arranging a Italian vacation of indeterminate duration for Clara and Meg, while hoping for a magical solution to their problems. While Meg and Clara are touring in Florence (and learning Italian), Clara is attracted to a young Italian man her age, Fabrizio Naccarelli (George Hamilton), as he is naturally attracted to her. With no noticeable problems, Fabrizio and Clara fall in love. Meg hopes against hope that this may give Clara a \"normal life\" while Noel—who briefly comes to Rome to confer with her—is not convinced. Nevertheless, Meg and Clara return to Florence, and Meg proceeds with wedding plans for Clara to marry Fabrizio with the help of his unsuspecting parents (played by Nancy Nevinson and Rosano Brazzi). After all, she IS willing to covert to Catholicism and they are quite happy with the upcoming marriage ..."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Upper class Americans Noel and Meg Johnson have a twenty-six year old daughter named Clara Johnson. Clara suffered a head injury as a child which resulted in her being mentally disabled. Clara's mental capacity is equivalent to that of a ten year old. In many social situations, Clara's disability can be passed off as a simple joy of life. The issue of Clara's care has placed a strain between Noel and Meg, the latter who clings to the hope that one day Clara can lead a \"normal\" life. While on an extended vacation through Italy, Meg and Clara meet a twenty-three year old Italian named Fabrizio Naccarelli in Florence. Fabrizio is instantly smitten with Clara, who returns the affection. Always protecting Clara, Meg initially resists Fabrizio's constant measures to insinuate himself into their lives. But as Meg learns more about Fabrizio and meets his family, Meg begins to believe a marriage between Fabrizio and Clara is Clara's chance for that normal life, all the while not telling the Naccarellis of Clara's issue. This belief places a further strain between Meg and Noel, who still wants Clara placed in some sort of institution. Not having met the Naccarellis, Noel also believes they have ulterior motives in their actions. But what happens if the Nacarellis find out about Clara's disability?",
         "A young American woman traveling in Italy with her mother is slender, blonde, beautiful and there is something charmingly naive about her. Fabrizio Naccarelli seems to always know where the mother and daughter will sightsee next. Signor Naccarelli is just as concerned about where this will lead as Mrs. Johnson is.",
         "A young American woman traveling in Italy with her mother is slender, blonde, beautiful and there is something charmingly naive about her. Fabrizio Naccarelli seems to always know where the mother and daughter will sightsee next. Signor Naccarelli is just as concerned about where this will lead as Mrs. Johnson is. Then she starts thinking that perhaps her daughter can be a wife of a wealthy young man in a society where all she has to do is look beautiful. What happens if Signor Naccarelli finds out who his prospective daughter-in-law really is?"
      ],
      "budget": 553280
   },
   "movielensId": 123473,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-02-07",
      "dvdReleaseDate": null,
      "directors": ["Guy Green"],
      "runtime": 102,
      "movieId": 123473,
      "title": "Light in the Piazza",
      "mpaa": "G",
      "actors": [
         "Olivia de Havilland",
         "Rossano Brazzi",
         "Yvette Mimieux",
         "George Hamilton",
         "Isabel Dean",
         "Moultrie Kelsall",
         "Nancy Nevinson",
         "Barry Sullivan"
      ],
      "imdbMovieId": "0056183",
      "originalTitle": "Light in the Piazza",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["V66EQzFA-Hs"],
      "plotSummary": "A young American woman traveling in Italy with her mother is slender, blonde, beautiful and there is something charmingly naive about her. Fabrizio Naccarelli seems to always know where the mother and daughter will sightsee next. Signor Naccarelli is just as concerned about where this will lead as Mrs. Johnson is. Then she starts thinking that perhaps her daughter can be a wife of a wealthy young man in a society where all she has to do is look beautiful. What happens if Signor Naccarelli finds out who his prospective daughter-in-law really is?",
      "tmdbMovieId": 45247,
      "avgRating": 3,
      "releaseYear": "1962",
      "numRatings": 2,
      "posterPath": "/sEEniIjRIkkYu4uByZQtogOqEbH.jpg"
   }
}