{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland",
            "id": 388
         },
         {
            "name": "olympic games",
            "id": 2070
         },
         {
            "name": "sport",
            "id": 6075
         }
      ],
      "imdb_id": "tt0048112",
      "video": false,
      "title": "Geordie",
      "recommendations": [],
      "backdrop_path": "/5nVT7Mkyl4ZFHFAVf63KCjmKwDm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "The Laird",
               "gender": 2,
               "credit_id": "52fe45fdc3a36847f80e615d",
               "name": "Alastair Sim",
               "profile_path": "/iAvHebiFHYIAJqDQWqLTB4NKvPo.jpg",
               "id": 20394,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Geordie Mac Taggart",
               "gender": 2,
               "credit_id": "52fe45fdc3a36847f80e6161",
               "name": "Bill Travers",
               "profile_path": "/oepnDgU3anJvZCKMvfL10B8L9Jm.jpg",
               "id": 16898,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Jean",
               "gender": 0,
               "credit_id": "52fe45fdc3a36847f80e6165",
               "name": "Norah Gorsen",
               "profile_path": null,
               "id": 131690,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mrs. Mac Taggart, Geordie's Mother",
               "gender": 1,
               "credit_id": "52fe45fdc3a36847f80e6169",
               "name": "Molly Urquhart",
               "profile_path": null,
               "id": 131691,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Geordie's Father",
               "gender": 0,
               "credit_id": "58f14cd19251415519005224",
               "name": "Jameson Clark",
               "profile_path": null,
               "id": 229362,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Geordie's Mother",
               "gender": 1,
               "credit_id": "58f14ce3c3a3681a23004bd1",
               "name": "Molly Urquhart",
               "profile_path": null,
               "id": 131691,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Young Geordie",
               "gender": 2,
               "credit_id": "58efe9b392514125b1002662",
               "name": "Paul Young",
               "profile_path": "/os4zarBmYP9wVKMRMcQ2tJKOJJE.jpg",
               "id": 96675,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Young Jean",
               "gender": 0,
               "credit_id": "58f14d4c925141551f004d24",
               "name": "Anna Ferguson",
               "profile_path": null,
               "id": 1796268,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Lord Paunceton",
               "gender": 2,
               "credit_id": "58f14c78c3a3681a6c004840",
               "name": "Miles Malleson",
               "profile_path": "/5Zbh2FzelrTvyGAFfY2Mdeoi7Ps.jpg",
               "id": 47395,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Olympic Selector",
               "gender": 0,
               "credit_id": "58f14c8dc3a36819db00479a",
               "name": "Brian Reece",
               "profile_path": "/ma6Lpctsw2h1ij4r2w7I1QKlVT5.jpg",
               "id": 1066908,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Olympic Selector",
               "gender": 2,
               "credit_id": "58f14c9a9251415542004b45",
               "name": "Raymond Huntley",
               "profile_path": "/txL0IXHSd70qIAGsGytEjcSL9g2.jpg",
               "id": 87071,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Helga",
               "gender": 0,
               "credit_id": "58f14caec3a36819db0047ae",
               "name": "Doris Goddard",
               "profile_path": null,
               "id": 1796264,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Postman",
               "gender": 2,
               "credit_id": "58f14cbd9251415542004b62",
               "name": "Stanley Baxter",
               "profile_path": null,
               "id": 193488,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Schoolmaster",
               "gender": 2,
               "credit_id": "58f14cf5c3a3681a30004e7e",
               "name": "Duncan Macrae",
               "profile_path": "/rBqLzhYB9CRSnoX1MDsH2bvEWTR.jpg",
               "id": 97426,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Minister",
               "gender": 0,
               "credit_id": "58f14d029251415556004f09",
               "name": "Jack Radcliffe",
               "profile_path": null,
               "id": 1796267,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Macrimmon",
               "gender": 0,
               "credit_id": "58f14d1bc3a36819db0047f1",
               "name": "Alex Mackenzie",
               "profile_path": null,
               "id": 141578,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Samson",
               "gender": 2,
               "credit_id": "58f14d66c3a3681a5f004eb9",
               "name": "Francis de Wolff",
               "profile_path": "/olCw4cQXhVeYIjv45mZnxvwz40H.jpg",
               "id": 9899,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Laird's Maid",
               "gender": 0,
               "credit_id": "58f14d7ac3a3681a7d005069",
               "name": "Margaret Boyd",
               "profile_path": null,
               "id": 1350476,
               "order": 17
            },
            {
               "cast_id": 23,
               "character": "Reporter",
               "gender": 2,
               "credit_id": "58f14d84c3a3681a3d004d24",
               "name": "Michael Ripper",
               "profile_path": "/oEFxIrp1uYlkYsbwtnKZu9SJK22.jpg",
               "id": 24340,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45fdc3a36847f80e6159",
               "name": "Frank Launder",
               "profile_path": null,
               "id": 14293,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a1ace6ec3a3680b8f03de9a",
               "name": "David Walker",
               "profile_path": null,
               "id": 1929872,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5a1ace7bc3a3680b9d03b55b",
               "name": "Sidney Gilliat",
               "profile_path": null,
               "id": 14292,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a1ace860e0a264cbe03cab7",
               "name": "Frank Launder",
               "profile_path": null,
               "id": 14293,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.290759,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 42343,
      "vote_count": 3,
      "budget": 0,
      "overview": "Concerned about his small stature, a young Scottish boy applies for a mail-order body building course, successfully gaining both height and strength. The film was released as \"Wee Geordie\" in the USA.",
      "similar": [
         13416,
         10393,
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         323677,
         4942,
         10474,
         11287,
         9563,
         2323,
         86130,
         1578,
         5925,
         12163,
         1367,
         1374
      ],
      "original_title": "Geordie",
      "runtime": 95,
      "poster_path": "/8ZeDZYIR2hyvnnvIRG9osIrwjBm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Argonaut Film",
         "id": 29709,
         "origin_country": ""
      }],
      "release_date": "1955-09-02",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "A Giant Among Comedies",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Frank Launder"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "David Walker",
         "Sidney Gilliat"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048112/",
      "coverLink": null,
      "actors": [
         "Bill Travers",
         "Alastair Sim",
         "Paul Young"
      ],
      "reviews": [
         "It is time that this movie was released on DVD. It has been at least ten years since I last saw it on PBS. The values extolled in this film are never ending, and perhaps even timely in this period of heightened violence in the world. Geordie has been a favourite for many years and, notwithstanding my like for all of the classic and modern hard-hitting western, war and other action films, the scene where Geordie tosses the hammer for a Gold Medal while he envisions his sweetheart coming over a hill through the heather is only one that remains stuck in my mind, even to this day.",
         "Farm boy Rulon Gardner's fabulous win at the Sydney Olympics in Greco-Roman wrestling is almost a real-life incarnation of the hero of \"Wee Geordie.\" Goerdie, the hero of this wonderful low-key comedy, starts out as an undersized little boy in rural Scotland, who grows up to be very big indeed. He takes up hammer-throwing after completing a physical-culture courst that converts him from 99 lb. weakling to \"Charles Atlas.\" And, of course, he ends up in the 1956 Olympics, wearing his kilt and throwing for the gold. I saw this film as a kid when it first came out, and was lucky enough to see it on television about a decade ago--and it had lost none of its charm. What with Rulon and Sydney, it's time to bring out this wonderful comedy on Video/DVD. Alistair Sim is a wonderful laird and Bill Travers plays the ultra-grown-up Geordie. It's really funny in the way of Brit comedies of the era.",
         "This movie is truly a classic... It is a classic story of a small boy who is tired of being small and rather than having sand kicked in his face, sends off for a \"HE-MAN\" mail order course... He then trains and dedicates himself to strength training and eventually grows to become an Olympic champion in the Hammer Throw, one of the Olympic strong man events... This movie is great and reminds us of days when Olympic champions were built from desire and hard work rather than todays steroids and other controversial techniques... A must see...",
         "I first saw this movie on late night TV as a youth around 10 years old.Luckily, I got to stay up late one night over the weekend and surprise! there was a film called \"Wee Geordie\" on late night TV. I still remember it to this day. Sentimental? yes, but as a full blooded Scot, that scene of the mountains back hame,and hearing the Bagpipes in \"Big\" Geordie's dream sequence, still brings a tear to my eyes after 42 years. That's an excellent film in my opinion and I would recommend it to anyone with a drop of Celtic heritage or anyone who enjoyed films like \" Rob Roy\" and \"BraveHeart\". Wee Geordie thankfully, is without all the \"historic\" violence. Still another great film that deserves to be mentioned here,is \"Tunes of Glory\" with Sir Alec Guiness.This film is definitely not as innocent as Wee Geordie in nature. But in my opinion, it also ranks as one of the best Scottish Army themed films ever made, and still is dynamic entertainment. Enjoy!",
         "One can only agree with most of the reviewers who found this film so utterly delightful. Which, of course, it is. I note that some sort of DVD release of the film is scheduled for September, 2008 but I am apprehensive that the quality of this release might not be that great. I hope I am wrong, of course. Contrary to the opinion of one writer this film was beautifully photographed in the original, wonderful Technicolor process, not in black and white, as was erroneously stated. Those lucky enough to see an original Technicolor print are lucky indeed for the colour cinematography was one of the best things about that movie. Nowadays that the old Technicolor \"imbibition\" process is no longer used (it ceased in 1977) we are mostly left with pale, washed-out poor colour prints of this great movie. That is why I fear this upcoming DVD release may be a sad disappointment. It is a pity that the original studio (British Lion/Columbia/Sony) doesn't spend a few dollars by going back to the film negative and giving us a nice restored version, as is done with so many other older films. Look what Warner Brothers recently did restoring the old 1937 Technicolor \"Robin Hood\" for DVD: it looks like the film was shot yesterday. And the same thing could be done to nearly every old Technicolor film, if the studios would make the effort. \"Wee Geordie\" is a terrific film, so let's hope it one day gets a new lease on life with a proper transfer to DVD.",
         "I was born in 1954 and saw this movie when I was very small. This stuck with me forever. At first it motivated me to exercise. I attacked it with zeal. I am not going to self boast by going through what my accomplishments were, but they were significant. I applied this same zeal in my business life. Again, I am not going to boast, but this movie gave me the inspiration to keep on keeping on, even if you are not the biggest and best. My company is very successful and there is no stopping. I would recommend that any parent show this movie to any child. It is timeless and trans gender. Simply my favorite movie.",
         "Wee Geordie is an undersized lad who spends his savings on a physical culture course to increase his height and improve his strength. So successful is he that he is chosen in later years to represent Britain in the 1956 Melbourne Olympic Games and as a consequence wins gold in the hammer throw. Such a simple tale with a message to youngsters that a goal can be achieved through sheer perseverance. Bill Travers plays the lead role as Geordie with a dour expression which breaks into a winning smile when things go right for him. Jean (Nora Gorsen) his companion since childhood urges him to accept the Olympic challenge and provides the romantic interest. Alistair Sim as the laird does well in a comic character role (as always). Francis de Wolff as Samson who prepares the correspondence courses for Geordie is a loud and aggressive character who takes all the credit for Geordie's success. There is a genuinely funny scene at the railway station when he farewells Geordie on his trip to Australia. The dialogue is very simple and unsophisticated. It is spoken slowly and clearly and fortunately the Scottish accent can be understood. The colour photography has a washed out look and shows how much the technology has advanced in the last 40 years or so. A nice little family film that will gladden the heart of any wee laddie or lassie.",
         "Geordie grows up from a stunted weakling into a braw man with shoulders on him like an ox and a set of regional allegiances to match. He's no long Wee Geordie. He's Geordie who excels at the kind of Scottish sports that require great skill and delicacy, like throwing a hammer and tossing a telephone pole around. He's a quiet guy though, not a braggart or a competitor. He has a loving mother who urges him to stay strong by eating his oatmeal, er, porridge. He has a cute girl friend too, who inspires him to compete without ever really trying to. Alistair Sim in the Laird on whose land Geordie is the happy gamekeeper. A couple of English sports promoters or impresarios or whatever they're called learn of Geordie's skill at the hammer throw and the community swells with pride as the lad is whisked off to Australia to compete in the Olympics. As in \"Chariots of Fire\", there's a spot of trouble over a principle: Geordie's wearing his father's kilt during the event. There's also a brief misunderstanding concerning a blond female Danish shot putter who finds Geordie attractive and is not afraid of demonstrating her affection in public. All the troubles and contretemps are quickly taken care of. It's a charming story. The people of Geordie's lands are human and friendly in their reserved way, only I wish they hadn't made that crack about its being necessary for Geordie to win the prize back from those cops from Glasgow, that having been my Grand Dad's profession. The photography of the glens and lochs is sumptuous. A Kelpie could be hidden behind the ferns and gorse. Scotland has never looked quite so pretty. Geordie's family's humble stone cottage is painted a pleasing egg shell white. And the local folk in their multilayered tweeds look entirely comfortable in the clear and chilly wind. The film has its weak moments. The first half, with Geordie and his neighbors frolicking in the glens and on the bens is extremely engaging. The second half, dealing with the Olympics, rather drags. Geordie is losing at the hammer throw but at the last moment he has an epiphany. He imagines that he is not in Australia at all but back in the highlands and his girl is whistling encouragement to him from a nearby hill. POW -- the Olympic record is broken, and Rocky gets up from the canvas and floors his obnoxious opponent. But in the end, it's one of those movies that you watch in delight and, when it's over, wistfully wonder what it would be like to live in Geordie's world, unbothered by Twitters and Tweets.",
         "The film throughout shows an innocence of the time which has been lost. The old house with the stairs to the bedrooms still sticks in my memory all these years latter. The plot could be used at any time in history but all of the scenery, comments, expressions are unique to this wonderful film and to a time long gone.",
         "Little Geordie is the smallest boy in the glen, barely able to reach the blackboard at school and as weak as watery broth with it. Fed up with the situation he begins a course of body building despite being just a bairn and continues it into his teens and adulthood. By the time he is 21 he has turned into a fine body of a man. It seems only natural that he will work with his father on the Laird's land and his life seems marked out before him. However should he be making more use of the wonderful physic that he has built? There was a time when Celtic flavour was all the rage \u0096 particularly around the time of The Quiet Man, Trouble in the Glen and many other films of the period that cashed in on it. With that in mind it may be that this film was put together faster than it should have been because, while enjoyable, it is not quite as good in depth as it should have been. The plot starts being about body building, then works around it for a while before taking the story to the Olympics; it is enough of a narrative flow to keep things moving but it wasn't the slight story that gave me pause. No, it was the fact that much of the film was close to a character piece on Geordie but yet the character wasn't there. He is a simple character and, although that may be the point, I still think that more could have been made of the person. As it was the film was amiable enough, amusing without ever being funny, engaging without ever being considered a great tale. The cast are not great but do the job reasonably well. Bill Travers has always been a strange leading man for my money and this is not one of his finer hours \u0096 he overdoes the simple Scottish cliché and forgets to give Geordie much of a personality. Sim is enjoyable enough but the film was there for the dominating and he didn't do it \u0096 although in fairness this may have been a deliberate decision. Gorsen is OK \u0096 a bonnie lass but no more although support is generally good. Overall this is an OK film but hardly anything beyond the Celtic flavour film that it is. The central character is not good enough to carry the whole film, a problem given that the plot actually relies on that heavily at times. It distracts and is pleasing enough but expect more than that at your peril.",
         "I watched Wee Geordie out of curiosity but found so much more than that. The story centres around a small rural Scottish boy who was teased and ridiculed at school because of his small stature and who took growth tablets to aid his physical development. He grows into a fine specimen of a man, tall and strong. His strength ultimately leads to him becoming a hammer thrower and representing Britain at the 1956 Melbourne Olympics. The film is entertaining throughout. Bill Travers (of Born Free fame) is convincing and engaging as the grown Geordie Mac Taggart and Alastair Sims is a fine laird. I thought that the movie might be based on fact (a la Chariots of Fire) but a review of the Hammer Throw results at the Melbourne Olympics reveals it as a work of fiction. No matter! It does not change the fact that the movie is a delight to watch. The scenes of the final throw of the competition are captivating. Some competitors thrive on crowd support, others wilt under it. Geordie was a crowd favourite, thanks to his involvement in saving a man trapped under a car, but his nerves betray him under that pressure. When he shuts out the crowd and imagines his sweetheart back in the hills of Scotland - at the same time that she whispers into her wireless back home - a little piece of cinema magic is created. There was some licence taken with the location. When Geordie is shown arriving in Melbourne by ship, there are 2 scenes of Sydney Harbour. But that is immaterial to the enjoyment of the film. It is definitely worth the investment of your time and attention.",
         "I'm a big fan of Gilliat/Launder movies, and also of Alastair Sim. I expected the usual quirky, sparkling Ealing comedy, but instead got a slow-moving, barely interesting story which seems like something written for a kiddies' magazine. In a way, it's sort of like CHARIOTS OF FIRE, but without the imagination, sharp script & interesting actors. A long-shot Scot gets his chance at the Olympics, but argues with the authorities about a matter of principle. Sim is wasted in a two-dimensional role, but even so, he stands out from the rest of the cast, which is strictly one-dimensional. The color photography is dull and lifeless, to match the script. The happy ending comes about an hour too late.",
         "What a delightful movie, with a positive story that promotes the power of hard work and following your dreams, but without trampling on everyone else. It is interesting how political issues of the time are intertwined rather naturally into the storyline. The plot stopped well short of being twee (which I expected) and I loved the line about Helga being less into heather than \"come heather\". Two things that struck me: the way Geordie showed us what the Scotsman was wearing under his kilt when he fell backward in the row-boat; and I may have been mistaken, but did the first aid given to the car accident victim include a cigarette???? There was a brief glimpse of him being attended to and I am sure I saw something hanging out of his mouth. Perhaps it was a thermometer.",
         "*** THIS COMMENT MAY CONTAIN A SPOILER*** this film is one of the best I have seen from that era in fact from a lot of era's . the tale of a wee skinny Scots lad growing up to represent us in the Olympics in the hammer throwing is fantastic , its a movie all the family can enjoy from wee skinny Scots lads to strapping men from all over the globe , nobody can fail to love it . Its got the lot , sadness , happiness and even romance for the girls with a little touch of excitement ( the car scene ). I only wish it was out on DVD , so whoever is in charge of making old films into DVD's get your finger out it is a must for everyones collection , it will get a new audience loving it as much as us older folks . Either that or re release it in the movie matinée",
         "I do not think it is necessary to put a shallow political spin on this charming film. The film basically follows two plots - one is the boy from a poor background who has a goal of changing himself for the better, and eventually represents his country in the Commonwealth Games in Australia. The other plot is the boy meets girl, falls in love, meets another in Australia - original girl hears about it - gets jealous - he comes home and makes up. All the while a great cast fleshes out some wonderful characters in the Highlands - and it is great to hear Highland accents for a change - against a backdrop of wonderful scenery and some fantastic gaelic choral singing; beautiful, too, for its rarity in film. Bill Travers, early in his career - and just under a decade away from Born Free - gives a spirited performance and is highly endearing in the part. All of this old world Highland Scots seems like a world away from now, but the basic story holds up, and, thank goodness, it was made in colour to show up the Highlands at their best.",
         "saw it at 16 yrs old and now 46 and still can't get it off my mind..where can this movie be rented or bought, it is too good of a movie not to be available. It is a totally feel good movie, me and my brother both want to see it again, why not bring back a great movie that is in the film catagories of the natural, the rookie, it happens every spring.....gary",
         "saw this movie as a child in scotland and loved it. it popped up on tv a few years ago and i taped it but the quality was not great. if it ever came available as a vhs or dvd i would buy it in a heartbeat. a simpler time told in a simpler way. \"come away ma wee geordie\" was a classic line that reverberated in my head ...nostalgia...",
         "I agree with other comments that this needs to be brought back in VHS. It is a good movie that the whole family can enjoy. It has many memorable scenes. My favorite is when Geordie and some other Olympic atheletes lift a car off a person trapped under it. Any kid that has flipped through a comic and seen a Charles Atlas ad for body building will instantly connect with \"Wee Geodie\".",
         "I saw this film as a small boy in England. I loved it at the time and I have never forgotten it. I first saw this movie at boarding school when I was about 9. I have seen it since once on TV late at night, but I agree that it ought to be made available on Video or DVD.",
         "I remember this movie vividly from the 1950's when I saw it once. It has never been on tape and should be, especially with the 200 Olympics in Australia. This is a very enjoyable film about a SMALL young boy who takes a body building course by correspondence and grows up to represent Scotland in the hammer throw in the Melbourne Olympics in 1956. It is time to bring it back.",
         "Just as with the other commentators, I too saw this film decades ago. It had already been in release for a couple of years, so there was a muzzy sense of age to it, even then. I'm taking a guess here, but I'd be willing to wager that those who remember this film best, are males. We remember the wee Scots lad with his wire-hanger-thin arms and his knobby knees; and then we remember the fine figure of a man that he grew into. Yet, in retrospect, it is Geordie's slightly puzzled reactions to the incidentals that happen as a young man that makes him an endearing character. While filmed in black and white, at the risk of a pun, this is one of the most colorful films ever made. What took it past a Cinderella-esque sort of movie, was Alistar Sim playing the foil. Who will forget the gorgeous old codger when he and Geordie are traipsing in the highlands, shooting for grouse. Feeling a call to nature, Sim discretely tells Geordie to go on ahead, and that he will join him momentarily. \"Don't, if you please, shoot into the bushes,\" he warns Geordie. The young man wanders away, passing time - only to suddenly see a flock of grouse rush for the bush. Taking quick aim, he blasts away with both barrels. Not two seconds later, we see Sim, hobbled with his pants around his knees, thrusting his fist into the air and shouting, \"Didn't I tell you to shoot anywhere but into the bushes!\" The scene still makes me laugh. Bill Travers went on to achieve considerable star power with \"Born Free\", and unless I'm mistaken, became an environmental activist. One curiosity: \"Geordie\" is a term of endearment of the name, George, in the city/district of Newcastle. I haven't been able to reckon out why a Scots lad should bear such an English name. --Any suggestions?",
         "The film; Geordie is a beautifully nostalgic film, and no doubt a one which does favours for the Scottish tourist industry. But this film has a cynical side to it. First we have the remnants of a class based community from the feudal period of history, where the people of it work for the lord - laird - of the manor - and live off his land, and no doubt pay him rent at the same time. This leaves the people, as exemplified in this film by Geordie's parents with just enough money to make ends meet, living in a spartan house, with few comforts, eating cheaply produced food such as 'tatties' and porridge as their staple diet, which probably contributed to Geordie's diminutive and weak stature as a child. Notice, there is no sign of Geordie's family eating the abundant venison from the laird's land, which as head game-keeper Geordie is nevertheless obliged to protect. No doubt the venison is protected for the toffs hunting-shooting parties, which as part of the British aristocratic traditions would be held by the laird. This ardent protection of the laird's land, and his precious venison, by Geordie, and his father before him as respective head game-keepers, for a measly wage which was to provide the family with relatively poor living conditions, no doubt contributed to the premature death of Geordie's father. Traditionally those who lived on the laird's land, and worked for him would be obligated to hold the same political views, and therefore use their democratic vote the same way as the laird did. An example of this can be seen when the laird asks what politics Geordie holds' prior to employing him as head game-keeper, which are of course 'liberal' the same as the laird's, as was his - Geordie's - father's before him. Here I think the laird was worried in case Geordie's politics are socialist, which was - and is - a continuing choice of politics, especially for ordinary working class men - and women - such as Geordie. When one morning Geordie is at his home eating his breakfast he makes a remark pertaining to his minuscule wages going on most of the cost of his morning ration of porridge, it is a sign that he could rebel against the traditions of the laird's politics, and become a socialist. Such rebelliousness would no doubt lead towards a split in the community, which is glued together by the diktat of the laird and his regime. Another cynical aspect of this film is when Geordie, a Scot, is asked by some Englishmen, to represent Great Britain in the hammer throwing contest at the Melbourne Olympics. And, as Englishmen they try to force Geordie into adopting their English custom of wearing 'flannels and blazer' for the Olympic parade. This signifies the imposition of English imperialism on Scots people, who in this film are depicted by Geordie, who is described by the English Olympic officials as; 'simple' and 'primitive'. Naturally such ignorant attitudes towards the people of Scotland would eventually culminate in the rise of Scottish nationalists who would rebel against English imperialism as Geordie did, in this case by dogmatically insisting on wearing his Dad's kilt for the Olympic event. This is an example of a counteraction to imperialism. While the acting in this film is good, and the comedy subtle, the scenery is absolutely stunning. Overall a very cosy,and nostalgic film.",
         "First I will answer Irvin of Santa Monica who said \"One curiosity: \"Geordie\" is a term of endearment of the name, George, in the city/district of Newcastle. I haven't been able to reckon out why a Scots lad should bear such an English name. --Any suggestions?\" The Northumbrians are almost Scots - indeed Northumberland once belonged to Scotland. In Scotland, if your name is George, your friends will call your Geordie. Further south in England they will more likely call you Georgie. I read David Walker's novel many years before I saw the film. It is simply written, and has a great deal of charm. Central to the plot of the book is the romance between Geordie and Jean. In the book it is pretty intense. In the film it is all but glossed over. Another difference between the book and the film is that in the book Geordie is not a hammer thrower but a shot putter. I shall not feign outrage. I realise that the hammer throw will look more spectacular on film. But the way the central characters interact with one another in the book is not handled very well in this film. You would be better reading the book.",
         "Its rather disappointing to find the film billed (cough) about Hammer Throwing is in reality along the lines of How A Scot Won the 1954 World Cup for England in a Kilt (Football): Alas, the whole story is a wee twee Fantasy and it would have been nice to see some sort of caption to this effect. The film comes on like a Scotophile's view of the world, in every way like those tacky postcards one may resort to with a Scotty Dog and a fellow in a Kilt o'er looking a loch in bright sunshine when all else fails. The Highland Games technique is well portrayed as I recall from a brief foray, using spikey shoes to stop one slipping, but the Olympic technique using multiple turns is a deftly avoided apart from stock footage and Bills horrendous abortive cage job. For the Record: the 1956 Olympics was won by Hal Connolly of the US with two Soviets Krivonosov & Samotsvetnov coming 2nd and 3rd. Brits finished 9th and 12th, the latter Watford Boys Grammar School graduate Don Anthony. Deep in the Dnq's was Marty Crowe who held the West Australian State Record for Aeons. I did my best to better it in the 80's but failed. Interestingly, the world record languished in the high 60's to low 70s' (metres) until the mid 60's. Yuri Sedykhs 1986 World Record still stands and the over 80m record throws almost exclusively belong to Soviets Sergei Litvinov and Major Sedykh. Draw your own conclusions about Tour de France legends and the like. I struggled to throw more than 50 metres having declined offers and promises from enhancement. If you love Scotland, independent or bound, draw a dram and settle down under your best tartan travel rug to bewail the clearances and watch 'Geordie' in a cloud of nostalgia for what never existed. Phil Robinson",
         "Every actor is excellent in this film, and this includes the taunting bullies when Geordie is a boy; they are also good when when they gawk at Geordie the conquering hero comes home. The message is simple, the film elegant in conveying it. Don't tease the hungry kitten who may grow up to be the hungry lion in the Colosseum. Every man I know who saw this film as a boy in the 1950s remembered it vividly to his dying day. I even knew Germans who saw it, a bit later, who also got the message that their Nazi fathers did not. Geordie is, of course, a boys' film; but in 93 minutes it conveys more about growing up to be men than Little Women does to girls about growing up to be women (if only because boys have more energy to control). I hope Prince William of Wales has seen this film in England; he'll become a better King of Scotland for it. Perhaps it's about Britain, America, Australia, Canada, and New Zealand too; united we stand, divided we fall -- and everyone of us must do his bit. Is that really \"sentimental\"? or is it really what we all strive for? This is not just a good film; it's an essential film. It's the oatmeal of a good diet, the essence of simplicity's complexity, and complexity's simplicity. It's about growing up to become an admirable, worldly hero, instead of lagging behind to become the ignorant, ignoble town bullies. It's about how we we won WWII, stoodu p to the Communist empire, and will drag China onto our side. It encourages boys to make the best decision, however unpopular it may be. Good book, good play, excellent film. Sometimes a great film is composed of small, earthy, simple elements of noble purpose. This is one of those little films that's really big because it follows aspirations and accomplishes nobility."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": ["Individual Pictures"],
      "summaries": [
         "Concerned about his small stature, a young Scottish boy applies for a mail-order body building course, successfully gaining both height and strength. At the age of 21, he displays a talent for hammer-throwing, and is selected to represent Britain in the 1956 Olympic Games in Melbourne, Australia.",
         "Geordie is a Scots lad sent to the Melbourne Olympics to represent Britain in Hammer-Throwing. He insists on wearing his kilt..."
      ],
      "budget": 0
   },
   "movielensId": 123541,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-09-02",
      "dvdReleaseDate": null,
      "directors": ["Frank Launder"],
      "runtime": 95,
      "movieId": 123541,
      "title": "Geordie",
      "mpaa": null,
      "actors": [
         "Alastair Sim",
         "Bill Travers",
         "Norah Gorsen",
         "Molly Urquhart",
         "Jameson Clark",
         "Molly Urquhart",
         "Paul Young",
         "Anna Ferguson",
         "Miles Malleson",
         "Brian Reece",
         "Raymond Huntley",
         "Doris Goddard",
         "Stanley Baxter",
         "Duncan Macrae",
         "Jack Radcliffe",
         "Alex Mackenzie",
         "Francis de Wolff",
         "Margaret Boyd",
         "Michael Ripper"
      ],
      "imdbMovieId": "0048112",
      "originalTitle": "Geordie",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Concerned about his small stature, a young Scottish boy applies for a mail-order body building course, successfully gaining both height and strength. The film was released as \"Wee Geordie\" in the USA.",
      "tmdbMovieId": 42343,
      "avgRating": 5,
      "releaseYear": "1955",
      "numRatings": 1,
      "posterPath": "/8ZeDZYIR2hyvnnvIRG9osIrwjBm.jpg"
   }
}