{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0073134",
      "video": false,
      "title": "Hustling",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Fran Morrison",
               "gender": 1,
               "credit_id": "52fe4ba8c3a368484e1937d7",
               "name": "Lee Remick",
               "profile_path": "/wc76zmRcyFf2v6RqeSDgY85CP9m.jpg",
               "id": 855,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Wanda",
               "gender": 1,
               "credit_id": "52fe4ba8c3a368484e1937db",
               "name": "Jill Clayburgh",
               "profile_path": "/twrfhIvbqHuJ7nXVpehvU6nyi6R.jpg",
               "id": 20362,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gustavino",
               "gender": 2,
               "credit_id": "52fe4ba8c3a368484e1937df",
               "name": "Burt Young",
               "profile_path": "/rbSsSkQ72FoGcvwIHUxQWJ92I3W.jpg",
               "id": 4521,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Orin Dietrich",
               "gender": 2,
               "credit_id": "52fe4ba8c3a368484e1937e3",
               "name": "Monte Markham",
               "profile_path": "/dJQkiCN4lENTgR5RQbqRlw2uSxs.jpg",
               "id": 73149,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Swifty",
               "gender": 2,
               "credit_id": "52fe4ba8c3a368484e1937e7",
               "name": "Alex Rocco",
               "profile_path": "/u2JStL4Pk9Huq1xmrjqezfysivt.jpg",
               "id": 20752,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dee Dee",
               "gender": 1,
               "credit_id": "52fe4ba8c3a368484e1937eb",
               "name": "Melanie Mayron",
               "profile_path": "/vFDm9CyXqbUBnbunSBVNlwuMrkY.jpg",
               "id": 83313,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Giselle",
               "gender": 1,
               "credit_id": "52fe4ba8c3a368484e1937ef",
               "name": "Beverly Hope Atkinson",
               "profile_path": null,
               "id": 51184,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Keogh",
               "gender": 2,
               "credit_id": "52fe4ba8c3a368484e1937f3",
               "name": "Dick O'Neill",
               "profile_path": "/t4yEaFexDrQvLqrpNW1FaAuBtq3.jpg",
               "id": 14835,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ba8c3a368484e1937d3",
            "name": "Joseph Sargent",
            "profile_path": "/caO0AI5r8xT2C3yCo8czB8DA1nr.jpg",
            "id": 15663,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.668042,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 133148,
      "vote_count": 1,
      "budget": 0,
      "overview": "Based on Gail Sheehy's book, this film chronicles how a reporter for a New York City magazine decided to investigate the city's prostitution industry to find out just who was making all the money. What she found out caused a firestorm of controversy--that many of the city's richest and most powerful families and corporations benefited directly and indirectly from the illegal sex business.",
      "similar": [
         59201,
         78378
      ],
      "original_title": "Hustling",
      "runtime": 98,
      "poster_path": "/aGqTxz5lbRT134921SQX6BqdUkw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1975-02-22",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joseph Sargent"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Gail Sheehy",
         "Fay Kanin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073134/",
      "coverLink": null,
      "actors": [
         "Lee Remick",
         "Monte Markham",
         "Jill Clayburgh"
      ],
      "reviews": [
         "******SPOILERS****** Lee Remick, Fran Morrison, plays a hard nose crusading reporter who drives a hard pen & pencil to get to the bottom of the prostitution racket in NYC by exposing those on the top who are untouchable by the police, press and politicians until she takes them on. One night going out with the police to get a story about the seedy side of the city on a \"hooker sweep\" the police round up a number of prostitutes. At the police station Fran becomes interested in one of the hookers Wanda, Jill Clayburgh, and pays her bail to get her out of jail. Wanda grateful for what Fran did tells her that she'll repay her for what she did as soon as she turned enough tricks to make up for the $500.00 bail that Fran paid for her. But Fran tells Wanda that she just wants her to tell her everything that she knows about the life that she leads so she can write a story in her magazine, City Magazine, about it. At first Wanda hit's it right off with Fran in telling her about her hard life and how she has to work to pay off her pimp for food clothing and protection and that she makes something like $20-25,000.00 a year, this is in 1975. But Fran is shocked that Wanda didn't even have $500.00 to bail herself out of jail with all that money that she makes on the streets. When Wanda's pimp, Sweets, finds out that she's talking to a reporter and also starting to think about getting out of the prostitution business and feels that he might lose her from working for him he has a couple of street thugs beat and cut her up so bad that she would get back into line. Fran feeling responsible for what happened to Wanda takes it upon herself to expose the prostitution business and those who profit the most from it. The makers and shakers from the city and state government as well as the big real estate interests who own the hotels where the hookers do their trade. Back on the streets Wanda's fellow prostitute as well as best friend Dee Dee, Melanie Mayron, who is 18 but looks like she's in her 40's, has been missing since her one year old son was taken away from her by the social services because they say that she can't provide for him. Fran going to where Dee Dee and Wanda hung out when they wanted to get out of the cold and rain in a deserted construction site and finds Dee Dee dead, she killed herself by slashing her wrists. With Dee Dee having no one and slated to be buried in Potter's Field Fran comes to the rescue and pays for her to get a proper burial where Wanda and all those from the streets who knew her were in attendance. Also there was Wanda's pimp, Sweets, waiting in the background for her to join him in his pimp-mobile. Wanda to her credit ignored him as he angrily sped away. In the final scene in the movie we see Wanda waiting for a bus to take her to the airport for a plane to Cleveland to move in with and take care of her old and sick father. Fran says good by and tells Wanda that she has something for her to read during that long plane trip. As a goodbye present Fran takes out the new copy of City Magazine. In it there's the story that Fran wrote about Wanda and the women and girls who work the streets of NYC; also in the article is Fran's exposer of those in high places who shamelessly profit off them. With Wanda on the Bus and then Fran on her way to flag down a cab to take her home she sees that at the local newspaper stand everybody snapping up and buying the magazine with the article about the prostitution racket, that she wrote about, on the front cover. There's nothing earthshaking about \"Hustling\" but it's just a good and well intended film. With a young Jill Clayburgh in one of her first movie roles before she hit it big in Hollywood and portrayed women who were, well spoken and educated and classy, but anything then what she played in \"Hustling\".",
         "\"Hustling\" was made for TV in 1975, back when \"Movies of the Week\" were more of an \"Event\" and were taken more seriously than they are today. I'd be willing to bet that whatever network first aired this film, probably preceded it with ads saying that it was \"Ripped from the headlines\" or \"The Shocking True Story...\" It obviously worked, as I understand the film won several Emmy Awards. 35 years after the fact, \"Hustling\" is still a decent, although a bit dry, melodrama. Considering that I found this film on a budget-priced DVD collection called \"GREAT BAD GIRL MOVIES,\" I was hoping for something a little more sleazy/exploitative than what I got. No such luck. \"Hustling\" turned out to be a pretty straightforward drama, with the basic message being \"Hey, prostitutes are people too, man.\" Lee Remick (pre-\"The Omen\") stars as a reporter for a major New York magazine who wants to write an expose on the prostitution problem in the Times Square area, which at the time was reaching critical mass. She befriends a reluctant veteran hooker named Wanda (Jill Clayburgh, whose Noo Yawk accent is so thick you can cut it with a steak knife) and uses her as her 'source' for the article, which causes problems for Wanda not only with the other \"girls\" but with her pimp, who doesn't want her discussing \"the business\" with an outsider. Of course, since this is a made for TV film the language and action are mostly squeaky clean. The most suggestive dialogue you'll hear is a \"prostie\" suggesting to a john that he take \"two girls\" instead of just one, and the only violence is implied or happens offscreen. The upbeat ending is unrealistic and feels as if it were tacked on at the last minute. If this movie were made today, it would probably air on the Lifetime Channel and it would star Alyssa Milano as the reporter and Jennifer Love Hewitt as Wanda. (Y'know what? Now that I think about it, I'd watch that. Haha.) So while \"Hustling\" was not exactly what I expected, it was still worth a look,, mainly for the way-cool shot-on-location scenes in the mean streets of New York City circa 1975. The city was a lot dirtier and scarier than it is nowadays. It's also fun to play \"spot the character actor\" with the supporting cast; you'll see such dependables as Alex Rocco, Burt Young, and even Howard Hesseman (\"WKRP\") in small roles. Trivia geeks alert, director Joseph Sargent directed multitudes of other TV movies and mini series throughout the '70s and '80s as well as the occasional theatrical film, including 1987's legendary disaster \"Jaws: The Revenge!\" If nothing else, \"Hustling\" is far superior to that famed turkey. Retro movie fans should get a few kicks from this dusty offering.",
         "This film is based upon Gail Sheehy's pseudo-sociological book dealing with streetwalking prostitution in midtown New York, and features Lee Remick as a middle class magazine journalist who selects one particular harlot named Wanda (Jill Clayburgh) with whom she somewhat bonds in the course of investigating unsavoury real estate dealings involving socially prominent figures who ostensibly benefit from prostitution income. Despite the use of open mikes and harshly grained lighting to bring about a sense of aural and visual realism, the work suffers from a romantic approach to its subject, presenting the prostitutes and local police who arrest them as one reluctantly interlaced family, with the pimps grotesque caricatures, and the direction by Joseph Sargent vying with Jerry Fielding's jazzy score for being the most unimaginative contribution, whereas those real problems associated with this type of vice activity: venereal disease, the deleterious effect upon local business establishments, etc., are barely touched upon, indeed being submerged beneath a flurry of bootless subplots.",
         "TV-made adaptation of Gail Sheehy's book about the prostitution-overflow in New York City was considered heady stuff in 1975, but time has turned the picture into trivial camp, complete with 'colorful' dialogue (\"How can I bust prostitutes on a typewriter with a broken P?\" ... \"Try W.\"). Lee Remick plays that warhorse of clichés: the eager magazine writer hoping to get a juicy inside scoop. She befriends a low-class hooker for the sake of her in-depth piece, but the reporter's ultimate loss of innocence rings false within this too-clean scenario. Jill Clayburgh (in platform heels and talking with an artificial Flatbush twang) would have been far more convincing as an upscale Manhattan call-girl; here, pacing the seedy streets in her mini-skirt and fake-fur jacket, she resembles nothing more than the invasion of Hollywood, U.S.A. Some of the location shooting is well-captured, but the movie is a far cry from the gritty expose it clearly means to be; the phoniness of the characters and in the framework of the plot (de rigueur for television movies) sinks nearly all interest in the subject matter. Sheehy (who did not write the teleplay) did work as a consultant on the picture, which fails to explain Clayburgh's 'respectable' makeover at the finale and the interminable bus station farewell scene, which looks like something out of a Ginger Rogers movie."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Filmways Television",
         "Lillian Gallo Productions"
      ],
      "summaries": ["Based on Gail Sheehy's book, this film chronicles how a reporter for a New York City magazine decided to investigate the city's prostitution industry to find out just who was making all the money. What she found out caused a firestorm of controversy--that many of the city's richest and most powerful families and corporations benefited directly and indirectly from the illegal sex business."],
      "budget": 0
   },
   "movielensId": 123605,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1975-02-22",
      "dvdReleaseDate": null,
      "directors": ["Joseph Sargent"],
      "runtime": 98,
      "movieId": 123605,
      "title": "Hustling",
      "mpaa": "",
      "actors": [
         "Lee Remick",
         "Jill Clayburgh",
         "Burt Young",
         "Monte Markham",
         "Alex Rocco",
         "Melanie Mayron",
         "Beverly Hope Atkinson",
         "Dick O'Neill"
      ],
      "imdbMovieId": "0073134",
      "originalTitle": "Hustling",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Based on Gail Sheehy's book, this film chronicles how a reporter for a New York City magazine decided to investigate the city's prostitution industry to find out just who was making all the money. What she found out caused a firestorm of controversy--that many of the city's richest and most powerful families and corporations benefited directly and indirectly from the illegal sex business.",
      "tmdbMovieId": 133148,
      "avgRating": 1.5,
      "releaseYear": "1975",
      "numRatings": 1,
      "posterPath": "/aGqTxz5lbRT134921SQX6BqdUkw.jpg"
   }
}