{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "society",
            "id": 3679
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "astronaut",
            "id": 14626
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0310952",
      "video": false,
      "title": "Riverworld",
      "recommendations": [25012],
      "backdrop_path": "/vdIGzYTIOwbknCnYvbQfsabPYXD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeff Hale",
               "gender": 2,
               "credit_id": "52fe46c99251416c75083957",
               "name": "Brad Johnson",
               "profile_path": "/7NOkYI0RzOKwgpvX8tiFAmke6lm.jpg",
               "id": 36067,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mali",
               "gender": 1,
               "credit_id": "52fe46c99251416c7508395b",
               "name": "Karen Holness",
               "profile_path": "/8oHU4uwOJqyFL3nE8bs4gf3N6zq.jpg",
               "id": 80405,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Valdemar",
               "gender": 2,
               "credit_id": "52fe46c99251416c7508395f",
               "name": "Kevin Smith",
               "profile_path": "/l7KogriQez3orpLpq3mPKUB077.jpg",
               "id": 80406,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Samuel L. 'Sam' Clemens",
               "gender": 2,
               "credit_id": "52fe46c99251416c75083963",
               "name": "Cameron Daddo",
               "profile_path": "/r0njiUT2oLqQ0ZL74AnSnd5CNPK.jpg",
               "id": 80407,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Nero",
               "gender": 2,
               "credit_id": "52fe46c99251416c75083967",
               "name": "Jonathan Cake",
               "profile_path": "/bH8Eci94hsvghp2Fs1Fb9qoWw8Z.jpg",
               "id": 72858,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Alice Lidell Hargreaves",
               "gender": 1,
               "credit_id": "52fe46ca9251416c75083977",
               "name": "Emily Lloyd",
               "profile_path": "/ApnsQyg7ov4bLMgc7ETG32ngQtz.jpg",
               "id": 18017,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tane",
               "gender": 2,
               "credit_id": "52fe46ca9251416c7508397b",
               "name": "Patrick Kake",
               "profile_path": "/lHaMmvB3IHFmcUJINKSNdc6PzSG.jpg",
               "id": 5534,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Langer",
               "gender": 0,
               "credit_id": "52fe46ca9251416c7508397f",
               "name": "Colin Moy",
               "profile_path": "/2EjNqj5dzcHX0prekGpkObg0noN.jpg",
               "id": 15578,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe46c99251416c7508396d",
               "name": "Kari Skogland",
               "profile_path": "/pCbi6ABzu0KmXwGwIczgxYvjBNt.jpg",
               "id": 22140,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c99251416c75083973",
               "name": "Alex Proyas",
               "profile_path": "/yJEEjalWtxqg8Oe2aH0fVJIk4ii.jpg",
               "id": 21085,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46ca9251416c75083985",
               "name": "Philip Jose Farmer",
               "profile_path": null,
               "id": 545680,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5537ec3cc3a36878fd0031a9",
               "name": "Sean Button",
               "profile_path": null,
               "id": 1447518,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.949822,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 16356,
      "vote_count": 12,
      "budget": 0,
      "overview": "A movie for the Sci Fi Channel based on the book series by Philip José Farmer. The location is Riverworld, a mysterious and treacherous land where every human who died between the years 99,000 BC and 2,200 AD has been resurrected on the banks of a huge river.",
      "similar": [
         299687,
         7453,
         11236,
         10200,
         185,
         602,
         49849,
         9016,
         1359,
         2675,
         19995,
         141,
         340666,
         407451,
         137113,
         47933,
         216015,
         286217,
         452507,
         228161
      ],
      "original_title": "Riverworld",
      "runtime": 86,
      "poster_path": "/4eypIausFMrDY62pTSF6rIgj5xQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/jEMVaCuEjQ3lzkhakWDKNVjwd9Q.png",
         "name": "Alliance Atlantis Communications",
         "id": 803,
         "origin_country": ""
      }],
      "release_date": "2003-03-22",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kari Skogland"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Philip Jose Farmer",
         "Stuart Hazeldine"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0310952/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQyMTQyMjg4OF5BMl5BanBnXkFtZTcwMjM0OTYyMQ@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Brad Johnson",
         "Karen Holness",
         "Emily Lloyd"
      ],
      "reviews": [
         "A law was passed in the 1970s that all fantasy novels had to be franchises, with sequels out the wazoo for time and eternity. Philip Jose Farmer opted not to be a criminal and wrote book after book about a strange world, dominated by an endless river along whose banks everyone who had ever lived on earth was reborn. Food and clothing were supplied, and there were alien observers, whose plan was -- well, that's the plot! Now the Sci-Fi Channel, abetted by Canada and Australia, has filmed the concept, but be warned, it's not really a movie -- it's the pilot for a series! A 21st century US astronaut, Lewis Carroll's Alice, a riverboat man named Sam, a Holocaust survivor, a strange little girl, a Yoruba princess (whose native dances look suspiciously like standard stripjoint choreo but who also does martial arts like Xena), and the evil Nero, among others, are here, struggling for survival, for power, and to launch an oldfashioned Mississippi steamboat. (So where is Richard F Burton?) Tech credits are fair for the budget. Except for Emily Lloyd, as Alice, the cast is no-name. There's a higher than expected body count among the extras, which will no doubt be toned down considerably to make sure of a TV PG rating when this goes to weekly, and the gaggle of reborns coming out of the surf during the teaser in flesh-colored G-strings and bras, where appropriate, is probably as close to sensuality as this is going to get. The ending is as wide-open as the defenses at Basra, with the aliens talking enigmatic foreboding stuff that will make more sense later in the series and a climactic revelation that is no surprise at all and just sets up the conflict for subsequent episodes. This is going to be a lot like \"Sir Arthur Conan Doyle's The Lost World,\" except that it has a river, not a plateau, where the leads can encounter a new civilization every week while tooling along in that steamboat. If you liked the Lost World series, you may find this worth watching. Odds are they'll be using some leftover scripts from it! On the other hand, if you were a fan of the books, I think you'll regard this as basically an unworthy bastardization for popular consumption of a fascinating idea -- even though Farmer did eventually write it into the ground. On the IMDb scale, 3 out of 10.",
         "I was looking forward to this one, and was totally disgusted by the results; its like yet another pseudo-scifi \"product\" extruded from the studios of New Zealand. Except that compared to this thing, Hercules and Xena are highbrow entertainment! Sci-fi for the McDonald's generation. The script includes a jumble of maybe about 15% of the entire original lively and inventive story from the first two books, tosses the other 85%, and replaces it with childish claptrap like evil warlords pursing the virtuous blonde maiden -- and will she escape their clutches??? Yeah, really had me on the edge of my seat. I was expecting the villain to grow a mustache he could twirl, and tie her to some railroad tracks -- spare me! I'd give it a '2' for story, and a '6' for production-values.",
         "The movie does a great disservice to Farmer's series of novels. The book's interesting story line is morphed into a series of martial arts choreographies for TV - typical 21st century emphasis on cartooning over substance. And how did an 18th century female slave from Africa learn Bruce Lee's moves? Forget the screenplay; read the book.",
         "Oh yeah, you know if you have read the very creative series of books by Mr. Farmer, that there are ideas and story snipets from the book, but I couldn't of imagined that the creators of the TV movie would make it so unwatchable to anyone not looking for a squared jaw man or exotic native women. There is so much imagination in the books, I was hoping that this show being on a Science Fiction Channel would try to appeal to a \"sharper\" audience. There was nothing memorable about the show. I suggest turning off the TV and reading this in the book.",
         "Fans of Farmer's remarkable novels will be sickened by the butcher job done by the producers of this turkey. Outside of borrowing a few character names and the basic premise of the world-girdling river, the movie has practically nothing in common with the books. Every important story development concept is thrown away in favor of seemingly endless violence. And what isn't gory is one stale cliché after another. (The engine room scene near the end is taken lock, stock and barrel from at least a dozen Star Trek episodes). The ending obviously left itself open for a sequel or two. God, I hope not! A tragedy second only to Hollywood's rendering of Asimov's \"Nightfall\".",
         "I knew as soon as I saw the ads on TV that this was going to be a gross misinterpretation of my favorite series of books. From the first scene the story veered sharply away from the books, and quickly disintegrated from there. Where shall I start? Bubbles? Where was the pre-resurrection chamber? Hundred-foot tall grailstones? CLOTHING? ONE UNIVERSAL LANGUAGE! I'll stop here because it does get worse. In the books, Sir Richard Burton is the hero. A better action hero was never created, and, best of all, he really existed. Alas, he has become Sir Not Appearing In This Film. Emily Lloyd as Alice Hargreaves was a decent choice, although Lloyd's bleached hair was at odds with Hargreave's famous raven black hair. Hundreds of pages of prose cannot make a two hour movie, and the makers of this film seemingly cut and pasted with great glee. In fact, they seem to have subscribed to the David Lynch school of movie adaptation: Never read the original book. In short, this was two hours of my life that I was robbed of. I expected much more from SciFi Channel.",
         "Evidently Atlantis in Canada was trying to do Riverworld, by Philip Jose Farmer, as a TV series. A good choice -- everyone who has ever lived on earth has been revived on another planet along the banks of a river that winds around it. Scope for adventure, character development, and good use of New Zealand (and maybe Tasmanian) locations. It had to have been finished before untimely Kevin Smith's death in Beijing in, I believe, late 2001, and given TV pilot cycles evidently was not picked up, which is a shame. The riverboat _was_ fabulous. And Brad Johnson and Cameron Daddo, as well as the others in the cast, are competent actors who would have entertained us for at least five seasons. Six, if they decided to do a \"Beyond Riverworld\" continuation series. Do you want to know where they go? Can't wait for the rest of the story? Well, look up Farmer, P. J. in Amazon.com, and look for books called Riverworld, The Fabulous Riverboat, as well as anything else he's written. All worth reading. And in the end, well, they do reach the beginning.",
         "... that is, until I read the novel. While not a great film or a stunning film, it had seemed OK and had potential for sequels. The story seemed interesting enough to prompt me to read the book. After the book I realized just how far off the mark this adaptation was. I took with a grain of salt the other comments which stated such opinions. I wished to read for myself. And now I agree. I thought of it as a 5/10 movie before, but in light of how poorly it reflected on the novels, I now give it a 2/10.",
         "This movie sucks all the fun out of what fans of Farmer's series might expect. All is dreadfully serious (Sam Clemens, of all people, is boring...), the absurdity & whimsicality is sadly missing, and (just for instance) the ingenious \"grails\" have become mundane \"canisters\" (Does the sci-fi channel think we'll need a dictionary, or are they just afraid we'd be tempted to throw it at them if we had to get it out?) This last aspect is just one facet of a general tendency the picture has to take what it finds in the novels, dumb it all down to the level of a person who cannot read a novel, 7 go on from there. Plus the censors seem to have clipped the joints & dreamgum out of things (I may be wrong about this--there was a small part of this film I missed). Capital B Bleahh.",
         "This was the most disappointing adaptations of a novel to film/video that I've ever seen. Most of the points that made the novel so interesting were completely changed or glossed over. While the movie was entertaining enough in its own right, it totally missed most of the essential points in Farmer's works. The fact that they tried to condense two novels (\"To Your Scattered Bodies Go\" & \"The Fabulous Riverboat\") into a two hour (with commercials!) production made it even worse.",
         "I was very disappointed. This movie managed to take the science out of science fiction. They had a great premise...death and then being reborn in another world or spiritual realm. The first 5 minutes were great with the bubbles of people coming up to the top and the people coming up on shore. But then from here on out it was all down hill. Except for certain landscape scenes this was the END of the special effects! The story was plain and silly. Good guys get captured, good guys escape. Then they build a steamboat! What?! I said to myself! MacGyver would be proud! The end was a mystery to me...see if you can figure it out. They clearly needed a larger budget. They movie should have made the conflict more complex. They should have given us more background on the lead character. They should have gone into the theological aspect and the 'aliens/gods?' characters. Also they should have made this into a miniseries so to acheive the above objectives. Here are my grades: Acting: C Special effects: F storyline: D Overall Grade: D",
         "When I wrote my IMDb review of the TV film IT 'adapted' from Stephen King's magnificent novel, my 'one line summary' was: 'The worst book/film translation ever?' I wrote that because, at the time, I believed it *was* the worst adaptation I had ever witnessed. But now I find I have to review and redefine what I think about poor adaptations because, surely, THIS one is the worst ever. BY FAR! I gave this movie every chance. I watched it (*suffered* it, more like) in the hope that at some point it would begin to bear more resemblance to Farmer's brilliant series of novels other than that there was a river in the movie, other than there was a boat, an alien, a Neanderthal type, a blonde (*BLONDE?!?*) Alice Hargreaves . . . But I watched only to be increasingly disappointed. I do so hope that when someone decides to adapt Arthur C. Clarke's *Rama Saga* for the big (or little) screen that it's not the Sci-Fi Channel who get the rights because if this adaptation of *Riverworld* is the general way they go about translating book to screen, I'll . . . well, I don't know - it doesn't bare thinking about. My IMDb vote for this appalling adaptation is 1 out of 10. And I voted that ONLY because 0 (zero) isn't available. My advice to anyone considering watching this movie is GIVE IT A MISS!",
         "Whilst writing this review I am wiping the tears of shock and horror from my eyes, what have they done??? Emily Lloyd with a Perm as Alice Liddell.AAAAAARRRRRRRGGGGGGHHHHHH Richard Burton missing King John missing. Sam Clemems AAGGHHHHHHHHH. Underwater Bubbles, ridiculous 100 ft grailstones, the riverboat finished by the time the main character appears. All these add up to something put together over someones breakfast whilst they had a hangover. Please don't try any adaptations of any more PJ Farmer novels, please stay away from Dayworld, I don't think I could take it. By far the worst adaptation since ever. I am now going to carry on weeping. Read the novels",
         "First off, the death-knell for any movie, TV or otherwise, is having the Sci-Fi channel involved in any way, shape or form, in the production of it. They've yet to turn out anything that has aroused anything but scorn in my heart. What's more, they seem hell bent on taking the greatest of fantasy and sci-fi fiction and reducing it to mindless drivel suitable only for retarded morons. Riverworld, based on Philip Jose Farmer's books, is a rich fantasy/scifi world deserving of far more than the atrocious mauling it received here. Normally, I can gloss over minor deviations from the book, if the spirit of the work is maintained intact. But here there are so many \"minor\" deviations that it got ridiculous. Plus, the spirit of the books has clearly been exorcised in favour of cheap action and even cheaper effects. Gone is King John. Gone is Richard Burton. Gone is Hermann Goering. The Grailstones look like some kind of weird fungus. There are horses on Riverworld. The Grails apparently float about on the river and get washed ashore along with the new arrivals. People are resurrected at different times, instead of all at once. All complete nonsense. People are resurrected naked (which is true to the books) but with a complete head of hair (not true to the books). What's worse, this hair springs magically into an appropriate hairstyle at the beginning of each day, regardless of the lack of modern amenities to style/shape/cut it. And what was with the Grails producing clothes straight off? If I recall, it was some weeks before the Grails produced clothing. But putting aside all these inaccuracies (sorry...re-imaginings) how could you take this material and make a movie that is D-U-L-L. The cast blunder from one tedious scene to the next. There is no real sense of wonder or excitement at any of it. It just plods along like a substandard episode of \"Days of Our Lives\". And why axe Richard Burton? Most people seem to think it was to appease the American audience by having the main hero more identifiable. But whilst this may be partly true, I propose another reason. The writers believe that we're all too stupid to figure out who Richard Burton was. Anyone that is capable of butchering this material so badly is also quite capable of thinking we'll all confuse Richard Burton the Adventurer with Richard Burton, the Actor. Further, what was with Sam Clemens being reduced to a \"Please Sir! I only want to steer the boat!\" character. A far cry from the version portrayed in the books. But then....can't be two strong male leads in a movie...no, no, no! Might confuse us poor souls as to who we're supposed to be rooting for. Bah! The acting is, as you might expect, of TV movie standard. Unfortunately the main character played by Brad Johnson bore a striking resemblance to Reb Brown, another muscley actor who starred in the dire Space Mutiny. Even the acting styles were similar. Given this, I found it hard to take Brad seriously in his role. The rest were OK in the acting stakes. But why did the alien have a facial tic? It became increasingly irritating as the film went on and served no purpose whatsoever. And why was the black 17th century slave also a martial artist? These questions (and many more) will no doubt be glossed over casually if the series ever gets greenlit. Here's hoping it never does. With costumes and sets left over from episodes of Xena and Hercules, you might begin to get the idea of what you are in for if you watch this rubbish. Take my advice. Read the books instead. And to any authors out there who get approached by the Sci-Fi Channel....I don't care how much money they offer you! Just say No!",
         "I can't understand why this movie was made, or for whom. It couldn't have gotten any worse scenery, nor any worse acting. The theme chosen is the only thing interesting and imaginative in this movie,as different kind of people coming from different times are brought in the same place, after an event which can't be stopped by anyone, death, but it is not nearly enough to make it a good film. Many things don't have a reason, details are not well created and most of all the movie is pathetic, as it is based on themes that are used in romance novels, of course there exists a love story between two perfect characters, the strong and intelligent man, and the blonde beautiful women. The negative character is pure evil, as he doesn't seem to have any quality. The movie doesn't continue the after-life theme, as it is left for the viewers imagination. In conclusion, I haven't seen a worse movie in some time",
         "An obvious \"Made For SciFi Channel\" movie. Although completely controlled by clichés and incongruous chances, it is a quaint and cute movie. Many of the famous/successful sci-fi writers have used many of the ideas here for basis for their works. Riverworld is a conglomeration of many good stories. It is some what of a shame that many of the main characters (good and bad) had to be formed in such a hurry at the beginning. Most of the characters were performed well by the actors. Some were a bit silly - which only takes from a good story. Luckily the script was OK, scenery was super-excellent (New Zealand I guess), and very good 'store bought' props.",
         "Not surprising that Sci-Fi would produce such a horrible tv/F- movie. Whoever greenlights a project over there outta be taken out back and put out of his/her misery. Riverworld is a noble and daring project to undertake, but it ends there as soon as you see the space shuttle hurdling through space in the opening sequence(I can just see the crew shaking and rattling the ersatz-shuttle cockpit in some huge studio, most likely in New Zealand.) These hack producers and writers take such liberties with Philip Jose Farmer's original material, which was brilliant! The first thing to do is get the script right, we will forgive the bad production values, and the bad fight scenes. There are so many horrible movies out there, why add to the list. Read the books by Philp Jose Farmer instead!",
         "I re-watched this today, and still like it. Phillip Jose Farmer's works were always fun but no great classics, so I don't mind that the movie deviated a lot from any of the books. Books is books, movies is movies. The scenery of New Zealand is almost worth watching just to see it - it is truly spectacular. The story is the expected thud and blunder of folks showing up nekkid on a new world, so I was willing to put up with that just to get the riverboat launched. Hale, Sam Clements, and Nero seem interesting enough and good enough; with this kind of movie, the plot and the effects are mostly what matters. Of course, with Sam Clements on board, we could expect more inventions with the flavor of the \"Connecticut Yankee ...\". I hope that they make more of these -- c",
         "Though clearly in the minority in this forum, I liked the movie. Entertainment is successful when it stirs us (usually emotionally). Books do that by tickling our imagination and letting our minds fill in the blanks with whatever we choose. Cinematography stimulates us with (ever improving) visuals and still lets our minds fill in the blanks. It seems that Riverworld did just that for me. The movie provided two hours of entertainment and stimulation that left me wanting to see more. Exactly what I want in a movie. The movie ended with only part of the story having been told. Just like the Star Wars and LOTR movies, the story finds a natural break but doesn't complete. I doubt that a second movie will be made, but I'd like to see The SciFi Channel pick it up as an abbreviated series much like they did we The Dead Zone, Grey's Anatomy, etc. The real test will be if they can produce a series that earns a second season. As far as the variance from the books, I don't care. That's inevitable.",
         "The idea of a fairly low-budget TV adaptation of a high-concept sci-fi/fantasy novel series like Riverworld led me to believe that it would probably be terrible. Judging by the quality of a lot of other recent TV sci-fi material, I knew I shouldn't get my hopes up about this. I was however positively surprised, and very much so. Despite the changes, which were understandable and acceptable, I thought this was a very well-crafted and admirable movie version. I only have one big complaint, which is what earns this movie a rating of 6 instead of something much better: There were far too little historical content. The point of this whole scenario; what makes it cool, is that all of history is its playground. There can be a multitude of historical references, both in terms of cultures and individuals. The inclusion of Nero and his rocket-like rise to power was a *great* element, but there should have been a lot more of that kind of stuff. To only reveal Sam Clemens' identity at the very end was a huge mistake; it should have been a major point from the moment they met him. And there should have been all sorts of other details. Where, oh where, was Sir Richard Burton, who in and of himself is a treasure trove of historical trivia?!! The movie comes up short because of its low historical content. The writers obviously couldn't be bothered to actually do some research, which is a great shame. Because otherwise this was a surprisingly well-produced movie. In the end, its shortcomings only makes one appreciate the novels all the more, giving one the urge to reread the real thing. 6 out of 10.",
         "Awful movie. I read all the books of the Riverworld saga and was very surpised to see only two hour version, but I did not expect such disgusting \"interpretation\". Total waste of time and resourses. Total humiliation of Philip Farmer's name. My suggestiot to the producers: Get another job!!!!!!!!",
         "I finally came to a startling conclusion. I think I'm a fan of would be epics that are made for Television. There is something imaginative and fun about these films that have to work with smaller budgets and might not feature state of the art effects or big movie actors. Riverworld was a whole new concept to me, I have not read the books nor had I ever heard of it before. I kept looking at it in the video aisle and thinking about seeing it. Riverworld is the story of a dimension, planet, other worldly place of some sort where those who die are resurrected under water onto a lush, beautiful landscape with many others who have died. There are higher powers at work but they perform mysteriously from the outside without revealing themselves. They release the people from under water cocoons when they are \"reborn.\" The planet is inhabited seemingly by those only resurrected but some have been there longer than others giving them time to try and dominate everyone else. Jeff Hale who died while doing a tour of space for Nasa finds himself trying to bring together the other people who are resurrected at the same time he is including none other than Emperor Nero. They are quickly captured and forced to slavery by the current ruler of Riverworld Valdemar. Hale escapes with the help of a mysterious being and by the time he rescues everyone else Emperor Nero has overtaken Valdemar and created his own empire in the hopes of rebuilding Rome on Riverworld. Hale leads the others with the help of a mysterious Alien being who also died and was resurrected on the planet, to another group of people led by Sam who are building a riverboat in order to explore the world more. When Nero attacks them Hale and others must fight him off in order to escape and find out what lies beyond in Riverworld. Although short the movie is well directed and beautifully shot and uses some very nice special effects even if they are low budget. Brad Johnson who I love as Rayford Steele in the Left Behind films does a really great job. He's a terrific, very under rated actor who looks the part of a big star. He commands the screen and is a great leader. Jonathan Cake as Nero is equally as great. He appears to be someone who should be in an Epic about Rome and instead is dropped into Riverworld which is perfect for this part. This film definitely cries out for sequel or series and mostly this was made as an introduction so I hope they don't stop it here, otherwise this film is really pointless on it's own but it's a great introduction. Fortunately the film is short enough that it never has to hold your attention for very long. The gore is minimal and never shows any serious violence despite the sword play. The main focus is on Johnson's character and he holds his own quite well. I am definitely looking forward to sequels. Check this out for something low budget and a good time. 7/10",
         "I read and loved the books, and was keen to see this adaptation. Now I finally have seen it, and as an adaptation of the concept it was quite good. But you have to understand the limitations - it's not all about budgets. There is nowhere on Earth like Riverworld - an endless river with a flat plain on each side leading to unclimbable mountains. The locations were beautiful, but they could never be like Riverworld. So already the concept has to be altered. So why not make use of the terrain you have, and have fortresses on hills and cliff top dives. A movie with the same scenery is going to get dull, however good the story. As for the characters, I've no problem with excising Burton and replacing him with Mr All America. Few viewers will have heard of Burton, and while a novel has the luxury of as many pages of back story as it needs, a teleplay demands quicker narrative. Besides, the character was basically the same, just given a different name and an easier background to take in. And any Riverworld virgins who didn't recognise Mark Twain straight away should be ashamed... although I don't think it was made clear enough exactly which Alice Alice was. It's also understandable that Herman Goering would make an unsuitable bad guy, and perhaps King John's profile in America isn't that great (wretched lion in Disney's Robin Hood?). Nothing wrong with Nero, someone everyone will know about, and far back in history enough to take some liberties with. It was obviously intended as a pilot for a show that never happened, but which would have had a terrific scope for infinite plots - worth the sacrifices in my opinion. I hope it is revisited someday more intelligently and more closely to the books - perhaps with a Final Fantasy-style fully CGI look.",
         "If you start to watch this movie in the light hearted sense it was directed and shot in, you will really enjoy it. I started thinking that this movie was going to be really bad, but for some reason felt compelled to watch through, to my benifit, the end indicates there will be more in the series, as they begin to head up river to the source. Me, I can't wait for the next one! **Note if you don't like Xena Warrior princess, this movie reaks of it.",
         "I read one of the books some 20-25 years ago, I think. My memory of it is a little hazy, but I know I loved it. What an awesome idea: The entire human race, every saint and sinner who ever lived, all 36 billion of us, spewed out all at once, randomly along the shores of an alien planet. I expected this TV adaptation to be trash, but to my surprise I actually sat through the whole thing while defragging my computer. Sure, there were a lot of cheap TV-movie qualities. I didn't remember this apple-pie Captain Kirk American astronaut from the book. (Fellow IMDb commentators remind me that in the book he was the complex Romantic English adventurer Burton.) And the African priestess was awfully cheesy and inauthentic for our sensitive and politically correct age. (She's a cross between a corny \"native\" of 1930's jungle flicks and a more modern stereotypical angry black woman. But she's easy on the eyes, and maybe that's all that really matters.) And the whole Valdemar thing was your standard \"Xena-like\" action fare, as other commentators have so aptly put it. But the main idea of Riverworld remains powerful. The actors are quite good. The gorges and beaches of New Zealand are stunning. The special effects and the riverboat are more than adequate. All-in-all, better than average TV fantasy adventure."
      ],
      "genres": [
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Alliance Atlantis Communications",
         "Tasman Films",
         "Box TV"
      ],
      "summaries": [
         "Hale, an American astronaut dies and is reincarnated with other persons who have lived throughout all of human history and end up on a mysterious planet called 'Riverworld'. The humans are left to their own devices and create tribal fiefdoms and succumb to brutal wars and raids. A mysterious race of hooded 'beings' oversee them - sometimes intervening, but their motives are unknown. Anyone who has ever lived and died on Earth comes here rather than 'the afterlife', even an extra-terrestrial call Monat, who had the unfortunate luck of dying on Planet earth in 2039. Hale leads a revolt and joins with others on a large boat to explore this mysterious new world.",
         "After an astronaut crashes, he finds himself in a rejuvenated body on a Waterworld. He also finds that he is surrounded with souls from many different eras and an alien being that died on Earth in the future. Immediately captured by a ruling group, the astronaut finds himself leading a group fighting for freedom. Also the soul of Nero Claudius has found its way to Riverworld and wants to resume his role as Emperor."
      ],
      "budget": 0
   },
   "movielensId": 123785,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2003-03-22",
      "dvdReleaseDate": null,
      "directors": ["Kari Skogland"],
      "runtime": 86,
      "movieId": 123785,
      "title": "Riverworld",
      "mpaa": "",
      "actors": [
         "Brad Johnson",
         "Karen Holness",
         "Kevin Smith",
         "Cameron Daddo",
         "Jonathan Cake",
         "Emily Lloyd",
         "Patrick Kake",
         "Colin Moy"
      ],
      "imdbMovieId": "0310952",
      "originalTitle": "Riverworld",
      "genres": [
         "Fantasy",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["UBAOBwsuG74"],
      "plotSummary": "A movie for the Sci Fi Channel based on the book series by Philip José Farmer. The location is Riverworld, a mysterious and treacherous land where every human who died between the years 99,000 BC and 2,200 AD has been resurrected on the banks of a huge river.",
      "tmdbMovieId": 16356,
      "avgRating": 1.875,
      "releaseYear": "2003",
      "numRatings": 4,
      "posterPath": "/4eypIausFMrDY62pTSF6rIgj5xQ.jpg"
   }
}