{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "fairy tale",
            "id": 3205
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "sex comedy",
            "id": 170827
         }
      ],
      "imdb_id": "tt0077534",
      "video": false,
      "title": "Fairy Tales",
      "recommendations": [
         27737,
         327651,
         45937,
         84994,
         29121,
         34593,
         131673,
         85181,
         71072,
         433829,
         36212,
         42780,
         81887,
         283749,
         77173,
         36214,
         23050,
         38020,
         83913,
         5735
      ],
      "backdrop_path": "/bPTlxAZBJXMDZ13A1oVfZNpW2mk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Prince",
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a255",
               "name": "Don Sparks",
               "profile_path": "/yUzmjgYocS3IYKHzYtBXVDW3KYK.jpg",
               "id": 104942,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Sirus",
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a259",
               "name": "Sy Richardson",
               "profile_path": "/kPlnnAmAbqQB33OcEVXiScK1Brr.jpg",
               "id": 58623,
               "order": 1
            },
            {
               "cast_id": 23,
               "character": "Sleeping Beauty",
               "gender": 1,
               "credit_id": "52fe45fcc3a368484e07a295",
               "name": "Linnea Quigley",
               "profile_path": "/s9B3j05yyuaIqSTab9tvkYCSnT2.jpg",
               "id": 97619,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Gussie Gander",
               "gender": 1,
               "credit_id": "52fe45fcc3a368484e07a271",
               "name": "Brenda Fogarty",
               "profile_path": "/oj44KcMDPwwB1QneK2kCH6wZaL9.jpg",
               "id": 104947,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Doorman / Tommy Tucker",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a269",
               "name": "Robert Staats",
               "profile_path": null,
               "id": 104945,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dr. Eyes",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a25d",
               "name": "Irwin Corey",
               "profile_path": "/rLpmlAF4SVjjUX1mv3KIbDSV8qn.jpg",
               "id": 28035,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Jill",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a285",
               "name": "Lindsay Freeman",
               "profile_path": "/cy4P8kFHCBxKEwchhexxwqyl4mm.jpg",
               "id": 104949,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Little Bo Peep",
               "gender": 1,
               "credit_id": "52fe45fcc3a368484e07a28d",
               "name": "Angela Aames",
               "profile_path": "/u76XgPVGkToA1yyhd78HtYcGjQH.jpg",
               "id": 45463,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Dr. Ears",
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a261",
               "name": "Robert Harris",
               "profile_path": "/qIoC063938cTJovaX7jzR21iR7Y.jpg",
               "id": 104943,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Dr. Mustachio",
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a265",
               "name": "Simmy Bow",
               "profile_path": "/pkF5VoNrpjXH6PB9QXf7oeWLC0H.jpg",
               "id": 104944,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Aunt La Voh",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a26d",
               "name": "Martha Reeves",
               "profile_path": null,
               "id": 104946,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Baron",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a275",
               "name": "Frank Ray Perilli",
               "profile_path": null,
               "id": 29745,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Otto",
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a279",
               "name": "Angelo Rossitto",
               "profile_path": "/VY3ygib44431zOtUBEwlnCWJeK.jpg",
               "id": 97985,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Old King Cole",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a27d",
               "name": "Bob Leslie",
               "profile_path": null,
               "id": 104948,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a281",
               "name": "Jeff Doucette",
               "profile_path": "/bIqp3gIoSl2DP8TcbuxehsG91zL.jpg",
               "id": 35367,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Scheherazade",
               "gender": 1,
               "credit_id": "52fe45fcc3a368484e07a289",
               "name": "Nai Bonet",
               "profile_path": null,
               "id": 40049,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Snow White",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a291",
               "name": "Anne Gaybis",
               "profile_path": null,
               "id": 58808,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Naked Girl",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a299",
               "name": "Idy Tripoldi",
               "profile_path": null,
               "id": 45576,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Elevator Operator",
               "gender": 0,
               "credit_id": "52fe45fcc3a368484e07a29d",
               "name": "Mariwin Roberts",
               "profile_path": "/1NK4Hz5ltpS2m0xekxIcbbzRQsD.jpg",
               "id": 104950,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "S & M Dancer",
               "gender": 1,
               "credit_id": "52fe45fcc3a368484e07a2a1",
               "name": "Evelyn Guerrero",
               "profile_path": "/t3IMccY9hBcV91lgHVks2Wd3E1w.jpg",
               "id": 25578,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45fbc3a368484e07a239",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45fbc3a368484e07a23f",
               "name": "Charles Band",
               "profile_path": "/ulNdloEQNPhKrFOloAwW2R3m6DU.jpg",
               "id": 19707,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fbc3a368484e07a245",
               "name": "Frank Ray Perilli",
               "profile_path": null,
               "id": 29745,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45fbc3a368484e07a24b",
               "name": "Daniel Pearl",
               "profile_path": null,
               "id": 6042,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a251",
               "name": "Richard Band",
               "profile_path": null,
               "id": 19711,
               "department": "Production",
               "job": "Production Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45fcc3a368484e07a2a7",
               "name": "Harry Hurwitz",
               "profile_path": null,
               "id": 595684,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.447762,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29817,
      "vote_count": 5,
      "budget": 0,
      "overview": "On his twenty-first birthday, the Prince goes on a quest that takes him across the land searching for the one woman that gets him sexually excited, Princess Sleeping Beauty.",
      "similar": [
         10882,
         11224,
         224141,
         14128,
         16119,
         4523,
         407655,
         1417,
         38757,
         808,
         812,
         10530,
         824,
         872,
         10020,
         10674,
         809,
         109445,
         150689,
         321612
      ],
      "original_title": "Fairy Tales",
      "runtime": 82,
      "poster_path": "/oCP30w2zPmwwdOmxpoo8ju7UAzS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Charles Band Productions",
         "id": 1295,
         "origin_country": ""
      }],
      "release_date": "1978-08-01",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Some Day Your Prince Will Come. A lusty, rowdy spoof of all your favorite fairy tales!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Harry Hurwitz"],
      "runtime": 76,
      "synopsis": null,
      "writers": [
         "Frank Ray Perilli",
         "Franne Schacht"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077534/",
      "coverLink": null,
      "actors": [
         "Don Sparks",
         "Sy Richardson",
         "Irwin Corey"
      ],
      "reviews": [
         "Nudity in a movie can be mere eye candy, no different to looking at the images on one of the magnificent ceilings painted by artists such as Fragonard, or it can be presented with a sexual significance. It can be shown in various ways, as a totally natural incident appropriate to the scene being sceened, as pure fun, as erotic stimulation, as downright dirty comedy, or as explicit sex - although this is generally regarded as making the film pornographic. It can also be presented musically, and with so many possibilities it is hardly surprising that many filmgoers will enjoy some, but not all, of these forms of presentation. All such material will however usually result in the film in question being classified as for adult viewers only. Back in the 1970's three films incorporating such material were released under titles commonly associated with children's literature. These were \"Alice in Wonderland\" (1976), \"Cinderella\" (1977) and \"Fairy Tales\" (1979). It is therefore particularly important that reviews of these films should make their contents quite clear, as there are reported to have been instances of video hire firms who were sued by irate parents inadvertently borrowing these films for their offspring's entertainment. Both Cinderella and Fairy Story have been released through the same distributors (Astral) and can best be described as musical comedies for adults which makes liberal use of nudity in fun sequences; they do not fall into the dirty comedy category and, since many of the songs are more humorous and less suggestive than those often encountered in music videos, they are not likely to offend many of the viewers who know what to expect. Some of those who have commented on these films in the Imdb data base have expressed a preference for Cinderella, but I personally preferred Fairy Tales. Both these films are very similar in style, and choosing one in preference to the other is essentially a matter of taste. My preference is largely based on the impression that Fairy Story provides more variety, with new characters drawn from classic children's stories appearing at regular intervals throughout the film. By contrast the story of Cinderella is very well known and even when retold in adult form some of the element of surprise, which is important for films of this type, is lost. The music and songs in both films are excellent and are such fun that it would be hard not to enjoy them, a sequence in Fairy Tales where Snow White is set upon by her seven little dwarfs is particularly enjoyable (probably it could not even be filmed today as the Society of Dwarfs, or some similar body, might protest forcibly about unflattering representation of those handicapped individuals which it represents), and the presentation of the house in a shoe as the local house of ill fame, with Robert Staats as a copybook ponce, is hilarious. Ultimately I usually find that the success of a film of this type is assured whenever it is very clear that all the cast had a whale of a good time whilst creating it. This is certainly the case here, and I have no hesitation in strongly recommending this film to anyone interested in seeing it. For a film of its genre I would rate it at 9 out of 10.",
         "I fell in love with this \"soft porn\" turn at first viewing. It could have been just another slipshod \"peepshow\" as is the case of most T&A features. Instead, Hurwitz and Perilli decided that anything worth doing is worth doing well. The music is absolutely splendid and memorable and wickedly tongue-in-cheek (I am quite partial to \"Beat Him Daddy A to the Bar\" and \"Little Bo Peep\". All of the characters are well realized and fleshed out (so to speak) given the genre. Being an actor myself, I can tell when performers are having fun with their roles...a mainstay of successful comedy. They seem to have been having a blast. Anyone who can get through Tommy Tucker's (Robert Staats)scenes without a hearty belly-laugh (to say the least) is likely dead, humorless, or made of stone. Well done all around. I give it a \"10\". Highly recommended.",
         "Basically a R-rated spoof of fairy tale characters. Naturally all the woman are young and beautiful and take off there clothes for no real reason; there's no male nudity (unfortunately); the songs are actually funny and well-done (the \"Snow White\" number broke me up) and there's no real sex or anything. Tons of female nudity but done very innocuously and in a refreshing matter-of-fact manner. It's silly, brezzy and entertaining. The low budget is obvious but it actually doesn't hurt the movie--I mean, who expects high production values from THIS? So very good for an R-rated adult spoof. Not \"Citizen Kane\" but fun.",
         "\"My Venus lies five inches below my belly-button. But it's better there than in Uranus.\" I gave this film a 10 not because it's a great movie (it's not) but because it is so unique and weird that everyone really must watch it before they die to truly experience the world. My friend Jason and I both watched this when we were twelve and fell in love with its absurdity. Now, thirteen years later Jason found it again on Netflix and we decided to bring back old memories. Oh, and it was as strange as we remembered if not stranger. The story if of a prince who must have children in order to carry on his kingdom. But he can only be aroused by one woman, a princess he has never met and who may or may not exist. So he goes on a musical quest (yes, this is a musical) through fairy land to find her. Along the way, he encounters Little Bo Peep, Jack and Jill, Tommy Tucker, Snow White and the Seven Dwarfs and others. And they sing, and they're naked. The songs are great and the excessive nudity is interesting. What is funny is that the nudity is not erotic and at no point does anything sexual ever happen. Yes, seven clothed midgets do lie on top of a naked Snow White, but no flesh touches flesh. The only attractive woman in the film (besides maybe Jill) is none other than Linnea Quigley, known for her roles in numerous B-movies and fro ma few Cheech and Chong films. Among horror fans, she's best known as the goth chick from \"Return of the Living Dead\" (which, incidentally, might be one of the greatest zombie movies ever). While her part is very small, this also happens to be one of her first roles. So if you like a young Linnea, you really need to see this. (Although, as I said in the intro, if you really want to live you have to see this anyway.) Recommended beyond your wildest dreams. Just don't let two twelve year old boys watch it or they'll grow up to become addicted to the absurd... or worse yet, horse porn.",
         "Charles Band strikes gloriously ridiculous schlock movie fool's gold with this giddy, bawdy, cheerfully lewd, crude and rude vaudeville revue-style soft-core sex musical comedy send-up of beloved Mother Goose nursery rhyme characters who are tossed smack dab into the middle of a gratuitous nudity-packed, sex-ridden, scuzzy pun-laden low-budget nice'n'naughty goofathon loaded with wink-wink, nudge-nudge hammy acting, pretty girls frequently shedding their scanty apparel, cheesy Cole Porter-type song-and-dance numbers, leering double entendres, grotesquely drawn black, homosexual and sexually deviant characters, semi-explicit simulated sex, dirty jokes about erections and voyeurism, and an ingratiatingly good-natured sense of aim-for-the-groin lowbrow high school locker room humor. A jaded prince (pudgey, homely, acne-scarred dork Don Sparks), rendered impotent by having made love to too many castle babes, has to immediately find that certain special fair maiden who will arouse him in order to produce an heir and rightfully assume his natural role as king. So Prince Plug-Ugly Clod goes roving the countryside in search of his elusive alluring queen and has bizarre encounters with a motley assortment of mugging, freaked-out, libidinous oddballs. The Little Old Woman Who Lives in a Shoe (vampy Brenda Fogarty) is the madam of a bordello. \"Repo Man\" 's Sy Richardson, carrying on like he's in a way soulful blaxploitation picture, does his flippy jive-a** thing as Sirus, a preening, flamboyant pimp with an over-sized bright red codpiece. \"Professor\" Irwin Corey contributes a typically over-the-top turn as a manic, wheezing, profanity-spewing sex expert doctor. Snow White (luscious dish Annie Gaybis) participates in lively group sex with the lascivious seven dwarfs. Little Bo Peep (gorgeous buxom blonde honey Angela Aames) not only loses her sheep, but also her clothes as she squeaks out a dreadful tune in a grating, high-pitched adenoidal voice before falling out of her flimsy dress and revealing her bountiful breasts. Cuddly unclad imp Lindsay Freeman pops up as the insatiable Jill, who can't get mincing gay Jack to make love to her. Robert Staats as gabby smarmy doorman Little Tommy Tucker, Angelo Rossitto as a lecherous midget lawman, and Bob Leslie as randy Old King Cole devour the cheap forest scenery with lip-smacking uninhibited aplomb. Juicy Ida Tripoldi fails to turn on the prince as a delicious naked chick birthday present. Delectably voluptuous belly dancer Nai Bonet shakes her fleshy, undulating body and pours glistening oil on her shapely buttocks while shaking it to a grinding disco beat. Marita Ditmar and future \"Dallas\" cast member Evelyn Guerrero, wearing just leather S&M masks, engage in an absurdly campy dungeon-set chains'n'whips \"beat me because it feels so good\" number. A fresh out of high school Linnea Quigley, looking incredibly cute and prior to her substantial 80's scream queen fame, gets the prince's motor running as the yummy, untainted Sleeping Beauty. Director Harry Tampa, working from a gleefully coarse, filthy-minded, resolutely vulgar and unsophisticated script by Frank Ray Perilli and Franne Schacht (they also wrote \"Laserblast\" for Band), keeps the tone unremittingly smutty, yet light-hearted throughout, while cinematographer Daniel Pearl blinds the audience with lots of chintzy vertical wipes and dissolves and composer Andrew Belling and lyricist Lee Arries deliver the dopey goods with such choice sleazy songs as \"Been A Virgin Too Long\" and a kinky bondage-and-discipline-themed variant on the classic rhythm-and-blues ditty \"Beat Me Daddy Eight to the Bar.\" Trandscendently tacky stuff.",
         "Harry Hurwitz, who also worked with Charles Band on porn documentary 'Auditions', creates a fun-filled version of favourite fairy tales. Though for adults the humour and sex is actually all quite innocent and kind of charming which makes this a watchable and entertaining movie. The songs are cleverly written and produced to a very high standard and also sung very well. Songstress Martha Reeves has a small role and performs one song (later in life Reeves claimed she was duped and did not know it was an adult film - to be fair her scene looks innocent and has her surrounded by cast, including the prince, in traditional dress). All of the acting is very good with Sy Richardson as a pimp (Richardson also worked on Band's soft porn version of 'Cinderella' before becoming famous). Angela Aames as Bo Peep is exceptionally pretty and proves what a shame her untimely death was. Co-writer Frank Ray Perilli worked alongside Albert Band for many years and later with Charles as he was starting out. Plot wise there is not much to add about the film, story is slight at best. This is a really credible film and even now among what would eventually become Full Moon Pictures best.",
         "This 'erotic fairy tale' film rehashes similar plotlines from earlier films, most notably \"Cinderella,\" with the premise of an impotent prince looking for a woman who can excite him. Since all of the 'good' material had been taken by earlier films, \"Fairy Tales\" pulls from many sources, from nursery rhymes like 'Little Bo Peep' and 'Jack and Jill,' to tales like \"Snow White and the Seven Dwarves\" and even a cameo by \"Little Red Riding Hood.\" By jumping around so much, this film keeps your interest. It's fairly humorous and the T&A is harmless. Tommy Tucker's brothel-barker character is the most successful as he beckons passersby to enter 'the big shoe,' assuring that what they do there is \"nobody's business but your own.\" Where this film loses steam is in the penultimate song sequence, identical to the one in \"Cinderella,\" in which the cast sings the praises of Sleeping Beauty's virtues. Whereas in \"Cinderella\" the song refers to Cinderella's particular sexual expertise; here Sleeping Beauty's claim to fame is that she's a virgin. And comatose to boot. The prince, King Cole, and the Frog Prince (for whom i felt most sorry in that his plight could have been halted by a simple kiss from a virgin), despite the endless parade of literary babes, all desire Sleeping Beauty because she's never had sex. This sudden assertion of moral purity seems out of place and sort of disgusting in the light of the supposed sexual freedoms of this fantasy world. It brings a strangely didactic tone to this otherwise if-it-feels-good-do-it spectacle.",
         "Well, this is a surprise. A 70s nudie retelling of fairy tales. Not quite, more a very well written and amusing concoction using various fairy tales as props and naked ladies to help the visuals. Only in the 1970s could this have been conceived, let alone so successfully been completed. The atmosphere on set must have been fantastic because everyone looks happy and plays this to the hilt. The costumes are effective (when worn) and the main old Mother Hubbard's shoe/ brothel is a great idea. Some scenes are jaw dropping - what about the stripping of snow white by seven real dwarfs, a delectable and very young looking Linnea Quigley as the virgin all are after and Sy Richardson's pimp is so convincing. Eminent and prolific producer Charles Band has to take the credit and I was particularly surprised by the professional looking orgy sex scenes, which seem to have been added (back?) for this Blu-ray release. Oh and I almost forgot, halfway through, out of a smoking cauldron steps a smoking Martha Reeves for a very effective musical number.",
         "This is a very funny movie. Between the plot, the situations, and the musical numbers, you'll be entertained. And I'd be remiss not to mention the copious amounts of nudity and sex scenes.",
         "I regrettably saw this movie back to back with the German film \"Grimm's Fairy Tales for Adults\" and while both films are obviously \"for adults\", the former actually managed to capture some of the spirit of the original Grimm's Fairy Tales while this film is your typically smutty, painfully unfunny, and crassly stupid \"parody\" of the already highly bastardized American versions of the classic fairy tales (with a little Mother Goose thrown in for good measure). For instance, in this movie the Old Woman Who Lives in a Shoe (Brenda Fogerty) is a madam, her shoe naturally is a cathouse, and there is a stereotypical 70's black pimp (Sy Richardson). \"Snow White\", of course, is getting it on with her seven dwarfs (for all you people out there with dwarf fetishes). \"Little Bo Peep\" has lost her sheep, and apparently her underwear too. Perhaps worst of all, this movie follows the unfortunate 70's trend of being an annoying musical (i.e. \"Alice in Wonderland\", \"The First Nudie Musical\") because, of course, there's a great intersection of musical fans and softcore porn fans. But let me focus on the positive (what little there is). There is a very early if mostly wasted appearance by a young Linnaea Quigley (who gets naked natch'). Evelyn Guerrero, who had a memorable role in \"Cheech and Chong's Nice Dreams\", has a cameo role (with full-frontal nudity) as one of the \"S and M Dancers\". And perhaps most memorable is Tai Bonet as \"Schrenednaze\" (from \"Arabian Nights\") doing a naked belly dance (for some reason for Mother Goose's \"Old King Cole\") while rubbing oil all over herself. You just don't see naked belly dancing everyday. But is any of this worth enduring the rest of this movie? Uh, no. Watch \"Grimm's Fairy Tale for Adults\" instead",
         "I am a big fan of Scream Queen Linnea Quigley. That's why I thought it would be fun to watch her in her first film ever. Boy was I wrong! Linnea's part is so small that she barely even appears at the end. The rest of the movie is cheesy beyond belief. There are a few scenes that made me laugh, but nothing very memorable. What's even worse, the cast seems to be the ugliest cast I've ever seen in a movie! Linnea is sexy, but everyone else is disturbingly yucky! If you are going to make such a trashy flick, at least have the decency to hire some cute actors and actresses! If you are a Linnea fan, then fast forward to the very end. Don't waste your time otherwise!",
         "Lots of flubbage. Lots of laughs. Lots of music (which is kinda dumb). That's it."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": ["Charles Band Productions"],
      "summaries": ["On his twenty-first birthday, the Prince goes on a quest that takes him across the land searching for the one woman that gets him sexually excited, Princess Sleeping Beauty."],
      "budget": 0
   },
   "movielensId": 123894,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-08-01",
      "dvdReleaseDate": null,
      "directors": ["Harry Hurwitz"],
      "runtime": 82,
      "movieId": 123894,
      "title": "Fairy Tales",
      "mpaa": "R",
      "actors": [
         "Don Sparks",
         "Sy Richardson",
         "Linnea Quigley",
         "Brenda Fogarty",
         "Robert Staats",
         "Irwin Corey",
         "Lindsay Freeman",
         "Angela Aames",
         "Robert Harris",
         "Simmy Bow",
         "Martha Reeves",
         "Frank Ray Perilli",
         "Angelo Rossitto",
         "Bob Leslie",
         "Jeff Doucette",
         "Nai Bonet",
         "Anne Gaybis",
         "Idy Tripoldi",
         "Mariwin Roberts",
         "Evelyn Guerrero"
      ],
      "imdbMovieId": "0077534",
      "originalTitle": "Fairy Tales",
      "genres": [
         "Adventure",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "On his twenty-first birthday, the Prince goes on a quest that takes him across the land searching for the one woman that gets him sexually excited, Princess Sleeping Beauty.",
      "tmdbMovieId": 29817,
      "avgRating": 2,
      "releaseYear": "1978",
      "numRatings": 1,
      "posterPath": "/oCP30w2zPmwwdOmxpoo8ju7UAzS.jpg"
   }
}