{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "circus",
            "id": 291
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "false accusations",
            "id": 14783
         }
      ],
      "imdb_id": "tt0026023",
      "video": false,
      "title": "Zouzou",
      "recommendations": [],
      "backdrop_path": "/eCAs5M52lQkZ7ZAKHyG0SSUg0mu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Zouzou",
               "gender": 0,
               "credit_id": "55d4eb5092514102cf0029fc",
               "name": "Josephine Baker",
               "profile_path": "/wdSYqyqZKjM923BX7VhTuvdYRwt.jpg",
               "id": 1148018,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jean",
               "gender": 0,
               "credit_id": "55d4ed42c3a3684d9e0000b4",
               "name": "Jean Gabin",
               "profile_path": "/8CxpWkEoipIsBF9P2D0ypzzSHhs.jpg",
               "id": 11544,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Papa Melé",
               "gender": 2,
               "credit_id": "55d4ed8bc3a3685abc0009ae",
               "name": "Pierre Larquey",
               "profile_path": "/4rkKv3jTLJsk80pJ0AwZSgF88B4.jpg",
               "id": 12269,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Claire",
               "gender": 1,
               "credit_id": "55d4ed9cc3a368508c002891",
               "name": "Yvette Lebon",
               "profile_path": "/mtH5KfYFYPs8gT6wBoydXjX2Amt.jpg",
               "id": 57476,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Miss Barbara",
               "gender": 0,
               "credit_id": "55d4edabc3a3685070002a73",
               "name": "Illa Meery",
               "profile_path": null,
               "id": 1083849,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Saint-Lévy",
               "gender": 2,
               "credit_id": "55d4edbec3a368507f002b75",
               "name": "Pierre Palau",
               "profile_path": "/WeU4Eoxgmau00OHOid5gXtAUCC.jpg",
               "id": 550967,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Josette",
               "gender": 0,
               "credit_id": "55d4edd192514102cf002a27",
               "name": "Madeleine Guitty",
               "profile_path": null,
               "id": 545468,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mme Vallée",
               "gender": 0,
               "credit_id": "55d4ede8c3a368508f0024a8",
               "name": "Claire Gérard",
               "profile_path": null,
               "id": 11538,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "M. Trompe",
               "gender": 0,
               "credit_id": "55d4edf792514102d8002a2a",
               "name": "Marcel Vallée",
               "profile_path": null,
               "id": 235542,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4654c3a36847f80f9009",
               "name": "Marc Allégret",
               "profile_path": "/3kzHDulp7q0HMDqFIUwmTZvLUvR.jpg",
               "id": 238954,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55d4ee1c92514102cf002a2b",
               "name": "Carlo Rim",
               "profile_path": null,
               "id": 543677,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55d4ee46c3a368508c00289f",
               "name": "Arys Nissotti",
               "profile_path": null,
               "id": 1498380,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "582dfdb9925141095a00bbb7",
               "name": "Denise Batcheff",
               "profile_path": null,
               "id": 1311963,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "582dfdac925141095a00bbaf",
               "name": "G. Abatino",
               "profile_path": null,
               "id": 1498379,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5ac14a6cc3a3682d3500debb",
               "name": "Michel Kelber",
               "profile_path": null,
               "id": 70855,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5ac14a7b0e0a260c3900eb1c",
               "name": "Boris Kaufman",
               "profile_path": "/850nIfw8hXTPcBDRsvpyIkVAeMj.jpg",
               "id": 5261,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "5ac14a930e0a260c1400e2c7",
               "name": "Jacques Mercanton",
               "profile_path": null,
               "id": 11562,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5ac14a9c92514126be00e828",
               "name": "Louis Née",
               "profile_path": null,
               "id": 11577,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.044149,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 43603,
      "vote_count": 1,
      "budget": 0,
      "overview": "Zou Zou tries to help her childhood friend prove his innocence after he's accused of murder.",
      "similar": [
         96,
         357096,
         15069,
         984,
         15762,
         4638,
         49524,
         193893,
         4771,
         75780,
         948,
         807,
         306,
         445954,
         8090,
         429733,
         21484,
         979,
         1586,
         10285
      ],
      "original_title": "Zouzou",
      "runtime": 92,
      "poster_path": "/hfgFFf2xZTpaI28kKJabXgA2KPk.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Productions Arys",
            "id": 61259,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films H. Roussillon",
            "id": 61260,
            "origin_country": ""
         }
      ],
      "release_date": "1934-12-21",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marc Allégret"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "G. Abatino",
         "Carlo Rim"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0026023/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxODkzNDI3MF5BMl5BanBnXkFtZTgwOTM1MTA5MTE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Josephine Baker, Jean Gabin, Pierre Larquey | See full cast and crew »"],
      "reviews": [
         "ZOUZOU, a young, vivacious Creole laundress impresses all around her with her talent & wit. Longing for the love of her handsome adopted brother, she instead finds the possibility of enormous success in the musical theater... The marvelous Joséphine Baker is perfectly cast in the title role in this very enjoyable French film. With her enormous eyes & infectious smile, she connects with the viewer's heartstrings immediately. Her over-sized personality & obvious joy of performing make her a pure pleasure to watch. Here, Baker makes us care about what's happening to poor Zouzou, during her trials & triumphs. Gallic star Jean Gabin is effective as Zouzou's seaman brother, but this is really Baker's time to shine, and he nicely underplays his scenes. The film is well made, looking a little reminiscent of Busby Berkeley movies being produced at the same time in America - although unlike American films of this period, ZOUZOU hasn't any racism. It should be pointed out that there was no Hays Office or Production Code in France. Some of the dialogue & action is rather provocative, but it must be admitted that seeing Baker, strategically covered with tiny white feathers, sitting on a swing singing 'Haiti,' is one of the cinema's more memorable moments. Joséphine Baker was born in St. Louis in 1906, into a very poor family. Her talent & driving ambition, however, soon pushed her into moving East and she was briefly a cast member of the Ziegfeld Follies. Realizing that America in the mid-1920's held great limitations for a gifted Black woman, she managed to get herself to Paris, where she eventually joined the Foliés-Bergeres & Le Negre Revue. The French adored her and she became a huge celebrity. A short return to America in 1935 showed Baker that things had not changed for African-Americans. She returned to France, became a French citizen & worked for the Resistance during the early days of the War. Baker relocated to Morocco for the duration and entertained Allied troops stationed there. After the War, Baker's fortunes began to slide and she faced many financial & personal difficulties. For a while, she was even banned from returning to the United States. Finally, Baker accepted an offer from Princess Grace of Monaco to reside in the Principality. Joséphine Baker was on the verge of a comeback when she died of a stroke in 1975, at the age of 68. Having appeared in only two decent films - ZOUZOU & PRINCESSE TAM TAM - Baker is in danger of becoming obscure. But she deserves her place alongside Chevalier, Dietrich & Robeson as one of her generation's truly legendary performers.",
         "Josephine Baker's charismatic performance as \"Zouzou\", along with Jean Gabin's good supporting performance as Jean, make this an entertaining film. The story and the rest of the movie are not bad either, but probably would not have worked nearly so well without the two leads. Baker is more known for her stage shows, but she does a pretty good job here, full of charm and buoyant energy that give you every reason to care about her character. She grabs your attention whenever she is in a scene, but also gives her character a more thoughtful turn when it is called for. Gabin's talented, understated performance is a nice complement to her lead, and you can see why he would soon become a star in his own right. The story is a fairly familiar 'backstage' drama, with some romance and other complications thrown in. It's implausible at times, as such stories tend to be, but it moves at a good pace and it also provides the opportunity for some occasional lavish musical numbers. Most of the rest of the cast is just along for the ride, but they do their jobs well enough, and some of them have good moments of their own, too. Overall, it's a pretty good film, and one that does not show too many signs of age (except for some defects in the print itself). It should be worth a look whether you like classics, musicals, or stories about life back stage.",
         "I agree the movie is no \"Gone with the Wind\" but for 1934 and for a black woman it is quite an achievement indeed. The only thing comparable at the time was Halleluja! in the States starring Nina Mae McKinney -- and a stereotypical one at that. La Baker is stunning in the C'est Lui number - for which there still has been no comparison for a black American Actress - Lena Horne never got a white chorus of handsome men. Yes, the quality is poor by today's standards but look at Bette Davis's 1934 turn in Of Human Bondage or even It Happened One Night from the same year. None of them has really great film quality. It was, after all, 1934. So enjoy. If you like Josephine, you won't be disappointed.",
         "Jean Gabin was not long out of the Music Halls and had yet to make an impact on the screen when he made this movie so perhaps it is not so surprising to find him singing at one point. Marc Allegret's previous movie was Fanny, the second part of the great Pagnol trilogy so on paper the omens were good. Top-billed Baker had been wowing audiences in the Paris night clubs for the best part of a decade, her husband - with no discernible talent - had crafted a screenplay to showcase her assets and theoretically a good time was had by all and it was arguably daring if not unconventional at that time to avoid the clichéd happy ending an audience would have expected. In a nutshell Baker and Gabin have known each other since childhood when they were flaunted in a carnival as brother and sister despite their obvious different ethnic backgrounds. Gabin was content with this but Baker was looking for love in adulthood and doomed to disappointment. In an echo of 42nd St Gabin 'arranges' for the talented amateur Baker to replace the star of a show on which he is a technician and of course she scores heavily but having already introduced Gabin to a friend has to stand by unfulfilled. A better print may have helped but I'm glad I saw it without being overwhelmed.",
         "I enjoyed everything about this movie: camera, pacing, acting, dancing, plot, characters, French language, and historic value. Above all I enjoyed Josephine Baker's incredibly subtle singing, and the beautifully written and orchestrated songs. And the background music is also superb. The whole movie has an atmosphere of generosity and good cheer, and a pleasant absence of Hollywood glitter. They really don't make them like this anymore. Not for those who want blockbusting glamor. This is a modest film, but there is charm in modesty. Less is more.",
         "Most of this movie is the sort of mindless melodrama Hollywood and Paris produced in abundance in the 1930s. The acting is all fine, but the story is strictly from hunger. At the end, however, you get to see Josephine Baker in a major production number, the sort of musical extravaganza that made her a star in Paris. There, for five minutes, you understand that she was a lot more than just a woman in a banana skirt. Watch the rest of the movie if you're into melodrama. But definitely watch the end. It explains the French reputation of Josephine Baker.",
         "I've long been a fan of Josephine Baker, but have never seen more than clips of her films. This is one of her most famous films, in which she co-stars with Jean Gabin. Unfortunately, it's pretty worthless. It's a musical, but it really doesn't want to be a Hollywood musical. It wants to be semi-realistic, and the songs only take place on stage, so there's only a couple of them, and they're right at the end. The first seventy minutes are ridiculous, moronically plotted, and boring. Baker and Gabin are twins, in reality two adopted children of a circus man (Pierre Larquey). When they grow up, Gabin is a sailor and Baker a laundress. Kind of. Gabin immediately isn't a sailor, but is instead an electrician working in the theater, where Baker gets accidentally discovered when the big star (Illa Meery) is acting up. Baker's secretly in love with her brother, but her co-worker (Yvette Lebon) catches his eye. Oh, and Gabin is sleeping with Meery, too, maybe. At least in one random scene. Ugh, the whole plot is a mess. And then we get to the giant musical number, which is so silly it would make Busby Berkeley laugh in derision - and that should be a hoot, but it's so over-edited that it becomes annoying. The film only comes to life when Baker is given center stage, which is not close to often enough. Even then, she's burdened with ludicrous costumes, like the one that makes her look like she has yeti fur growing out her tits. Damn, I was really looking forward to this.",
         "Other than he infamous \"banana dance\", most American audiences know very little about the super-famous expatriate, Jospehine Baker. Her films are very rarely seen in this country. Since I really like French films and love 20th century history, it only seemed natural that I seek out this film. As far as the film goes, it's a rather ordinary musical much like 42nd Street or Footlight Parade, though not quite the quality of these two films. There are some Busby Berkely-style dance numbers, and all the normal clichés associated with the genre--with the addition of Ms. Baker and a young Jean Gabin (before he became a lot more famous). The only real problem was that it sure looked like the writers just weren't sure what to do--create a romance between the leads or not. Plus, maybe I wasn't watching close enough, but despite Baker's character being in love with Gabin's, I wasn't sure if the writers intended they were supposed to REALLY be brother and sister (or half-brother and half-sister). If so, this made it all seem kinda icky. FYI--parents should know that although this is an older film, there is some nudity. It's not super explicit, but does occur in the film.",
         "I enjoyed this film, for what it was. Produced in 1935, the film is simply edited and directed--no major film awards here. But the film represents the sense of the West toward the exotic in the 1930s. It is a great example of Orientalism in film. Look especially for the visual tactics and character portrayals that Baker exhibits--they make her seem very childlike, naive, and overly emotional. These are all signposts for the West's view of the Orient (Thank you Said!) Also, Baker's scene \"C'est Lui\" is highly reminiscent of Marilyn Monroe's scene \"Diamonds are a Girl's Best Friend\" from \"Gentlemen Prefer Blondes\"... this, of course, is a scene later appropriated by Madonna for her 1985 video \"Material Girl.\" This film is therefore a must for students researching early sex symbols in film.",
         "This is a simple story that really has no surprises but how can you resist a film that stars the legendary Josephine Baker? The worst part is that you don't hear her sing until the last 20 minutes and then you hear this tremendous voice that would put Mariah Carey to shame. It's also astonishing to see how different standards in film were in France. There is nudity here and it's kind of weird to see a film from 1934 that has nudity. Actress Illa Meery seems to have no problem with it. Also, their is a scene where Meery is in the same bed with her fiancé and while there's no nudity it's the suggestion of their relationship that's evident. In another scene Jean Gabin is walking down the street with a girl and his hand moves down to her rear. You can see that while Baker was not a trained actress she was a natural performer even when not singing. Her energy and personality more than carry the film and she easily steals scenes from her trained counterparts such as Gabin. That makes this film worthy of the archives. Not a great film but you can't resist watching a legendary performer that only made less than two dozen films."
      ],
      "genres": [
         "Crime",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Les Films H. Roussillon",
         "Productions Arys"
      ],
      "summaries": [
         "As children, Zouzou and Jean are paired in a traveling circus as twins: she's dark, he's light. After they've grown, he treats her as if she were his sister, but she's in love with him. In Paris, he's a music hall electrician, she's a laundress who delivers clean underwear to the hall. She introduces him to Claire, her friend at work, and the couple fall in love. Jean conspires to get the show's star out of town and for the theater manager to see the high-spirited Zouzou perform. When Jean's accused of murder and Zouzou needs money to mount his defense, she pleads to go on stage. Her talents may save the show, but can anything save her dream of life with Jean?",
         "Zou Zou tries to help her childhood friend prove his innocence after he's accused of murder."
      ],
      "budget": 0
   },
   "movielensId": 123911,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1934-12-21",
      "dvdReleaseDate": null,
      "directors": ["Marc Allégret"],
      "runtime": 92,
      "movieId": 123911,
      "title": "Zouzou",
      "mpaa": null,
      "actors": [
         "Josephine Baker",
         "Jean Gabin",
         "Pierre Larquey",
         "Yvette Lebon",
         "Illa Meery",
         "Pierre Palau",
         "Madeleine Guitty",
         "Claire Gérard",
         "Marcel Vallée"
      ],
      "imdbMovieId": "0026023",
      "originalTitle": "Zouzou",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Zou Zou tries to help her childhood friend prove his innocence after he's accused of murder.",
      "tmdbMovieId": 43603,
      "avgRating": 3,
      "releaseYear": "1934",
      "numRatings": 2,
      "posterPath": "/irIhiCYowznhyHK0XgsP4MZBNT2.jpg"
   }
}