{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0445461",
      "video": false,
      "title": "I Love Lucy: The Movie",
      "recommendations": [],
      "backdrop_path": "/sNEfIKUii6YXamDwB1m5hoAuAJr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lucy Ricardo",
               "gender": 1,
               "credit_id": "58cc9cd0c3a36851040026a8",
               "name": "Lucille Ball",
               "profile_path": "/56f15aAkHkdVDrFgfly5cUa1bbD.jpg",
               "id": 40174,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ricky Ricardo",
               "gender": 2,
               "credit_id": "58cc9cde9251415a390026cb",
               "name": "Desi Arnaz",
               "profile_path": "/fsRaJptnHcfx6j0shupOJiwgWbD.jpg",
               "id": 91711,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ethel Mertz",
               "gender": 1,
               "credit_id": "58cc9cf89251415a390026dc",
               "name": "Vivian Vance",
               "profile_path": "/z9D5Ys28CZAnHk9kv6q5mbx4Srk.jpg",
               "id": 153254,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Fred Mertz",
               "gender": 2,
               "credit_id": "58cc9d2bc3a368508c00278c",
               "name": "William Frawley",
               "profile_path": "/nG2PEowEAQEB7yiaJ6kvoFHNuNU.jpg",
               "id": 34285,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47f9c3a36847f815245f",
            "name": "Edward Sedgwick",
            "profile_path": "/4miRlnWpeUBMw1hH4weEcOlUTs8.jpg",
            "id": 122969,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.08264,
      "production_countries": [],
      "id": 51572,
      "vote_count": 2,
      "budget": 0,
      "overview": "The film plays out, with three first-season episodes edited together into a single story: \"The Benefit\", \"Breaking the Lease\", and \"The Ballet\", with new footage included between episodes to help transition the episodes into one coherent storyline. As the series routinely took the format of filming scenes in chronological order, this adds to the \"show within a show within a show\" format of the film, as viewers watch the cast perform the episodes live. The film itself ends with a \"curtain call\", as the cast comes out and Arnaz thanks the audience for their support.",
      "similar": [],
      "original_title": "I Love Lucy: The Movie",
      "runtime": 80,
      "poster_path": "/zeykcgvlY8jHbfpIrNX5xahnJuW.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1953-01-01",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Edward Sedgwick"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Bob Carroll Jr.",
         "Madelyn Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0445461/",
      "coverLink": null,
      "actors": [
         "Lucille Ball",
         "Desi Arnaz",
         "Vivian Vance"
      ],
      "reviews": [
         "I Love Lucy (1953) ** (out of 4) Forgotten \"movie\" had one screening back in 1953 but MGM pretty much forced Desi Arnaz to shelve the movie where it pretty much sat for the next fifty years, forgotten and considered lost until the footage was found and restored. What we have here are three episodes (The Benefit, Breaking the Lease, The Ballet) of the TV series edited together with new footage (directed by Sedgqick) of the cast on a stage filming the scenes. This \"movie within a movie\" is rather hard to judge for a couple reasons. On one hand, the TV stuff has some terrific moments with \"Breaking the Lease\" being one of the funniest bits of TV history. However, as funny as the TV stuff is, they're also edited to \"fit together\" in this movie. So, why watch them here when you could just watch the episodes on their own? The second problem is that this is a movie and as one it really doesn't work. We get the laugh track from the TV show, which shouldn't be in a movie and there's no question that the three episodes thrown together don't make a complete movie. The three episodes are quite different in tone so they just don't go together and in the end there's no question that you're watching three episodes and not one movie. I think at best this works as a curio and will probably appeal to die-hard fans of the TV show who have to see everything that the comic duo did. I'm not sure those unfamiliar with the show will get too much out of this and even a semi-fan like me probably could have lived without every seeing this thing. The opening and closing bits of added footage really don't contain any laughs, although getting to see the various cameras on the set used to film everything was pretty nice. In the end I think it would probably be best to just rent the season series and just watch the episodes on their own. The recently released DVD contains some nice extras and information on the making of this film and all of this is pretty much more entertaining than the actual movie.",
         "The question that gnawed at me as I watched this was a simple one. Just one word: why? I truly failed to see the point of this at all. Essentially, it's three episodes of the old TV series edited (very awkwardly) together, with a beginning and an ending tacked on. The beginning gives us a tiny bit of dialogue between, I assume, a husband and wife who are on their way in to watch a taping of \"I Love Lucy.\" They take their seats, Desi Arnaz comes out and explains a wee bit about how the show is made, and how the cameras are used, and he introduces Vivian Vance, William Frawley and, of course, Lucille Ball. I thought that perhaps the point was going to be a sort of behind the scenes look at the taping of an episode, but it wasn't. It then just became this awkwardly stitched together \"movie\" that was really just three episodes of the series that didn't really have any other relationship to each other. So on either side you have what was a typical \"I Love Lucy\" storyline, where Lucy tries to weasel her way into one of Ricky's shows, and sandwiched in between was an episode featuring a fight between the Ricardo's and the Mertz's, which almost leads to Ricky and Lucy moving out. That middle episode was the most awkward. It came literally out of nowhere (in the context of the \"plot\" - loosely defined) and it served no real purpose. The \"movie\" then ends with the audience at the taping getting up and leaving after the cast take a few bows. If you liked the TV series (and the series was good and creative and is widely acknowledged and accurately described as ground-breaking as far as television shows are concerned) then this has all the things you liked, including some good physical comedy from Lucille Ball, especially in the third segment. But why you wouldn't just watch the TV series, I don't know. Why Desi Arnaz thought about putting a movie together in this way is beyond me. The only thing I can think of is that in 1953 a lot of people didn't have TV sets and so had never seen \"I Love Lucy\" - but they had probably heard of it. So, here was a chance to make the show more widely accessible, I guess. It's interesting, I suppose, as a sort of historical curiosity. \"I Love Lucy\" represented the very early days of television, so I suppose it's possible that this might have been the first time anybody thought of taking a weekly TV series and turning it into a feature movie. That's pretty common today. In fact, sometimes it seems that Hollywood has run out of creativity and has little else to do these days but make movies out of old TV series. But in 1953? Not so. So, in that sense, it's a creative idea. But as I understand it, this was never actually released. Somebody obviously came to the conclusion that it wasn't worth the effort. (4/10)"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Desilu Productions"],
      "summaries": ["Desi Arnaz greets the \"I Love Lucy\" studio audience and invites them to watch Lucille Ball and the cast film a special extended episode."],
      "budget": 0
   },
   "movielensId": 124007,
   "movielens": {
      "languages": [""],
      "releaseDate": "1953-01-01",
      "dvdReleaseDate": null,
      "directors": ["Edward Sedgwick"],
      "runtime": 80,
      "movieId": 124007,
      "title": "I Love Lucy: The Movie",
      "mpaa": "",
      "actors": [
         "Lucille Ball",
         "Desi Arnaz",
         "Vivian Vance",
         "William Frawley"
      ],
      "imdbMovieId": "0445461",
      "originalTitle": "I Love Lucy: The Movie",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "The film plays out, with three first-season episodes edited together into a single story: \"The Benefit\", \"Breaking the Lease\", and \"The Ballet\", with new footage included between episodes to help transition the episodes into one coherent storyline. As the series routinely took the format of filming scenes in chronological order, this adds to the \"show within a show within a show\" format of the film, as viewers watch the cast perform the episodes live. The film itself ends with a \"curtain call\", as the cast comes out and Arnaz thanks the audience for their support.",
      "tmdbMovieId": 51572,
      "avgRating": 3.4,
      "releaseYear": "1953",
      "numRatings": 5,
      "posterPath": "/zeykcgvlY8jHbfpIrNX5xahnJuW.jpg"
   }
}