{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "brother",
            "id": 5301
         }
      ],
      "imdb_id": "tt0067983",
      "video": false,
      "title": "Whoever Slew Auntie Roo?",
      "recommendations": [
         41035,
         36754,
         29067,
         122268,
         106682,
         39925,
         449751,
         55863,
         87151,
         112687,
         42630,
         106679,
         26204,
         85198,
         48350,
         395965,
         79576,
         66592,
         4986,
         385371
      ],
      "backdrop_path": "/eLV46YNSh7CJxkKxcwkjnS7pIJB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Mrs. Forrest",
               "gender": 1,
               "credit_id": "52fe446dc3a36847f809572b",
               "name": "Shelley Winters",
               "profile_path": "/zVg966M0RVK5kycHZUEDc51QULV.jpg",
               "id": 7632,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Christopher Coombs",
               "gender": 2,
               "credit_id": "52fe446dc3a36847f809572f",
               "name": "Mark Lester",
               "profile_path": "/wIVXDIioSTuf1JE0pBF5k7Kltwo.jpg",
               "id": 25638,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Katy Coombs",
               "gender": 1,
               "credit_id": "52fe446dc3a36847f8095733",
               "name": "Chloe Franks",
               "profile_path": null,
               "id": 51729,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mr. Benton",
               "gender": 2,
               "credit_id": "52fe446dc3a36847f8095737",
               "name": "Ralph Richardson",
               "profile_path": "/p9FyikB1ShTtq1cpMgkkhUrI9Bp.jpg",
               "id": 12689,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "The Pigman",
               "gender": 2,
               "credit_id": "52fe446dc3a36847f809573b",
               "name": "Hugh Griffith",
               "profile_path": "/qIFbwovMcEd9dMGCRB0x2RRr3m7.jpg",
               "id": 10021,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Insp. Willoughby",
               "gender": 0,
               "credit_id": "52fe446dc3a36847f8095763",
               "name": "Lionel Jeffries",
               "profile_path": "/z9S89Tq1cG9jPFTujD44b8fumVH.jpg",
               "id": 30706,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Dr. Mason",
               "gender": 1,
               "credit_id": "57ef1f68c3a36876770019d6",
               "name": "Pat Heywood",
               "profile_path": "/v3JSx1mhf5MeSuCMTH8D7IChHFv.jpg",
               "id": 47138,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Miss Henley",
               "gender": 1,
               "credit_id": "57ef1f7ec3a368766d001e38",
               "name": "Rosalie Crutchley",
               "profile_path": "/3GeycPOd4LHV1tSaRErb8tHT67q.jpg",
               "id": 39001,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Albie",
               "gender": 2,
               "credit_id": "57ef1f8dc3a368767a001b76",
               "name": "Michael Gothard",
               "profile_path": "/rr5aL6UHeoPlAECSavzN6XEMlZT.jpg",
               "id": 10505,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Clarine",
               "gender": 1,
               "credit_id": "59c997e5c3a36803c7000316",
               "name": "Judy Cornwell",
               "profile_path": "/yVk9V25HwSgnOpfwFam6bMgf0VW.jpg",
               "id": 45455,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Miss Wilcox",
               "gender": 1,
               "credit_id": "59c997efc3a36803c700032b",
               "name": "Marianne Stone",
               "profile_path": "/5jFJji3UamXNvDU3it1YeG1V7Zc.jpg",
               "id": 106628,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f8095715",
               "name": "Curtis Harrington",
               "profile_path": "/eb8N9YuAP4BT12Pa7X1IwGMpkHB.jpg",
               "id": 44725,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f809571b",
               "name": "Robert Blees",
               "profile_path": null,
               "id": 51727,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f8095721",
               "name": "Jimmy Sangster",
               "profile_path": null,
               "id": 30700,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe446dc3a36847f8095727",
               "name": "Gavin Lambert",
               "profile_path": null,
               "id": 51728,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f8095741",
               "name": "Samuel Z. Arkoff",
               "profile_path": null,
               "id": 30904,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f8095747",
               "name": "James H. Nicholson",
               "profile_path": null,
               "id": 51730,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f809574d",
               "name": "Jimmy Sangster",
               "profile_path": null,
               "id": 30700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446dc3a36847f8095753",
               "name": "Kenneth V. Jones",
               "profile_path": null,
               "id": 31291,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446dc3a36847f8095759",
               "name": "Desmond Dickinson",
               "profile_path": null,
               "id": 30932,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe446dc3a36847f809575f",
               "name": "Tristam Cones",
               "profile_path": null,
               "id": 43796,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe446dc3a36847f8095769",
               "name": "Sally Nicholl",
               "profile_path": null,
               "id": 7755,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.848983,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 6976,
      "vote_count": 12,
      "budget": 0,
      "overview": "A demented widow lures unsuspecting children into her mansion in a bizarre \"Hansel and Gretel\" twist.",
      "similar": [
         60304,
         22033,
         675,
         9100,
         671,
         672,
         767,
         2667,
         11906,
         16859,
         129,
         76492,
         37430,
         27022,
         674,
         290595,
         159824,
         673,
         68728,
         75656
      ],
      "original_title": "Whoever Slew Auntie Roo?",
      "runtime": 91,
      "poster_path": "/aT1ZUwSSO9rB6bMIxtbKQIZYLNv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hemdale",
            "id": 16593,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "American International Productions",
            "id": 14149,
            "origin_country": ""
         }
      ],
      "release_date": "1971-10-31",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "She's Taking A STAB At Motherhood!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Curtis Harrington"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "David D. Osborn",
         "Robert Blees"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067983/",
      "coverLink": null,
      "actors": [
         "Shelley Winters",
         "Mark Lester",
         "Chloe Franks"
      ],
      "reviews": [
         "Who Slew Auntie Roo is still one of the most cleverly constructed films of the 70s. An interesting and fascinating take on the Hansel and Gretel story. Mrs. Forrest (Shelley Winters) is a rich widow who had been married to a successful British Magician. He died leaving her his fortune and creepy mansion called \"Forrest Grange\" Their little 7 year old daughter Katherine died after falling off a banister that she was sliding down. The film opens with Auntie Roo as she is called by the orphans singing a lullabye to what appears to be a child in a cradle. Auntie Roo quietly steals out after we think the child is asleep. The camera slowly pans to the cradle only to reveal a rotted corpse of a child in a nightgown. This sets the scenario for the film. Auntie Roo is obviously an eccentric. She has constant seances in an attempt to communicate with her dead daughter. Of course her psychic is in cahoots with the servants who stage the seances. It is now time for Aunt Roo's annual Christmas Party where 10 lucky children from the local orphanage are selected to attend an overnight holiday party at Forrest Grange. Christopher and Katy Coombs, a brother and sister are not selected, but stow away in the back of the car. Auntie Roo sees a resemblance in Katy to her dead daughter Katherine...and of course the movie takes off from here. The children see Auntie Roo as the witch in Hansel and Gretel...and Forrest Grange is the Gingerbread House. I won't give away any more of the plot, but the psychological games between the children and Auntie Roo as their terror mounts makes for an extremely entertaining film. Aside from Shelley Winter's bravura performance, there are also strong contributions from Sir Ralph Richardson as her psychic; Rosemary Crutchley as the director of the orphanage, Mark Lester (of Oliver fame) as Christopher. The art and set direction are marvelous along with excellent camera work and lighting. This film makes for a different and offbeat Christmas movie or just a plain \"fun\" movie to watch anytime!",
         "A great horror movie to watch at Christmas time. It has a creepy old mansion, great child actors. The plot centers around the disappearance of a child years before and some orphans who just happen to end up at the same mansion years later. Shelley Winters is great in this movie. It's really got a classic old british feel to this movie. Definitely a horror holiday classic, creepy, scary and fun to watch.",
         "Probably Shelley Winters' greatest Movie - though I suspect many would disagree. Many viewers delight in name-calling 'Aunt Roo' as 'nuts' 'crazy' 'evil' etc., but many fail to see the sad and pathetic side to this unfortunate character. Aunt Roo (played marvellously by the wonderful Shelley Winters) is clearly traumatised by the tragic death of her only child. Left widowed in an isolated mansion to live all by herself, she is taken advantage of, and her 'damaged' mind from the trauma of her loss is cruelly and sadistically abused by her staff who pretend to be her dead daughter come back during false seances. Many viewers ignore her staff who bleed her white. Despite showing loads of kindnesses to orphaned children, she is further still abused by two of the most ungrateful among them. Consequently, 'Aunt Roo' transforms from just being traumatised to mentally disturbed, and the tragic end to the movie ensues. I guess this story just goes to prove how cruel society and people can be to traumatised people without trying to understand them, just because they are adults. If the roles of this film were reversed, everyone's sympathy would still lie with the children... Shelley Winters' performance still brings tears to my eyes when she cries and yearns for her dead child, only to find out she's been made a fool of - enough to drive anyone insane! A fabulous Movie, and a fabulous story. It's often likened to Hansel And Gretel, but I think it's far more complicated than that - poor 'Aunt Roo'!",
         "Shelley Winters' character is sad, pathetic, scary, and warped in this movie...and she plays it to the hilt. A broad take-off on the old \"Hansel and Gretel\" fairytale, this movie is pure 70's. If you like your horror films without a lot of gore and with a lot of suspense, see \"Who Slew Auntie Roo?\" It's worth your time.",
         "This is a well-acted, but thinly plotted addition to the BABY JANE/CHARLOTTE cycle, with Shelley Winters giving an appropriately over-the-top performance as the lonely, crazed woman who lures unsuspecting young children into her creepy old house. Made by horror practitioner Curtis Harrington in England after directing Winters earlier that year in the superb Gothic thriller WHAT'S THE MATTER WITH HELEN?, this film is a bit of a letdown in comparison. However, as is usually the case with Harrington, he milks the threadbare material for all it's worth and manages to create a rich, striking, really quite memorable picture that almost ranks as his best ever. Desmond Dickinson's beautiful cinematography is also a nice touch. The film is intended to be a travesty of sorts of the gruesome HANSEL AND GRETEL tale. Though Shelley's campy performance in the title role is the film's main attraction, the movie boasts an equally impressive supporting cast that includes Ralph Richardson as a phony psychic, Hugh Griffith as an eccentric butcher, and Mark Lester and Chloe Franks as the terrorized young children.",
         "I love Shelley Winters in this film as the demented Auntie Roo, the widow of a British magician. In this film, she plays a haunted troubled woman whose daughter died in a terrible accident. She wants to be a mother again and finds herself drawn to a girl who resembles her own late daughter. There are lot of interesting scenes and Shelley Winters is a scream in this film with her part. You feel sorry for her but despise what she's doing to Katy and Christopher, young British orphans, who end up being Hansel and Gretel in this story. The ending was kind of disturbing and the kids reminded me more of the boy in the Omen film at times. It's a first rate cast with Shelley Winters, Ralph Richardson, Judy Cornwell, and Marianne Stone just to name a few well known British actors in the cast. I would like to see it again especially since I missed the beginning portion of it. I found it terribly entertaining even a good Halloween movie to show.",
         "Mischievous Christopher (the terrific Mark Lester of \"Oliver!\" and \"Eyewitness\" fame) and his sweet little sister Katy (adorable blonde sprite Chloe Franks, who played the daughters of Christopher Lee in \"The House That Dripped Blood\" and Joan Collins in \"Tales from the Crypt\") are a couple of orphans living in Great Britian in the 1920's. Christopher convinces Katy that loopy recluse Rosie \"Auntie Roo\" Forrest (Shelley Winters chewing the scenery with her trademark four-sheets-to-the-wind hambone panache), a former music hall singer who once a year invites a bunch of kids to her huge, crumbling mansion for Christmas diner, is really a witch who plans to fatten Katy up and eat her. Director Curtis Harrington, adapting a fiendishly clever script co-written by veteran Hammer horror film scribe Jimmy (\"The Curse of Frankenstein,\" \"The Horror of Dracula\") Sangster, whips up a delightfully twisted and darkly amusing Gothic black comedy version of \"Hansel and Gretel.\" The first-rate cast have a ball with their juicy parts: Ralph Richardson as an eccentric charlatan medium, Michael Gothard (the crazed killer in \"Scream and Scream Again\") as a mean butler, Lionel Jeffries as a friendly, hearty police inspector, Hugh Griffiths as a jolly butcher, and Marianne Stone as a strict orphanage supervisor. Desmond Dickinson's polished cinematography, Kenneth J. Jones' spooky orchestral score, and the marvelously macabre conclusion are all solid and satisfying as well. Good, ghoulish fun.",
         "From the opening scene, it is obvious that Rosie Forrest (aka Auntie Roo) is completely insane. She lives alone in a magnificent mansion in 1920s England and will never get over the death of her young daughter. In an attempt to fill this void, Auntie Roo has an annual Christmas party for a few of the best behaved children from the local orphanage. This year, a misbehaving brother and sister stowaway in the trunk of the car and join the party. Auntie Roo starts to believe the girl is her daughter, while the boy is convinced Auntie Roo is a witch. Mayhem ensues. This is a clever, creepy, and amusing subversion of the \"Hansel and Gretel\" fairytale that puts forth the notion that the wicked witch might not be inherently evil or even malintentioned--just severely insane! Some of the scares are cheesy, a few of the child actors are awful (the lead girl looks and acts like she was sniffing glue during the entire production!), and it is a bit disconcerting to sit through yet another movie where Shelley Winters sings and dances like a freak. But overall, this is an underrated sick little fairytale. My Rating: 7/10",
         "I had the fortunate circumstance to see this double-billed as a very young child with Bava'a Baron Blood. Some of the scenes remained in my mind - particularly the creepy figure of Shelley Winters. I recently set out to see the film again some 30 years later. I remembered more than I thought I had, and the film came back to me in large part. This is not a bad film nor a good film. As another reviewer noted, it is a pleasant, harmless time-waster - for those of us who enjoy \"wasting\" time on such things. Mark Lester and Chloe Franks play two orphans at an orphanage. Franks has an uncanny resemblance to the dead daughter of the orphanage's greatest patroness and benefactress, Shelley Winters. Winters is so good to the kiddies that every year she invites them to her sumptuous home at Christmas for yuletide fun. She has virtually no interest in Lester but soon has the keenest of hearts for the young Franks as her dead daughter's look-a-like. Well, Lester is a growing teen rebelling, Winters decays into some form of madness, a cast of stalwart British character actors such as Sir Ralph Richardson, Hugh Griffith, and Lionel Jeffries ably aid the story, and that story degenerates/diffuses into some sinister tale not unlike Hansel and Gretel. Well, the movie has a poor story overall - but Winter's fine performance albeit over-the-top to be sure does add emotional depth to it. Director Curtis Harrington is very able behind the camera if not dazzling.",
         "An entry in that precious genre of late 60s/early 70s horror pyschodramas, Who Slew Auntie Rue? is slightly unusual in that it boasts a period setting(rural England in the early 1920s)and an Old Dark House atmosphere(something that is due for a revival in the horror genre). Shelley Winters stars as the aforementioned Auntie Rue, a seemingly-kindly retired American dancehall girl who is the widow of an English magician. Rue hosts a Christmas party and dinner for the local orphanage. Unbeknown to the locals, Rue harbors a terrible secret: she has gone insane with grief over the death of her daughter, and holds seances to contact her spirit. One of the children at the party, a little girl, reminds Rue of her daughter and the woman believes the child is the reincarnation of her. Rue kidnaps the child, and her brother, played by Mark Lester of \"Oliver\" fame, attempts to rescue her and is also held hostage, forced to wait on Auntie Rue and perform chores. There is a shocking ending, giving a disturbing insight into the children's(especially the brother's)pyschological states . .. This is from American International, a studio that seems to have cornered the market on such films. Shelley Winters hams it up as the wacko Auntie Rue, flitting up and down the halls and secret passages of her mansion in diaphanous black morning garb, gesticulating like a diva in an Wagnerian opera. There are so many elements recycled from other movies(Pyscho, The Old Dark House)that it's hardly original, but interesting for the period setting and Winter's near campy performance(shrill, neurotic characters seeming to have become her stock in trade at this point in her career). Mark Lester previously starred in another chilling film, \"Our Mother's House\", about a group of English children living in an dark Victorian house who band together to hide their invalid mother's death from the world, hold seances to confer with their dead mother's spirit, and confront their absentee father who appears unexpectedly and makes some cruel revelations about their supposedly saintly late mother. Not a bad film, but a little on the campy side due to Winter's performance. Interesting study of the children and their perception of a nightmarish situation. Give it a looksee if you come across it on TV or in the Video shop.",
         "Former stage star Auntie Roo (Shelley Winters) is the love of orphans in town come Christmas time as she invites ten lucky kids to come spend the night at her countryside estate on Christmas Eve. Two kids, Chris (Mark Lester) and Katy (Chloe Franks) Combs, who didn't make the cut sneak along to the mansion and soon their host is infatuated with Katy because she reminds her of her own missing daughter, who she has been trying to contact through séances. I'm still getting my Curtis Harrington freak on apparently as I watched this horror-thriller for the first time last night and found it to be fantastic. Reuniting after the equally great WHAT'S THE MATTER WITH HELEN (1971), director Harrington and lead Winters sure have the hysterics down in the story that draws its inspiration from Hanzel & Gretel. One of the more surprising things is both of the kid leads are also really good as well and you'll thank yourself for watching OLIVER himself get into a brawl with Winters. The rest of the cast - Ralph Richardson as a psychic, Lionel Jeffries as a policeman, Michael Gothard as the creepy butler - are fantastic too. The film has tons of Xmas spirit and, best of all, Harrington knows how to properly convey that old dark house feel perfectly. Definitely recommended if you haven't seen it.",
         "The first part is as delightful as the cakes,the sweets ,the lollipops and the gingerbread men which the good lady serves to the orphans she welcomes for her Christmas party in her Gothic desirable mansion.This mysterious woman,with a racy past ,was married to a magician (remarkable scene when the two children venture into the old house full of magic props where once more,we are told that children are not necessarily devoid of cruelty. After a seance in the dark with a charlatan medium,Roo (Winters)is quite sure that one of the orphans is her late daughter ,who rose from the dead. She wants to keep her in her house but her brother (Mark \"Oliver\" Lester ) is not prepared to accept it.He tells his sister about Grimm's sinister fairytale \"Hansel und Gretel\" in the gingerbread house. The first hour is brilliant:the Christmas atmosphere is perfectly captured.The crepuscular quality of the film is tangible .Few other films of the seventies offer so many associations of guarded privacy and locked rooms,in such dreamlike darkness.Shelley Winters is outstanding particularly in that short scene when she goes from tears to a good laugh. The film obviously loses steam in the last thirty minutes.Winters begins to overact to make up for the poor third of the script which is at once repetitive ,dull and predictable.We do not need Lester's voice over to understand that the children are Hansel and Gretel in the witch's den..As Freud and Bruno Bettelheim showed,fairy tales have an hidden meaning which the children unconsciously comprehend but the demonstration is pretty low brow. Watch it anyway:its incredible several moments make it all worthwhile. Like this?Try these.... \"Les amants criminels\" François Ozon 1996 \"The night of the hunter\" Charles Laughton 1955 \"The nanny\" Holt 1965 \"Bunny Lake is missing\" Otto Preminger 1965",
         "Auntie Roo is crazy. The opening scenes leave little to the imagination as to her mental state. The movie begins with Auntie Roo singing a lullaby to a little girl. As she finishes her song, the camera goes to a close-up of the child sleeping in bed. But there is no child. Only the mummified remains of what was once Auntie Roo's daughter. Before I saw the movie, I had thought and hoped that with Shelly Winters playing the crazy Auntie Roo the movie would be a fun watch. But it doesn't live up to its potential. My biggest problem with Whoever Slew Auntie Roo? is that it never goes far enough in showing how mad Auntie Roo is. It's as if Auntie Roo's madness is allowed to reach a certain point and the director pulls it back in. That's not to say there aren't some moments of fun to be had watching the crazy Auntie Roo racing around the house in her morning clothes, complete with black veil. But there aren't enough of these moments. The only thing that might have saved Whoever Slew Auntie Roo? would have been to allow things to go over the top and into the realm of camp and absurdity. As it is, it's all too tame and rather dull. Another thing that might have helped the movie would have been to reveal just how insane Auntie Roo is later in the movie. Unfortunately, we see Auntie Roo at her most batty right from the beginning. Once you've seen Auntie Roo put the mummified body of her child to bed, you aren't really shocked at some of the other things she's capable of. Saving the revelation to end would have created the opportunity for more surprises and tension throughout the movie.",
         "Apparently 1971 was a heck of a year for Shelley Winters. She made \"What's The Matter With Helen?\" and \"Whoever Slew Auntie Roo?\"--two movies where she played characters that were a crayons short of a full box (in other words, she was bonkers). Both are on a single DVD and are a lot of kitschy fun. The film starts with Winters telling her daughter a bedtime story and the scene is quite charming...until the camera pulls back and you see that the child is dead and has been there for a very, very long time! Creepy. You soon see that Winters is indeed daffy and a psychic (Ralph Richardson) comes to the house and they have a séance--Winters is desperately trying to dead daughter. A bit later, a group of orphans are invited to this weird lady's home. Apparently, each Christmas she invites a group of lucky kids to her mansion and showers them with love and presents and food. It looks wonderful. However, you know that Winters is imbalanced--though she acts more like some sort of angel. Two orphans sneak into the carriage with the rest and want to be part of the fun. The nasty lady from the orphanage is appalled (these kids are \"bad\" in her nasty mind) but Winters insists that they, too, should stay. These two particular kids just happen to be in the wrong place at the right time. The oldest (Mark Lester--who STILL looks like he needs a haircut following his role in \"Oliver!\") is quite inquisitive and searches throughout the house finding all kinds of creepy props from Winters' deceased husband (a magician) as well as a secret room--Winters' dead daughter's room (though fortunately the corpse is now hidden). As for the little girl, she has the same name as the dead daughter and reminds Winters of her lost child. So, in a move that Lester thinks is akin to the witch in \"Hansel & Gretel\", Winters steals the little girl and hides her in the hidden room. Why she didn't just adopt the kid, I have no idea. Regardless, Lester returns to the home to find his sister. What's in store for the kids? Is this crazy old lady going to eat them or do them other bodily harm? Or is she just a crazy but harmless lady who is trying to replace her lost child? Will she love them or eat them? Tune in a find out where all this goes in this creepy and atmospheric tale. There is a lot to like in this film. First, the atmosphere is super-creepy. Second, and this is my favorite part, you never are really sure about Winters--is she crazy but harmless and a bit sad or is she a dangerous psycho? This isn't real clear--and makes for a really, really unique viewing experience. Third, the ending is mega-creepy and will make your skin crawl a bit! Overall, an exciting low-brow bit of entertainment that horror fans should adore.",
         "Well, the title sounds intriguing, and \"Hansel and Gretel\" has always been one of my very favorite fairy tales, but this is a slow-moving, lackluster thriller, with only a few suspenseful scenes (one of those, however, with a kid trying to reach a key before Shelley Winters returns to the room, is perfectly executed). Aside from Winters' over-the-top acting, all the other performances - including the kids - are very good. (**)",
         "Shelley Winters plays the heartbroken and distraught widow Mrs. Forrest (Auntie Roo to all the kiddies), who also lost her daughter in an unfortunate accident. I haven't watched very many of her films, but so far this is my favorite and she plays the role of Auntie Roo very well. We see her kind and caring side, who loves children and gives graciously to many of the local orphans during Christmas when she invites them to her mansion for fun, food, candy, presents and a sleepover. But, Auntie Roo also has a dark side and it slowly begins to take over. It seems as though Auntie Roo doesn't want to let go of her loved ones. And reminiscent of Hansel and Gretel, Auntie Roo seems to also have an appetite for children, which turns out to be very bad for an orphaned brother and sister. They are held captive and fattened up as Auntie Roo prepares what may very well be their last meal... 7 out of 10",
         "Rosie Forrest(Shelley Winters), as the film presents in the opening singing to her daughter who is a rotted corpse, is pretty mad you could say. The mansion she lives in was obviously constructed at her late magician husband's command since the daughter's room is so well hidden within secret passageways, if(..and when)the police were to search for someone(or two, to be precise)it's nearly impossible unless you know the right button to push and the specific door to enter. We are presented with two orphans, Christopher and Katy(Mark Lester and Chloe Franks)notorious for their constant attempts at running away and misbehaving(they give their \"den-mother\" the silent treatment out of protest for having to return to the orphanage). 10 children, the kindest of the orphanage, are selected to spend Christmas with Rosie, and Christopher & Katy are NOT on that list. Yet, they take it upon themselves to hide in the luggage cart of the carriage anyway and are invited into the bosom of Rosie. Rosie often sees a corrupt con-artist, Mr. Benton(Ralph Richardson)who pretends to be a medium who can contact her late daughter Katherine. A child's voice claiming to be Katherine is actually the maid conspiring with the butler scamming cash from Rosie when Benton separates their cut. Albie(Michael Gothard)presents himself quite the loyal butler attending to Rosie's every need until that right moment when he can get a big payday through some sort of blackmail. Albie knows Rosie is bonkers and buys his time. That time may've arrived in the luggage cart for Christopher believes Rosie is a witch and that he and Katy are to be stuffed in an oven and eaten when she's gets a chance(Christopher compares their situation to the dark fairy tale, Hansel and Gretel..an aspect the film tries in every way to exploit throughout even using Christopher's narration parlaying excerpts from the story). What does happen is that Rosie sees Katherine in Katy and really wishes for her to stay..without Christopher who becomes Rosie's arch nemesis. Both scheme against one another as Christopher finds the room where the dead daughter is locked away and sees Rosie singing to her. The final thirty or so minutes is Christopher trying to rescue Katy(..and himself)from the clutches of Rosie who keeps the entire house locked away. Katy is kept locked away in Katherine's old room while Rosie forces Christopher to assist her in everyday chores once Albie and the maid exit the premises with a nice fat check through blackmail(Albie threatens to expose Katy's whereabouts when Rosie informs the orphanage that she must've disappeared). The ending is quite twisted..if you have an understanding of the dark fairy tale mentioned throughout, then you might have an inkling what I'm talking about. I'll be honest, this is really a sick little number. It exploits a mentally woman for comedy using the death of a daughter as the catalyst. It also is quite disturbing as a misunderstanding through the paranoid mind of a boy leads to a horrible tragedy. Even more so twisted is that Christopher understands where Rosie keeps her expensive jewelry and steals it, burying them in a hole within this teddy bear Katy insists on getting(it was Katherine's). If you want me to tell the truth the boy protagonist isn't the kindest, most pleasant kid in the world..anything but. He's just a smaller version of Albie. But, poor Rosie is used by everyone in the film. Everyone preys on her mental weaknesses. The really crazy part is this film plays Rosie's madness for snickers. I think this film works best for those with a macabre sense of humor. Not for all tastes, that's for sure.",
         "Extremely mild British thriller from AIP has Shelley Winters camping it up as loony woman mourning her dead daughter, convinced a little orphan girl is her deceased child come back to life. Revision of \"Hansel and Gretel\" has some suspense and sharp editing, a good production, and a satisfying wrap-up. Winters is a dandy villainess, going from sugary sweetness to angry paranoia in record time, and the children are decent thespians. But, let's face it, this still isn't respectable work, following the tail-end of the \"Baby Jane\" cycle. Often referred to as \"Who Slew Auntie Roo?\", pic is forgettable under either title. Directed in workman-like fashion by Curtis Harrington, who also helmed Winters' \"What's the Matter With Helen?\" the same year. *1/2 from ****",
         "Shelley Winters stars as widower Mrs. Forrest, who, having lost her daughter Katherine in an accident, now enjoys the company of children from the local orphanage, throwing a party for the best behaved kids at her house each Christmas. When Christopher Coombs (Mark Lester) and his younger sister Katy (Chloe Franks) crash the party, Mrs. Forrest takes a particular liking to the little girl, who reminds her of her own dear departed daughter. Her feelings towards Katy quickly become an obsession and she schemes to keep the girl as her own, although Christopher, convinced that the woman is a witch, is determined to rescue his sibling no matter what. Whoever Slew Auntie Roo? is quite the oddity, drawing inspiration from the fairy tale Hansel and Gretel, with Mrs. Forrest tempting the kids with sugary treats to fatten them up, and preparing a roaring oven in the kitchen, which Christopher believes is intended for both he and his sister. Adding to the twisted atmosphere is the dessicated corpse of little Katherine that her progressively loopy mother keeps hidden in a secret room. All of this had bags of potential to be a thoroughly demented classic of macabre cinema, but the rather restrained execution prevents it from being so. Winters tries her best, hamming it up as much as possible in every scene, but even her best efforts fail to make this the ghoulish treat it could so easily have been. For a far more effective off-beat approach to the Hansel and Gretel story, watch Freeway II: Confessions of a Trickbaby. Now that is seriously messed up!",
         "A demented widow (Shelley Winters) lures unsuspecting children into her mansion in a bizarre \"Hansel and Gretel\" twist. I am not a big fan of Shelley Winters. Frankly, I don't really understand how she became anybody. But I do love AIP, and I absolutely adore both Jimmy Sangster and Curtis Harrington (whose \"Night Tide\" is a true horror gem). These gentlemen have brought the Hammer touch to AIP, making this film both British (in a good way), but still that same cult AIP style we love. And even better is the \"Hansel and Gretel\" idea. Some legends and fairy tales have been done to death, but this one has not. And furthermore, it puts children in the danger zone -- the scene of this film with the guillotine had me on the edge of my seat wondering if they had the guts to go all the way.",
         "\"Auntie Roo\" is marketed a a \"crazy old dame\" movie, but it's very confusing in it's intentions. Here we have Shelley Winters playing a batty old lady with a large mansion, who likes to invite children across for parties to ease her loneliness. Unfortunately two of the children get a bit nosey and Auntie Roo's dark secrets come tumbling out. What's wrong here is that the plot doesn't really give the viewer any clearly defined direction. The film uses the Hansel and Gretel fable as a parallel, and the constant reference to this subject matter does get a bit silly. Auntie Roo is not the witch that the children think she is, in fact the children terrorise her more than she does them. Maybe that was the twist that they were going for but I don't know if the story is supposed to paint the poor, misguided Roo as the villain, or the annoying children. It's all over the place. Who are you supposed to like? Nobody? Shelley Winters does a good job of acting here, but sadly the two children (Mark Lester and Chloe Franks) do not. I can't imagine anyone coming away at the end of this film feeling satisfied.",
         "Curtis Harrington had just directed Shelley Winters in the sinister \"What's the Matter with Helen?\", and so he brought her back for the equally sinister \"Whoever Slew Auntie Roo?\". Unlike the first movie, this one doesn't look at moral gray areas. Instead it goes straight for the jugular, riffing on Hansel and Gretel with Winters in the role of the witch (who in this case is simply a disturbed woman keeping her late daughter's skeleton preserved). It's a pretty fun movie, corny though it is. Easily better than the other movie in which Winters starred that year (the obnoxious \"Poseidon Adventure\"). So yes, can you hear your daughter's voice?",
         "No doubt that Shelley Winters assumed the title role in Whoever Slew Auntie Roo for a chance to really chew the scenery. That's what's great about films like Whoever Slew Auntie Roo, you can overact to the max and no one will criticize you. By all appearances Shelley is a kindly old widow, an American transplanted to the United Kingdom of the Roaring Twenties and she opens her house once a year to a select group of children from a nearby school. In reality all I can say is she's a woman with issues. She lost her own daughter in a tragic accident and tries to communicate with her through a medium played deliciously by Ralph Richardson. Mark Lester and Chloe Franks are a pair of misbehaving kids from the school who are brother and sister. They don't get invited to Shelley's place but stowaway in the trunk of the car that brings the others. That's when Shelley fixates on young Chloe who reminds her of her daughter. She kidnaps Chloe and Lester takes it upon himself to rescue her. The story is a loosely told tongue and cheek version of the Grimm brothers Hansel And Gretel so if you remember the tale from your childhood, you've got some approximate idea of what happens to Winters. Lester turns out to be quite the resourceful kid. Also take note of Lionel Jeffries as the local police inspector and Hugh Griffith as the local butcher who wants payment for services owed and won't take no for an answer from Winters. There's also a bit of similarity with American Gothic classic Night Of The Hunter in how the kids outwit Winters the way they outwitted Robert Mitchum in that film. Fans of Shelley Winters should enjoy this.",
         "Shelley Winters stars in this combination of modern, macabre film making, along with fairytale interpretation, Whoever Slew Auntie Roo? focuses on the seemingly giving widow, Mrs Forrest (Winters), who offers food, shelter and presents to local orphans at Christmas time. The film wastes no time in showing the darkness, and weird psychosis of this lonely woman. In the opening scene she takes the decaying body of a child (later shown to be her dead daughter), out of a cot in a secret room in the house. This instantly gives the film it's post-Psycho familial tragedy. This is often more disturbing as we never really know exactly what happened to the child. It is seen briefly in a scene involving a fall from a bannister, but there always seems to be the spectre of something more sinister. After siblings, Christopher and Katy Coombs (Mark Lester - you know, that posh titular \"orphan\" of the Oliver! (1969) musical - and Chloe Franks), secretly enter the mansion, and a relationship between the girl and Mrs Forrest ensues that develops into a strange obsession, that leads to Winters connecting Katy with her dead daughter. This is where the film falls into fairytale territory, using the Hansel and Gretel narrative, the children are trapped in the house and either she is, or the children believe that she will cook them. It's certainly not the best of it's kind, but then again, it's not the worst. Winters does however, have some of the best/worst \"crazy-eyes\" in cinema history. In one scene she violently takes a bite of an apple, her eyes rolling around, wild, frantically. The film does also boast some good, but small performances from the great Ralph Richardson and Lionel Jeffries, but as with Oliver!, I still have great inability to believe that Mark Lester would ever have been orphaned or poor - he is just too well-spoken. www.the-wrath-of-blog.blogspot.com"
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "American International Productions",
         "Hemdale"
      ],
      "summaries": [
         "This is a retelling of the old tale of Hansel and Gretel, but set in England in the 1920s. To the children and staff at the orphanage, Auntie Roo is a kindly American widow who gives them a lavish Christmas party each year in her mansion, Forrest Grange. In reality, she is a severely disturbed woman, who keeps the mummified remains of her little daughter in a nursery in the attic. One Christmas, her eye falls upon a little girl who reminds her of her daughter and she imprisons her in her attic. Nobody believes her brother, Christopher, when he tells them what has happened, so he goes to rescue her.",
         "A demented widow lures unsuspecting children into her mansion in a bizarre \"Hansel and Gretel\" twist."
      ],
      "budget": 0
   },
   "movielensId": 124160,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-10-31",
      "dvdReleaseDate": null,
      "directors": ["Curtis Harrington"],
      "runtime": 91,
      "movieId": 124160,
      "title": "Whoever Slew Auntie Roo?",
      "mpaa": "",
      "actors": [
         "Shelley Winters",
         "Mark Lester",
         "Chloe Franks",
         "Ralph Richardson",
         "Hugh Griffith",
         "Lionel Jeffries",
         "Pat Heywood",
         "Rosalie Crutchley",
         "Michael Gothard",
         "Judy Cornwell",
         "Marianne Stone"
      ],
      "imdbMovieId": "0067983",
      "originalTitle": "Whoever Slew Auntie Roo?",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["HvLdTFQ9RGU"],
      "plotSummary": "A demented widow lures unsuspecting children into her mansion in a bizarre \"Hansel and Gretel\" twist.",
      "tmdbMovieId": 6976,
      "avgRating": 2.33333,
      "releaseYear": "1971",
      "numRatings": 3,
      "posterPath": "/aT1ZUwSSO9rB6bMIxtbKQIZYLNv.jpg"
   }
}