{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "pregnant girl",
            "id": 186947
         }
      ],
      "imdb_id": "tt0039486",
      "video": false,
      "title": "If Winter Comes",
      "recommendations": [],
      "backdrop_path": "/mTI4NXzqVLmpsQNZoNGVyYWhSNe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mark Sabre",
               "gender": 2,
               "credit_id": "52fe4bb69251416c7510b9e1",
               "name": "Walter Pidgeon",
               "profile_path": "/OLUiYHE3wQ5vLswr59RNi1qU5I.jpg",
               "id": 12308,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nona Tybar",
               "gender": 1,
               "credit_id": "52fe4bb69251416c7510b9e5",
               "name": "Deborah Kerr",
               "profile_path": "/snyKI73NycIaXjU4GyxDq92ZRo5.jpg",
               "id": 20141,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mabel Sabre",
               "gender": 1,
               "credit_id": "52fe4bb69251416c7510b9e9",
               "name": "Angela Lansbury",
               "profile_path": "/nMy8sPPLf8fjSglFLP3IzIGbjly.jpg",
               "id": 14730,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Natalie Bagshaw",
               "gender": 1,
               "credit_id": "52fe4bb69251416c7510b9ed",
               "name": "Binnie Barnes",
               "profile_path": "/xdiLC7ICCk6LgzKuHQbQ2FpHuBk.jpg",
               "id": 80237,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Effie Bright",
               "gender": 1,
               "credit_id": "52fe4bb69251416c7510b9f1",
               "name": "Janet Leigh",
               "profile_path": "/3FWYSCJUOuYVDPG9UoMjtqNMdyb.jpg",
               "id": 7302,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mrs. Perch",
               "gender": 1,
               "credit_id": "52fe4bb69251416c7510b9f5",
               "name": "Dame May Whitty",
               "profile_path": "/qOZnX0Lyrz6bE2CBnyHCgQeuKUf.jpg",
               "id": 14299,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Sarah 'Low Jinks'",
               "gender": 0,
               "credit_id": "52fe4bb69251416c7510b9f9",
               "name": "René Ray",
               "profile_path": "/9kspLf442hfyjg9rc4dlXJ4A6ym.jpg",
               "id": 95612,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Rebecca 'High Jinks'",
               "gender": 0,
               "credit_id": "52fe4bb69251416c7510b9fd",
               "name": "Virginia Keiley",
               "profile_path": null,
               "id": 1126706,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mr. Fortune",
               "gender": 2,
               "credit_id": "52fe4bb69251416c7510ba01",
               "name": "Reginald Owen",
               "profile_path": "/bgtpAl7ICrDyJQzjglLiVY6tlMw.jpg",
               "id": 5832,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mr. Twyning",
               "gender": 2,
               "credit_id": "52fe4bb69251416c7510ba05",
               "name": "John Abbott",
               "profile_path": "/lNF9KUxNbriSVl24rUaswangRSs.jpg",
               "id": 24826,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Mr. Bright",
               "gender": 2,
               "credit_id": "52fe4bb69251416c7510ba09",
               "name": "Rhys Williams",
               "profile_path": "/jaD2gAkx9AhNABqDobe9D23oexT.jpg",
               "id": 82835,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Tony Tyber",
               "gender": 2,
               "credit_id": "532895a49251413d730002b0",
               "name": "Hugh French",
               "profile_path": null,
               "id": 149030,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Tiny Wilson",
               "gender": 2,
               "credit_id": "532895ba9251413d80000240",
               "name": "Dennis Hoey",
               "profile_path": "/sUBhxgYoVscGPzxDxgud2OdiYVc.jpg",
               "id": 25175,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Mr. Pettigrew",
               "gender": 2,
               "credit_id": "532895cd9251413d76000244",
               "name": "Nicholas Joy",
               "profile_path": null,
               "id": 85902,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "The Coroner",
               "gender": 2,
               "credit_id": "532895e39251413d83000259",
               "name": "Halliwell Hobbes",
               "profile_path": "/nLubN58cxw9GgYnzY5IXFWqmnRz.jpg",
               "id": 29601,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Mr. Fargus",
               "gender": 0,
               "credit_id": "532895fb9251413d730002b5",
               "name": "Victor Wood",
               "profile_path": null,
               "id": 115853,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Freddie Perch",
               "gender": 0,
               "credit_id": "532897d49251413d860002be",
               "name": "Hughie Green",
               "profile_path": null,
               "id": 1231750,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Harold Twyning",
               "gender": 0,
               "credit_id": "532896369251413d80000248",
               "name": "James Wethered",
               "profile_path": null,
               "id": 1302111,
               "order": 18
            },
            {
               "cast_id": 23,
               "character": "Uncle Fouraker",
               "gender": 2,
               "credit_id": "532896669251413d8300025e",
               "name": "Owen McGiveney",
               "profile_path": null,
               "id": 164783,
               "order": 19
            },
            {
               "cast_id": 24,
               "character": "Dr. Clement Avington (uncredited)",
               "gender": 2,
               "credit_id": "532896be9251413d8300026c",
               "name": "Ian Wolfe",
               "profile_path": "/ylp7puM2Hcd0VkQvXfmD7zkP4m7.jpg",
               "id": 2782,
               "order": 20
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4bb69251416c7510ba0f",
               "name": "Victor Saville",
               "profile_path": null,
               "id": 14860,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb69251416c7510ba15",
               "name": "A.S.M. Hutchinson",
               "profile_path": null,
               "id": 1184509,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4bb69251416c7510ba1b",
               "name": "Marguerite Roberts",
               "profile_path": null,
               "id": 39760,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bb69251416c7510ba21",
               "name": "Arthur Wimperis",
               "profile_path": null,
               "id": 115849,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.729057,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 147843,
      "vote_count": 2,
      "budget": 0,
      "overview": "It's 1939 in the small English town of Penny Green and events in Poland are about to change lives. Mark Sabre, a writer of school text books, has married Mabel \"on the rebound\", after his real love Nona marries some one else. Just as war is about to break out, Nona returns home with husband Tony. Mable is sure she can hold onto Mark, though. But misunderstood good deeds on Mark's part turn life for him upside down when his relationship with a young girl starts tongues wagging. Soon, wartime casualties take their toll in Penny Green as well as on the front, as the death of fighting men affects lives back home.",
      "similar": [
         423,
         424,
         9045,
         5925,
         14574,
         637,
         228150,
         289222,
         15764,
         369885,
         11372,
         21876,
         821,
         1771,
         409,
         857,
         2253,
         203833,
         16869,
         289
      ],
      "original_title": "If Winter Comes",
      "runtime": 97,
      "poster_path": "/8jROxG2K2Qanm83DrPc0ExQgXrp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1947-12-31",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "A.S.M. Hutchinson's beloved classic of English countryside life becomes a screen masterpiece !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Victor Saville"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "A.S.M. Hutchinson",
         "Marguerite Roberts"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039486/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3OTc2NTAyMF5BMl5BanBnXkFtZTgwNzMzNzk1MDE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Walter Pidgeon, Deborah Kerr, Angela Lansbury | See full cast and crew »"],
      "reviews": [
         "An impressive array of talent was gathered for this morality story, though no one winds up being particularly well served by the film. Always reliable Pigeon plays a writer in a small English village who's been passed over for a promotion by his rather dastardly employer and another associate. He's married to an impossibly shrewy and exacting wife (Lansbury) and dreams of a lost love (Kerr), who jilted him for another man a few years prior. When Kerr shows up in town again, Lansbury's fur begins to rise, though she tries to keep her cool. However, when Pigeon befriends a rather shy and troubled girl (Leigh) who is in desperate need of help, both emotionally and physically, Lansbury loses it and leaves Pigeon, creating a domino effect of angst for virtually everyone. The scandal costs Pigeon his job and his respectability within the community while Kerr attempts to aid him. The story line sounds more interesting than it actually plays out, though there are a few decent things to recommend about the film. Pigeon, though perhaps a little old to be playing a newlywed, is solid throughout and remains likable the bulk of the time. This isn't easy considering how bull-headed and chokingly noble his character tends to be, no matter what the cost. Kerr hasn't got very much to do. She comes off as mannered and stiff at times, especially in her immaculate military ensemble. The two attempt to drum up some chemistry, and do, but not quite enough of it (the fact that she disappears for a long stretch doesn't help convey their great love to the viewer!) Lansbury (who was only 22 and wearing age makeup) thoroughly detested her role, but at least her unendingly bitchy dialogue and attitude add a small amount of much-needed spark to the proceedings. She seems to be a British \"Harriet Craig\" in some ways. Leigh, in an early role, doesn't embarrass herself as a Brit and gives a nice, tender performance. Another dose of vinegar is given to the film by Barnes as a pushy, mouthy neighbor and friend of Lanbury's. Many other terrific character actors dot the cast. Credit must also be given to the nice cinematography with its pleasant and crisp black and white contrast. The chief issue seems to be that the story is a dense and complicated one and there isn't time to really delve into the relationships and their progressions as much as one might like. There's also an ending which may please those who love to hold to their standards above all else, but which may have some viewers shaking their heads in disbelief at the idiocy of it. It's a somewhat bleak affair, with Pigeon unable to catch a break from anyone as practically the entire village becomes a lynch mob. It's worth seeing for the strong and talented cast, but isn't likely to thrill most audience members.",
         "This movie, wonderfully performed, touches some deep aspect of human life under stress. The combination of war and love affairs is not new. Neither it is the attraction between a mature man and a young girl. However, the spectators must be mislead if they follow that path. Why the movie is about trusting, at different levels: husband and wife, lovers, mature and young, at home, at work, at the pub. There is also a political involvement: the voice of the people, which has two sides. Love can be lost, honor will not. This motto is crucial.The war is an ominous backstage, never shown. Walter Pidgeon makes an extraordinary performance, the rest of the cast does not lag behind. The final scene is simply convincing: as it has to be. Appreciating it requires some insight, undoubtedly.",
         "I rate this film 3 stars - one for each good performance by three of it's stars. Walter Pidgeon is likable as Mark, a kindly gentleman who reaches out to those in need and treats everyone with equal courtesy, regardless of their social class. Angela Lansbury is convincing as his cold, snobby wife. Janet Leigh tugs the heartstrings as Effie, the pregnant girl Mark tries to help when she's cast out by her strict, religious father. Acting aside, I found the story too melodramatic, with poor pacing. For instance, there are several scenes in a row with Mark and his former flame, Nona (Deborah Kerr). Personally I would've spread them out a bit - inserted scenes with other characters inbetween to indicate more of a passage of time. The way it stands, her character development and the evolution of their relationship, suffers - and I suffered whiplash! First Nona's apologizing for the abrupt way she dumped Mark for another guy, but they plan to stay faithful to their current spouses - in fact it's not clear that she still carries a torch for Mark anyway. BAM! Now she can't stand it anymore, she's going to be selfish and throw herself at Mark. BAM! Next scene Nona's telling him they've made a mistake and giving him up. The way these events happen in quick succession, didn't help endear this character to me. We're obviously meant to see her as Mark's one true lost love, and Deborah Kerr gives a nauseatingly saintly performance. The script even contrives to give her perfectly nice husband, who adores her, a gambling problem - weakly implied by one late-night party scene - it doesn't really seem like a big deal to me, but Nona freaks out. I assume this is meant to justify her infidelity and convince us that she belongs with Mark? Nevertheless, she comes across as indecisive and incapable of true depth of feeling. Nona pretty much disappears til the end of the film (Pacing!), showing up to defend Mark when the town's turned against him. She loves him *SO* much that she burns the letter Effie wrote, which would prove his innocent involvement in that girl's tragic circumstances. Nona would rather show him that she doesn't care about the wrongful accusations made against him - that *she* will stick by him even if the rest of the world thinks badly of him. Well, isn't that nice. Nice for her martyr/saint/guilt complex. But if Nona really loved Mark, she'd be thinking more about him than herself and trying to show herself in a positive light! She'd want to restore his reputation and make all the people who believed the worst, ashamed of themselves. She'd want to prove that he's a good person. At least, I would, in her shoes. I just can't stand this character. Maybe with another actress...but I'm not impressed by Deborah Kerr. I hated the ending, and found the film dreary overall. Needed more humour - more moments like Walter Pidgeon's jokey interactions with the servants, \"High\" and \"Low\" Jinx.",
         "Despite some of the negative reviews on this site, I really enjoyed this 1947 film, which is set in England right before war is declared in Europe. Walter Pidgeon is Mark Sabre, a successful writer of children's books, who works at a prominent publishing house. He is well respected and liked in the small town of Penneygreen, where he lives. Though he is a shareholder in the company, he will never be made partner because his boss thinks that Mark's political views are too radical. In fact, he'd love it if Mark weren't even in the company. But the only way he can get rid of him is if Mark violates the morals clause in his contract. Mark married the formal, somewhat cold Mabel (Angela Lansbury) on the rebound. Now his former love, Nona (Deborah Kerr) returns to town with her husband after a long absence. Nona and Mark realize that they are still in love, but decide for the moment that they can't act on their feelings. Mark's situation is complicated by a young pregnant woman, Effie (Janet Leigh) who turns to Mark for help after her father turns her out. Mark takes the girl in, and Mabel, believing him to be the father, leaves him. A scandal erupts, and Mark's career and reputation hang in the balance. \"If Winter Comes\" is an absorbing drama with good performances. Walter Pidgeon was a solid leading man and is sympathetic and strong here as the principled Mark; as the nasty Mabel, Angela Lansbury, then only 21, is very effective. With darker hair and the way her makeup is done, Deborah Kerr continues to remind me of Maureen O'Hara in her early films. She gives a lovely performance, a good juxtaposition to Lansbury's judgmental, snobbish Mabel. As Effie, Janet Leigh justifies her discovery by Norma Shearer; she sports a good English accent and gives a heartfelt portrayal. Binnie Barnes, Dame May Witty, Reginald Owen, Hugh French, and Dennis Hoey round out the excellent supporting cast. Recommended, and not only to people who liked Mrs. Miniver.",
         "This was sort of two movies in one. It started out with Angela Lansbury as a self-centered woman who was fearful that her husband (Walter Pidgeon) would be drawn back to his old flame. Lansbury was quite good as the wife who had an interesting approach to this situation. But later, the movie turned into a story about a young woman (Janet Leigh, doing a good British accent), who turns to Pidgeon for help and inadvertently causes a host of problems for him. Deborah Kerr is also good as Pidgeon's old girlfriend, but even with the good cast, the movie overall is little more than a confused soap opera, and the ending doesn't make much sense. Not one I'd recommend, unless you're a particular fan of anybody in the cast.",
         "Perhaps a stronger director and a more powerful script could have made something of IF WINTER COMES, a handsomely produced soap opera (veddy British style, old man). WALTER PIDGEON is a writer of educational books who sees his job status disintegrating under the weight of a scandal when a young girl (JANET LEIGH) is given shelter under his roof due to his kind nature. His shrewish wife (well played by ANGELA LANSBURY) suspects he's paying too much attention to the girl and later accuses him of adultery. But this is no \"Peyton Place,\" even if the bare outlines of the story makes it seem possible that something more than this tedious film could have been made from this material. Some interesting character roles by REGINALD OWEN and JOHN ABBOT as his office colleagues bent on destroying him are good for background effect. But the story between him and DEBORAH KERR (they're ex-lovers) is weakly executed and their relationship is never clearly defined or made even somewhat believable. Handsomely photographed amid some very British looking settings, supposedly in 1939, the story never really comes to life despite the lurid implications. Pidgeon calls every male friend \"old man\" so many times, you have to wonder if this was an attempt to make sure the viewer knew this was taking place in Penny Green, England rather than the MGM lot in Culver City. JANET LEIGH, as the sad young woman who finds herself pregnant after her soldier lover goes off to war, shows promise of the bright future in store for her as an actress. DAME MAY Witty has a brief supporting role, one of the least substantial roles she ever had in an MGM film. Character development is slow for the first part of the film and the story doesn't even begin to take shape until the first hour is up. By that time it's too late to inject any life into it. \"If winter comes, can spring be far behind?\" says the poem. Not soon enough for me. Summing up: A dud that wastes a talented cast.",
         "As mentioned in another review this film admittedly appears flat in the beginning, but develops rapidly into a well-blended story about true love, charity, and the foibles of human misunderstanding and communication akin to those so eloquently portrayed in the American film 'Peyton Place.' Both films are set in small, idyllic towns as well, with this one in England, and both films show the ongoing impact of WWII loses of native sons on their respective communities. The addition of three extremely accomplished actresses in the initial flash of their stardom -- Angela Lansbury, Deborah Kerr, and Janet Leigh -- makes this film evermore an enjoyable watch.",
         "I read the book before I saw the movie. I don't think it's a book anyone reads today but it was a huge best seller back in the 1920's and it's excellent. Subsequently, there was a silent movie (1923) which was a hit. The book is set during WWI but this film updates the story to WWII, without changing much else. Which might explain why it doesn't seem to have much of a feeling for the period. I was relatively disappointed when I finally saw the film, because, though it follows the book fairly closely, it's rather coarsely done somehow and not especially well directed by Victor Saville, never a master craftsman to put it mildly. The book has a fairly overt Christian theme; it's an inspiring story of a man trying to do the right thing despite being greatly misunderstood and persecuted. The movie comes out more of a melodrama. I don't think it's told especially well, though it's still relatively enjoyable. Walter Pidgeon gives a good performance; Deborah Kerr is equally good and in fact the whole cast is filled with talented actors. But there is a heavy handed, unsubtle quality to the film.",
         "I'm a little surprised at the low rating of this film on IMDb. I would guess most of our reviewers are from the U.S., where scandal has to be really scandalous to make much of an impact. I'm from the States, too, and generally don't like British films, but once in a while one comes along that strikes me just right...and this is one of them. Of course, this isn't really a British film...it was filmed by MGM in Hollywood...but it does feel like one...with a better pace (my main complaint about older British films). Interestingly, for a while, I kept seeing Greer Garson as the perfect star in this film, only to read later that it was to be her film. But, the more I got into it, the more I could see why Garson did not make this film. The story gets a bit complicated, but suffice it to say a man (Walter Pidgeon) marries on the rebound, and his wife (Angela Lansbury) doesn't appreciate him. He is still in love with another woman (Deborah Kerr), and she is still in love with him. So, first there's that triangle. Then he insists on helping a young pregnant woman, and many in the town feel it's an illicit relationship...which it isn't. The pregnant girl realizes she is dragging him down, so she commits suicide, and he is blamed, if not legally, than morally. Which brings on a heart attack...but also the return of his first love (Kerr). Walter Pidgeon is superb here.He played his part perfectly. Angela Lansbury comes off well at first, but later in the film becomes a real b----. A logical transformation? You decide. For me it was a bit much, although it did facilitate the story line. Kerr is the opposite -- a home-wrecker in the first half of the film, but far more sympathetic later in the film. Logical...more so. Janet Leigh, as the pregnant girl is excellent, and this is a bit of a different role than what we came to expect of her later in her career. It's nice to also see Dame May Witty, though her role is quite small...though important. Reginald Owen and John Abbott are excellent in their roles as the \"bad guys\" who fire Pidgeon for moral reasons. I liked this film very much, and recommend it.",
         "The films of the 30's and 40's are known today as those of \"the Golden Age,\" and in that age, MGM stood at the forefront of creating classic entertainment. Every now and again, however, even MGM came a cropper, and with IF WINTER COMES they hit close to the bottom. I only watched this film on TCM because a friend of mine has a framed one sheet of it in his home, a sheet he puts up on December 21st of every year and takes down the following March 21st. Nice idea, nice poster. But what a dud of a film. Walter Pidgeon plays a man of principle married, on the rebound, to a shrew of a wife (Angela Lansbury). He has been thrown over for no seemingly good reason by the love of his life, Deborah Kerr. When the film begins Kerr reappears to say that she made a mistake and will always love Pidgeon. Ditto from Pidgeon. But the two ex-lovers are far too noble to leave their respective spouses, so they continue as \"friends\" as WW2 hits the British Isles. Pidgeon's bosses hate his liberal, humanistic attitude and are constantly looking for a way to get rid of him. Enter Janet Leigh, a young girl who lives with her heartless, toe-the-line, Bible reading father, (Rhys Williams). When she gets pregnant and tossed out by her Dad it is Pidgeon (of course!) who takes her in prompting Lansbury to file for divorce citing adultery. From there on it is one rung after another on the road to complete collapse for Pidgeon. Handled in a better way this might have been a good soaper, but the screenplay is sloppy, the editing choppy, the direction almost non-existent and the acting by Pidgeon, Lansbury and Kerr all stiff as a board. (Even wonderful Mae Witty, in a minuscule role, chews a bit of scenery before she is dispatched.) The best acting award, at least from where I was sitting, goes to young Janet Leigh who brought a quiet dignity and warmth to her role. Mean spirited to an astonishing degree and clunky at almost every level, I have to wonder what MGM was thinking when they chose to make the film in the first place. After seeing IF WINTER COMES I intend to find a new one sheet for my friend, maybe WINTER MEETING or WHITE Christmas, anything, in fact other than this nightmare from MGM, the dream factory."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["It's 1939 in the small English town of Penny Green and events in Poland are about to change lives. Mark Sabre, a writer of school text books, has married Mabel \"on the rebound\", after his real love Nona marries some one else. Just as war is about to break out, Nona returns home with husband Tony. Mable is sure she can hold onto Mark, though. But misunderstood good deeds on Mark's part turn life for him upside down when his relationship with a young girl starts tongues wagging. Soon, wartime casualties take their toll in Penny Green as well as on the front, as the death of fighting men affects lives back home."],
      "budget": 0
   },
   "movielensId": 124394,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-12-31",
      "dvdReleaseDate": null,
      "directors": ["Victor Saville"],
      "runtime": 97,
      "movieId": 124394,
      "title": "If Winter Comes",
      "mpaa": "",
      "actors": [
         "Walter Pidgeon",
         "Deborah Kerr",
         "Angela Lansbury",
         "Binnie Barnes",
         "Janet Leigh",
         "Dame May Whitty",
         "René Ray",
         "Virginia Keiley",
         "Reginald Owen",
         "John Abbott",
         "Rhys Williams",
         "Hugh French",
         "Dennis Hoey",
         "Nicholas Joy",
         "Halliwell Hobbes",
         "Victor Wood",
         "Hughie Green",
         "James Wethered",
         "Owen McGiveney",
         "Ian Wolfe"
      ],
      "imdbMovieId": "0039486",
      "originalTitle": "If Winter Comes",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["K3-0rdsX1yM"],
      "plotSummary": "It's 1939 in the small English town of Penny Green and events in Poland are about to change lives. Mark Sabre, a writer of school text books, has married Mabel \"on the rebound\", after his real love Nona marries some one else. Just as war is about to break out, Nona returns home with husband Tony. Mable is sure she can hold onto Mark, though. But misunderstood good deeds on Mark's part turn life for him upside down when his relationship with a young girl starts tongues wagging. Soon, wartime casualties take their toll in Penny Green as well as on the front, as the death of fighting men affects lives back home.",
      "tmdbMovieId": 147843,
      "avgRating": 4,
      "releaseYear": "1947",
      "numRatings": 1,
      "posterPath": "/8jROxG2K2Qanm83DrPc0ExQgXrp.jpg"
   }
}