{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "historical figure",
            "id": 6165
         },
         {
            "name": "sitting bull",
            "id": 161228
         }
      ],
      "imdb_id": "tt0047501",
      "video": false,
      "title": "Sitting Bull",
      "recommendations": [
         176411,
         167788,
         121713,
         121161,
         315530,
         76276,
         213668,
         131761,
         89450,
         77645,
         107427,
         148847,
         204994,
         126900,
         111420,
         198581,
         177681,
         141978,
         111942,
         18807
      ],
      "backdrop_path": "/dc4BN6od8rTpGjArfTzn2mIQ798.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Major Robert 'Bob' Parrish",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c77",
               "name": "Dale Robertson",
               "profile_path": "/tEkpTZNflIbcrrhzDENLDBHbJoV.jpg",
               "id": 39549,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Kathy Howell",
               "gender": 1,
               "credit_id": "52fe4a4fc3a36847f81c6c7b",
               "name": "Mary Murphy",
               "profile_path": "/37w712yEDUGl2mpvy8TtcbJeKPp.jpg",
               "id": 51678,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Sitting Bull",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c7f",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Gen. Wilford Howell",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c83",
               "name": "John Litel",
               "profile_path": "/kpNAy4IYFE3OXaOG60RPhkyp70d.jpg",
               "id": 16766,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c87",
               "name": "Joel Fluellen",
               "profile_path": "/r8Vno7WxBENXDzbZMCkKX290ftb.jpg",
               "id": 86370,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Crazy Horse",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c8b",
               "name": "Iron Eyes Cody",
               "profile_path": "/clpm9HMt91vJCiEl2JmfHm5GM6B.jpg",
               "id": 127032,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "President Ulysses S. Grant",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c8f",
               "name": "John Hamilton",
               "profile_path": "/aXQjVQj8QF07kvu0M71zNLEPiaI.jpg",
               "id": 14455,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Col. Custer",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c93",
               "name": "Douglas Kennedy",
               "profile_path": "/8fCM2tVhpziKRRZ2xY9WGdbBSOB.jpg",
               "id": 95734,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "O'Connor",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c97",
               "name": "William Tannen",
               "profile_path": null,
               "id": 29626,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Charles Wentworth (as Bill Hopper)",
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c9b",
               "name": "William Hopper",
               "profile_path": "/lv9KfbxJP01uSlw7ZnjzHP9aT1b.jpg",
               "id": 2776,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Indian Agent Webber (as Tom Brown Henry)",
               "gender": 0,
               "credit_id": "52fe4a4fc3a36847f81c6c9f",
               "name": "Thomas Browne Henry",
               "profile_path": "/2TVfKY4IcY9C7J8kXx3bCdCUVLX.jpg",
               "id": 82748,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c61",
               "name": "Sidney Salkow",
               "profile_path": "/fWUNePRsd1STYmjuucTvjK0xcqz.jpg",
               "id": 91789,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a4fc3a36847f81c6c67",
               "name": "Jack DeWitt",
               "profile_path": null,
               "id": 111485,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a4fc3a36847f81c6c6d",
               "name": "W.R. Frank",
               "profile_path": null,
               "id": 120547,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a4fc3a36847f81c6c73",
               "name": "Raoul Kraushaar",
               "profile_path": "/uiweWC64wQfdKQ0JucpulYkFK2z.jpg",
               "id": 30836,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.583218,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "MX",
            "name": "Mexico"
         }
      ],
      "id": 105536,
      "vote_count": 4,
      "budget": 0,
      "overview": "Chief Sitting Bull of the Sioux tribe is forced by the Indian-hating General Custer to react with violence, resulting in the famous Last Stand at Little Bighorn. Parrish, a friend to the Sioux, tries to prevent the bloodshed, but is court- martialed for \"collaborating\" with the enemy. Sitting Bull, however, manages to intercede with President Grant on Parrish's behalf. Written by Jim Beaver",
      "similar": [
         17382,
         11202,
         323677,
         75900,
         88794,
         36950,
         1883,
         11969,
         192136,
         316000,
         48564,
         10858,
         2567,
         769,
         1578,
         5915,
         45317,
         462,
         423,
         424
      ],
      "original_title": "Sitting Bull",
      "runtime": 105,
      "poster_path": "/puEodjPHbzQzcZ5k4DCqAJFmLrT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1954-10-06",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Mexico",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney Salkow"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Jack DeWitt",
         "Sidney Salkow"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0047501/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0NTE5MzE2MF5BMl5BanBnXkFtZTcwODY5MzcyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dale Robertson, Mary Murphy, J. Carrol Naish | See full cast and crew »"],
      "reviews": [
         "The picture concerns Sitting Bull (J. Carrol Naish) , celebrated chief and mystic of the Hunkpapa Sioux and Major Robert Parrish (Dale Robertson) . Parrish clashes Colonel Custer (Douglas Kennedy) and his superiors . He's degraded and sent an Indian reservation where they are mistreated and suffering famine . Meanwhile , being developed a loving triangle between his girlfriend (Mary Murphy) and a war journalist (William Hooper) . Later on , he is appointed by President Ulysses S. Grant (John Hamilton) to achieve a peace treatise with Sitting Bull to attempt to prevent the bloodshed and he fights a dangerous duel against Crazy Horse (Iron Heyes Cody) . Parrish helps Indians and is accused as a traitor , being court-martialed for \"collaborating\" with the enemy . Chief Sitting Bull of the Sioux tribe is forced by the Indian-hating General Custer to react with violence , resulting in the known Last Stand at Little Bighorn . The movie contains western action , romance , shoot-outs and spectacular battles . It appears as a technical adviser and designer Indian costumes , a secondary actor named Iron Eyes Cody , usual player as Indian roles (Great Sioux Massacre , A man called Horse) , though with Sicilian origin . The motion picture was regularly directed by Sidney Salkow . The film is a fiction and partially based on real events . The reality happened in December 1873 when the Commissioner of Indian Affairs directed all Sioux bands to enter reservations by the end of January 1876 or be declared hostile . Many bands of Sioux did not meet this deadline and were attacked by US troops . Crazy Horse and his Oglala people moved north to join forces with Sitting Bull , by the spring of 1876 some 3000 Teton Sioux and Northern Cheyenne warriors had assembled at Sitting Bull's camp in the valley of the Little Big Horn in Montana. On 25 June 1876 Crazy Horse and other war chiefs led the allied warriors against General Custer and his seventh Cavalry , Custer and all the man under his direct command were killed . This victory , however , brought relentless retaliation from the army and Sioux were scattered . Sitting Bull and his followers fled to Canada and stayed there until July 1881 , when he returned to the US and surrendered at Fort Buford , Montana . After he was placed on a South Dakota reservation . For a year Sitting Bull went a tour with Buffalo Bill's Wild West Show . He continued to regard himself as chief of his people and he earned the enmity of an Indian agent . On 25 December 1890 , Indian policemen went to take the chief , his followers tried to prevent this and in the struggle he was shot dead .",
         "Rebecca: \"This is so bad it's almost good\". Enid: \"This is so bad it's gone past good and back to bad again\". You could make a pretty good case that this silly little 1954 movie represents the bottoming out of Hollywood. There had been and would be worse movies, super-cheap independent productions and exploitation films by second tier studios, but it is unlikely that a top studio like United Artists has ever been associated with something quite this God-awful. \"Sitting Bull\" was intended as a historical epic (or at least a modest budget example of one), another in a fast growing line of movies dealing with the Battle of Little Big Horn or Custer's Last Stand. What is amazing about Hollywood is their continued unwillingness to tell the straight story about the engagement, as the true events of this military action have generated a sustained interest for over 130 years. Like the James gang's raid on Northfield, Minnesota, the true story is far more interesting that any of the embellished movie versions. If Hollywood is going to distort the events then they should change the names and call it by its correct name, fiction. I've seen most of these Hollywood efforts and \"Sitting Bull\" is pretty much in a class by itself in the distortion department. Curiously, it appears that a fair amount of historical research went into the production as recognizable names are bandied about throughout the movie but rarely are they linked to the individual's real actions. A relatively obscure officer like Miles Keogh, who was killed with Custer, is a character in the film but his rank is incorrect and he not present at the climatic battle. Earlier comments point out the most absurd of the movie's inaccuracies and distortions. It is certainly sympathetic to the Indians as Hollywood was actually remarkably quick to adopt this attitude. But even here there are distortions as the film specifically shows the Chief ordering that brave dead troopers not be desecrated. In fact the Indians stripped the bodies and went into mutilation frenzy at the conclusion of the fighting. Dramatically the film is flat with Dale Robertson wooden as the lead actor (too bad they didn't use Cliff Robertson instead). Mary Murphy (\"The Wild Ones\") is his love interest and Douglas Kennedy is Custer. Indian sympathizer Major Bob Parrish (Robertson) sacrifices his Army career and his romance because of his Indian sympathies. He stands in the way of greedy prospectors who want the Indian Territory opened up so they can search for gold. This was actually to some degree Custer's position, but in the film Custer is portrayed as a rabid Indian hater. Custer was a rash glory-seeking cavalry officer, he attacked rather than wait for reinforcements because did not want to share the glory of a victory with Crook and Terry. While no friend of the plains Indian, he was at worst indifferent to them. His main fault lay in underestimating their will and ability to resist his relatively small command. Murphy's relationship with Robertson is unintentionally hilarious and devoid of basic logic. So if you are forced to watch this thing, you can at least look forward to their scenes for some much needed (if unintentional) comic relief. \"Sitting Bull\" doesn't limit its social conscience factor to the red man, Parrish finds time to free a runaway black slave Sam (Joel Fluellen) from prison. It turns out that Sam has lived with the Sioux and he takes Parrish to their camp for a peace conference. The mad dog Custer messes up his efforts by disobeying President Grant and attacking the Indians at Little Big Horn. Of course nothing like this actually happened. Nor did Custer find himself standing up in the middle of a flat piece of prairie as the Indians rode around and around his command like it was a wagon train in an early Hollywood western. How do you say pathetic in Sioux? Than again, what do I know? I'm only a child.",
         "Okay, I admit it, we haven't finished it yet; we're somewhere into the second hour. It was packaged as the back half of a dollar-store DVD with \"Custer\" on the other side, so we bought it on a whim to see how badly you could repackage an old (probably public-domain) film in modern technology. The answer is: pretty badly. Watching this film is a challenge to determine which part is the filmmakers' fault (e.g. wooden acting; stilted dialogue) and which part is the result of an aging film that no one can be bothered to handle properly (e.g. a badly discolored old print; a truly horrendous pan-and-scan job of what was once an interesting-looking widescreen film). Of special note is the maddeningly constant, wall-to-wall musical background: cheesy weeping strings and such, non-stop, as if the filmmakers were terrified of having actual silence in the background once in a while. On the other hand, this _is_ how they liked to make films back then, so if you look at it as a period piece -- no, not as an example of life in the west, but as an example of what Hollywood churned out in the early '50s: the lighting, the acting, the hairstyles, etc. -- then it's actually interesting to watch... for a while, anyway.",
         "No western hero who was in the military ever took more on himself than did Dale Robertson in Sitting Bull. Not even Errol Flynn who buried Confederate gold in violation of orders in Virginia City got himself in as much trouble as did Major than Captain Robertson did here. This B film from MGM is yet another version of the events of surrounding the Little Big Horn battle where Douglas Kennedy as Custer got himself surrounded and massacred by some angry Sioux Indians. This version does show the Indian side of the events, how badly treated they were on reservations, how the whites once word of gold being discovered in their sacred Black Hills of Dakota territory systematically broke the treaties signed. Yet in fact the film went a bit overboard with presenting the Indian side and took great liberty with the facts. Dale Robertson's an army major who zealously follows his orders about respecting the Indian rights, to the dismay of former General now Colonel George Armstrong Custer. Robertson's maverick tendencies wouldn't be liked in the army in any event, but his fiancé Mary Murphy who is General John Litel's daughter wants an upwardly mobile career man and Robertson doesn't look like a good bet. For standing on his beliefs Robertson loses her to newspaper reporter William Hopper. But Dale gets himself in an even bigger jackpot. He's got an agreement with his former commander Ulysses S. Grant who is now president of the United States, the big chief of all the white folks. But when Custer moves prematurely and gets massacred and troops are sent on reprisal, Robertson does a very daring and potentially foolish thing to keep the peace process alive. That's the essence of our story. Which of course never did happen. Neither did Ulysses S. Grant as played by John Hamilton on hiatus from the Superman series ever come west to negotiate with J. Carrol Naish as Sitting Bull. That's the biggest flaw in this film. Murphy's character doesn't ring true either. From a woman who makes no bones about her desire for an upwardly mobile man, she does an about face and would make Tammy Wynette proud if Tammy had in fact ever seen Sitting Bull. The film's heart is the in the right place, but the rest of it is out to lunch. Though I will say one thing. If what I read is true about Mary Murphy's bout with Montezuma's revenge on location for this movie, she may have given one of the great performances of all time just getting through this film without a hint on screen.",
         "\"Sitting Bull\" as one might expect, takes place at the time of the infamous and oft filmed \"Custer's Last Stand\". The story involves the efforts of the fictional Major Bob Parrish (Dale Robertson) and Sioux Chief Sitting Bull (J. Carroll Naish) to prevent a war between the Sioux nations and the U.S. Cavalry. On one side, Sitting Bull's chiefs led by Crazy Horse (Iron Eyes Cody) and Colonel Custer (Douglas Kennedy) on the other push their superiors into war. The requisite love triangle involves Parrish, the General's daughter Kathy (Mary Murphy) and newspaperman Wentworth (william Hopper). Kathy turns away from Parrish when he is charged with insubordination and reduced in rank to Captain. She then becomes engaged to Wentworth. Parrish meanwhile with the assistance of former black slave \"Sam\" (Joel Flueller)arranges a meeting between President U.S. Grant (John Hamilton) and Sitting Bull. However, before the meeting can take place several incidents occur and war breaks out culminating with Custer's last stand at the Little Big Horn. J. Carroll Naish lends dignity to his portrayal of Sitting Bull. We see him as an intelligent caring and cautious leader who will stoop to war only as a last resort. In a move unusual for its time black actor Joel Flueller was cast in one of the leading roles in the film. The battle scenes are spectacular and well staged by director Sidney Salkow. In spite of the contrived Hollywood ending, this western is a lot better than some would have you believe.",
         "Right out of the gate, it probably would have been best if this film came with a warning to sit back and view it as the work of fiction that it is, rather than try to figure out which elements may or may not have been historically accurate. As it is, I'm ready to dismiss it entirely as a contrived piece of movie making that has little to recommend it. Of the figures presented, Chief Sitting Bull probably acquits himself most favorably, portrayed by veteran J. Carroll Naish. He's generally characterized as preferring peace, though from a pragmatic point of view, knowing that the next great war against the white man will probably wipe out his people, the seven great nations of the Sioux. His warrior chief Crazy Horse (Iron Eyes Cody) on the other hand, chomps at the bit to don the war paint and go on a tear. When a proposed meeting between Sitting Bull and President Grant (John Hamilton) fails to materialize, events converge to play out in a scenario that we now know as the Battle of Little Big Horn, but again, with great liberty taken with the known facts. Yes, Yellow Hair Custer (Douglas Kennedy) dies in battle, but this time around at least two men survive to report back to General Howell, along with the film's top billed Dale Robertson, as Captain Robert Parrish. Parrish escapes a firing squad for treason after leading the Sioux to safety after Little Big Horn (huh?), thanks to the intercession of Sitting Bull (double huh?). A lot of emphasis in the film is put on Sitting Bull's requirement that President Grant meet with him by the next full moon to consider a peace plan. As the time draws near, we see Sitting Bull on the final night looking skyward to the full moon with no word of the president. The very next moment he's walking in broad daylight to counsel with his war chiefs. I got a kick out of the opening credits, mentioning Iron Eyes Cody as \"Technical Adviser and Indian Costumes\"; in brackets he's called a \"Famous T.V. Star\". Speaking of costumes, both Sitting Bull and Crazy Horse are routinely shown in full regalia and war bonnet, though my limited knowledge of Indian custom tells me that full head dress was limited to rare occasions, so chalk up another one to poetic license. I guess it's fitting then that the movie humorously closes on what probably best describes it in a closing credit, though my copy may have been improperly cropped. There in big bold letters, it states \"A Rank Product\", distributed by United Artists - sadly, how true.",
         "TCM played this last night. It's cheap and shallow Saturday matinée stuff as the other comments suggest. I noticed two things: the day-for-night shots look good but the director(s) rarely used closeups. Most of the shots are long or waist shots, or two shots.This was an early CinemaScope production and perhaps they were limited by the lenses they had (the lenses were not plentiful at this time, especially to non- Fox producers). \"Sitting Bull\" was the first independent production to be shot in CinemaScope. This was W. R. Frank's last feature film production; he was a Minneapolis, MN theatre owner. The world premiere was held August 19, 1954 in Sioux Falls, SD. What did the Sioux Falls cinema-goers think of this picture being shot in Mexico?! It opened October 7, 1954 at the State Theatre in Minneapolis and Paramount in St. Paul. Both of the cities' film critics, Will Jones and Bill Diehl, hated the film. Comment cards were handed out at both theatres. A trade magazine item in April 1953 said that Frank had set May 20 as the production's start date, but decided to put it off until July when CinemaScope equipment was available. As early as 1950 actors such as Victor Jory were announced as being signed for this production. Later, names such as Boris Karloff and Dennis Morgan were mentioned in the trade press.",
         "The best thing that can be said about this film is that it had good intentions. What makes of it almost a camp movie is the unreal, primitive, simplistic way that Sitting Bull, the battle of Little Big Horn, and all events related to it are presented. There are no qualms here about changing historical facts and the unreal attitudes of Major Bob Parrish (Dale Robertson) and also of Sitting Bull are very hard to accept. It was much more complex than that, as it can be seen on the most accurate film made so far about it \"Son of The Morning Star\". The fact that it was made on a big budget, Cinemascope, and has good battle scenes makes it easier to see. It also had the technical advice of \"Iron Eyes Cody\" who sure knew a lot about it, but probably kept most of it to himself.",
         "Cheap, stupid, maddeningly idiotic western supposedly about Sitting Bull and the Battle of the Little Big Horn. Everything about this movie is tenth-rate--the acting is terrible, the script is absolute horsecrap with not even a PRETENSE of historical accuracy, the photography is awful, at times the camera actually shakes . . . you name it, this movie sucks at it. One of the most glaring examples of its almost complete incompetence is in the battle scenes. They'e stiff, mechanical and wretchedly directed; it looks like the actors playing the soldiers and Indians got tired of standing around waiting for someone to tell them what to do and went ahead and did it themselves. Even more irritating is the fact that the same battle scenes are replayed every 30 seconds or so, apparently in hopes that no one would notice that there wasn't enough footage shot to show a complete battle scene. The movie was filmed in Mexico (another stupid mistake by the filmmakers; the hilly, boulder-strewn, semi-desert Mexican terrain is nothing whatsoever like the rolling prairie country that was the actual locale of the battle) by American director Sidney Salkow and Mexican director Rene Cardona. Separately they were, at best, mediocre directors; together they merged into a really lousy one. All in all, this is a complete botch job at every conceivable level. Don't bother wasting your time on it.",
         "Seeing \"Sitting Bull\" somewhat by accident on a \"retro\" TV channel, I sat through the whole thing, partly in dumbfounded amazement at another Hollywood butchering of history, partly in awe of a superlative cast trying really hard with such a poor script. During the movie, I was also struck by the lush score. Naturally, the TV network didn't have the decency to show all the credits, but to my ear it sounded like the outstanding work of Raoul Kraushaar -- and praise all the gods of technology for IMDb, I was right. In my opinion, he is a terribly under-rated composer. Even the cheapest Allied Artists movies attain the ranks of quality when he wrote the score. J. Carroll Naish as the title character is another under-rated actor. That is, he does not seem to be known among viewers although apparently he was never out of work. He almost always played some accented character, some Latin or European or, as in this case, \"Indian\" character. And he was almost always extremely believable. The rest of the cast, from the excellent Dale Robertson to the excellent John Hamilton, were almost uniformly perfect."
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "W.R. Frank Productions",
         "Tele-Voz S.A."
      ],
      "summaries": ["Chief Sitting Bull of the Sioux tribe is forced by the Indian-hating General Custer to react with violence, resulting in the famous Last Stand at Little Bighorn. Parrish, a friend to the Sioux, tries to prevent the bloodshed, but is court- martialed for \"collaborating\" with the enemy. Sitting Bull, however, manages to intercede with President Grant on Parrish's behalf."],
      "budget": 0
   },
   "movielensId": 124462,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-10-06",
      "dvdReleaseDate": null,
      "directors": ["Sidney Salkow"],
      "runtime": 105,
      "movieId": 124462,
      "title": "Sitting Bull",
      "mpaa": "",
      "actors": [
         "Dale Robertson",
         "Mary Murphy",
         "J. Carrol Naish",
         "John Litel",
         "Joel Fluellen",
         "Iron Eyes Cody",
         "John Hamilton",
         "Douglas Kennedy",
         "William Tannen",
         "William Hopper",
         "Thomas Browne Henry"
      ],
      "imdbMovieId": "0047501",
      "originalTitle": "Sitting Bull",
      "genres": ["Western"],
      "youtubeTrailerIds": [],
      "plotSummary": "Chief Sitting Bull of the Sioux tribe is forced by the Indian-hating General Custer to react with violence, resulting in the famous Last Stand at Little Bighorn. Parrish, a friend to the Sioux, tries to prevent the bloodshed, but is court- martialed for \"collaborating\" with the enemy. Sitting Bull, however, manages to intercede with President Grant on Parrish's behalf. Written by Jim Beaver",
      "tmdbMovieId": 105536,
      "avgRating": 0,
      "releaseYear": "1954",
      "numRatings": 0,
      "posterPath": "/puEodjPHbzQzcZ5k4DCqAJFmLrT.jpg"
   }
}