{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "candy",
            "id": 985
         },
         {
            "name": "fairy tale",
            "id": 3205
         }
      ],
      "imdb_id": "tt0249567",
      "video": false,
      "title": "Hansel and Gretel",
      "recommendations": [
         30914,
         35109,
         32085
      ],
      "backdrop_path": "/9wXm9Iv0GOZzJirHYYUsyYfgNdK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Stepmother / Witch",
               "gender": 2,
               "credit_id": "52fe484a9251416c9108700f",
               "name": "Michael Yama",
               "profile_path": "/pLgUpZWV5iOxHkQW7kLKkhHT4WJ.jpg",
               "id": 80123,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Father",
               "gender": 0,
               "credit_id": "52fe484a9251416c91087013",
               "name": "Jim Ishida",
               "profile_path": null,
               "id": 156196,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gingerbread Man",
               "gender": 0,
               "credit_id": "52fe484a9251416c91087017",
               "name": "David Koenigsberg",
               "profile_path": null,
               "id": 927736,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Host",
               "gender": 2,
               "credit_id": "52fe484a9251416c9108701b",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe484a9251416c91087005",
               "name": "Tim Burton",
               "profile_path": "/yHEHAHQpN9PfSEQx1UxZPczhcAi.jpg",
               "id": 510,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe484a9251416c9108700b",
               "name": "Tim Burton",
               "profile_path": "/yHEHAHQpN9PfSEQx1UxZPczhcAi.jpg",
               "id": 510,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.04334,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 82309,
      "vote_count": 11,
      "budget": 116000,
      "overview": "This is Tim Burton's Disney Channel Halloween film short that only aired once. It combines live action and stop-motion, making for a creepy adventure into the woods.",
      "similar": [
         10882,
         60304,
         671,
         672,
         675,
         767,
         808,
         809,
         224141,
         37430,
         290595,
         38757,
         34584,
         408,
         411,
         129,
         76492,
         27022,
         321612,
         266647
      ],
      "original_title": "Hansel and Gretel",
      "runtime": 35,
      "poster_path": "/aJcTTgPMf3jN4I4QhaTQgFSMLYT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1982-01-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tim Burton"],
      "runtime": 45,
      "synopsis": null,
      "writers": ["Julie Hickson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0249567/",
      "coverLink": null,
      "actors": [
         "Michael Yama",
         "Andy Lee",
         "Alison Hong"
      ],
      "reviews": [
         "Although some people believe this is a Faerie Tale Theatre Episode, it is not. This wonderfully animated/live action short was only aired on the Disney Channel, along with another Tim Burton short entitled Vincent.The two were placed together as a half hour segment.The Hansel and Gretal story retold.Hansel and Gretal must escape a witch and her remarkable gingerbread house and find their father.It is a Japanese spoof of the story. The short is only about 20 minutes long. What animation there is, is similar to that of A Nightmare Before Christmes. It is mainly live action.I do recommend seeing this special if you can obtain it -- it is one of Tim Burton's odder works. Tim Burton did a Faerie Tale Theatre Episode Entitled Aladdin, and that is also well worth seeing.",
         "Two children are lured into the woods and left for dead by their stepmother, who claims she cannot feed them(me, I think it's because she unfairly portions the... slop). They come upon a house made of cake and faces(!), and comfortably eat, even agreeing to come in... only to find that the woman who owns it is a witch. We all know the fairie tale. This follows the structure and, in general, a lot of elements, including ones often changed, like the swan. It does, however, change... some things. Because of(?) the Asian cast, there is martial arts, complete with shurikens. What is meant to fatten Hansel is a gingerbread man. That talks. And demands he eat it. A kid is grabbed by several of the hands attached to the marshmellow bed he was sleeping in – Craftmatic charged extra for that. Both of the wicked women in this are played by the same person, a guy no less, and he eats *all* of the scenery, sugary or otherwise. Yama's performance alone is worth watching this for. Yes, this is disturbing. One of the ingredients here is concentrated nightmare fuel. Before you ask \"isn't this a children's film\", yes, but it is also a Brother's Grimm tale, and, also rather explicitly, a Burton piece. His trademarks are very present: Gothic, surreal, creative design/visuals, exaggerated features and the like, such as their huge dinner table(I swear, that thing'd seat a dozen people, easily), and the same object can be both creepy and cute. The father is a toymaker, allowing for a lot of wound-up figures, largely gratuitous and confined mostly to the opening sequence(did I mention that one of these eats another? Hey, it's thematically consistent). This is made of both stop motion and live action, and, sadly, you can usually tell where one ends and the other begins. Sets look cardboard-y, some of the props don't feel \"real\". This is separate from the cleverly done \"unreal\", imagination-driven atmosphere, which was, of course, intentional. I don't know if the colorful candy is supposed to look as nasty as it does. The two titular characters deliver OK performances... not many actors their age are stellar. Cinematography is good. The 34 and a half minute running time is decently paced. Considering the budget, even for TV, this could have been better – it's probably more that this is Tim's first chance in the chair. I recommend this to anyone curious, though this shouldn't be the director's first work you see. It is memorable, for reasons both positive and negative, and it is currently, legally, free to watch online. 5/10",
         "A good experiment for Tim Burton. I think was an interessant and sweet version of the novel and originally was andepisode for Faerie Tale Theatre. But it's very nice, the gus star Hanse and Gretal are kung fu boys and the witch is a man with a black suit. Very nice, and very funny!!!!"
      ],
      "genres": ["Fantasy"],
      "productionCompanies": ["Burton & Heinrichs Productions"],
      "summaries": [
         "Tim Burton's \"Hansel and Gretel\" is a live-action and stop-motion animated film short featuring East Asian actors and striking set designs reminiscent of his later work in films such as \"Beetle Juice\" and \"Edward Scissorhands\". While this film was created during Tim Burton's employment at Disney Feature Animation, his stop-motion work began with the short film \"Vincent\" and continues today with the recent \"Tim Burton's The Corpse Bride\". His 2D animation work while with Disney included \"The Fox and the Hound\" and \"The Black Cauldron\".",
         "This is Tim Burton's Disney Channel Halloween film short that only aired once. It combines live action and stop-motion, making for a creepy adventure into the woods."
      ],
      "budget": 116000
   },
   "movielensId": 124458,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-01-01",
      "dvdReleaseDate": null,
      "directors": ["Tim Burton"],
      "runtime": 35,
      "movieId": 124458,
      "title": "Hansel and Gretel",
      "mpaa": "",
      "actors": [
         "Michael Yama",
         "Jim Ishida",
         "David Koenigsberg",
         "Vincent Price"
      ],
      "imdbMovieId": "0249567",
      "originalTitle": "Hansel and Gretel",
      "genres": [
         "Fantasy",
         "Family",
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This is Tim Burton's Disney Channel Halloween film short that only aired once. It combines live action and stop-motion, making for a creepy adventure into the woods.",
      "tmdbMovieId": 82309,
      "avgRating": 3.66667,
      "releaseYear": "1982",
      "numRatings": 9,
      "posterPath": "/aJcTTgPMf3jN4I4QhaTQgFSMLYT.jpg"
   }
}