{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "stagecoach",
         "id": 33600
      }],
      "imdb_id": "tt0049834",
      "video": false,
      "title": "Tension at Table Rock",
      "recommendations": [],
      "backdrop_path": "/bZnqASFY9JLfxdcdmAdnGNEtt6.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "56bbe4fbc3a36860d0001336",
         "content": "The Ballad of Wes Tancred.\r\n\r\nTension at Table Rock is directed by Charles Marquis Warren and is adapted to screenplay by Winston Miller from the novel \"Bitter Sage\" written by Frank Gruber. It stars Richard Egan, Dorothy Malone, Cameron Mitchell, Billy Chapin, Royal Dano, Edward Andrews and John Dehner. Music is by Dimitri Tiomkin and Technicolor cinematography is by Joseph Biroc.\r\n\r\nWes Tancred (Egan) is a weary gunslinger who is wandering the plains after having been accused of a cowardly killing. Assuming the name of John Bailey, he happens upon the \"Bitter Sage\" ranch and events there will lead him into the town of Table Rock. Where his future, perhaps damned by his past, will be determined.\r\n\r\nA good Oater full of the staples of 50s genre pieces, tension at Table Rock is nonetheless a worthy morsel for those keen of a Western diet. Pic picks up a number of thematic threads, such as the gunman trying to go straight, a lawman who has lost his bottle, and hero worship by way of surrogacy. Naturally there's a romantic angle, with Malone all bright eyed and perched in between Egan and Mitchell, but this is thankfully not over played.\r\n\r\nStandard action scenes are handled well by Warren, a man who knew his way around dusters of TV and cinema. Costuming and scenic photography is pleasing, while Egan (tortured square jawed machismo), Mitchell (tortured and scarred and awaiting machismo rebirth) and Dano (eleagant wise man) are in good credit with performances. Best of the support is Dehner, no surprise there, and Angie Dickinson and DeForest Kelly have minor but key roles to play.\r\n\r\nIt's all tightly played out to the point that the derivative nature of the story is in no way a hindrance to the entertainment on offer. 7/10",
         "url": "https://www.themoviedb.org/review/56bbe4fbc3a36860d0001336"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Wes Tancred",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2a3",
               "name": "Richard Egan",
               "profile_path": "/qOLUdKOQzu9HgKOHTG5Pbj0gIme.jpg",
               "id": 93105,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lorna Miller",
               "gender": 1,
               "credit_id": "52fe48cfc3a368484e10c2a7",
               "name": "Dorothy Malone",
               "profile_path": "/6xgsu7iZAHVir8hebZ1aYMmX8Xz.jpg",
               "id": 10487,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Sheriff Fred Miller",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2ab",
               "name": "Cameron Mitchell",
               "profile_path": "/59qGcBDKN1H4UysLaOEdV1PJter.jpg",
               "id": 44728,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jody Burrows",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2af",
               "name": "Billy Chapin",
               "profile_path": "/uQuVKP7HQ07h3dMcf9Umk9fzEyo.jpg",
               "id": 30540,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Harry Jameson",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2b3",
               "name": "Royal Dano",
               "profile_path": "/5kHyvS5Xaa97Lulrxy0ZgtqHqMI.jpg",
               "id": 19968,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Kirk",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2b7",
               "name": "Edward Andrews",
               "profile_path": "/naSCJGkfi7hbyohoUO122O37ROP.jpg",
               "id": 29719,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Hampton",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2bb",
               "name": "John Dehner",
               "profile_path": "/2maCnzFC38ACrrAtFOCMj0GoQ8V.jpg",
               "id": 82863,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jim Breck",
               "gender": 0,
               "credit_id": "52fe48cfc3a368484e10c2bf",
               "name": "DeForest Kelley",
               "profile_path": "/fUL1BY8XjLsQihueDD1UUAm0Qy6.jpg",
               "id": 1750,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Ed Burrows (as Joe DeSantis)",
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2c3",
               "name": "Joe De Santis",
               "profile_path": "/2CkzrebI0JHyO2zrBCPYmqTNYLQ.jpg",
               "id": 95012,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Cathy",
               "gender": 1,
               "credit_id": "52fe48cfc3a368484e10c2c7",
               "name": "Angie Dickinson",
               "profile_path": "/tseegCkV3HvsXKIbcFuXHdzG4o2.jpg",
               "id": 4301,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c29f",
               "name": "Charles Marquis Warren",
               "profile_path": null,
               "id": 83455,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2cd",
               "name": "Winston Miller",
               "profile_path": null,
               "id": 30287,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48cfc3a368484e10c2d3",
               "name": "Frank Gruber",
               "profile_path": null,
               "id": 88974,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5829650c9251417b1d0344a1",
               "name": "Sam Wiesenthal",
               "profile_path": null,
               "id": 120548,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58296512c3a3683606037224",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58296519c3a3680381029ce2",
               "name": "Joseph F. Biroc",
               "profile_path": null,
               "id": 14431,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "582965279251417b1d0344b1",
               "name": "Doane Harrison",
               "profile_path": null,
               "id": 3159,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "582965389251417b1d0344bc",
               "name": "Harry Marker",
               "profile_path": null,
               "id": 109414,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "582965419251417b1a035d78",
               "name": "Albert S. D'Agostino",
               "profile_path": null,
               "id": 4349,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "582965489251417b2c03466d",
               "name": "John B. Mansbridge",
               "profile_path": null,
               "id": 12869,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.667373,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 74527,
      "vote_count": 1,
      "budget": 0,
      "overview": "When the owner of a stagecoach station is killed, a gunman takes his place.",
      "similar": [
         154093,
         214974,
         39295,
         297119,
         419715,
         273248,
         11697,
         301,
         14168,
         995,
         27945,
         23330,
         37412,
         43253,
         43348,
         17836,
         15264,
         56373,
         40743,
         43380
      ],
      "original_title": "Tension at Table Rock",
      "runtime": 93,
      "poster_path": "/9Bfy6YHCqydRtoEjNiPMo0JDEEM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
            "name": "RKO Radio Pictures",
            "id": 6,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Sam Wiesenthal Productions",
            "id": 18284,
            "origin_country": ""
         }
      ],
      "release_date": "1956-10-03",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "A man like Shane... the suspense of High Noon...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Charles Marquis Warren"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Winston Miller",
         "Frank Gruber"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049834/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MjY1MjQ5NF5BMl5BanBnXkFtZTYwNjM3MDk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Richard Egan, Dorothy Malone, Cameron Mitchell | See full cast and crew »"],
      "reviews": [
         "This is a better than average telling of the trail herd vs. the town story. A legendary gunfighter(played by Richard Egan) hiding from his past drifts into a town about to be visited by a trail herd. The sheriff (played by Cameron Mitchell) has more than his share of troubles with the town council, a local saloon owner and his pretty wife (played by Dorothy Malone). The ending is predictable with the gunfighter confronting his past, shooting a gunfighter hired to kill the sheriff and saving the town. Although the usual cliches are plentiful, the movie is well photographed and colorful. The script is well above average and there is much more going on plot-wise than usual. The acting is top notch. DeForest Kelly is memorable in a small role as a gunman hired by the saloon owner to kill the sheriff. There is also an excellent Dimitri Tiomkin score which reflects nicely the psychological undercurrents of the gunfighter's past. This movie is well worth the time.",
         "Not to be confused with \"Bad Day At Black Rock\", but just about as good especially considering it was made when RKO was really struggling. It's deliberately paced and quite absorbing with fine performances from Richard Egan (a lumbering, mostly humorless actor who nevertheless had dramatic weight) as a guilt-ridden gunman, and Cameron Mitchell as a physically and emotionally scarred sheriff who wrestles with his cowardice. (I'd even go so far as saying Mitchell gives a great performance - he does some real interesting things with the character.) The highlights for me were the courtroom scene, where Egan gives a moving little speech on how a man is through when he deceives himself (it's a real turning point for both characters) and a showdown at the end that plays out in an understated but completely satisfying way. I also liked the psychological intimidation tactic of the cattle drivers mimicking in unison the footsteps of various townspeople as they walk along. The one real flaw would have to be the way the same cattle drivers are so antagonistic towards the folks in town. Rowdy and reckless, sure, but their hostility seems unmotivated and certainly counter-intuitive.",
         "As a director, Warren(Little Big Horn,1951) was either very hot or cold. He's hot here. The tension rises as the town braces for the insurgence of rowdy, often deadly cattlemen and copes with a sheriff who doubts his courage. Egan is superb as the man who has killed a blood-thirsty outlaw, now turned legend. There is enough action on hand to satisfy all and a rousing score by Dimitri Tiomken. One of the good ones.",
         "This superb '50s western is what I term a \"minor masterpiece\". By that I do not mean that it is inferior, rather that its \"B\" status will inevitably always relegate it to side discussions when the \"big\" westerns are brought up. But a very convincing argument can be made that this, and many other '50s \"B\" westerns-including in my view almost all of the Audie Murphy ones-are the absolute pinnacle of the genre. Other reviewers have given good accounts of the plot so I will instead mention: the marvellous cast (DeForrest Kelly was underused as a westerner-marvel at his performance); the tension that I think is due to the modest running time and the quick, simple scenes that just flow so naturally; great, bright colour (I loathe the dark modern movies); a second-to-none score from an age when there were great film composers; all the essential elements are here-the boy, the tortured hero, believable domestic tensions, the baddies-you just care about these characters. Every time this appears on British TV I seem to watch it afresh and discover more subtleties. Minor masterpieces are not that much more common than major ones. Do not miss this movie.",
         "Good western featuring a reticent gunslinger and a lawman who has lost his nerve who must go up against a group of thugs who want to let off steam in their town. Egan was well cast as the gunman who was short on talk and long on slinging lead when the chips were down.",
         "Tension At Table Rock casts Richard Egan as a misunderstood gunman who gets a phony reputation as a backshooting coward because he outdrew the wanted Paul Richards and Richard's girlfriend Angie Dickinson who was the only witness told a false tale. Now having to operate under an assumed name, Egan falls in with orphan Billy Chapin after he eliminates those who killed Chapin's father Joe DeSantis and made him an orphan. He delivers young Billy to the town of Table Rock where his aunt and uncle live and uncle Cameron Mitchell is a much put upon sheriff. After this the film does run along the established plot lines of Shane somewhat. Mitchell makes a Faustian bargain with trail boss John Dehner to not tear up the town too much mainly because he got beaten really badly by a whole bunch of Dehner's trailhands on the previous drive. But when one of them shoots down an unarmed farmer and then tries to get away with it Egan gets into action. Dorothy Malone is in Tension At Table Rock as well. 1956 was the same year Malone got her career Oscar winning role for Written On The Wind. The sexual tension between the stranger Egan and her is unmistakable and it's where people draw comparisons between Tension At Table Rock and Shane. Though she's on only briefly in the beginning Angie Dickinson really does shine in the part of a woman who gets vengeance for her man. Another really good performance is that of Edward Andrews the saloon owner who could care less if the drunken trailhands shoot up the town and kill a few people as long as they drink in his saloon and his profits don't get cut into. Towards the end of that studio's existence RKO was getting into some serious adult B westerns as was its competitor Republic, the stuff that would later be a staple for fifties and sixties television. Tension At Table Rock is a good example of the adult type westerns that would later be found on television.",
         "This movie has all the ingredients most Western fans love in their films: gunfights, love triangles, bad guys & a quiet, suffering & misunderstood hero working out his private travails by helping a beleaguered sheriff deal with his own demons. All with a rousing Dimitri Tiomkin score that has a memorable ballad at its core. We've seen these ingredients before in many other Westerns but in this film they seem to work. Richard Egan non-acting style work perfectly here & the supporting cast boasts small but vivid parts for Angie Dickenson as the siren that starts Egan's private struggle & Deforest Kelly as a smiling, friendly gunslinger. I've seen this film a number of times & surprisingly the film still works.",
         "TENSION AT TABLE ROCK is a underrated Western starring the taciturn and fleshy Richard Egan as Wes Tancred, a man thought by society to have shot his best friend in the back (an event celebrated by an ubiquitous ballad through much of the film). The song of course is incorrect, as the audience knows full well from watching the opening scenes. But such miscomprehension is central to a film frequently concerned with people being what they are not, or at the least not what they are expected to be. Just as Tancred is not the \"black-hearted, white-livered, backbitin' sidewinder\" murderer as the infamous lyrics say, so Sheriff Miller (Camron Mitchell) is no longer the fearless lawman he was after his beating; his wife Lorna (Dorothy Malone)is no floozy as the audience initially suspects; and even the gunfighter Jim Brek, finally brought in to dispatch the lawman turns out to be an affable enough, if still dangerous, fellow. Malone's casting as Lorna is on one level ideal; the actress made such a success as an unstable nymphomaniac in Sirk's marvellous WRITTEN ON THE WIND made the same year, and in that light it's the unaccustomed restraint between her character, wife of a weak male and the strong Tancred (who clearly is infatuated with her) which is one of TABLE ROCK's more interesting elements. Having said that, an early appearance by Angie Dickinson in the film, 3 years before her memorable role in RIO BRAVO makes one wonder what she would have brought to the main female part. In one of the film's key scenes, Miller returns home early to overhear his wife treating Tancred's head flesh wound - a moment of relative intimacy, ripe for a liaison, but which never materialises. (In a quietly Freudian moment he moves Tancred's hat off the back of the door revealing a peg beneath). As she says to her patient admiringly: \"You're really the man Jody thinks you are\" Miller reflects upon his own shortcomings. The irony is, of course, that Tancred is in fact really a man that *nobody* thinks he is, and someone who can only be be admired, loved and respected without a damaging reputation in place. From this perspective the film can be seen as the interesting antithesis to such works as Ford's THE MAN WHO SHOT LIBERTY VALANCE, where one is invited to believe the legend of the West, and not the truth. Charles Marque Warren's direction is up to the job, although it is buoyed considerably by a fine score by Dmitri Tiomkin - another reason why the film should be better known. It may be that Warren (who made a number of Westerns, and co-wrote the fine DAY OF THE EVIL GUN) is ripe for reappraisal. Cameron Mitchell is also good in his difficult role which would probably have suited a slightly older actor. Egan's performance is subdued but fairly subtle as he plays a man who internalises a lot of his moral decisions, and this is surely one of his best works. The young Jody is played by Billy Chapin who made such an impression in NIGHT OF THE HUNTER, but at times here his experience, largely among older, more violent males, recalls the world of TV's THE RIFLEMAN notably during his early scenes with Tancred and his natural father. It's these moments too, set as they are in a Fargo way station, a world threatened by the arrival of thugs with their own agenda, which might reflect the narrative influence of the celebrated Randolph Scott cycle made with Budd Boetticher, made around this time. Trivia note: the film contains characters called Kirk and Scotty, while DeForrest Kelley (Brek) played McCoy in Star Trek.",
         "Needing a break from his gunfighter western ways, rugged Richard Egan (as Wes Tancred) decides to take on a tamer identity (as \"John Bailey\"). In this guise, Mr. Egan finds honest work, but immediate tragedy. He hooks up with blue-eyed Billy Chapin (as Jody Burrows), after gunmen kill the cute boy's paw. Delivering the lad to relatives, sharply outfitted Dorothy Malone (as Lorna) and sheriff husband Cameron Mitchell (as Fred Miller), leads \"Rifleman\" Egan from \"Shane\" to \"High Noon\" territory. Angie Dickinson and DeForest Kelly have bang-up roles. With Charles Marque Warren at the reigns, \"Tension at Table Rock\" knows its turf. ****** Tension at Table Rock (10/3/56) Charles Marque Warren ~ Richard Egan, Dorothy Malone, Cameron Mitchell, Billy Chapin",
         "I was surprised how good this movie turned out to be. Talk about a Western for Western-lovers - there's the guy (Wes Tancred played by Richard Egan) who's good with a gun, a cattle drive where the cowboys are going to overrun and terrorize a town, the sheriff is weak and his wife falls for Tancred. There are a lot of smaller stories that influence the action. Billy Chapin plays a boy named Jody whose father is killed by outlaws; Tancred kills the outlaws and takes the boy to live with his uncle and aunt (the sheriff and his wife). The local newspaper's editor is at odds with the sheriff, knowing he is weak and is afraid to stand up to bad guys. The basic plot is of someone, Tancred, who is trying to escape his past and start over, but things keep making it hard for him to do that. A popular folk song claims that he killed his best friend by shooting him in the back, so under his actual name he is a reviled man. He changes his name and ends up taking part in the town's struggles against the bad guy cowboys. This movie has plenty of action; it doesn't just sit there and talk you to death. Between the guns and horses and fights and shooting and saloon and all, it's got to be called a classic Western, no doubt. The casting is good though I was surprised at how many people I hadn't really seen in many Westerns; meanwhile there was not a Lee Van Cleef or a Denver Pyle or a Jack Elam or a Paul Fix to be seen. Doesn't matter much though, the cast did a very good job. The movie is in color though the quality of the color is uneven from scene to scene. I enjoyed this movie more than I expected to, and it's surely worth the watching for anyone who likes Westerns."
      ],
      "genres": ["Western"],
      "productionCompanies": ["Sam Wiesenthal Productions"],
      "summaries": [
         "A reluctant gunslinger tires of having to defend himself at every cow town he visits, so he adopts an alias and continues his wandering. At an outpost run by a father and young son, he gets involved with a robbery in progress, and agrees to take the son to the boy's uncle, a sheriff in Table Rock, for his safety. Once there he finds the town gearing up for the arrival of a cattle drive and the unruly cowboys. He strives to remain uninvolved as the sheriff tries to get his help with the cowboys, but the sheriff nurses bad memories from an earlier incident that may threaten his effectiveness.",
         "Wes Tancred has killed a popular gunslinger in self-defense. Because there is a mean-spirited ballad sung about this killing wherever he goes, Wes is on the run from his infamy. Along Wes finds a job at an isolated stagecoach outpost, run by father and son Ed and Jody Burrows. When three outlaws try to occupy this outpost, Ed is murdered. West then brings Jody to his aunt Lorna Miller in Table Rock. Lorna's husband, Sheriff Fred Miller, is a traumatized man after a brawl in his past. When a gang of 50 lawless drovers visit Table Rock they cause much violence with even a rancher slain. A frightened Fred does not dare to act because of his past however. The local citizens, Lorna and the 50 drovers now turn their backs on Fred. Wes has always tried not to get involved, but when the gunslinger Jim Breck, whom he knows from the past, arrives on the scene he has to make a difficult decision."
      ],
      "budget": 0
   },
   "movielensId": 124452,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-10-03",
      "dvdReleaseDate": null,
      "directors": ["Charles Marquis Warren"],
      "runtime": 93,
      "movieId": 124452,
      "title": "Tension at Table Rock",
      "mpaa": "",
      "actors": [
         "Richard Egan",
         "Dorothy Malone",
         "Cameron Mitchell",
         "Billy Chapin",
         "Royal Dano",
         "Edward Andrews",
         "John Dehner",
         "DeForest Kelley",
         "Joe De Santis",
         "Angie Dickinson"
      ],
      "imdbMovieId": "0049834",
      "originalTitle": "Tension at Table Rock",
      "genres": ["Western"],
      "youtubeTrailerIds": ["xcu8Db0lHEU"],
      "plotSummary": "When the owner of a stagecoach station is killed, a gunman takes his place.",
      "tmdbMovieId": 74527,
      "avgRating": 3,
      "releaseYear": "1956",
      "numRatings": 1,
      "posterPath": "/9Bfy6YHCqydRtoEjNiPMo0JDEEM.jpg"
   }
}