{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bible",
            "id": 3036
         },
         {
            "name": "classic noir",
            "id": 155436
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0041790",
      "video": false,
      "title": "Red Light",
      "recommendations": [
         37195,
         29846,
         36375,
         61960,
         35923,
         74753,
         49502,
         25548,
         37742,
         35418,
         51153,
         32887,
         43453,
         36461,
         47623,
         37039,
         42061,
         27034,
         44542,
         51554
      ],
      "backdrop_path": "/aFhDmDyPqR8hxrvmKFx4C07WHvw.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "546e5d8d9251415ffb0004d0",
         "content": "Army Chaplain Slain!\r\n\r\nRed Light is directed by Roy Del Ruth and adapted to screenplay by George Callahan from the story This Guy Gideon written by Don Barry. It stars George Raft, Virginia Mayo, Raymond Burr, Harry Morgan and Gene Lockhart. Music is by Dimitri Tiomkin and cinematography by Bert Glennon.\r\n\r\nSomething of an oddity, Red Light finds George Raft up to his neck in religion, revenge and a smouldering Virginia Mayo. After his brother, a chaplain, is murdered, he sets off to find the killer, whom can be identified by a message scrawled in a Gideon Bible. Find the Bible, find the killer.\r\n\r\nIt is brought into the film noir sphere of things via Glennon’s photography, which kicks in at the hour mark and runs concurrent with the murky thematics in the narrative, Frisco a rain sodden place of sleaze. Other than that it plays more as a crime drama, albeit one with some decidedly spicy killings and another top villain turn from Raymond Burr. Tiomkin’s musical cues are strange and not always in sync with what is happening on screen, while the biblical hermeneutics and various plot contrivances irk rather than perk.\r\n\r\nSee it for Burr and Glennon’s work, or if you fancy a weird blend of noir and ethical religio redemptions! 6/10",
         "url": "https://www.themoviedb.org/review/546e5d8d9251415ffb0004d0"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Johnny Torno",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba35",
               "name": "George Raft",
               "profile_path": "/orQya82STEGviY0ARuyo3AIt1Ud.jpg",
               "id": 3152,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Carla North",
               "gender": 1,
               "credit_id": "52fe44dfc3a368484e03ba39",
               "name": "Virginia Mayo",
               "profile_path": "/qckBlGHJ4aZtXNceNBgmd5Y11hE.jpg",
               "id": 13579,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Warni Hazard",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba3d",
               "name": "Gene Lockhart",
               "profile_path": "/7IL5fx1mfhCiMAvYXSiY1Dj7yky.jpg",
               "id": 30234,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nick Cherney",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba41",
               "name": "Raymond Burr",
               "profile_path": "/Asn6aKAPshAUDnJN3OMLsBWCRwO.jpg",
               "id": 7685,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rocky (as Henry Morgan)",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba45",
               "name": "Harry Morgan",
               "profile_path": "/xQlBwecEQEz84k7jDLPGi6FqxRJ.jpg",
               "id": 4073,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Detective Strecker",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba49",
               "name": "Barton MacLane",
               "profile_path": "/vmfmiGO6cusQn9B8jw9oLPnSYr6.jpg",
               "id": 14451,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Capt. Jess Torno (Chaplain",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba4d",
               "name": "Arthur Franz",
               "profile_path": "/aWGmUmJfQOPAFdd0w29C4SUbyZb.jpg",
               "id": 85940,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ken Murray",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba51",
               "name": "Ken Murray",
               "profile_path": "/tp0eW8EPSXSa5zf7W6lubdmVdUD.jpg",
               "id": 176543,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Carlson Hotel Bellhop",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba55",
               "name": "Stanley Clements",
               "profile_path": "/ycQbiaJwuYouJc2yX1kc4UIkdka.jpg",
               "id": 133436,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Hotel Night Clerk",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba59",
               "name": "William Frawley",
               "profile_path": "/nG2PEowEAQEB7yiaJ6kvoFHNuNU.jpg",
               "id": 34285,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Father Redmond",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba5d",
               "name": "Arthur Shields",
               "profile_path": "/mpdhGz7aExU8HP3WkiEr51PU195.jpg",
               "id": 22603,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Wallace 'Wally' Stoner",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba61",
               "name": "Frank Orth",
               "profile_path": "/9n6ABKYcBmKRjo7yPAyAsd8yKEQ.jpg",
               "id": 30240,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Pablo Cabrillo",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba65",
               "name": "Phillip Pine",
               "profile_path": "/4sJIQFCA3GEmJJiE0rnBEF0JDQl.jpg",
               "id": 16126,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Detective Jim Ryan (as William S. Phillips)",
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba69",
               "name": "William 'Bill' Phillips",
               "profile_path": "/h6SbVyfLWte99zUZtwhxHELMYDk.jpg",
               "id": 94337,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Trina (as Movita Castenada)",
               "gender": 0,
               "credit_id": "52fe44dfc3a368484e03ba6d",
               "name": "Movita",
               "profile_path": "/6wsYSnKlwRiPpRLu7Mh2Othl0D9.jpg",
               "id": 939707,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Vincent, Houseboy (uncredited)",
               "gender": 2,
               "credit_id": "58165a6dc3a368766901166c",
               "name": "Victor Sen Yung",
               "profile_path": "/bb96v3LI3reb6ojs6Ac6Mjehg3l.jpg",
               "id": 82385,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "594b7b39925141311500d9f6",
               "name": "Claire Carleton",
               "profile_path": "/bmEkzqOKIO1qSWrFBgCFpwyglFs.jpg",
               "id": 91655,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba31",
               "name": "Roy Del Ruth",
               "profile_path": "/vm5P5O0qcLYqhdPXw17U4CkBEsV.jpg",
               "id": 94218,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a368484e03ba73",
               "name": "Don Barry",
               "profile_path": "/nNkmzhdtbJfRJCgh0dH1Ss3wkBE.jpg",
               "id": 103789,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe44dfc3a368484e03ba79",
               "name": "George Callahan",
               "profile_path": null,
               "id": 120729,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba7f",
               "name": "Charles Grayson",
               "profile_path": null,
               "id": 344185,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba85",
               "name": "Roy Del Ruth",
               "profile_path": "/vm5P5O0qcLYqhdPXw17U4CkBEsV.jpg",
               "id": 94218,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba8b",
               "name": "Dimitri Tiomkin",
               "profile_path": null,
               "id": 4082,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba91",
               "name": "Bert Glennon",
               "profile_path": "/xLzo0JqItVHAm8OqlhyRQxEw5k9.jpg",
               "id": 14960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44dfc3a368484e03ba97",
               "name": "Richard V. Heermance",
               "profile_path": null,
               "id": 88647,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.661987,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25807,
      "vote_count": 6,
      "budget": 0,
      "overview": "Nick Cherney, in prison for embezzling from Torno Freight Co., sees a chance to get back at Johnny Torno through his young priest brother Jess. He pays fellow prisoner Rocky, who gets out a week before Nick, to murder Jess... who, dying, tells revenge-minded Johnny that he'd written a clue \"in the Bible.\" Frustrated, Johnny obsessively searches for the missing Gideon Bible from Jess's hotel room.",
      "similar": [
         996,
         513285,
         14638,
         247,
         1813,
         9509,
         1092,
         5876,
         426,
         402,
         86834,
         147441,
         256591,
         599,
         289,
         615,
         324786,
         9946,
         6844,
         1939
      ],
      "original_title": "Red Light",
      "runtime": 83,
      "poster_path": "/27FZyHLFMbj84rR7ECp1e9RetPM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Roy Del Ruth Productions",
         "id": 15957,
         "origin_country": ""
      }],
      "release_date": "1949-09-30",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "THERE'S TROUBLE AHEAD!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Roy Del Ruth"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Don 'Red' Barry",
         "George Callahan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041790/",
      "coverLink": null,
      "actors": [
         "George Raft",
         "Virginia Mayo",
         "Gene Lockhart"
      ],
      "reviews": [
         "How satisfying! What better casting than George Raft as ANGRY MAN?? The Lord may say: \"Vengeance is mine,\" but Georgie says \"the heck with that noise -- this one's MY baby!\" He rampages through a multi-state search-and-destroy mission in his quest to find the message hidden in the Gideon Bible that was in his brother's room when he was killed. Raymond Burr and Harry Morgan are his Mutt and Jeff antagonists: The irony of course being that as he fervently seeks the Bible, he fervently disregards it. But with a little Mayo on the side, things turn spiritual on Georgie, forcing him to listen to The Man before he can do a Godzilla on Godzie's old pal Burr. This is George Raft vs. The Lord, and it's anybody's match! Great fun all around, and there are even moral lessons, if you're into moral lessons, and intense but effective music to learn by, in the bargain. If you can find it, it's worth an hour and a half in your busy schedule, and you might even end up spiritually uplifted -- but stay out from under big trucks -- they're heavy!",
         "One man (Raymond Burr) avenges being sent to prison for embezzling from a San Francisco trucking company by having the younger brother, a priest played by Arthur Franz, of the owner of the trucking company (George Raft) killed, shot in cold blood in a hotel room by Burr's prison associate Henry Morgan. The killing itself is impressively done and Morgan looks surprisingly mean. Burr is in top form looking downright menacing, and basically carries a lot of this film, as Raft's part goes way overboard as the vengeful older brother, though the Gideon's Bible angle of the film gives the part some saving grace. Virginia Mayo's role as one of the people who stayed in the hotel room where the murder took place, does not add much, as she is used by Raft to help find the Bible in which there is supposedly a clue to the killer's identity. As well, the great talent of Gene Lockhart gets somewhat squandered in his role as company VP. The role of the Bible itself makes the film a bit of a religious noir, an element that is also captured in some superb cinematography by the great Bert Glennon. The final fifteen minutes do definitely not let one down as Burr and Raft meet in the trucking company office on a rainy night, and the pieces fall efficiently together.",
         "With so much of this gangster melodrama revolving around the Gideon Bible holding the clue to the murderer, it's no wonder that Dimktri Tiomkin plays up the pious \"Ave Maria\" every time any mention of \"the clue\" is made. George Raft's monotone voice and intense expression never changes much throughout, but he's convincing as a man on a mission to find and kill his brother's murderer. Along the way, he enlists the aid of the lovely Virginia Mayo, who helps him track down the killer while reminding him that his brother was strictly a \"Thou shalt not kill\" sort of Army Chaplain. Thus, the grim ending for the killer comes not from Raft but providence when he's disposed of quite dramatically. Raymond Burr plays the \"heavy,\" a sadistic thug who seems to enjoy every kill, even if it means pushing a man off a train or having a truck falling on top of a man in hiding. A good cast, including Arthur Franz as Raft's brother, Gene Lockhart, Harry Morgan, Barton MacLane, Ken Murray, William Frawley and Arthur Shields. Virginia Mayo gives an excellent performance as the gutsy gal who helps Raft in his quest to find a killer. Trivia: Interesting to note that most of the supporting cast would go on to TV fame in an era when that medium was just starting to give film players some iconic breaks. Summing up: Good revenge melodrama with film noir touches.",
         "Meticulously groomed George Raft was a notoriously one-note actor, but his monotone worked harmoniously in the flattened acoustic of film noir. In Roy Del Ruth's Red Light -- an unusual \"religioso\" thriller -- he owns a trucking empire; his brother, a priest and army chaplain, has just been gunned down in a hotel room. The clue to the assassin's identity is supposedly scrawled in the room's Gideon Bible, which has gone missing. Raft enlists the aid of Virginia Mayo to track down both Bible and killer. But when they succeed, Raft's plans for revenge are thwarted by the Deity, in the form of a huge electrical sign during a pelting rainstorm, underscoring the movie's moral: \"Vengeance is mine, sayeth the Lord.\" Raft's quest is jam-packed with every cinematic device that makes the noir cycle such delectable (if forbidden) fruit: flicked-away cigarette butts, rain-streaked windowpanes, grotesquely lit close-ups, San Francisco at its sleaziest. The film's heavies, Raymond Burr and Harry Morgan, win no congeniality awards; Burr's performance here may well be the nastiest in his impressive portfolio of thugs. Despite Dmitri Tiomkin's pietistic score, which lurches from the \"Dies Irae\" to the \"Ave Maria\" and back again, the spiritual side of the story seems clumsily overlaid, a late addition to the film's hard-core noir structure. And the title remains a puzzle. Is it meant as an injunction to \"Stop\" the cycle of bloodshed? A reference to the votive candle whose flame indicates that the Blessed Sacrament is in residence? Or to the electrocuting signage which ends the movie? No matter; it does little to dispel the deep, and deeply satisfying, thematic gloom.",
         "... because you always know what you're going to get. However, that doesn't mean that I don't really enjoy his movies. Nobody, I mean nobody does revenge like Raft. Here he plays businessman Johnny Torno, proud older brother of young Jess Torno, a priest recently returned from being a chaplain in WWII. Four years earlier Torno's bookkeeper Nick Cherney (Raymond Burr) was sent to prison for embezzling from Johnny's company - he was embarrassingly guilty and it was really a lot of money. Instead of blaming the man in the mirror, Nick blames Johnny for his fate and crafts a particularly cruel revenge. If he kills Johnny, Johnny's troubles are over. However, if he kills what is precious to him - brother Jess - he can plunge Johnny into a living hell of grief. He sends a hit man (Harry Morgan) out to do the killing. Johnny finds Jess just before he dies. Of course Johnny wants to know who did this so he can kill them in revenge - he tells Jess so - and Jess tells him the answer is written in a Bible. Now at first Johnny thinks Jess means his own personal Bible, but after searching through it he finds nothing. He then realizes that Jess probably meant the Gideon Bible that is found in every hotel room. This starts Johnny on a search for the missing Bible and all of the guests in the hotel room since Jess' death who might have taken it. Nick, now out of prison, along with the hit man, are right on Johnny's heels hoping their plans are not discovered. It is very odd to see later TV good guys Harry Morgan and Raymond Burr playing such sinister characters but the performances ring true. So does Virginia Mayo as a girl Johnny befriends along the way as the voice of reason and even redemption. Raft wrestles here not only with bad guys and a mystery but with God Himself - he treats the Almighty either like a traffic cop that he thinks can be bribed or an unreliable employee that he doesn't fire because he enjoys blaming him for his troubles, depending on his mood. A good noir and good stuff from Raft - highly recommended.",
         "George Raft stars in the 1949 \"Red Light\" with Virginia Mayo, Raymond Burr, Gene Lockhart, Arthur Franz, and a host of other familiar faces. Raft plays Johnny Torno, the head of the Torno Freight Company. When he caught Nick Cherney (Burr) embezzling from him, he had him put in prison. When Johnny's brother Jess, an army chaplain, is discharged, Nick sees a chance to get back at Johnny, who adores his brother. Jess is found dying in a hotel room, and all he can say to Johnny is, \"Bible...in the Bible.\" Johnny believes that Jess means his own Bible. Eventually he realizes he meant the Gideon Bible in his hotel room. But the Gideon Bible is missing by the time Johnny gets back there. Johnny sets out to find the Bible by tracking down anyone who had stayed in the room since Jess, determined to find out who killed his brother and killing the murderer himself. The Bible plays an important part in the film, not just the physical Bible, but what's inside. And it isn't what Johnny thinks. I really liked this movie because of its interesting slant, and also, I don't know what it is, but I like George Raft. He normally stays in one range - he's dapper, he gets angry, he's tough -- and in this film, he's really tough. I mean, nobody gets to him, not even a blind man! One thing Raft had on screen was warmth, and here, you see Johnny's love for Jess, and his pain when his brother dies. The other thing about this movie that is wonderful is all the familiar faces - besides actors known primarily for films: Raft, Mayo, and Lockhart, we have TV star Burr, Harry Morgan (September Bride, Pete & Gladys, MASH), William Frawley (I Love Lucy), Victor Sen Young (Charlie Chan, Bonanza), Barton MacLane (I Dream of Jeannie), Arthur Franz, who was in everything, Philip Pine, who must have done every TV show ever, Ken Murray, known for his home movies of celebrities, Paul Frees, the \"Man of a Thousand Voices\" who was the voice of Boris on Rocky the Squirrel), Bob Jellison (Bobby the Bellboy when \"I Love Lucy\" was in Hollywood), and Marlon Brando's first wife Movita. Dmitri Tiomkin's music ranges from riffs on Ave Maria, Dies Irae, and some Tosca thrown in. Good movie.",
         "(Spoilers) It's when his kid brother US Army Chaplin Captain Jess Torno, Arthur Franz, was found shot at the hotel he was staying at that Johnny Torno, George Raft, owner of Torno Fraight Lines made it his first order of business to bring Jess' killer to justice. There was something that Jess with his last dying breath told Johnny who was at the murder scene that it's the bible in his hotel room, that disappeared from sight, that holds the answer to what happened and then kicked off for good. Determined to find Jess' murderer Johnny didn't realize that the person who was behind the crime was a lot closer to him at he could have ever imagined. As we all saw at the start of the movie Johnny's former book-keeper Rick Cherney played by a pre liposuction 300 plus pounds Raymond Burr, whom Johnny caught embezzling his business, who was behind Jess' murder. It was Cherney who hired ex-con Rocky, Harry Morgan, who was in the can, San Quentin Prison, together with him to gun Jess down as an act of revenge against Johnny. The big mystery in all this is what did Cherney use to pay Rocky to do the hit-job for him? In Cherney being dead broke, without a job or any other means of support, at the time to give Rocky the contract to knock off Jess? Looking for the Gideon Bible that was in the hotel-room with Jess at the time of his murder Johnny recruits pretty Carla North,Virginia Mayo, who needs the money and who was in the same hotel-room Jess was in after his death to track down anyone else who spent the night at hotel room #812 after Jess was killed and could have possibly taken the bible. Johnny's obsession with Jess' hotel bible gets more and more ridicules as the movie goes on in that it seemed to have some kinds of supernatural or Godly powers towards anyone who came in contact with it. The fact that everyone was stealing the bible from its rightful owner, the hotel, didn't seem to matter at all. All that mattered was that it changed the lives of those who stole it for the better even the hot headed and thug like Johnny Torno! As for Cherney he tries to and does, Johnny has a soft spot for him, to get his old job back at Johnny's freight lines trucking company. Which leads to Cherney getting the jump on Johnny's actions him in finding out who's his brother's killer. With everything going his way and as it turns out that Jess didn't implicated him in Jess' murder Cherney is still worried about Rocky, by not having any money to pay him off, fingering him for the crime. ****Major Major Spoiler*** This leads to one of the most outrageous and mind boggling scenes in the entire movie where after Cherney does Rocky in by throwing him off a speeding passenger train he, like Jason in the Friday the 13th movie series, comes back from the dead! With him barley alive and breathing Rocky after walking or staggering back to his hotel room, where both Johnny and Cherney as well as the police just happen to be at, miles from his accident site he's still able to finger Cherney as the person who paid him to do in Jess before he's finally, with a bullet from Cherney's gun, put out of his misery! This scene alone is worth the price of admission in not only having Rocky survived his near fatal accident but come back, black & blue with a number of broken bones ribs and a cracked skull, and be lucid enough to point Cherney out! And on top of all that with Cherney coincidentally just happening to be there and end up, after waiting for Rocky to point him out, not only kill him but also admit instead of keeping his mouth shut that he had paid Rocky to murder Jess! This reminded me of the Perry Mason TV series that Burr starred in where he-as defense attorney Perry Mason-had people admit to crimes that they by keeping quite could have easily gotten away with. In the end all turns out to be well and good in Johnny finally seeing the light and when he did have the chance not do in the fleeing Cherney a hesitant and Johnny instead let the supernatural or a bolt of electricity, as Jess advised him in the magic hotel Gideon Bible, do it for him. P.S Check out Johnny's and later Clara's Chinese house-boy at his San Francisco luxury suite Vincent played by former Charlie Chan's goofy #2 son Victor Sen Young.",
         "Red Light is directed by Roy Del Ruth and adapted to screenplay by George Callahan from the story This Guy Gideon written by Don Barry. It stars George Raft, Virginia Mayo, Raymond Burr, Harry Morgan and Gene Lockhart. Music is by Dimitri Tiomkin and cinematography by Bert Glennon. Something of an oddity, Red Light finds George Raft up to his neck in religion, revenge and a smouldering Virginia Mayo. After his brother, a chaplain, is murdered, he sets off to find the killer, whom can be identified by a message scrawled in a Gideon Bible. Find the Bible, find the killer. It is brought into the film noir sphere of things via Glennon's photography, which kicks in at the hour mark and runs concurrent with the murky thematics in the narrative, Frisco a rain sodden place of sleaze. Other than that it plays more as a crime drama, albeit one with some decidedly spicy killings and another top villain turn from Raymond Burr. Tiomkin's musical cues are strange and not always in sync with what is happening on screen, while the biblical hermeneutics and various plot contrivances irk rather than perk. See it for Burr and Glennon's work, or if you fancy a weird blend of noir and ethical religio redemptions! 6/10",
         "George Raft headlines this 1949 revenge noir. Raft plays the owner of a successful San Francisco trucking firm. His kid brother, US Army Chaplin Arthur Franz has just returned from service in the Pacific. Raft puts him up at a hotel till he gets settled in again. At the same time, Raymond Burr, a former book-keeper of Raft's is doing a bit in prison. Burr had helped himself to company funds but was caught. He of course blames Raft for his being jailed. When he finds out about Franz's return he quickly hatches a revenge scheme. His cell mate, Harry Morgan, is getting out of prison the next day. \"Could you do me a favor for some cash?\" Says Burr. Morgan is of course not adverse to some pocket money. Two days later, Morgan pays Franz a late night visit. He enters Franz's rooms and puts three slugs into him. Raft, arrives a short time later for a visit where he finds Franz still clinging to life. Raft asks who was the shooter but only gets some whispered words about the bible. Franz then expires. Raft returns to his office and starts loading his .45, he intends to find the killer and dispense some payback. Police Detectives, Barton MacLane and William Phillips soon come a calling. They wish to know if Franz had said anything before dying. Raft is not the least bit helpful in that department. The detectives tell Raft to back off and let them do their job. Raft can find out nothing on the deed and this just eats away at him. A week later, it dawns on him that maybe his brother meant he had written something in the hotel room bible. He bribes a hotel bellboy, Stanley Clements, to get him into the room. The bible has disappeared. Raft has Clements bring him a list of people who have stayed in the room since his brother. First up on the list is Virginia Mayo, a night club singer from Los Angeles. A quick trip to LA finds Miss Mayo. He tosses her apartment and finds a picture of several men in Army garb, including Franz. Mayo soon shows and Raft gives her the third degree. It turns out that Mayo's brother and Franz had been in the same unit in the Pacific. It was just a freak thing she had stayed in the same room as Franz. Mayo has just lost her job so Raft offers her one. Raft sets Mayo up in in his San Fran apartment. He wants her to hunt down the other names on his list of hotel guests for that room. Now Raymond Burr shows up just fresh out of prison. The first thing Raft does when he sees him, is work him over. Raft figures Burr had a motive for murdering Franz. Detectives Maclane and Phillips soon put a stop to the beating. They inform Raft that Burr has the perfect alibi. He was still in Prison when the murder happened. As Mayo tracks down the names on the list, Raft pays them all a visit. He quizzes them all about whether they took the bible from the hotel room. It is not till the last name, Phillip Pine, that he gets an affirmative. Pine is an Army vet who lost his sight in the service. He had checked into the room to kill himself. A hotel employee had talked him out of it. The man had then read to him out of the bible. Pine had taken the bible with him when he returned to his wife and family. Raft offers to buy the bible from Pine, but someone, Mayo, has already been there to grab the bible. Raft returns to his office to look for Mayo. While all this is going on, Burr has taken his prison buddy, Morgan for a train ride. Morgan has become a loose end that needs to be trimmed. A quick one, two and a shove off the back of the train, settles the matter. Burr has also been hanging around Raft's office asking for work. Burr says he has learnt from his prison stay and just wants a chance to prove he has changed. To cut to the quick, Morgan has survived his toss from the train. He staggers in from the rain to Raft's offices while Raft, Mayo and the Detectives, Maclane and Phillips are having a talk about the case. They are looking at the bible for clues. There is a passage Franz had circled in the bible. \"Vengeance is mine\" Outside Raft's office, on the hallway stairs, Burr and Morgan run into each other. Both pull their guns and start blasting. Burr, not wanting Morgan to spill about his part in Franz's murder, is the better shot and down goes Morgan again. When everyone rushes out of Raft's office to see what is happening, Burr points at Morgan. He tells them that Morgan was a burglar and Burr had shot him in self defense. Morgan is however one tough monkey, he moans and points at Burr. \"He paid me to kill your brother\u0085\" before he finally expires. Burr beats the feet for the roof exit with Raft and the Detectives in pursuit. Burr empties his revolver at Raft but misses. He then climbs up a big flashing neon sign to get to the next roof. He does not get far as he steps on some live electric wires. ZAP! Burr falls to the roof as Franz's words flash through Raft's mind. Vengeance is mine.",
         "This obscure crime drama/pseudo-noir, independently produced and directed by Roy Del Ruth for United Artists, is well worth a look. Figurative (and, later in life, literal) heavy Raymond Burr plays Nick Cherney, an embezzler doing time for ripping off his employer, shipping company boss Johnny Torno (George Raft). Nick's understandably cheesed off about his conviction, and asks fellow con Rocky (Henry Morgan) - who's being released before him - to serve Johnny a heaping helping of payback after he gets out of stir. The cooperative Rocky obliges by murdering Johnny's priest brother Jess (Arthur Franz), but Johnny isn't willing to take his sibling's death lying down - until he reads some marginalia in Jess's bible. Shot on location in beautiful Carmel, California, Red Light also features Virginia Mayo, Gene Lockhart, and William Frawley (who has an interesting telephone conversation about plumbing), first rate James Van Trees cinematography, and an original score by Dmitri Tiomkin.",
         "Bert Glennon's noirish photography is a stand-out in this one, a very interesting melodrama directed by Roy Del Ruth, who no doubt relied on Glennon to supply the movie's exciting visual flair. Alas, where the movie falls down is in George Callahan's none-too-credible screenplay which really writes itself out of the game with that preposterous denouement with the projectionist character played by Henry \"Harry\" Morgan. Oddly, we know we are in United Artists territory from the very first when the opening titles display an elaborate credit for D. Ross Lederman's second unit direction and his photographer, James Van Trees. Credits like these are usually buried in the small print of major studio titles or not supplied at all. Happily, all this second unit material is very hard to spot because it's so well integrated into the movie as a whole by editor, Richard Heermance. The credits also tell us that the assistant director on the 2nd unit was none other than Robert Aldrich. As if that were not enough in giving the screenplay an aura of credibility, the movie also features Ken Murray playing himself, plus a pretend National Movie News which gains further authenticity by being prepared by Ray Mercer himself and narrated by none other than Knox Manning! All this superb attention to detail was made possible by Roy Del Ruth, who not only directed but also produced for his own company, namely Roy Del Ruth Productions. It's a shame that despite all this careful attention to realistic detail, the screenplay adapted from the novel, \"That Guy Gideon\" by Donald Barry, just misses the bus. But all things considered, I'd still give it an \"8\".",
         "\"Red Lights\" doesn't really meet enough of the classic criteria to be called a true \"film noir.\" In reality, it's just a somewhat sappy revenge drama peppered with some unexpected moments of mad violence. Note how the plot wraps up nicely at the end, but not in the way George Raft's character would initially have hoped. Even the masterful composer Dmitri Tiomkin turns in a by-the-numbers performance, shoe-horning \"Ave Maria\" into the score every time a Bible or a priest is mentioned (as well as the \"Dies Irae\" in the death scenes). This is the only film I can think of where a Gideon Bible plays a primary role. It's also one of those 1940s flicks that is loaded with actors that were about to become household names through the medium of television: Wiliam Frawley (I Love Lucy, My Three Sons), Raymond Burr (Perry Mason, Ironside), Henry Morgan (Dragnet, December Bride, Pete and Gladys, M*A*S*H), and Victor Sen Young (already known through the Charlie Chan films, but soon to play Hop Sing on Bonanza). Also keep your eyes open for voice actor Paul Frees (Boris Badenov/Pillsbury Doughboy), who plays the hotel bellhop who's with George Raft when he discovers the body. It was one of Frees's first on-screen roles. Within a decade, he would give up film almost completely to concentrate on more lucrative voice work.",
         "George Raft (Johnny Torno) owns a trucking company. Because of his real-life gangster connections you can't help but think he's corrupt. Anyway, he seems to be playing a good guy who owns a trucking company. His army-decorated holy brother Arthur Franz (Jess) comes across as an annoying priest who is thankfully murdered at the beginning of the film and thus begins Mr Raft's campaign to dish out some revenge. His only clue is a bible that needs to be tracked down. The cast are good in this film, especially the bad guys Raymond Burr (Nick) and Harry Morgan (Rocky). George Raft plays himself and that's completely fine. The film throws you a curve ball at one point when Raft meets up with blind Phillip Pine (Pablo). We hit a sentimental streak and start groaning at the piousness of it all before Raft provides the funniest moment of the film which provides a superb counter-balance to what we have just heard. Raft gets straight to his point with a very frank \"have you got it or not?\" to Pine. It's brilliant. It's delivered in a way that suggests he has absolutely no time for the story that he has just been told, just like the audience can't be bothered with it. Priceless! I assume the lights in the final scene are red - it's a bit of a strange title for a black and white film.",
         "This is an Obscure Film-Noir that Should be Better Known because it is Certainly a Strange Brew of Religion, Revenge, and Noir. Brutal at Times the Film is Punctuated with Messages from the Bible and the Look is Acutely Dark and Shadowed with Iconic Flourishes. George Raft is at His One Note Best as He goes on a Man-Hunt Looking for the Killer of His Priest Brother. The Gideon Bible Itself is the McGuffin and Plays an Ending Twist of its Own. Raymond Burr is a Sleazy, Nasty and Violent Thug along with His Partner in Crime Henry Morgan (who was never dirtier). Although the Preaching at Times is a Heavy Load of Thumping it Never Quite goes Over the Top and Film-Noir Wins Out. A Couple of Times Raft Stops the Sermonizing with a Speech of His Own that Keeps Things where They Ought to be...\"Save that eyewash for your Sunday Sermon\". What a bit of Nastiness this is. Virginia Mayo doesn't do much Except Stand Around and Look Pretty, but the Rest of the Cast is in Top Noir Mode. It is a Grimy One that Deserves the Attention of Film-Noir Fans and Lovers of the Dark Side that Only these Low-Budget Movies could Pull Off. You Won't Find a Noir this Quirky or Bizarre. Note...Robert Aldridge is the second unit Director.",
         "This film was memorable in ways that the director probably didn't intend it to be. George Raft's performance is over the top, in a good way. He doesn't hold back his anger with the church yet shows his inner conflict by donating money and praying at the altar. That's the serious part. And Raymond Burr is seriously evil. But many other scenes cracked me up with laughter. All the scenes with the Bible, the guy who comes back after the train scene, and of course the ending which was spectacular in a hilarious way. The phrase \"24 hour Service\" will always remind me of this film... In fact, that should have been the title... This film is worth seeing because it is so unusual for a noir picture to combine the serious with the humor and the religious themes. And the cast has plenty of interesting characters....",
         "Businessman George Raft is out for blood after his priest brother is murdered. The brother's last words are about a bible so Raft scours the city searching for it, hoping it holds a clue to the identity of his brother's killer. Fine film noir with George Raft bringing a \"WB gangster from the '30s\" edge to things. It's a really good performance from tough guy Raft. This is about as sensitive as he gets on screen. He even cries in one scene. Great cast backing him up, including Gene Lockhart, Raymond Burr, Barton MacLane, and Harry Morgan. Virginia Mayo provides the lovely. Burr's a memorable heavy. Starts and ends well but middle drags some. Scene with the window washer is pretty cheesy stuff. Final scene is something of an eye-roller.",
         "No doubt Virginia Mayo is a classy, beautiful dramatic actress. In this film she plays a young woman named Carla North. Ms. North is attempting to make a living working the nightclub circuit going to where the jobs paid sufficiently to provide her food and shelter. By a series of of unfortunate but not related incidents the owner of a large freight company named Johnny Torno (played by George Raft) is trying to solve the mystery of a missing motel bible that his recently murdered brother while taking his last dying breath alludes to will solve who murdered him in that motel room. Johnny Torno then finds Carla North who happened to be in that same room shortly after his brothers murder. After eliminating Carla North as a suspect he engages her to work with him in finding out the current location of the other motel room customers who may have stolen the motel room bible that his brother said provides the only clue to his murder. So big brother Johnny ignores his freight company responsibilities and with the help of the motel bellhop and the beautiful Carla North finds out who subsequently rented that same motel room over the next week in an effort to find out who took that bible that is the key to solving his brothers mysterious death and murder. I am sure you noticed that I rated this film a dismal 3 out of 10. The 3 points are all attributed to the classy Virginia Mayo who plays Carla North, as well as to actor Raymond Burr who plays the recently released convict Nick Cherney. Cherney served his time in prison for fudging Johnny Torno's books and embezzling funds from the Torno Freight company. So the big burly bad convict Nick Cherney sought vengeance from Johnny Torno for putting him behind bars and what better way to seek vengeance than to have Johnny Torno's little priest brother whacked by his cellmate Rocky (Harry Morgan aka Dragnet's detective Bill Gannon) who was being released from prison before he was. This film noir is an okay time waster except for the fact that the so called male star of this film, Johnny Torno, played by the cardboard acting emotionless little George Raft kept sinking the film every time he opened his mouth and/or moved across the black and white screen with his hands stiffly held next to his hips as if he was a robot. Johnny Torno (George Raft) in my view was unable to portray on the screen the heartbroken older brother of a hero priest who survived five (5) years overseas serving in the war, only to be murdered and leaving his brother Johnny with a task to find his murderer and get even. There is one scene in a public washroom where Johnny Torno confronts the recently released convict Nick Cherney and commences to put a beating on him. Let's be real folks, George Raft stands a mere 5 foot 7 inches tall and weighs maybe a generous 135 pounds. The convict that Johhny Torno is supposed to be laying a beating on Nick Cherney, is played by the burly Raymond Burr who at the time, stood at least 6 feet tall and 250 pounds. This is just another example of how poorly cast George Raft was in the leading role of Johnny Torno. The Red Light title was merely used as a result of the very recent huge success that was ALL Virgina Mayo's for starring in the earlier 1949 release of another film noir titled \"White Heat\" which starred a real action/drama star in James Cagney. As of my writing this review, the 1949 Red Light film received an average IMDB rating of 6.4 by only 610 IMDB users. As for the much more critically acclaimed and earlier 1949 film release \"White Heat\" has received a much higher average IMDB rating of 8.2 . The key here is that this higher 8.2 rating of \"White Heat\" is attributed to a whopping average of 22,696 IMDB viewers, compared to only 610 IMDB user ratings for red Light. A title can help a film but it is the stars who will actually make a movie great as was the case with White Heat and compartively mediocre (at best) as is the case with this film noir Red Light. It is unfortunate that the attractive and good performance of Virginia Mayo was assigned to work with one of the worst actors of the time period, that being the short cardboard acting of George Raft. Sorry, but I call them like I see them. I give this film a 3 out of 10 rating.",
         "Red Light is an independent production released by United Artists and starring George Raft as a man on a mission. Raft plays the self made successful head of a trucking operation who is used to taking care of business himself. But when his younger brother who is a priest and an army chaplain from the late war played by Arthur Franz is shot in a hotel room, Raft is going to deal with killers himself and not let it be handled by the police in the persons of Barton MacLane and Bill Phipps. Before checking out of this mortal coil, Franz said he wrote something in the hotel Gideon Bible for Raft. But the book from that particular room has been stolen and Raft spends most of the film trying to locate it with the help of Virginia Mayo. There's not much suspense in this film mainly because Raymond Burr who was a former employee sent to prison for embezzlement is acting so guilty. He does have an ironclad alibi however, but you know it will be broken. Whatever suspense is in the how. The other suspenseful component of this sub par noir film is what will Raft do when he does learn the truth. What he gets from the bible are some eternal truths, but what he seeks comes out in its own way. Besides the players mentioned such folks as Gene Lockhart, Stanley Clements, William Frawley, Harry Morgan, and Arthur Shields are all in Red Light. The film had the potential to be a lot more, but Raft just doesn't carry it off right.",
         "I'm not all that familiar with director Roy Del Ruth, but this was a surprisingly solid little film noir. George Raft's brother is murdered, but left a clue as to the identity of his killer in a Gideon Bible, the MacGuffin of the piece, which Raft spends most of the film trying to locate. There's a fine cast for a low budget crime picture, which includes the under appreciated Virginia Mayo, along with Gene Lockhart, Raymond Burr, William Frawley, and Henry Morgan (who nearly steals the picture with his villainous phychotic supporting role). Del Ruth directs this film noir with a fair amount of visual style, which was the main reason for holding my interest. Dimitri Tiomkin provided the score. Overall, the film isn't all that original, but it has a strong cast and solid direction, which makes it a must see for fans of film noir. FUN FACT! I recently learned that star Raft was a functional illiterate who had to have his scripts read to him by others.",
         "I'm not all that familiar with director Roy Del Ruth, but this was a surprisingly solid little film noir. George Raft's brother is murdered, but left a clue as to the identity of his killer in a Gideon Bible, the MacGuffin of the piece, which Raft spends most of the film trying to locate. There's a fine cast for a low budget crime picture, which includes the under appreciated Virginia Mayo, along with Gene Lockhart, Raymond Burr, and Henry Morgan (who nearly steals the picture with his villainous phychotic supporting role). Overall, the film isn't all that original, but it has a strong cast and solid direction, which makes it a must see for fans of film noir.",
         "First of all, we all agree that George Raft was wooden and didn't have a clue what a good script looked like. He did turn down CASABLANCA, MALTESE FALCON and DOUBLE INDEMNITY. But this script produced and directed by Roy Del Ruth is bottom of the barrel. How Virginia mayo ever got tied up to this production is a mystery. A waste of her time and effort especially since she was in a flurry of excellent films like WHITE HEAT and Colorado TERRITORY. At least Raymond Burr and Henry Morgan bring some life to the proceedings. Dmitri Tiomkin's score hammers home every scene like a sledge hammer. He makes Max Steiner look subtle. He uses Ave Maria to the point of nausea. I can't imagine how this film could appeal to many folks looking for a good suspenseful film noir. A tepid try not worth your time.",
         "This film had a few interesting noir-like scenes, but overall it was a stinker. (Lots of spoilers coming, see other reviews for plot summary.) First of all, the scene in the washroom where George Raft knocks Burr to the floor was ridiculous. I'm sure Burr, who must have weighed twice as much as Raft, could have demolished him with a couple of punches. Then Virginia Mayo is a suspect by Raft in the murder of Raft's priest brother Jess who has returned from a prison camp overseas. Mayo stayed in the same hotel room as Jess and maybe took the Bible from the room (product placement for Gideon Bibles). It contains an important clue to Jess's killing. Mayo doesn't have the Bible, but instead has a photo of Jess, because her now-dead brother was in the military with Raft's brother. What are the chances of this happening? She says that Jess sent her the photo and her brother's effects. It would have made more sense if she had come to the hotel to meet with Jess, who was on his way to his new parish, and picked up the photo and other stuff, and she ended up getting Jess's room (though she still didn't take the Bible). Then there is the scene with soldier Philip Pine, who did take the Bible. Having become blind, he is depressed and is about to blow his brains out in the hotel room (where the Bible is), and then this guy suddenly appears at the window. What is this guy doing, running up and down the fire escapes in the hotel or around the hotel ledges looking for people about to commit suicide? What about the scene where Gene Lockhart is hiding under the truck and Burr kicks out the blocks which are holding the truck up? The whole truck suddenly crushes Lockhart ... but isn't the truck partially held up by the tires? Duh! At the end, Harry Morgan shows up at Raft's office just as Burr is on his way out and fingers him as the killer. Another wacky coincidence: what are the chances of this happening, that the two of them will run into each other at the office, or that Morgan survived the fall from the back of the train where Burr pushed him off? The score by Dimitri Tiomkin, was crap, aside from the fact that it cribbed passages from several famous classical works including Beethove's Eroica Symphony.",
         "I thinks this film stinks, right from the opening titles dominated by a dreadful derivative score from Dmitri Tiomkin. Did nobody tell him that the Gregorian chants for the Mass for the Dead are so nineteenth century? Or that Berlioz and Liszt flogged it death (so to speak) a hundred years before? And as for that Ave Maria stuff, it's just sick-making. Barf. I was going to give this tripe three out of ten, but then I recalled Raymond Burr as a pretty good bad guy and upped it to five. He is the sole redeeming feature of this very poor movie. (Is it a spoiler to say Raymond Burr plays a bad guy in this? I'm assuming not, he was making a career out of such roles by then). But as for George Raft... oh dear oh dear. How did a no-talent bum like that ever make it in the movie business? Is he even slightly credible in any of the roles he plays? The day before watching this I saw Background to Danger (1943) and I thought to myself is this guy always this bad? Now that's another poor film almost redeemed by the top notch supporting cast (Lorre, Greenstreet), but the dead weight of Mr Raft is just too much for them to carry. As I said on one of the message boards, the fairies at the bottom of my garden would eat this so-called tough guy up for breakfast and then call for their porridge. The saccharine ending had me reaching for the sick-bag too. I can't blame that on Mr Raft, that's solely down to the production team. Unless you're a Raymond Burr fan, this film is just a waste of time."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Roy Del Ruth Productions"],
      "summaries": [
         "Nick Cherney, in prison for embezzling from Torno Freight Co., sees a chance to get back at John Torno through his young priest brother Jess. He pays fellow prisoner Rocky, who gets out a week before Nick, to murder Jess...who, dying, tells revenge-minded John that he'd written a clue \"in the Bible.\" Frustrated, John obsessively searches for the missing Gideon Bible from Jess's hotel room. Meanwhile, Nick himself gets out with murder still in his heart. But another factor is in play that none of them (except the murdered Jess) had planned on.",
         "Nick Cherney, a trusted employee, embezzles funds from trucking-company owner John Torno, and is sent to prison. Seeking revenge, he pays Rocky, another convict about to be released, to kill John's brother Jess, an army-chaplain priest just returned from Pacific war duty. Jess, shot in a hotel room, dies in the arms of his brother, gasping that the answer to his killing lies in the Bible. Torno, finally realizing that Jess meant the Gideon Bible which had been in his hotel room, but has disappeared, sets out to find the Bible and the killer and avenge his brother's death.",
         "The former employee of a trucking company, currently in prison for embezzling the company, plans his eventual revenge against his former boss."
      ],
      "budget": 0
   },
   "movielensId": 124472,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-09-30",
      "dvdReleaseDate": null,
      "directors": ["Roy Del Ruth"],
      "runtime": 83,
      "movieId": 124472,
      "title": "Red Light",
      "mpaa": "",
      "actors": [
         "George Raft",
         "Virginia Mayo",
         "Gene Lockhart",
         "Raymond Burr",
         "Harry Morgan",
         "Barton MacLane",
         "Arthur Franz",
         "Ken Murray",
         "Stanley Clements",
         "William Frawley",
         "Arthur Shields",
         "Frank Orth",
         "Phillip Pine",
         "William 'Bill' Phillips",
         "Movita",
         "Victor Sen Yung",
         "Claire Carleton"
      ],
      "imdbMovieId": "0041790",
      "originalTitle": "Red Light",
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Nick Cherney, in prison for embezzling from Torno Freight Co., sees a chance to get back at Johnny Torno through his young priest brother Jess. He pays fellow prisoner Rocky, who gets out a week before Nick, to murder Jess... who, dying, tells revenge-minded Johnny that he'd written a clue \"in the Bible.\" Frustrated, Johnny obsessively searches for the missing Gideon Bible from Jess's hotel room.",
      "tmdbMovieId": 25807,
      "avgRating": 2.83333,
      "releaseYear": "1949",
      "numRatings": 3,
      "posterPath": "/27FZyHLFMbj84rR7ECp1e9RetPM.jpg"
   }
}