{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "samurai",
            "id": 1462
         },
         {
            "name": "baking",
            "id": 182282
         }
      ],
      "imdb_id": "tt1595354",
      "video": false,
      "title": "A Boy and His Samurai",
      "recommendations": [
         15284,
         45505,
         20528,
         26576,
         46911,
         45967,
         104289,
         114816,
         55382,
         64882,
         56661,
         64897,
         2644,
         44785,
         55884,
         20527,
         81792,
         102227,
         220176
      ],
      "backdrop_path": "/1WnDjbM92cvouac6wDcyjwfpADp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kijima Yasube",
               "gender": 2,
               "credit_id": "52fe465ec3a368484e08cd23",
               "name": "Ryo Nishikido",
               "profile_path": "/4Y7chk6dePOlwVe2xIzuqqf2c6A.jpg",
               "id": 125950,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hiroko Yusa",
               "gender": 0,
               "credit_id": "52fe465ec3a368484e08cd27",
               "name": "Rie Tomosaka",
               "profile_path": "/xJcEBALn9QhgwwDKnlJEYbniH1V.jpg",
               "id": 233520,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tomoya Yusa",
               "gender": 0,
               "credit_id": "52fe465ec3a368484e08cd2b",
               "name": "Fuku Suzuki",
               "profile_path": "/eSy9IJyaqyPQ6L9RYwdXnhY6EMv.jpg",
               "id": 233521,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tanaka",
               "gender": 2,
               "credit_id": "52fe465ec3a368484e08cd2f",
               "name": "Hiroki Konno",
               "profile_path": "/5zlR4OFVHx3orX6K9STG2FMlk08.jpg",
               "id": 233522,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Shirozaki",
               "gender": 0,
               "credit_id": "52fe465ec3a368484e08cd33",
               "name": "Keisuke Horibe",
               "profile_path": "/kq0Be6AdFocasnkqGfBIVtDNqnj.jpg",
               "id": 233523,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Yoshie Hiraishi",
               "gender": 1,
               "credit_id": "52fe465ec3a368484e08cd49",
               "name": "Hitomi Satô",
               "profile_path": "/ghGh2wiQTivTcADNJMJ6PTecZJg.jpg",
               "id": 27780,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "52fe465ec3a368484e08cd4d",
               "name": "Shiori Kutsuna",
               "profile_path": "/fVNJA9OmU4ALDDFiJkmIg20SJGy.jpg",
               "id": 230660,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 2,
               "credit_id": "52fe465ec3a368484e08cd51",
               "name": "Jun Inoue",
               "profile_path": "/qWHzexyAszNPFWsYtczk85KBVzz.jpg",
               "id": 1030338,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 0,
               "credit_id": "52fe465ec3a368484e08cd55",
               "name": "Yûji Nakamura",
               "profile_path": null,
               "id": 1135434,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe465ec3a368484e08cd39",
               "name": "Yoshihiro Nakamura",
               "profile_path": "/thBczkN1WMvrVh9TIYyPrFO5IH2.jpg",
               "id": 71640,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe465ec3a368484e08cd3f",
               "name": "Yoshihiro Nakamura",
               "profile_path": "/thBczkN1WMvrVh9TIYyPrFO5IH2.jpg",
               "id": 71640,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe465ec3a368484e08cd45",
               "name": "Gen Araki",
               "profile_path": null,
               "id": 233525,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.167851,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 61682,
      "vote_count": 9,
      "budget": 0,
      "overview": "A samurai from the Edo Period time travels to present day Japan where he meets a divorcee and her son.  Soon, he discovers a passion for making pastries.",
      "similar": [
         58857,
         64686,
         616,
         11878,
         14537,
         221732,
         346,
         24,
         826,
         16859,
         68730,
         153,
         227306,
         399174,
         324786,
         1904,
         36586,
         8392,
         51739,
         667
      ],
      "original_title": "ちょんまげぷりん",
      "runtime": 108,
      "poster_path": "/hIwFkTKpcn9KmQrsnHNEl6yX4M9.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "2010-07-31",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yoshihiro Nakamura"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Yoshihiro Nakamura",
         "Gen Araki"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1595354/",
      "coverLink": null,
      "actors": [
         "Ryô Nishikido",
         "Fuku Suzuki",
         "Rie Tomosaka"
      ],
      "reviews": [
         "Just very occasionally films come along that are as like this - it's not great cinema in its exposé or use of film, it's not acting that deserves awards, but is is an immensely charming, delightful and unique romantic comedy of the very, very best sort. The story is simple: a child and mother see a man dressed in Samurai clothing. It turns out he is from another age. The cultures learn from each other, and the fun ensues. Big deal you say? Well, for this viewer, this is a combination of that great Japanese comedy, Tampopo, and France's most successful film ever, Les Visiteurs (without the manic). It wins by reaching out and touching both the heart and the soul - it has many small touches that are simply fun, funny, and genuinely moving. While I don't want to oversell it I reckon to see a film that is just simply this enjoyable once a year if that - just great straightforward romantic comedy that just grows and grows. The only shame is that so few will get to see or know about it - if you get a chance to see it, do, it kind of worth it.",
         "A Boy and His Samurai is a perfect example of how to blend comedy, drama and emotions all into one mixture of a delicious cake. This film has a rare and unique quality that captures the audience attention from the beginning to the very end. In the midst of the film, it also have the ability to make you laugh, cry little and finishes off with a bittersweet smile. In essence this is a movie made for kids, but also an enjoyable film for adults to watch together. This is the kind of movie that Ninja Kids!!! fails to be and should have been. Putting in a Samurai of the 1800s Edo period into modern day Tokyo is a smart idea, but full credit must go to the entire likable cast of Ryo Nishikido, Rie Tomosaka and Fuku Suzuki. In particular Fuku Suzuki steals the show with steady child cuteness and the trio (Nishikido and Tomosaka) plays off each other with chemistry and fun. All in all, A Boy and His Samurai is one of those films that allows the audience to enjoy the experience, laugh together, carefree, light-hearted and engages the audience at an emotional level. It is a rare quality and the pacing is much faster than most Japanese movies. In doing so, A Boy and His Samurai is fast becoming a contender as the most enjoyable movie at the 15th Japanese Film Festival. A must see. Neo rates it 8.5/10. www.thehkneo.com",
         "Divorcée Hiroko (Rie Tomosaka) struggles with work-life balance issues as she tries to raise her son Tomoya (Fuku Suzuki) single-handedly while holding down a full-time job. It is a very Japanese divorce - Dad is completely out of the picture. Salvation arrives in the unlikely form of Edo-era samurai Yasubei (Ryo Nishikikido) mystically transported to the present day. In need of food and shelter, he discovers the culinary delights of puddings and desserts. A deal is hatched whereby he devotes himself to household chores in return for food and lodging, allowing Hiroko to forge ahead in her career. However, Yasubei's growing patisserie talents will bring tension to the deal. Tomosaka and Nishikikido do decent work as the star-crossed (potential) lovers, Tomosaka in particular carrying the world weariness of a single mum worn down by the barbs from work colleagues. Some interesting thematic elements are hinted at here: the samurai finds the notion of a working woman and single mum incomprehensible, but adapts in a way that foreshadows the transformation of Meiji-era samurai. Tomosaka remarkably divorces her husband because he was an unreformed male - and yet finds a suitable replacement in a samurai, the embodiment of patriarchal ideals. This could all make for some insightful comment on contemporary Japan and gender roles, but these strands remain unmined as the film follows predictable lines by having Yasubei enter a cake-baking contest, with the ill-prepared Tomoya by his side. Despite one cute scene with white chocolate transformed to snow, the interpersonal relationships, notions of displacement, role, and work-life balance are all under-realised in the end. Quite simply, the film builds up nicely, but by the second half I was looking at my watch. Yasubei never stops to take stock of the Japan he has lost, and the new Japan he finds thrust upon him. Hiroko, similarly, never has to reflect on the fact that she has entrusted the parenting of her son to a sword-wielding bigot. Perhaps such thoughts would have taken the film too far from the generic fare it strives to be. A pity, as Chonmage Purin gives up a few chuckles along the way, and the strong cast look like they could have handled more challenging fare.",
         "This was a sweet well done movie. Like one person said, it is a shame not many people will see it because it has subtitles and not well known. The clash of culture values is not \"bigot\" as another viewer said. The clash is the fuel for humor. It was a beautiful movie done with no cgi. I almost passed it up because there were no special effects. Don't make the same mistake I almost made."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Dub",
         "Smoke"
      ],
      "summaries": ["Kidzhima Yasube, the Samurai of the period Edo, is postponed to 180 years ahead to Japan of our days. There he meets the divorced woman Hiroko and her son Tomoyey. She invites Yasube to herself to live, and for food and a lodging for the night asks it to help about the house. The former Samurai begins to cook cakes for Toma and thanks to them becomes the famous confectioner. The relations between this Trinity become more and more warm, but day when they have to say goodbye with each other, already not far off ."],
      "budget": 0
   },
   "movielensId": 124577,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2010-07-31",
      "dvdReleaseDate": null,
      "directors": ["Yoshihiro Nakamura"],
      "runtime": 108,
      "movieId": 124577,
      "title": "A Boy and His Samurai",
      "mpaa": null,
      "actors": [
         "Ryo Nishikido",
         "Rie Tomosaka",
         "Fuku Suzuki",
         "Hiroki Konno",
         "Keisuke Horibe",
         "Hitomi Satô",
         "Shiori Kutsuna",
         "Jun Inoue",
         "Yûji Nakamura"
      ],
      "imdbMovieId": "1595354",
      "originalTitle": "ちょんまげぷりん",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A samurai from the Edo Period time travels to present day Japan where he meets a divorcee and her son.  Soon, he discovers a passion for making pastries.",
      "tmdbMovieId": 61682,
      "avgRating": 3.5,
      "releaseYear": "2010",
      "numRatings": 3,
      "posterPath": "/hIwFkTKpcn9KmQrsnHNEl6yX4M9.jpg"
   }
}