{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "pharmaceutical industry",
            "id": 6135
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "series of murders",
            "id": 14676
         },
         {
            "name": "female detective",
            "id": 160342
         }
      ],
      "imdb_id": "tt0246332",
      "video": false,
      "title": "Slow Burn",
      "recommendations": [],
      "backdrop_path": "/1mG0Z7zlGHaqdU2ts944S0ULkry.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Detective Della Wilder",
               "gender": 1,
               "credit_id": "52fe4631c3a368484e083b6b",
               "name": "Pam Grier",
               "profile_path": "/k4oITsTAfhmYICLkFBvgotnEcpU.jpg",
               "id": 2230,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Sam Dennis Charney",
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083b6f",
               "name": "Rutger Hauer",
               "profile_path": "/2x1S2VAUvZXZuDjZ4E9iEKINvNu.jpg",
               "id": 585,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Detective Harlan Lee",
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083b73",
               "name": "Romano Orzari",
               "profile_path": "/eKvEVVIpk33ftiNkXGZ8fBWVEs.jpg",
               "id": 96591,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sophie Gorka",
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083b77",
               "name": "Simone-Elise Girard",
               "profile_path": "/vbcBnjbklC47qkYDShRtdXqpjzV.jpg",
               "id": 87460,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Captain Jerry Crandall",
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083bbd",
               "name": "John Dunn-Hill",
               "profile_path": "/bP61W9unS9EzRPAFXtXsensJOMi.jpg",
               "id": 218899,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Attorney Marlowe King",
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083bc1",
               "name": "Eugene Clark",
               "profile_path": "/v1iJYDA4vUWZhef9GE38US43zEB.jpg",
               "id": 61660,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Walker Grimes",
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083bc5",
               "name": "Serge Houde",
               "profile_path": "/ihnfayL0UZZicYeOZMPgpelATi4.jpg",
               "id": 41746,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Ricky Harwell",
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083bc9",
               "name": "Richard Robitaille",
               "profile_path": null,
               "id": 207823,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Harry Perl",
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083bcd",
               "name": "Frank Schorpion",
               "profile_path": "/6o1Omez4dGsiZ62dfH9WHtorR0C.jpg",
               "id": 135993,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Lisa Sears",
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083bd1",
               "name": "Sasha Dominique",
               "profile_path": null,
               "id": 949759,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083b7d",
               "name": "Rodney Gibbons",
               "profile_path": null,
               "id": 56983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083b83",
               "name": "Terry Abrahamson",
               "profile_path": null,
               "id": 944948,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083b89",
               "name": "Netaya Anbar",
               "profile_path": null,
               "id": 932110,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4631c3a368484e083b8f",
               "name": "Shimon Dotan",
               "profile_path": null,
               "id": 147953,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083b95",
               "name": "Renaud Mathieu",
               "profile_path": null,
               "id": 1116039,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083b9b",
               "name": "Pierre Rene",
               "profile_path": null,
               "id": 1116040,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083ba1",
               "name": "Alfred Sapse",
               "profile_path": null,
               "id": 21408,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083ba7",
               "name": "Ernst Etchie Stroh",
               "profile_path": null,
               "id": 20639,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083bad",
               "name": "Michel Corriveau",
               "profile_path": null,
               "id": 32875,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083bb3",
               "name": "Robert Marchaud",
               "profile_path": null,
               "id": 1116041,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4631c3a368484e083bb9",
               "name": "Bert Tougas",
               "profile_path": null,
               "id": 1116042,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.047928,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 60703,
      "vote_count": 1,
      "budget": 0,
      "overview": "The murder of the ex-wife of Doctor Sam Charney (Rutger Hauer) leads Detective Della Wilder (Pam Grier) to uncover a series of women's murders somehow linked to a big pharmaceutical company.",
      "similar": [
         984,
         8090,
         10900,
         12150,
         4771,
         75780,
         807,
         1939,
         2142,
         1923,
         21484,
         9411,
         10651,
         11423,
         18587,
         4639,
         15069,
         949,
         1586,
         2832
      ],
      "original_title": "Slow Burn",
      "runtime": 90,
      "poster_path": "/1akcgQvsQKurUjWsnkOt1dqyZHx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2000-11-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Her first suspect is her only hope for survival.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rodney Gibbons"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Terry Abrahamson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0246332/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTczNDYxNzMzOF5BMl5BanBnXkFtZTcwNTkxNTAzMQ@@._V1_UY268_CR13,0,182,268_AL_.jpg",
      "actors": [
         "Pam Grier",
         "Rutger Hauer",
         "Romano Orzari"
      ],
      "reviews": [
         "As soon as I picked this one of off the shelf warnings were going off in my head (\"Bad movie alert! Danger! Danger!). Call me ridiculously optimistic, or just plain dumb, but I still rented it just the same. Seventies blaxploitation icon Pam Grier ('Coffy', 'The Big Doll House', 'Jackie Brown',etc.) is a favourite of mine, as is Rutger Hauer ('Blade Runner', 'Flesh & Blood', 'Salute Of The Jugger'), and the prospect of seeing them act together was just too much for me to ignore. The packaging made this look like another tired serial killer \"thriller\", the kind that should star Michael Madsen or Eric Roberts or James Russo or Chris Penn and go straight to video. But it is in fact even less interesting than that. The movie quickly degenerates into a lame conspiracy mystery, and smells very much like a failed TV pilot. Grier plays a one dimensional sassy cop, Hauer a very dull Doctor who is initially her leading suspect. The chemistry between the two is zilch, and my goodwill towards both performers is still not enough to forgive this absolutely awful waste of time. I'm straining myself trying to think of anything it all about it to recommend viewing it, but coming up with a big fat zero. Avoid this one at all costs.",
         "The movie clearly cashes in on Pam Grier's success with Jackie Brown. Again the main characters are two \"old timers\" who have their wild days of youth behind them. Instead of Robert Forster we have action veteran Rutger Hauer who seems to enjoy the part of a romantically inclined womanizing gynaecologist. Pam Grier as energetic police officer Wilder is great as always. This time she does not have a brother or a sister to protect but her two kids. Contrary to other comments I think the Grier character's troubles with her neighbours fit in well and help the story along. Grier and Hauer make a good, harmonious and quite likeable couple. Wilder is no masterpiece, it does not show any of Tarantino's sophistication. The story - Grier investigates the murders of young women, Hauer is at first the prime suspect - becomes somehow too drab and serious for this kind of movie which is more a comedy than a drama. However, there are some good scenes and good acting performances, especially Richard Robitaille as an ambitious, overexcited salesman for a pharmaceutical company. All in all I should say this is good, solid entertainment for people over age 35.",
         "What bothers me in films like this is not the things that don't work in it. It's the thing that could have been done. It's not so much the visual lack of power and effectiveness of it, but the total mental poverty that surrounds it. They picked up two mildly interesting actors, with credits on their hands and assigned them to this total mess, relying that the fact that they're in makes the whole think work on the financial side. This is a total mess, a weak story, about some honest people fighting pharmaceutical interests, against all odds, the 'Fugitive' type. Pam Grier is assigned the extra role of being her past roles, associated with racial concerns and feminism. Both she and Hauer are cashing their checks. They could be doing better things. Trying to get away with such a film is as much a deceit as it is the radioactive tests in the film. My opinion: 1/5 http://www.7eyes.wordpress.com",
         "Rutger Hauer has Blade Runner money and Pam Grier should be doing just fine after Jackie Brown or even Foxy Brown, what are both of these two actors doing in this little project. While I hate to overuse the phrase that, \"They just needed the paycheck\", films like Wilder leave me no room for imagination or wonder. They had to just need some extra cash to spend with their children or pay their rent. Why would they attach their names to this film? From the opening credit sequence to the final moments that were meant to shake the bowels of justice in the comfort of your own home, Wilder proved that everything in-between was not as sweet as an Oreo cookie, but instead a murky lifeless substance that should have been left alone instead of released on DVD. There was nothing redeemable about this film. The sound was horrible, the acting seemed forced and honestly, non-existent, and the story was too big for its britches. Normally, I can ramble off at least one good element about the film that I just watched, but sadly, I cannot think of anything nice to say about Wilder. From the beginning it began imploding and falling apart at the edges, and it didn't stop until the final credits rolled. The sound is a small, yet large element to a film. It gives us that extra punch in a finale, or an extra tear during a sad moment, or those dastardly violins that always seem to shrill whenever someone enters the room. Either way you see it, or hear it in this case, music pushes a film to a new level. So, when a film either chooses to use poor sound or no sound at all, you have to wonder why? Is it because the characters are the central focus and the silence symbolically adds to their meaning? Or is it because the production value was so low that Little Timmy from down the street was paid minimum wage to give a film \u0085 oh, let's say \u0085 Wilder a bit of noise in the background. I didn't hear music in this film, I heard recycled garbage going through the system. There was nothing prominent or distinguishable about the score of this film. Drunken monkeys with guitars could do better. It felt as if it was rushed together at the last moment, completely defacing an already troubled film. I talk about the music first in this review because when the acting is poor, sometimes you can overcompensate with a decent score. That was not the case here. Since the sound was poor, I found myself listening to the actors longer than I should have. I have never witnessed a complete lack of emotion and care as I did with Hauer and Grier. They need to stop now and go down in the history books for what they have accomplished already, not erased from the books for what they are currently attaching their names to. Grier attempts hard to be that strong female lead character that teeters on feminism and violence to help her find the answer the she seeks. That is a tough concept, and Grier never gets it. She constantly goes in and out of character, giving us something new and fresh each scene that she does. There was no consistency, no solid character, no emotion at all. Grier read her lines and walked the paces and that was it. The same can be said for Hauer. He was even worse than Grier in the fact that his acting felt fake and directed. I am not supposed to be reminded by the actors that I am watching a movie, I want to be entertained. Take me to a place I have never been, not a reminder that I am on my couch in the middle of the night. If they were handing out imagination and enthusiasm at the beginning of this film, Grier and Hauer must have missed the bandwagon. They were horrible. You could just see the director's suggestions playing out in Grier's head, like counting out loud. While she was focusing on that, she completely missed her character. Finally, the chemistry between Hauer and Grier was one of the worst combinations Hollywood has created. They were never meant to be together and this film only proved it. It was obvious from the beginning that they were not happy to be together, and we were not happy to be spending two hours with them. On both parts, it was a match made in hell. Poor sound, flimsy acting \u0085 what else could go wrong? How about a story that literally made no sense. I am not one to completely knock the writing of another (well, maybe I am) because of the hard work someone had to put into the finished product, but in the case of Wilder it was nothing but disaster. Nothing worked, nothing made sense, the actors were being lead on a blind ghost chase that somehow forced a conclusion on us all by showing us details that we may have missed earlier because we were falling asleep. There were just too many avenues to cross in this film that did not have the budget to cross them all. I also think that this final cut lost some of the momentum in the final cut. You could tell scenes that just seemed spliced together because they were incoherent and jumbled. We were moving all over the screen like a chicken without a head. Thankfully the final credits were there to put us out of our misery. Overall, this was bad. The overwhelming story with low budgeting lead to horrible acting and miscasting by both Grier and Hauer, which lead to some bad music vomiting from my speakers, which ultimately lead to a straight to DVD release of this film. Grade: * out of *****",
         "Do you see that DVD cover on the IMDb page for \"Wilder\"? You know, the one with a police car being blown up, Rutger Hauer carrying a gun and Pam Grier carrying TWO guns? Well, it's pretty misleading: there are no car chases or explosions in this movie, Pam fires only one shot, and Hauer none at all. This is much more of a conspiracy thriller than an action picture, which may be a source of disappointment for some. But even if you can live with that, the story is pretty muddled, the direction lacks style, and the supporting cast (with the exception of Eugene Clark) is mediocre. Rutger Hauer is OK, but it's really Pam Grier who provides the main reason to see this movie. She's still beautiful at 51, and the fleeting glimpses of her past ass-kicking glory are great. Too bad they're just that: fleeting. (**)",
         "Considering the cast, and the big corporation against the people story line, the makings of a decent movie were all there. Pam Grier is investigating a series of murder's and links Rutger Huauers character to them, as he's connected to one of them by way of a jilted and bitter romance. He also happened to give her professional advice (He's a Dr) that turned out to be less than life saving. His best friend also works for a big chemical company edging for promotion working within 'the womens medical' dept. All this coupled with the fact that a man resembling Hauer was seen leaving the crime scene. Pam visits the good Dr to see if she can jog his memory and the two end up getting along very well. Its at this point everything starts to fall apart, the film tries to be too complicated, and Griers script requires her to spell everything out for the viewer, but instead of helping coast the story line along, her role in fact stilts the films proceedings, making everything seem slow and boring. Hauer as usual, plays his part perfectly well, but doesn't have the necessary bulk to his role to really do anything other than plod along with the whole dull affair. Basically, the script strives too far into what really should have been quite a simple, enjoyable film. If your the kind of person intent on seeing this because your obsessed by seeing everything ever filmed by Grier or Hauer (and you know who you are)then you'll be mildly disappointed, everyone else steer well clear of 'Wilder'.",
         "*This review contains miner spoilers* As time goes by, people look to the past decades and usually laugh. They laugh at the clothes that were worn, the lingo that was used, the music that was popular, and the dances that were performed. They also look (and often laugh) at the style of movies. Few decades seem to get more flak than the 70's (though there has been a recent surge of 80's bashing, something I am not very fond of since I liked the 80's). Cinema of the 70's pretty much belonged to gritty cop thrillers brought on by the likes of the Dirty Harry and Shaft and many of their clones. Some of these were good movies with things that make you chuckle in retrospect. However, the recent remake of `Shaft' should have taught us that making a throwback to the past set in the present is not a good idea and `Wilder,' made in the same year, is more proof. Few actresses can be associated with the 70's as much as Pam Grier, the title character of this movie. Detective Della Wilder and her partner, Harland Lee (Romano Orzari), are pretty tough cookies working the streets. They are good cops, despite Wilder's regular bending of the rules that gets her in hot water with her boss. They get assigned the case where a woman was strangled and her body about to be taken away when the killer was interrupted. The main suspect is a doctor (Rutger Hauer), the former lover of the victim. As Wilder, certain of the doctor's guilt, begins heavily interrogating him, a second murder occurs and evidence starts to show up that it is not the simple work of a serial killer. Instead, Wilder discovers that the two murders, along with numerous disappearances, are linked to an experimental drug administered by a pharmaceutical company, and that this company has some dangerous political connections. While Grier and the story are pretty good, there is a lot about `Wilder' I did not like. For one, the movie's twists aren't very exciting. A twist is revealed and it leaves very little affect on you. It is also strange how Wilder's tough persona warms up to Hauer's character's very blunt passes. There is also a really terrible, unneeded subplot involving Wilder's quarrelling with her rude and abusive neighbor. But the worst stuff about `Wilder' is Gibbon's 70's frame of mind. His style just isn't very fun to watch. He does things like pepper the whole movie with 70's-like music that feels incredibly wrong. He also does annoying transition tricks like freeze-framing the end moment of a scene for a few seconds before moving to the next scene. That's very awkward, but not quite as awkward as an editing trick of splicing different takes of the same scene together. It looks so disjointed and wrong, like no individual take was correct so they just meshed them together to try to make it look stylish. The worst moment of this occurs in the movie's worst scene within the worst subplot: Wilder has broken into her neighbors' apartment to console the battered wife while the drunken husband shouts at the both of them. As the goofy scene splicing is occurring, you can see things in the background change, like the busted-open door suddenly being closed! Even aside from all this, `Wilder' still isn't up to par because you lose patience with it by the second half. And with that feeling of being a flashback to the 70's, you start to realize not only why we laugh at the things of thirty years ago, but why those same things should be left forgotten. Zantara's score: 4 out of 10.",
         "This film is a loving nod to the films of the late 70's--in cuts, setting and music choices (note the rotary phone, the answering machines, the women's lib and PMS comments, and of course Pam Grier herself--who looks fantastic). Filmed in 2000, it does an excellent job in depicting many of the characteristics of the 70's, though some of the tech and procedurals are of the 80's in a kind of mash-up. The dialogue was a high point with some pretty funny lines: \"The only chemistry between you and me is a DNA test...\" ; or this: \"Did he have any enemies? That depends on how many wives talk in their sleep.\" It works because it's done perfectly straight, no sly wink at the audience. Many of the complaints were not justified; some of the acting was downright good--especially the interplay between the main characters, and in particular Pam Grier who plays her role with her usual panache. Rutger Hauer is an unusually charming Rutger Hauer which was a nice change, and his acting was better in this movie than I've seen in many of his others--I really don't get the criticism in this regard. Several of the extras/character actors feel flat or come across as slightly off-kilter stereotypes, but given what the film was trying to do, that may have been deliberate. The plot is pretty standard but plays logically with some interesting and rather unexpected twists, and an interesting big-pharma take. Unlike many of these movies, it actually does pay attention to little details--like a uniform giving them a \"look\" while they're talking (loudly) about their case in the hallway. Admittedly, there are a few--uh, unrealistic moments, but they were original and unexpected (ANY man will have a visceral reaction to one particular murder scene) and fit with the tone of the film, so in that sense, are forgivable. So, take this movie for what it is, an affectionate nod to the past, and overall an unexpected, enjoyable non-cerebral piece of entertainment.",
         "You would think that after starring in \"Jackie Brown\", Grier would have used the success of that movie to reinvigorate her career. Yet just a few years later, Grier found herself starring in this Canadian made-for-DVD cheapie. To be fair, none of the movie's shortcomings can be blamed on her - even in her 50s, Grier looks and sounds great, and brings in some spunk. But the rest of the movie is a bore. It's slow-moving, with some bizarre editing seemingly put in as an attempt to make it more stylish. I know that the idea of teaming Grier up with Rutger Hauer may sound interesting, but they spend less time together than you would probably think. There's a little chemistry in the few scenes they share together, but it's not enough to save the movie. The funk-sounding soundtrack is a nice touch, probably done to remind viewer's of Grier's '70s movies, but that too isn't enough to make this movie worth watching."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": ["The murder of the ex-wife of Doctor Sam Charney (Rutger Hauer) leads Detective Della Wilder (Pam Grier) to uncover a series of women's murders somehow linked to a big pharmaceutical company."],
      "budget": 0
   },
   "movielensId": 124581,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2000-11-01",
      "dvdReleaseDate": null,
      "directors": ["Rodney Gibbons"],
      "runtime": 90,
      "movieId": 124581,
      "title": "Slow Burn",
      "mpaa": "R",
      "actors": [
         "Pam Grier",
         "Rutger Hauer",
         "Romano Orzari",
         "Simone-Elise Girard",
         "John Dunn-Hill",
         "Eugene Clark",
         "Serge Houde",
         "Richard Robitaille",
         "Frank Schorpion",
         "Sasha Dominique"
      ],
      "imdbMovieId": "0246332",
      "originalTitle": "Slow Burn",
      "genres": [
         "Action",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The murder of the ex-wife of Doctor Sam Charney (Rutger Hauer) leads Detective Della Wilder (Pam Grier) to uncover a series of women's murders somehow linked to a big pharmaceutical company.",
      "tmdbMovieId": 60703,
      "avgRating": 1,
      "releaseYear": "2000",
      "numRatings": 1,
      "posterPath": "/1akcgQvsQKurUjWsnkOt1dqyZHx.jpg"
   }
}