{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2155391",
      "video": false,
      "title": "The Midnight Game",
      "recommendations": [
         268993,
         10256,
         316744,
         257521,
         201024,
         433002,
         381063,
         20216,
         106238,
         28671,
         18177,
         143928,
         121572
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Kaitlan",
               "gender": 1,
               "credit_id": "52fe4cacc3a36847f8239a71",
               "name": "Renee Olstead",
               "profile_path": "/Alru3bM9sSE0Q6yeN5fLwNxIy8v.jpg",
               "id": 155621,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Rose",
               "gender": 1,
               "credit_id": "52fe4cacc3a36847f8239a75",
               "name": "Shelby Young",
               "profile_path": "/p5AgNnqgGC4FyZoQTIjwykwQxOy.jpg",
               "id": 25113,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Shane",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239a79",
               "name": "Guy Wilson",
               "profile_path": null,
               "id": 947609,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Jenna",
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239a7d",
               "name": "Valentina de Angelis",
               "profile_path": "/sRbF9To9jajfAn9rdUKW6vhER1z.jpg",
               "id": 92999,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Jeff",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239a81",
               "name": "Spencer Daniels",
               "profile_path": "/iBUcd9yZMbgbGhirU68E8X4D80e.jpg",
               "id": 168962,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cabc3a36847f8239a43",
               "name": "A.D. Calvo",
               "profile_path": null,
               "id": 130514,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cabc3a36847f8239a49",
               "name": "Rick Dahl",
               "profile_path": null,
               "id": 65254,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239a4f",
               "name": "Rick Dahl",
               "profile_path": null,
               "id": 65254,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239a55",
               "name": "A.D. Calvo",
               "profile_path": null,
               "id": 130514,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239a5b",
               "name": "Brett A. Calvo",
               "profile_path": null,
               "id": 1148908,
               "department": "Writing",
               "job": "Idea"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239a61",
               "name": "Eun-ah Lee",
               "profile_path": null,
               "id": 1064285,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239a67",
               "name": "Joe Carrano",
               "profile_path": null,
               "id": 1148909,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4cacc3a36847f8239a6d",
               "name": "Kelli Lerner",
               "profile_path": null,
               "id": 962119,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 0.458063,
      "production_countries": [],
      "id": 167198,
      "vote_count": 8,
      "budget": 0,
      "overview": "After playing a pagan ritual on a dare, a group of high school students find themselves trapped in an endless cycle of their worst fears.",
      "similar": [],
      "original_title": "The Midnight Game",
      "runtime": 74,
      "poster_path": "/p4Hav1ndkCPWYb6b43xTGmBz4Hh.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-03-02",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.themidnightgame.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["A.D. Calvo"],
      "runtime": 74,
      "synopsis": null,
      "writers": [
         "A.D. Calvo",
         "Brett A. Calvo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2155391/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjA0MjM2NzIxOF5BMl5BanBnXkFtZTgwNTQ0MTk4MTE@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Guy Wilson",
         "Valentina de Angelis",
         "Deborah Twiss"
      ],
      "reviews": [
         "This movie had so much promise with the pagan rituals and the interesting plot. I had been waiting a good while to find it. Even though it did bring in the over played teenagers playing a dare style situation on each other and trying to scare the girl into the boys arms, it still maintained value. Unfortunately, the story line and ending left us feeling wanting. It seemed to be heading to a great climactic event but it ended so abruptly that I wondered if I had blinked an missed something. The acting was well done and believable mostly. I enjoyed it until the anti-climax. All in all it was enjoyable and great ideas that were not fully developed. With the climax lacking, 3 stars is all we could agree on.",
         "Very rarely do you find a B movie with Grade A horror! Although this movie has not 1 known celebrity,it should have definitely had a run on the big screen! At first, you think it's going to be the same old boring \"teens incite boogeyman\" theme but there's always something scary about performing games that can potentially be authentic in inciting evil entities. However, after the first 20 minutes, you immediately know that you will be covering your eyes and will potentially be scared to go to bed without the lights on. I recommend that you watch this with a friend...or twelve!",
         "Not even watching this on a fun Halloween night with your friends can save this film. With a half-decent premise and a only a couple good jump scares, this movie is laughable. Anywhere from the terrible acting to the failed scare tactics to, in my opinion, the dumbest decisions ever made by characters in any horror film I've ever seen, this movie fails on every level. But like I said, it's pretty funny. The runtime is 70 minutes, so it never feels drawn-out and knows exactly where to end. And for the record, the film's conclusion is so confusing and jarring that it takes a rocket scientist to make sense of it, if it makes sense at all. The film left me disappointed, cheated, and even a little angry. However, you might have a few fun conversations about the film with your friends the next day, trying to make sense of an insensible, dumb horror movie.",
         "I watched this film with my friend after doing some research on the pagan ritual. We both found it interesting and gripping to begin with but after the first 30 or so minutes it became extremely confusing. Normally I wouldn't watch a film if it didn't contain some kind of familiar star so this was a first for me. I honestly believe that the ending should have been more clear and less murky. Other than that the film wasn't as bad as it could have been. The acting wasn't the best and could have been more convincing. Some of the scenes when the girl who was going insane weren't as good as they could have been and for me the best parts of the film were the scenes when the jock walked around finding all of his friends dead. My main question though is was it a dream or was it real because I am so confused and conflicted.",
         "A-Z Horror Movie of the Day...\"Midnight Game\" (R - 2013 - US) Sub-Genre: Paranormal/Demon My Score: 5.1 Cast=4 Acting=6 Plot=7 Ending=7 Story=3 Scare=3 Jump=5 F/X=5 Creep=6 Demon=5 After playing a pagan ritual on a dare, a group of high school students find themselves trapped in an endless cycle of their worst fears. Full or foreshadowing, this movie was so predictable that it made me laugh. It was very cliché, but still a fun little movie with a couple of jumps and creeps to raise the heart rate a bit. I liked how the movie ended, although very predictable. Is it worth watching...sure I guess for the paranormal fan. Otherwise, you're not missing anything if you don't. Personally, I want to play the game for real and see what happens...who's with me?",
         "this movie was the worst movie ever!!!! don't watch it because it really sucks or if you did already i feel bad for you !!!! this movie is so stupid i swear!!! it wasn't even scary to be honest. when we thought the movie had reached its climax, it ended!!! -.- i don't even know how you guys would like it because it is very vague. aren't scary movies supposed to be scary?? well this one wasn't at all!!! it was just plain stupid and A WASTE OF TIME AND MONEY because i rented it on red box.I WISH I COULD HAVE MY TIME AND MONEY WASTED BACK!!! movies like this get me very mad because instead of spending thousands, maybe millions, they could have given this money to poor people or helped them out you know?",
         "It's been a long time since I haven't seen a scaring movie like this one. It was made the way any real good horror movie should be; by isolating people, then by building up slowly an atmosphere of horror around them, incorporating a lot of unexpected twist, all this by using logic and continuity. The protagonist in the movie begin like every normal people would be by trying to play a satanic game; by distrust and low expectations. They never made any illogical move or irrational action, they just simply act like normally scared people would act in their place, which made it easy to root for them. For a movie build the same way as The Shining, I give the same mark as The Shining, a 10."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Budderfly Productions",
         "Goodnight Film",
         "VSI Media Services"
      ],
      "summaries": [
         "A partying teen and her friends decide to perform an ancient pagan ritual found online called 'The Midnight Game': Candles are lit. A drop of blood is spilled. Their worst fears are confessed and an entity is summoned. But if the rules are not followed exactly, punishment is promised. Tonight, the game is not being taken seriously. A demonic horror has been unleashed. And now, even daylight cannot stop the nightmares that may destroy them all.",
         "After playing a pagan ritual on a dare, a group of high school students find themselves trapped in an endless cycle of their worst fears."
      ],
      "budget": 0
   },
   "movielensId": 124645,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-03-02",
      "dvdReleaseDate": null,
      "directors": ["A.D. Calvo"],
      "runtime": 74,
      "movieId": 124645,
      "title": "The Midnight Game",
      "mpaa": "",
      "actors": [
         "Renee Olstead",
         "Shelby Young",
         "Guy Wilson",
         "Valentina de Angelis",
         "Spencer Daniels"
      ],
      "imdbMovieId": "2155391",
      "originalTitle": "The Midnight Game",
      "genres": [
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After playing a pagan ritual on a dare, a group of high school students find themselves trapped in an endless cycle of their worst fears.",
      "tmdbMovieId": 167198,
      "avgRating": 2.25,
      "releaseYear": "2013",
      "numRatings": 2,
      "posterPath": "/p4Hav1ndkCPWYb6b43xTGmBz4Hh.jpg"
   }
}