{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lion",
            "id": 2043
         },
         {
            "name": "kenya",
            "id": 9895
         }
      ],
      "imdb_id": "tt0056186",
      "video": false,
      "title": "The Lion",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Hayward",
               "gender": 2,
               "credit_id": "52fe494f9251416c910a9317",
               "name": "William Holden",
               "profile_path": "/6sa5f8p1KBhYxJDEmCLxn7QLcBe.jpg",
               "id": 8252,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "John Bullit",
               "gender": 2,
               "credit_id": "52fe494f9251416c910a931b",
               "name": "Trevor Howard",
               "profile_path": "/drj1FPryhAimWCiufEnMLzUxpBQ.jpg",
               "id": 12726,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Christine",
               "gender": 1,
               "credit_id": "52fe494f9251416c910a931f",
               "name": "Capucine",
               "profile_path": "/pGzEiXMc77pxXwhiH4j0vdb20IO.jpg",
               "id": 14262,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tina",
               "gender": 1,
               "credit_id": "52fe494f9251416c910a9323",
               "name": "Pamela Franklin",
               "profile_path": "/7ViOYUIPtcPhqRyiTHKVnyzwzyF.jpg",
               "id": 25635,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe494f9251416c910a9329",
               "name": "Jack Cardiff",
               "profile_path": "/3WSJNaLdjX2ToZ3QrNhkpBS9fe6.jpg",
               "id": 6603,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe494f9251416c910a932f",
               "name": "Irene Kamp",
               "profile_path": null,
               "id": 932378,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe494f9251416c910a9335",
               "name": "Louis Kamp",
               "profile_path": null,
               "id": 932379,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe494f9251416c910a9341",
               "name": "Samuel G. Engel",
               "profile_path": null,
               "id": 30286,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "536facabc3a368124100eb55",
               "name": "Edward Scaife",
               "profile_path": null,
               "id": 21783,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.054895,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 85615,
      "vote_count": 1,
      "budget": 0,
      "overview": "Young Tina lives with her mother and stepfather on a wildlife reserve in Kenya. While her stepfather believes this is a wonderful environment for her to grow up in, her mother becomes increasingly concerned by her behaviour. These concerns are reinforced when it is revealed that her daughter's best friend in the whole world is a fully grown lion. Worried that her daughter may be turning into a savage, she sends for her former husband, Tina's biological father, in the hope that he can take her back to civilization (in this case rural Connecticut). But it seems as though Tina's mother wants something more than a civilized upbringing for her daughter.",
      "similar": [
         10527,
         606,
         953,
         7350,
         9732,
         11430,
         161143,
         313943,
         1523,
         873,
         87827,
         8587,
         2454,
         411,
         9273,
         258489,
         630,
         284054,
         1372,
         9904
      ],
      "original_title": "The Lion",
      "runtime": 96,
      "poster_path": "/2poYCCW4vzf8mWgaqATjuUeRHeY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1962-08-19",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Cardiff"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Irene Kamp",
         "Louis Kamp"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056186/",
      "coverLink": null,
      "actors": [
         "William Holden",
         "Trevor Howard",
         "Capucine"
      ],
      "reviews": [
         "I was fortunate enough to watch this film in its original CinemaScope format (THANK YOU, Fox Movie Channel!), and I'm glad I did. Jack Cardiff directed a TERRIFIC cast (Holden, Howard, Capucine, and Franklin) in this story about a mother who sends for her daughter's biological father when she fears that the daughter may be turning savage, the concern being reinforced by the fact that the girl's best friend is a full-grown lion with whom she has an EXTREMELY close friendship. The cast is terrific, especially Franklin, who is both irresistibly charming yet downright scary when she really taps into the African way of life. The direction, performances, Edward Scaife's beautiful widescreen cinematography of the African landscape and Malcolm Arnold's wonderful score make this film great.",
         "There are two reasons for seeing The Lion. The first is for Pamela Franklin's performance as the twelve year old girl who has gone native as the British colonists used to say in every sense of the word. The second is because this gives today's audience an opportunity to view Africa as William Holden saw it and tried to preserve it. The film may have been made so Holden had the excuse to stay at his famous Safari club which was a deluxe resort built in Kenya, partly financed by Holden. It was also a very large animal preserve and Bill Holden loved the place and took every opportunity to spend time there. Jack Cardiff who is the United Kingdom's most celebrated color cinematographer did some of his best work on The Lion as its director. Oddly enough Holden casts himself as the outsider in the film. Years ago while he was making big money as a corporation attorney in the USA, his bored wife Capucine went on safari and fell in love with Africa and the safari guide Trevor Howard. She left Holden and married Howard taking her baby girl with her. Howard's raised her as his own and young Pamela Franklin is worrying Capucine now and she sends for Holden because of Franklin's behavior. Pamela's companion is this full grown lion which she has raised since a cub and treats like a house pet. This isn't Clarence the Cross Eyed lion either, the male lion is fully functional in the wild. When Holden meets up with King as the lion is called, he gets a few anxious moments and appreciates Capucine's concern. It's also possible Capucine is getting a little bored with life on a Kenyan game preserve as well, a fact Howard is becoming aware of. He does what he can to rattle Holden like playing tag at different times with an elephant and rhinoceros while the four cast members are in a jeep. The work is remarkably similar to the John Wayne/Howard Hawks classic Hatari which came out soon after. The superb color cinematography of Africa plus Pamela Franklin's performance as a most disturbed child are the main reasons to see The Lion. It's not your usual kid's animal film, the child relates in an unhealthy way to The Lion and the adults have some very adult issues as well. The Lion is your only real chance to see and appreciate the Africa that William Holden loved and tried to preserve, don't pass up an opportunity.",
         "The Lion (1962): Starring William Holden, Capucine, Trevor Howard, Pamela Franklin, Christopher Agunda, Samuel Obiero Romboh, Paul Oduor, Makara Kwaiha Ramdhani, Zakee....Director Jack Cardiff, Screenplay Irene Kamp, Louis Kamp, Joseph Kessel. Various films of the 50's and early 60's enjoyed bold new cinematic presentation such as Cinemascope and Panavision, providing better picture quality that dazzled audiences. Director Jack Cardiff's \"The Lion\", released in 1962, was shot in beautiful Cinemascope. This is a lovely film and unfortunately yet another underrated, little-known jewel in Hollywood cinema, possibly because it's a very unassuming film with a story that was not exactly mainstream Hollywood at the time. An older William Holden (Sunset Boulevard, Sabrina, Picnic, The Country Girl, Bridge On The River Kwai, ) portrays Robert Hayward, an American anthropologist who comes to Africa, reunites with his former love Christine (the beautiful and talented Capucine) but who is herself now in a relationship with a British anthropologist John Bullit (Trevor Howard). Her feisty, precocious daughter Tina, performed by child actress Pamela Franklin, has grown up in the African wilderness and tamed as well as befriended a mighty lion. The movie never feels excessively long but it does appear sentimental by today's standards, almost like a long, expensive production of a \"Lassie\" episode with a lion instead of a dog. The cast is only a small group of about nine to ten people, but this does not take away from the greatness of the film, which comes alive through the chemistry between everyone involved. It was filmed on location in Uganda and Kenya. The grand views of nature, shot with sophisticated cameras so that we are seeing the great plains and mountains from an eagle's eye view as well as from a ground view, are perhaps the strongest part of the film, for the natural surroundings are as much a part of the story as the drama of people versus people.The intimate moments between former lovers Christine and Robert, as well as her hubby John (Trevor Howard) are wonderfully executed, the stuff of solid drama, especially because these actors - William Holden, Trevor Howard and Capucine - each had enough dramatic training and experience behind them to bring their otherwise dull, dangerously underdeveloped characters to life. Never overacting, they portray characters that seem very real and therefore very moving. And thank heavens, it doesn't play out like a soap opera in the African bush!! The enemy in the film, far from the pettiness of the rivalry between Robert and Jon, are the greedy poachers who kill lions for the selling and marketing of their valuable skin. The noble lion in the film seems to be a metaphor for the potential greatness of people if they set aside their ego or their differences as well as the benefits of harmonious living with nature. The superb cinematography is by Edward Scaife, and the mellow, atmospheric music is by Malcolm Arnold. This is a lovely film with a strong message concerning love between people and between people and animals. P.E.T.A. would eat this film up as well as any lovers of animals, our earthly companions.",
         "I have looked and looked for this movie everywhere. I remember seeing it as a 9 year old and falling in love with King myself. I would love to see it again. I remember how beautiful the scenery was and how free Tina seemed to be as she ran through the jungle. As a nine year old I really related to Tina . She was by far the best actress in the whole movie. It has taken me years to find this movie by it's actual name and now I would love to be able to have a copy of my own. It is a shame that this movie is not available to purchase. It should be available on DVD so we can all share it with our children and grandchildren. It is a memory I will never forget.",
         "I fell in love with this movie when I first saw it as a kid. I had the opportunity to watch it again recently and found that it was as captivating as I remembered it to be. However, what impressed me the most this time was not the story or the magnificent African scenery & animal footage, but this young girl's ability to play such a difficult role to perfection. Pamela Franklin (only 12 years old at the time I believe) stole every single scene out from under the film's big-name adult stars: Holden, Capucine and Howard. Her performance alone is enough reason to see this great drama if ever given the opportunity!",
         "An interesting plot, but this film's best aspects include the wonderful African scenery and wildlife, and one of the very BEST soundtracks ever set to film. As I write this, six people have voted on it, herein, and the average rating is 9.2 out of 10! Yet, this wonderful film seems to be totally unavailable on video! There's something very wrong with that! THIS film should be in the stores!!",
         "The real star of THE LION is all of the footage devoted to wild life animals, especially the scene where game warden TREVOR HOWARD takes WILLIAM HOLDEN, CAPUCINE and PAMELA FRANKLIN on a wild ride through African landscapes filled with wild animals in their natural environment and makes a game of tag look like a dangerous stunt. Unfortunately, that fifteen minute segment is the highlight of an otherwise \"girl loves wild animal but has to grow up\" kind of story. PAMELA FRANKLIN is charming and natural as the girl with her clipped British accent and clipped head of hair giving her a tomboyish appearance throughout. She carries most of the film with a convincing portrait of a girl who has to grow up and find relationships with people just as stimulating as her love for an overgrown pet lion. WILLIAM HOLDEN was still attractive at this time, maturity sitting well on his features and quietly effective as the girl's biological father who has been summoned by his ex-wife (CAPUCINE) to see what he can do about their daughter and her excessive interest in all things wild. The color cinematography is a visual delight with stunning vistas of the African plains (filmed in Kenya) and gorgeous sunsets, but the story is on less solid ground than the photography and is pretty predictable once Holden's presence kindles Capucine's interest in a romantic way. Still, there's enough material within the slight story to hold the viewer's interest and a nice background score by Malcolm Arnold helps things along. Anyone who grew up during the MY FRIEND FLICKA and LASSIE COME HOME days will be reminded that this is simply transference of a typical household pet to an untamed lion, but with basically the same story and before long, lots of deja vu settles in.",
         "I was amazed by this movie I just discovered today, a movie I just heard about without never seeing it. It was never released in France since the sixties I guess. At least, never in DVD nor VHS. Anyway, I am always fond of those movies made in natural settings and telling beautiful animal tales. I am surprised that no comment has pointed out the similar feature called BORN FREE, directed by James Hill a couple of years later. Not exactly the same story, OK, but if you see the both in the same week, a while later you can confound. I love both, with a maybe better score for BORN FREE. John Barry score. And through this movie, I saw a hippopotamus running in the savanna !!!",
         "This movie has many charms, but foremost is that of Pamela Franklin, an extraordinary young actress who went on to make some interesting movies, but disappeared from the scene many years ago, after making too many horror movies.",
         "Saw this when it first came out .acting was super, story line intriguing, sad thou . Have never forgotten it and enjoy watching it again and again",
         "Although Jack Cardiff was a better cinematographer than a he was a director, he wasn't a bad director, and I believe \"The Lion,\" along with \"Dark of the Sun\" are his best films. In \"The Lion\" Christine (Capucine) lives in Kenya with her second husband, big game hunter John Bullit (Trevor Howard), and her daughter Tina (Pamela Franklin) from a previous marriage. Tina has so taken to the African wild that Christine fears her daughter will one day just become an unreachable savage, so she contacts her first husband, Robert Hayward (William Holden), to come to Africa and help civilize Tina so she can return to the U.S. and live a normal, less dangerous, life. This idea is acerbated because Tina's best friend is a full grown lion she calls King. They grew up together and she spends most of her time in the jungle with King. She also believes King will do whatever she says, including attack and kill someone. Of course Bullit resents the arrival of Robert, particularly since it becomes clear Robert continues to have feelings for Christine. The performances of the entire cast are quite good, if very much of their time. Franklin is especially good. She really does wrestle and play with the full grown lion on screen. It's actually quite remarkable to watch and apparently Franklin actually did bond with the animal. On the other hand, the love relationship that grows between Christine and Robert is less impressive, but Holden and Capucine have some effective moments, and the rebirth of their feeling for each other feels natural. So does the gradual changes that happen with hunter Bullit. Trevor Howard plays him in a strong performance that makes you dislike him but also understand his situation. He loves his step daughter and he does what he can to keep her in Kenya. One sequence where Bullit takes his wife, daughter and Robert on a wild drive through the African plain exposes his character. He purposely tries to upset big game like rhino, hippo and elephants in order to scare Robert by driving through the herds, taunting them. Of course this is exciting but annoying to watch because he's showing no respect for the animals. It almost makes you hate him, but there are more sides to him, and as the story plays out, we can't help but feel for him. Woven through this story are two native tribemen, a chief and his arrogant son who will become chief when his father dies. This is actually well integrated into the plot. The stories of Tina and her lion King, Christine, Robert, Bullit and the two tribesmen all come together in an inevitable climax. Some viewers might see it coming, but I think they might be surprised by how it happens. The score by Malcolm Arnold is one of his finest, full of thunderous drums and a beautiful main theme. It has a jazzy Gershwin-esque quality to it, which makes sense, since jazz is America's connection to Africa, an art form created by African Americans, and the story is about Americans' connection to Africa. The film is beautiful to watch, but be sure to see it in widescreen. The African landscapes and skies are stunning, and the scenes in camp during the character drama maintain a constant sense of place. You can be carried away by the atmosphere. The cinematographer was Edward Scaife, but the look of the film has Cardiff all over it. Try to find a widescreen version of this film, I think you'll find it a pleasant surprise.",
         "Another film that doesn't deserve its critical shellacking, though admittedly it could be improved by faster pacing. Capucine is a most unlikely jungle mistress and it is hard to believe in the character either as written or played so coolly by a too pretentiously sophisticated actress, who is yet oddly enough not always photographed to best advantage. Cardiff seems to have stuck to directing. A pity he didn't photograph too, though I suppose even he could do little to disguise the obvious use of doubles in the action and some of the location sequences. Still, he would have made the film more visually and attractively stylish. For all the natural beauty displayed, the style of the film is — like the story — rather bland. There is little to it really, though the players strive and partly succeed (especially Howard) to make it more interesting. The trouble, of course, is that we have seen it all in various guises — \"Hatari\" et al — before.",
         "So, a guy gets divorced (Holden) ...never visits his kid who is in Africa, goes to get his kid because his ex-wife has summoned him. He steals his ex-wife and child from a guy (Howard) who raised his kid and who the kid loves. This was all selfishly orchestrated by his wife (Cappucine). The point of the movie seems very sympathetic to Holden and Cappucine (with a happy ending for those two!). But, from this viewer's point of view, they are selfish and a couple of jerks. Yes, the kid needed to leave Africa...but by every right, Trevor Howard's character should have shot both of those scheming adults. The acting and cinematography are great (although the blue screen effects are obvious as you see a glow around the actors during those scenes). Unfortunately, I saw an old TV version of this movie that was not wide screen but pan and scan. Hopefully, when they arrived in Connecticut at the end of the movie, they all went to family counseling...as this is one screwed up family.",
         "On-location shooting in East Africa lends credibility to this mostly predictable family saga about an American lawyer who travels to his ex-wife's wildlife sanctuary in Kenya to see his estranged pre-teen daughter; turns out the youngster has become an out-of-control little creature who runs with the animals, in particular a full-grown lion named King. The wife's new husband, a former safari hunter, is threatened by the male intruder, while the ex-hubby is distressed over his daughter's upbringing (she displays an advanced education, yet her see-sawing emotions--much like her mother's--reveal a troublesome undercurrent). Just a year after her mercurial performance in \"The Innocents\", young Pamela Franklin once again does forceful acting work; her maliciousness is very mature for a child, and her glassy-eyed intensity is impeccable and scary at the same time. Still, it's understandable why this girl never became an audience favorite: her brash independence and wizened superiority is rather a turn-off for most adults (perhaps kids, too). In the grown-up roles, William Holden stays commendably in a lower key while chilly marrieds Capucine and Trevor Howard do their best to make him as uncomfortable as possible. Mixture of family dynamics melodrama and African travelogue isn't enthralling entertainment, although the cinematography is good, as is Malcolm Arnold's buoyant score. ** from ****",
         "I remember seeing this film in 1962, as a child. I would love to see it again as an adult and show it to my grandchild. I felt it was captivating. The characters may not be totally believable, but performances are good, especially from \"King\" the lion.",
         "Supposedly a British accented heroine befriended a lion and now plays with him like a house cat, but despite putting on a show for her ex-father, having a superficial power over animals that comes with a British accent and short hair, the heroine clearly fears the lion and only plays with him because she knows men with guns are standing by. This lion was more realistic than the CGI lion in Narnia (2005) because it was real. Unfortunately the lion was only in 10 hair raising minutes of it, in which the heroine rode on the lion's back, hugged the lion, and put her hand in his mouth, usually standing behind the lion's head of course. Would be fun to know if the limited screen time for King was due to the danger. With today's technology, a good movie could be made about a computer animated lion raising a heroine in the wild, with tons of mane footage, but this isn't it. This lion was just a Mcguffin in a story about parents breaking up and British heroines following the wrong path.",
         "Holden visits his child, Franklin, and his ex wife, Capucine, who is now married to Howard, manager of a government game preserve in Africa. The cast and crew are fine, but there's a problem with the script, at least for me. It's much like a story for children. And the viewer is treated as a groundling. Capucine is driving Holden across the veldt and exclaims, \"Oh, look!\" And there's a shot of warthogs. Near the beginning we also see lots of elephants, lions lunching on a zebra, hippopotamae, dik diks, baboons, and a tiny monkey who nuzzled up to Holden's nose and chirps. Later we get to know \"King,\" a really massive male lion who is Franklin's pet. Please. Movies about Africa don't HAVE to be this way. Think of \"African Rose,\" for instance, where there were only glimpses of crocs and the greatest menace was Gordon's gin and clouds of insects. I couldn't bring myself to watch it through to the end. Perhaps it improves, even if only to become an improved children's story. At any rate the acting can't be faulted. Holden isn't given much to do. Capucine is exquisite, elegant from top to bottom. And Pamela Franklin is fey and has an impish smile. In another five years or so, she would become less elfin and more -- more -- something else."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Twentieth Century Fox"],
      "summaries": [
         "Young Tina lives with her mother and stepfather on a wildlife reserve in Kenya. While her stepfather believes this is a wonderful environment for her to grow up in, her mother becomes increasingly concerned by her behaviour. These concerns are reinforced when it is revealed that her daughter's best friend in the whole world is a fully grown lion. Worried that her daughter may be turning into a savage, she sends for her former husband, Tina's biological father, in the hope that he can take her back to civilization (in this case rural Connecticut). But it seems as though Tina's mother wants something more than a civilized upbringing for her daughter.",
         "In Kenya, when young Tina befriends a lion and embraces local customs, her mother summons Tina's American father to help bring Tina back to civilization and give her a civilized upbringing."
      ],
      "budget": 0
   },
   "movielensId": 124625,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-08-19",
      "dvdReleaseDate": null,
      "directors": ["Jack Cardiff"],
      "runtime": 96,
      "movieId": 124625,
      "title": "The Lion",
      "mpaa": "",
      "actors": [
         "William Holden",
         "Trevor Howard",
         "Capucine",
         "Pamela Franklin"
      ],
      "imdbMovieId": "0056186",
      "originalTitle": "The Lion",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Young Tina lives with her mother and stepfather on a wildlife reserve in Kenya. While her stepfather believes this is a wonderful environment for her to grow up in, her mother becomes increasingly concerned by her behaviour. These concerns are reinforced when it is revealed that her daughter's best friend in the whole world is a fully grown lion. Worried that her daughter may be turning into a savage, she sends for her former husband, Tina's biological father, in the hope that he can take her back to civilization (in this case rural Connecticut). But it seems as though Tina's mother wants something more than a civilized upbringing for her daughter.",
      "tmdbMovieId": 85615,
      "avgRating": 0,
      "releaseYear": "1962",
      "numRatings": 0,
      "posterPath": "/2poYCCW4vzf8mWgaqATjuUeRHeY.jpg"
   }
}