{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "diner",
            "id": 10738
         },
         {
            "name": "mohave desert",
            "id": 191475
         }
      ],
      "imdb_id": "tt0025228",
      "video": false,
      "title": "Heat Lightning",
      "recommendations": [],
      "backdrop_path": "/fLMylXAzOZ00LM2oBDIjV8NgafR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Olga",
               "gender": 1,
               "credit_id": "52fe49b69251416c910b65bf",
               "name": "Aline MacMahon",
               "profile_path": "/pFVUxlF3AUe6hnfTkJWXpK2LcUa.jpg",
               "id": 74874,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Myra",
               "gender": 1,
               "credit_id": "52fe49b69251416c910b65c3",
               "name": "Ann Dvorak",
               "profile_path": "/wFR9zC4Q85tVlC2HwPXtO4yAIwT.jpg",
               "id": 13353,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe49b69251416c910b65c7",
               "name": "Preston Foster",
               "profile_path": "/iZmiPuuHJm2pLxgmhrCQ504wWwn.jpg",
               "id": 33004,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe49b69251416c910b65cb",
               "name": "Lyle Talbot",
               "profile_path": "/gHbCftyesSSHRCEClOQUOVjISV8.jpg",
               "id": 34119,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Mrs. Tifton",
               "gender": 1,
               "credit_id": "549d4e8ec3a3682f23005a74",
               "name": "Glenda Farrell",
               "profile_path": "/yXGuyPRLjVaqUX7ApjOnUeIwAvS.jpg",
               "id": 29315,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Frank",
               "gender": 2,
               "credit_id": "549d4e9fc3a3682f1b00586d",
               "name": "Frank McHugh",
               "profile_path": "/oSBztLH3U3TctJnuJm0U9600fSq.jpg",
               "id": 74875,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mrs. Ashton-Ashley",
               "gender": 1,
               "credit_id": "549d4eb1c3a3682f2100583f",
               "name": "Ruth Donnelly",
               "profile_path": "/k7ex88hoKxcmYRsfXwewqZLAYDf.jpg",
               "id": 30214,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Steve Laird",
               "gender": 0,
               "credit_id": "549d4ec2c3a3682f1b005872",
               "name": "Theodore Newton",
               "profile_path": "/3QgX2sq25reNe9NVuCXJqwhJgZy.jpg",
               "id": 134633,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Everett Marshall",
               "gender": 2,
               "credit_id": "549d4ed392514131230057d1",
               "name": "Willard Robertson",
               "profile_path": "/obv0gmpXV3hGpnUKQVInkBPKBcA.jpg",
               "id": 103620,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "'Popsy' - a Businessman",
               "gender": 2,
               "credit_id": "549d4ee5c3a3685542002404",
               "name": "Harry C. Bradley",
               "profile_path": null,
               "id": 948509,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "The Sheriff",
               "gender": 0,
               "credit_id": "549d4ef5c3a3685542002408",
               "name": "James Durkin",
               "profile_path": null,
               "id": 1146151,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Gladys - the Wife",
               "gender": 1,
               "credit_id": "549d4f07c3a3682f23005a82",
               "name": "Jane Darwell",
               "profile_path": "/geGrMcqxcFtMKKJO36OFpVwZFFW.jpg",
               "id": 8515,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Herbert - the Husband",
               "gender": 2,
               "credit_id": "549d4f199251413129005c28",
               "name": "Edgar Kennedy",
               "profile_path": "/nCun7c3czorbRoK2kxqaz9BjyPg.jpg",
               "id": 30018,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Blonde Cutie",
               "gender": 1,
               "credit_id": "549d4f5a92514131230057e3",
               "name": "Muriel Evans",
               "profile_path": "/74zQFDRxa9YGmbtjsrB1JIWOmv4.jpg",
               "id": 144400,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Girl with Black Bangs (uncredited)",
               "gender": 0,
               "credit_id": "549d4f6cc3a368764f001625",
               "name": "Jill Dennett",
               "profile_path": null,
               "id": 1288172,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Radio Announcer (voice) (uncredited)",
               "gender": 0,
               "credit_id": "549d4f7cc3a3682f23005a90",
               "name": "Sam Hayes",
               "profile_path": "/3Um7tYoqfNosRqLJu9vDOBgRsfa.jpg",
               "id": 126549,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Mexican Husband with Family (uncredited)",
               "gender": 2,
               "credit_id": "549d4f8e9251414bb2003f4e",
               "name": "Chris-Pin Martin",
               "profile_path": "/gCyLa9dZ4ow5U2s7eKq9PVGAsex.jpg",
               "id": 120705,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Mexican Wife (uncredited)",
               "gender": 0,
               "credit_id": "549d4fa0c3a3682f160058a0",
               "name": "Margareta Montez",
               "profile_path": null,
               "id": 1404245,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "The Last Traveler (uncredited)",
               "gender": 0,
               "credit_id": "549d4fb69251413129005c3e",
               "name": "Eddie Shubert",
               "profile_path": "/aUIeKA1cgTbsayGOCIMx1y1M75W.jpg",
               "id": 1017631,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49b69251416c910b65bb",
               "name": "Mervyn LeRoy",
               "profile_path": "/bbzImfUjJ7v9U86WCpXMjAF4Nap.jpg",
               "id": 9054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b69251416c910b65d1",
               "name": "Leon Abrams",
               "profile_path": null,
               "id": 141604,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe49b79251416c910b65d7",
               "name": "George Abbott",
               "profile_path": "/fFnbYNzHLfQjxl3BH6u7glnXwL1.jpg",
               "id": 2004,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe49b79251416c910b65dd",
               "name": "Brown Holmes",
               "profile_path": null,
               "id": 128782,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe49b79251416c910b65e3",
               "name": "Warren Duff",
               "profile_path": null,
               "id": 10148,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 0.22785,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 87123,
      "vote_count": 2,
      "budget": 0,
      "overview": "A lady gas station attendant gets mixed up with escaped murderers.",
      "similar": [
         59,
         241848,
         2654,
         2163,
         300665,
         10131,
         10185,
         400,
         17030,
         24739,
         25736,
         25212,
         10359,
         26618,
         307479,
         10285,
         165,
         59861,
         22894,
         85564
      ],
      "original_title": "Heat Lightning",
      "runtime": 63,
      "poster_path": "/bZNbsrlJWLOEHWy7iL6Vkpt7wYO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1934-03-03",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "\"I just killed a rat!\"",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mervyn LeRoy"],
      "runtime": 63,
      "synopsis": null,
      "writers": [
         "Leon Abrams",
         "George Abbott"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025228/",
      "coverLink": null,
      "actors": [
         "Aline MacMahon",
         "Ann Dvorak",
         "Preston Foster"
      ],
      "reviews": [
         "This predecessor of The Petrified Forest (criminals on the lam change the lives of assorted characters at an isolated lunchroom) shows its origin as a Broadway play, but it's faster moving, less pretentious, and a lot less talky than the better known movie. The large cast is wonderful, especially the great Aline MacMahon; their characters well defined; and the direction and cinematography are crisp and professional. It's well worth the hour it takes to watch it.",
         "A fine example of minimalist film-making, this Warners B-pic offers a proto-feminist scenario delivered with some swell precode attitude. Two sisters (one world-weary, the other innocent) run a service-station-cum-caravansary on an isolated desert highway. Every passerby kids them about how dull and lonely this existence must be, but in the space of one night they serve host to a pair of criminals on the run, a couple of gold-diggers on the way back from Reno with their swag (and with a wise-guy chauffeur), plus a large family of Mexicans on the way to a fiesta. The main thrust of the film is melodramatic, as even in their isolation the women cannot avoid mistreatment by treacherous men. However, it's also filled with neat little comic bits and clever wisecracks. Director Mervyn Le Roy creates plenty of atmosphere with few resources, and the cheap-jack desert-palms backdrop (with the Mexican father tenderly serenading his family in the background) sticks in the memory. Le Roy uses an almost slow-motion tracking shot to great effect to show the hallucinatory influence of an ex-lover on the older sister as he intrudes into this sweaty environment. And it's pretty clear that there's a lot of casual sleeping around going on -- a lot of the jokes and situations probably wouldn't have survived the censors if this were a more prominent picture (and definitely not a year later). But the picture never flaunts its raciness -- sex is just part of the fabric of life. Though consistently enjoyable, the movie never builds up enough intensity to be classed with the immortal second features like Detour (though the climax does pack a punch). Surprisingly, the two leads never really click. Aline MacMahon and Ann Dvorak were always marvelously idiosyncratic in supporting roles, but here the former's baroque style seems overdone for the milieu, and the latter doesn't have much opportunity to vent her repressed passion (maybe the censor trimmed that bit). Overall, though, the performances from the many familiar faces are excellent, my particular favorite occurring in the opening scene featuring Edgar Kennedy as the henpecked spouse of Jane Darwell. Definitely worth seeking out for aficionados (but hard to find). Some might compare it to The Petrified Forest, but it gives me a bit of an offbeat Shack Out on 101 vibe, too.",
         "After reading several reviews that enjoyed the film, I almost did not write a comment. However, after reading the one comparing it to a poor man's Petrified Forest, I wanted to say that's just plain unfair. I, was not around for the New York Times drab review in 1934, like the previous reviewer, but I can form my own opinion. I really liked the movie. Aline McMahon, pulled off the difficult character of playing a woman mechanic/business owner, and Preston Foster played the crook on the lam quite believable for the situation he was in. I personally wish Ann Dvorak had more of a developed part, I always like her, but sadly hers was the least developed of the several interesting characters in the film. Obviously made on a small budget, it's just unfair to compare this to Petrified Forest. They are not the same film at all.",
         "Heat Lightning was an early work by George Abbott, written and directed by him in 1933 it had only a run of 44 performances in that anemic Depression Era season on Broadway. It was not the best work Abbott was ever associated with, but I'm sure he was grateful that Warner Brothers bought the screen rights in those cash strapped times. It stars Aline McMahon and Ann Dvorak as a pair of sisters running a filling station, automobile camp out in the American west, very similar to the one Bette Davis and her family was running in The Petrified Forest. They're both a bit antsy being stuck out in the desert without the attention of the male of the species. But McMahon's been around the track a little too often and she tries to steer Dvorak right. The guy who gave her that ride a few times is Preston Foster and he's shown up with pal Lyle Talbot. On the lam as it turns out, but the sisters don't know it. Foster's putting the moves on Dvorak and McMahon ain't having any of that. Truth be told she's got a bit of a yen still left and the desert isolation ain't curing the yen. Some other characters pop up in this drama, a pair of would be divorcées heading for Reno with their 'chauffeur' played by Glenda Farrell, Ruth Donnelly and Frank McHugh. Also at the beginning Edgar Kennedy and Jane Darwell are a married couple going west. I wish we could have seen more of them. In fact I'm surprised that Jack Warner didn't recognize a good potential comic team there and made more films with them. As you can see there are a lot of similarities to The Petrified Forest, but I think that even with the tragedies that befall both Humphrey Bogart and Leslie Howard there, The Petrified Forest is a more optimistic play. Bette Davis does get her chance to leave and see the wider world. Not quite what happens here, but I can't say more. As compared to some of the legendary work George Abbott was associated with on stage Heat Lightning is definitely minor league. Yet it's not a bad piece of work, definitely in keeping with the times. Mervyn LeRoy did a good job in filling the screen and striking a nice balance between the comic and the dramatic. Very typical of what came from the working man's studio.",
         "I was very fortunate to DVR a pristine copy of this many years ago on TCM and I have watched it probably 30 times since. My dad made several auto trips across the US in the twenties and earlier. Though this was 1934, it provides me with a visual perspective on some of what he may have encountered before there was a national system of highways, or many paved roads for that matter. My enjoyment of this film comes mostly from the glimpses into early motoring. As a kid in the early fifties I made many a trip from California to Iowa with my folks on route 66. Motoring was not all that sophisticated even in the early fifties and that plays into it as well. This review/comment is not so much about the finer points of the movie as it is a statement on how enjoyable it is for me because of the time in which it was made. The fact that there is a great little drama playing out and lots of ventures into quirky personalities and side plots, is just icing on the cake.",
         "I enjoyed this film. I posted a Spoiler Alert just in case I say too much. First of all besides the setting I didn't think it was like The Petrified Forest. The Petrified Forest is a better film and story but this little mostly unknown flick is good. Olga (MacMahon) is now running a \"next gas 200 miles\" kind of a rest-stop/motel in the lonely dreary and hot desert. Unlike Gabriel, where Davis' character who was filled with optimism, Olga had seen that done that. She's somewhat jaded but still has that spark of something positive. Preston Foster and Lyle Talbot are on the lam. It's that \"of all the gin joints she walks into mine\" kinda thing. Foster and MacMahon were lovers at one time. Foster isn't the nicest fella but when MacMahon sports a dress and some make-up he with all his smarmy charm shows an inkling of interest. However he's so awful that it's best that MacMahon not really pursue this. Enough said. Poor Myra, Olga's younger sister, Dvorak, bored to the gills and wants to have some fun in life. She meets a self-sided loser and is of course saddened even tho' Olga warned her about men. Glenda Farrell, Ruth Donnelly and Frank McHugh show up who are mainly a diversion even though parts are paramount to the plot and I'm not divulging same. A family of Mexicans stop by just for atmosphere in my opinion. What happens near the end is something you'll have to see. Again, the running time of this film is short, good actors, a bit of comic relief and do not expect The Petrified Forest and enjoy.",
         "In many ways, this film reminds me of another Warner Brothers film made just a few years later, \"The Petrified Forest\". Both are set at isolated gas stations in the desert and both involve gangsters who come there to seek shelter. However, the films are certainly different enough to make it worth seeing them both. Olga (Aline MacMahon) is a world-weary soul who has chosen to move into the middle of nowhere because she's tired of people. Her sister, Myrna (Ann Dvorak), however, isn't tired of people and yearns for excitement and men-- and the pair couldn't be more different. Into their very dull and predictable lives come an assortment of folks to stay at their gas station/motor court. One pair are a couple of divorcées on their way from Reno after their latest conquest. Another are a pair of crooks on the run from the law. In a coincidence you'll only see in a play or movie, it turns out the boss (Preston Foster) was once Olga's lover! What's next? See the film. There are two main things going for this film--Foster and MacMahon. Their characters are interesting and the final scene between them is something to see! Unfortunately, Dvorak's role is very whiny and annoying--and the character significantly impairs the film with her overwrought performance. Overall, it is worth seeing but is far from brilliant work from the studio.",
         "...the answer is NO!! There wasn't much heat lightning going on in this movie either!! Ann Dvorak had been one of the most exciting new talents to emerge in the early thirties but her rebellious attitude with studio heads made sure her talent was kept under a rock and her role as Myra in this film was a part any contract actress could have played. It was just another nail in the coffin of Ann's once promising career. It was up to good old Aline MacMahon to give some vitality to her role as Olga, the older sister, who has managed to keep her passions hidden for many years. This movie appears more like a very watered down version of \"The Petrified Forest\" without the psychological undertones and the powerhouse performance of Humphrey Bogart. Preston Foster had shown he could give dynamic performances (his Killer Meares in \"The Last Mile\") but unfortunately not in this movie. Olga and Myra run a road side diner 1,000 miles from anywhere, smart and efficient Olga servicing the cars, Myra yearning to get away. Poor Ann spends most of the movie with her head in her arms. For a service station, stuck in the middle of nowhere, it does a brisk trade, there is a bickering older couple, two would be starlets (lively Muriel Evans is billed as a blonde cutie), two freshly divorced gals on their way back from Reno (Glenda Farrell and Ruth Donnelly) and Jerry (Preston Foster) and his jittery sidekick (Lyle Talbot) on the run from a bank holdup. Jerry knows Olga from years before, he is the man she is trying to forget. When he overhears Mrs. Tifton (Farrell) discussing her jewelry he decides to play on Olga's pent up emotions - and have his friend rob the divorcée, but plans are changed when the women decide to put the jewelry in the safe. Not only does Olga realise she has been played for a fool but Myra comes home from the party that she had been forbidden to go to a bit the worse for wear. For all the \"action\" (and I use the term loosely) the movie doesn't seem to go anywhere but amazingly Aline MacMahon gets a part she can really sink her teeth into. Her Olga is no nonsense and all business but when her past catches up with her she displays vulnerability and longing in a very real way!!! There was no one like Aline!!!",
         "Interesting drama which bristles with pungent, often very amusing dialogue. Two sisters (a homely, bossy man-hater and a restless younger beauty who likes to kick up her heels) battle amongst themselves while running a filling station/diner/motel in the California desert; a pair of casual-acting bank robbers stop in one afternoon on their way to the border, one of whom knows the elder sister very well. Adaptation of Leon Abrams and George Abbott's play ran into trouble with the Catholic Legion of Decency in 1934--one presumes over the frank talk and implications of man-woman intimacy--yet the most surprising thing about this piece is the fact Aline MacMahon's plain, resentful Olga has a romantic past at all! Possibly conceived at one point as a lesbian, the character of Olga (who trades in her head-bandanna and dungarees for make-up and a frilly dress) is the story's central focus, and yet she doesn't emerge as a convincing, fully thought-out creation. The material goes noticeably soft at the halfway mark to accommodate Olga's actions, making the censorship stories even more ridiculous in hindsight. Still, the film has a quick pace and a lively cast, colorful patter between the guests, and a satisfying finish. **1/2 from ****",
         "... must have been filmed around Joshua Tree or Lone Pine.. unfortunately, no locations listed as of March 2010. Warner Brothers shortie... but TCM host Robert Osborne mentioned that the Catholic League wanted changes made, so I wonder if the original play was longer or even naughtier. Also loved seeing Frank McHugh & Aline MacMahon... McHugh was toned way down for this part...he's funnier and louder in some of his other roles; MacMahon was the big star of this one.... as one of the female mechanics (sisters) that run the gas station, they come REAL close to being lesbians, whether or not that was the intention... Jerry, her ex says: \"you're right... you changed plenty!\" and when Myra goes out with a guy, her sister Olga gives her hell when she gets back. When the folks in the car insist it'll take a \"darn good man\" to get the radiator cap off, Olga opens it, no problem. Fun, quick story, even if i'm not really sure what we learned.. I thought it had a lot in common with Key Largo, but lesser known actors in this one.",
         "Grease monkey Aline McMahon (as Olga) runs a \"Service Station and Auto Camp\" in the California desert, with help from attractive little sister Ann Dvorak (as Myra). Ms. MacMahon takes care of gas and gaskets (outside), while Ms. Dvorak serves cold beer and Coca-Cola (inside). MacMahon has sworn off cabarets, after a bad relationship - but, innocent Dvorak wants to go out and have fun. There are opportunities in the middle of the desert, as frequent travelers abound. While discouraging Dvorak, MacMahon has second thoughts about the male gender after old flame Preston Foster (as George, but MacMahon still calls him \"Jerry\") chances by the station, with \"peeping Tom\" pal Lyle Talbot (as Jeff). The pair are on the lam, after a bank heist and double-murder. MacMahon covers for Mr. Preston, when the sheriff comes looking for the crooks. MacMahon seems ready to re-succumb to Preston's masculine charms, but may want to reconsider\u0085 Everyone pretends to be hot, but Mervyn LeRoy's \"Heat Lightning\" is all subtest, and no steam. The cast is fun, though. ***** Heat Lightning (3/3/34) Mervyn LeRoy ~ Aline MacMahon, Preston Foster, Ann Dvorak, Lyle Talbot",
         "Heat Lightning (1934) ** 1/2 (out of 4) Sisters Olga (Aline MacMahon) and Myra (Ann Dvorak) run a small gas station in the Arizona desert where they fight about the youngest sisters wants when it comes to a different life. Throughout the day a wide range of people stop by the shop including a couple thugs (Preston Foster, Lyle Talbot) who are wanted for killing a couple men and one of them has a past relationship with Olga. This crime picture from Warner certainly isn't among their best but the nice cast and short 64-minute running time makes it a nice little gem as long as you don't go in expecting too much. The first starts off with quite a bit of innuendo around the older sister Olga and her constantly putting men down. The way she dresses, talks and acts, it really does seem like this could have been shown during TCM's look at gay and lesbian images in early Hollywood. Her behavior is explained as the film goes along but that is certainly one thing that really jumped out. For the most part the characters really aren't all that interesting and the only reason one would pay close attention to them is because the studio cast some very familiar faces and especially to those who enjoy their \"B\" movies. Both MacMahon and Dvorak are good in their parts of the battling sisters and both Foster and Talbot could play heavies in their sleep. The four have some pretty good scenes together and especially MacMahon and Foster when it comes to talking about their past. The cast also includes Glenda Farrell playing a sexy idiot, Frank McHugh her driver and we even get Ruth Donnelly and Edgar Kennedy in small bits. The screenplay is full of the typical stereotype characters you'd expect in a film like this but the most disappointing thing is that not much happens throughout the running time. The movie is certainly leading up to final showdown but nothing ever really happens and there just aren't enough twists or turns to keep any sort of drama going. The movie does include a terrific looking set as I thought the diner was good enough to offer up some terrific shots and especially those where the camera just looks around the insides and there being windows everywhere. This allows one to get a 360-look around the place. Some pre-Code elements add to the fun but the main draw here are the actors.",
         "That was how the cast of 'Seinfeld' described their show. But they were beaten to the punch in 1934 by Warner Bros. with the release of \"Heat Lightning\", a static and unfunny comedy/drama taken from the Broadway show of the same name. The beginning was the best part, with Edgar Kennedy and Jane Darwell as a bickering married couple. It made you think that the best was yet to come, but no. The rest of the film is loaded with unnecessary, awkward situations and with the actors seeming ill at ease and mouthing stilted and clumsy dialogue which often falls flat. I cannot believe George Abbott had a hand in the movie script and must have been credited since he wrote the play, because this script is poorly written and lacking humor in humorous situations. This was a shame because Warners had assembled a great cast but saddled them with a boring story which lacks action and energy. Ann Dvorak, an excellent actress, comes off as whiny and annoying and Ruth Donnelly could have sued the script writer, her comic lines were so prosaic. And a contributor mentioned 'Key Largo'?! There is no similarity at all. \"Heat Lightning\" ran only 44 performances on Broadway for a reason, and I'll bet it wasn't the depression. The four rating points are for the cast despite the fact they were mistreated.",
         "If you can get over the unlikely pairing of ALINE MacMAHON and PRESTON FOSTER as former lovers and stand the desert heat at a motor court stranded in the middle of nowhere, you may be able to accept some of the melodramatics of HEAT LIGHTNING. Nevertheless, I have to agree with The N.Y. Times when it summed it up as: \"Drab melodrama with occasional flashes of forced comedy.\" The forced comedy is supplied by RUTH DONNELLY and GLENDA FARRELL as two rich dames being chauffeured by FRANK McHUGH, and in an early scene, JANE DARWELL and EDGAR KENNEDY as a bickering married couple who stop by for car repair and a coke. Otherwise, it's pretty dreary stuff, with Foster trying to con McMahon and her sister (ANN DVORAK) out of some money in their safe. The downbeat ending only emphasizes the dreariness of the plot which seems to go nowhere fast."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["In the Mohave Desert, Olga runs a gas station, lunch counter, and auto camp with her younger sister Myra. In a 24-hour period, Olga must deal with Myra's desire to go to a town dance with a cad, the appearance by happenstance of George, an old boyfriend whose conduct is never above suspicion, and the overnight presence of two women recently divorced in Reno, who, with a chauffeur, are carrying valuable jewels. George gets wind of the jewels and plays with Olga's heartstrings to set up a robbery. Myra arranges to sneak off with her beau. It's hot, and the heat lightening is crackling on the horizon. Is Olga's life of peace and hard work in the desert about to change for the worse?"],
      "budget": 0
   },
   "movielensId": 124709,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-03-03",
      "dvdReleaseDate": null,
      "directors": ["Mervyn LeRoy"],
      "runtime": 63,
      "movieId": 124709,
      "title": "Heat Lightning",
      "mpaa": "",
      "actors": [
         "Aline MacMahon",
         "Ann Dvorak",
         "Preston Foster",
         "Lyle Talbot",
         "Glenda Farrell",
         "Frank McHugh",
         "Ruth Donnelly",
         "Theodore Newton",
         "Willard Robertson",
         "Harry C. Bradley",
         "James Durkin",
         "Jane Darwell",
         "Edgar Kennedy",
         "Muriel Evans",
         "Jill Dennett",
         "Sam Hayes",
         "Chris-Pin Martin",
         "Margareta Montez",
         "Eddie Shubert"
      ],
      "imdbMovieId": "0025228",
      "originalTitle": "Heat Lightning",
      "genres": [
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["L1PsSyC9wRw"],
      "plotSummary": "A lady gas station attendant gets mixed up with escaped murderers.",
      "tmdbMovieId": 87123,
      "avgRating": 3,
      "releaseYear": "1934",
      "numRatings": 1,
      "posterPath": "/bZNbsrlJWLOEHWy7iL6Vkpt7wYO.jpg"
   }
}