{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0185143",
      "video": false,
      "title": "The Adventures of Tom Thumb & Thumbelina",
      "recommendations": [
         207451,
         36790,
         19667,
         19809,
         68665,
         29098,
         22792
      ],
      "backdrop_path": "/A3ou9OA1463EFJGOW1SWlZNcVZW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Thumbelina",
               "gender": 1,
               "credit_id": "52fe4687c3a368484e095ba3",
               "name": "Jennifer Love Hewitt",
               "profile_path": "/kp8cLdEivtJD5yu8Ij8xMeZ1Jc8.jpg",
               "id": 33259,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tom Thumb",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095ba7",
               "name": "Elijah Wood",
               "profile_path": "/hHzLAVspGGuPg1KW5JAEsyRvnUT.jpg",
               "id": 109,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "The Mole King",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bab",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Roman / King Webster",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bb3",
               "name": "Michael Chiklis",
               "profile_path": "/fkJnjCERaqOky0gJrSHmwjQ9oOZ.jpg",
               "id": 19654,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Leola",
               "gender": 1,
               "credit_id": "52fe4687c3a368484e095bb7",
               "name": "Yvette Freeman",
               "profile_path": "/15M4tIAp3N4z3bMhFEJj3kUjxtp.jpg",
               "id": 167146,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bbb",
               "name": "Robert Guillaume",
               "profile_path": "/6lXvLF1v4wpW1uLDIjti3WuSoAX.jpg",
               "id": 8294,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Albertine",
               "gender": 1,
               "credit_id": "52fe4687c3a368484e095bbf",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "The Bug Collector",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bc3",
               "name": "Jack Johnson",
               "profile_path": "/3yI4yZkVbvwXSOUmg6YHCalcc2S.jpg",
               "id": 135526,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Margaret Beetle",
               "gender": 1,
               "credit_id": "52fe4687c3a368484e095bc7",
               "name": "Jane Leeves",
               "profile_path": "/wioqL9owN0Rap04qeGXchc7fi20.jpg",
               "id": 52951,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Vargas Mouse",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bcb",
               "name": "Esai Morales",
               "profile_path": "/qeOm5PAxV0vDg5l9l0oqZsZg7PR.jpg",
               "id": 65344,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Thumbelina's mother",
               "gender": 1,
               "credit_id": "52fe4687c3a368484e095bcf",
               "name": "Bebe Neuwirth",
               "profile_path": "/xm58rpMRVDHS0IGttw1pTlqGwkN.jpg",
               "id": 10739,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Shelley Beetle",
               "gender": 1,
               "credit_id": "52fe4687c3a368484e095bd3",
               "name": "Emma Samms",
               "profile_path": "/dSkHW1DogK1DdvRN6YEb5HGvtvX.jpg",
               "id": 47901,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Godfrey",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bd7",
               "name": "Jon Stewart",
               "profile_path": "/88UHrwCXTPOrrsG2A33G4fMvN62.jpg",
               "id": 12219,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Gibson Mouse",
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095bdb",
               "name": "Yul Vazquez",
               "profile_path": "/d4MEi4pl2YvY7zHniiN6rQ4lQVx.jpg",
               "id": 75604,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4687c3a368484e095be1",
               "name": "Glenn Chaika",
               "profile_path": null,
               "id": 150047,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4687c3a368484e095be7",
               "name": "Willard Carroll",
               "profile_path": null,
               "id": 12227,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 1.734533,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62670,
      "vote_count": 9,
      "budget": 0,
      "overview": "Voiced by Elijah Wood, Jennifer Love Hewitt and others, this film features Tom Thumb and Thumbelina, the tiny, famed fairy-tale favorites, who are together for the first time in this heartwarming, magical musical story about courage and friendship.After 15 years, the two reunite and remember when their village was destroyed by a giant. Soon, they find out that they have neat powers they can use for good.",
      "similar": [],
      "original_title": "The Adventures of Tom Thumb & Thumbelina",
      "runtime": 75,
      "poster_path": "/yPCotvclRKVmodFANtg0j07auJE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Philippine Animation Studio Inc.",
            "id": 18557,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hyperion Pictures",
            "id": 7339,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Miramax",
            "id": 53009,
            "origin_country": ""
         }
      ],
      "release_date": "2002-08-06",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Glenn Chaika"],
      "runtime": 75,
      "synopsis": null,
      "writers": ["Willard Carroll"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0185143/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY2MjIyNzgxNF5BMl5BanBnXkFtZTcwMzM3MDQyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jennifer Love Hewitt, Elijah Wood, Peter Gallagher | See full cast and crew »"],
      "reviews": [
         "...personally I didn't find it all that great. It had some cute and funny moments, and in general a decent vocal cast, but... the story and animation, in my opinion that is could've been better. Now don't get me wrong, I love the Hans Christian Andersen fairytale and I love the story of tom thumb, plus I have loved animation for as long I can remember so upon hearing The Adventures of tom thumb and Thumbelina didn't seem too bad. Also I am one of those people who actually likes the Don Bluth film Thumbelina, it is not an absolute favourite and had some problems but I for one found it enjoyable. The Adventures of tom thumb and Thumbelina isn't all bad though. The biggest strength is the character of Thumbelina. If there is one thing I prefer here above the Don Bluth film, it is how Thumbelina is portrayed here. As much as I love Jodi Benson who voiced Thumbelina in Don Bluth's film, I much prefer her as Ariel. Thumbelina was cute in the Don Bluth film but nothing more. This Thumbelina has spent years of people telling her what to do, she speaks with authority, she is independent and knows what she wants plus she gets to make her own choices at the end. This Thumbelina had spunk and determination. Another key pro was the voice over of Jennifer Love Hewitt, she sings beautifully and it suits the character well. She starred in Garfield and Hunchback of Notre Dame 2, neither of which were particularly good, but Jennifer was one of the redeeming qualities of both films, she has a very endearing personality and I think it comes through when she voices Thumbelina. Thirdly, the song I am so all Alone, a beautiful, poignant lament beautifully sung, easily one of the more memorable songs of the film if no Let Me Be Your Wings. Peter Gallagher seems to be having fun as the Mole King, a character that can be sinister but also funny, even if he quotes a considerable amount of Richard III throughout the course of the film and Robert Guillaume while his role is brief is touching. Jon Stewart is not bad at all as Godfrey, I am not that fond of the character, but Stewart's vocal was above decent. Alas, there are some assets that don't work. One is that I personally don't think the animation is that great. The backgrounds and colours are shoddy at times, and some of the characters's sizes keep changing, especially the Mole King who seemed to be getting bigger and bigger every time he appeared. While I am so all Alone is beautiful, the other songs aren't as memorable. Welcome to my hole was entertaining, but it didn't stick in my head for long, and Cha Cha Cha while cute was forgettable. Though it was nice to hear Brad Kane again, apart from starting off key he sounded charming. Then there is the story, I loved the premise and it started off fine, but the pacing was uneven and there were times where too long was spent on not-so-important scenes. The dialogue isn't anything noteworthy, it has some humorous and sweet moments but there are also parts that are cringe worthy. Then there is the case of Elijah Wood. I think tom was a cute character, and I felt sorry for him because he was ridiculed for his size. However, Wood was less than convincing voicing him, so tom's personality felt somewhat bland. Maybe I am being biased as I don't care for Wood that much, he has given some decent performances but not anything that I would rave about. Overall, it was cute and Jennifer Love Hewitt was great, but the film on the whole is not. 5/10 Bethany Cox",
         "This film is racist for a 2002 animated family movie. If you are looking for a wonderful nice family musical movie, go get Singin' in the rain it's so much better than tom thumb & Thumbelina but this one just ruined the older thumbelina and tom thumb which are the 2 classic ones. If they wouldn't have changed these stupid characters and put the great older drawn ones in this one, this film would be a classic too and this movie does not have enough music to make a musical movie. This movie was lame 'cause look at this Script - was heartwarming and dramatic, but if i made the movie poorly like this, i would reject the movie and say sorry Grade: C Storyline - Not really what it's really about it's about a young sullen teenager and a boy is looking for some other little people in the village and they combine to marry each other but they get trapped underground where a mole wants to marry thumbelina so that short storyline seems like it's written by a dumb 5 year old Grade: d+ Music - My favorite song was welcome to my hole (something like that) but the other songs were cute expect one two cha cha cha which that was not so good Grade: -B Characters - Do i have to say this?? The characters were very poorly drawn they look like they've been sketched by a 6 yr old Is this unforgettable? Dude NO!! I've seen this last year so it's been awhile then months ago i think i done forgot the whole entire movie couldn't remember thumbelina being sullen or in the circus now i know Thumbelina has knee addiction problems because evry once in a while she puts her head on her knees looking like she's going to cry on them and towards the end she actually did and I was like \"If you don't stop I'll get Amy Rose to fix your actions\" But whatever... Don't watch this crap it's awful.",
         "It was but two and a half years ago that I saw an ad for this Miramax/Hyperion straight-to-DVD release on TV. From what I saw in it, I hoped it was nice and looked forward to it. Then, on the morning of Sunday, February 20th, at noon, it premiered on the Disney Channel. Still expecting something nice, I gave it my best shot... And what can I say? From the looks of things, DTV cartoons don't get any much worse than this... It's such a living shame that the studio who brought a talking toaster and his friends to the world in the 80's--by that I mean Hyperion--is setting its standards down in this horrible marriage of two famous fairy tales. The animation is the most cheaply-made I have ever encountered, some of the lines are among the industry's bluest, and the musical rampage--well, what can I ever think about that?--is just forgettable. The film suffers mainly in its two biggest problems: 1) Elijah Wood--aka Frodo the Hobbit--starring as Tom, among all people?! As miscast as \"The Wiz's\" Diana Ross playing a grown-up Dorothy, and \"Hook's\" Robin Williams in the role of (ironically) the boy who never grew up, Peter Pan. Why couldn't they get anyone younger than that? 2) Just how on earth can two people, who have never met each other, reunite?!! One of the biggest plot holes ever discovered in a cartoon. (Indeed...you have been WARNED!!!) Even puzzling is the participation of Bebe Neuwirth from \"All Dogs 2\", as Thumbelina's mom, and...\"America\" author Jon Stewart? So, for those before me who have watched it, I urge you to steer clear of this mess, and stick with either the 1994 Don Bluth version of \"Thumbelina\", or MGM's 1959 adaptation of \"tom thumb\"! ALSO RECOMMENDED: Pirates of the Caribbean 1, the LOTR trilogy, The Triplets of Belleville, Sen to Chihiro... (Spirited Away), Pokémon Heroes: Latios and Latias, The Brave Little Toaster, and the Shrek films. 6\\10 -- A good watch for all its detestable worth, but (unless you're under age 5 and don't have any good sense of Hollywood) not worth watching again in your lifetime.",
         "These days cartoons are getting worst and worst. The nice story is somehow lost, when too much of singing is added. Also, the characters aren't created anymore to look nice and funny, the graphics aren't nice and the whole movie is boring..."
      ],
      "genres": [
         "Animation",
         "Family",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "Hyperion Pictures",
         "Miramax",
         "Philippine Animation Studio Inc."
      ],
      "summaries": ["When two tiny people reunite fifteen years after their village was ransacked by a giant, they learn that they were very special people in the village."],
      "budget": 0
   },
   "movielensId": 124889,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-08-06",
      "dvdReleaseDate": null,
      "directors": ["Glenn Chaika"],
      "runtime": 75,
      "movieId": 124889,
      "title": "The Adventures of Tom Thumb & Thumbelina",
      "mpaa": "G",
      "actors": [
         "Jennifer Love Hewitt",
         "Elijah Wood",
         "Peter Gallagher",
         "Michael Chiklis",
         "Yvette Freeman",
         "Robert Guillaume",
         "Rachel Griffiths",
         "Jack Johnson",
         "Jane Leeves",
         "Esai Morales",
         "Bebe Neuwirth",
         "Emma Samms",
         "Jon Stewart",
         "Yul Vazquez"
      ],
      "imdbMovieId": "0185143",
      "originalTitle": "The Adventures of Tom Thumb & Thumbelina",
      "genres": ["Animation"],
      "youtubeTrailerIds": [],
      "plotSummary": "Voiced by Elijah Wood, Jennifer Love Hewitt and others, this film features Tom Thumb and Thumbelina, the tiny, famed fairy-tale favorites, who are together for the first time in this heartwarming, magical musical story about courage and friendship.After 15 years, the two reunite and remember when their village was destroyed by a giant. Soon, they find out that they have neat powers they can use for good.",
      "tmdbMovieId": 62670,
      "avgRating": 2.3,
      "releaseYear": "2002",
      "numRatings": 5,
      "posterPath": "/yPCotvclRKVmodFANtg0j07auJE.jpg"
   }
}