{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "switzerland",
            "id": 1223
         },
         {
            "name": "mountain",
            "id": 1262
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "girl",
            "id": 14659
         },
         {
            "name": "alps",
            "id": 160175
         },
         {
            "name": "swiss alps",
            "id": 160176
         },
         {
            "name": "governess",
            "id": 165468
         },
         {
            "name": "picturesque",
            "id": 205614
         }
      ],
      "imdb_id": "tt0063051",
      "video": false,
      "title": "Heidi",
      "recommendations": [],
      "backdrop_path": "/ofen5E5HEmiobdK2HlJgXcCJkVy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Heidi",
               "gender": 1,
               "credit_id": "52fe46b89251416c9105d6ad",
               "name": "Jennifer Edwards",
               "profile_path": "/lA3OGv3DNbe4cs6yOGULTh9NOlw.jpg",
               "id": 120412,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Grandfather",
               "gender": 2,
               "credit_id": "534da1a4c3a36867a70004bb",
               "name": "Michael Redgrave",
               "profile_path": "/eQwqBfCucvLhQIKz23SzN3z6wN7.jpg",
               "id": 7640,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Richard Sessemann",
               "gender": 2,
               "credit_id": "534da1c3c3a368678800050a",
               "name": "Maximilian Schell",
               "profile_path": "/xhjyQpOmwDwU48Kq2b1XCEO9G7E.jpg",
               "id": 12150,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Frl. Rottenmeier",
               "gender": 1,
               "credit_id": "534da1dfc3a36867a1000513",
               "name": "Jean Simmons",
               "profile_path": "/lVE40Hx4s2VI2nPxkNaF0hBjPw9.jpg",
               "id": 14500,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Father Richter",
               "gender": 2,
               "credit_id": "534da1f3c3a368678800050e",
               "name": "Walter Slezak",
               "profile_path": "/1XOOkCtIMjsYGF2lJsIcZMw7UTx.jpg",
               "id": 37884,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dr. Bernd Reboux",
               "gender": 2,
               "credit_id": "534da20fc3a3686782000551",
               "name": "Peter van Eyck",
               "profile_path": "/xXkWcMKcFSEiupgII0VMCt942Zz.jpg",
               "id": 2567,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Klara",
               "gender": 0,
               "credit_id": "534da256c3a368678e00050d",
               "name": "Zuleika Robson",
               "profile_path": null,
               "id": 938125,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Peter",
               "gender": 2,
               "credit_id": "534da2c9c3a36867a70004d6",
               "name": "John Moulder-Brown",
               "profile_path": "/5yxjSbveqfwGkVEqmfuECnLYVQE.jpg",
               "id": 32061,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Grandmother",
               "gender": 1,
               "credit_id": "5a861d649251410ac402ab5a",
               "name": "Elisabeth Neumann-Viertel",
               "profile_path": null,
               "id": 1364175,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Sebastian",
               "gender": 2,
               "credit_id": "5a861d719251410ac402ab65",
               "name": "Karl Lieffen",
               "profile_path": "/dOMfI7FIouimvvw5nsbCd8WaAqB.jpg",
               "id": 5797,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "534da15dc3a36867b00004d5",
               "name": "Delbert Mann",
               "profile_path": "/og3XZHwLtTjoxD2hNdORK2vXT67.jpg",
               "id": 67451,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "534da16ec3a368679500050f",
               "name": "Earl Hamner, Jr.",
               "profile_path": null,
               "id": 61479,
               "department": "Writing",
               "job": "Teleplay"
            },
            {
               "gender": 1,
               "credit_id": "534da181c3a3686788000502",
               "name": "Johanna Spyri",
               "profile_path": null,
               "id": 129693,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "58bbbce3925141609b034889",
               "name": "John Williams",
               "profile_path": "/2Ats98PB1SH2yfEPikiLdhRuXZm.jpg",
               "id": 491,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58bbbceac3a368664d033f2b",
               "name": "Klaus von Rautenfeld",
               "profile_path": null,
               "id": 37659,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58bbbd039251416077035ef4",
               "name": "Frederick Brogger",
               "profile_path": null,
               "id": 981533,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58bbbd0bc3a368664d033f43",
               "name": "James Franciscus",
               "profile_path": "/wvu1kkLNnvWTz6G0JoxSFCf1BxR.jpg",
               "id": 18643,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58bbbd12925141609e03372d",
               "name": "Gyula Trebitsch",
               "profile_path": null,
               "id": 46188,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58bbbd1ac3a368515d017ce2",
               "name": "Donald J. Cohen",
               "profile_path": null,
               "id": 1464746,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58bbbd20925141609e033737",
               "name": "Mathias Matthies",
               "profile_path": null,
               "id": 32551,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58bbbd299251416077035f12",
               "name": "Ellen Schmidt",
               "profile_path": null,
               "id": 26417,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "58bbbd31925141606b03671b",
               "name": "Irms Pauli",
               "profile_path": null,
               "id": 38118,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.704343,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 38427,
      "vote_count": 6,
      "budget": 0,
      "overview": "Heidi is an orphaned girl initially raised by her aunt Dete in Maienfeld, Switzerland. In order to get a job in Frankfurt, Dete brings 5-year-old Heidi to her grandfather, who has been at odds with the villagers for years and lives in seclusion on the alm. He at first resents Heidi's arrival, but the girl manages to penetrate his harsh exterior and subsequently has a delightful stay with him and her best friend, young Peter the goat-herd.",
      "similar": [
         5925,
         16436,
         11236,
         15121,
         13,
         11224,
         278927,
         10545,
         253412,
         290512,
         281957,
         44826,
         44115,
         267935,
         120,
         668,
         340837,
         310593,
         978,
         9350
      ],
      "original_title": "Heidi",
      "runtime": 105,
      "poster_path": "/vMUuMmiv9BMUlIlHSQh25LnmdKZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Studio Hamburg Filmproduktion",
            "id": 680,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Omnibus-Biography Productions",
            "id": 23163,
            "origin_country": ""
         }
      ],
      "release_date": "1968-11-17",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Delbert Mann"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Earl Hamner Jr.",
         "Johanna Spyri"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063051/",
      "coverLink": null,
      "actors": [
         "Jennifer Edwards",
         "Michael Redgrave",
         "Maximilian Schell"
      ],
      "reviews": [
         "This is a good dramatization of Johanna Spyri's \"Heidi.\" It stays closer to the original plot line than some others (i.e.--Shirley Temple's). All of the actors and actresses (young and old) do a very good job with the material. Of course, one must expect a certain amount of one-sidedness of characters such as Grandfather. His character is too deep to explore in such a short movie, but his characterization is certainly adequate. This is doubtlessly a movie for kids. If you're looking for something deeper, go elsewhere. It is fun: the kids enjoyed it, and mom did too. (Maximilian Schell is VERY handsome as Herr Sessemann). I borrowed this movie but will definitely buy a copy for our family.",
         "Very good version of the familiar story of Heidi.Children will like it and so will parents.This version has Maximilian Shell as Heidi's uncle (father of the crippled girl Clara).Lovely Jean Simmons is Clara's governess who is (unknown to him) in love with Heidi's uncle. The romance is sweet and so is the rest.The whole cast does a good job and it is VERY well done...scenery is beautiful.Jean Simmons is the great jewel here but it's all a fine version of Heidi.",
         "Actually the cast were stunning, Jean Simmons, Michael Redgrave, Maximilian Schell. The scenery was spectacular also. However the grandfather's role was too thin, there should have been more depth to his character apart from a guy who did not want his daughter to ever leave and as a result refused to play the organ again and lived as a recluse. Some of the scenes between Heidi and her grandfather and uncle are quite touching. Jean Simmons is wonderful and makes the most of her part as a governess in love with the uncle. 6 out of 10 by me, 9 out of 10 from the child in my life.",
         "Heidi was one of my favorite books as a child, and I have been disappointed in all the filmed versions. This one annoyed me in particular because it changed a key part of the plot. In the book, Heidi is miserable in Frankfurt not only because she misses Switzerland but because Fräulein Rottenmeier is so mean to her. One gets the impression from the book that this character is a bitter, uptight older woman who takes out her frustrations on the energetic and non-conforming Swiss child. So who plays Fräulein Rottenmeier in this version? Jean Simmons, who was still in her thirties and quite glamorous looking. She was so not only portrayed as being really sweet and understanding, but also as being in love with Klara's widowed father. In other respects, the TV movie follows the book quite faithfully and was well acted, especially by the girl who played Klara, so the addition of a love interest seems quite unnecessary.",
         "A very nice production of the classic Swiss tale is sadly only remembered for an infamous gaffe that NBC made in not delaying the broadcast until the final quarter of a New York Jets-Oakland Raiders game was finished. I still remember from my youth the newspaper headlines and this game being referred to as Heidi Bowl. Today there is no network who would break from a sporting event the way NBC did. This was a British production with Jennifer Edwards in the starring role of the little orphan Swiss girl come to live with her grandfather played here properly stern by Michael Redgrave. He can barely support himself so he sends her off to the home of Maximilian Schell whose daughter Zuleika Robson is paralyzed to be a companion. Schell's a busy guy and the doctor Peter Van Eyck thinks that the paralysis might be a psychological reaction from a lonely child. Apparently the English countryside stood in for the Swiss Alps. It served the producers well because I really did think it was the Alps. The cast is uniformly fine and the presence of Walter Slezak as the village priest, Jean Simmons as Robson's governess and John Moulder- Brown as the village kid whom Heidi bonds with also must be noted. Parents of today this is a classic you can share with your kids and they can see it for its own merits not it's unfortunate and unasked for history.",
         "I have yet to see the definitive version of Heidi, but none of the versions are bad at all(have yet though to see the Emma Bolger version). Personal favourite goes to the Shirley Temple film, not the truest to the book but it was funny, moving and with a lot of charm, the Jetlag animated film is beautifully done surprisingly and Noley Thornton's is handsomely rendered and well acted but is over-dramatic in places and some of the characters were too hostile(especially the grandfather, don't get me wrong I do like it still). This 1968 film is very good too, more could have been done with the grandfather with more of a character growth but thankfully he's not too one-dimensional and he is not too hostile either. In fact that the characters are more sympathetically treated than in the Noley Thornton version is most admirable, but a couple especially Fraulein Rottenmeier(from a truly beastly character to a love interest) are in some way too sympathetic and somewhat \"sugar-coated\". There is a fair bit of conflict in the book but in the film it's in the complex emotions of the grandfather and Clara being a brat at times. Despite all this, Heidi(1968) does deserve to stand on its own and stand on its own it does and very well. The Alps scenery is gorgeous and is photographed with care and love. John Williams' score is typically lush and beautiful, not overbearing the charming nature of the story in any way. The film is smartly and thoughtfully scripted and while the story is not always faithful in detail to the book it is in spirit(more so than the other three adaptations seen), maintaining a gentle heart-warming tone throughout without throwing in any dark or over-dramatic bits. The ending is as it should be, truly emotional. The direction is controlled but keeps the film moving in an engaging way, and the film is very well-acted throughout, especially by a radiant Jean Simmons and a crusty yet heartfelt Michael Redgrave. Jennifer Edwards' Heidi is not quite as interesting as Shirley Temple's(who brought more dimension to the character much more than one would expect) but is just as interesting, a very warm performance that sprinkles with strong-willfulness and charm. Clara could have been much more gentle and not so much a brat, but she is still very movingly and passionately played Zuleika Robson. Maximillian Schell is very memorable by how truly handsome he is here and he is a likable father figure here too. Peter and the grandmother are good too. To conclude, a charming and worthy if not definitive adaptation of one of the childhood classics. 8/10 Bethany Cox",
         "Like the Orson Welles' fictionalized martian invasion, no one saw it coming. Just watched this version of Heidi on TBN, a religious station. So this was the infamous Heidi that interrupted the football game, eh? It watched well. Good strong story, I thought, very effective for the time it represented. Not too steeped in late 1960s fasions, as often plagues movies that take place in time periods other than when they are filmed. No, I haven't read the book. I only saw the Shirley Temple version a little over a year ago and was rather amused by the chase scene and villainous fraulein, tho as another review says, the fraulein wasn't nice in the book. Nevertheless, sometimes villains aren't missed when they are removed, and in this instance, I wasn't disappointed with Simmons in the role. Yes, she was very lovely. Actually this was rather the story of Heidi I always thought it was, as I first read the tale in a little golden book, and there was no villianess, and the ending was with Clara in the mountains regaining her ability to walk. Shirley Temple's version had none of this. As I watched this film, in my usual begrudging way, I bemoaned how this version didn't air on holidays during the 1970s, but as I observed, I realized I had indeed seen some of this show before, so it wasn't completely banished from TV by hurt feelings over the ball game. A recent VH1 special, 100 (or 50 or whaddevuh) Most Unexpected Moments In TV, would declare that it didn't want to focus on age old things such as Lucy Ricardo's pregnancy and the JFK assassination, but on more recent talked about events, so this meant moments on shows such as Desperate Housewives, Melrose Place, Sopranos and Six Feet Under getting all the gab, but it did manage to find past outstanding events, and lo and behold, Heidi Bowl made the list. Jennifer Edwards would appear and said on her tombstone when she passed, it would mention her as Heidi Bowl. I hope this isn't all she thinks she will be known for, because she wasn't a terrible child actress, and nor was the movie awful.",
         "Again, I'd never read the favorite children's book or watched any of the various film versions of this one (though the 1937 Shirley Temple vehicle directed by Allan Dwan is scheduled to screen on Italian TV this very week), so I wasn't familiar with the plot line \u0096 other than that it had a mountain setting. As it turned out, HEIDI proved surprisingly tolerable if hardly exciting fare \u0096 sentimental but undeniably moving, generally pleasant (despite the generous 110-minute length), and well acted by a stalwart cast: the heroine was played by Blake Edwards' daughter, Jennifer, and she was supported by Maximilian Schell, Jean Simmons, Michael Redgrave, Walter Slezak, Peter van Eyck, and John Moulder-Brown as Heidi's young shepherd-boy friend. The story deals with an orphaned girl who finds herself torn between living with her gruff and hermit-like grandfather (Redgrave) and a wealthy uncle (Schell), who has a crippled daughter resenting the intrusion. Needless to say, Heidi's influence softens everyone towards a happy ending \u0096 subplots involve Schell's muted relationship with governess Simmons, Redgrave's religious conflicts (benevolent clergyman Slezak, then, wants him to pick up his organ-playing activity at the church) and the crippled girl's recovery (she's entrusted in the care of doctor van Eyck, but it's Redgrave's unorthodox 'treatment' which finally reaps results).",
         "Good God, let's just hope Shirley Temple didn't watch this version. It's so horrifically bad, it's as if the screenwriter and director absolutely hated the original and decided to make the worst possible version of the story. It's really hard to imagine a worse interpretation. First off, the lucky little girl cast to play the title role was homely, awkward, unendearing, and a lousy actress. It was her first movie, and I have no idea how she caught such a lucky break. But if you're fast-forwarding every time Heidi comes on the screen, that doesn't bode well for you overall enjoyment of the film. Next up is Michael Redgrave as Grandfather. Grandfather is supposed to be a notorious recluse who hasn't interacted with anyone in years. Michael Redgrave doesn't act like a hermit in any way, shape, or form. He has no trouble adjusting to his granddaughter, and he frequently interacts with other characters in the film, with no lapse in social graces. In the story, Heidi lives with her grandfather until she's taken to live with the wealthy Herr Sessemann and his crippled daughter Klara. In the original, Klara is endearing and delightful, like her curly headed companion. In this version, she's also homely, a terrible actress, and her character is written to be a spoiled, mean-spirited brat. How can we root for someone like that? Also, in the original, Frauline Rottenmeier, Klara's governess, is the unequivocal bad guy. In this version, Rottenmeier is not only played by the beautiful Jean Simmons, but she's a good guy! There is no bad guy in the movie, and half the movie deals the romance between Rottenmeier and her boss Herr Sessemann, a plot point that was nonexistent in the Shirley Temple version. I kept fast forwarding through this horrible, horrible movie, until, at the very end, I got the giggles, consumed with the dreadful thought that it might not ever be over. Just save yourself. Watch the Shirley Temple version.",
         "Check out the 1937 version starring Shirley Temple, you won't be disappointed! This movie's claim to fame: On November 17, 1968, the New York Jets led the Oakland Raiders 32-29, with 50 seconds to go. It was the end of the hour, and even though the score was close, NBC switched over to the movie Heidi. In the next 42 seconds, Oakland scored two touchdowns to win 43-32. As a result, all NFL contests are now televised to their conclusion."
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Omnibus-Biography Productions",
         "Studio Hamburg Filmproduktion"
      ],
      "summaries": [
         "A young orphan is left to live with her estranged Grandfather, who lives like a hermit in the Swiss Alps. While he is cold and distant at first, he grows to love and cherish her; only to be faced with choosing her well-being over his own heart.",
         "Orphan Swiss girl Heidi cannot be cared for by her aunt Dete anymore and she is left in her grumpy grandfather's care up in the Alps where Heidi also meets young goat herder Peter."
      ],
      "budget": 0
   },
   "movielensId": 124951,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-11-17",
      "dvdReleaseDate": null,
      "directors": ["Delbert Mann"],
      "runtime": 105,
      "movieId": 124951,
      "title": "Heidi",
      "mpaa": "G",
      "actors": [
         "Jennifer Edwards",
         "Michael Redgrave",
         "Maximilian Schell",
         "Jean Simmons",
         "Walter Slezak",
         "Peter van Eyck",
         "Zuleika Robson",
         "John Moulder-Brown",
         "Elisabeth Neumann-Viertel",
         "Karl Lieffen"
      ],
      "imdbMovieId": "0063051",
      "originalTitle": "Heidi",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Heidi is an orphaned girl initially raised by her aunt Dete in Maienfeld, Switzerland. In order to get a job in Frankfurt, Dete brings 5-year-old Heidi to her grandfather, who has been at odds with the villagers for years and lives in seclusion on the alm. He at first resents Heidi's arrival, but the girl manages to penetrate his harsh exterior and subsequently has a delightful stay with him and her best friend, young Peter the goat-herd.",
      "tmdbMovieId": 38427,
      "avgRating": 1.5,
      "releaseYear": "1968",
      "numRatings": 1,
      "posterPath": "/vMUuMmiv9BMUlIlHSQh25LnmdKZ.jpg"
   }
}