{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "publisher",
            "id": 188994
         }
      ],
      "imdb_id": "tt0033596",
      "video": false,
      "title": "The Feminine Touch",
      "recommendations": [],
      "backdrop_path": "/hQZlOCOIqDjOlbzexeE0LbbmcBF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Julie Hathaway",
               "gender": 1,
               "credit_id": "52fe49789251416c750c90eb",
               "name": "Rosalind Russell",
               "profile_path": "/zXDvAzoz2hX9XW7i2AHHeIidOex.jpg",
               "id": 30233,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Prof. John Hathaway",
               "gender": 2,
               "credit_id": "52fe49789251416c750c90ef",
               "name": "Don Ameche",
               "profile_path": "/q4t9dds6jQuuqpMLvALbOqVJRFV.jpg",
               "id": 18156,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nellie Woods",
               "gender": 1,
               "credit_id": "52fe49789251416c750c90f3",
               "name": "Kay Francis",
               "profile_path": "/g1jkxUQpjucwWczcFRMX8Km8OmV.jpg",
               "id": 2434,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Elliott Morgan, Publisher",
               "gender": 2,
               "credit_id": "52fe49789251416c750c90f7",
               "name": "Van Heflin",
               "profile_path": "/suFqTm1wVopxWhJRNQLEl8MY1cr.jpg",
               "id": 18803,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Captain Makepeace Liveright",
               "gender": 2,
               "credit_id": "52fe49789251416c750c90fb",
               "name": "Donald Meek",
               "profile_path": "/zKB7cWdaXAi12lDOMlc85m1HiqV.jpg",
               "id": 14968,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Rubber-Legs Ryan",
               "gender": 2,
               "credit_id": "52fe49789251416c750c90ff",
               "name": "Gordon Jones",
               "profile_path": "/91zIzGmfwGBlD6evckB70mvJIie.jpg",
               "id": 103672,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Shelley Mason, Critic",
               "gender": 2,
               "credit_id": "52fe49789251416c750c9103",
               "name": "Henry Daniell",
               "profile_path": "/ciLKakcCO4oQhdHTgzSkSBiwoCj.jpg",
               "id": 10924,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Freddie Bond, Elliott's Lawyer",
               "gender": 2,
               "credit_id": "52fe49789251416c750c9107",
               "name": "Sidney Blackmer",
               "profile_path": "/ijI8tIlurlyyVTZYgZvoiifrMi3.jpg",
               "id": 12022,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Dean Hutchinson, Digby College",
               "gender": 2,
               "credit_id": "52fe49789251416c750c910b",
               "name": "Grant Mitchell",
               "profile_path": "/cDZpWgH0qOF4L5nmZJzGIHE5xo3.jpg",
               "id": 30215,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Brighton, Elliot's Butler",
               "gender": 0,
               "credit_id": "52fe49789251416c750c910f",
               "name": "David Clyde",
               "profile_path": "/rmDuFZw4pVzIOacxv0SDxiLNMA8.jpg",
               "id": 103185,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Dean Hutchinson's Secretary",
               "gender": 2,
               "credit_id": "5a149b31c3a36845f2000226",
               "name": "Harold Minjir",
               "profile_path": null,
               "id": 1005423,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Flower Delivery Boy",
               "gender": 0,
               "credit_id": "5a149bd8c3a36845f20002cb",
               "name": "Mickey Martin",
               "profile_path": null,
               "id": 1467054,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Subway Snake (Masher)",
               "gender": 2,
               "credit_id": "5a149bebc3a36845f20002e2",
               "name": "Bernard Nedell",
               "profile_path": "/nk34BsDof6fWeBtBvpAZRJTbedh.jpg",
               "id": 118257,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Nightclub Waiter",
               "gender": 2,
               "credit_id": "5a149bfac3a36845f5000328",
               "name": "William H. O'Brien",
               "profile_path": "/d8BySpwzgqv8rVezb0QbtXvmxbb.jpg",
               "id": 1176510,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Woman on Subway Train",
               "gender": 1,
               "credit_id": "5a149c0992514145c0000339",
               "name": "Anne O'Neal",
               "profile_path": "/doHlPs3Cjc8VowRGNgY4TjW1god.jpg",
               "id": 144370,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Telephone Operator giving the Time",
               "gender": 1,
               "credit_id": "5a149c2192514145c0000352",
               "name": "Frances Morris",
               "profile_path": null,
               "id": 115367,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Party Guest",
               "gender": 1,
               "credit_id": "5a149c3192514145b100034d",
               "name": "Cecil Cunningham",
               "profile_path": "/sNksWLUlYa6hVXDscUXBhX3tkEx.jpg",
               "id": 77160,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49789251416c750c9115",
               "name": "W.S. Van Dyke",
               "profile_path": "/npK68MUyjJD3gZHhF04xBaXnuqd.jpg",
               "id": 32427,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49789251416c750c911b",
               "name": "George Oppenheimer",
               "profile_path": null,
               "id": 70981,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe49789251416c750c9121",
               "name": "Edmund L. Hartmann",
               "profile_path": null,
               "id": 85841,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe49789251416c750c9127",
               "name": "Ogden Nash",
               "profile_path": null,
               "id": 1081968,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58293dd19251417b29033900",
               "name": "Ray June",
               "profile_path": null,
               "id": 16750,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.209299,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 95137,
      "vote_count": 2,
      "budget": 0,
      "overview": "A professor (Don Ameche) and his wife (Rosalind Russell) move to New York and confuse a publisher's romance with his assistant (Kay Francis).",
      "similar": [
         27066,
         28468,
         11004,
         283227,
         1586,
         1213,
         244772,
         64682,
         116,
         1903,
         713,
         705,
         11688,
         19913,
         862,
         194,
         2758,
         42888,
         222936,
         14160
      ],
      "original_title": "The Feminine Touch",
      "runtime": 97,
      "poster_path": "/kFlQ5OIkAecSx2QX1TeBlRbxr1V.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1941-10-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "If your sweetheart isn't jealous it's not l-o-v-e!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["W.S. Van Dyke"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "George Oppenheimer",
         "Edmund L. Hartmann"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0033596/",
      "coverLink": null,
      "actors": ["Stars: Rosalind Russell, Don Ameche, Kay Francis | See full cast and crew »"],
      "reviews": [
         "Strange, strange, strange. This does not feel anything like a typical Hollywood movie from 1941. At times, it feels almost like a proto-Woody Allen film, talky and intellectual and neutotic in a very Woody-like sort of way. And then there were a couple of moments when I thought of 60s-style European auteur cinema, especially Fellini. And then there are moments of standard Hollywood-style screwball comedy. And then there was that utterly bizarre and hilarious dream sequence with the Dali-esque set design--I was reminded of that dream sequence from Hitchcock's Spellbound. Three different writers are credited with the screenplay, and inconsistency in writing styles seems glaringly apparent as the film plays out. Subtle and witty at times, the writing becomes painfully clumsy and forced at others, especially when it goes for a broader style of comedy or when it tries to advance the plot. I don't know the story behind the making of this film, but it feels very tampered-with, like maybe it started with a clever and original screenplay, but the studio execs didn't trust it and so they hired a couple of hack writers to come in and dumb it down for the masses. It feels like it ALMOST could have been something of a classic. It's still very worth watching, though. The storyline is interesting and, in a way, seems about 30 years ahead of its time. I'd be particularly interested to hear a feminist scholar's take on the film. Do women really prefer a caveman to an intellectual, a protector to a partner? Despite the feminist movement, it still seems to hold true. Perhaps I should grow a beard.",
         "Any old film aficionado would be drawn to a film starring Rosalind Russell, Don Ameche, Van Heflin and Kay Francis, so it's no surprise that this poster tuned into \"The Feminine Touch,\" a 1941 comedy. The story concerns a college professor, John Hathaway (Ameche) who has written a very intellectual book on jealousy and travels with his wife (Russell) to meet his publisher Elliot (Heflin) and editor Nellie (Francis). Elliot likes to play around, and Nellie is in love with him. Julie keeps trying to make her husband jealous, not by deed but by hints that a certain man likes her, for instance, and is he worried - thinking that a jealous outburst would be proof of his love. However, he trusts her unreservedly and never suspects her of anything. He's especially sure that despite Elliot's interest in her, Julie would never reciprocate - because Elliot has a beard, and Julie hates them. This film is a case of too many cooks, as this screenplay was worked over by several writers. The premise is flimsy, for starters, and I fear Russell is miscast. Rosalind Russell in films is a beautiful woman, but she has a strength and intelligence about her as well. It's not an ingénue beauty. In the world of \"The Feminine Touch,\" despite her tailored suits, every man who meets her falls madly in love with her. I could have bought it if it had been Lana Turner. I'm not buying it here. Women like Russell are the \"whole package\" and men fall for her in a different way and probably after a conversation or two - not on sight. And then, to have a smart woman like Julie upset because her husband never gets jealous is ridiculous. It might bother an immature 18-year-old, but this character? The end of the film -- which comes about 15 minutes later than it should have - is the best part, as it turns into a more screwball comedy with Julie setting fire to Elliot's beard and other crazy things happening. Otherwise, the film drags on with too much dialogue. I'm not opposed to dialogue - All About Eve has a large amount of dialogue. This dialogue was superfluous, probably because a scene or two could have been tossed. Heflin proves himself as adept at comedy as he is at drama, Francis is delightful, as is Ameche, who makes a good professorial type. Someone mentioned the clothing - Francis wears one hat that looks like a rendition of the Mickey Mouse Club ears, except with taller ears and the entire hat covered in fur. It was one of the funniest things in the movie.",
         "This is a hilarious comedy! The whole cast is excellent - I was really impressed with Van Heflin who I'd never seen in comedy before. He was great, esp. at the ending when Don Ameche (who I ADORE) is chasing him around a tree! That is when I literally, was rolling on the floor laughing. Maybe I'm easily amused but it has to be seen. These guys are just SO funny! Rosalind Russell as usual, is great as Ameche's wife who tries to make her husband jealous and Kay Francis, who is always very good, shows she was an able comedienne. Her hairdo's and hats are another source of amusement. Supposedly Robert Ryan has a bit part in this but I didn't spot him! Check out Gordon Meek's characters name. It's another little joke! ;-)",
         "Very charming early 40's romantic screwball comedy. Don Ameche is a psychology professor at Digby College, which he decides to leave after being asked to pass a dimwitted football player so Digby can win an upcoming game. Prof. Hathaway is now free to publish his book on his theories on marital jealousy. Only he doesn't expect to be smitten with his editor, Kay Francis and likewise his wife, Rosalind Russell with Kay Francis' partner, Van Heflin. It's not heavy on plot; rather, its forte is in its snappy dialog, especially from Russell and Francis. Here is one thing I especially love about 40's/50's romantic comedies: the bachelor pads, such as Van Heflin's here! They're always large and usually have a sunken living room with lots of cool furniture. You go up three steps and behold! A grand piano! As if this weren't enough, Heflin's also got a log cabin retreat outside the city (NY). Other outstanding 1940's visuals: Kay Francis' outrageous hats. Francis looks even better here than in the 30's. She even reminded me somewhat of Sean Young in BLADE RUNNER. Other highlights include the make-up exam Prof. Hathaway gives to Rubber-Legs, the football player in question at the beginning, at the request of the dean. The questions are deliberately idiotic, but Rubber-Legs bows out with a headache! For more abuse of football players at the hands of professors I recommend Disney's THE MONKEY'S UNCLE (24 years later). Then there's the scene in the publisher's office where Ameche and Russell find claustrophobic Elliott Morgan (Heflin) locked in a closet by Nellie (Francis)! Funny seeing a bearded Heflin through the keyhole. There's also a lot of coffee preparing and drinking in this movie, and some kind of statement about beards. At the beginning the football players are wearing beards until they defeat their opponent. Later, Francis declares that Elliott is hiding behind a beard for security (??) We're also treated to some 1940's feminism spouted by Don Ameche and scoffed at by Francis, who says those are the women (overly independent) who are alone at night. This is a sprightly comedy with sturdy comedic performances from all. Give it a look - you'll feel good when you do!",
         "This film was made in the days when dialogue was king, and this dialogue requires the viewer to pay attention. There are elements of Rosalind Russel's performance in \"His Girl Friday\" with stinging repartee delivered subtly by the four stars. Good acting is required here too, because much is conveyed through the actors eyes. Scenes with Russell, Francis, Heflin, and Ameche all on screen at once are a real treat, and no one upstages anyone else. I would guess they had fun making this funny picture, which is underrated by many people who do not follow the actors' exchanges. Look too, for Robert Ryan who is uncredited in his early pre-war days, and an uncredited song by a barely 21 year-old Peggy Lee, who had just joined Benny Goodman's Band; and oh, my, you can hear her rich, cool, perfect pitch starting to come alive.",
         "I am second to none in my admiration for Roz Russell, but she was clearly second choice for this role. The wife is supposed to slay men at first sight and make them behave like idiots. Sorry, but that's not Roz. It seems tailor made for Hedy Lamarr, who would have been at the height of her beauty in 1941. Even the Adrian wardrobe looks designed with Lamarr in mind. Someone above mentioned Lana Turner, but she would have been too young at this time. Also, Roz plays it like a half-wit, something Lamarr wouldn't have to resort to, as a war-bride who had trouble with American idioms and customs. Ameche, Heflin and Francis are terrific as usual, as is the rest of the supporting cast. And I loved the production design, van Heflin's couch and lamps in his NY apartment are particularly terrifying, as is Kay Francis's \"beaver-mouse ears\" hat. And I LOVE that Dali-esquire dream sequence. Someone ought to do a compilation of the Dali-inspired dream sequences from the period. There were lots.",
         "Don Ameche plays a very cerebral professor who avoids dealing with his wife (Rosalind Russell) by over-intellectualizing their relationship. While she does love him, his refusal to act like a human being irritates her to no end--especially when he never shows an ounce of jealousy, no matter what she does. Even when Rosalind spends time with her husband's publisher, the lecherous Van Heflin, Ameche refuses to act jealous and he takes his marriage for granted. At first, I found Russell's demands for jealousy to be petty, but after a while I wondered how any woman could live with the cold and annoying Ameche. Only later in the film when Ameche loosened up and showed his wife that he cared was everyone able to live happily ever after. This is a little comedy from MGM that tries very hard to entertain and generally does, though at times the humor does seem a tad forced. However, despite this and the shallowness of the script, the actors are fun to watch and the film has a certain kooky charm that make it a nice, though not especially deep, time-passer. Worth a look, but that's really about all.",
         "Don Ameche is a college professor of psychology who's told to help pass a flunking student, so he can play Saturday's game. This only adds to his frustration of bored, inattentive students, and he quits. He has written a book about jealousy, which a publishing company has shown interest in publishing it. He and wife Rosalind Russell go off to New York to meet the publisher. But, Roz is a human female wife, who wants her husband to act alive and jealous, and Don is too reasonable to be reduced to such feelings, which have no scientific basis for them. The publisher Van Heflin takes a liking to Roz, but his secretary Kay Francis has been pining for him all this time. Such is the zany premise in this feel-good comedy. As usual, Roz is at her best with quick lines and her short temper, demanding Don do something about Van. And, a misunderstanding on a bus gets Don in jail. Kay Francis is great, in this escape from her usual fare of melodramas in which she is suffering from shame and scandal and doing and dying for love of her man. Van Heflin is a hoot as a neurotic, who won't let Roz out of his sight and who only has one thing on his mind. The cast winds up on an island, where things get really hysterical. If you want to discover a new screwball comedy, after seeing all of Cary Grant's, then discover The Feminine Touch and see what trouble it gets you.",
         "I agree with \"Aeovox\" below that this is an unusual film, and also an unsatisfactory one. I was drawn to it by the presence of Don Ameche and Rosalind Russell in the cast. I thought the whole premise of the film - the Dionysian wife's unhappiness with her Appolonian husband's refusal to recognize the emotional legitimacy of jealousy, and her subsequent attempts to make him jealous - was a bit tenuous, and it is executed in a rather - to me at least - incoherent way. The movie is far too talky, although that talk often is quite witty (and just as often seems implausible and pointless), and goes on far too long. The slapstick bits are weak. On the whole, despite the good efforts of Ameche and Russell, I found this a disappointment.",
         "Charming goof-ball comedy played by experts. Roz, looking great, is sassy and fun one of the greatest at the slow burn ever. She comes across as a bit addle-pated at times but she also has an enormous amount of patience with her husband, a good but not very sensitive man. This was Kay Francis' last part in an A level film and a shame since she is both humorous and chic. Her slide into low grade junk and obscurity within a few years of this is an example of the way Hollywood wastes talented performers once they are no longer as big at the box office. Since this is an MGM film and she made a good showing in the picture it's surprising they didn't take her on. Her brand of sophistication seems right up their alley and even if no longer a leading lady she could have done well in support. Ameche's character as I said is a rather clueless blow-hard but his natural charm makes him less irksome than he would normally be. Heflin, fresh off his Oscar for Johnny Eager, is well cast as a would be gigolo who thinks he is more suave and irresistible than he in fact is. Overall a bit dated in it's attitudes, unsurprisingly, but the four stars make it worth watching."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["John Hathaway is a professor of psychology at Digby College. His students are bored as he is with the students. He leaves college to go to New York to have his manuscript on jealousy published. John and Julie go to Elliott Morgan Publishing to discuss his book. Being that it is highly technical and boring, Nellie wants to focus on the small part about couples that she thinks will sell. But it soon becomes apparent that everyone is more intrigued by Julie than the book. Elliott tries to make advances on Julie while Nellie is more interested in John than his book. Julie, however, is worried about John, while John, who wrote the book on jealousy, seems oblivious to it and thinks that he knows everything about jealousy."],
      "budget": 0
   },
   "movielensId": 125091,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1941-10-01",
      "dvdReleaseDate": null,
      "directors": ["W.S. Van Dyke"],
      "runtime": 97,
      "movieId": 125091,
      "title": "The Feminine Touch",
      "mpaa": "",
      "actors": [
         "Rosalind Russell",
         "Don Ameche",
         "Kay Francis",
         "Van Heflin",
         "Donald Meek",
         "Gordon Jones",
         "Henry Daniell",
         "Sidney Blackmer",
         "Grant Mitchell",
         "David Clyde",
         "Harold Minjir",
         "Mickey Martin",
         "Bernard Nedell",
         "William H. O'Brien",
         "Anne O'Neal",
         "Frances Morris",
         "Cecil Cunningham"
      ],
      "imdbMovieId": "0033596",
      "originalTitle": "The Feminine Touch",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["nZMCtzCWRZY"],
      "plotSummary": "A professor (Don Ameche) and his wife (Rosalind Russell) move to New York and confuse a publisher's romance with his assistant (Kay Francis).",
      "tmdbMovieId": 95137,
      "avgRating": 3.25,
      "releaseYear": "1941",
      "numRatings": 2,
      "posterPath": "/kFlQ5OIkAecSx2QX1TeBlRbxr1V.jpg"
   }
}