{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0056673",
      "video": false,
      "title": "Waltz of the Toreadors",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gen. Leo Fitzjohn",
               "gender": 2,
               "credit_id": "52fe4627c3a36847f80efaaf",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ghislaine",
               "gender": 1,
               "credit_id": "52fe4627c3a36847f80efab3",
               "name": "Dany Robin",
               "profile_path": "/u4CFRqlIBK5bqc6pBHvCWI4Sfp6.jpg",
               "id": 24364,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Emily Fitzjohn",
               "gender": 1,
               "credit_id": "52fe4627c3a36847f80efab7",
               "name": "Margaret Leighton",
               "profile_path": "/cONUWV4s2sYTO9Nx1PSZf8BMJ6M.jpg",
               "id": 80255,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lt. Robert Finch",
               "gender": 2,
               "credit_id": "52fe4627c3a36847f80efabb",
               "name": "John Fraser",
               "profile_path": "/lGTs2ME2t7Xq8AqC1qtI3Ow9Nr4.jpg",
               "id": 69555,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dr. Grogan",
               "gender": 2,
               "credit_id": "52fe4627c3a36847f80efabf",
               "name": "Cyril Cusack",
               "profile_path": "/5d6OeKNqpRSMhwXd1FHV9KeX4WS.jpg",
               "id": 4973,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Estella Fitzjohn",
               "gender": 1,
               "credit_id": "52fe4627c3a36847f80efac3",
               "name": "Prunella Scales",
               "profile_path": "/rNE3QUgVqsJHVaXdl0rr3bXyzie.jpg",
               "id": 55643,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4627c3a36847f80efaab",
            "name": "John Guillermin",
            "profile_path": "/mIfmS5Sq8djOdn2YfMeeEfL7YbU.jpg",
            "id": 6778,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.173523,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 43016,
      "vote_count": 1,
      "budget": 0,
      "overview": "General Fitzhugh, an ageing Lothario has an over-active eye for a pretty woman. Despite a long and satisfying career as a seducer extraordinaire, something always seems to get in the way of his bedding the breathtakingly lovely Ghislaine, a more-than-willing town local.",
      "similar": [],
      "original_title": "Waltz of the Toreadors",
      "runtime": 105,
      "poster_path": "/AbsxwXB1ptGHeXMxg4ZJFKqhGFB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Julian Wintle/Leslie Parkyn Productions",
         "id": 35265,
         "origin_country": ""
      }],
      "release_date": "1962-01-01",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Guillermin"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Jean Anouilh",
         "Lucienne Hill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056673/",
      "coverLink": null,
      "actors": [
         "Peter Sellers",
         "Dany Robin",
         "Margaret Leighton"
      ],
      "reviews": [
         "Peter Sellers first successful dramatic role of any stature is as General Leo Fitzjohn in this version of the play by Jean Anouilh. Although a success in the military (we see over the years as he rose to his present rank) he was married to a woman who was bed-ridden due to emotional problems, and he was never quite able to carry out his lifelong romance with his French girlfriend. His wife (Margaret Leighton) is a shrew, but she is one who never stopped loving her unfaithful husband - so she will never give him the divorce he'd want. His mistress (Dany Robins) is attractive, and ever hopeful. Unfortunately she has met the General's adjutant, Lt. Finch (John Fraser), who she finds available and able to return her love. So this four sided parallelogram develops as the center of the plays plot. Sellers has had other affairs, all of which Leighton has had to live through. In one it turns out he had a child. Yet he is unable to break the chain linking him with this woman, who is both sympathetic and neurotic. He yearns and schemes to be with his mistress, but every time something (from a broken leg to a drinking contest) interferes. In the end he watches as he loses her, and he considers suicide. Sellers had never had such a sad character before. Maybe the alcoholic movie projector operator in \"The Smallest Show on Earth\" came closest, but he was not the central figure of that film. Sellers showed the depressing effects of aging on the general, once a gallant physical specimen. He is fully aware of his aging, and his failure to attain true happiness (just the temporary enjoyment of sexual pleasure). As he contemplates his mortality, and plans suicide he tells his closest friend (Cyril Cusack), \"I don't want to die.\" But he can't prevent that inevitability. He did well with the role of Fitzjohn, and it paved the way for some of those bright figures such as his too Christian minister in \"Heaven's Above\", his triple roles in \"Lolita\" and in \"Dr. Strangelove\", and his final great part of Chance in \"Being There\". Fitzjohn was a taste of what was to come.",
         "I saw this on cable recently, out of curiosity more than anything else, and I wasn't sure I was really going to watch it. However, it turned out to be quite a little gem that I would recommend for those of us who have a few years on them. Peter Sellers, who was only in his 30s at the time, puts on aging makeup and plays a retired general around the turn of the 19th century who is still chasing skirts (Sellers appears in flashbacks looking his real age). It is a bittersweet look at marriage, sexual desire, maturity, the advantage men have over women with respect to aging, etc. And, to its credit, it doesn't have the stock Hollywood ending one might expect.",
         "This film haunted me from the first viewing,or at least I was oddly fascinated at its beginning and a little puzzled,slightly bored and confused towards the end,due too the fact that it seemed to me well made however a little uneven,encapsulating,besides beauty and depth a little bit of pathetic,overblown,hilarious,less plausible,corny situations. Now a realize that judging this film as uneven is also,partly,my own fault.The reason may be that I first saw this film in my early teens,when I could relate a little less to the sentimental problems of an aging man.Seeing it for the second time a few weeks ago(and five-six years later than the first viewing)I gradually understood more of the character's inner structure and grasped this film's value and depth much better. Besides Seller's both deep yet humorous performance this film is beautiful for it's nostalgic \"fin-de-siecle\",\"Belle-Epoque\" mood,the overtly sophisticated elegance of the characters,the costumes,the language,the sets. The storyline,the plot are,in a very balanced,discreet,stylish way divinely decadent.In late nineteenth century-beginning of twentieth century England an elderly officer(Sellers in an unusually mature and witty understated part)is,like Frank Slade from Scent of A Woman years later,oscillating between a suicidal,anguished saturation of life and a huge portion of self indulgent yet healthy and uncensored hedonism/vital-ism in spite of his age. Unlike Frank Slade it is not a physical disability that causes his depression and suicidal tendencies,rather(what partly applies to Frank Slade too)the fear of getting old or,more precisely,of not being capable to enjoy life fully due to aging,besides that an unhappy marriage,a major failure in love,the futility of the all the privileges and luxuries he can easily afford,yet fail to cure him of his doubts. Inspite of contemplating suicide I think that both General Fitzjohn from this film and Colonel Frank Slade are sad,but not irremediably ill-fated creatures.Suicide-though neither one of them is putting it into practice,is in their case,not a cowardly evasion,but a manly way to achieve a moral triumph over a morally flawed world.By the way,neither of them is a failure,o.k. they tend to be selfish,cynical,even too overindulgent,however they both bear an immense and unaltered lust for life,a vivid intellect and sensibility,an intense,even if outer restrained love for life,women and-almost incredible-family. Beneath the womanizing,socially hyperactive,hard-drinking Fitzjohn lies an almost childlike enthusiasm and thirst for life and both Seller's performance(few actors know to mingle childlike and mature behavior,features etc. credibly and brilliantly as he does)and the whole mood exhaling a peaceful,quiet joy of living(remember it's the pastoral Brithish countryside in the aristocratic sense of the word). Another resemblance with Scent of a Woman is the importance of a very particular dance,which,like the famous tango in the film mentioned above,sparks a whole universe of beauty and nostalgia,of memories,of an almost unreal sort of joy and beauty. I always thought that Anouillh is a fossilized,high-minded but old-fashioned playwright,a sort of a too off-beat,pretentious,declamatory,uselessly&unpractical sophisticated geek.This film,a screenplay after a less known creation of him,proved that he is not only talented,but also witty and entertaining in an unceremoniously juicy yet still intelligent and profound way. Probably this film needs more than one viewing to get over its too hilarious,old-fashioned,uneven,artificial bits and discover that it is truly(at least at certain extent)a masterpiece.",
         "Based quite loosely upon a play of the same name by Jean Anouilh, this film has been designed not merely as a showcase for the oversize comedic talent of Peter Sellers, but also, due to excessive producer interference, as a sex farce where character predominates over language, after the manner of a well-wrought and linear work of theatre. A droll script by Wolf Mankowitz transposes the action from post World War II France to early 20th century Sussex, arranging the characters in the story-propelled manner of the playwright, whose intensive exploration of the spirit becomes increasingly prominent as the work runs its course, greatly assisted by sensitive performances from Sellers, as the libidinous General Leo Fitzjohn, and by Margaret Leighton as Emily, his suffering wife. The plot spirals about the freshly retired General Fitzjohn and his longwhile Gallic inamorata, Ghislaine (Dany Robin) who have, as seen in a series of flashbacks, never been able to complete their love, but who are apparently finally going to be able to do so; that is, if a series of latter-day obstacles might be overcome. The picture is directed smoothly by John Guillermin, and there are excellent performances from Cyril Cusack as Dr. Grogan, the General's best friend, and John Fraser as a naive subaltern assigned to Fitzjohn, while a magnificent score is contributed by Richard Addinsell, one of his best for the screen, notable for its unreserved use of a minor key to accompany romantic and comic events. Unlike his Absurdist contemporaries, Anouilh never abandoned a sense of existential despair throughout his dramas, and this production succeeds in creating tension between Fitzjohn's sense of loss of place and his ability to forge forward after his natural urges, as evidenced by the delicious ending.",
         "This is a wonderful little movie which displays Peter Sellers's acting genius both for comedy and serious drama. It is a haunting story of a general at the end of his career, about how much was real and not real in his life, and about his weaknesses and distractions. It is easy to project certain kinds of political observations on to this movie, as was done in an earlier review by wjfickling in his comment about the advantages that men have over women, but it is just as easy to project the opposite. The genius of the movie is that it tells a story of the bitter sweetness of a man's life that is outside the politcally correct \"truth du jour\" and can be taken directly, as it is.",
         "To me, this seemed like a one-joke kind of film where the joke isn't all that funny to begin with--certainly not enough to sustain a film. Peter Sellers plays a horny old general who has just retired from the British army circa 1908 or so. Over the course of the film, you learn that not only does he hate his wife but can't keep his eyes off other women. An old flame returns and you think they might run off together, but only moments later he's chasing some other tart. That is pretty much the entire film. Peter does a nice job imitating this sexual libertine and rotten family man who constantly tells his daughters they are stupid and ugly. While I guess his cruelty is supposed to be funny, I didn't particularly care for it. The bottom line is that the acting is just fine, but the script is not. There just isn't enough to support a movie and my interest wained about mid-way through the film.",
         "Forgive me again for being very uninformative and nitpicky. I'm unfamiliar with the play (\"disastrously translated into English setting and characters\" - Halliwell's) and I sure as hell can't discuss the author's oeuvre. The photography is beautiful, if not entirely consistently so. I especially liked it during one of the heavier scenes involving Sellers and \"wife\". There are some ugly flashback transitions. \"Fawlty\"-heads will see a pre-Sybil Scales, if paying enough attention... ... which can be relatively hard at times. One notices how the actor who plays the innkeeper (John Glyn-Jones, further investigation shows) carries an enormous resemblance to the fine actor Richard Jenkins of \"Six Feet Under\" fame (or of \"The Man Who Wasn't There\" fame). Then, in his second and final scene, what is called out through some galloping if not \"Mr. Jenkins!\" Bizarre. John Le Mesurier seems to have been always reliable (by which I mean the few of his I've seen). Sellers's \"old man\" voice arouses in me questions as to why he was constantly cast in these senior roles (here, flashbacks, yes). Don't get me wrong, though. His performance is as great as you can expect from him. \"I'm old enough to be your aunt.\" Well, you don't look like it. The titular sequence is actually memorable. The ending I liked, which seems to be a common thing with viewers. I have trouble understanding what this eventually is. One minute, there's some silly umbrella fencing, and the next, grave discussion about things marital in nature. I can't really grasp the whole film. That's right, blame my age. But it is all over the place. At any rate, the film is worth a go. I didn't get these \"masterpiece\" vibes that others have gotten out of it, but if not for anything else, it's worth seeing for Sellers doing his thing.",
         "Spoilers -- A lot of subtle humor mixed in with the serious dialogue, mostly sight gags, (which would make Sellers famous in the Pink Panthers). The general has a swordfight with the doctor, but the only weapon available to the doc is the umbrella, so he fights with that, and at one point even stops to show the general how to properly thrust & parry; When Leo rushes past a man on a bike, the bike flips upside down, spilling the food on the rider's face. As the general walks past the kitchen help, his hands keep making \"involuntary\" gestures. Ghislaine (French actress Dany Robin) goes wading, and a fisherman \"catches\" her dress right off her. Lady Fitzjohn (Margaret Leighton) gets on a bicycle and passes all the riders on horseback, hunched down like Margaret Hamilton in Wiz of Oz... and that car that keeps backfiring. The General never does get to fiddle with Ghislaine , but he sums it up himself by saying \"we all have to grow up sometime.\" I liked it, even if it did get quite serious at the end. Fitzjohn and his wife finally talk about the reality of their relationship after all those years. When he almost kills her, he says \"Thank God\" when the doc says she will live (although he might just be relieved he won't be tried in an accidental death) I guess the moral is to be happy with your lot in life (his iffy marriage), and to make the most of opportunities that come along (he muffed both chances with Ghislaine). The last 20 minutes feel like a tacked-on ending; this could have easily ended much earlier... maybe where they stop quarreling in the castle, or when Fitzjohn finds out the wife will be OK. i don't usually dig period pieces, but this one held my interest - there was just enough humor and peter sellers to keep me watching."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Independent Artists",
         "Julian Wintle/Leslie Parkyn Productions"
      ],
      "summaries": ["This is the end of a glorious military career: General Leo Fitzjohn retires to his Sussex manor where he will write his memoirs. Unfortunately, his private life is a disaster: a confirmed womanizer, Leo has infuriated his wife Emily, now a shrewish and hypochondriac woman, all the more bitter as she still loves him. The General has two plain-looking daughters he dislikes and an attractive French mistress, Ghislaine, with whom he has had a platonic affair for seventeen years. When Ghislaine resurfaces, determined to complete her love with him and to get rid of Emily, Leo is at a loss what to do..."],
      "budget": 0
   },
   "movielensId": 125067,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-01-01",
      "dvdReleaseDate": null,
      "directors": ["John Guillermin"],
      "runtime": 105,
      "movieId": 125067,
      "title": "Waltz of the Toreadors",
      "mpaa": "",
      "actors": [
         "Peter Sellers",
         "Dany Robin",
         "Margaret Leighton",
         "John Fraser",
         "Cyril Cusack",
         "Prunella Scales"
      ],
      "imdbMovieId": "0056673",
      "originalTitle": "Waltz of the Toreadors",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "General Fitzhugh, an ageing Lothario has an over-active eye for a pretty woman. Despite a long and satisfying career as a seducer extraordinaire, something always seems to get in the way of his bedding the breathtakingly lovely Ghislaine, a more-than-willing town local.",
      "tmdbMovieId": 43016,
      "avgRating": 3.25,
      "releaseYear": "1962",
      "numRatings": 2,
      "posterPath": "/AbsxwXB1ptGHeXMxg4ZJFKqhGFB.jpg"
   }
}