{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "singing",
            "id": 12990
         }
      ],
      "imdb_id": "tt0043081",
      "video": false,
      "title": "Two Weeks with Love",
      "recommendations": [],
      "backdrop_path": "/3NrQR0mO4Tal8NlsxgGJMN4sIq3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Patti Robinson",
               "gender": 1,
               "credit_id": "52fe4645c3a36847f80f5915",
               "name": "Jane Powell",
               "profile_path": "/5GqORefhLR2ke4TWWuGqPNv6UuU.jpg",
               "id": 82405,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": ". Demi Armendez",
               "gender": 2,
               "credit_id": "52fe4645c3a36847f80f5919",
               "name": "Ricardo Montalban",
               "profile_path": "/cjVYY35mjqZsno1qECjTr4lzqbS.jpg",
               "id": 1793,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Melba Robinson",
               "gender": 1,
               "credit_id": "52fe4645c3a36847f80f591d",
               "name": "Debbie Reynolds",
               "profile_path": "/p5o3qOl4bFZxrnUxG826cIN0GvP.jpg",
               "id": 8857,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Katherine Robinson",
               "gender": 1,
               "credit_id": "52fe4645c3a36847f80f592d",
               "name": "Ann Harding",
               "profile_path": "/fhYdh98B0mJVYYvHWPpsEA7kHWb.jpg",
               "id": 103441,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Horatio Robinson",
               "gender": 2,
               "credit_id": "52fe4645c3a36847f80f5931",
               "name": "Louis Calhern",
               "profile_path": "/k0uuHPK8XgKO7D7iOF2SrxVeE69.jpg",
               "id": 4343,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Valerie Stresemann",
               "gender": 1,
               "credit_id": "52fe4645c3a36847f80f5935",
               "name": "Phyllis Kirk",
               "profile_path": "/5eQFyTqqXbKg5KajdTQ4cPydqWd.jpg",
               "id": 83262,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "586519469251412b7d01c7df",
               "name": "Jack Cummings",
               "profile_path": null,
               "id": 21507,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5865198ec3a36852ba01e2aa",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "586519cac3a36852c901cf05",
               "name": "Richard Pefferle",
               "profile_path": null,
               "id": 1464564,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "586519dcc3a36852e001e1b1",
               "name": "Edwin B. Willis",
               "profile_path": null,
               "id": 9063,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "586519ec9251412b8701cf38",
               "name": "Walter Plunkett",
               "profile_path": null,
               "id": 11491,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "586519fec3a36852cc01cbef",
               "name": "Helen Rose",
               "profile_path": null,
               "id": 3647,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "58651af99251412b8d01d750",
               "name": "Busby Berkeley",
               "profile_path": "/fNM46pXBDgT6hXXNLKw1nRsFjh.jpg",
               "id": 95293,
               "department": "Crew",
               "job": "Choreographer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4645c3a36847f80f5911",
               "name": "Roy Rowland",
               "profile_path": null,
               "id": 46307,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4645c3a36847f80f5923",
               "name": "John Larkin",
               "profile_path": null,
               "id": 115760,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4645c3a36847f80f5929",
               "name": "Dorothy Kingsley",
               "profile_path": null,
               "id": 31069,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58651968c3a36852d201b13a",
               "name": "Cotton Warburton",
               "profile_path": null,
               "id": 5841,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5865197bc3a36852cc01cb9f",
               "name": "E. Preston Ames",
               "profile_path": null,
               "id": 40170,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "586519579251413cd601943e",
               "name": "Alfred Gilks",
               "profile_path": null,
               "id": 958533,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58651b23c3a36852c0020902",
               "name": "George Stoll",
               "profile_path": null,
               "id": 13983,
               "department": "Sound",
               "job": "Music Director"
            },
            {
               "gender": 2,
               "credit_id": "58651b34c3a36852ba01e3cd",
               "name": "Warren Newcombe",
               "profile_path": null,
               "id": 13292,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "58651a40c3a36852e001e1f9",
               "name": "Don McDougall",
               "profile_path": null,
               "id": 15702,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58651b479251412b9001e7c9",
               "name": "Conrad Kahn",
               "profile_path": null,
               "id": 1729492,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 2,
               "credit_id": "58651b589251412b8a01d143",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "58651b69c3a36852e001e2c6",
               "name": "Martha Acker",
               "profile_path": null,
               "id": 1529483,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "58651b79c3a36852c0020955",
               "name": "Sydney Guilaroff",
               "profile_path": null,
               "id": 14681,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "58651b8b9251412b8701d053",
               "name": "Robert Dawn",
               "profile_path": null,
               "id": 1339685,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "58651b9bc3a36852e001e2f7",
               "name": "William Tuttle",
               "profile_path": null,
               "id": 29801,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.757763,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43395,
      "vote_count": 3,
      "budget": 0,
      "overview": "The Robinson family are spending two weeks of summer vacation at a resort in the Catskills. Older daughter Patti vies with her friend, Valeria, for the affections of Demi Armendez but Patti is at a disadvantage because her parents think she is too young for boys. But with Patti singing at an amateur show and a dance, her adventures in quest of Armendez ends happily.",
      "similar": [
         872,
         9836,
         316029,
         1407,
         10530,
         31900,
         11631,
         812,
         10882,
         15121,
         824,
         703,
         134,
         252,
         3933,
         11224,
         18947,
         19404,
         41233,
         46195
      ],
      "original_title": "Two Weeks with Love",
      "runtime": 92,
      "poster_path": "/8axfKXn4jsLGsktupL3s5DXB5qp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1950-01-01",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "The Gayest LOVE STORY EVER FILMED!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roy Rowland"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "John Francis Larkin",
         "John Francis Larkin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043081/",
      "coverLink": null,
      "actors": [
         "Jane Powell",
         "Ricardo Montalban",
         "Louis Calhern"
      ],
      "reviews": [
         "Jane Powell and Ricardo Mantalban headline this film made in 1950. Debbie Reynolds was the supporting star early in her career. Jane Powell has said that this was one of her favorite films to work on, despite being more famous for \"Seven Brides For Seven Brothers.\" The plot is about Jane's character trying to break out into womanhood, despite her mother trying to keep her a little girl. Along the way, she falls for a young Cuban (Mantalban) and conflicts between Powell, her mother and her romantic rival climax at a good moment. Debbie Reynolds is Jane Powell's younger sister in the film and sings her first record hit, \"Aba Daba Honeymoon\" with Carlton Carpenter. This song is available from Curb Records nowadays. Not to be outdone singing at an early age, Debbie's sparkling style of acting was the real highlight of the film. Her character's wit and occasional negative attitude creates a \"she's so cute\" attitude towards her from the audience. Debbie fans will notice this right of the bat. Despite being 17 or 18 when the film was shot, the film calls for her to be 14 or 15, and she looks it too. This film is not one of the \"Great Classics\" of Hollywood, but Jane Powell and Debbie Reynolds' fans should thoroughly enjoy this one. Jane Powell would go on to star with Debbie Reynolds in \"Athena\" and \"Hit the Deck.\" Ricardo Mantalban would star with Debbie Reynolds 16 years later, in \"The Singing Nun.\"",
         "I haven't seen this one in a long time, since I caught a TV broadcast some years ago. But I'll never forget its gentle high spirits; the warm and humorous work of the ensemble cast; M-G-M's studio-bound but, as always, first-class production values; and, of course, the happy showcasing of Jane Powell at her best. But one thing that amused me the most was the extremely sly performance by Debbie Reynolds, so early in her career. She appeared in many comedy-with-music films in the years to follow but I can't think of one that so cleverly mined her very special talent for, shall we say, winking at the audience and bringing her uniquely appealing sense of humor to the proceedings, without in the least stepping out of character. Think I'll splurge and get my own VHS copy of this one. Nostalgia can be fun, n'est-ce pas?!?",
         "This movie used to be shown on the old UHF stations like WOR, Channel 5 in New York. We were able to receive this station with wonderful old movies even though we lived in the Philly suburbs. I can remember carefree summer days and movies like this on all the time. It was one of my mother's favorites and it became ours as well. I always remember Debbie Reynolds singing and how funny she was. I wanted to be there, at that same hotel, playing with Debbie and having a great time. Oh how I wish they would make movies like this again, movies that are fun and sweet.But the people creating film today enjoy wallowing in darkness and despair. But that's another topic. This is a fun film, perfect for kids and summer and escape. GallenR",
         "Yes, remade as DIRTY DANCING! I was lucky enough to see this hilarious and enchanting film in real 3 strip Technicolor in the early 1970s when every Sunday night there would be a classic double at a local theatre.......I can't ever describe how beautiful the colour is / was in this format. Often it played with a 3 strip tech print of Singin In The Rain, so imagine the imagery left to take home and replay in my head...... The cinema was always full (700 +) and the crowd just roared with appreciation. This is a very funny film and one that really addresses teen worries in the most lovable way. One sequence where the families go night time boating with lanterns, all to the song By The Light Of The Silvery Moon is spellbinding enough to transport the hardiest soul to sheer bliss (my brother). Kids need to see this film today and if you can show it to them, they will put aside their demands and really come to love it. The raisins reference above is from the most uproarious dinner time gag early in the film. Have a look....it's delivered perfectly. Like the film.",
         "There's just something about watching an MGM musical from their golden age. Musicals from that time had a special look and feel like nothing before or since, wonderful displays of showmanship and design and talent that cast a gorgeous glow over the screen. Sure, they were corny and silly sometimes, but they entertained. `Two Weeks With Love' is typical of this period. The story follows adolescent Patti Robinson (Jane Powell) on her family vacation to Kissimee in the Catskills, where she meets and falls in love with the dashing Demi Armendez (Ricardo Montalban). Patti pursues Demi and the hotel bellboy Billy (Carleton Carpenter) pursues Patti and Patti's sister Melba (Debbie Reynolds) pursues Billy, and Patti and Melba's Mama and Papa (Ann Harding and Louis Calhern) struggle to accept that their little girl is growing up\u0085 `Two Weeks' is one of those movies that's a pure joy to watch, just ninety minutes of lighthearted fun and sweetness. It's a time capsule from a simpler age, when problems were never really as bad as they seemed and true love could conquer all. Sigh\u0085",
         "One of Jane Powell's more popular musicals was this turn of the last century classic, Two Weeks With Love. With music and atmosphere set in the Theodore Roosevelt era, Two Weeks With Love is good entertainment and marked Debbie Reynolds's breakthrough film. The Robinson family headed by Louis Calhern and Ann Harding are taking their annual two weeks outing in the Catskills, circa 1905. Apparent to all, but Ann Harding, her daughter Jane Powell is developing a figure. However we've got a firm rule in this family, no corset until her 18th birthday. Another person stymied by the 18th birthday rule is Carleton Carpenter who is 17 and still in knickers. Father Clinton Sundberg owns the hotel that Robinsons stay at and will not give him long pants. Though Powell and Reynolds can still play as teenagers, Carleton Carpenter is positively ridiculous playing a 17 year old. He's quite a bit over 6 feet tall, but that's good in a way, because that's part of his gawkiness. Where in the name of the Deity were they finding knickers back in the first decade of the last century for someone over 6 feet tall beggars the imagination. There's a nice mixture of period, public domain music that MGM didn't have to shell out for the rights that Powell, Reynolds and Carpenter perform. Debbie Reynolds as Powell's younger sister sang Abba Dabba Honeymoon with Carpenter here and it became the hit and the song had a revival in popularity in 1950. Powell's best number is in an imaginary sequence singing Come, Hero Mine from The Chocolate Soldier. Again, MGM owned the rights by dint of purchasing that property for their Chocolate Soldier film from nine years before where Rise Stevens and Nelson Eddy duet ed this one. Powell also dances a mean tango with Ricardo Montalban the object of her youthful crush and why she's so anxious to show her figure off. Ann Harding as a mom is nice and loving and doesn't have a clue. She dresses her boys, Tommy Rettig and Gary Gray, in Reynolds's and Powell's old hand me down nighties. Mom, get real. Two Weeks With Love is a nice trip down memory lane and back when it was released people actually did have memories of the turn of the last century.",
         "I love this movie not just because of Jane Powell's charming performance or Ricardo Montalban's romantic looks, but for its wonderful recreation of the period and most of all for its heartfelt appreciation of the angst of growing up and moving from girl to woman. And it's so funny!- the scene where her (surgical) corset locks during her longed-for dance with Ricardo is hilarious. What more could you ask - even Debbie Reynolds is (comparatively) restrained.",
         "A beautiful, innocent show -- well sort of. The turn-of-the-century generation was not naive about sex, they just had a better way of making it subtle. Has nobody guessed? This is the movie which was updated to become, I kid you not, Dirty Dancing. The father-daughter tenderness, the girl who loves to dance and who takes over at the Catskill resort entertainment when the jealous leading lady has a problem, the coming of age of a woman on vacation with the cooperation of an entertainer -- \"Mr. Robinson, your child is no longer a child.\" The parents' yielding to the breakdown of social barriers. It's all there.",
         "They don't make films like this anymore there simply aren't the margins in them. If they did the sex and jokes would hit you in the face and you would miss the point that subtlety and slapstick can mix well together on occasion. This film is half a century old and it probably shows to the more sophisticated contemporary film goer/maker. To me it was a film that I have seen only twice when in my teens but both times it instilled in me a warmth and humour that I have rarely known in a film since. Hooray for Debbie Reynolds! Hooray for Ricardo M! And not an inch of stocking or @#*~ word in sight! Sit back and enjoy.",
         "I couldn't love this movie more. Jane Powell, a sensational actress, gives an exceptional performance. Ricardo Montalban is an absolute dream and is so hilarious. Could Debbie Reynolds be more adorable? You can't help but fall in love with the entire cast.",
         "This is Jane Powell's best film. It's a perfect film to lift your spirits when you are down. Every song in the film is wonderful. The best songs being By the Light of the Silvery Moon & Abba Dabba Honeymoon & Row, Row, Row. Debbie Reynolds and Carleton Carpenter sing the last two. Jane Powell has stated this is her favorite film and you can see why with all the wonderful scenes. Jane plays Patty who has just turned 17 and she wants to start dating and wearing a corset. Her mother(Ann Harding) won't let her until she is 18. Debbie Reynolds plays her kid sister and steals a lot of scenes. I think it's her best part next to her part in Singin' in the Rain. Her father(Louis Calhern) tries to help Jane, but mother wins out. Carelton Carpenter who plays Billie falls for Jane early on and Debbie falls for him. Phyllis Kirk plays Valerie a snobby friend of Jane's. She shows Jane her new corset. She runs out after they see Ricardo Montalban. Debbie continues to offer herself to Carleton, but he wants Jane. Jane finally meets Ricardo and she is responsible for dumping pudding on him. She runs off. She runs into him again and has to turn him down for the dance because she does not have a corset and she is embarrassed. She does not tell him this. She also has a young girl's bathing suit on and she hides when Ricardo walks by. The next scene has the best song of the film, \"Abba Dabba Honeymoon. It is performed perfectly by Debbie Reynolds & Carleton Carpenter. Jane is rejected again when Ricardo won't take her on a canoe ride because she says she can't swim. She finds out her snobby friend is trying to sabotage her relationship with him so she can get him. Jane goes into a canoe by herself and falls in the lake. Ricardo tries to save her and she struggles to shore so he won't find out she is wearing a corset. She dances with him the next night at arms length. She is having a great time and the the snobby girl tell's all the guys she does not wear a corset and they make fun of her. She also tells Ricardo. Jane runs off crying. Her father decides to buy her a corset the next day. He buys her a surgical corset. Jane and her mother talk it over and she agrees to get her a corset. Jane then has a wonderful dream sequence wearing a pink corset. She looks stunningly beautiful. She really has a nice pair of legs. She sings and dances with Ricardo. The next night she gets to fill in and dance with Ricardo in her new corset given to her by her father. The do a wonderful dance, but her corset locks as the dance ends. The whole family comes to her aide and her mother releases her from the corset. It turns out her father bought her a surgical corset. Ricardo tells her parents of his intentions to see Jane and court her. Happy ending to a great film. I challenge anyone who loves old musicals to not enjoy this film. Jane Powell, Ricardo Montalban, Louis Calhern, Carleton Carpenter & Debbie Reynolds are perfectly cast for this film. Great, Awesome, Incredible Film.",
         "When people ask the question \"Why don't they make musicals anymore?\" I find that it is quite easily answered: \"Well, the genre was perfected in classical Hollywood.\" We can never get to that point again, and can only hope for re-invention, which we kind of got this past year with Moulin Rouge. However, that film cannot compare with the musicals of the 30s and 50s, nor can any other musical (at least from what I've seen) of the past 20 years. I had never heard of Two Weeks with Love, and only began to watch it because there was nothing else on when I sat down to eat my lunch. I missed the first 15 minutes or so, but the plot was simple enough to reconstruct: a family goes on vacation in the Catskills around the turn of the Twentieth Century, and the middle of three daughters (Jane Powell), Patty, 17 in age, feels that she is becoming an adult. Her parents treat her like a child, though, and won't allow her to where a corset, the symbol of young womanhood. Another guest in their hotel is Demy, a Cuban gentleman played by none other than Ricardo Montalban (how old is this guy? this film was made in 1950!). He's a bit older than Patty, but she is extraordinarily attracted to him. Her older sister, Valerie, tries to trick her into screwing up when she's in front of him (she wants him, too), and her younger sister, Melba, thinks Patty's a nut. Debbie Reynolds, cute as ever, plays Melba, two years before Singin' in the Rain. This film has a lot of great musical numbers, but it can go a long time at some points without one. However, it's so entertaining even without the music that I was never impatiently waiting for the next one to occur. The humor is marvelous. The dialogue is very clever, and there are actually a lot of sexual innuendoes. Some of them may not have been meant. For instance, one scene has Patty explaining to Demy how she would cling to him if she fell into a lake. She wraps her arms tightly around this pole that looks far too much like a penis to suggest anything else. I hope someday that I'll be able to see the first 15 minutes that I missed. Perhaps then I'll give it a 10, but for now I'll give it a 9/10.",
         "Patti (Jane Powell) is coming of age in the early XX century. She sights for Demi (Ricardo Montalbán) and willing to wear corset, a clear sign of becoming a woman. Until then she can not allow any man put his arms around her...or they would discover she is not wearing corset and consequently is not a woman yet. But her parents prefer to wait until she is eighteen. That means waiting a whole year, a difficult thing specially if you have a friend called Valerie (Phyllis Kirk) who is already in the adult world and fighting for Demi's love. Delightful musical comedy that includes many beautiful songs such as Oceana roll, Row, row, row, Aba daba honeymoon (a huge success after film's release that lead to a tour song through the States for both singers), By the light of the silvery moon and a The chocolate soldier's fragment, all of them perfectly fitted. In brilliant Technicolor with wonderful costumes by Edith Head, an accurated set designs and mise-en-scène and great performances by all the cast this is a film not to be missed. Specially enjoyable are the lake boat dream sequence with Ricardo Montalban appearing in Patti's dreams and the tango dance finale A media luz (made famous by tango singer Carlos Gardel) where Mr. Montalbán (a great dancer) shines dancing with Miss Powell. She said this was her favorite film. Great entertainment.",
         "One of the many 'period' musicals produced by several studios in the '40s and '50s. At least several of the songs were composed around the 1910 period, to conform with the late Victorian screenplay. Even the one song performance that caught the public's imagination sufficiently to become a top pop song : \"Aba Daba Honeymoon\", was composed in 1914, then forgotten. I don't know if Fred Flintstone's \"Yaba Daba Doo\" is derived from this title, but the resemblance is clear. ..Warning the corn grows high in this film! The Robinsons are an upper class Victorian family, composed of 17 y.o. Patti(Jane), 15y.o. Melba(Debbie) and two much younger boys, one played by Tommy Rettig, who would later become well known via the TV Lassie series. Incidentally, Tommy would go on to have a very diverse life, besides his show biz period, including marijuana grower, and, in his later years, an important software developer!...The Robinsons are getting ready for their annual Catskills summer vacation: a ritual of many upper class Easterners in this pre-air conditioning era. The teenagers feel they are old enough for some puppy romance during this vacation, and thus petition to be dressed in something more adult than their 'baby' clothes. But, mother Robinson(Ann Harding) mostly resists these pleadings, resulting in more conflicts and embarrassing situations once they get to the Catskills. They stay in the romantic-sounding Kissimee Resort, owned by Mr. Finay(Clinton Sandburg), whose gangly son Billy(Carleton Carpenter) serves as bell boy. Billy remembers Patti from the previous year and tries to flirt with her, but she's not much interested, and soon is swooning over older, but suave, Cuban Demi(Ricardo Montalbam) who, in turn, is squiring Valerie(Phyllis Kirk), who quickly tries to impede Patti's chase of Demi. Meanwhile, Melba(Debbie) has struck up a friendship with Billy, who initially ignored her. Of course, we soon figure out that , despite all their age and clothes disadvantages, Patti will end up with Demi, and Melba with Billy, in the final scene. Patti ad Billy keep getting into embarrassing situations, as they try to impress the opposite sex. Patti develops a severe inferiority complex because she hasn't a corset to wear, while the other debs all have one. Papa, who is more understanding of Patti's wish to be see as a woman than is his wife, finally buys her one, but its a surgical corset that locks when she bends over too much(Yes, pretty contrived!) Also, her swimwear is not on par with her age. Thus, when Demi is seen approaching, her sibs bury her in the imported sand, except for her head, hidden by a bucket(reminding me of Oliver Hardy, in \"Way Out West\"). Patti is envious of Valerie, who is wearing the latest minimal swimwear when she dives into the lake((Melba dubs her 'Lady Govida'). Billy is hamstrung socially, because is father still makes him wear knickers(unbelievable, as Carleton was 24 and quite tall!). Busby Berkeley was choreographer. The film opens with papa Robinson conducting a summer band in a pavilion, with Jane, in a very elegant womanly outfit, singing a classic piece \"A Heart that's Free\", which Diana Durbin had sung during her brief MGM period. Much later, Debbie and some boys sing \"That's How I Need You\": very amateurish, as intended. Jane then walks in, and begins a much better \"The Oceana Roll\", composed around 1910, with the others eventually chiming in: a fun production. Besides the memorable \"Aba Daba Honeymoon\" duet, which also includes considerable dancing and clowning, Debbie and Carleton do a duet song and dance to \"Row, Row, Row, Your Boat\", which also is quite entertaining. Later, in Jane's elaborate dream sequence to \"My Beautiful Lady\" she is dressed very stylishly , in pink, with parasol, as Demi and Billy fight for her hand, in one portion. The finale stage production is rather short and simple: Patti tangos with Demi, she swoons when her surgical corset locks, inhibiting her breathing. This scene is set up by Billy and Melba, who stole Valerie's dancing shoes. Thus, at the last minute, Patti takes her place in the show, wearing Valerie's shoes, after Valerie leaves in disgust. Yes, pretty contrived! Debbie gets most of the easy-going, fun, musical numbers, while Jane mostly gets the serious romantic singing roles. It would be the same story when they were again paired in \"Hit the Deck\". Both that film and this one were directed by Roy Roland. Like Judy Garland, Jane usually had a couple of crying spells in her films. Debbie's character is not so serious about her romancing. At age 30, Richardo was in his peak handsome period. The next year, he would suffer a serious back injury that caused permanent pain and limp....Carleton was quite personable and it's too bad he wasn't included in more films....Clinton Sundberg, who played the resort manager, had a limited film career, usually playing minor service characters. I remember him as the haughty butler , in \"The Girl Next Door\"... Louis Calhern, who played the family father, also played Jane's grandfather, but functional father, in \"Nancy Goes to Rio\", released the same year... I though Phyllis Kirk did an excellent job in the thankless role of 'the other woman'. Reportedly, Jane's favorite film she did. Not really my favorite of her films, but it has it's positives.",
         "\"Two Weeks with Love\" is a delightful coming of age comedy musical, with a couple of young actresses who could really sing and dance. In the mid- 20th century, and the 50 or so years of earlier society that the movies often showed, coming of age was a well defined rite of passage – for both boys and girls. But young ladies seemed to be more aware of it – or it meant more to them. For the last half century or so, the focus just seems to be on teen years, with passage morphed in there somewhere and not clearly defined. So, society isn't as cognizant of this particular time anymore and we no longer see coming of age films. But, this one is a dandy, and the coming of age is \"the issue\" around which the plot unfolds. Jane Powell plays Patti Robinson, the female who is coming of age, and Carleton Carpenter plays Billy Finlay, the male who is coming of age. Besides these two characters, this film is loaded with young talented singers and dancers, and with a cast of wonderful performances, young and old. Ricardo Montalban, though a very good actor overall and in this role, just seemed a curious choice to play the male lead, Demi Armendez. He was 41 when the film was made, and even makeup can't quite make him look too much younger. Right behind Patti, who is 17 in this movie, is her sis, Melba, played by Debbie Reynolds. She is 15. She and Patti are in a one-way romantic triangle with Finlay. Melba pines for Billy, who pines for Patti, who pines for someone else, so long as it's not Billy. Both female singers play their younger roles especially well. Believe it or not, Powell and Reynolds have the same birthday – April 1, three years apart. Powell was 21 when the film was made, and plays a 17-year- old. Reynolds was 18, and plays a 15-year-old. They carry it off very nicely and believably. The two starlets became close friends for life, and made two more musical comedies together. They played sisters again in the 1954 movie, \"Athena,\" and were paired as friends in the smash hit, \"Hit the Deck\" with Tony Martin and others. As of my writing this review, both actresses are still alive. Both had long careers in film and on television. Powell's soprano singing roles faded by the end of the 50s, and Reynolds' singing roles ended with the 60s. Both would sing in some of their TV appearances later, and Reynolds especially had a much more full acting career, mostly in comedy. Powell's biggest hit beside her pairings with Reynolds was \"Seven Brides for Seven Brothers\" in 1954. Reynolds had major hits with \"Singin' in the Rain\" in 1957, \"The Unsinkable Molly Brown\" in 1964, and \"The Singing Nun\" in 1967. She had her own TV variety show in 1969-70. \"Two Weeks with Love\" is a fun, warm and funny movie that the whole family will enjoy. Reynolds is especially good in her role, and the supporting players all are very good. It's a hilarious two-week vacation for the Robinson family at Kissameee in the Catskills. Here are two samples of very funny situations in the film. The Robinson's are in the resort dining room which is full with guests, when the suave Demi Armendez (Montalban) arrives in the doorway. We never learn who it is, but an older woman on his arm may be his mother or an aunt or who knows what. The woman is wearing a black dress with white trim on the top. Demi is wearing a loud sport coat -- loud especially for that time. It's a three-color broad striped coat in red, orange and tan. The table conversations all stop and everyone looks at the couple. \"What are they staring at?\" Montalban says to the woman. She replies, \"My new dress.\" Later, Patti thinks she has missed her chance with Demi and she's sitting alone at the drugstore counter. She has ordered a strawberry soda. \"I guess there's nothing left for me to do but become a missionary,\" she says. The old-timer druggist sets her soda down and says, \"Well, you wouldn't want to do that on an empty stomach.\"",
         "Not one of my favourite musicals, or one of my favourite films of all time. But 'Two Weeks with Love' is just impossible to dislike and easily one of the most pleasant surprises had over the past few weeks (seeing it on an old VHS belonging to an American friend who is a fellow fan of older musicals), standing above most \"golden age Hollywood\" musicals seen recently. Don't let the predictability of the story throw you off or that the outcome of the film is not hard to figure out at all early on. Judging it on what it aimed to do and what was expected, 'Two Weeks with Love' succeeds brilliantly and while it is not a masterpiece of the genre or of film when it comes to how well made, performed, enjoyable and easily digestible it is 'Two Weeks with Love' can't be beat. Visually, 'Two Weeks with Love' looks beautiful and was clearly made with love and care. The set and costume designs are sumptuous and elegant, actually feeling more expansive than the studio-bound look. The film is beautifully photographed too and boasts big, bold, rich colour that is just a feast for the eyes without being overdone or overly-garish. The music and songs are lovely and fill one with joy and emotion. The standouts are \"Oceana Roll\", \"By the Light of the Silvery Moon\" and \"Abba Dabba Honeymoon\", while it was wonderful to hear \"My Hero\" from 'The Chocolate Soldier' too. All are beautifully performed and staged. The choreography from none other than Busby Berkeley is both exuberant and intimate, while it may not have the imagination and wildness of Berkeley's very best work that's in no way a disappointment because more understated Berkeley but still with his usual pizazz and musicality fits better here. Was also surprised at how good the script was, full of genuinely funny humour (the corset stuff that could easily have been repetitive and out of date inducing good amusement still) and emotion. The story may not hold many surprises, but that doesn't matter when the energy and charm were so good, the fun was non-stop and also that some of what it had to say being genuinely sincere and touching. The nostalgic and romantic qualities 'Two Weeks with Love' were similarly handled beautifully. Direction is adroit throughout. Jane Powell captivates in her charm and not only does she sing beautifully but also like it came straight from her heart. Even better is cute, peppy and feisty Debbie Reynolds ('Two Weeks with Love' was seen in her memory too), who injects so much spark effortlessly and without over-doing it. Ricardo Montalban is so handsome and suave with great comic timing and energetic charisma. Louis Calhern is amusing and Ann Harding is no less delightful. Only Carleton Carpenter is a little on the wooden side and he doesn't look comfortable playing a character younger than he. Overall, a sheer romantic musical delight and is likely to have even the most sceptical of hearts swooning. 9/10 Bethany Cox",
         "TWO WEEKS WITH LOVE is a rarity, a movie that sets out to capture the innocent charm of the early 20th century, and succeeds. A brave confection, built on a rather silly premise, it artfully presents the conflict in the heart of a 17-year-old girl who yearns to grow up and whose parents yearn to ignore it. Jane Powell is delightful as the adolescent who has a crush on the dashing man, and Ricardo Montalban hits just the right note of sophistication and kindness as he begins to fall for her. Debbie Reynolds is perfect as the wisecracking younger sister who knows what she wants and how to get it (and \"it\" is Carleton Carpenter), and two little brothers add just the touch of innocent mischief we would expect from little brothers in those days. Louis Calhern is delightful as the fumbling father, and Ann Harding is elegant and regal as always as the mother. I don't see how anyone could interpret this as the same movie as DIRTY DANCING, except they both took place in Catskills resorts. It is truly about a loving family and how they cope with growing pains all around. The later film was no such thing, with a different set of characters and a totally different story line. It was certainly a different kind of resort as well.",
         "Believe me, I love the old MGM musicals, but this particular Powell player doesn't work for me. Certainly, the MGM \"class\" is visible in every frame, even if the back lot is not a convincing substitute for the Catskill Mountains. The architecture and atmosphere simply do not evoke the implied location. Debbie Reynolds is the only spark in this uninspired flick. Supporting performances are basically caricatures, at best. Technicolor always astounds me, even if the material does not. Just TWO years later, Reynolds would star in \"Singing in the Rain,\" an MGM classic that blows this safe, milk toast tid-bit out of the water."
      ],
      "genres": [
         "Comedy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": ["The Robinson family are spending two weeks of summer vacation at a resort in the Catskills. Older daughter Patti vies with her friend, Valeria, for the affections of Demi Armendez but Patti is at a disadvantage because her parents think she is too young for boys. But with Patti singing at an amateur show and a dance, her adventures in quest of Armendez ends happily."],
      "budget": 0
   },
   "movielensId": 125165,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1950-01-01",
      "dvdReleaseDate": null,
      "directors": ["Roy Rowland"],
      "runtime": 92,
      "movieId": 125165,
      "title": "Two Weeks with Love",
      "mpaa": "",
      "actors": [
         "Jane Powell",
         "Ricardo Montalban",
         "Debbie Reynolds",
         "Ann Harding",
         "Louis Calhern",
         "Phyllis Kirk"
      ],
      "imdbMovieId": "0043081",
      "originalTitle": "Two Weeks with Love",
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["fbZ3MjZyjlc"],
      "plotSummary": "The Robinson family are spending two weeks of summer vacation at a resort in the Catskills. Older daughter Patti vies with her friend, Valeria, for the affections of Demi Armendez but Patti is at a disadvantage because her parents think she is too young for boys. But with Patti singing at an amateur show and a dance, her adventures in quest of Armendez ends happily.",
      "tmdbMovieId": 43395,
      "avgRating": 3.5,
      "releaseYear": "1950",
      "numRatings": 1,
      "posterPath": "/8axfKXn4jsLGsktupL3s5DXB5qp.jpg"
   }
}