{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt1549571",
      "video": false,
      "title": "Pure Country 2: The Gift",
      "recommendations": [],
      "backdrop_path": "/rYADwU9cEkgVK3Hssn1X1AWJRt0.jpg",
      "revenue": 133771,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Bobbie Thomas",
               "gender": 1,
               "credit_id": "52fe4979c3a36847f819c03b",
               "name": "Katrina Elam",
               "profile_path": "/iYB1zstnoMjPJPF6jNf2p2owfz.jpg",
               "id": 228669,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "George Strait",
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c03f",
               "name": "George Strait",
               "profile_path": "/9TlizWGEvvTeNqDSvouqDLwPFGi.jpg",
               "id": 93841,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Dale Jordan",
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c043",
               "name": "Travis Fimmel",
               "profile_path": "/v8gLLGqFOHMtftmhg6148zKvBPU.jpg",
               "id": 77700,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Angel Matthew",
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c047",
               "name": "Bronson Pinchot",
               "profile_path": "/hGaFZsohQbRIskmkLtNbwJNgLPN.jpg",
               "id": 4689,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Angel Pedro",
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c04b",
               "name": "Cheech Marin",
               "profile_path": "/efuXbXg7JpORy5hPDU7Zityq3k3.jpg",
               "id": 11159,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Angel Joseph",
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c04f",
               "name": "Michael McKean",
               "profile_path": "/iVcsvBb15nep7TZ07MlJFcxMzvD.jpg",
               "id": 21731,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe4979c3a36847f819c053",
               "name": "Heidi Brook Myers",
               "profile_path": "/698UIdhsOHOublJTXY4LuF8PiAm.jpg",
               "id": 229345,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Aunt Ella",
               "gender": 1,
               "credit_id": "52fe4979c3a36847f819c07b",
               "name": "Jackie Welch",
               "profile_path": null,
               "id": 939368,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Winter",
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c07f",
               "name": "William Katt",
               "profile_path": "/8zgHplikymFmzQhOuwYhin6WJv6.jpg",
               "id": 45415,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Keith",
               "gender": 0,
               "credit_id": "52fe4979c3a36847f819c083",
               "name": "Todd Truley",
               "profile_path": "/40LiLjZINuAopHCRm68326DVe85.jpg",
               "id": 156874,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c037",
               "name": "Dean Cain",
               "profile_path": "/cICjOmo5KZWdfJLBvIExDE6Ma5f.jpg",
               "id": 21721,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c059",
               "name": "Christopher Cain",
               "profile_path": "/atUMxA5Anavwqdd5tH3B3S8ayli.jpg",
               "id": 56828,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c05f",
               "name": "Scott Duthie",
               "profile_path": null,
               "id": 1005287,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c065",
               "name": "Hunt Lowry",
               "profile_path": null,
               "id": 18350,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c06b",
               "name": "Ben Horton",
               "profile_path": null,
               "id": 970100,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c077",
               "name": "Jack Hofstra",
               "profile_path": null,
               "id": 21811,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4979c3a36847f819c089",
               "name": "Steve Dorff",
               "profile_path": null,
               "id": 70054,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56d071819251413e59006089",
               "name": "Christopher Cain",
               "profile_path": "/atUMxA5Anavwqdd5tH3B3S8ayli.jpg",
               "id": 56828,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56d0718b9251413e6d0064b0",
               "name": "Christopher Cain",
               "profile_path": "/atUMxA5Anavwqdd5tH3B3S8ayli.jpg",
               "id": 56828,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56819cc6c3a36828f5007141",
               "name": "Juan Ruiz Anchía",
               "profile_path": null,
               "id": 20693,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.970031,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 58936,
      "vote_count": 10,
      "budget": 0,
      "overview": "Three angels bestow the gift of song to a young girl, who must follow a series of rules in order hold on to it during her rise to fame and fortune.",
      "similar": [
         872,
         11224,
         224141,
         14128,
         16119,
         8587,
         11631,
         114,
         812,
         10882,
         10530,
         15121,
         824,
         10545,
         703,
         252,
         3933,
         18947,
         19404,
         82695
      ],
      "original_title": "Pure Country 2: The Gift",
      "runtime": 112,
      "poster_path": "/5snZKjjQ3ZN1wSG8a6yBPPGJor1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Angry Monkey Entertainment",
         "id": 6820,
         "origin_country": ""
      }],
      "release_date": "2010-10-15",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "Fame led her away. Faith will lead her home.",
      "adult": false,
      "homepage": "http://purecountry2thegift.warnerbros.com/dvd/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Cain"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Dean Cain",
         "Christopher Cain"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1549571/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTYxOTAzNjEwM15BMl5BanBnXkFtZTcwNzU0Mzk5Mw@@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Michael McKean",
         "Bronson Pinchot",
         "Cheech Marin"
      ],
      "reviews": [
         "Generally when you label a movie as a sequel (hence the \"2\" in the title) you set up the expectation that it will be a continuation or, at the very least, contain some of the characters from the original film. Since this movie bore no relation to the movie \"Pure Country, I am at a loss to understand the title. Yes, George Strait was in both movies. However, in the first he played a fictional country singer while in this sequel he played himself in a much smaller role. That is the only tie in. That being said, this movie could have easily had a different title and used a different well-known country singer without changing the plot. Speaking of plot, this one was saccharine, corny and predictable. My husband sat through it with me and kept saying, \"okay, now this will happen next.\" It was sad to see so much talent -- Michael McKean, Cheech Marin, Bronson Pinchot, even Dean Cain -- put to waste. Katrina Elam has a great voice and I enjoyed some of the songs. However, unless you want your teeth to fall out from all the sugar or you're looking for something to put you to sleep at 3 am, avoid this movie.",
         "Short and sweet review. This is no sequel. It's a steaming pile of crap. If you loved \"Pure Country\", you'll HATE this stinker. The addition of angels is hokey. The plot line is trite and predictable. George Strait is only in it for the WORLD'S HOKIEST \"fight\" scene and a could of distance shots. This is a really horrible. SUCH a disappointment. Dean Cain was one of the writers of this movie.... he should stick to acting. Or.. maybe if he REALLY wants to write, he should try NOT sullying the memory of a fun movie like \"pure country\".",
         "**SPOILERS** I only watched this film because it was titled Pure Country 2. As a fan of the original Pure Country, this film is just sad! It had absolutely nothing to do with the the original film. While this is an OK film, please don't watch this thinking it will be another Pure Country. The only thing this film has in common with the first film is country music and George Strait has only 1 1/2 minutes in the film, even though IMDb has him listed as a main star of the film. Watch this film for what it is and not for what it is not, Pure Country 2. Also IMDb don't list people as first billed, when they have less the two minutes of screen time. George Strait: 1 1/2 minutes of screen time. Dean Cain: 45 Seconds of screen time.",
         "The original Pure Country is a fun sentimental romantic movie with some great honky tonk and ballads - not so this new version. It has a low budget Heaven Can Wait meets new country vibe that is pretty darn awful. The plot is the first fault with angels and a gift of voice that is beyond corny in its representation, the second fault is the corn does grow as high as an elephant's eye - we just get all the country clichés and though the original has some heart, this has only saccharine - and almost comes across as,(take a deep breath), fake. Nearly anyways. All in all, I was kind of looking forward to this; the original is actually pretty moving and with its \"A Star is Born\" plot moves along nicely - this sequel is just a mess. I'm loathed to say it, but maybe you should give yourself the real gift this one time and give this a miss....",
         "I have no issue with the general singing and the story line but I do have objections to people not doing research about what is supposed to form a major part of the movie - Autism. The male character in the movie 'was autistic' hello? Am I the only one that knows that Autism is life long and there's no such thing as someone who WAS Autistic. You either are or you aren't. I can't help but wishing that they'd done a little more research into something like this. Also, most of the children on the ranch for children with 'Autism' were kids with Down Syndrome which is very far from being Autism. Okay, rant over. Enjoy the movie if you can excuse some of the blatant errors that they make in the movie.",
         "I am still puzzled be the title, which rather indicated this would have a shred of connection to the original, which it did not. I'm also left to wonder whether Katrina Elma's atrociously affected character ruined her fledgling singing career, as I've not heard of her since this movie. But this movie would make a great drinking game. Take a shot every time Bobbie says \"Thank you\" throughout the movie. She must have said it two hundred times. Or, better make that \"Thing Kew\" in Bobbies saccharine \"accent\". It got annoying. A whole lot of this movie got annoying. I think. I would actually enjoy the soundtrack if I didn't have a mental image of the character singing it. Katrina Elam is no Carrie underwood but she has a nice voice.",
         "If you're looking for a true sequel to 'Pure Country', you will not find that here. Christopher Cain has completely re-imagined the concept of the first film and now it involves angels from heaven and other supernatural elements. I guess that's what happens when you allow Dean Cain (TVs Clark Kent/Superman) to help write the script. George Strait does show up for a cameo, playing himself. That was the highlight of this 90-minute circus. It sure wasn't as heartfelt as the original, nor did it have the splendor or compassion of the original 'Pure Country'. It's a shame to allow something like this to be called a sequel to a very real film. The supernatural, a Jerry Springer-like sequence and the storyline are just insulting to the original film, that I could have cried, just because it's so bad!",
         "I stumbled across this movie on HBO. I don't normally listen to country music, but I really liked Katrina Elam's singing, plus she's great to look at. Her acting is decent, plus she had some similarities to Bobbie Thomas, having gone to Nashville to make it in country music. The plot held my interest, kind of corny but uplifting. Bobbie falls for a rodeo cowboy, but the movie is so wholesome they don't even kiss. The three angels added a light hearted element to the movie, and country fans will like seeing George Strait's brief appearances, although fans of the first Pure Country will be disappointed that this movie isn't a continuation of the original. All in all, a good movie for families, Christians, country music fans.",
         "An aspiring country music singer with a special gift is caught between who she is and who she wants to be. After leaving home a woman who wants to be a singer tries her luck in Nashville. She soon realizes that the price of fame is not what she thought. I am a big George Strait fan but was not a huge fan of the original apart from the soundtrack. This one was over the top cheesy. George Strait is in this one too, but playing himself. If you liked the original I'm pretty sure you would like this one too. I give it a C+. Would I watch again? - Probably not, but I may watch first one again just to see if I remember it right.",
         "Just watched this movie today, since it was recently on a movie channel over the weekend. It was family friendly and contained great country music! The plot was a bit predictable, but I teared up at the end and the movie had a great heartwarming message. I watched it with my 7 year old daughter and it was great that the movie reinforced the fact that lying, being unfair and breaking promises are all bad things to do in life. The lead actress has an Amazing voice and I am not quite sure why she isn't a huge country star--she should be! The one thing I agree with, is that the title is not quite right. It is nothing like Pure Country and calling it a sequel just isn't correct. I think if this movie was given a new title, than it would have been received more. All in all, a good family movie with great songs and good acting (in fact, I think the acting was better in this one than the original Pure Country). Enjoy!",
         "Wow, I can't believe so many \"reviewers\" would speak so harshly of this movie. Perhaps it makes them feel good to sit at home with a computer and write a review of how bad a movie is, but how many of these people could go out and do any better. Not every film is design to win an academy award. Some are supposed to simply entertain. Sure it was predictable and corny, but it was a family friendly, fun movie with a good message. No cussing, sex, killing or violence. Wow, what a concept. I watched it with my four young grandkids and we all enjoyed it. I didn't know anything about Katrina Elam before this movie. What a beautiful young lady with a great voice. And for having no previous acting experience, she did great. How many reviewers who panned her performance can sing like she does or will ever be in, let along be invited to star in any movie? It would be nice if reviewers would be a little more realistic in their expectations and look a films for what they are; entertainment.",
         "I was very disappointed by other reviews. My family LOVED this movie ! It brought tears to our eyes even watching it on more than one occasion. It has a lot of underlying meanings that really hit home ! this was so much more that just a movie for entertainment ! And the way it all tied everything up at the end was very well done ! It left a lasting impression ! My teenager had no interest in watching this - her comment was \"I hate country\" but even she enjoyed it. My husband is a hard emotions police officer, but he said it hit him in the heart. this is a very heart filled movie for the entire family. SPOILER: I loved how it foreshadowed and then eventually explained hippotherapy ! this is something we have been considering for our child. My older child was against it until she saw the movie and is now willing for her younger sibling to try ! I will use the lessons of this movie with my children for years to come ! Don't lie don't break a promise and always be fair ! as well as making it up to those we hurt ! I did at first think the angels were a little cheesy- but they really explained a lot !!! We had even discussed purchasing the movie we enjoyed it so much !",
         "The story is a heartwarmer, inspiration to anyone following their dreams and doing what they love -- with some lessons to be learned, of course, which happened quite easily. The casting was wonderful, the lighting and shooting amazing on spectacularly designed and colored sets, the continuity impeccable, and the highs and lows of the story line flowed so beautifully. It was certainly a dip into the reality of the music land of Nashville, the possibilities and problems and ways to deal with them. I loved the singer's transition from singing to singing for \"a cause\" and the introduction of beloved horses and challenged children in the process. Starting with the main character's home life and upbringing, her experiences with family, and her dealing with the characters woven into her new life, the music itself was the icing on the cake. Such a beautiful job done by all -- and I didn't have to go to a theater to see it. :-)",
         "OK. I admit it, when I saw the title \"Pure Country 2\", I first thought that we would see the next stage in Dusty's life, especially when I saw that George Strait was once again in it. So I looked forward to more wonderful songs from George and his guitar. Only it didn't happen. Instead, we were treated to a romantic comedy with a mixture of modern and traditional country music. Given that George only appears in basically 3 scenes in the film, the lead in this movie goes to relative newcomer Katherine Elam. She does a capable job. Also the actress who played her aunt played the role masterfully. While I thought that the script was a little weak, and I admit I would have liked to hear George sing during the film (who wouldn't?), it was really pretty good. It won't win any Oscars, but it will provide you with an entertaining two hours. And if you don't turn it off at the end with a little bit of an emotional high, you're brain-dead."
      ],
      "genres": [
         "Drama",
         "Music",
         "Musical",
         "Romance"
      ],
      "productionCompanies": ["Angry Monkey Entertainment"],
      "summaries": ["Three angels bestow the gift of song to a young girl, who must follow a series of rules in order hold on to it during her rise to fame and fortune."],
      "budget": 0
   },
   "movielensId": 125125,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-10-15",
      "dvdReleaseDate": null,
      "directors": ["Christopher Cain"],
      "runtime": 112,
      "movieId": 125125,
      "title": "Pure Country 2: The Gift",
      "mpaa": "PG",
      "actors": [
         "Katrina Elam",
         "George Strait",
         "Travis Fimmel",
         "Bronson Pinchot",
         "Cheech Marin",
         "Michael McKean",
         "Heidi Brook Myers",
         "Jackie Welch",
         "William Katt",
         "Todd Truley"
      ],
      "imdbMovieId": "1549571",
      "originalTitle": "Pure Country 2: The Gift",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["BNobljqbbm4"],
      "plotSummary": "Three angels bestow the gift of song to a young girl, who must follow a series of rules in order hold on to it during her rise to fame and fortune.",
      "tmdbMovieId": 58936,
      "avgRating": 3.25,
      "releaseYear": "2010",
      "numRatings": 2,
      "posterPath": "/5snZKjjQ3ZN1wSG8a6yBPPGJor1.jpg"
   }
}