{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1144815",
      "video": false,
      "title": "Son of Morning",
      "recommendations": [59951],
      "backdrop_path": "/vDslijiLcjU8SXk13ouGVOZ2MWM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Josephine",
               "gender": 1,
               "credit_id": "52fe48e3c3a368484e1101df",
               "name": "Heather Graham",
               "profile_path": "/rHIEhPAnZQn8BTbB1EVQ5ggEOX7.jpg",
               "id": 69122,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Leda",
               "gender": 0,
               "credit_id": "52fe48e3c3a368484e1101e3",
               "name": "Lorraine Bracco",
               "profile_path": "/8khTSZIrHEMbBiH6HSAOzOnnbmB.jpg",
               "id": 11478,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Senator Lewis",
               "gender": 2,
               "credit_id": "52fe48e3c3a368484e1101e7",
               "name": "Stephen Root",
               "profile_path": "/sceCvLiv8xe2jQzrVn39wvosVHG.jpg",
               "id": 17401,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Philip",
               "gender": 2,
               "credit_id": "52fe48e3c3a368484e1101ef",
               "name": "Joseph Cross",
               "profile_path": "/i2W2NGZwYm9Lep0ytHZ8XPN6lno.jpg",
               "id": 33528,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Gabriel Peters",
               "gender": 2,
               "credit_id": "52fe48e3c3a368484e1101f3",
               "name": "Danny Glover",
               "profile_path": "/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg",
               "id": 2047,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Glenn",
               "gender": 2,
               "credit_id": "52fe48e3c3a368484e1101f7",
               "name": "Paul Telfer",
               "profile_path": "/lhnYgi6akdUIVlBi99NPUWRkVCq.jpg",
               "id": 207300,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jamie",
               "gender": 1,
               "credit_id": "552aee9bc3a368565f0042e8",
               "name": "Jamie-Lynn Sigler",
               "profile_path": "/ufz89DMTHABqUufCTqFzUv2ZUcq.jpg",
               "id": 99241,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. Villinger",
               "gender": 2,
               "credit_id": "57769d83c3a3687cc90012dd",
               "name": "David Fabrizio",
               "profile_path": "/rcT4BPhZQDK0a2nIp9WlGn920eG.jpg",
               "id": 41318,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mr. Bordasche",
               "gender": 2,
               "credit_id": "57914b8b9251416038002326",
               "name": "Jon Polito",
               "profile_path": "/acIcTtPUjIn3LwTMfDsRYU8RDE.jpg",
               "id": 4253,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Fred Charles",
               "gender": 2,
               "credit_id": "58599efa9251416fad06d774",
               "name": "Bob Odenkirk",
               "profile_path": "/nJLcRRqq9JTQTgVYrFn7vPDgAsK.jpg",
               "id": 59410,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48e3c3a368484e1101d5",
               "name": "Yaniv Raz",
               "profile_path": null,
               "id": 175626,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e3c3a368484e1101db",
               "name": "Yaniv Raz",
               "profile_path": null,
               "id": 175626,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.340594,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 74877,
      "vote_count": 9,
      "budget": 0,
      "overview": "A young copywriter becomes the most famous man on the planet, overnight, when he is mistaken as the next messiah.",
      "similar": [],
      "original_title": "Son of Morning",
      "runtime": 81,
      "poster_path": "/hFIEw5ub6IiWb9j6InG945SirRi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2011-01-01",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "The world's always looking for a savior. LET THERE BE PHILLIP.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yaniv Raz"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Yaniv Raz"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1144815/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTY5MjI5NTczMl5BMl5BanBnXkFtZTgwMDgzNjcwMzE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Joseph Cross",
         "Heather Graham",
         "Edward Herrmann"
      ],
      "reviews": [
         "It's about a troubled kid who bleeds from his eye in church one day and is immediately snatched up by the media and presented to the world as the Messiah. The director seems to take his cues from Zach Braff (Garden State), with the Scrubs-like frame skips and indie-emo tracks; though he lacks the sense of artful timing to pull this off effectively as a tool to convey any sort of depth beyond merely getting characters from one scene to the next. Son of Morning seems to be more of an experiment in the use of frenzied background music to convey the emotions normally exuded in film through writing and performances. It overshadows nearly every potentially-interesting scene with a hasty mix of tracks and sound effects layered on top of one another. It (probably) wants to convey the confusion and/or hysteria of an ordinary kid suddenly being catapulted on a wild ride through pain/tragedy/stardom, just in case the audience doesn't get the point via the pedestrian performances. If indeed an experiment, it's a failed one, as the music is purely a distraction. A big distraction that is the final nail in a coffin already firmly glued shut. More mess is amply provided by the parade of uninteresting performances (aside from Danny Glover, the only person worth watching in this cluster-bleep), missed opportunities, awkward pauses, and other missteps. It's a rambling collage with little idea of what it wants to be, and feels long despite being a relatively short film. It eventually attempts to spell out some message that doesn't seem terribly relevant to the brunt of what came before. Overall I found this to be a rather annoying movie.",
         "lots of times, before seeing a movie, i come here to check out the comments if i'm 'on the fence' about whether or not to see it... there wasn't any more feedback then than there is now. but i really like danny glover. and i've seen lorraine bracco in some good films... so i gave it a chance. BIG mistake. so i write this so that maybe YOU might choose differently and not waste any time/energy/effort with this movie... a few interesting possibilities for a story that, ultimately, goes NOwhere... i think one of the reviewers wrote that it was more like a high school project. i think they were giving more credit than it deserved... i think that's ten lines and all that i'm giving this since i already feel robbed...",
         "Nobody sets out to make a bad movie. That said, somebody should have performed an intervention at some point to tell the director that nothing was working and he needed help. Early on I had the feeling that the film was being helmed by someone who really enjoyed saying, \"I'm a director,\" but didn't consider directing as something that should take a lot of thought or work. And then there was the writing which also let me know pretty early that there probably wouldn't be much payoff for my time and attention. **SPOILER** The Sun is going out because it's running out of Hydrogen...because that's what it's made of and if it doesn't have that then it doesn't, like, work right anymore. And that's all you need to know about that. So, now you have a director who doesn't seem to be trying to communicate anything visually, a writer who thinks making sense isn't all that important and guess what, it's the same guy. Later I looked the guy up and discovered that it's his first feature. Which is fine, but why wasn't somebody checking up on him? They used expensive film, had multiple locations and a lot of big name cameos. Why would they sit back and let him pretend like he knew what he was doing? What's that you say? He's Heather Grahams long time, good looking boyfriend? Ohhhhh. Gotcha. I guess that's enough for automatic carte blanche, but they really didn't do the guy any favors. In fact they owe him an apology. A seasoned writer to bounces the script off, and a veteran cinematographer to marry the shot to the message and this film might have been salvaged. Not good, but marketable. All of the performances are wasted due to lack of control and or vision, the soundtrack is so unimportant to the story or scene that it's actually an unwelcome distraction; \"Why are we playing that music at this point in the scene?\" \"I don't know, cause it was too quiet?\" \"Hm, okey dokey\" The whole exercise reminds me of some people I went to art school with. They know what they like, but they haven't the slightest clue how to get there. And will quickly tell you you're not smart enough to understand what they're saying (Quick tip: Only a stupid person or a con man would ever say something like that). Son of Morning wants to say something important, but important words don't come easy to privileged people. So basically it ends with a string of useless clichés as the protagonist's final speech before a great big giant flaming cliché as his last act. And not one single second of any of it ever mattered. 2/10",
         "Son of Morning is about a 20 something nobody who is suddenly propelled into the spotlight thanks to a reaction to a prescription drug. If you are looking for any of the deep areas this premise can take you, you are sadly mistaken. I do not wish to write a bad review. Perhaps I just do not have the eyes for this film. Unfortunately, from where I am standing, this movie is reminiscent of a high school project with a much bigger budget. Every time the movie attempted to be artsy, the point was far too obvious, and had no real depth. This movie could have been much better. And just a comment on the last review, I think the director was much too '90 with much of his film work. Many parts (i.e camera work, extra/ main character acting style, certain dialogue and continuous indulgence in it's own messages) were very sudo-avante garde. That's all I'll say, for I do not wish to slander someone's work. However, I think all would agree, could have been much better. Too good a premise, and too many good actors for such a poor work..... (btw Danny Glover, always a gem. Best part of the film)",
         "First couple of minutes of the film I thought seemed to have potential for an interesting, satirical black comedy...at the very least something quirky. Nope. I agree with the other reviewer who found this movie annoying; so much so that I had to surf IMDb about 10 minutes into the film to see if anyone else had a similar reaction. I was baffled by the assembly of very good actors and poor script. Apparently the director/writer is Heather Graham's boyfriend - I'm going to assume this is the reason the film was made, because that's all I've got. I'm very disappointed because the basic premise could have been developed into something...anything. Instead I watched a mess with annoying characters, no development, poor cinematography, bad edits, and a hideous ending. At the very least, I thought there might be redemption in the ending. I waited for even something far-fetched. Nothing. Rambling about tasting the clam chowder as a meta statement about living life. Blah, blah, blah. In the final moments, I was thinking this guy had better be walking on water when he reaches the ocean - even if he is not the messiah, give me something here. Just a retard walking into the ocean to drown himself. Whatever. It is very shameful that there is more deserving material worthy of the cast and budget."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Hothead Entertainment"],
      "summaries": [
         "As an environmental catastrophe threatens the world; Phillip Katz (JOE CROSS, Milk), a stressed-out, lowly copywriter, experiences an episode of stigmata in church and is positioned as the next MESSIAH by an ambitious reporter, Josephine Tuttle (HEATHER GRAHAM). Phillip is whisked away to a lavish hotel suite as politicians, reporters, and devout fans descend upon him, each hoping to exploit Phillip for their own purposes. After becoming the most famous man on the planet in less than a day, Phillip must decide how to use his newfound celebrity...",
         "A young copywriter becomes the most famous man on the planet, overnight, when he is mistaken as the next messiah."
      ],
      "budget": 0
   },
   "movielensId": 125209,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-01-01",
      "dvdReleaseDate": null,
      "directors": ["Yaniv Raz"],
      "runtime": 81,
      "movieId": 125209,
      "title": "Son of Morning / The Last Days",
      "mpaa": "R",
      "actors": [
         "Heather Graham",
         "Lorraine Bracco",
         "Stephen Root",
         "Joseph Cross",
         "Danny Glover",
         "Paul Telfer",
         "Jamie-Lynn Sigler",
         "David Fabrizio",
         "Jon Polito",
         "Bob Odenkirk"
      ],
      "imdbMovieId": "1144815",
      "originalTitle": "Son of Morning / The Last Days",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young copywriter becomes the most famous man on the planet, overnight, when he is mistaken as the next messiah.",
      "tmdbMovieId": 74877,
      "avgRating": 1,
      "releaseYear": "2011",
      "numRatings": 1,
      "posterPath": "/hwXJC52SCgN5iWvhaAS4vtQWewK.jpg"
   }
}