{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "death row",
            "id": 2501
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0023629",
      "video": false,
      "title": "Two Seconds",
      "recommendations": [
         4112,
         32887,
         1840,
         25407,
         29470,
         27543,
         34650,
         25551,
         36949,
         43463,
         35006,
         37041,
         26654,
         22924,
         20298
      ],
      "backdrop_path": "/kBxqIDUJMEPGQUuXkisBfhjERhy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "John Allen",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e0477e7",
               "name": "Edward G. Robinson",
               "profile_path": "/af1aBRi4UccaxtmDPWEtlfy1vXE.jpg",
               "id": 13566,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Shirley Day",
               "gender": 1,
               "credit_id": "52fe4515c3a368484e0477eb",
               "name": "Vivienne Osborne",
               "profile_path": "/6TJpDolZJZPHGFaZj9h8G1o7bss.jpg",
               "id": 95020,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bookie",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e0477ef",
               "name": "Guy Kibbee",
               "profile_path": "/pqWHnvlW3oDUTHl8KzgBeHJwgQ0.jpg",
               "id": 30002,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Bud Clark",
               "gender": 2,
               "credit_id": "533f8da60e0a262b5c0007cb",
               "name": "Preston Foster",
               "profile_path": "/iZmiPuuHJm2pLxgmhrCQ504wWwn.jpg",
               "id": 33004,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e0477f3",
               "name": "J. Carrol Naish",
               "profile_path": "/iHUIlLxzgkZSMvapdxLhBZe82B.jpg",
               "id": 30686,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Judge",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e0477f7",
               "name": "Frederick Burton",
               "profile_path": "/qqId4FeR1kKokQYQQvgcC9bOQB2.jpg",
               "id": 74877,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e0477fb",
               "name": "Harry Beresford",
               "profile_path": "/8xttgHd9pC8tzJywxEfCsscarjY.jpg",
               "id": 33005,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Lizzie, Cleaning Lady",
               "gender": 1,
               "credit_id": "52fe4515c3a368484e0477ff",
               "name": "Dorothea Wolbert",
               "profile_path": null,
               "id": 96067,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "The Warden",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e047803",
               "name": "Berton Churchill",
               "profile_path": "/ogPbWVXGrcGwTQmXWjwrOPTDo6I.jpg",
               "id": 14969,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "College Boy at Execution",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e047807",
               "name": "William Janney",
               "profile_path": "/wFtUJrgwG2eIrMaqSRKaevMICKM.jpg",
               "id": 96068,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "The Prison Doctor",
               "gender": 2,
               "credit_id": "52fe4515c3a368484e04780b",
               "name": "Edward McWade",
               "profile_path": "/stYTpAkJXE1vLjUZIosE91AmMUN.jpg",
               "id": 96069,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Woman",
               "gender": 0,
               "credit_id": "52fe4515c3a368484e04780f",
               "name": "Gladys Lloyd",
               "profile_path": null,
               "id": 96070,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Annie (uncredited)",
               "gender": 1,
               "credit_id": "584a5d08c3a368141a01dc27",
               "name": "Adrienne Dore",
               "profile_path": "/utWI9lfduJtm4Vr1mMPRst9Pp8v.jpg",
               "id": 588934,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Tart (uncredited)",
               "gender": 1,
               "credit_id": "584a5d4092514119b301c6a4",
               "name": "Luana Walters",
               "profile_path": "/nROPB9o1dzLM6l0cIBS8tMAc2T6.jpg",
               "id": 32194,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4515c3a368484e0477e3",
               "name": "Mervyn LeRoy",
               "profile_path": "/bbzImfUjJ7v9U86WCpXMjAF4Nap.jpg",
               "id": 9054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4515c3a368484e047815",
               "name": "Elliott Lester",
               "profile_path": null,
               "id": 222573,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4515c3a368484e04781b",
               "name": "Harvey F. Thew",
               "profile_path": null,
               "id": 128355,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe4515c3a368484e047821",
               "name": "Sol Polito",
               "profile_path": null,
               "id": 8714,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59775c4ac3a3684acd006841",
               "name": "W. Franke Harling",
               "profile_path": null,
               "id": 13336,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "59775c53c3a3684af60069fb",
               "name": "Terry O. Morse",
               "profile_path": null,
               "id": 29321,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59775c599251413ada0066c5",
               "name": "Anton Grot",
               "profile_path": null,
               "id": 32999,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59775c619251413ae200684d",
               "name": "Hal B. Wallis",
               "profile_path": null,
               "id": 4123,
               "department": "Production",
               "job": "Supervising Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.041285,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26714,
      "vote_count": 5,
      "budget": 0,
      "overview": "A condemned murderer, in the process of being executed, relives the events that led to his being sentenced to die in the electric chair.",
      "similar": [
         14638,
         996,
         910,
         513285,
         247,
         11615,
         256591,
         497,
         599,
         289,
         1092,
         426,
         402,
         1939,
         9348,
         845,
         678,
         223,
         1834,
         25736
      ],
      "original_title": "Two Seconds",
      "runtime": 67,
      "poster_path": "/sg0RuQWrjsWdBoTieqoDjKoddHd.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "First National Pictures",
         "id": 3245,
         "origin_country": ""
      }],
      "release_date": "1932-05-28",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "HIS LIFE WAS A LIVING HELL until he killed the thing that Crushed him!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Mervyn LeRoy"],
      "runtime": 67,
      "synopsis": null,
      "writers": [
         "Elliott Lester",
         "Harvey F. Thew"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023629/",
      "coverLink": null,
      "actors": [
         "Edward G. Robinson",
         "Vivienne Osborne",
         "Guy Kibbee"
      ],
      "reviews": [
         "There's no chance a movie like this is coming out of Hollywood this decade or the previous decade or in the nineties or eighties. Two Seconds is the story of an unhappy steel worker and his squalid little life. At times, Edward G. Robinson is very over the top, but when it matters, his performance is crackling with authenticity and passion and it is clear why this small and unattractive man became a huge Hollywood icon. His fire is undeniable. Unpredictably plotted in the way many pre-code B pictures were, this piece is always engaging and alive and perhaps a bit too short. It contains an absolutely searing monologue that you will never forget and overall the work is a dirty window through which the desperation of life for the lower class in 1930 American can be gleaned. A good film and a rich portrait. (I saw 35mm prints of the movie at Film Forum, N.Y. on two occasions.)",
         "Edward G. Robinson is practically the whole show, and what a show it is. This is Warner precode drama at its best, and why I never heard of it until I saw it on TCM is a wonder. It's got everything, from the seemingly mismatched roommates, thoughtful John (Edward G. Robinson) and gregarious Budd (Preston Foster), talking about scoring on a date in the most unsubtle of language while riveting on a tall skyscraper, to a barracuda in high heels, Shirley (Vivienne Osborne), who has her eyes on John's $62.50 a week from the start and tailors her act to suit his highest admiration - education and books. She tells John she's working in a dance hall to help support her folks so she can have time to study at night, and even the audience is not sure about her at first, so you're sympathetic with John for him not knowing either. However, it's not just John's steady paycheck Shirley's after. There was one true thing she told John before they were married - she has ambitions. As she tells a broken John later on - in wallet and spirit - \"there are things a Mrs. can get away with that a Miss can't\". With Mervyn Leroy you'd expect superb direction, and that's what you get. This is so stylishly shot too. Even though there are no expensive sets - after all this is 1932 WB we're talking about - a lot is done with a little. Take the scene in the courtroom with only the sound of a fan at first, Eddie G. in what looks like a spotlight with the rest of the courtroom dark except for the judge's face - we're talking prototype noir here both in substance and style. From the baby face of William Janney that we see in the first frame to that same face full of wonder in the last, this thing is expertly constructed as the flashback of a man about to be executed who has \"two seconds\" to live his life over from the time the electricity floods his body until his brain stops functioning. Highly recommended. Best precode moment:Shirley has dragged a drunken - but now married - John back to his apartment. Her first act as John's wife is to kick Bud out for good. Before Bud even has packed his stuff and left, Shirley is stripping down to her undies. Mind you, this is a one room flat. You can only assume she is going to consummate this marriage pronto before John has a chance to sober up and cry \"annulment\". As a parting shot of regard Bud finishes a cigarette he is smoking and tosses it on to her already bare back as she is raring to go as soon as Bud is out of the room...that is, I'd assume she'd wait until he left the room! Hot stuff from WB.",
         "I caught this movie last night when I couldn't sleep.Not being a fan of Edward G Robinson I decided to watch for the kitch appeal I guess I was expecting to see him play some world weary mob gut who would say funny things that I could repeat at work,well about 30 minutes in I was absolutely gob-smacked It was like watching a train wreck I could not take my eyes off it. I am not exaggerating when I say I will always remember this movie and be haunted absolutely haunted by the riviting almost painful job done by Mr.Robinson I thought I knew who this man was I thought I could judge his body of work with out ever seeing this movie I was wrong This movie will stay with me for a long long time",
         "This was a wow film from the start. Edward G. Robinson was just a fantastic actor. He made this one eminently watchable. Hats off to Vivienne Osborne as the girl from the wrong side of the tracks who's mission it is to hook a sucker into marrying her so she can leech off of him. She plays the role so well, in the beginning you don't know if she's genuine or not. The only one who does know she's a leech is Robinson's roommate and coworker. He doesn't even have to meet her to know she's trying to rope his buddy in. I won't spoil the ending folks, cause it's a darn good one. I was even surprised by it. Let's just say you reap what you sew and I'll leave it at that. Try this one and don't be fooled by the year it was made. It could fall right into today's abundance of junk films and come out on top...by a wide margin. Just an amazing performance by Edward G. Robinson. Don't miss this one.",
         "Although I can't find out much information about this extraordinary film, Edward G. Robinson gives, probably, his greatest performance. \"Two Seconds\" - the amount of time it takes, when, strapped to the electric chair, the current runs through your body till you are pronounced clinically dead - and your whole life is supposed to flash before your eyes - was originally a Broadway play with a short run in 1931. Preston Foster created such an impression as likable Bud Clark, that he was asked to re-create his role in the movie opposite Edward G. Robinson. The story is told in flashback as John Allen (E.G.R), a bewildered man sentenced to death for murder, reviews his life. He was a riveter, who shares digs with his lively pal, Bud (Preston Foster). Bud always has something on the go, whether it is betting on the ponies, dames or just a high old time. John is more thoughtful, he wants knowledge and would like a girl, who, like him, wants to better herself and yearns for the higher things in life. He knows he is not going to get that with the kind of blind dates Bud keeps finding for him - \"firemen's girls\" (whatever that means)!!! After being assured by Bud that this time his date will be special and seeing that she is anything but, John hides out in a dance hall and makes the acquaintance of Shirley Day (Vivienne Osbourne), a dance hall girl who seems to have the same aspirations as he. But the lines she is spinning him - invalid parents in the country, wanting to go to night school - are as false as she is. She is as tough as they make 'em and one night when John thinks they are going to a lecture, she entices him to a club, gets him drunk, slips the minister a ten spot and proceeds to marry him - even though it is clear he doesn't know where he is!!! Once they are married she reveals her true self and John's mental state declines. After giving John a piece of his mind, Bud (who sized Shirley up from the start) slips off a girder and falls to his death. John disintegrates mentally as he realises that Bud was right about Shirley and, of course, blames himself for his pal's death. Vivienne Osbourne gives a powerful performance (she almost matches Robinson) as Shirley, in the Wynne Gibson vein. I knew her name but nothing else about her and at the end of the film I was really wondering why she wasn't better known. She had a few scenes where she gave every emotion she had - in her first scene she really did convey an earnestness and a willingness to learn with John - but something just didn't add up!!! Robinson, though, keeps you on the edge of your seat as he finally \"wises up\" to Shirley. Being a pre-code film there is only one way she could afford her glamorous clothes and furs - and it's not by taking in washing!! A chance win on the ponies sends John on a collision course with fate, as he tallies up his debts. The final scene as John argues why he shouldn't be put to death now, now he has reclaimed his manhood will have you gripped by his intensity. How Edward G. Robinson was overlooked for an Academy Award is just astonishing. Also of interest is J. Carroll Naish in an early but memorable role as Tony, dance hall manager and Shirley's partner in crime. Guy Kibbee for once not playing a dithering fool but a sharp bookie who can sense that John's mental state is not quite right. Adrienne Dore also has an uncredited bit as Bud's girl, Annie. Highly, Highly Recommended.",
         "The movie, itself, may not be the finest available for viewing entertainment. However, the outstanding acting skills of Edward G. Robinson are fulling exploited and beautifully captured. And, that talent, that genius, makes \"Two Seconds\" a must see. Robinson shows the depth of his talents and the emotions he is capable of demonstrating. Ah, that contemporary actors could act so well. Watch the expressions on his face, watch his hands, watch his walk, watch the pain -- this is not melodrama, this is a thespian par excellence showing the world how it is done. Alas, the movies does not appear to be available for purchase, but this is one outstanding film that should be in any collection of those who are serious about studying drama and acting skills.",
         "This film starts with a wonderfully exciting premise (that, according to IMDb was first used in 1928). A convicted killer is about to be electrocuted and the witnesses to this are shown talking and learning about how the procedure will occur. The warden explains to them that there is a two second period when a person is electrocuted when he's alive--then, oblivion. You then hear the electric chair in action as the man is killed. Then, the scene dissolves and you get to see those two seconds--two seconds where a man's entire life is dramatized. The killer was apparently Edward G. Robinson. This isn't too surprising since he was typecast at the time in gangster films--only branching into other areas a bit later in his career. The audience could easily imagine Robinson getting the chair in light of this! However, initially, Robinson is a hard-working construction worker--not some hood. And, in this guise, he seems like a really nice guy--soft-spoken and decent. So, unlike the typical Robinson film, here there is some depth to the character--something you don't typically see and which gives the film added appeal. A bit later, Robinson meets a lady at a dance hall. He's smitten with her and at first you think she's a nice lady. However, over time, she leads him into drinking and screwing up his life...and he's so stuck on her that he continues on this disastrous course. She is, apparently, after him for his money, as you soon see her take a very drunk Robinson for a quickie marriage. He has no idea what's happening and she slips the justice of the peace a few extra dollars to ignore that Robinson's so drunk he couldn't even understand what was happening. Soon, Robinson is broke--his wife 'needed' lots of new clothes and the like. His buddy (Preston Foster) is disgusted with Robinson for keeping this 'wife' and allowing himself to be used. Eventually, the two argue when Foster calls her a tramp--something she actually is...in spades! In the process of scuffling on the job, however, Foster falls off the building. While Robinson isn't accused of murder or manslaughter, his nerves are shot and he can't go back to work. His 'loving wife' is not the least bit supportive and makes his recuperation time miserable--she wants money...period. And, while the film doesn't explicitly say it, it sure appears as if his blushing bride goes to work as a prostitute. At this point, the marriage is in shambles and his life is at its lowest. But, it DOES get worse as you learn that the wife is trying to recruit Foster's old girlfriend for the business as well!! Out of the blue, a hunch on a horse race pays off. Now Robinson is able to clear up all his debts and he's got a plan--though he also seems practically on the verge of madness. And the plan? Well, it's to kill the woman who destroyed his life!! Overall, a truly original story--and one that is very original and compelling. One of Robinson's better films of the era.",
         "There's plenty of visual style and more than a touch of misogyny to be found in this grim depression era melodrama briskly directed by Mervyn LeRoy and featuring a standout performance from Edward G. Robinson. John Allen (Robinson) and Bud Clark (Preston Foster) are working as riveters on a New York skyscraper making a wage in difficult times that exceeds a college professor's. Bud the more impetuous of the two spends it as fast as he can make it on women and gambling while Allen remains cautious and frugal until he meets taxi dancer Shirley Day who seduces Allen into marrying him. Bud sees right through her money grubbing scheme and the friendship between the two men ends tragically. Allen falls apart emotionally and is unable to work so Shirley gravitates back to her old boss at the dance hall. Allen discovers the two together and kills her. Sentenced to death the warden explains to witnesses that while he's being fried Allen's life will pass before him in the two seconds it will take to move him from one world to the next. LeRoy along with master cinematographer Sol Politto pack a lot of raw emotion into Two Seconds hour and seven minutes running time by eschewing excess sentimentality and going right for the gut. These are cynical desperate times where it's every man and woman for them self and LeRoy makes no attempt to soften his characters motivations to survive. The no holds barred argument between the new Mrs. Allen gloating while disrobing in front of Bud who responds by tossing a lit cigarette on her back is powerful stuff even today. Politto's camera-work offers some stunning and beautifully lit compositions, grammatically pure transitions and deft camera movement (especially in the dance hall sequence) that gives Two Seconds its quick pace and sense of doom. Eddy Robinson leads a cast (Foster, Osborne, J.Carrol Naish) who ably play it rough and tumble. Whether silent at his execution, shy on his first date or babbling incoherently at his trial he hits the mark every time.",
         "\"Two Seconds\" is one of Edward G. Robinson's earliest starring films, and it's also one of his best. Teetering on the edge of hamminess, but never falling in, Robinson believably conveys the downfall of a basically decent, trusting man victimized by circumstances beyond his control, and how those circumstances ultimately destroy him. He commands your attention every inch of the way in this solid, compactly told (67 minutes) story. Robinson's is not the only noteworthy performance in the film, however. A young Preston Foster, as his co-worker and best friend, gives a good humored, energetic performance (Possible spoiler: The nature of that friendship, as revealed in the film, makes for an interesting gay subtext.). Vivienne Osborne, as the dime-a-dance gal whom the smitten Robinson marries, gives a good, if somewhat shrill, performance that makes you wonder why she didn't have a longer career. Guy Kibbee, here just at the beginning of a WB career that had him playing one Babbitty businessman after another, makes a good impression as a jovial bookmaker. Finally, William Janney, as a young, naive reporter, has a few memorable moments at the beginning and end of the film, and makes the most of them with a convincing performance. The great Mervyn LeRoy, who guided Robinson through his breakthrough role in \"Little Ceaser\" a year earlier, handles the sure-footed direction here, and doesn't disappoint. Good Robinson, good film. Highly recommended.",
         "Here's a short but interesting pre-Code thriller about lonely riveter John Allen (Edward G Robinson) who lives with his pal Bud. John doesn't have much luck with the ladies; all his blind dates turn out to be duds. While escaping one particularly bad date, John ends up in a dance hall and meets the charming 10-cents-a-dance girl Shirley Day (Vivienne Osborne). She knows how to take care of herself (she slaps one groping guy, saying \"you payed 10 cents for your feet, not your hands\"), but when John helps her escape from another pesky patron she treats him like her knight in shining armor. Well, a guy who looks like Edward G should know that the cutest girl in the room is not REALLY going to fall for him, but he takes the bait, and life goes downhill from there. The film is told in an interesting fashion. It begins at the electric chair, and the events of the next hour are supposedly John Allen's flashbacks during the two seconds it takes to \"fry.\" Robinson does a nice job in the film, showing a lot of range from his usual swagger, to vulnerability, to sheer insanity. TWO SECONDS is fairly edgy in terms of content, coming two years before the Hays code cracked down on such things. It's worth a look to see Robinson doing something in the 30s besides playing gangsters.",
         "Two Seconds (1932) *** (out of 4) Interesting Warner drama about a man (Edward G. Robinson) about to be executed in the electric chair. Before the execution a doctor tells the people watching that he will live for two seconds after the switch is pulled and in those two seconds his entire life will flash before his eyes. His entire life doesn't but we see how he ended up in this situation, which is do to falling for a questionable lady (Vivienne Osborne). I was happy to finally get the chance to see this after hearing some nice things about it over the years. For the most part the film does live up to its reputation as being a pretty strong pre-code that has some nice performances wrapped around a downbeat story. I think the best thing the movie has going for it is the performance of Robinson who really digs deep in a role many won't expect to see from him. I was really surprised to see Robinson handle the role of an every day's man who simply goes to work and comes home without much fan fair. I thought the actor was very believable in the role and he certainly made you feel for the character especially after the certain events take place and change his life. Osborne is also very good as she too perfectly fits in the role and really delivers as being that \"nice guy\" Robinson falls for only to quickly change into a snake. Guy Kibbee has a brief supporting role as does J. Carrol Naish and Preston Foster as the best friend. I think the film does go a bit over the top towards the end in regards to everything plays out. I won't spoil anything but what takes place with Robinson was just a bit too much for me but the courtroom scene was quite effective.",
         "Edward G. Robinson stars as a nice guy construction worker who meets and falls for a dance hall girl who gets him drunk and tricks him into marrying her. Robinson and his buddy argue over her on the job and his buddy falls to his death. Grief stricken, Robinson is unable to work and his wife goes back to her old ways to support him. A fantastic performance from Robinson anchors a fairly okay, hyper-melodramatic film that ultimately suggests it should be okay to your murder your wife if she turns to prostitution to support you. (Not really an opinion that stands up these days.)",
         "This is a very entertaining, well-paced, involving flick. It has a power, drama and poignance quite special for its era; indeed, it often feels more like a modern-day movie than one from the thirties. It's rarely shown, so see it if you get the chance.",
         "I know this film has its defenders, and the opening scenes are promising, but I have to say that in the end I found Two Seconds unsatisfying, despite some interesting elements along the way. Edward G. Robinson is an actor I almost always admire, even when his material isn't up to par, but in the final scenes here his performance is overwrought and unconvincing. For the finale he throws all restraint out the window and indulges himself in over-the-top histrionics, as if to compensate for a script that didn't rise to the occasion. To be fair, he was miscast in the role of naive, simple-minded construction worker John Allen; Robinson was pushing 40 when this film was made and his childlike pronouncements in the early scenes just don't ring true. If this had been made in the 1940s perhaps Broderick Crawford or even Lon Chaney Jr. might have made this character credible, but Robinson's intelligence shines through too plainly for us to accept him as an oddly virginal blue-collar guy who turns homicidal. The premise is that what we are seeing represents the thoughts in a condemned man's mind during the last two seconds that his brain still functions, as he dies in the electric chair. That's the hook which provides the title, but it's little more than a gimmick for framing the story: what unfolds in John Allen's mind is a straightforward narrative of the events leading to the capital crime he committed, presented in the familiar style of a '30s crime flick. (And the screenplay violates its own gimmick, for there are sequences in Allen's flashback that occur when he isn't present, explaining things he doesn't know, which are therefore \"memories\" he couldn't have.) From the beginning the script sets up expectations it fails to meet. In an early scene when John is working high above Manhattan with his friend Bud on the frame of an unfinished office building, he looks down on the people below and delivers a speech comparing them to ants that suggests a seminal version of Harry Lime's famous speech in The Third Man. We're prepared to expect that John will come to fancy himself some kind of Nietzsche-like 'Superman,' and that his crime will derive from a sense of superiority over others, but nothing in his subsequent behavior follows from this speech. Instead, John's actions are motivated by deep-seated feelings about the proper relationship between men and women --and perhaps unspoken feelings for Bud, his friend and longtime roommate. More directly, John's crime is provoked by his rage toward his grasping wife Shirley, who tricked him into marriage by getting him blotto drunk and who indirectly contributes to the accidental death of Bud. Shirley is well played by Vivienne Osbourne, an actress I'd never seen before, who is vivid in a two-dimensional, underwritten role. Shirley, like John, is another character who is strangely inconsistent from scene to scene, but she eventually settles into the familiar movie staple of no-good trollop, a parasite who marries John for his steady paycheck and showers him with contempt when his health fails and the paychecks are no longer coming in. We're given no credible reason whatever why Shirley stays with him, and when she seeks work as a dancer at her former place of employment it seems like a smart survival tactic, but this is where the story's true thesis kicks in: John is now the parasite because he's living off his wife's earnings. The script becomes increasingly shrill and hysterical as it reaches these final scenes, and Robinson's performance follows suit. What's interesting is that John's speeches reflect the panic felt by a lot of men of his era over the painful fact that they were no longer the breadwinners in their households. As the Depression deepened and more and more men were jobless, a growing number of women, married or not, had to earn income through secretarial work, factory work, needlework, clerking in shops, or less savory pursuits. It's bluntly implied that Shirly isn't making all her money by dancing, and it's her success in earning \"low\" money that provokes John's rage. He states repeatedly that a man who lives off his wife's earnings is no better than a rat, and after he's killed her he complains that since he's become a \"man\" once more it's entirely unfair to punish him for it! Did the people who made Two Seconds believe this? I seriously doubt it, but does that mean we are to dismiss John as crazy and ignore his rants? It isn't entirely clear, and I wish the screenwriters had worked out their themes (and followed their intriguing premise) more carefully before the cameras rolled. Even so, this is an interesting, unusual movie which stands as a fascinating reflection of the period when it was made. Still, for a truly great performance by Edward G. Robinson I'll take Little Caesar or Double Indemnity any day.",
         "Edward G. Robinson again shows what a powerful actor he was in \"Two Seconds,\" a precode from 1932 directed by Mervyn LeRoy. The two seconds refers to the time it takes a man to die in the electric chair. Robinson plays John Allen, who is condemned to death and about to be executed. As he waits for the electric current, he relives how he wound up there. Allen and his best friend, Bud (Preston Foster) were welders on a huge building. That part of the story was probably inspired by the Empire State Building, which opened to the public in 1931. Bud wants his girlfriend to find a girl for John so they can double date, but John hates the women Bud's girlfriend finds for him. And the current on is no exception. He leaves the three of them and goes to a dime a dance joint. There, he meets a pretty young woman who dances there, Shirley, and they start to date. Bud thinks she's a gold digger and handing him a big line, and warns John that he's going to end up married and miserable. John pays no attention. One night, he gets blotto drunk and Shirley manages to get him to a Justice of the Peace and tie the knot. Bud confronts her, and we see more of Shirley's true colors as she undresses in front of Bud and plans to get the marriage consummated before John sobers up and wants an annulment. John was making good money, but Shirley spends it faster than he can make it. When tragedy strikes, John is a completely broken man and can no longer work and Shirley goes back to the dime a dance joint. More tragedy will follow. Very absorbing film, with an excellent performance by Robinson for those times - I say that because acting today has been toned down some, and he has a huge monologue that today seems a little over the top. In the beginning of the film, we see a closeup of a college student (William Janney) who attends the execution as part of research for a paper. The film ends with the same closeup. Very, very well done. Robinson was part of a small group of character actors who rose to leading man status - Spencer Tracy, James Cagney, Humphrey Bogart, and Wallace Beery. He was an actor of tremendous range and ability, and it shows here. Highly recommended, a great precode.",
         "\"Two Seconds\" is a relatively minor film by \"Warner Bros.\" The story is fairly basic and low key. The cast is quite small and the entire film was made on soundstages. It is the performance of Edward G. Robinson that makes \"Two Seconds\" so memorable. He gives a truly in-depth performance that is a mixture of humour, tension and then despair. The film's plot is mainly a flashback, with Robinson looking back on the circumstances that led to his being incarcerated in the first place. He is unfortunate enough to be in the hands of a callous and vindictive woman and he can only tolerate her for so long..... I particularly enjoyed the scene where Robinson talks to the camera, to give the impression that he is addressing a person. His monologue lasts for a few minutes as the camera slowly draws closer to Robinson and the set goes dark apart from one light that is focused upon him. It is a powerful scene and captivating. The film isn't a long one and the time races by.",
         "The premise of Two Seconds was put over far better in the novel by James M. Cain and the film made from that novel, The Postman Always Rings Twice. It's the idea of a man being convicted of the wrong murder and paying the wrong debt to society. But the acting of leads Edward G. Robinson and Preston Foster put the story over somewhat. The film is adapted from a play by Elliott Lester that ran for 59 performances on Broadway in 1932. Preston Foster in fact appeared in the original production as the best friend of the protagonist. On stage the role that Edward G. Robinson has was played by Edward Pawley who later did join Warner Brothers and played various varieties of hoodlum henchmen. Quite a bit of rewriting had to be done as the play is completely set in a prison death house where Pawley/Robinson is going to the electric chair. The title refers to the exact amount of time that the prisoner has when the warden throws the switch and he actually expires from the electricity. It's in this time that Robinson's character reflects on how he got there. From the claustrophobic setting of the death house, Warner Brothers got as far as possible when we see Edward G. Robinson and Preston Foster as a pair of riveters working on girders building those skyscrapers that tickle the heavens in New York. A pair making the princely sum of $62.50 a week and Foster doesn't think Robinson spends enough because you can't take it with you. But before long Robinson is in the hands of goldigging Vivienne Osborne who's finding all kinds of uses for his money and that drives the two men apart. Osborne gives a great performance as a two timing pre-Code type of gal who later would have her act considerably cleaned up by the censors. Robinson and Foster do all right, but Two Seconds will not be rated as in the top ten for either of these film stalwarts.",
         ". . . that it will take the then new and \"humane\" electric chair only two seconds to eliminate Ed Robinson's \"John\" character. However, 28 years before this fictional Jack bites the dust, \"E.A. Edison's\" Real Life eponymous \"Manufacturing Company\"--then the world's largest movie distributor--arranged, filmed, and released a highly lucrative title still available from America's Library of Congress website today: ELECTROCUTING AN ELEPHANT. This landmark documentary begins with the Beloved Real Life Coney Island Performer Topsy--who had perhaps exhausted the life-time peanut ration that her \"owners\" had set aside for her--chained down to the ground in a vacant lot surrounded by a wall on two sides. Topsy is engulfed by an apparently all-male paying crowd of spectators, who have been promised their money's worth as they \"enjoy\" the \"unprecedented\" spectacle. As the crowd cheers and Topsy shrieks, flames are seen shooting from Topsy's shackled leg for a minute or two. (Wikipedia states that the \"Miracle of Electricity\" NEVER succeeded in finishing off Topsy, and that she \"had to be\" poisoned, strangled, and finally shot (all off-camera, of course, since ELECTROCUTING AN ELEPHANT was intended as a great promotion for the \"Wonder of Electricity\"). TWO SECONDS begs several questions: Jack relives his life during the alleged couple of clock ticks it takes him to expire. IF this scene was made consistent with Real Life (wherein it frequently takes two jolts, or even THREE--in Ethel R.'s infamous instance--to do someone in), would Jack relive his entire life each and every time? If so, what would his chances be of meeting with a happier ending at least once? And if Androids dream of Electric Sheep, did Topsy have time to say, \"Thanks for all the nuts\"?",
         "I agree with most of the other reviewers that Edward G. Robinson gives a good performance as a young working stiff who is bamboozled by a woman out for money. Although Robinson's acting is very naturalistic and believable throughout most of the movie, he becomes very melodramatic and somewhat overwrought at the end. Still, it shows that Robinson had a much larger range of acting than he was ever allowed in later years when he was forced mostly to play gangsters. The problem with the movie is in its attitudes about women. On the one hand, it is very realistic in presenting the demeaning life that women experienced during the beginning of the Great Depression in trying to make a living. The dance hall scene is a sociological treasure trove of what it was like to be a single woman in Depression era America. But eventually it turns into a screed against women as gold diggers that have been a misogynist staple for Hollywood since the beginning. Having said that, it is still a fascinating drama from pre-code Hollywood. This was a time when movies were allowed to take on serious social topics and represent sexual relationships between men and women in a realistic light. When you see movies like this you realize how damaging the code was to artistic expression in American movies. If only it had been allowed to evolve on its own without censorship, who knows where is could produced.",
         "Interesting pre-Code programmer, though actor Robinson's eventual hysteria is more distracting than affecting. Told through flashback from Allen's (Robinson) execution chamber, we know how things turn out for him. But what's the story leading up to the electric chair. The smallish, homely Allen starts out as a repressed skyscraper worker whose out-going pal, Bud (Foster), wants to get the little guy into a social life. Soon, Allen meets blonde taxi-dancer Shirley (Osborne) at a seedy night spot. He's polite to her and the lonely girl soon hooks on to him and his good job. The pairing looks like it might work since each is lonely, even though she appears calculating at times. The story plays out on the hard times of the Great Depression, when jobs and money are in short supply, to say the least. The fact that Allen's got a good job places him somewhat on a pedestal, and except for lack of a social life he's pretty well insulated from what millions of others are experiencing. Thus his story stands as something a tragedy, brought about indirectly by that same Depression that now seems inescapable. The premise of a two-second flashback's an imaginative one. Another reviewer suggests the movie's too short for its threads, and I agree. The screenplay has some unexpected twists, so daring to think outside the box is not a problem, especially in that pre-Code year (1932). Happily, there's plenty bouncy music from that era along with dancing couples. Times may be tough, still folks need relief. For fans of Robinson, Allen is totally unlike any role I've seen him in. At first the character's poignantly reserved, but soon wobbles into a directionless paranoia and finally into florid hysterics. I suspect it's not a role the actor fondly remembered. Anyway, the 60+ minutes remains an interesting oddity of the time, mainly for its twisty and revealing development.",
         "\"Two Seconds\" suffers from a simplistic, misogynistic storyline, but the performances elevate the material beyond its deserts. Edward G. Robinson, as previously stated by my fellow commentators, is superb as a steelworker who yearns for higher things than skyscrapers (I just noticed that little symbol in the film--ho ho!). Vivienne Osborne is worthy as the devouring female; she mostly succeeds in making the audience believe her character's ridiculous actions, and adds some sorely needed humanity to the role. Preston Foster does a nice turn as Robinson's roguish friend, while Guy Kibbee makes the most of his small part as a bookie. 30's-film fans will enjoy the shots from atop Robinson's metal skyscraper skeleton, and a shocking, expressionistic death scene. Social historians will be intrigued by the scene in a dime-a-dance hall, where the girls try to attract partners from behind a metal turnstile. The screenwriter unwittingly makes some comments about the lack of job opportunities available for women at the time the film was made, but unfortunately he is more interested in insisting that certain types of women are purely and infectiously evil, \"born rotten\". Edward G. wisely counteracts this by emphasizing his own character's psychosis, in a theatrical-but-chilling final monologue. I would say more, but it would lead to spoilers, and I hope to avoid those, even though I can't really recommend this somewhat-foolish film to any but diehard Robinson fans.",
         "This melodrama has a lot going for it. The actors are all very good, delivering heartfelt performances that speak to the audience. The only problem is the central premise itself, i.e. that the reason the Robinson character killed his wife was because he was living off her. Now let's recap: first his buddy falls to his death off the high-rise they were working on and somehow he blames himself for it. He feels so bad he can't work so his wife goes to work as a taxi dancer to pay the bills. He can't stand being kept by a woman so he kills her. Doesn't that seem utterly ridiculous? Well, to me it does but then I imagine there's some Neanderthals out there who might live by those rules. My point is this: given how ludicrous this premise is was director LeRoy making a statement? Was he using the film to heap some well deserved scorn on men like that? Be that as it may, I found it the performances well worth the price of admission."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["First National Pictures"],
      "summaries": [
         "Allen claims he his being executed for the wrong murder. Flashbacks show him working with Clark as a riveter. When he makes a killing on the horses he meets Shirley and gets married. When Clark tells him Shirley is unfaithful they fight and Clark falls to his death. Later he finds that Clark was telling the truth.",
         "A condemned murderer, in the process of being executed, relives the events that led to his being sentenced to die in the electric chair."
      ],
      "budget": 310000
   },
   "movielensId": 125203,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-05-28",
      "dvdReleaseDate": null,
      "directors": ["Mervyn LeRoy"],
      "runtime": 67,
      "movieId": 125203,
      "title": "Two Seconds",
      "mpaa": "",
      "actors": [
         "Edward G. Robinson",
         "Vivienne Osborne",
         "Guy Kibbee",
         "Preston Foster",
         "J. Carrol Naish",
         "Frederick Burton",
         "Harry Beresford",
         "Dorothea Wolbert",
         "Berton Churchill",
         "William Janney",
         "Edward McWade",
         "Gladys Lloyd",
         "Adrienne Dore",
         "Luana Walters"
      ],
      "imdbMovieId": "0023629",
      "originalTitle": "Two Seconds",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["cAVJtVksGrQ"],
      "plotSummary": "A condemned murderer, in the process of being executed, relives the events that led to his being sentenced to die in the electric chair.",
      "tmdbMovieId": 26714,
      "avgRating": 3.5,
      "releaseYear": "1932",
      "numRatings": 4,
      "posterPath": "/sg0RuQWrjsWdBoTieqoDjKoddHd.jpg"
   }
}