{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "communist",
         "id": 2109
      }],
      "imdb_id": "tt0041495",
      "video": false,
      "title": "The Woman on Pier 13",
      "recommendations": [
         49503,
         38395,
         29477,
         49502,
         37742,
         35418,
         128048,
         72769,
         47167,
         72773,
         51153,
         73983,
         35913,
         25548,
         32941,
         51554,
         23022,
         30036,
         25564,
         62804
      ],
      "backdrop_path": "/DYzDvDwcDa9zVkjcHETPoaJWod.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5878ebad925141785c0084f9",
         "content": "You can't quit. They wont let you! \r\n\r\nThe Woman on Pier 13 (AKA: I Married a Communist) is directed by Robert Stevenson and collectively written by Charles Grayson, Robert Hardy Andrews, George W. George and George F. Slavin. It stars Robert Ryan, Laraine Day, John Agar, Thomas Gomez, Janis Carter, Richard Rober and William Talman. Music is by Leigh Harline and cinematography by Nicholas Musuraca. \r\n\r\nBrad Collins (Ryan) was a one time member of the communist party. Now married and thriving in business, his world is turned upside down when the CPUSA come to seek him out for influential favours. \r\n\r\nIt wasn't easy for director Stevenson, what with RKO mogul Howard Hughes interfering as he forced home his anti-communist slant, so much so the whole pic comes off as an almost there type of piece. Casting aside that it's all a bit daft these days, with its red hysteria leanings (though it serves as a most interesting social document of the era), there's a number of tight scenes and enough moody atmospherics to keep this out of basement hell. \r\n\r\nCharacterisations are rich in noir traditions, a protag whose past is back to bite him, a slinky femme fatale, a dutiful wife in the dark, and villains of substance. Be it Gomez's weasel Commie boss stomping around like a malevolent tyrant or Talman's fairground working hit-man for hire, the latter with a dress code as mirthful as it is strangely unnerving, the baddies offer up some sort of balance in a screenplay that's not sure where it ideally stands. The violence hits hard, with shocking deaths, and in good dark noir style the finale holds court for the right reasons. \r\n\r\nAdd in a cast who don't let anyone down and the great Musuraca showing his photographic skills (though not as much as we would like), then it's a more than decent viewing experience. But the proviso is that you do have to let the propaganda go above your head to get to those decent rewards. 6/10",
         "url": "https://www.themoviedb.org/review/5878ebad925141785c0084f9"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Nan Lowry Collins",
               "gender": 1,
               "credit_id": "52fe4571c3a368484e05b2b7",
               "name": "Laraine Day",
               "profile_path": "/s9UHeBQF7VjzvDrvIgzNlBs7oCn.jpg",
               "id": 41245,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Bradley Collins / Frank Johnson",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2bb",
               "name": "Robert Ryan",
               "profile_path": "/xBAWG79UGCkchPPTbONycJiKW2g.jpg",
               "id": 8253,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Don Lowry",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2cf",
               "name": "John Agar",
               "profile_path": "/9fKJvICRu2KS6Q70R7plPUkCkTY.jpg",
               "id": 103071,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vanning",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2bf",
               "name": "Thomas Gomez",
               "profile_path": "/7CNFFi9FG1Jc6ngmnZY3MGcK4zx.jpg",
               "id": 18646,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Christine Norman",
               "gender": 1,
               "credit_id": "52fe4571c3a368484e05b2c3",
               "name": "Janis Carter",
               "profile_path": "/dNSCg7pX3YcQNVRBxfd6A4vog5M.jpg",
               "id": 96300,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jim Travers",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2c7",
               "name": "Richard Rober",
               "profile_path": "/sr0ub4oSa4EQYrcH7psPCiDzhpd.jpg",
               "id": 89982,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Bailey, younger henchman",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2cb",
               "name": "William Talman",
               "profile_path": "/v3EG7QdDBYDcBTPJtWzFrlCZEx.jpg",
               "id": 89581,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "J.T. Arnold",
               "gender": 0,
               "credit_id": "52fe4571c3a368484e05b309",
               "name": "Paul E. Burns",
               "profile_path": "/7FVvu4kIg6vnU5i9LzAOLRAudBy.jpg",
               "id": 96302,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Ralston",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b30d",
               "name": "Paul Guilfoyle",
               "profile_path": "/nLcp5VekPRvLoDmDegpRYLOxPSS.jpg",
               "id": 104714,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Charlie Dover",
               "gender": 0,
               "credit_id": "52fe4571c3a368484e05b311",
               "name": "G. Pat Collins",
               "profile_path": "/imT0COfQBYrJOWp53rHbREJNLrz.jpg",
               "id": 98972,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Grip Wilson",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b315",
               "name": "Fred Graham",
               "profile_path": "/dTkrp1Y0ijc5hvc4J3vmRRUD0ti.jpg",
               "id": 111827,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "J. Francis Cornwall",
               "gender": 0,
               "credit_id": "52fe4571c3a368484e05b319",
               "name": "Harry Cheshire",
               "profile_path": "/2tPdKl8FXBPsU2xDAYU0CLMqFyT.jpg",
               "id": 118319,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Garth",
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b31d",
               "name": "Jack Stoney",
               "profile_path": "/8H5NqC3uZWnUbtaLaXgEwSfrP8E.jpg",
               "id": 1120620,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "5690bffb925141456d001ae1",
               "name": "Iris Adrian",
               "profile_path": "/lLZZYHBg14NJ9aUt7BqeCQri36q.jpg",
               "id": 34509,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2b3",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2d5",
               "name": "Charles Grayson",
               "profile_path": null,
               "id": 344185,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4571c3a368484e05b2db",
               "name": "Robert Hardy Andrews",
               "profile_path": null,
               "id": 121090,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2e1",
               "name": "George W. George",
               "profile_path": null,
               "id": 44623,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "52fe4571c3a368484e05b2e7",
               "name": "George F. Slavin",
               "profile_path": null,
               "id": 16107,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2ed",
               "name": "Jack J. Gross",
               "profile_path": null,
               "id": 13955,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2f3",
               "name": "Sid Rogell",
               "profile_path": null,
               "id": 98968,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2f9",
               "name": "Leigh Harline",
               "profile_path": "/cE6Wt8ZoGfDfXjVcUgsi4TRb8ls.jpg",
               "id": 5467,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b2ff",
               "name": "Nicholas Musuraca",
               "profile_path": null,
               "id": 10150,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4571c3a368484e05b305",
               "name": "Roland Gross",
               "profile_path": null,
               "id": 22087,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.675059,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27978,
      "vote_count": 7,
      "budget": 0,
      "overview": "Communists blackmail a shipping executive into spying for them.",
      "similar": [
         294016,
         33114,
         40987,
         341571,
         110575,
         265666,
         2083,
         318622,
         465520,
         266150,
         480670,
         582,
         19259,
         3291,
         746,
         2009,
         982,
         3870,
         1653,
         512291
      ],
      "original_title": "The Woman on Pier 13",
      "runtime": 73,
      "poster_path": "/yQCTEk0kzoS9dyhnKbmv33XlVCc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1949-10-08",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Her beauty served a mob of terror whose one mission is to destroy!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 73,
      "synopsis": null,
      "writers": [
         "Charles Grayson",
         "Robert Hardy Andrews"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0041495/",
      "coverLink": null,
      "actors": ["Stars: Robert Ryan, Laraine Day, John Agar | See full cast and crew »"],
      "reviews": [
         "A film for Robert Ryan fans, for this shows how handsome he was. Fit and virile, and before smoking began to take its toll. He was 40 yrs old by the time he made this film. He got the chance to be something of a hero for a change. He does some pretty good acting, for him, and romantics everywhere will love the way he desperately tries to save his wife in dramatic scenes. This movie pushes home the paranoia of anti-communist views as it was in the 50's. People scoff at the fear of communism in todays climate, but things were different then. People have forgotten how men died because of communist spies. British soldiers and some Americans and Polish too, died at the hands of communist spies such as Guy Burgess, Kim Philby and Anthony Blunt. They mainly operated from Whitehall, London, and spilled secrets to Russian Communists in the 40's during the war. They leaked details of planned operations that got back to the Russians. When they started being discovered by the British and American Intelligence they fled to live in Russia and they died in the 70's. However, this film expresses a fear and nothing more than that of dark forces at work among men. Essentially a \"B\" movie but certainly adequate and worth a look for Robert Ryan alone, and probably as a history lesson for movie makers.",
         "By today's standards it seems quite dated, but back in 1950, the possibility of this happening seemed very real. The performances of the stars (Robert Ryan and Laraine Day) are solid and the supporting cast is great (especially Janis Carter and William Talman, who is wearing the craziest suit jacket I've every seen!!). The style is very film noir...close ups of faces showing over the top expression, jerky body movements, and odd, minimalist lighting techniques. Remember too, that it's 1950 and acting styles today seem far less \"dramatic\". The subject matter seems paranoid, but for those of us old enough to remember the Cold War, the fear of what the \"commies\" were up to was VERY, VERY real. I remember \"duck and cover\" and \"...we will bury you!\". Some of us might still associate communism with the labor unions (which is the salient point of the plot). As silly as this movie will seem to younger people, try to remember from a historical perspective that it was only five years from the end of World War II, and herein were the first clashes of the two \"great ideologies\". At the time it was either freedom or subjugation (democracy or communism). Subtle, this movie is not... There are better examples of film noir, but this a very good example. It's not the worst way to blow 70 plus minutes of your day and just for the historical (not hysterical) panorama, it is worth a look. It has just recently been showing on Turner Classic Movies as \"Woman on Pier 13\"...that title is much better. Under either title, give it a chance and enjoy an example of a time and film style gone by.",
         "One understands why Nicholas Ray turned this picture down. Yet, the final product could have been worse: the Communist Party could have been portrayed as something less attractive than a waterfront mob. Remember that audiences are and were used to identifying with glamorous gangland and this mob is not lacking in muscle, molls, and even a certain coolness (they have social parties and are intellectual). And the finale scene nearly matches some of best film noirs. To boot, the great Robert Ryan, whose character can no more divorce himself from the Party as from the Mob, somehow lends, by his association alone, even more draw to these American Reds. Apart from all this, the movie's worth a look if only for Ryan and Lorraine Day (some faces).",
         "Robert Ryan and Laraine Day star in \"The Woman on Pier 13,\" along with Thomas Gomez, John Agar, Janis Carter, and William Talman. Ryan plays Brad Collins, who falls for lovely Nan practically the moment he meets her. They marry quickly, without knowing much about one another. One of the things Nan doesn't know is that Brad used to be Frank Johnson, a member of the Communist party. His ex-girlfriend (Carter) is still one, and she is working to recruit Nan's brother (Agar). Meanwhile, Brad is blackmailed into stalling union negotiations on the waterfront. This is an okay film, with Robert Ryan looking great and doing his usual fine acting job. It's interesting that while he looked taller than the other actors, he really didn't tower over them. He was 6'4\" and actually had special furniture in his home to accommodate it. Here he is robust and not playing a meanie as he usually did. MGM never knew what to do with Day, so she was lent out constantly. I think she was underrated. This film really draws you in. The acting is very good, and the cinematography is great. Communism, of course, was a hot subject back in the late '40s and '50s. On paper, it sounds like it might work, which is what drew so many young people to it during the Depression years. During the blacklisting years, the fear of Communism got out of control, and people who had attended one meeting in 1935 found themselves blacklisted. Lee Grant went to the funeral of someone who was thought to be a Communist, and she didn't work for 19 years. Consequently there are many anti-Communist films. This is one, with a solid cast and some good production values.",
         "RKO studio was making some terrific noir films during the late 40's and used that same formula in this 1950 thriller. The problem with the film arises because of the Red scare propagated by Senator Joseph McCarthy who saw \"commies\" behind every tree. The Red scare theme dates the story to the point that it is almost embarrassing........but it is still worth seeing. Robert Ryan, who was such a powerful actor, stars as a successful man who once was a Communist, lured by his then-mistress, played by Janis Carter. He has now moved on with his life, married to Laraine Day and has learned to love the \"American way\". Trouble rears its ugly head as labor union troubles bring his old cronies out of the woodwork and the fun begins. This film played on the fears of 1950's audiences and it is hard to relate to those feelings now; however, the craftsmanship of the film is quite good and the players are up to their usual standards. Of course, the exception is John Agar,who as always is bad, bad, bad. So for a look at another time when people built bomb shelters and suspected their neighbors of being \"fellow travelers\", take a gander at this film. It's a time capsule unto itself.",
         "Considering what was happening on the world stage at the time this movie was made (i.e., The Berlin Airlift), it was becoming unfortunately clear that the Soviet Union was not an ally anymore and RKO probably thought this a timely subject. The cast is first rate and I found the narrative interesting. A couple of corrections from other postings: Lorraine Day was not lent out by MGM. Her contract ended in 1945 and she signed with RKO (on a non-exclusive basis)which was fortunate as it allowed her to illustrate her abilities as an actress in a much wider range of movie: \"The Locket,\" \"Tycoon,\" \"My Dear Secretary,\" and this movie. The second correction is that this was not a \"B\" movie. It seems that a few reviewers confuse what they consider \"B\" content with how a movie is advertised/presented in its theater engagements; this was not a second feature. I also believe that RKO was every bit as proficient, stylish and accomplished in the movies they chose to make as was MGM. As for Robert Ryan, what can one say about this great actor that has not been said before.",
         "Just when we thought such nonsense was all over, no less than ten Russian 'sleeper' spies in America have been exposed and exchanged in a spy swap with the Ruskies. One of them was even a glamour gal, just to keep the Hollywood touch to the story. So dusty old films like this one are now surprisingly and perhaps acutely relevant again. This is a powerful and highly tense drama with the towering Robert Ryan playing a man who was, and still is (because you can never quit) a card-carrying Communist Party member in the USA who has tried to go straight. But Thomas Gomez, the ruthless and terrifying leader of the Russian spy ring in San Francisco isn't having it. He is going to make Ryan follow orders or else. Into this mix comes one of Hollywood's most sizzling femme fatale actresses of the 1940s, Janis Carter. She was truly something-plus. And in this film she brings all the temptation and the allure, as Ryan's wife played by Laraine Day is rather a tepid good gal who does not raise anybody's temperature or heart rate. Janis and Ryan has been an item earlier on in the good old days when they were both Commies together, but while Ryan has lost his interest in spying for the Party, she remains a dedicated Party agent. It all gets very very intense. The film has some superb snappy dialogue and is extremely well directed by the highly talented Robert Stevenson (1905-1986, of English birth), famous for TOM BROWN'S SCHOOLDAYS (1940), JANE EYRE (1943) with Orson Welles, DISHONORED LADY (1947, see my review) and MY FORBIDDEN PAST (1951, also featuring Janis Carter), not to mention one of my favourite films, OWD BOB (1938, see my rave review) the fascinating early aviation epic NON-STOP NEW YORK (1937, see my review), and KING SOLOMON'S MINES (1937). Willian Talman does a scary job of playing a smoothie amoral hit-man who will bump anybody off for the spy ring for a thousand bucks and dresses nattily on the proceeds. The film is full of intrigue, blackmail, double-cross, threats, murder, and the relentless pressure of the Party which will not allow anyone out of its clutches and will do anything to get what it wants. Can Ryan escape the trap in which he is caught? Will his respectable and rich wife find out? Will his old chums in the trade unions realize that he made the dock strike go ahead because he was blackmailed into it? Can anyone escape unscathed from this web of conspiracy and betrayal? This film fit right into the McCarthy Era and, alas, it seems that it is not as dead an issue as we had all assumed.",
         "This film was made at the height of the Communist scare (1949) so its theme is thickly padded with plenty of political hysteria which may be a bit foreign to modern-day viewers. That said, it's still highly effective in its depiction of the \"Commies\" being thoroughly evil and it pulls no punches. John Agar plays a union leader who unknowingly is under the influence of a good-looking blonde (Janis Carter) who just happens to be a communist \"plant.\" Robert Ryan, however, is the star of the film as a man torn between both worlds who inevitably does the \"right thing.\" Along the way, there's plenty of despicable communists to jeer at including Thomas Gomez as a ruthless ringleader and union infiltrator. For fans of early network TV, William Talman (District Attorney Burger from the old \"Perry Mason\" series) plays a commie henchman who gets what's coming to him. He's so rotten that you'll want to throttle him yourself. On the good side, Laraine Day plays Ryan's loving and understanding wife who's trapped in the convoluted plot. Whatever one's political leanings, there's more than enough propaganda here to nearly sink this movie, but the performances of the talented cast keep it afloat. Ryan made a career out of playing hard-boiled types and he earned his money for this one. Agar never became the big star many predicted but he's effective in this role and quite sympathetic, even if his character is a bit too naive. Today, he's best remembered for being Shirley Temple's first husband. On the definite \"plus side\" for \"The Woman on Pier 13\" is Laraine Day. She looks better than ever and that should be enough to sustain anyone's interest in this film.",
         "**SPOILERS** An attempted takeover of the San Francisco docks by the local commies has former Communisty Party card carrying member Brad Collins, Robert Ryan, in the cross-hairs of both his former commie comrades and the police. Collins who was formerly known as Frank Johnson is being blackmailed in him being exposed not only as a former commie but a murderer in the killing of a union shop steward back on the east coast some time ago. After disowning the Communist Party Brad has made it big on the SF docks working his way up from a longshoreman to the vice president of a major west coast shipping company. loved and respected by both labor and management Brad is picked to negotiate a new contract for the dock workers only to have his sordid and sleazy past catch up with him. Contacted by his former commie boss Vanning, Thomas Gomez, Brad is blackmailed to stall negotiations and thus instigate a dock strike that is to last at least two months. That sleazy commie rat Vanning, and his fellow hoodlums, are planning to take over the union and are using Brad as their battering ram, or Trojan Horse, to do it. Brad at first has no choice but to go along with Vannings plans but when his former girlfriend fanatical Communist, under orders of Vanning, Christine Norman (Janis Carter) gets romantically involved with Brad's weak-minded brother-in-law Dan Lowery, John Agar, is when he finally comes to his senses. Turning Dan into a Crypto-Communist and labor provocateur Christine has the young man, who Brad gave a job as a longshoreman, spew the Communist \"Power to the Workers\" line to his fellow union members without knowing that he's actually doing it. Dan thinks that he's fighting for his fellow workers rights but in fact is leading them, like lemmings, down the path of financial disaster in having them lose both their jobs and benefits when his behind the scenes controllers, Vanning & Co, take over the union. As Brad's wife of one month Nan, Laraine Day, starts to get suspicious of just what he's doing in wrecking the labor negotiations it also becomes clear that her younger brother Dan, after he told her, is madly in love with Christine. Somehow Christine's snide and obnoxious, throwing out hints about her love affair with Brad, actions in both Nan and Brads presence has convinced Nan that she's up to no good and want's Dan to have nothing at all to do with her. It's later when Nan finds out that her husband is being blackmailed by Christian and her boss Vanning that she finally realizes that Dan's life as well as future as a married man is in danger, deadly danger. The film has Brad knowing that his life is ruined, with a murder rap hanging over his head, makes a clean brake with his past as a commie labor leader. Having nothing to lose and everything to gain Brad goes after Vanning and his boys after they kidnapped Nan and murdered his by then enlightened, to what Christine and Vanning were using him for, brother-in-law Dan. Christine herself had by then also realized the wrongs of her ways, in being a die-in-the-wool commie, and not wanting her victim Dan Lowry, whom she fell in love with, pay for them. Christine is soon put on ice, in the city morgue, by a angry and vindictive Vanning who has her thrown out of her high-rise apartment window and then made her murder to look like a suicide. It's now up to Brad to make everything right to correct the many wrongs that he did in creating the mess that he now finds himself in which sets everything up for the final showdown at the local Cummnist headquarters an empty warehouse on the San Francisco docks. Despite the usual anti-Communist hysterics that you would expect to find in a movie like \"Woman on Pier 13\" or \"I Married a Communist\" the film didn't put former card carrying Communist Brad Collin/ Frank Johnson in a bad light at all. We were shown that Brad was suckered into joining the Communist Party, like thousands of other young men and women like himself during the Great Depression, with the promise of both a job and security for him and his family. It was also brought out in the movie that Brad was not forced to rat out his fellow Communist members who like himself were nothing but mindless stooges, like Dan Lowry, who had no idea what the Communist Party was planning for the USA and when they realized it dropped their membership cards and left the party. At least the film realized that people can make mistakes , by unknowingly joining subversive organizations, and at the same time not be forced to suffer for them, even after renouncing what they did, for the rest of their lives. This is something that most if not all anti-Communist movies coming out of Hollywood in the 1940's and 1950's sadly overlooked.",
         "Typical anti-red propaganda, made at the height of Hollywood's scary blacklisting chapter in its history. It's all because a promising businessman (Robert Ryan), once a registered communist under a different name, has been located by an old girlfriend (Janis Carter) and exposed to the big man (Thomas Gomez), even though he wants no part of them. Carter is now involved with the brother (John Agar) of Ryan's fiancée (Laraine Day) and is trying to convert him, even though he's a staunch democrat even if he is a bit liberal. This is actually pretty enjoyable even if the motivations in making it are extremely obvious. The commies are actually identifiable as human beings, not cartoonish like other anti-Communist films (in particular \"The Red Menace\" and \"Big Jim McLain\") where the message comes at you like a 3-D movie monster. There's some really horrific violence, pretty taut for a film made during the studio era, a sign that the production code was slowly loosing steam."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "Brad Collins, former stevedore, is rising fast in a shipping company when local communist agitators use his former Party affiliation to extort his help in stirring up trouble. When Brad resists, communist femme fatale Christine works through his brother-in-law Don. But Brad's new wife Nan sees that her husband and brother are under pressure; when she investigates on her own, party boss Vanning takes ruthless action.",
         "Successful, newly married Brad Collins once belonged to the Communist Party of the USA, and now the Party will stop at nothing to use him."
      ],
      "budget": 0
   },
   "movielensId": 125223,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-10-08",
      "dvdReleaseDate": null,
      "directors": ["Robert Stevenson"],
      "runtime": 73,
      "movieId": 125223,
      "title": "The Woman on Pier 13",
      "mpaa": "NR",
      "actors": [
         "Laraine Day",
         "Robert Ryan",
         "John Agar",
         "Thomas Gomez",
         "Janis Carter",
         "Richard Rober",
         "William Talman",
         "Paul E. Burns",
         "Paul Guilfoyle",
         "G. Pat Collins",
         "Fred Graham",
         "Harry Cheshire",
         "Jack Stoney",
         "Iris Adrian"
      ],
      "imdbMovieId": "0041495",
      "originalTitle": "The Woman on Pier 13",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["jCVBt-cDL4I"],
      "plotSummary": "Communists blackmail a shipping executive into spying for them.",
      "tmdbMovieId": 27978,
      "avgRating": 1.5,
      "releaseYear": "1949",
      "numRatings": 2,
      "posterPath": "/yQCTEk0kzoS9dyhnKbmv33XlVCc.jpg"
   }
}