{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "new mexico",
         "id": 1508
      }],
      "imdb_id": "tt0046239",
      "video": false,
      "title": "Ride, Vaquero!",
      "recommendations": [],
      "backdrop_path": "/w03dHu4suG5sBVm1lowiCBrJSpj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Rio",
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194b7",
               "name": "Robert Taylor",
               "profile_path": "/wrtbJwt7K9i3mzfH2TVAea9WGEY.jpg",
               "id": 82216,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Cordelia Cameron",
               "gender": 1,
               "credit_id": "52fe46e9c3a36847f81194bb",
               "name": "Ava Gardner",
               "profile_path": "/qrMGSjgI4tpJ3c7ZEjsIMMFDGuR.jpg",
               "id": 25787,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "King Cameron",
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194bf",
               "name": "Howard Keel",
               "profile_path": "/vzLs3LCtv3QkWVg0pYuXLIZp6zs.jpg",
               "id": 39601,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "José Constantino Esqueda",
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194c3",
               "name": "Anthony Quinn",
               "profile_path": "/9sKpm4KCoUbmMbR86fpqcgBCHrJ.jpg",
               "id": 5401,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Father Antonio",
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194c7",
               "name": "Kurt Kasznar",
               "profile_path": "/yyZ5ohS8Yk0peBlU8GKDHsheby8.jpg",
               "id": 40620,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sheriff Parker",
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194cb",
               "name": "Ted de Corsia",
               "profile_path": "/63mhu9Qa62Viwy9tAdOFL9Spsf.jpg",
               "id": 2097,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Singer",
               "gender": 1,
               "credit_id": "52fe46e9c3a36847f81194cf",
               "name": "Charlita",
               "profile_path": "/ttaapBaxUQsb5ZMmwi0vJCisNgg.jpg",
               "id": 120339,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Barton",
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194d3",
               "name": "Jack Elam",
               "profile_path": "/nsPOk2xOj33fpsBj60mcxGcjyBW.jpg",
               "id": 4965,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e9c3a36847f81194ad",
               "name": "John Farrow",
               "profile_path": "/amtDvJFbgk2ea4Mdtc7ZxXibZMf.jpg",
               "id": 50300,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46e9c3a36847f81194b3",
               "name": "Frank Fenton",
               "profile_path": "/9buhIacgh5xkBCvWCK5lLhIgZ6.jpg",
               "id": 20097,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.50058,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 46193,
      "vote_count": 1,
      "budget": 0,
      "overview": "Ranchers in New Mexico have to face Indians and bandits.",
      "similar": [
         384680,
         12146,
         995,
         158916,
         10195,
         686,
         9945,
         28304,
         9792,
         226448,
         13090,
         42685,
         9793,
         179439,
         10514,
         25364,
         212257,
         11071,
         355270,
         27331
      ],
      "original_title": "Ride, Vaquero!",
      "runtime": 90,
      "poster_path": "/zrRQNsOapDCEsw0ZXbJwdSrMCcc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1953-07-17",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "The Outlaw And The Beauty!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Farrow"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Frank Fenton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0046239/",
      "coverLink": null,
      "actors": [
         "Robert Taylor",
         "Ava Gardner",
         "Howard Keel"
      ],
      "reviews": [
         "RIDE VAQUERO is something of an undeservedly underrated and, for the most part, forgotten western! A pity really because it has quite a lot going for it and not least a blistering performance from the great Anthony Quinn. Produced by Stephen Ames for MGM in 1953 it was nicely written by Frank Fenton and had workmanlike direction by John Farrow. Barely missing the Cinemascope process by just a matter of weeks (MGM's first production in the new format \"Knights Of The Round Table\" would premiere less than six months after Vaquero) it was nevertheless beautifully photographed in the new Ansco Colour by the great Robert Surtees. The movie also has a sterling cast! From the upper echelons of MGM's casting department it boasted the presence of Robert Taylor, Ava Gardner, Anthony Quinn and trying out a dramatic role for size singing star Howard Keel. The Civil War has ended and rough-hewn Mexican bandit leader Jose Esqueda (Quinn) is out to prevent Americans resettling into ranch life. His right hand man is his adopted brother - the quiet and sullen Rio (Taylor) who dislikes Esqueda's violent methods of doing business. When Rio - at the behest of his brother - attempts to burn out the ranch of newcomer King Cameron (Keel) and his lovely wife Delia (Gardner) he is captured by Cameron (a good chase sequence) and given the choice of either going to jail or working for him. Out of his attraction for Delia he chooses the latter to the chagrin of Esqueda which leads to great enmity between the brothers and which in the end must come to a fatal confrontation. Although the Rio character is a subdued and sullen individual Taylor in the role does give a good and admirable performance as the gunman and Keel isn't bad either in one of his rare straight roles. But it is Quinn's picture without any doubt! The man was such a superb performer! With that infectious laugh he is a delight to watch and should have received an Oscar for his portrayal here of the rough, fiery and at times highly amusing outlaw (and watch out for Quinn the artist in a scene in the bandit's hideout whittling at the wooden bust of a horse's head with a knife - the actor's own creation no doubt!) This handsomely mounted movie is also buoyed by an excellent score by Polish composer Bronislau Kaper. The main title theme is a wonderful rhythmic Mexican piece with a stuttering Mariachi trumpet and Flamenco guitar. The composer also adopted some Mexican folk tunes such as \"La Abandonada\" which he fashioned into a gorgeous orchestral love theme. The sprightly recurring cue for Esqueda is reiterated, this time by augmented orchestra, into a rousing march for the picture's brilliant set piece as the bandit leader marshals his forces for the invasion of a border town (a stunning long shot of groups of riders converging from all corners to join with him) and Kaper's music driving them on. RIDE VAQUERO is one of the composer's best efforts! Bronislau Kaper(his first name often misspelled on some movie credits with a W instead of a U) was an interesting composer and was one of the great writers of film scores of The Golden Age but without gaining the celebrity enjoyed by Newman, Steiner, Tiomkin or even Miklos Rozsa his more famous and accomplished composing colleague at MGM. He came from Warsaw and joined MGM as a song writer in 1936. One of the songs he wrote was the title tune for the Clark Gable/Jeanette McDonald classic \"San Francisco\" (1936) which even today remains a favourite anthem. He scored over a hundred films, 99 per cent of them for MGM which earned him the nickname \"The Metronome\". In 1952 he won an Acadamy Award for the MGM Lesile Caron musical \"Lili\" featuring his great song hit \"Hi Lili, Hi Lo\". Ten years later when Miklos Rozsa turned down the job of scoring the Marlon Brando version of \"Mutiny On The Bounty\" (1962) it fell to Kaper. The Bounty would elicit from him his greatest score! Bronislau Kaper died in 1983 at the age of 81. RIDE VAQUERO is a better film than its reputation reveals. It warrants a reassessment! There is more to it that should be investigated! It is certainly worth it for Quinn's amazing performance, Surtee's magical Cinematography and Kaper's winning score! Classic line from RIDE VAQUERO: Howard Keel to Robert Taylor \"Not a very nice place to bring a civilized woman to!... Is it?\" To which the stoic Taylor dryly responds... \"I couldn't tell you I never met one\"!",
         "Some things make this film worth watching: (1)Taylor,as a grim,sarcastic,icy,enigmatic,nifty,insolent gunman;for fans of Taylor and/or Quinn,\"Ride ...\" offers plenty of copious enjoyment,the two have serious,large roles; (2)Quinn,doing a picturesque role,as the gusty Esqueda;he rides the high horse;Gian Maria Volontè will succeed in doing this kind of roles; (3)the unconventional story;there are no duels in the street,and no overlong fights;there is no sentimentality;the real subject is the love between the two men,\"Rio\" and Esqueda;a convenient explanation is given for the Philistine viewers and the censorship--the two men's love is a brotherly one,they were raised by the same woman; The main interests of this movie are its outstanding cast (Taylor,Quinn) and the original story,that turns out to be almost shocking and subversive.Don't look for duels,horse-rides,the usual ingredients. Mrs. Gardner is surprisingly stiff as a respectable lady. A Hispanic bandit,Esqueda,terrorizes a region and prevents a farmer (Cameron) to settle.When \"Cameron\" brings at their new home his newly-arrived wife (Mrs. Gardner),they find the house burnt down.The Marshall can do nothing to help him.He must confront Esqueda on his own.\"Cameron\" rebuilds his home.\"Rio\",Esqueda's lieutenant,leads an attack on \"Cameron\"'s farm.The latter resists,with only two persons on his side (his wife,and a Friar,played rather well by Kurt Kasznar),and defeats his attackers.\"Cameron\" makes \"Rio\" prisoner,and then hires him.Quinn will make everything to win Taylor back.Taylor and Quinn give psychological interest to this plot. I happen to be eager of every Taylor and/or Quinn role;\"Ride,Vaquero\" was a thrilling feast for me.I find Quinn's burlesque acting delicious.The bandits' riot,when they take over Brownsville,has some comic moments. Taylor is a knockout as \"Rio\".",
         "By keeping quiet, speaking only when necessary Robert Taylor as Rio gives one of his best performances. All through the film you try to guess what he is thinking. He was adopted by the mother of Esqueda (Anthony Quinn) and Quinn loves and respects him. The real surprise is Howard Keel, who only used to do musicals, coming out so well as King Cameron, a man who is obstinate about building a cattle empire. Cameron is married to Cordelia (Ava Gardner) and as soon as she arrives in a river boat, and they go to their ranch, trouble starts because it has been burnt by Esqueda. Why did Esqueda do it? Because he knows that if he allows anybody to do well in business in that area, others will come and eventually he, who is a bandit will have to run away or be hanged. Quinn is great as Esqueda, just that makes the film worth seeing. Taylor, who was the second man to Quinn in the gang, eventually leaves him to help Keel, because deep down he knows his brother is becoming a crazy monster and unconsciously he is in love with Ava. But when she kisses him, he slaps her because he knows it is wrong. He is a torn man, with all those feelings and not knowing exactly what to do about it. Excellent film, not to be missed.",
         "Ride, Vaquero! is directed by John Farrow and written by Frank Fenton. It stars Robert Taylor, Ava Gardner, Howard Keel, Anthony Quinn, Kurt Kasznar and Ted de Corsa. Music is by Bronislau Kaper and cinematography by Robert Surtees. Out of MGM and filmed in Ansco Color at Kanab in Utah (though story is set in Texas), Ride, Vaquero! is collectively unusual, bold and frustrating. Plot revolves around outlaws lead by bandido Esqueda (Quinn) refusing to let settlers and civilisation come to the Brownsville territory. So far so formulaic, then, but Esqueda's right hand man is Rio (Taylor), who was raised by Esqueda's mother and therefore they be adopted brothers. When King Cameron (Keel) and his wife Cordelia (Gardner) refuse to be shunted out of Brownsville, with King trying to rally the townsfolk against Esqueda, Rio starts to feel sympathy for the Cameron's. What unfolds is a sort of Freudian Greek Tragedy, a love quadrilateral as Esqueda and Rio love each other in that manly brotherly way, Cordelia begins to love Rio, love which he is keen to reciprocate, while King will always love Cordelia no mater what. Action is competently put together by Farrow as it all builds to a big finale, which doesn't disappoint on narrative terms, and the airy location photography (this is one of the better Ansco Color productions I have seen) is delightful. While naturally there will be sacrifices and psychologically tinged twists along the way to keep the faithful interested. Quinn is wonderfully ebullient, enjoying himself with a licence to chow down on the script with relish. Taylor is subdued, sleep walking through the film under direction to be a man of quiet menace and emotional confliction. Keel looks like he is desperate to sing a song, or just be some place else, while Gardner is required to just look pretty and pretty wistful from time to time. Kasznar as Father Antonio comes out in credit, but when the screenplay has him refusing stolen money to help the church - only to then have him 15 minutes later shooting away with rifle to kill his fellow man - the inconsistency in the production is further compounded. Keel hated the boredom of the shoot, stuck out in the wilderness with nothing to do for months he said, and Gardner hated Farrow, citing him as a sleazy bully to women and horses! These complaints do show, the film feels like it's treading water, where if you take out Quinn you are left with what comes across as a bunch of actors working for food. Characterisations are not well drawn enough to make the promise of the mind matters work, and supporting players like Jack Elam wander in and out of the picture without due care and attention. There's good intentions in the screenplay, where for 1953 this could have been ahead of its time and setting the bar for Freudian flavoured Westerns. While it's on it engages for sure, but once finished there's the distinct feeling that it was never all that it could have been. A shame really. 6/10",
         "Before I saw this movie, I had not heard of the director John Farrow. After some research I found that he was the father of Mia Farrow. I also found that he had good writing skills. This is apparent after you view this film closely. The lead characters are Rio (Robert Taylor) and Esqueda (Anthony Quinn) who turn out to be each others alter ego--one man slaps a woman who kisses him and the other kisses a woman before she slaps him. It's an unusual western because there is no hero--only a handsome troubled anti-hero. It is an unusual western in that Mexicans are not always painted as bad or stupid--it presents them as human beings. Even the 'bad' Esqueda has reverence for God's blessings. This probably is a result of Farrow's Catholicism as it is in the case when the priest gives the final blessings to the dead anti-hero (whose body is not shown, for some strange reason). An unusual way to end a film. Evidently Farrow espoused family values--the couple's marriage is strengthened and Rio says his adopted mother would not have approved of her son Esqueda's actions. The family bonds between Rio and Esqueda are the cornerstones of the script, with doses of Catholicism and social comments thrown in. Something tells me the film we see today is not what the director intended to show--perhaps the studios had their say. The loose editing makes one wonder what was going on. As far as performances, I think this is one of Quinn's finest unsung performances. Taylor is handsome and plays the dark anti-hero well--predictably dressed in dark colors. Ava Gardner's role is supposed to be heroic--dressed in white--but is it so simplistic to dismiss it as such. Is it a coincidence that she behaves differently when she wears pink? It is a strange and a fascinating trio--Taylor, Quinn and Gardner. Farrow had, in my view, a great chance to make a memorable film but somehow fumbled.",
         "DISCLAIMER: My comments below are all directed at the script, and not at the great actors who give worthwhile performances in this movie. It is hard to figure the motivations of the leading characters. Taylor portrays a dark character who just gets darker and darker, but we don't get any real essence of Rio's motivations. Taylor is great as tight-lipped, sparse-worded Rio, but you constantly want to understand \"whats up with this guy?\". Keel is fine as a one-dimensional empire builder, but it is so ridiculous when he hires Rio and entrusts his life (and his wife's!) immediately after Rio tries to kill him. I have seen this movie on TV twice, and both times this scene makes me say out loud \"uh-uh, no way\". If I ever see it in a theater, I will be the guy in the audience talking back to the screen. What's really too bad is that the acting is good in this scene, the set is good, the color photography is good, etc. Gardner is fine as a genteel lady, but it is not believable when she suddenly demands to go see Quinn at his hideout. Maybe OK if she had been teary-eyed and desperate, bravely going forth to save her husband, but no: as presented, her decision seems bland and unbelievable. Not Gardner's fault, just the script and/or director. Quinn does a good job but his character seems to have no motivation at all, other than some sort of nostalgia for his childhood with his momma and Rio. Well-made movie, some suspense, will probably hold your interest. However, the good production values, acting etc cannot overcome the basic oddity of these characters as presented. Some of their actions are truly unexplainable.",
         "Although it is supposed to take place in Texas, the film was actually made in Kanab, Utah, which accounts for the fact that it doesn't look a whole lot like west Texas to me. Cordelia and King Cameron (Gardner & Keel) locate to Texas after the Civil War and buy land in order to build a cattle ranch. Mexican bandit Esqueda (Quinn) along with his adopted white brother Rio (Taylor) burns down their house to send a message to other whites from moving into what he considers an intrusion of his territory. This oater is also notable for being one of the few non-singing roles Howard Keel did for MGM. He almost reminds me of a more cultured Joe Don Baker even right down to his western drawl. Gardner is being her usual dignified self and doesn't really add much here to the whole thing other than butting into the men's business. In fact, this film almost starts off as another repeat for Ava Gardner since she was in a similar love triangle with Clark Gable in LONE STAR (1952), except in this one, Taylor refuses her advances and pushes her away, not following the typical Hollywood convention of the time. Good twist on the part of director John Farrow. It adds a darker psychological dimension to the Taylor character. I also enjoyed Anthony Quinn's performance as the drunken Mexican bandit Esqueda, who cowers and sulks in his bedroom when things don't go his way. He comes across as a bitter, drunken buffoon who's obsession reaches a climax when Taylor defects to over to Keel's side, helping him build up their ranch. Quinn then takes over the town of Brownsville in order to force Taylor out into the open. It ends when Quinn & Taylor shoot and kill each other in the saloon while the wounded Keel lies nearby, no match for Quinn's earlier fast draw. Given Quinn's slightly hammy performance along with the darker psychological aspect Farrow's script gives to the Rio/Taylor character, I'm gonna give this one a 6 out of 10. It's not a keeper but it does hold my interest.",
         "If shoot 'em up westerns are to your taste, this is probably not your cup of tea. The theme of Civilization vs. Barbarism is nicely explored in this very unusual western. The dialog is light years beyond the dialog in most westerns. Specifically, Rio's dialog is some of the best ever written for any character in any film of this genre. Whoever wrote it must have been bi-lingual. From his syntax, it is clear Rio speaks English as his second language. It is as if he is speaking Anglicized Spanish proverbs half of the time. Very Spanish. The gay subtext is unmistakable in the scenes between Rio and Esqueda, yet it is fairly subtle. Rio's beautiful horse and its livery, and his attire all summon up images of early cinematic western heroes. Rio looks like the Cisco Kid's dark alter- ego! It is difficult to accept Cameron's faith that Rio is honorable enough not to kill him once he turns his back. This issue really has two aspects: One is the credibility of Cameron's trust; the second is Rio's actual trustworthiness. Today we find it difficult to believe BOTH that Cameron would be so trusting of Rio and that Rio actually would turn out to be trustworthy. Our credulity is again stretched by Cameron's entrusting Rio with his ranch and wife. But Cameron is a newcomer to the territory, and he values Rio's savvy - about horses, ranch hands and probably survival! Cameron tells Rio that he wants him to help acquire horses for the ranch. Later Cameron's wife asks Rio about the sudden abundance of ranch hands which Cameron wasn't able to hire on his own. These things validate Cameron's motive, implausible as it may seem. I just accept that Cameron is pretty desperate and that he is a good judge of character. Regarding Rio: There was a time when a man felt like he owed his life to someone who had saved (or spared) it. Perhaps most men still lived by that code of honor at the time the movie is set. Or perhaps this was preserved longer in Hispanic culture - Rio's culture. Or perhaps Rio is simply a throw-back in his adherence to such a code. Anyway, the issue did not ruin the movie for me. Delia seems particularly naive (or stupid) for getting Rio to take her to plead Cameron's case with Esqueda. Despite these weaknesses, I enjoyed the film. It never really made me feel excitement, but it generated palpable tension among several characters. However, its uniqueness and dialog were what kept me interested throughout. I found Rio to be one of the most fascinating characters in this entire genre. One of my favorite scenes is when Esqueda is kicked back in his chair in the saloon with his filthy, bare feet thrust toward the camera. Nope, not your typical western!",
         "I've always felt that Ride Vaquero was one of the weakest of Robert Taylor's westerns. In playing Rio, Taylor certainly essayed one of the darkest characters he ever brought to the screen. It's the end of the Civil War and bandit Anthony Quinn has certainly had his run of things in the area. But the Yankee army will be occupying Texas shortly. Common sense would dictate that Quinn realize the jig is up that he'd better move on. At least his foster brother Taylor thinks so, but Quinn is drunk with power and he ain't going nowhere. Taylor finds some reason to stay when he takes one look at Ava Gardner newly arrived in Brownsville, but with husband Howard Keel. They're settling on a cattle ranch and Keel has some big plans. Most of the story I got, but quite frankly two points of it were ridiculous. Why Keel would even consider hiring Taylor after Taylor tried to burn him out. And secondly why Ava had Taylor take her to Quinn's camp to convince him to leave her and Keel alone. Those two things make absolutely no sense at all. Quinn is repeating the blustering role he had in Viva Zapata. But that film had a lot more depth to it. I think Quinn realized that and blustered all the more. Other reviewers commented on the undertone of a repressed gay crush that Quinn had for Taylor. It certainly might explain Quinn's motivations. But Anthony Quinn dealt with that issue six years later in Warlock, a much better western. It's a bad script with character motivations that make no sense. Still a good cast does the best they can by it.",
         "Robert Taylor thought this movie to be one of his worst! But years later it has come into favor, not only for the unique story line, but because of his performance of the outlaw Rio. He is so unhappy, so silent, so restrained, that when we see him falling in love with Ava Gardner, we almost can not believe it. Anthony Quinn gives a wonderful performance as the head of the gang, he is dirty, drunken, and vicious, the complete opposite of Rio. Esqueda (Quinn) wants to run off all the ranchers, because they bring with them law, and civilization. His time has come, and he knows it. When Howard Keel (Cameron) brings Ava (Dehlia)to his ranch to start a cattle kingdom, she becomes restless and lonely because at every turn, Esqueda burns and ravishes their home. Quinn sees the changes in Rio when he spots him longing, from a distance, after Dehlia. When Taylor is caught after a raid by Keel, he offers him a job, at which point he leaves Quinn, because he wants to be close to Ava. His character is very conflicted by loyalty to Quinn, and his love for Gardner. He knows that they will meet and one will kill the other. He stays anyway, and in the pursuit of horses, saves Keel's life, for which Keel feels vindicated, because he always felt that Rio had some good in him, not knowing that \\ he is in love with his wife. He leaves the ranch for a business trip, and when Ava asks Rio to take her to Quinn, so she can plead with him for her new life, he takes her there. When she threatens Quinn, she only stops when he tells her if she kills him she will also be killing Rio, because the gang will take his life. When they return to the ranch, she confronts Rio about the real reason he is there, and in the encounter he asks her why she saved his life. She is so needy, and lonely that she tries to seduce Taylor, and kisses him with such a hunger, that you can feels her needs thru the screen. He rejects her, slapping her, and leaving the home, knowing that he loves her, but that he is no good for her, and that Keel is the right man for her. Esqueda goes on the rampage, and they have a final showdown, where they are both killed. It is quite sad to see Ava, so conflicted, so unsure, seeing Rio dead, and knowing that he did it for her. She asks Keel for forgiveness, and he tells her that he can forgive anything that she can forget. A very interesting portrayal by all. A truly overlooked western, years ahead of its time in the films that would follow. Films that came out of the new Hollywood, method actors, method films. This could really be called a \"method western.\"",
         "Set in the area around Brownsville ,Texas in the immediate post Civil War era this is a splendid if slightly over heated picture.The area is dominated by Mexican bandido Esqueda ,well played by Anthony Quinn, who with the aid of his Anglo sidekick Rio(a taciturn but effective Robert Taylor)seeks to ensure settlers do not occupy the region as he views them as a threat to the way of life he has established.Trouble arrives in the form of Howard Keel who ,with wife Ava Gardner by his side is set on resisting all attempts to drive him out of the territory.Rio is won over to the cause ,somewhat more due to the beauteous Gardner than to any principled reasons.The scene is set for the final confrontation between Rio and Esqueda in the town saloon There are hints of a repressed sexual attraction for Taylor by Quinn in the script anticipating the theme of his role in Warlock( probably still the most grievously neglected Western classic) and the Taylor character displaying a penchent for an early version of gay chic in the clothing department underscores this The Quinn character is not a one dimensional villain-there is a reason for his stance and he displays a marked religious bent Good support from the great Jack Elam and Kurt Kaznar as the priest who takes a stand against Quinn.Gardner while beautiful was no great shakes as an actress and this together with an over stolid turn from Keel are the only real problems with the movie",
         "This is an interesting film because it is not listed in the 2007 Leonard Maltin Guide. Omissions are common in the book (particularly foreign and early films), but films by major American stars are practically never omitted--and this film starred Ava Gardner, Robert Taylor and Anthony Quinn as well as Howard Keel. Maybe it was not listed because the film was so bland. It's not a very good film but not bad either--sort of like dry toast and oh, so forgettable. Quinn and Taylor are thugs who lead a group of bandits who terrorize ranchers. They are very good at it and the only one who seems willing to oppose them is brave Howard Keel and his wife, Ava Gardner. However, Keel seems a bit crazy, as he doesn't seem to have a prayer. Then, oddly, he captures Taylor and instead of killing him makes him promise to be his partner and special friend(?). Now considering how evil Quinn is supposed to be, he leaves Keel and Taylor alone and spends most of the rest of the film pouting and moping! Although the film provided a different interpretation of why Quinn behaved that way, it really seemed like there was a gay subtext to the film. In other words, when Taylor left Quinn, Quinn felt jilted. Actually, pursuing this aspect of the film would have made the movie much more interesting and memorable--too bad they didn't. As for the acting, the one who probably came off best was Keel. Gardner just seemed like another lady, Quinn was fine until he became pouty and wimpy and Robert Taylor seemed half asleep during most of the film--putting zero energy into his role. I really wonder if he was either sick or hated the film so much that he just didn't try. And, despite an occasionally interesting script, I really think the latter might be why Taylor's performance was so listless.",
         "Two outlaws , Rio (Robert Taylor) and Esqueda (Anthony Quinn) , raised together as step-brothers , are reluctant adversaries in this fiery Western . Esqueda's mother raised Rio as her own , but this mutual fraternity will be modified in arriving a strange couple whose vision from law and justice differs quite from them . As the brothers will have a showdown when Rio defends an untameable owner (Howard Keel) and his wife (Ava Gradner) . Each owed the other their circumstances but is now the moment of reckoning . Then , there happens a real battle of wits among two siblings . The movie gets Western action , shootouts , a love story , thrills , an impressive town raid and results to be quite entertaining . It's an enough budget film with good actors , technicians , production values and pleasing results . This is a trigger-taut drama of the strangest brotherhood and facing off between the West's most upright man and his deadliest half-brother . Their brotherhood and friendship to break up when both of whom confront over the issue of whether to evict new settlers from their territory . The picture is a tale of justice , redemption and about a particular relationship between two brothers and a brave as well as pacific marriage . The basic plot is typical classic Western fare , but what makes this movie stand out is its style . The movie displays crossfire , love and hatred , fighting , round-up and exciting duels . It is plenty of violence and contains effective action sequences such as the ending when the cutthroats get together themselves and going through spectacular landscapes and go on riding until the trilling attack on the small town raid . The rousing climax as Taylor fights to make justice at the saloon , is justly exciting . Anthony Quinn is good as brutal bandit , he is excellent though sometimes overacting , his character bears remarkable resemblance to subsequent Spaghetti villains , as killing relentlessly enemies in cold blood . Robert Taylor gives a sober and sad acting as the good brother . And Ava Gardner is gorgeous , and wonderful , as usual . Support cast is frankly nice , such as : Kurt Kasznar , Ted de Corsia , Frank McGrath, Rex Lease , Monte Blue and the regular Jack Elam . Blazingly shot in Angiocolor by prestigious director of photography Robert Surtees . Moving and appropriate musical score by Bronislau Kaper . The motion picture was professionally directed by John Farrow in steamroller style . Here filmmaker John Farrow delivers a decently-paced film , though it has a few flaws and gaps . Farrow was a good craftsman who directed all kinds of genres , such as Drama : ¨Unholy wife¨ ; Historical : ¨John Paul Jones¨ ; Adventures : ¨Wake island¨ , ¨The years before the mast¨ , ¨Botany Bay¨ , ¨Back from eternity¨ ; Wartime : ¨Commandos strike at dawn¨ , ¨Sea Chase¨; Crime drama : ¨The big clock¨, ¨His kind of woman¨ , ¨The Saint strikes back : Criminal court¨ ; and Western : ¨A bullet is waiting¨, ¨Hondo¨, ¨Copper Canyon ¨and this ¨Ride vaquero¨ also titled ¨Una Vida Por Otra¨ or ¨Viva vaqueros¨ . Rating 6.5/10 .",
         "Even though it's not great, Quinn's performance is memorable and he really looks - and plays - the part. I'm also intrigued by a couple of brief scenes in this film - a wide shot of a cavalry fort and the shot of mounted troopers riding out look awfully like they came from \"She Wore A Yellow Ribbon\". Did John Ford help the producers fill a couple of small gaps? Howard Keel looked much more at home in \"Pagan Love Song\". Robert Taylor looks like he wore his \"Billy the Kid\" duds again. It's difficult to find a good, crisp copy of the film, but worth the effort."
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Esqueda, an outlaw, attempts to force settlers King and Cordelia Cameron out of his territory. Esqueda's mother raised Rio as her own. Rio has loyalty to Esqueda but also feels the settlers should be able to stay. A showdown between the two raised as brothers is unavoidable.",
         "Two outlaws, Rio and Esqueda, raised together as stepbrothers, have a showdown over the issue of whether to evict new settlers from their territory."
      ],
      "budget": 1128000
   },
   "movielensId": 125393,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-07-17",
      "dvdReleaseDate": null,
      "directors": ["John Farrow"],
      "runtime": 90,
      "movieId": 125393,
      "title": "Ride, Vaquero!",
      "mpaa": "",
      "actors": [
         "Robert Taylor",
         "Ava Gardner",
         "Howard Keel",
         "Anthony Quinn",
         "Kurt Kasznar",
         "Ted de Corsia",
         "Charlita",
         "Jack Elam"
      ],
      "imdbMovieId": "0046239",
      "originalTitle": "Ride, Vaquero!",
      "genres": ["Western"],
      "youtubeTrailerIds": ["PE2xyuUfXAw"],
      "plotSummary": "Ranchers in New Mexico have to face Indians and bandits.",
      "tmdbMovieId": 46193,
      "avgRating": 0,
      "releaseYear": "1953",
      "numRatings": 0,
      "posterPath": "/zrRQNsOapDCEsw0ZXbJwdSrMCcc.jpg"
   }
}