{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "old flame",
            "id": 33386
         },
         {
            "name": "marriage problems",
            "id": 166113
         }
      ],
      "imdb_id": "tt0043736",
      "video": false,
      "title": "Let's Make It Legal",
      "recommendations": [],
      "backdrop_path": "/AuFxBCia9ox2R4alyjAjc0Rjl7P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Miriam Halsworth",
               "gender": 1,
               "credit_id": "52fe447bc3a368484e02595b",
               "name": "Claudette Colbert",
               "profile_path": "/xDp3nOs14KvJNWIXL860RDEQKgI.jpg",
               "id": 30155,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Hugh Halsworth",
               "gender": 2,
               "credit_id": "52fe447bc3a368484e02595f",
               "name": "Macdonald Carey",
               "profile_path": "/wjf0dpWlw6N9wVOvvkEJLUAWtY4.jpg",
               "id": 7665,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Victor Macfarland",
               "gender": 2,
               "credit_id": "52fe447bc3a368484e025963",
               "name": "Zachary Scott",
               "profile_path": "/q9Lm9im3Z2gaHZ1hmDmI3TIEN3u.jpg",
               "id": 31551,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Barbara Denham",
               "gender": 1,
               "credit_id": "52fe447bc3a368484e025967",
               "name": "Barbara Bates",
               "profile_path": "/ca2fjt394lIZccuYpmPF7rTCj6w.jpg",
               "id": 10611,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jerry Denham",
               "gender": 2,
               "credit_id": "52fe447bc3a368484e02596b",
               "name": "Robert Wagner",
               "profile_path": "/nlRWGpsQPo8sSFdl8larlPUy1rS.jpg",
               "id": 9208,
               "order": 4
            },
            {
               "cast_id": 1,
               "character": "Joyce Mannering",
               "gender": 1,
               "credit_id": "52fe447bc3a368484e025951",
               "name": "Marilyn Monroe",
               "profile_path": "/12djXHYsa1fc9tZK0b9BfxaA6CP.jpg",
               "id": 3149,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ferguson",
               "gender": 2,
               "credit_id": "52fe447bc3a368484e02596f",
               "name": "Frank Cady",
               "profile_path": "/1st0r0fw1GfB7RRE7GJzbDkkP00.jpg",
               "id": 93622,
               "order": 6
            },
            {
               "cast_id": 28,
               "character": "Postman (as Harry Harvey Sr.)",
               "gender": 2,
               "credit_id": "57fadc82c3a3683ac9001e34",
               "name": "Harry Harvey",
               "profile_path": "/6YL4zhffF9rekiWv6twdn1h4jkN.jpg",
               "id": 93628,
               "order": 7
            },
            {
               "cast_id": 29,
               "character": "Reporter (uncredited)",
               "gender": 1,
               "credit_id": "57fadd08c3a3683ac9001e93",
               "name": "Kathleen Freeman",
               "profile_path": "/wdNFoCWk58bgTRxoqPV8uN9UoGO.jpg",
               "id": 7210,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Milkman (uncredited)",
               "gender": 2,
               "credit_id": "52fe447bc3a368484e02597b",
               "name": "Paul Gerrits",
               "profile_path": null,
               "id": 342025,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Police Lieutenant (uncredited)",
               "gender": 2,
               "credit_id": "57fadd39c3a3683945002341",
               "name": "Ralph Sanford",
               "profile_path": "/yMr8GgEqm2LrD2mI8LitFt39jw8.jpg",
               "id": 112009,
               "order": 11
            },
            {
               "cast_id": 10,
               "character": "Miss Jessup (uncredited)",
               "gender": 1,
               "credit_id": "52fe447bc3a368484e025977",
               "name": "Carol Savage",
               "profile_path": null,
               "id": 383246,
               "order": 12
            },
            {
               "cast_id": 31,
               "character": "Pete the Gardener (uncredited)",
               "gender": 0,
               "credit_id": "592cdc309251417c030064bb",
               "name": "Jim Hayward",
               "profile_path": null,
               "id": 1216584,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447bc3a368484e025957",
               "name": "Richard Sale",
               "profile_path": null,
               "id": 95262,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe447bc3a368484e025981",
               "name": "Robert Bassler",
               "profile_path": null,
               "id": 19395,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447bc3a368484e025987",
               "name": "Cyril J. Mockridge",
               "profile_path": null,
               "id": 14647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe447bc3a368484e02598d",
               "name": "Lionel Newman",
               "profile_path": null,
               "id": 11441,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447bc3a368484e025993",
               "name": "I. A. L. Diamond",
               "profile_path": "/lii36e0Ntvq7sL1rA0tVs4FePYT.jpg",
               "id": 3147,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe447bc3a368484e025999",
               "name": "F. Hugh Herbert",
               "profile_path": null,
               "id": 261037,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe447bc3a368484e02599f",
               "name": "Mortimer Braus",
               "profile_path": null,
               "id": 582194,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe447bc3a368484e0259a5",
               "name": "Robert Fritch",
               "profile_path": null,
               "id": 423011,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe447bc3a368484e0259ab",
               "name": "Lucien Ballard",
               "profile_path": null,
               "id": 3351,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "53cbd0620e0a265dfc002154",
               "name": "Albert Hogsett",
               "profile_path": null,
               "id": 120467,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "53cbd0720e0a265df00021f6",
               "name": "Lyle R. Wheeler",
               "profile_path": null,
               "id": 3358,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "53cbd0860e0a265df300234f",
               "name": "Paul S. Fox",
               "profile_path": null,
               "id": 1335586,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "53cbd09a0e0a265df00021fd",
               "name": "Thomas Little",
               "profile_path": null,
               "id": 8508,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "53cbd0ac0e0a265ded0022e0",
               "name": "Charles Le Maire",
               "profile_path": null,
               "id": 26172,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "53cbd0bd0e0a265dfc00215f",
               "name": "Renié",
               "profile_path": "/76N2CTu6h9sZZ8CfkexRlhFiVly.jpg",
               "id": 38229,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "53cbd0d10e0a265ded0022e5",
               "name": "Ben Nye",
               "profile_path": null,
               "id": 26175,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.026066,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24002,
      "vote_count": 3,
      "budget": 0,
      "overview": "The divorce of Hugh and Miriam Halsworth becomes final at midnight. Hugh wouldn't dream of calling it off, but can't abandon his rose garden. Things change that afternoon, though, when Miriam's old suitor Victor Macfarland checks into the hotel where Hugh is publicity man. With Miriam's daughter Barbara rooting for Hugh and son-in-law Jerry rooting for Victor, things are unlikely to be resolved by midnight...",
      "similar": [
         329103,
         194,
         49519,
         1903,
         7972,
         907,
         10999,
         713,
         1427,
         11631,
         12163,
         862,
         1278,
         38,
         116,
         88,
         1164,
         1640,
         1578,
         2758
      ],
      "original_title": "Let's Make It Legal",
      "runtime": 77,
      "poster_path": "/dCoLpfu63jJrqhyBeFDMGCvqQCb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1951-10-31",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "WHO CARES IF IT'S LEGAL AS LONG AS IT'S Tempting Virile Tantalizing Smooth WOW!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Richard Sale"],
      "runtime": 77,
      "synopsis": null,
      "writers": [
         "Mortimer Braus",
         "I.A.L. Diamond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0043736/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTMzZmJkMjMtNTMzNC00NjliLTkyMTctMTg2YzViZjdmNzI2L2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Claudette Colbert",
         "Macdonald Carey",
         "Zachary Scott"
      ],
      "reviews": [
         "\"Let's Make It Legal\" is the delightful little comedy about a grandmother (Claudette Colbert) who, after divorcing her husband, Hugh (Macdonald Carey) discovers that an old flame, Victor (Zachary Scott) still has the 'hots' for her and intends on turning his flame into an inferno with a vengeance. Robert Wagner costars as Colbert's devilish son-in-law. So where's Marilyn Monroe in all this? She's the sexy siren in hot pursuit of Vic's affections. But he's all ice when it comes to her charms. Go figure. It's a good thing this film wasn't included as part of Marilyn Monroe: The Diamond Collection because for all its cutsie cuddliness, this one's more cubic zirconium. TRANSFER: Lots to smile about here. The black and white picture genuinely sparkles. Blacks are solid, the gray scale is perfectly balanced and age related artifacts are, for the most part, nonexistent. Minor edge enhancement and some video noise (particularly in plaid patterns) crop up now and then but truthfully, this is a superb looking transfer. The audio has been re-channeled to two stem stereo with predictable limited range. Nevertheless the soundtrack is smooth. EXTRAS: Come on, what did you expect for a film of this limited appeal. You get some Marilyn trailers. Enjoy! BOTTOM LINE: Even if you're not a fan of Monroe (and I'd like to meet the man who isn't!) this silly little programmer is easy on the eyes and tingly all over, but especially on the heart.",
         "Claudette Colbert, Macdonald Carey, Zachary Scott, Robert Wagner, Barbara Bates, and Marilyn Monroe star in \"Let's Make it Legal,\" a 1951 20th Century Fox comedy. It's a fast little black and white film about a divorcing couple, the Hugh Halsworths (Colbert and Carey), their daughter Barbara (Bates) and her new husband Jerry (Wagner). The premise is that the Halsworths are divorcing because Hugh is a compulsive gambler and Miriam, his wife, has had about all she can stand. So they've separated and the divorce is final at midnight. But Hugh is always hanging around, spraying his roses or entering the house on some other excuse. Their daughter is having marital adjustment problems: She loves her mother waiting on her hand and foot and taking care of the new baby, but her husband wants them to have their own place. Barbara hopes her parents will get back together, which Jerry attributes to her selfish motives. In the midst of all this, an old boyfriend of Barbara's (Scott) enters the picture and proposes. This film is of interest due to an early appearance of Marilyn Monroe as a sexy young woman most anxious to meet the very wealthy Victor (Scott). It's also of interest to me because Colbert and Carey play young grandparents - not young people playing characters supposed to be older, but actual young grandparents. You don't see much of that in classic era films. Hugh tells Scott he married Miriam right out of school. (In actuality, Carey was about 38 at this time and Colbert was 48). \"Let's Make it Legal\" is also of interest as a look at how the studios worked. This isn't a big movie, so it's used as a training ground for two contract players, Wagner and Bates, neither of whom are very good. The studio probably appeased agent Johnny Hyde, who was ambitious for his client Monroe by giving her a small role. They used the film as a vehicle for Colbert, who in Hollywood, though still beautiful, is past her sell by date and relegated to less expensive films, as well as the washed up Scott. They pair her with a B leading man, Carey, whose big success was in television. This isn't a great movie. It's light, it's amusing, it's somewhat dated. Seeing Colbert is always a pleasure and Carey was an amiable actor, Scott an attractive one. Sadly both Bates, who later committed suicide, and Scott suffered from depression. Scott at this point in his career concentrated on stage and television work. Pleasant comedy.",
         "Let's Make It Legal is an amiable lightweight comedy that gave Marilyn Monroe a featured role in her days on the rise as a legend. The stars are Claudette Colbert and MacDonald Carey who are calling the marriage quits after over 20 years. Waiting in the wings is an old beau of Claudette, Zachary Scott who lost Claudette to Carey back in the day and has gone on to become a captain of industry and awaiting a presidential appointment besides. The reason for the divorce is Carey's drinking and gambling. His only other indulgence is his garden where he's grown some prize rose bushes. Two other interested parties are their son-in-law Robert Wagner and daughter Barbara Bates who live with Claudette with their baby girl. Bates won't leave the mother alone and wants her parents back together. Wagner wants to have their own home and if she won't get back together with Carey, Wagner will push a marriage with Scott. Carey should have done more comedy in his career, he had a nice light touch and does a marvelous drunk act. Colbert is a veteran comedy performer and the part was definitely no strain on her. Still Let's Make It Legal will never be among her top fifty. And Scott is shown up to be something of a cad in the end. The nucleus of this story is how Carey won her and what he does to win her back. Fans of the main players should enjoy Let's Make It Legal and others will to.",
         "This is probably one of Marilyn's least watched films. She didn't have much screen time but I thought it was a pretty cute movie. Claudette Colbert is almost unbelievable as a grandmother because she is still so beautiful. The ending is great. Too cute. 4 stars out of 5.",
         "Miriam and Hugh Halsworth's divorce is going to be final after midnight. Hugh, an inveterate gambler, cannot kick the habit, which was one of Miriam's main objections for divorcing the man she married. The two are not bitter about their separation, in fact, they seem to be pretty decent about their split than most couples. Hugh loves to come by his former home to tend the roses he so lovingly cares for, something Miriam would like to see him stop doing. When former beau Victor McFarland, a local man, decides to pay a visit to his hometown, he goes to see Miriam. He has not gotten over the fact she married Hugh instead of him. Now, recently liberated, Miriam reacquaints herself with the man she liked twenty years before. Victor proposes and she finally accepts, but leave it to Hugh, he will not concede defeat. He is up to his former tricks to win Miriam back. A 1951 Twentieth Century Fox comedy which was shown on a classic cable channel recently. Directed by Richard Sale, the comedy with its 77 minutes running time, is fast and frothy enough because of the good pacing the director had the good sense of giving the picture. The screenplay was written by I.A.L. Diamond, a genius for the genre, and Hugh Herbert. The three stars were perfectly cast. Claudette Colbert in her late forties made an excellent Miriam, the woman who could not take anymore of her husband's gambling, but who still loved him. MacDonald Carey was in top form as Hugh, the man fighting to save his marriage. Zachary Scott, suave and debonair, shows up to get between the Halsworths. Robert Wagner and Barbara Bates are seen as the young couple living with her parents. Marilyn Monroe has a small part in the film.",
         "This is a seriously flawed movie that still manages to be interesting--an odd combination to say the least. With a slight re-write, this could have been a much more enjoyable film. The film finds Claudette Colbert living in a house with her annoying daughter and son-in-law. As for Colbert's husband (Macdonald Carey), he's about to become the ex-husband--though the divorce was not his idea. Colbert is sick of Carey's gambling and he shows no sign of changing. As for the son-in-law (a very young Robert Wagner), he's sick of living with his in-law and it's all his wife's idea. The wife (Barbara Bates) is very, very lazy and likes that her mother takes care of her and the baby--and she also holds out hopes that her parents could reunite. But Wagner is against it--and would LOVE to see Colbert marry her rich old sweetheart (Zachary Scott) as they'd undoubtedly leave to live in his mansion--and Wagner and his wife could FINALLY be alone. Much of the film consists of Colbert being wooed by Scott and Carey trying to win her back. The basic story idea is good, but the execution left quite a bit to be desired. The problem was in the characters. With the possible exception of Colbert, the rest were all very, very difficult to like! The daughter (Bates) in particular was awful and very one-dimensional--and nothing like a real human being. To call her annoying is a definite understatement and I was looking for Wagner's character to rap her in the mouth (and I usually am strongly against spousal abuse...but I'll make an exception here). Wagner is a bit selfish and hard to like--plus he needed to show some backbone. As for Carey, he WAS a gambling addict and SHOULD have been divorced! Yest, by the end of the film, he hasn't changed one bit...yet he DOES win his wife back despite this! Finally, the film is predictable and hasn't got a decent payoff. By the way, in another case of deliberately dishonest marketing, Marilyn Monroe is on the DVD case and all recent advertising. However, she's barely in the film at all---and if you're not paying attention you might not even notice her!!",
         "I bought this DVD at cut price and only recently watched it. Had no ideas about it - Marilyn was on the front of the case but as has been mentioned before, that was dishonest marketing as she is a minor supporting actor. The main stars, Claudette Colbert in particular, shine and it's a lot of fun. Yes, the story is silly - it's a 1950s comedy - and the acting would not win Oscars, but it's a 77 minute smile that turns into a giggle now and again. The clothes are divine and the story swims along merrily, with a highly likely ending. Pity about Macdonald Carey, he was like an American Carey Grant, and could have done well in movies, but seems to have concentrated his career on TV.",
         "The two main male characters are both pursuing and fighting over the older woman (Claudette Colbert) and ignoring the charms of the young bombshell (Marilyn Monroe)! Surely that is a progressive and unusual story line for 1951, maybe for any era. Colbert and the two men do fine work, and Monroe looks great and does a few funny physical bits in her small role (it is absurd that the DVD is promoted as a Marilyn Monroe movie). Great period costumes, decor and language, too. This is an entertaining, sometimes funny '50s film with a strangely progressive bent, a strong older-woman lead, and some interesting character quirks (how can you not love a guy whose passions are horse betting and rose cultivation), plus a Marilyn Monroe cameo.",
         "Forty-something Claudette Colbert (she was 48 at the time) is waiting for her divorce decree to become final. She lives in a beautiful home in southern California which she shares with her married daughter and her husband (Barbara Bates, Robert Wagner). He works at a local resort hotel with his father-in-law (Macdonald Carey) who keeps coming around the house to tend his roses and talk Colbert out of the divorce. He has a gambling problem. The daughter (Bates) is a whiny, annoying little thing who wants mommy to wait on her, cook, and help with the baby. Wagner wants to move out, but Bates wants to stay to help her parents get back together. Enter millionaire Victor (Zachary Scott), a former rival for Colbert's hand. Scott is about to land a big government appointment and has returned to his home town for publicity and moves into the resort where Carey is PR director. Also staying there is Miss Cucamonga (Marilyn Monroe), who's out for all the publicity she can get. Of course Scott ignores Monroe and zeroes in on old flame Colbert, much to the annoyance of Carey. The divorce becomes final and Colbert announces she will marry Scott. Daughter Bates goes into a tizzy at the thought of losing mommy and having to set up her own home with Wagner. What settles Colbert's mind in the matter is when she learns why Scott did not propose to her 20 years before and why Carey did. Will she really marry Scott or will she reconcile with Carey? Seems far-fetched by today's standards, but in 1951 divorce was still a big deal. The stars all do well here with Monroe notable in her \"build-up\" period with 20th Century-Fox. Colbert looks great though she's a decade older than her suitors. Co-stars include Kathleen Freeman, Frank Cady, and Vici Raaf. Bates' character is truly annoying and selfish and almost ruins the film.",
         "It's the 50's: everyone is dressed up at work and at home, pitchers of dry martinis are the order of the day, and liberal use of DDT is the best bet for killing aphids on roses. You can't help but smile at some of this stuff. There's nothing terribly amazing about the script in this romantic comedy, which has a couple (Claudette Colbert and Macdonald Carey) divorcing after 20 years of marriage, and a jet-setter and old flame (Zachary Scott) swooping in on her. What's fun is the cast - Colbert is a delight and looks fantastic at age 48, her son-in-law is played by a slender 21-year-old Robert Wagner, and a blonde fortune hunter who appears in a few scenes is played by 25-year-old Marilyn Monroe, right before she became mega-famous. It's light entertainment with a cutesy ending.",
         "We have a young couple: Jerry(Robert Wagner) and Barbara(Barbara Bates), with baby, living with her parents Hugh(Macdonald Carey) and Mariam(Claudette Colbert), whose divorce will be finalized shortly. The daughter would like to continue living in her parent's house for some time, taking advantage of Miriam's expertise and energy in raising a child, and remaining in a familiar setting. Toward this goal, she tries to promote a reconciliation between her parents(Perhaps, Miriam, who will get the house, is more opposed to their remaining in her house). On the other hand, Jerry wants to move out as soon as possible into an apartment or house, to prove himself. Along comes millionaire Victor, an old flame of Mariam's, proposing marriage as soon as the divorce is finalized. Now, we have a huge inconsistency which is never explained. Victor and Miriam, after a day of fun, are in Victor's apartment. arguing about the advisability of a marriage. Miriam is adamant that she will never remarry. She can do without a man in her life, at least as a husband. Dating as friends might be OK. Victor has always been a bachelor, and she doubts he would be happy tied down to one woman. Finally, she's still miffed at his sudden disappearance from her life 20 years ago for no apparent reason. Perhaps this would repeat itself....Next, we switch to Mariam's house where the young couple are waiting anxiously for Miriam's return. Mariam bursts into the house with the news that she's going to marry Victor. What happened to make her change her mind? Another key inconsistency: When Victor keeps putting off their shotgun marriage because of a changing schedule of meetings in far off Washington D.C., Mariam eventually decides to call off the marriage. Any reasonable couple would have put off the short-notice wedding until after Victor's career-defining trip was over. Miriam got the idea that she would play second fiddle to Victor's career. She had had enough of this treatment with Hugh's addiction to gambling and babying his many prize rose bushes. When Hugh learns of the cancelled marriage, he renews his campaign to reconcile with Mariam. At first, she adamantly says no. But, after Hugh explains that he used loaded dice in his crap shoot with Victor to determine which would continue dating her, she suddenly softens and the implication of the fade out is that they will reconcile. Hugh further claims he will stop gambling to please her. Well, I don't know about that. It's a wonder she put up with his gambling for 20 years, except that he seems to do well, hence they aren't living on poverty row. As long as Mariam is mightily bothered by his gambling, I think they would be better off living as singles, dating one another occasionally. Of course, too many films of this era wanted to force a happy ending after an hour and a half of turmoil. In many cases, I wouldn't give the reconciliation much of a chance of sticking. Claudette, at age 48, playing a woman 10 years younger, is still very much a knockout. Cary(Hugh), as well as Scott(Victor) were both tall and aristocratic-looking. Cary mostly played leading men and second leads in \"B\" pictures. Later, he starred in the long-running TV sitcom \"Days of Our Lives\". Scott somewhat reminded me of Clark Gable in looks, with his moustache. He was mostly a leading man or second lead. I most remember him as the lead in \"The Southerner\". Barbara Bates was very shy as a girl. Despite winning a beauty contest and a Hollywood contract, she became increasingly insecure and despondent over time, made worse by the death of her husband and agent, whom she was very dependent upon, psychologically. Some years after a failed suicide attempt, she succeeded, at age 44. Interestingly, her character here seems insecure in dealing with her baby, heavily dependent on Mariam for advice and help, and not wanting to leave the house that had always been her home. At this stage, Marilyn Monroe was still a bit player, serving as eye candy. Of course, like Barbara, she would exhibit increasing mental instability with age, eventually apparently succeeding in a suicide. Here, her character is inconsequential to the plot, briefly appearing 3 times. She wants Hugh to help her get the attention of Victor, as a would be gold digger. She's always seen with Hugh, even dancing with him, but with no hint of a romantic attachment. Currently available in the Marilyn Premiere Collection, with 16 other films.",
         "MacDonald Carey and Claudette Colbert are 24 hours away from the final decree, but anything can happen and probably will. Zachary Scott is a suitor from Claudette's past who puts a monkey wrench in MacDonald's plans and son-in-law Robert Wagner's plans, who wants his wife/ Claudette's daughter to grow up and leave the roost. And, Marilyn Monroe is an added attraction. While it boasts a very good looking cast, it doesn't add anything extra to its predictable plot. You know where it's going. In fact the rivalry between MacDonald and Zachary gets a little tiresome. Most viewers would be seeing this for Marilyn Monroe and would be disappointed in the little they see of her. It does have a somewhat \"cute\" ending. But, all in all, if you seen this once, well, you've seen it.",
         "This is quite possibly the worst Marilyn Monroe movie I have ever seen,it's not poor Marilyn's fault though. If you want to blame anyone for ruining this movie blame Barbara Bates and Robert Wagner. All Bates does in this movie is whine and complain , and she doesn't do it very well either.Wagner is Bates' husband who wants her to stop trying to get her divorced parents back together, and just like Bates, he gets so annoying you just want to slap him by the end of the movie. The two saving graces of \"Let's Make is Legal\" are Claudette Colbert and Marilyn Monroe, who doesn't have enough screen time.",
         "It's not beyond the realms of possibility that some future Cultural archaeologist will note the large percentage of timber amongst actors of the late forties and fifties. God knows we had our share in England; Keiron Moore, John Gregson, Richard Pasco, Laurence Harvey, Michael York, but the virus was just as active in Hollywood, John Derek, Wendell Corey, John Ireland, Gary Merrill to name only a handful. Hugh Marlowe even managed to luck into two 'classic' films in the same year (1950), having featured roles in both All About Eve and Twelve O'Clock High. Here we have another in the shape of Macdonald Carey. Sending him in as leading man against Claudette Colbert is like sending in Banksy against Toulouse Lautrec. The poor sap hasn't a chance. You're never wasting your time watching Colbert (well, hardly ever, Texas Lady anyone) but apart from a roster of mostly uncredited 'character' actors she's the only decent thing in this piece of cheese albeit it was co-written by Izzy Diamond and directed by Richard Sale. Robert Wagner is an embarrassment, Barbara Bates a disaster, Zachary Scott walks through it and ... oh the hell with it, cross it off your list.",
         "1:17 didn't do justice to this movie. The scenes with Zachary Scott of Mildred Pierce fame with Claudette Colbert were ridiculous. You expected Colbert to look the way she did in 1951, but Scott looked like he could be his son, especially with that tan. The plot was funny with a couple about to have their divorce become final and the sudden reappearance of the boyfriend (Scott) after a 20 year absence. MacDonald Carey and Colbert had excellent chemistry as the couple whose marriage has gone awry. Ditto for Robert Wagner, their son-in-law and the end of All About Eve's Barbara Bates. Wagner shows that he can be a little uptight and downright nasty in some scenes. Too little use was made of Marilyn Monroe. Now, if she had been made Carey's really young girlfriend with some romantic scenes, the laughs would have increased."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Twentieth Century Fox"],
      "summaries": [
         "The divorce of Hugh and Miriam Halsworth becomes final at midnight. Hugh wouldn't dream of calling it off, but can't abandon his rose garden. Things change that afternoon, though, when Miriam's old suitor Victor Macfarland checks into the hotel where Hugh is publicity man. With Miriam's daughter Barbara rooting for Hugh and son-in-law Jerry rooting for Victor, things are unlikely to be resolved by midnight...",
         "The nearly-final divorce of the Halsworths suddenly gets complicated when Miriam's old flame comes to town."
      ],
      "budget": 0
   },
   "movielensId": 125379,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1951-10-31",
      "dvdReleaseDate": null,
      "directors": ["Richard Sale"],
      "runtime": 77,
      "movieId": 125379,
      "title": "Let's Make It Legal",
      "mpaa": "",
      "actors": [
         "Claudette Colbert",
         "Macdonald Carey",
         "Zachary Scott",
         "Barbara Bates",
         "Robert Wagner",
         "Marilyn Monroe",
         "Frank Cady",
         "Harry Harvey",
         "Kathleen Freeman",
         "Paul Gerrits",
         "Ralph Sanford",
         "Carol Savage",
         "Jim Hayward"
      ],
      "imdbMovieId": "0043736",
      "originalTitle": "Let's Make It Legal",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The divorce of Hugh and Miriam Halsworth becomes final at midnight. Hugh wouldn't dream of calling it off, but can't abandon his rose garden. Things change that afternoon, though, when Miriam's old suitor Victor Macfarland checks into the hotel where Hugh is publicity man. With Miriam's daughter Barbara rooting for Hugh and son-in-law Jerry rooting for Victor, things are unlikely to be resolved by midnight...",
      "tmdbMovieId": 24002,
      "avgRating": 3,
      "releaseYear": "1951",
      "numRatings": 1,
      "posterPath": "/dCoLpfu63jJrqhyBeFDMGCvqQCb.jpg"
   }
}