{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "astronaut",
            "id": 14626
         }
      ],
      "imdb_id": "tt0061173",
      "video": false,
      "title": "Way... Way Out",
      "recommendations": [
         109399,
         40062,
         21121,
         27827,
         48397,
         404830,
         19676,
         24643,
         28847,
         40460,
         27417
      ],
      "backdrop_path": "/ePCPmOYn3mWexr6Q68Zzxj5Odgs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Pete Mattemore",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b3689",
               "name": "Jerry Lewis",
               "profile_path": "/6RmgMdUxRPm2dZnTyRD4r0c6z3M.jpg",
               "id": 3663,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Eileen Forbes",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b368d",
               "name": "Connie Stevens",
               "profile_path": "/nhVnIonVhPmN7EBJGm8XBOXL0O2.jpg",
               "id": 95476,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Harold Quonset",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b3691",
               "name": "Robert Morley",
               "profile_path": "/7R4jQRl8CTFYCYpiQ1O2AjYtiK6.jpg",
               "id": 6599,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Hoffman",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b3695",
               "name": "Dennis Weaver",
               "profile_path": "/vlAJC2oEE7PWOdp2hRi4K8v3zro.jpg",
               "id": 12422,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Schmidlap",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b3699",
               "name": "Howard Morris",
               "profile_path": "/dYOSuyGJg5oOS31Ls8sNvvjogw2.jpg",
               "id": 27517,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Gen. 'Howling Bull' Hallenby",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b369d",
               "name": "Brian Keith",
               "profile_path": "/jtM2bb1un0Lhft4H2FH6DbRd7Qd.jpg",
               "id": 32791,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Igor Valkleinokov",
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b36a1",
               "name": "Dick Shawn",
               "profile_path": "/vCCVQc8CQiMM4gMsoeZJ5pGzMHA.jpg",
               "id": 19178,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Anna Soblova",
               "gender": 1,
               "credit_id": "52fe4a03c3a36847f81b36a5",
               "name": "Anita Ekberg",
               "profile_path": "/6cVesMXxY4dRO4K87Ni7msNdTPh.jpg",
               "id": 5961,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Stella Mary",
               "gender": 1,
               "credit_id": "5729bac7c3a368329700087a",
               "name": "Margaret Teele",
               "profile_path": null,
               "id": 1213250,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Russian Delegate",
               "gender": 2,
               "credit_id": "58b85ac5c3a3684217000296",
               "name": "Sig Ruman",
               "profile_path": "/k6w5OsiP6ijrBDACgVn9CzzMri4.jpg",
               "id": 2497,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Ted Robertson",
               "gender": 2,
               "credit_id": "58b85b29c3a36841ed000320",
               "name": "James Brolin",
               "profile_path": "/8SGPpN3ieM3K0mHjD8bbQIRD6x.jpg",
               "id": 9274,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Peggy",
               "gender": 1,
               "credit_id": "5a5c28d7925141322f004159",
               "name": "Linda Harrison",
               "profile_path": "/hT3pOpVkSoYV1RgxkOiu2CukKAv.jpg",
               "id": 13260,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b3667",
               "name": "Gordon Douglas",
               "profile_path": "/r6UZt0lLqgXHAG8GoN3NiWrnH5d.jpg",
               "id": 51677,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b366d",
               "name": "William Bowers",
               "profile_path": "/31257PgXpPD7npsbBlO9eZoKgXK.jpg",
               "id": 69948,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a03c3a36847f81b3673",
               "name": "László Vadnay",
               "profile_path": null,
               "id": 144071,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a03c3a36847f81b3679",
               "name": "Malcolm Stuart",
               "profile_path": null,
               "id": 1030309,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b367f",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a03c3a36847f81b3685",
               "name": "William H. Clothier",
               "profile_path": null,
               "id": 40183,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59b2a7de925141079d09c30e",
               "name": "Hugh S. Fowler",
               "profile_path": null,
               "id": 11443,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59b2a7e5925141070709eb30",
               "name": "Hilyard M. Brown",
               "profile_path": null,
               "id": 30106,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59b2a7eb925141072f09ff1d",
               "name": "Jack Martin Smith",
               "profile_path": null,
               "id": 9061,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59b2a7f1c3a3682d8704d184",
               "name": "Stuart A. Reiss",
               "profile_path": null,
               "id": 9799,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59b2a7f7925141072309cd22",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59b2a801c3a3682d8704d19b",
               "name": "Moss Mabry",
               "profile_path": null,
               "id": 14727,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.742714,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 102195,
      "vote_count": 8,
      "budget": 0,
      "overview": "A platonically wed American couple run a lunar weather station near an unwed Soviet couple.",
      "similar": [
         157336,
         2103,
         62,
         95,
         286217,
         395992,
         2900,
         568,
         19995,
         871,
         698,
         348,
         126889,
         384521,
         49047,
         274870,
         1669,
         667,
         438740,
         811
      ],
      "original_title": "Way... Way Out",
      "runtime": 101,
      "poster_path": "/539VR5yuDCFTEsRtXLio88apqRN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Way Out Company",
            "id": 94650,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coldwater",
            "id": 87259,
            "origin_country": ""
         }
      ],
      "release_date": "1966-10-26",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "By Gemini, here's the wildest crew on Earth, Saturn, Mars, Moon etc.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gordon Douglas"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "William Bowers",
         "László Vadnay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061173/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDYwMTYwODkzN15BMl5BanBnXkFtZTgwNzYwODk1MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jerry Lewis, Connie Stevens, Robert Morley | See full cast and crew »"],
      "reviews": [
         "Although Jerry Lewis is the star of this mid 60's spoof of the space program he gets plenty of help in providing the comedy. A good supporting cast make this an enjoyable comedy film. Howard Morris's character Schmidlapp a sex starved American astronaut who's been stationed on the moon far too long is perhaps the best of all. When he sees the gorgeously cute Connie Stevens he loses it. \"Maybe she's one of those girls who soaps herself all over..and...then ...gets...into the tub\" he tells fellow astronauts Lewis and Dennis Weaver who are wondering how Stevens takes a bath. The late Dick Shawn and Brian Keith are also featured. Like Gilligans Island \"Your sure to get a smile\" when you see this movie.",
         "\"Austin Powers\" spoofed spy films of the sixties and this film is somewhat in that vein except \"Way... Way Out\" was made from a sixties perspective, not a nineties perspective. Also, this film spoofed a sacred cow, the space program (Disney's \"Moon Pilot\" in 1962 covered much of this territory already and if you like one you'll probably like the other...though very few people have heard of either). Any fan of the sixties will recognize likeable Brian Keith (he also starred in \"Moon Pilot\"), sophisticated Robert Morley, leggy bombshell Anita Ekberg, frumpy character actor Milton Frome, studly James Brolin, wacky Howard Morris, even wackier Dick Shawn, and forever Chester, Dennis Weaver. Jerry Lewis of course is the star and delicious Connie Stevens (who Jerry introduced in the must superior \"Rock-a-Bye Baby\") is the eye candy. By today's standards one might consider the casting of the actresses for their physical attributes a bit sexist (like that doesn't happen today) but this is a physical comedy and placing Connie Stevens among a group of men (men always have sex on their mind don't you know) is not really all that sexist (at least not for the women). Connie Stevens success has been that she's a good comedian too. Some of the comedy is Benny Hill style (or \"Austin Powers\") but not crude like contemporary films \"Something About Mary\" or \"Scary Movie.\"",
         "We have VHS! So I rented it last night--first laid eyes on this gem back in '66 when I was ten years old. Ten year olds shouldn't see movies like this, hehe. Jerry Lewis does less of his wacky character here, and tries playing it straight, not for gonzo laughs. He's nearly laid back compared to Robert Morley's curtain rattling performance as Jerry and Connie Stevens \"first married couple on the moon. He's a handler like Leo G. Carroll was for Napoleon Solo in the Man From Uncle. Brian Keith appears several times in short inserts as a gruff-but-still-gruffer General who orders third act action where Jerry must \"secure the moon\". Sure, all the sets are drenched in futuristic lighting as the story is set sometime after the Sixties, doesn't say when though. So in the background are cool concept cars of the future, during the Earth based scenes. You see solid patches of red and brilliant white furniture,(and very cool clear, plastic pillows), straight out of movies like \"In Like Flint\" or the British set designer for Sixties movies Ken Adam. The Moon base location has cool looking pods for sleeping/working--and yes the patented \"Batman\"-style, big, blinking lights computers are strewn all over your eyeline, which I totally loved as a kid. Lighting-wise, the production simply pours all available light at all times during the indoor moon scenes, which has a television-feel about it; later verified by the technical names, especially Jack Martin Smith, who worked scores of sci-fi/fantasy pics during the Sixties for TV and low budget independents. The film is super-sexy with tease galore supplied by Anita Ekberg's fab legs, shot from at least three angles during her opening house call on the American married couple living next door on the moon. There's all sort of adult-level innuendo that flew over my head at the time: things about wife swapping, watching two girls makeout on one's wedding night, and others that are cleverly enfolded into the dialog, some PC types of the Two-Thousands would call this \"leering\" and it probably is, hehe. Dick Shawn as the Tarzan-like Russian counterpart to Jerry simply does his patented \"thing\" with grimacing and good accents. There's an extended sequence of everybody getting drunk and kinda swapping, which today's producers would be cutting out because bad things happen to people who drink to excess, right? --oh yeah everybody knows that. The drunk thing was big in the sixties for some reason. Dick Shawn's other picture that year \"What Did You Do In The War, Daddy?\" had him being drunk through days of story time. Seeing this movie without any warning would certainly remind some of Austin Powers; it's inescapable really. However I saw this tonight with a 28 year old who reminded me, \"Austin Powers got it's look from this, not the other way around\"",
         "A few parts had me howling, even though the rest of the room was dead quiet. But I've always been a fan of Jerry's more subtle \"deadpan\" humour and surrealistic, wordless scenes where the comedy seeps into you rather than the bang-pow punchline type of laugh. For example in CINDERFELLA there's that scene where he's trying to light his stepbrother's cigarette. No music, no dialogue, no camera motion at all. Just 120 seconds of pure disaster. Or in NUTTY PROFESSOR there's the hilarious scene where he timidly enters the dean's office--again, no sound, no words, just a thick, hilarious atmosphere. WAY... WAY OUT has a few of those types of gags, and they were brilliantly done, including one of the funniest gags I've ever seen (\"If I'm not mistaken, that's Stella Mary right there\"). Unfortunately the film seemed to switch gears halfway through, once they're on the moon, and it became more of a silly sitcom. Still, I enjoyed it until the end. A word about the visual presentation: magnificent! Sure, we don't generally go to Jerry Lewis movies to see artistic cinematography, but it's there. The sets are surreal (futuristic in a cool retro-60s way). Everything was large and colourful. Shots are framed wonderfully (be sure to see it in widescreen). The camera moves smoothly and brilliantly throughout the action. But then, as I said above, everything changes once they're on the moon. The sets become smaller, more claustrophobic and less grandiose. This returns us to the silly sitcom feel. Overall it was wacky & entertaining. I think it's best watched by people who are familiar with Jerry's subtle style, rather than his slapstick skits. For that reason I'm afraid most people will be disappointed. But a few of you may really enjoy it.",
         "Saw this as a teen first time it hit TV - and laughed nearly all the way. Many good lines that stand the test of time (you should hear what she wanted to do last night) as well as usual over-the-top performance from Lewis and (more so) from Shawn. Some of the humour is based on the very REAL socio-political situation with the space race and the cold war, so younger viewers might not always \"get it\". Too bad. You should still get enough from the rest of the lines. Movie wasn't meant to be \"camp\" in original release, but should gain somewhat due to campy appearance from a late 90's perspective. Rent it - have some laughs - and \"soap (yourself) all over\".",
         "\"Way...Way Out\" is an unusual Jerry Lewis film mostly because it isn't really a comedy. Sure, it has a few laughs here and there, but the overall effect is more like a commentary about the Cold War than a funny film. To put it bluntly, it isn't particularly funny--though it is interesting. The film is set in the near future. There is an American and Russian base on the Moon and both are quite small--with two persons in each. As for the American base, the men aboard keep going crazy--presumably because they cannot function without women. But, the Russians have sent a man-woman team and their base is functioning much better. So, the head of the American space agency (an oddly cast Robert Morley) has determined that the next team going to the station will be married. The problem is that the next man scheduled to go (Jerry Lewis) is single and has no particular plans to marry. But, when told they want him to marry a pretty lady (Connie Stevens), he's in favor of the idea--but she isn't. So, the pair agree to go and to marry but not to consummate the marriage. The rest of the film is basically waiting until Stevens changes her mind. In between there is a pretty silly (and forgettable) plot involving the two Russians (Dick Shawn and Anita Ekberg). The bottom line is that the film lacks laughs but is also inoffensive and an interesting look into the times in which it was made. A must for Lewis fans--otherwise, an inoffensive time-passer and nothing more. By the way, I am not sure why but if you watch the veteran actor Sig Ruman closely, you can tell his voice is dubbed. Perhaps he had trouble doing the Russian accent credibly.",
         "The 1960's were known well for it's campy fun. The same year \"Batman\" and \"Star Trek\" debuted, Jerry Lewis comes out with this sci-fi comedy, \"Way... Way Out\". You got this bungling astronaut named Peter Lattimore (Jerry Lewis) and Eileen Forbes (Connie Stevens) who are assigned to replace two male astronauts because they are doing nothing but be at each other's throats.The longentivity up in the US Weather Station caused them to suffer \"adult homesickness\" . Peter and Eileen were the last chance of hope in space because the last couple split up. They go up into space, send the two male astronauts back home to Earth, and would later meet the Russian couple, who are not married. They visit the American couple, have a vodka party, and had the young girl sleep over after wards. After hearing a word from the General, Peter jumped the gun and takes out Igor (Dick Shawn). Realizing his error, he clears things with him. The competition seems to never end, my friend. A fun and simple movie, there are a few scenes that are not kid friendly, but not too bad though. 4 out of 5 stars",
         "I love crazy sixties films and this is one of them. I'm not a Jerry Lewis fan but I thought he was funny, not over the top or exaggerating. Connie Stevens is very cute in the American girl next door kind of way. Anita Ekberg surprised me. It was so bizarre that this La Dolce Vita star would team up with Jerry Lewis but she did, and it proves she was a good comedienne too. In this film she's a brunette (awful hairdo, tho) and looks not a little like Garbo! The poor thing has to wear bathing suits the entire film. Robert Morley is in it too and is as lovable British as ever. He could make any part he played lively and fun. James Brolin and Linda Harrison (Planet of the Apes) are in it too, as is Dennis Weaver. The special effects are quite good for 1966 and quite camp for today. The title tune by Lalo Schifrin is catchy. I saw this on a German DVD in English with the soundtrack at times changing to German at times. Really bizarre to see Jerry Lewis in space in German!",
         "They really can't come more dreadful than this 1966 film. Jerry Lewis and crew are literally out of space with this one. Our government wants a married couple to be at the moon following an embarrassing situation between an American and Russian woman in outer space. The picture might have been funnier had Lewis married the woman assigned to him when Connie Stevens temporarily bowed out of the picture. The woman was domineering and actually thought what she was doing was a service for America. Instead, Stevens bails in and the picture goes from downhill to the most absurd imaginable. In space, the two are soon joined by Dick Shawn and Anita Ekberg, two Russian space people who proceed to get everyone drunk. Believe it or not, this is not very funny at all. As the space commander on earth, Robert Morley does have some brief funny moments as the overwhelmed guy in this awful situation.",
         "If you like silly, spoofy films, this is a great one to watch. Jerry Lewis and Connie Stevens work so well together and, as a big fan of both of them, I am always thrilled when I get the chance to watch this film. They are both so lovable! I especially love the scene where they finally agree to go to the moon together. Dick Shawn gets to provide us another frenetically, wacky character and Anita Ekberg is just a total sexpot. The rest of the supporting cast each add to the fun in their own signature ways. I think that is the best part of this movie; each actor gets to provide us with a great view of what we expect from their comedic side."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Coldwater",
         "Way Out Company"
      ],
      "summaries": ["The Americans and the Russians each have a two-person base on the moon. The Americans have had to keep replacing their astronaut teams because they quickly go crazy; they have been using only male astronauts on the unspoken assumption that this would avoid any possibility of impropriety. The Russians, as godless Communists, are under no such constraints, and their male-female team has remained well-adjusted. At the start of the film, a male and female American astronaut team is sent up to replace the sex-starved all-male team. The government insists on them being married first to preserve morality. Most of the story revolves around the eventual consummation of this marriage of convenience, and around their relationship with their Russian neighbors, who keep casually dropping by."],
      "budget": 0
   },
   "movielensId": 125471,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-10-26",
      "dvdReleaseDate": null,
      "directors": ["Gordon Douglas"],
      "runtime": 101,
      "movieId": 125471,
      "title": "Way... Way Out",
      "mpaa": "",
      "actors": [
         "Jerry Lewis",
         "Connie Stevens",
         "Robert Morley",
         "Dennis Weaver",
         "Howard Morris",
         "Brian Keith",
         "Dick Shawn",
         "Anita Ekberg",
         "Margaret Teele",
         "Sig Ruman",
         "James Brolin",
         "Linda Harrison"
      ],
      "imdbMovieId": "0061173",
      "originalTitle": "Way... Way Out",
      "genres": [
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A platonically wed American couple run a lunar weather station near an unwed Soviet couple.",
      "tmdbMovieId": 102195,
      "avgRating": 2.5,
      "releaseYear": "1966",
      "numRatings": 2,
      "posterPath": "/539VR5yuDCFTEsRtXLio88apqRN.jpg"
   }
}