{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "charity",
            "id": 3447
         },
         {
            "name": "fur",
            "id": 5154
         },
         {
            "name": "caper",
            "id": 9728
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "farce",
            "id": 10280
         },
         {
            "name": "fur coat",
            "id": 14814
         },
         {
            "name": "policeman",
            "id": 33699
         },
         {
            "name": "dame",
            "id": 165076
         },
         {
            "name": "illegal gambling",
            "id": 173602
         },
         {
            "name": "steal",
            "id": 202041
         },
         {
            "name": "mink coat",
            "id": 230512
         },
         {
            "name": "kensington",
            "id": 234083
         },
         {
            "name": "police disguise",
            "id": 234666
         },
         {
            "name": "desguise",
            "id": 234671
         }
      ],
      "imdb_id": "tt0054049",
      "video": false,
      "title": "Make Mine Mink",
      "recommendations": [
         30506,
         31200,
         37873,
         48361,
         38606,
         24109,
         22386,
         16057,
         43908,
         70927,
         40813
      ],
      "backdrop_path": "/xmuOrCbRtFPYzk5H0k5cL0fxsUA.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Charlie Powell",
         "id": "58fa3ec9c3a3687c7300dcc4",
         "content": "Make Mine Mink is a top quality comedy that should have you laughing throughout. Bored with their humdrum lives four London flatmates decided that they should turn modern day Robin Hoods when they get a buzz from returning a fur coat to a neighbour before their housekeeper can be implicated. With great performances from Terry Thomas, Hattie Jacques, Athene Seyler, Elspeth Duxbury and Billie Whitelaw this comedy farce from 1960 may have aged but is still a lot of fun!",
         "url": "https://www.themoviedb.org/review/58fa3ec9c3a3687c7300dcc4"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Major Albert Rayne",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff8b7",
               "name": "Terry-Thomas",
               "profile_path": "/tdsN3NUsBNEPtHkWX5BskfG7yCi.jpg",
               "id": 29427,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dame Beatrice Appleby",
               "gender": 1,
               "credit_id": "52fe4672c3a36847f80ff8bb",
               "name": "Athene Seyler",
               "profile_path": "/yk1w7HDGENWmYEpMgeyOkMFTUbA.jpg",
               "id": 39000,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nanette Parry",
               "gender": 1,
               "credit_id": "52fe4672c3a36847f80ff8bf",
               "name": "Hattie Jacques",
               "profile_path": "/wCymZojCJ9Dg4tbdqmeB3mDvVoB.jpg",
               "id": 40957,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Lily",
               "gender": 1,
               "credit_id": "5565519ac3a3687aca000e5a",
               "name": "Billie Whitelaw",
               "profile_path": "/5XSUS3oSuG2CtJQPiEBQd9AAmg4.jpg",
               "id": 8226,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Elizabeth \"Pinkie\" Pinkerton",
               "gender": 0,
               "credit_id": "556551839251413546000dea",
               "name": "Elspeth Duxbury",
               "profile_path": null,
               "id": 1470967,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Jim Benham",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff8c3",
               "name": "Jack Hedley",
               "profile_path": "/nHNv9DqFM8VWFxBrK88nwYqCG0j.jpg",
               "id": 10507,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Inspector Pape",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff8c7",
               "name": "Raymond Huntley",
               "profile_path": "/txL0IXHSd70qIAGsGytEjcSL9g2.jpg",
               "id": 87071,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Drunk",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff8cb",
               "name": "Freddie Frinton",
               "profile_path": null,
               "id": 48327,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Hon. Freddie Warrington",
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff8cf",
               "name": "Kenneth Williams",
               "profile_path": "/fKKlqPmvq7CpnqqvD2TzsRnPXEw.jpg",
               "id": 40941,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Madame Spolinski",
               "gender": 1,
               "credit_id": "556551ba9251413540000e1d",
               "name": "Irene Handl",
               "profile_path": "/ydgfpIXL3Abx8wf0qpJue9QztG1.jpg",
               "id": 79641,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Gertrude",
               "gender": 0,
               "credit_id": "556551cdc3a3687ac5000fc6",
               "name": "Penny Morrell",
               "profile_path": null,
               "id": 623185,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Lionel Spanager",
               "gender": 2,
               "credit_id": "556551e59251413549000e1b",
               "name": "Sydney Tafler",
               "profile_path": "/i8rQgwaffxh7nBWZknB2RV55zWw.jpg",
               "id": 109865,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Dora Spanager",
               "gender": 0,
               "credit_id": "556551fcc3a3687ad9000df7",
               "name": "Joan Heal",
               "profile_path": null,
               "id": 138409,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4672c3a36847f80ff8b3",
               "name": "Robert Asher",
               "profile_path": null,
               "id": 76380,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58ff1843c3a36853900062c7",
               "name": "Peter Blackmore",
               "profile_path": null,
               "id": 1053408,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58ff188b92514107c2006c85",
               "name": "Peter Coke",
               "profile_path": null,
               "id": 994214,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58ff190d92514107d0006f6e",
               "name": "Michael Pertwee",
               "profile_path": null,
               "id": 43793,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58ff1943925141081d006a10",
               "name": "Earl St. John",
               "profile_path": null,
               "id": 67681,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58ff1996c3a368539f0063ef",
               "name": "Hugh Stewart",
               "profile_path": null,
               "id": 54033,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58ff1b47c3a3685331006685",
               "name": "Philip Green",
               "profile_path": null,
               "id": 29892,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58ff1bc092514107ba007281",
               "name": "Reginald H. Wyer",
               "profile_path": null,
               "id": 103237,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "58ff1bf1925141081d006b83",
               "name": "Roger Cherrill",
               "profile_path": null,
               "id": 1002343,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.834324,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 44023,
      "vote_count": 8,
      "budget": 0,
      "overview": "In a mansion block in Knightsbridge, a gang of middle-aged biddies decide to brighten up \"the dullness of the tea time of life\" by staging a series of robberies on furriers, then donating the proceeds to charitable concerns. Terry Thomas as a retired army officer leads the gang, which includes Athene Seyler and Hattie Jacques, on a series of capers that nearly go awry when their maid, Billie Whitelaw, an ex-con and also a resident of the block, falls for a police officer.",
      "similar": [
         634,
         146216,
         10536,
         646,
         657,
         667,
         668,
         682,
         699,
         707,
         708,
         714,
         253,
         339403,
         259693,
         11674,
         691,
         210479,
         267935,
         10735
      ],
      "original_title": "Make Mine Mink",
      "runtime": 101,
      "poster_path": "/sEkbKbiCZHdAbkUATAmk76096hY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "The Rank Organisation",
         "id": 364,
         "origin_country": ""
      }],
      "release_date": "1960-08-09",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "A jolly good show indeed.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Asher"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Peter Coke",
         "Michael Pertwee"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0054049/",
      "coverLink": null,
      "actors": [
         "Terry-Thomas",
         "Athene Seyler",
         "Hattie Jacques"
      ],
      "reviews": [
         "The last time I saw this film was about 40 years ago when I was a kid. My sister and I would watch movies on Channels 9 and 11 in NYC and we saw Make Mine Mink about 3 times, I figure. Since then, I have unsuccessfully sought it in movie stores, like a man wistfully returning to the haunts he frequented with his first love, hoping against all odds to catch another glimpse of her. Part of my curiosity is determining whether I would think it as funny today, and my sister wonders the same thing. Terry Thomas was an absolute favorite of mine back then, too, and I haven't seen anything of him on TV for a long time. So what's this got to do with the movie itself? Well, it's just that kind of film. There's such a combination of comedy, sweetness, surprise, and intelligence in it that it sticks with you for a long time. The combination of the odd British major living in a rooming house with an extraordinary collection of women, the craziness of their plans and the situations they get themselves into, and the smart understating of the comedy that was such a British specialty before they became so self-conscious about that particular gift, make it a rarity in more ways than one.",
         "Very odd film. The sort of film that only the British could make. Terry-Thomas is cast out of his usual flash, boisterous role as the rather timid Major Rayne, down on his luck and living in a boarding house with the weirdest collection of women you're ever likely to see, including a very young Billie Whitelaw and a masterful Hattie Jacques. By pure mischance, they embark on a campaign of fur robbery in order to support their landlady's charitable work. The film is a wonderful caricature of the down-at-heel gentry in Britain at that time, includes some very endearing characters and is genuinely funny in its naive fashion. Recommended to any fan of the wonderful Terry-Thomas and British comedies of this era.",
         "For no reason I can fathom, this title recently popped into the disordered clutter of my memory. I haven't seen it since those halcyon days in Southern California, before multiplexes, when admission prices were affordable on a frequent basis, and when the area where I lived had theaters that booked all sorts of films from all over the globe, or so it seemed. It's one of the few films I went back to see almost immediately, since the uproarious laughter it provoked obscured some of the dialogue during my first viewing. Terry-Thomas and his female partners-in-crime are truly hilarious and, for me, the special bonus of two of my favorite British character actresses, Irene Handl and Hattie Jacques, appearing in a film together, made this one of those gems I'll never forget. The slapstick elements are handled with that special brand of wit for which English comedies are noted and the modest production values actually enhanced the fun. I note that it's not currently available from American purveyors to the U.S. video market, but a DVD is offered in the U.K. Guess it's time to discover what's involved in exchange rates, international shipping, and so forth. It should prove worth the effort to renew a happy memory.",
         "Saw MMM more than 300 times (yes!) because it has enough in it to amuse, interest and make you wish you lived with these zany, big-hearted misfits. Bored, would-be good-doers, Dame Bea and her lodgers get caught up in just the opposite when excitement turns up unexpectedly on their front doorstep (literally). Then, there's no stopping them--altho they do bungle nearly every heist. Yes, they must (à la Robin Hood) steal from the rich to give to the poor. And poor Lily, the ex-inside maid, trying to stay on the good side! The actors, all lovable, eccentric characters, are too good to be true, with special kudos to the female quartet (Athene Seyler, Hattie Jacques, Elspeth Duxbury, Billie Whitelaw--in the flower of youth and yet already on her brilliant way to HER BRILLIANT CAREER) and their grumbling but more than willing hero (Terry-Thomas). Picture the latter in gangster attire in front of a sleeze bar--better than the entire scene inside it! Or Elspeth being \"attacked\" in her bath (Oh, how she wishes!) by a couldn't-be-further-from-his-mind! Or, maybe best of all, a stunning, long-haired blond, high-heeled Hattie Jacques (that's right) just AFTER her firebomb goes off in a plush fur shop in the Kensington District of London. But there are SO MANY perfect scenes in this nearly perfect film (after 300 times you pick up 3 or 4 technical bloopers, but who cares?), it is impossible to single them out without telling the whole film. My only question is: Why isn't it a FILM CLASSIC? Marya Berry, Film Buff and Critic",
         "Just saw it on TCM. It was much funnier than I expected. It is unusual for a slapstick comedy to have so much sympathy for the characters. You really get to like them. Even the love interest is well done. Its well worth watching. Terry Thomas is superb. As good as I remembered him from my misspent youth. The three women who worked with him were also very good. I didn't remember any of them but will look for them in the future. It is a shame that the wondrous tradition of British comedies disappeared. From Guiness to Sellars to Margaret Rutherford. The Remake of The Ladykillers proved just how good they were. It is amazing how even a fine actor like Tom Hanks was unable to match the quality of the original movie.",
         "Oddball British humor is as quirky as it gets in MAKE MINE MINK about a former military man (TERRY-THOMAS) who organizes an unlikely band of fur thieves in order to help fund an orphanage. It's screwball farce on the highest level, as only the British could do in the '60s about seniors in a rooming house who decide to spice up their lives by joining a robbery plan that goes awry. Within a half-hour of various pranks involving a discarded mink coat, the eccentric roomers of a London boarding house decide to go in on a scheme of stealing fur coats to fund their favorite charity. A sub-plot develops involving BILLIE WHITELAW and a young policeman. She's reluctant to become his sweetheart because she has a police record and it could hurt his career. He scoffs at the idea. She, of course, knows nothing about the roomers' plans. The plot deals amusingly with all of the bungled fur robberies and the interplay between the eccentric boarding house characters who adopt different disguises for every robbery. One of the most amusing sequences has Terry-Thomas believing he's stumbled upon a den of thieves and fences so he can sell some of the stolen goods--until he realizes the patrons are all members of the Salvation Army. The fun is in the role playing and the clever script. It's played to the hilt by an ingratiating cast and ends on an ironic note after the burglar ring has sworn that they've committed their last crime. Summing up: Mindless fun all the way.",
         "Make Mine Mink is based on Peter Coke's West End play Breath Of Spring. The story centres around a group of odd-ball amateurs, who led by their aging landlady Dame Beatrice Appleby {Athene Seyler}, venture into crime by way of stealing valuable fur coats and then giving the proceeds from their crimes to charity. Joining the eccentric Dame is a has-been military officer {Terry-Thomas}, a larger than life etiquette instructor {Hattie Jacques} and a batty china mender {Elspeth Duxbury}. Oddly, and crucial to the plot of course, the house keeper is an ex-convict {sexy Billie Whitelaw} who is not involved. Just as well since her boyfriend is a Copper! This sets us up for a number of delightful sequences as our \"crims\" blunder into one caper after another, whilst trying to avoid capture by the increasingly baffled police force. The film even has time to homage The Third Man in one particularly funny scene as Thomas' Major Rayne goes in search of a \"fence\" for their ill gotten gains. There are so many great things about Make Mine Mink, but what stands out the most is that it's a testament to what good writing and a quality cast can do for a basic premise. More known for being the director of film's starring that bastion of Jerry Lewis a like British comedy, Norman Wisdom, Robert Asher keeps it simple and lets the cast run with the material. The pace never lets up and there is not one sign of filler or awkward padding. Thomas is revelling in being the sole male actor in the core group and both Jacques and Seyler light up the screen regularly {look out for an hilarious smoke bomb moment from Jacques}. But it's Duxbury's movie all the way, a relative unknown with only 7 acting credits to her name {she passed away in 1967}, Duxbury gives a performance of such high comedic quality, this film becomes a fitting and lasting legacy to her name. As Pinkie she runs everywhere, forgets everything and has all her co-criminals constantly in despair. It's a truly joyous turn that for me personally has become a highlight of my viewings this year. Available on Region 2 DVD, and part of the wonderful Terry-Thomas Box Set, Make Mine Mink should hopefully now start getting more exposure. It deserves it, a throwback to great British comedy days, and a film that's sure to have you grinning from ear to ear. 8.5/10",
         "This film is the very definition of the word \"droll\", and is one of my favorite comedies. The three residents of Dame Beatrice's rooming house don't really have a place in the world, and Dame Beatrice herself is upset that she isn't able to bring in the kind of money that she once did for all of her favorite charities. They all feel that the world has forgotten them until Lily, Dame Beatrice's maid, steals a mink from the veranda of a man who has tried to give it to his wife to appease her jealousy and his conscience over his extramarital affairs. Since Lily has a criminal record, Beatrice and her tenants are afraid she will be returned to jail, so they all work together to replace the mink without the owners ever noticing it was missing. When they are successful they realize it would probably be just as easy to steal furs as replace stolen ones and use the proceeds for Beatrice's charities. This gives all concerned a purpose in life, which is all they have been seeking. The unlikely team of thieves makes many mistakes, but usually come away with the furs, and only give up the game when Lily discovers what they've been doing and makes them promise not to steal another fur. However, a call to Dame Beatrice from someone seeking further charitable contributions puts them back in action. However, they can't continue to steal furs due to their promise to Lily. Thus, they turn their attention to even bigger game at the end of the film. This film is a comedy completely without personal conflict - it is pure comedy and farce from beginning to end. All involved work together for the common good, and no selfish motives are ever seen, other than the desire to be useful. You keep waiting for one of the members of the little band of thieves to get greedy and want to keep at least some of the money for themselves, but it never happens. At a time in American cinema history when film noir was still popular, and crime dramas often had no sympathetic characters, it is strange to watch a film from this period in which all of the characters are sympathetic. This probably has to do with the difference between American and British culture, and also the period in British history in which this film was made. The British had just come through a fifteen year period in history after World War II in which they had attempted to remake British society, and in many ways had fallen short of the mark. The gentry felt displaced, but many of the common people didn't feel the inclusion they expected this displacement to achieve. Thus there were several British films from this period, such as \"The Smallest Show on Earth\", in which people banded together to fulfill a common goal that achieved nothing more than an affirmation of their own usefulness. This is one of those films, and I find it not only funny, but completely charming.",
         "Paris used to be the place where you can see all sorts of \"rare\" films. But how comes we always have Man in the White Suit and Ladykillers when it comes to British comedy ? I discovered Terry-Thomas in the Dr Phibes movies (IMDB kindly tells me he's showing as well in that great French war classic, La Grande Vadrouille. How silly of me) and, rather charmed by the gap between the teeth, bought a Terry-Thomas DVD set in London. Mark that, readers ! It contains Make Mine Mink, Too Many Crooks and Naked Truth. They're all very good but Make Mine Mink has the very special charm of its female cast, from oddly beautiful Billie Whitelaw to wonderful Hattie Jacques (and a special mention to Penny Morrell in a faultless dumb blonde part).",
         "I give \"Make Mine Mink\" 10/10, because it enchanted me from the first time I saw it on WOR back in 1968. I was a youngster then, and found it very engaging. And you know what? Things have not changed! The movie sports a terrific cast, led by Athene Seyler and Terry-Thomas, and they make the movie tick! While the plot may seem unrealistic, it IS a comedy, and its purpose is to make one laugh. It is also clear how the movie is as much a spoof of the British establishment, and a commentary on the redundancies that so many Britishers felt after World War II. Some people might find the movie dated, because it was shot in 1960, but that adds to the charm. The jazzy soundtrack music really adds to the overall cool ambiance, and is reason alone to give the movie high marks. \"Make Mine Mink\" remains a personal favourite, even after all this time!!",
         "A warm view of the criminal temptation as seen through the eyes of the comic displaced. Fine team performances, particularly from the female cast members, topped off by a Terry-Thomas character out of his own flawed top-drawer. A real treat for those who like their view of the British as slightly off-centre, warm and hypocritical...which is not a bad summary of the national character. Kenneth Williams in an early appearance shines as a character that he never really succeeded in developing for the screen but which points to a keen comic enjoying himself in very good company. Billie Whitelaw playing against type is also a revelation in a role that hints strongly at the type of role that she made her own in films later in the decade",
         "I liked this. I suggest you reserve it for a time when you want something that isn't much work in viewing (which means that 1960 is about the latest you can consider). The structure is a familiar one: we watch a bunch of actors portraying unlikely characters who themselves play unlikely characters precisely as far away. The joke of course is in the overlap, and the competence of the first contrasted with the incompetence of the second. Its all about coats and appropriation. There's an interesting performer here, one I haven't seen before. She plays a painfully reserved spinster who's occupation is mending broken china. Her character, Pinkie, is immensely inept and most of the polished humor (this was a successful stage play) is hers. We are introduced to her when the silly major breaks in on her bath because she has extended into his time. This is moments after having the first long segment of the movie linger on the sexy, pretty maid. And we see a naked skinny old maid in the bath. The major is retired from his duty as commander of \"portable baths.\" That's the attention to detail you'll find in how this humor is constructed. Anyway, Pinkie (with the wonderful name of Elspeth Duxbury) only lived a few years after this. Too bad. Ted's Evaluation -- 3 of 3: Worth watching.",
         "Now, all you anti-fur advocates and animal lib people relax. I agree with you. But this is just an old b&w British comedy about some old folks who steal fur coats, and not likely to start a run on mink, fox, ermine or whatever. But it is a funny and charming story and might start a run on old-age pensioner crime (.... joking!). It shows, albeit tongue in cheek, that planning, implementation and initiative are not the sole properties of the young. The scene in the waterfront cafe with the pearls is the best part of the movie. Terry Thomas is in his element. Also watch out for the inimitable Kenneth Williams later on as a fence.",
         "I begin this by turning first to a review by BARLEEKU, who called this film a 'rarity' back in'05. I also have very similar relation to this film, having grown up in NYC, and - like him - seeing MAKE MINE MINK, on our local Channel 9's late night movie. I'd not seen this film in many years. I only had bits of memories of this film. For me, time has made it better, as, having recently got hold of a copy (which, for some reason, is very hard to do, here in the states). Back then, I remember (as well as a kid can) there was a whole gay humor subtext. Having seen the film now, I can appreciate it so much more. Two of my favorite actors - Hattie Jacques (pronounced 'Jakes') portrays the full figured Nanette Parry - who gives a slight lecherous look as she gives young debs etiquette lessons, and the MARVELOUS Kenneth Williams, as Freddie Warrington, the fence. For those who don't know much about these two great actors, they both costarred in many of the CARRY ON films, with Jacques usually playing a 'matron' character, and Williams, as an effete. Williams had previously done incredible work in a BBC radio show, ROUND THE HORNE, in which he and Hugh Paddick played Julian and Sandy - two (ahem!) chorus boys, who spoke in the slang speak of Palori, as, homosexuality itself was illegal in the UK until '67, so, for those 'in-the-know' listeners, it gave a whole other level to the action. Here, Williams (whose voice/dialect work is legendary) is the 'fence' for a bunch of old women (and one man, the terrific Terry-Thomas), who steal furs - for charity. I must also say how much I love Athene Seyler - who plays Dame Beatrice Appleby, whose apartment all the rest live in. As was pointed out elsewhere, she was the oldest cast member, and outlived them all (she passed away at age 101 in 1990. Bravo! (I recommend you see her tell a story about a hat on YouTube - extremely funny, and she was much older than she was here). This film hearkens back to a lost time, and a very specific type of film we'll not again - the caper films, such as The Ladykillers (the original NOT the remake). It also throws a light on the legendary Rank Films, from which sprung so many of the UK's best and brightest talent. Several people have commented how they felt this story didn't 'hold up.' I disagree - wholeheartedly. Just as Shakespeare's stories have 'held up,' or, Gone With The Wind can STILL bring grown men to tears, so does 'funny.' It might not be the type of humour the commenter likes, or understands, but, that does not mean funny isn't funny. I'm NOT comparing Make Mine Mink with those 2, directly, but, things which move a person - no matter which way - sad, happy, etc., that does not change. As for the commenter who found certain aspects 'unbelievable,' I'm always amazed; why do those types even GO to see a film, which is all about escape? (I'll even go so far as to say it reminds me of someone who saw The Spy WhoLoved Me. Nothing in the film - none of the daredevil, UNrealistic situations, or such bothered this person - except, the white Lotus - ONLY when it drove up on shore. They actually quibbled NOT about the car turning into a sub, but, that it could then manage to survive AND then be drivable. I laughed at this person - YES, this is a true story - because, the point is, 'enjoy the film, and don't strain your brain). In this caper film, the fur stealing, is irrelevant. It's a joy to see these actors - and the rest of the cast perform. As it's over six years since BARLEEKU wrote his review (where he wondered if seeing MAKE MINE MINK all these years later, would it still hold up - I have to say 'yes.' The film, which was based on the book BREATH OF SPRING, by Peter Coke, was turned into the Broadway musical 70, Girls, 70, by Kander and Ebb.",
         "A n early 60's British \"caper\" film, that never fails to make me laugh, whenever I get the rare pleasure of seeing it. Tery Thomas, and a cast comprised of mostly (hysterical) old women plot to rob a bank. Where most movies today are not character driven, this little slice of silliness shows the care that was once put into film, even in what would've been considered a \"B'\" film. The comedy here is verbal, a little bit slapstick, and as such a lot will pass you by if you don't pay attention. One of my favorite little jokes involves a rather bosomy mature woman (who is quite obviously a lesbian, but being as this is the early '60's, and also being England), it is alluded too, rather than spoken. Her \"job\" is to \"teach\" young debs(?) how to act like a lady. At one point one of her \"pupils\" leaves her \"lesson,\" and the look she gets from the \"teacher\" is hysterical. You know exactly what she's thinking. Very few comedians excel at making you laugh simply with a look (only two that come to mind are Lucille Ball and Molly Sugden- from Are You Being Served?). The whole movie, which is relatively short will leave you with a smile on your face, and fond recollections, which after all - isn't that what a good movie should do?",
         "Charming comedy about a bored group who board with Dame Bea (Athene Seyler) in an apartment. She supports many charities but has now run out of money. Through a series of events, they hit upon the idea of stealing fur coats and selling them to a fence so that she can continue to support her charities. The others are all bored so they go along ...since it's for charity. Implausible plot makes little difference as this disparate group of oddballs start their series of robberies. Subplot has Dame Bea's maid (Billie Whitelaw) who has a prison record, falling for a cop (Jack Hedley). The robberies are masterminded by the Major (Terry-Thomas) who calls on his military experience to plan the robberies, including all manner of disguises. Because they have no police records, they rob shops and gambling joints right under the cops' noses. The cast is uniformly excellent is this bit of craziness. Terry-Thomas and Athene Seyler turn in star performances, matched by Hattie Jacques as Nan and Elspeth Duxbury as the hapless Pinkie--their cohorts. Others in the cast include Raymond Huntley as the inspector, Irene Handl as Spolinski, Penny Morrell as Gertrude, Sydney Tafler and Joan Heal as the neighbors, and May Hallatt as the old lady. Kenneth Williams also shows up as the fence. The ending is priceless.",
         "It's all smiles, only interrupted by occasional bursts of laughter, in this wonderful 1960 British comedy. \"Make Mine Mink\" is an assemblage of some of the finest comedic actors of the time located across the pond. Three misfits are roomers or spongers off the good-hearted Dame Beatrice Appleby. She is known for her charitable work and donations, especially for orphans. But she's getting tired and running low on funds. Terry-Thomas is Major Albert Rayne, Athene Seyler is Dame Appleby, Hattie Jacques is Nanette Parry and Elspeth Duxbury is the riotously hilarious Pinkie Pinkerton. Billie Whitelaw is Lily in a nice supporting role, and some others contribute to the film. But, all the fun is in the mink heist gang – the major and his molls. Strange circumstances turn this group of otherwise law-abiding citizens into modern Robin Hoods. All the proceeds from their capers go to help the poor children. So, naturally, we in the audience pull for them to succeed in crime. Yes, we must admit it. And, it's such a hilariously funny, madcap film. It could be broken down into several individual skits. We never learn where or how the characters in a film like this come up with all the costumes and props they use for their heists. But that would spoil the show. So, it's just much, much fun to sit back and watch and listen and laugh at the delightful goings-on. What a wonderful comedy this is. It's a sure cure for the doldrums and earns my top rating of 10 stars. This is a comedy that should never grow old or wear out.",
         "Don't pay attention to the \"stick in the muds\" previously expressing their inability to enjoy this fantastic film. I've watched a lot of movies over the past 50 years and let me say, without question, this is my favorite movie of all time. Admittedly, I love early 60's British humor and films. This classic is humor all the way. I won't put in any spoilers but would say that the actors in this film are perfect for comedic escapades. The \"old Dame\", Retired Colonel who was in the Bath division, heavy set Charm school teacher (who my grandfather used to say had legs like a piano) and the mousy china repair flatmate , Many appear in other classics of this era. If you do enjoy this film, which I love, I would also recommend the movie \"Doctor in the House\" with Dirk Bogarde 1954",
         "It's just as well the charming and beguiling Billie Whitelaw is included in this rather knockabout farce, as well as a number of other expert players who can similarly overcome both the over-talkative dialogue and the rather long time it takes for the movie to actually start moving! In fact, it's chiefly the cast that makes this entry worth watching. Even the minor roles are expertly filled. You can spot Kenneth Williams giving one of his typically fruity portrayals. Hattie Jacques, as always, is a delight. Alas, Robert Asher's director, while it does have some inventive touches here and there, tends to be slow and heavy-handed. However, other credits are serviceable and production values are well up to \"A\" standard.",
         "While I'll admit that \"Make Mine Mink\" starts off a bit slowly (especially since the opening song is VERY annoying), as the film progresses, it becomes quite original and funny. The film is set in a boarding house in Britain. At first, the viewer thinks the film is about the servant, Lily, as you learn that she's an ex-con who is trying very hard to turn over a new leaf. However, the film blind-sided me, as the three boarders and the lady of the house, all respectable folks, decide, on a lark, to steal mink coats from a local store! They find it exhilarating and cannot stop--and they soon begin pulling one job after another. It's actually amazing that they are as successful as they are, as the quartet are made up of some serious bumblers--and there is where the comedy is at its best. I could say more but think it's a film you just need to see for yourself. Suffice to say that the film must be funny if Terry-Thomas ISN'T the funniest cast member!",
         "This is a real period piece (circa 1960) which hasn't aged as well as some of its contemporaries (eg its companion pieces Too Many Crooks and The Naked Truth). It has a splendid cast (the \"gang\" are all female apart from Terry-Thomas at his peak) and they act their socks off. But their immense and varied talent - both Hattie Jacques and Billie Whitelaw have major roles - have to contend with a script which must have seemed a little too contrived even at the time, and which now looks as if it came from another planet. It's of course practically a given these days that Ealing and its counterparts were mildly subversive of the established order. But for a group of down-at-heel members of the upper-middle class to fund orphanages by stealing fur coats? Is there a satirical subtext here? Did the jokes seem funny at the time? As I say, the performances are to be admired, as is the hidden or even subconscious feminist agenda, but I found it mildly bewildering - and this is the world I was born into. Perhaps we need a radical remake.",
         "Make Mine Mink (1960) This has such an affected style—even in British terms, with an extreme use of accents and affectations, it seems to me—it's tiring. It's a comedy, so this is the worst of offences. Is it funny—I suppose so. In fact, I bet that some people absolutely die watching this. But I tried three times and found the style so forced and, well, stupid, that I never liked it. But is it funny? Yes, in a madcap way. But it's not really funny lines or clever comments, plays on words and whatnot. It's more the way things are delivered that matters, and that is largely a matter of whether you can adopt the style of speaking here or not. The plot, if you can call it quite a plot, is a matter of some bumbling blokes and gals who have decided to commit a crime. They get away with it, sort of, but are out of sorts and perplexed by the situation they are now in—the guilty! In all this is a parlor room story, a play adapted to the stage. So it's constrained from the get-go. My advice is simple—give it ten minutes. If you like it, and can stand the unbearable lead male (Terry-Thomas), you might make it to the end. If not, run, and fast!",
         "Four people steal expensive fur coats and provide the proceeds from their subsequent underground sale to the needy. Terry-Thomas, Seyler, Jacques, and Duxbury are delightful as the bumbling Robin Hoods, making for an enjoyable farce. Also fine is Whitelaw, who resembles Janet Leigh, as a reformed convict. The script is uneven, however, as moments of amusement come only sporadically. A highlight is the scene where Terry-Thomas, who was a master of these types of roles, tries to find a buyer for the stolen goods and ends up at a hilariously wrong destination. On a trivia note, Seyler was by far the oldest of the four actors who play the crooks but outlived them all, living to age 101 while Jacques and Duxbury died before 60.",
         "As some people would say, this is good film for a rainy night, but I don't understand all the rave reviews about it. \"Make Mine Mink\" looks like an episode of a television series where the same cast is used in different histories. I think that for really enjoying this kind of film it helps being familiar with the actors (and their former/later works). For instance, a reviewer had a lot of fun in seeing \"a stunning, long-haired blond, high-heeled Hattie Jacques\" and another reviewer says \"Terry-Thomas is cast out of his usual flash, boisterous role as the rather timid Major Rayne\" and so on. There's also the cultural/national factor. British humor can be difficult to understand in other countries. In my case, I like the sophisticated British humor that is present in many films, even in those that could not be labeled as comedy. \"The Servant\", for instance, presents a more sarcastic, cruel humor, that I appreciate as well. But \"Make Mine Mink\" belongs to the category of television humor, not quite so refined. It has a good story, with a strong theatrical flavor, very dependent on the charisma of the actors (so beloved by the audience, as the reviews prove). Anyway, one can feel that the actors are at ease and are given opportunities to improvise. All in all, \"Make Mine Kink\" is a mildly funny film but no more than that.",
         "I thought I might have seen it before but it wasn't until the cute maid, Billie Whitelaw, flung herself on the couch and her nightgown flew open to reveal her shapely legs that I recognized a scene. None of the other scenes seem to have registered much. The slightly batty Athene Seyler runs a boarding house in London. Her guests include Terry-Thomas, Hattie Jacques, and Elspeth Duxbury. Billie Whitelaw is excluded from the gang that the others decide to form in the name of charity. It's intermittently amusing. The Brits were making some superlative comedies during the 50s. They could turn a crummy, smoggy factory setting into a huge joke, as they did with \"The Man in the White Suit.\" \"Make Mine Mink\" depends more on obvious puns, faux pas, and obvious awkward situations. A woman is trying to light a smoke bomb and it blows up in her hands, leaving her pop eyed and in blackface. How can this compare with the explosion scenes in the Guiness movie? I suppose it shouldn't. Nothing can match the best of the Ealing comedies. This should be compared to the \"Carry On\" series. It comes off better because it's not quite so silly. The other great tradition in British comedy -- the Monty Python series -- I leave to the philosophers. It's sometimes funny, occasionally frantic, as the repetitious musical theme tells us over and over. It's diverting without being in any way memorable. To compare it to \"The Lady Killers\" is a sacrilege."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Rank Organisation, The"],
      "summaries": ["Zany collection of misfits led by aging military man (Terry-Thomas) go on a spree of robbing mink coats. An unlikely trio of women (Athene Seyler, Hattie Jacques, and Elspeth Duxbury) find new reasons to live ... until their housekeeper (Billie Whitelaw), an ex-con is suspected of the robberies."],
      "budget": 0
   },
   "movielensId": 125447,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1960-08-09",
      "dvdReleaseDate": null,
      "directors": ["Robert Asher"],
      "runtime": 101,
      "movieId": 125447,
      "title": "Make Mine Mink",
      "mpaa": null,
      "actors": [
         "Terry-Thomas",
         "Athene Seyler",
         "Hattie Jacques",
         "Billie Whitelaw",
         "Elspeth Duxbury",
         "Jack Hedley",
         "Raymond Huntley",
         "Freddie Frinton",
         "Kenneth Williams",
         "Irene Handl",
         "Penny Morrell",
         "Sydney Tafler",
         "Joan Heal"
      ],
      "imdbMovieId": "0054049",
      "originalTitle": "Make Mine Mink",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["EDPnXB9EB-Q"],
      "plotSummary": "In a mansion block in Knightsbridge, a gang of middle-aged biddies decide to brighten up \"the dullness of the tea time of life\" by staging a series of robberies on furriers, then donating the proceeds to charitable concerns. Terry Thomas as a retired army officer leads the gang, which includes Athene Seyler and Hattie Jacques, on a series of capers that nearly go awry when their maid, Billie Whitelaw, an ex-con and also a resident of the block, falls for a police officer.",
      "tmdbMovieId": 44023,
      "avgRating": 4,
      "releaseYear": "1960",
      "numRatings": 1,
      "posterPath": "/sEkbKbiCZHdAbkUATAmk76096hY.jpg"
   }
}