{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Kaplan"],
      "runtime": 240,
      "synopsis": null,
      "writers": [
         "Truman Capote",
         "Benedict Fitzgerald"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116619/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5MDc4ODg5Nl5BMl5BanBnXkFtZTcwMzc4NTYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anthony Edwards, Eric Roberts, Sam Neill | See full cast and crew »"],
      "reviews": [
         "After reading the book, I happened across this DVD at Wal-Mart for 3 bucks and thought, sure, what the hell... I got the DVD and watched it last night. When I started watching it, I checked the run time and it was about 90 minutes. I thought, OK cool... It seemed to run rather slowly, knowing the story and how much of it there was. By the time I got to the actual killings, I was like, \"how much time does this have left?\" Checked. \"One minute?! What the hell?!\" I felt incredibly cheated, thinking that the movie only progressed through a third of the overall story. But then, I happily noticed that the DVD's scene selection menu included a part 1 AND a part 2. I still had another hour and a half to go! I then sat very happily and enjoyed the second half of the movie, even more so than the first. I admit that I have not seen the 1967 original film (despite my sincerest desire to), I have however read the novel and felt that this was a fairly descent film, for a two-part TV miniseries, that is. I think the casting of the role of Perry was completely wrong and a few minor inconsistencies jumped out at me, but still very well done. The first half drags on a bit, while the second half is much more gripping. I think they should have proportioned the movie more like Capote did his book: 1/3 before the murders, 1/3 after, and 1/3 after the killers are arrested. Instead, the film makes it more 1/2 before the murders, 1/4 after, and 1/4 after the killers are arrested. Again, this makes the second half more exciting, but at the same time, less compelling while making the first half drag on and on... Now I look back and realize I have just made the same mistake about making things drag on and on, so I will shut the hell up. Go watch the movie and make up your own damn mind! Nick Houston",
         "There is absolutely NO reason to waste your time with this \"film\". The original said it all and still holds up. Either read the book or do some research about the story, and you'll realize this remake is ludicrous. Eric Roberts as Perry Smith? His sister could have done a better job! Having been to Holcomb & Edgerton, KS where the story takes place, the sets and locations looked NOTHING like Kansas. The original is riveting, from the location filming to the use of the actual participants, weapons and victims belongings. Unforgettable performances by Scott Wilson and Robert Blake. Soundtrack by Quincy Jones and cinematography by Conrad Hall...The original is available on DVD in widescreen now. Let this turkey die a quick death.",
         "In Cold Blood was one of several 60s films that created a new vision of violence in the Hollywood film industry. Capote coined the phrase \"nonfiction novel\" to describe the book on which this film is based, and the spirit of that form was carried over into the film script, which he co-wrote. Despite the fact that we were well into the era of color film, Richard Brooks elected to present this film in black and white to underscore both the starkness of the landscape and the bleakness of the story. This is the first problem with the TV remake --color changes the tone of the story. In addition, the confinement of shooting a film for TV makes reduces the options of how the shots are framed and focused. As a result, we lose the dramatic clash which makes the second part of the original film (police interviews, trial, imprisonment, and execution) so claustrophobic. On the small screen, it's just another version of Law and Order spin-offs. Hollywood's search for scripts continuously takes it back to movies that were successful in another age. Usually, that's a mistake, and this is no exception. All of the actors are competent. The script is OK. The directing doesn't get in the way. It's just that the movie doesn't work as well as the original precision instrument. It doesn't hook the viewer into the ambivalence toward Smith and Hickock that the original film provokes. At the end of the TV version, we are left with the feeling: \"Ho hum, who cares?\" See the original first, on as large a screen as you can, then watch the TV version simply to understand why the first one was such an important film in 1967. Wouldn't hurt to also go on line and read a bit about Capote and the original book. It will help you to understand the extraordinary effort he put into the material, and also some of the controversy surrounding both the book and the movie. I actually only gave this a 4 because I save the bottom 3 rankings for true bombs--the kind that enrage you about having been sucked into spending an",
         "Meticulously detailed, way too much so, making this a very long and drawn out version of the famed novel. It's admirable they wanted to include as much of the book in the film, but sometimes being more selective in what you include is an asset in a movie. It does have respectable period detail, and it is well acted by everyone, good cinematography. It's main problem is it's extreme length and the fact it takes way too long to climax. . Still, there are rewarding moments along the way. It is surprisingly subdued and non violent. The 1967 Richard Brooks version is far better and much shorter. Check out a very young Ryan Reynolds who plays Bobby Rupp.",
         "This two-part TV mini-series isn't as good as the original from 1966 but it's solid. The original benefited from a huge number of things---it was all in black and white, it had a great jazz score and it was filmed at the real locations, including the home of the doomed Clutter family. That was important because in the book and in the original movie the home is very much a character itself. This remake was filmed in Canada which I guess doubles okay for Kansas. The story tries to be as sympathetic to Perry as it dares to and Eric Roberts plays him as a somewhat fey person, his homosexuality barely hidden. The gentler take by Roberts doesn't quite work in the end though because it's hard to believe that his version of Perry Smith would just finally explode in a spasm of murder. Whereas Robert Blake's take on Smith left you no doubt that his Perry Smith was an extremely dangerous character. Anthony Edwards was excellent as the bombastic, big-mouthed and ultimately cowardly Dick Hickcock, the brains of the outfit. His performance compares very well to Scott Wilson's role in the original movie. Since this is a longer movie it allows more time to develop the Clutter family and in this regard I think the 1996 movie has an advantage. The Clutters are just an outstanding, decent family. They've never harmed another soul and it is just inexplicable that such a decent family is ultimately massacred in such a horrifying way. It still boggles my mind that, after the Clutters were locked in the bathroom, that Herb Clutter didn't force out the window so at least his children would have a chance to escape. This movie has the thought occur to him, but too late. From what I read about the real home, which is still standing, the way the bathroom is configured they could've opened the counter drawers and effectively barricaded the door which would've forced the killers to blast their way in. But it might've bought time for some of the Clutters to escape. Why the Clutters didn't try this, I have no idea. Fans of the book will recognize that this movie takes a lot of liberties with how the crime is committed but not too serious. Still, it's distracting to viewers like me who have read tons about the case. The actors playing the cops, led by Sam Neill and Leo Rossi, are uniformly excellent, much better, I think, as a group, than the actors in the original movie. They know that to secure the noose around the necks of both of them they have to get them to confess. And the officers come to the interview impeccably prepared. They had already discovered the likely alibi the phony story of going to Fort Scott, and had debunked every jot of it. The officers then let Smith & Hickcock just walk into their trap. Hickcock is a b.s. artist who figures he can convince anyone of anything and the officers respectfully let him tell his cover story. But when they lower the boom on him, he shatters very quickly. It's very well filmed and acted and very gratifying to watch because the viewer naturally should loath Hickcock in particular by this point, a cowardly con-man who needs the easily manipulated Smith to do his killing for him. Supposedly Hickcock later stated that the real reason for the crime wasn't to steal money from the Clutters but to rape Nancy Clutter. At least she was spared that degradation. The actors playing the Clutters are very good, Kevin Tighe as Herb Clutter in particular. The story sensitively deals with Mrs. Clutter's emotional problems, most likely clinical depression, and Mrs. Clutter displays remarkable inner strength when she firmly and strongly demands that the killers leave her daughter alone. From what I've read the Clutters' surviving family was particularly bothered by how Bonnie Clutter was portrayed in the book, claiming it was entirely untrue. But as an aside, both of the killers related to the police how Mr. Clutter asked them to not bother his wife because of her long illness. Capote might make up that fiction to make the character of Bonnie more interesting but certainly the killers had no reason to falsely portray Mrs. Clutter and no doubt much of the conversation in the book (duplicated in the movies) is right off the taped confessions of the killers. So it would've been nonsensical for Herb to have said that and not have it be true.",
         "I am from Sweden and i have just seen this movie and the thing is that i thought it was okay. I have seen many bad comments about it but you must remember that a lot of people that watch this two parts miniseries are located all over the world and not just in USA. Also remember that not everyone has ever heard of the film made in the 60:s and maybe not in the events(murders). And even more...that it can be hard to find the original movie and if so there always be people around that doesn't like black/white films. This one feels fresh and in color and will find its public. Its 12 years old now but i just saw it for the first time. I will try to find the first one if i can to compare them but i haven't seen it anywhere in Sweden. Ofcorse there is internet but not for anyone in the world. The thing here is that this is mostly part of an American crime-history and was big in the 50-60:s in just USA but in rest of the world it just past by i guess. Well it was told about for some time but 40 years later it will fade away in for example Europa cause time goes by. We had our own problems and crimes so if someone will do a remake of the film and put it back in some light again its not a bad idea at all. A new generation can take part of this horrible story and even the film about Capote that was released just a few years ago witch was a pretty good film too i think. It will boost interest to the events that took place some 50 years ago and maybe stop it to fall in sleep. It started me up and now i am looking for the Robert Blake-version so it wasn't that bad...huh? This are my opinions. Some people will of course disagree but hey...its okay. Sometimes there will be okay with remakes on old films. Its not every time the old ones are that good. The film-making techniques has developed a lot and scenes can be made more realistic if they want today. Its always a question of money of course. There has been so many movies that were made in the \"good old days\" but there were also money missing, bad directors etc, and they remakes them today (50 years later) and suddenly they are okay to watch. My friend got this box of old classic horror-movies and s/f and i cant say i was impressed of the so called good old days. Most of them you cold put in the trashcan directly. They were so bad that we just sat there like zombies...could not move...like brain-dead. I cant recommend them to anyone. Some of them i have seen remakes of and i remember liking them...but not the originals. They were just painful awful. This is like the old story of who was the best Bond...Moore or Connery...I think if you see Roger Moore first you maybe find him the one to trust or like... Thanks for me and i am sorry for my English, thats not so good. /Lars from Sweden",
         "I had \"In Cold Blood\" set up to auto-record on my TiVo so I wouldn't have to keep searching for it. Lo and behold, it showed up as having been recorded. To my dismay I found this 1996 Hallmark TV movie remake instead of the 1967 theatrical film. The original movie was an Oscar magnet, earning four nominations, and rightfully so as it's a taught, compelling adaptation of Capote's novel in three acts. This one is mired in the same mediocrity that besets nearly all made for TV movies. It's all the film that's print to fit . . . the alloted TV time slot . . . with uneven, mired down pacing that geared for commercial breaks and splitting it into two parts. Add to that the mediocre small budget production values and compromises made to conserve budget, using 2nd and 3rd string actors, with a Roger Corman School \"make 'em dirt cheap\" director, and the result is a dull plodding movie that can serve as a perfect substitute for sleeping pills. This is a movie remake that should NEVER have been made! CBS should have gotten the rights to the original 1967 film and broadcast it instead, and saved us from this worthless drivel being rebroadcast on the Hallmark Channel.",
         "Not a bad remake of Richard Brooks' gritty black and white classic, albeit somehow trivialized by being in color. but whichever nincompoop cast this film should be sentenced to a trip to The Corner, for the offense of casting Kevin Tighe as Mr. Clutter. Blond, shifty-eyed and simply oozing perverted menace, he is far more terrifying than Dick or Perry at their most psychopathic. If the real Mr. Clutter had looked like that, Dick and Perry would have taken one look at him and run out of the house screaming. Now that I think of it, it would have better for all the Clutters if he had. Where was Lynn Stalmaster when we needed him?",
         "Although I generally do not like remakes believing that remakes are waste of time; this film is an exception. I didn't actually know so far until reading the previous comment that this was a remake, so my opinion is purely about the actual film and not a comparison. The story and the way it is written is no question: it is Capote. There is no need for more words. The play of Anthony Edwards and Eric Roberts is superb. I have seen some movies with them, each in one or the other. I was certain that they are good actors and in case of Eric I always wondered why his sister is the number 1 famous star and not her brother. This time this certainty is raised to fact, no question. His play, just as well as the play of Mr. Edwards is clearly the top of all their profession. I recommend this film to be on your top 50 films to see and keep on your DVD shelves.",
         "To me, Eric Roberts performance as Perry in this overlong version of \"In Cold Blood\" is outstanding and memorable. That is not to say that overall the performances are anything to nitpick about, it's just that Roberts is the one to watch. On the downside, the 180 minutes it takes to tell this tale of murder in Kansas, appears stretched to the max. It seems to take forever for Dick Hickock (Anthony Edwards) and Perry Smith (Eric Roberts) to reach their destination of Holcomb Kansas. On the plus side there is far more character development than in the original Robert Blake, Scott Wilson film. If this was 120 minutes, it would have been terrific. - MERK"
      ],
      "genres": [
         "Crime",
         "Drama",
         "History"
      ],
      "productionCompanies": ["Pacific Motion Pictures"],
      "summaries": [
         "At the end of the 1950s, in a more innocent America, the brutal, meaningless slaying of a Midwestern family horrified the nation. This film is based on Truman Capote's hauntingly detailed, psychologically penetrating nonfiction novel. While in prison, Dick Hickock, 28, hears a cell-mate's story about $10,000 in cash kept in a home safe by a prosperous rancher. When he's paroled, Dick persuades ex-con Perry Smith, 31, to join him in going after the stash. On a November night in 1959, Dick and Perry break into the Holcomb, Kansas, house of Herb Clutter. Enraged at finding no safe, they wake the sleeping family and brutally kill them all. The bodies are found by two friends who come by before Sunday church. The murders shock the small Great Plains town, where doors are routinely left unlocked. Detective Alvin Dewey of the Kansas Bureau of Investigation heads the case, but there are no clues, no apparent motive and no suspects...",
         "Just one thing: Dick and Perry went to the Clutters' house with the premeditated intention of killing everyone in the house, because they wanted to leave no witnesses. Since there was no safe, rage, frustration and machismo did spur them to kill the family for no reason at all, since they could have just left and hightailed it out of Kansas. Too bad they didn't, isn't it?"
      ],
      "budget": 0
   },
   "movielensId": 125481,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1996-11-24",
      "dvdReleaseDate": null,
      "directors": ["Jonathan Kaplan"],
      "runtime": 240,
      "movieId": 125481,
      "title": "In Cold Blood",
      "mpaa": "",
      "actors": [
         "Anthony Edwards",
         "Eric Roberts",
         "Sam Neill",
         "Kevin Tighe"
      ],
      "imdbMovieId": "0116619",
      "originalTitle": "In Cold Blood",
      "genres": [
         "Crime",
         "TV Movie"
      ],
      "youtubeTrailerIds": ["LALR_q6-8ks"],
      "plotSummary": "At the end of the 1950s, in a more innocent America, the brutal, meaningless slaying of a Midwestern family horrified the nation. This film is based on Truman Capote's hauntingly detailed, psychologically penetrating nonfiction novel. While in prison, Dick Hickock, 20, hears a cell-mate's story about $10,000 in cash kept in a home safe by a prosperous rancher. When he's paroled, Dick persuades ex-con Perry Smith, also 20, to join him in going after the stash. On a November night in 1959, Dick and Perry break into the Holcomb, Kansas, house of Herb Clutter. Enraged at finding no safe, they wake the sleeping family and brutally kill them all. The bodies are found by two friends who come by before Sunday church. The murders shock the small Great Plains town, where doors are routinely left unlocked. Detective Alvin Dewey of the Kansas Bureau of Investigation heads the case, but there are no clues, no apparent motive and no suspects...",
      "tmdbMovieId": 108716,
      "avgRating": 3.6,
      "releaseYear": "1996",
      "numRatings": 5,
      "posterPath": "/iMOsUS0gcdl9PX1nppstTxnDKJo.jpg"
   }
}