{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "circus",
         "id": 291
      }],
      "imdb_id": "tt0071968",
      "video": false,
      "title": "Parade",
      "recommendations": [
         111397,
         115647,
         108512,
         11378,
         98060,
         68528,
         92823,
         114006,
         117484,
         42720,
         57251,
         108634,
         84026,
         98636,
         73455,
         29268,
         46149,
         4595,
         91426,
         43338
      ],
      "backdrop_path": "/8J3Bj9xdGUO5m7O1PYiYt3OBhPi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Monsieur Loyal",
               "gender": 2,
               "credit_id": "52fe496ec3a36847f8199cab",
               "name": "Jacques Tati",
               "profile_path": "/v7mgMICZsziH0jT1i7htNRIO2Og.jpg",
               "id": 5763,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Elle-même",
               "gender": 0,
               "credit_id": "52fe496ec3a36847f8199caf",
               "name": "Michèle Brabo",
               "profile_path": null,
               "id": 228213,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lui-même",
               "gender": 0,
               "credit_id": "52fe496ec3a36847f8199cb3",
               "name": "Karl Kossmayer",
               "profile_path": null,
               "id": 228214,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lui-même",
               "gender": 0,
               "credit_id": "52fe496ec3a36847f8199cb7",
               "name": "Pierre Brama",
               "profile_path": null,
               "id": 228215,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Elle-même",
               "gender": 1,
               "credit_id": "52fe496ec3a36847f8199cbb",
               "name": "Pia Colombo",
               "profile_path": null,
               "id": 228216,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Lui-même",
               "gender": 0,
               "credit_id": "52fe496ec3a36847f8199cbf",
               "name": "Johnny Lonn",
               "profile_path": null,
               "id": 228217,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe496ec3a36847f8199ca1",
               "name": "Jacques Tati",
               "profile_path": "/v7mgMICZsziH0jT1i7htNRIO2Og.jpg",
               "id": 5763,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe496ec3a36847f8199ca7",
               "name": "Jacques Tati",
               "profile_path": "/v7mgMICZsziH0jT1i7htNRIO2Og.jpg",
               "id": 5763,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53fa42e0c3a3687352003544",
               "name": "Karl Haskel",
               "profile_path": null,
               "id": 1356615,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "53fa42eec3a368735b0034e2",
               "name": "Jean Badal",
               "profile_path": null,
               "id": 26020,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "53fa42fbc3a36873580034de",
               "name": "Gunnar Fischer",
               "profile_path": null,
               "id": 6652,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "53fa430cc3a368734c0033d6",
               "name": "Aline Asséo",
               "profile_path": null,
               "id": 1356616,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53fa431dc3a3687352003549",
               "name": "Per Carleson",
               "profile_path": null,
               "id": 1308648,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53fa4329c3a368735e003616",
               "name": "Siv Lundgren",
               "profile_path": null,
               "id": 67522,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53fa4335c3a368734c0033dc",
               "name": "Jonny Mair",
               "profile_path": null,
               "id": 1356617,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53fa4340c3a368735e003618",
               "name": "Sophie Tatischeff",
               "profile_path": null,
               "id": 1344577,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.156714,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         }
      ],
      "id": 58655,
      "vote_count": 9,
      "budget": 0,
      "overview": "Two children go behind the scenes of a small circus.",
      "similar": [
         11360,
         55787,
         700,
         278927,
         12222,
         68728,
         1966,
         87,
         587,
         285783,
         316029,
         346364,
         112454,
         8982,
         136,
         761,
         8054,
         14001,
         1730,
         24808
      ],
      "original_title": "Parade",
      "runtime": 84,
      "poster_path": "/jwKXzKu2UtOAFDveceuRYGLc22t.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sveriges Radio (SR)",
            "id": 9138,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gray-Film",
            "id": 30931,
            "origin_country": ""
         }
      ],
      "release_date": "1974-12-18",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jacques Tati"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Jacques Tati"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0071968/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQyNjg5MjU5OF5BMl5BanBnXkFtZTcwMTM3MjcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jacques Tati, Karl Kossmayer, Pierre Bramma | See full cast and crew »"],
      "reviews": [
         "It felt slight the first time around, but, wow, this really is a great film. It now reminds me of two other television productions from great European directors around the same time period, Fellini's Clowns and Bergman's The Magic Flute. Many people love those films, both very mediocre in their respective directors' canons, but there seems to be little love for Parade. It is deliberately low-key, but I found a lot in it this second time. At first glance, it doesn't seem to be much more than a filmed circus performance. But there's more. We don't only see the performances, although they probably take up most of the screen time. We also see the performers backstage. We see how much they love to do this. Even during the intermission, when no member of the audience can see him, Tati performs one of his mime acts for his fellow performers. And, something I didn't pay much attention to the first time, these performers, when they're backstage - and sometimes when they're on the stage - are constantly painting, painting pictures, the sets, all kinds of things. Not only is this film about the love of performance, but the love of artistic creation. And not only is it about that, but it's also about the audience's joy of watching the performers, and, sometimes, their joy of interacting with the performers onstage. Parade buzzes with a sense of Andre Bazin's famed moment. There's so much beauty to be found. And then there's that gorgeous ending, with the little boy and girl re-enacting the circus performers as they break down their sets and disappear. What a magical image Tati has left us, his final of the cinema. I love him more than, I believe, any other director. He touches me deeply in my heart.",
         "This is a collection of circus acts with a fair bit of Tati's miming thrown in for good measure. It's not a BAD film. Some memorable sequences include Tati miming a tennis game (in slow motion!) and a collection of traffic cops around the world. I don't think the M. Hulot character really let Tati really stretch out and MIME. He is a fantastic performer and certainly as good as Marcel Marceau. The other performers and comedians, while not as famous as Tati, are still pretty good and cannot be said to let the film down at all. The main problem is that the premise is so basic. You can't really GO very far with this and Tati doesn't. It's basically just like watching a circus on TV. There's nothing to really glue the whole picture together. I agree with the reviewer that found the audiences 70's clothing interesting in itself.",
         "Tati was really going for something here, but I'm not quite sure what. He's being so subtle here that I couldn't really tell what his point was. The film is all about a circus, with performances by clowns, magicians, acrobats, jugglers, a band, and Jacques Tati. The different scenes vary in worth - the jugglers are awesome, but there's one sequence, where people try to jump on a pony and a donkey, that's very cruel to animals (although it ends wonderfully). One of the bigger disappointments of the film are Jacques Tati's mimes. Not that they're bad, but Tati fans have already seen them all. He impersonates a football player, a boxer, a tennis player, a fisherman, and an equestrian. This is how he first got famous in the 30s and 40s, by impersonating sportsmen, but at 70 something, his miming isn't as great anymore. And we've seen them all the way back to Watch Your Left and up to The Night Course. The action isn't just of the circus performers. Tati also goes behind the scenes of the circus and especially to the audience. A lot of the film, in fact, observes the audience. We get to know several of them as characters. The ending is quite great. It has the same bittersweet tone that all of Tati's endings have. I actually teared up a little, but that was mostly because I knew that this was the last time \"Une film de Jacques Tati\" would ever appear on screen. I didn't love Parade, but I certainly liked it. 7/10.",
         "This is a collection of circus acts with a fair bit of Tati's miming thrown in for good measure. It's not a BAD film. Some memorable sequences include Tati miming a tennis game (in slow motion!) and traffic cops around the world. I don't think the M. Hulot character let Tati really stretch out and MIME. He is very very good. The other performers and comedians, while not as famous as Tati, are still pretty good. The main problem is that the premise is so basic. You can't really GO very far with this and Tati doesn't. It's basically just like watching a circus on TV. There's nothing to really glue the whole picture together. I agree with the reviewer that found the audiences 70's clothing interesting in itself.",
         "Those looking for the sustained genius of Jacques Tati need to look else where. This is a wildly uneven filmed record of a circus performance. Tati acts as master of ceremonies and performs some of his music hall routines, while other circus people do their things. We also watch as \"off stage\", but plainly in view, the performers get ready for their routines and prepare props and paintings. Its an uneven mix that swings from very clever (hockey team with string quartet or the magic tricks) to dull (some of Tati's bits and say the polka band). Its best to have the remote ready. As I said at the start, those looking for the magic of the earlier Tati films are bound to be disappointed. That said there are some moments that are pure Tati such as some of the shots showing the audience filing in and being an audience, no one would dare show people being people other than Tati. There are some wonderful throw aways, the motorcycle helmets, the people trying to get into the right \"studio\" that play like deleted scenes from Playtime or M. Hulot's Holiday. They are small seconds long bits but they make wading through the dull spots worth it. Probably the weakest of all the films Tati made, its still worth a look for those who need to get a fix of Jacques Tati. I'd recommend renting it rather than buying it simply because its probably not going to be something you'll watch again, or repeatedly.",
         "\"Parade\" was the final film directed by Jacques Tati. It was made for television and featured Tati as a clown in a circus. The film was screened at the 1974 Cannes Film Festival, but was not entered into the main competition. As much as it pains me to say something bad about Jacques Tati, this is far from his best work. In fact, it more or less amounts to a televised special about a circus filled with mimes and acrobats. Should it be judged on the same level as the other films he made? No. Because, clearly, it was not intended for the same level of criticism. We do not judge Michael Bay for his milk commercials. Still a bit fun, even if the costumes are so obviously dated as the 1970s.",
         "Tati's last movie plays in and around a circus performance. You get to see the acts, good and bad, the artists behind the scenes and the audience, from entering the arena to the audience reactions. Two things strike you: The artists are always creating and doing things. They are painting, acting, playing, juggling, whether on stage or behind the scenes. They never stop being creative. Tati shortens the creative process and mainly focuses on what is perceived by the artists and the audience/at the intersection. Sometimes, the acts of the artists will clash with each other, sometimes they are complimentary. Some acts are good, some misfire. This is where the audience really comes in. Watch the audience reactions. Tati has set the scene from the beginning, showing you the cross section of the typical audience attending, making fun of some signs of the time and contrasting it against ... well, have a look at what is placed in the audience section; Tati leaves some hints as to what he thinks of those attending the show/art parade - critique is mixed with compliments and acceptance. The audience (a nice selection) will become involved in the creation of the art - in fact it appears impossible to separate the artists from the audience at times. The audience reactions are also telling - Tati shows us typical audience behavior from overbearing enjoyment to boredom. The placement of these reactions is very deliberate - there is a lot to pick up on and I suggest to view the movie a few times, focusing on different aspects of it. Typical for a Tati movie there is some whimsy and the humour sways between slapstick and subtle satire. It is telling that Tati attempts to show a cross section of modern (for the times) and old fashioned especially in the music. In this he embraces both old and new. The film ends in a scene that shows that creativity and art leads to inspiration, where it counts and where it is allowed to grow. Don't watch this as a circus movie; watch this as an art process and suddenly you will see a plot in the movie that is otherwise very easy to miss. This movie is Tati's final statement about art; it is not his most accessible movie and will probably only appeal to you, if you are willing to watch the movie a few times and spend some time thinking about it in between. So, not recommended for casual viewing.",
         "PARADE is basically the presentation of a circus performance, in which artistes interact with the audience in a series of set pieces - juggling acts, tightrope walks, clowning, balloon fights, plus one or two routines in which Tati demonstrates his remarkable talent for mime. The film's artificialities are evident: we see cardboard cutouts of members of the audience among live-action actors, while the performers sometimes talk to inanimate objects. Tati's purpose, although not overtly stated, seems to be to show how life is like a circus, with all of us indulging in a series of ritualized actions which, although meaningful in themselves, can also be considered absurd. This is definitely true of some of his set-pieces - for example the very funny routine where he imitates a boxer going into a championship bout. However, a series of routines do not necessarily make for an entertaining film: some of the performances involving actors other than Tati are distinctly second- rate, while the audience - when Tati's camera shows them in close-up - sometimes look thoroughly bored with the proceedings, despite the enthusiastic applause on the soundtrack. Judged by his previous oeuvre, PARADE is sadly a very second-rate piece: one feels sad that the great director could not have bowed out on a more positive note.",
         "Jacques Tati's swansong is an affectionate return to roots, recreating some of the vaudeville routines of his past on stage at a Swedish circus, in a short program originally made for Scandinavian TV. Tati himself, serving as ringmaster for the troupe of acrobats and clowns, puts his aging but still limber body on display during a transitional set of solo pantomime turns. The show is frequently hilarious (some of the audience interaction with the performers is clearly not unscripted), but as a farewell effort of a comic genius responsible for some of the biggest laughs since the glory days of silent film comedy it can certainly come as an anti-climax. And because the stage show was 'filmed' using a crude early video process, it almost resembles a bootleg live rehearsal for the next, never made Tati feature.",
         "No plot - just some middling European circus acts (juggling, tumbling, some musical nonsense, etc.) and Jacques Tati doing some of his cabaret routines. Even Jacques Tati fans may be disappointed. Some will find the Swedish audience's 1970's \"hippy\" costumes interesting."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Gray-Film",
         "Sveriges Radio"
      ],
      "summaries": ["Two children go behind the scenes of a small circus."],
      "budget": 0
   },
   "movielensId": 125596,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1974-12-18",
      "dvdReleaseDate": null,
      "directors": ["Jacques Tati"],
      "runtime": 84,
      "movieId": 125596,
      "title": "Parade",
      "mpaa": null,
      "actors": [
         "Jacques Tati",
         "Michèle Brabo",
         "Karl Kossmayer",
         "Pierre Brama",
         "Pia Colombo",
         "Johnny Lonn"
      ],
      "imdbMovieId": "0071968",
      "originalTitle": "Parade",
      "genres": [
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two children go behind the scenes of a small circus.",
      "tmdbMovieId": 58655,
      "avgRating": 2.8,
      "releaseYear": "1974",
      "numRatings": 10,
      "posterPath": "/jwKXzKu2UtOAFDveceuRYGLc22t.jpg"
   }
}