{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3661072",
      "video": false,
      "title": "Giuseppe Makes a Movie",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 2,
            "credit_id": "536064eec3a36860e5000588",
            "name": "Giuseppe Andrews",
            "profile_path": "/tWAjcA240TR9x4GqGKj2gL4p68B.jpg",
            "id": 4133,
            "order": 1
         }],
         "crew": [{
            "gender": 2,
            "credit_id": "536064cdc3a36860ae000527",
            "name": "Adam Rifkin",
            "profile_path": "/6gm8cFTfvBgesIlZ2TwJUvX84KL.jpg",
            "id": 50583,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.269073,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 266880,
      "vote_count": 4,
      "budget": 0,
      "overview": "While the rest of America slept, DIY filmmaker/musician Giuseppe Andrews has made over 30 experimental features. Set in some demented alternate universe (i.e. Ventura, California), they are populated by real-life alcoholics and drug addicts, trash-talking senior citizens and trailer park residents dressed in cow outfits and costume-shop wigs, acting out booze-fueled vignettes filtered through Giuseppe's John Waters-meets-Harmony Korine-meets-Werner Herzog sensibility.  Director Adam Rifkin (Look, The Dark Backward) creates a wildly surreal, outrageously funny and strangely touching portrait of a truly Outsider Artist inhabiting a world few of us even know exists, as he follows Giuseppe and his seriously impaired troupe on the production of his latest 2-day opus, Garbanzo Gas, starring Vietnam Ron as a Cow given a weekend reprieve from the slaughterhouse at the local motel.  An Official Selection of Hot Docs 2014, Los Angeles Film Festival (LAFF) and the Rooftop Films Summer Series.",
      "similar": [],
      "original_title": "Giuseppe Makes a Movie",
      "runtime": 82,
      "poster_path": "/qprsDvrTFjXqtLbn3smRKGjGCFp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-04-28",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "WARNING: THIS FILM CONTAINS SENIOR CITIZEN NUDITY AND DEAD PIGS",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Adam Rifkin"],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "David Nordstrom",
         "Mike Plante"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3661072/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4NzE4MzYxM15BMl5BanBnXkFtZTgwNzM0NDMzMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Giuseppe Andrews, Vietnam Ron, Big Ed | See full cast and crew »"],
      "reviews": [
         "One of the most original men working in film today is someone you've probably never heard of. His name is Giuseppe Andrews and, aside from starring in rather mainstream cult favorites such as American History X, Cabin Fever, and Detroit Rock City, he has predicated his career off of making the wackiest little films you've likely ever seen for next to nothing. Adam Rifkin's Giuseppe Makes a Movie is a long overdue exploration of Giuseppe's ingenious craft, and a project that shows his own ethics regarding what should be called \"anarcho-cinema.\" I use the term \"anarcho-cinema\" because Giuseppe seems to have read the unwritten books of \"normal\" filmmaking and done the direct opposite of what its directions read. Living in a trailer park, he shoots his films for a couple thousand dollars, at most, pays his actors about the same as a day's work at a minimum wage job, buys props and then throws them away upon the film's completion, and, right before turning on the camera, tells his actors what to do and say. His films are often very grotesque, featuring ugly characters, who are often homeless men pulled from the streets in what seems to be Giuseppe's form of holding casting calls. He has no interest in working with younger people, so he says; he'd rather work with older people because of their life experience. That's why his closest friends are his loyal, middle-aged producer \"Big Ed\" Roth and an elderly homeless man nicknamed \"Vietnam Ron.\" Giuseppe offers his filmmaking ideology early on in the film. He talks about how studios obsess over continuity errors and spend countless dollars on reshoots if something is in one frame but not in the next. He doesn't care about continuity, but rather about essence and \"vibe,\" so he states, which he defines as the film's aesthetic and how it makes you feel. He would rather have you \"feel\" the film then provide you with flawless production work. Even when cranking out a screenplay, Giuseppe says to \"let your hands go,\" just like in boxing (a philosophy I practice with everything I write). The man is the very definition of a wayward filmmaker. Giuseppe Makes a Movie follows Giuseppe as he aspires to shoot his most recent film in just two days or less. The project is called Garbanzo Gas, about a cow who wins an all-expense-paid weekend at a local hotel, where he can finally leave the hopeless slaughterhouse. Giuseppe says he got the title for the project when he ate a can of garbanzo beans and then farted, which is probably about the best way one could come up with a title for their next project. He gets the assistance from \"Big Ed,\" his girlfriend Mary, his close-friend Miles Dougal, and a number of his other actors, many of whom homeless and looking for work, and proceeds to make his tenth film. Watching Giuseppe film these scenes is something of a marvel. Giuseppe films with a hand-held camera and minutes before pressing \"record,\" he'll tell the actors what to say and how to say it. Often, the lines of dialog are vulgar, crass, and make no sense; it's rare to hear three lines in a row that are even coherent. But Giuseppe and his loyal actors push on, having a lot of fun with the material at hand, laughing, messing about with makeup, and enjoying making films for next to nothing for the thrill and adventure of it all. Giuseppe states he doesn't believe in using a lot of nudity or sex in his films. He doesn't find nudity to be humorous or a comedic device. Because of this, he subverts his idea into making a sex scene where the characters are almost completely wrapped in sheets, avoiding any and all eroticism in the scene. He doesn't see the point in wasting all your bawdiness and raunchy elements in one single sex scene; he would much rather put those elements to use with his dialog to make a film memorable and funny based on what the characters are saying. The film was directed by Adam Rifkin, who gave us both the criminally underrated movie LOOK about several unsuspecting souls whose lives intertwine and we're forced to watch their interactions and daily lives through surveillance video, and the TV show of the same name. In addition, Rifkin also gave us the grimy little feature The Dark Backward, with Judd Nelson, and the aforementioned cult favorite Detroit Rock City With \"Giuseppe Makes a Movie,\" he provides a documentary on a different filmmaking lifestyle; one that is clearly done out of admiration and inspiration. As Giuseppe sits and writes, edits, sings or performs his music, or even just guides actors through scenes of Garbanzo Gas, you can tell Rifkin is fascinated by his practices. Here is a man who doesn't want to fit in and has found a way to communicate his eccentric personality through the lawless route of film. Giuseppe Makes a Movie ends with Giuseppe and everyone who made Garbanzo Gas possible (which, in total, is less than ten people) getting together for a wrap party, which is held between Giuseppe's trailer and \"Big Ed's,\" with alcohol and limited snacks to go around. This is the quintessential shot of the film. It perfectly replicates the small-scale production that Giuseppe loves to work with, and shows the intimacy of what is just, in short, friends and acquaintances getting together to produce something offbeat and fun. It is one of the best documentaries I've seen in years. Starring: Giuseppe Andrews, Ed \"Big Ed\" Roth, and Miles Dougal. Directed by: Adam Rifkin.",
         "Giuseppe Makes A Movie is a poetic look inside the mind of an absolute genius in front of and behind the camera. To say Giuseppe Andrews is a master of the $1,000 dollar movie shot in two days would be a disservice to Mr. Andrews and the film community as a whole. An artist that doesn't subscribe to the concept of \"No,\" Andrews is a shining beacon of hope in a vast crowd of self-entitled \"would-be-filmmakers\" bogging down the trenches of true independent spirit. Director Adam Rifkin managed an impossible feat by capturing Giuseppe's insane process yet managing to find the humanity amid the madness. This is an utterly captivating and heartfelt documentary. Giuseppe Makes A Movie is simply 82 minutes of lightning in a bottle. A must watch for any true cinephile."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Blump International Films",
         "Cinemad Presents"
      ],
      "summaries": ["In Ventura, CA, Giuseppe Andrews makes movies in his trailer park where he grew up. A former child actor in some big movies (Independence Day, Unstrung Heroes, Never Been Kissed), Giuseppe is inspired more by the crazy independent filmmakers of history: Bunuel, Cassavetes and Fassbinder. Obsessed with the edges of society, dirty language spoken as poems and occasional nudity, Giuseppe's films may resemble the underground worlds of Harmony Korine, John Waters and Tod Browning. With a handwritten script, a video camera, an acting ensemble of neighbors and homeless friends - and almost no money, Giuseppe has now made 30 feature films. In Giuseppe's new film \"Garbanzo Gas\", Vietnam Ron, one of many homeless men in Ventura that Giuseppe has grown up with, plays a vegan cow on vacation from the slaughterhouse. The doc GIUSEPPE MAKES A MOVIE follows the making of \"Garbanzo Gas.\" From Giuseppe's headquarters - his own mobile home - we follow as he sets out to make a feature film in just two days. The stranger-than-fiction documentary explores the Giuseppe universe, showing how the self-taught filmmaker captures an unexpected level of humanism and creates a family unit for a group of people who needed one."],
      "budget": 0
   },
   "movielensId": 125634,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-04-28",
      "dvdReleaseDate": null,
      "directors": ["Adam Rifkin"],
      "runtime": 82,
      "movieId": 125634,
      "title": "Giuseppe Makes a Movie",
      "mpaa": null,
      "actors": ["Giuseppe Andrews"],
      "imdbMovieId": "3661072",
      "originalTitle": "Giuseppe Makes a Movie",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["UPToXzfla7g"],
      "plotSummary": "While the rest of America slept, DIY filmmaker/musician Giuseppe Andrews has made over 30 experimental features. Set in some demented alternate universe (i.e. Ventura, California), they are populated by real-life alcoholics and drug addicts, trash-talking senior citizens and trailer park residents dressed in cow outfits and costume-shop wigs, acting out booze-fueled vignettes filtered through Giuseppe's John Waters-meets-Harmony Korine-meets-Werner Herzog sensibility.  Director Adam Rifkin (Look, The Dark Backward) creates a wildly surreal, outrageously funny and strangely touching portrait of a truly Outsider Artist inhabiting a world few of us even know exists, as he follows Giuseppe and his seriously impaired troupe on the production of his latest 2-day opus, Garbanzo Gas, starring Vietnam Ron as a Cow given a weekend reprieve from the slaughterhouse at the local motel.  An Official Selection of Hot Docs 2014, Los Angeles Film Festival (LAFF) and the Rooftop Films Summer Series.",
      "tmdbMovieId": 266880,
      "avgRating": 4.16667,
      "releaseYear": "2014",
      "numRatings": 3,
      "posterPath": "/qprsDvrTFjXqtLbn3smRKGjGCFp.jpg"
   }
}