{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "prisoner of war",
            "id": 1968
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "female prisoner",
            "id": 11412
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "sadist",
            "id": 13125
         },
         {
            "name": "cruelty",
            "id": 14624
         },
         {
            "name": "lesbian sex",
            "id": 33998
         },
         {
            "name": "sexual torture",
            "id": 159595
         }
      ],
      "imdb_id": "tt0076649",
      "video": false,
      "title": "The Beast in Heat",
      "recommendations": [
         39987,
         86777,
         28170,
         14262,
         30877,
         27699,
         48221,
         16233,
         30645,
         55781,
         30936,
         8690,
         22121,
         28177,
         20850,
         32100,
         85428,
         58745,
         83857,
         92378
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Dr. Ellen Kratsch",
               "gender": 0,
               "credit_id": "52fe46139251416c91048519",
               "name": "Macha Magall",
               "profile_path": null,
               "id": 235948,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Drago (as John Brawn)",
               "gender": 2,
               "credit_id": "52fe46139251416c9104851d",
               "name": "Gino Turini",
               "profile_path": null,
               "id": 235949,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Captain Hardinghauser (as Kim Gatti)",
               "gender": 0,
               "credit_id": "52fe46139251416c91048521",
               "name": "Edilio Kim",
               "profile_path": null,
               "id": 235950,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Lupo",
               "gender": 2,
               "credit_id": "52fe46139251416c91048525",
               "name": "Xiro Papas",
               "profile_path": "/fciAEwgY2QWlQiBbcHWewLlIF7V.jpg",
               "id": 30891,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "The Beast (as Sal Boris)",
               "gender": 0,
               "credit_id": "52fe46139251416c91048529",
               "name": "Salvatore Baccaro",
               "profile_path": "/wyBvZ6dNEQjmc36p9sOz1HXu3et.jpg",
               "id": 30901,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Irene (uncredited)",
               "gender": 0,
               "credit_id": "57d80b7bc3a36878e90005b3",
               "name": "Brigitte Skay",
               "profile_path": "/4cev942jTxxDt9inMnnq8TY2A1u.jpg",
               "id": 44978,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Moreno (uncredited)",
               "gender": 2,
               "credit_id": "57d80b8a9251412290000506",
               "name": "Alfredo Rizzo",
               "profile_path": "/qXNtcqOVtUMYjJedqAlNzPiQg1w.jpg",
               "id": 12006,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Partisan (uncredited)",
               "gender": 2,
               "credit_id": "57d80ba2925141538600424a",
               "name": "Benito Pacifico",
               "profile_path": "/2FuGAZM22iS58nWpxqGYQTT8ncp.jpg",
               "id": 27412,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Don Lorenzo (uncredited)",
               "gender": 2,
               "credit_id": "57d80bb5925141222200513d",
               "name": "Brad Harris",
               "profile_path": "/8mWAC7bb1WM4zzi94lgna30y2QZ.jpg",
               "id": 37722,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "German Soldier (uncredited)",
               "gender": 2,
               "credit_id": "57d80bc8c3a368783d000517",
               "name": "Giuseppe Castellano",
               "profile_path": "/2CyDiJQ6J45CDlwA9WMblOtWLm0.jpg",
               "id": 37125,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46139251416c910484fd",
               "name": "Luigi Batzella",
               "profile_path": null,
               "id": 102063,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46139251416c91048503",
               "name": "Xiro Papas",
               "profile_path": "/fciAEwgY2QWlQiBbcHWewLlIF7V.jpg",
               "id": 30891,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46139251416c91048509",
               "name": "Luigi Batzella",
               "profile_path": null,
               "id": 102063,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "553a2a299251413f5a00397e",
               "name": "Lorenzo Artale",
               "profile_path": null,
               "id": 227415,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "553a2a4ac3a3681be40066f3",
               "name": "Luigi Batzella",
               "profile_path": null,
               "id": 102063,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "553a2a0ec3a36878450084e8",
               "name": "Giuliano Sorgini",
               "profile_path": null,
               "id": 227421,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "553a2a3a925141275e003043",
               "name": "Ugo Brunelli",
               "profile_path": null,
               "id": 1092879,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.481376,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 36879,
      "vote_count": 17,
      "budget": 0,
      "overview": "In a remote village in occupied Europe, the SS pursue their inhuman treatment of captured partisans in efforts to force them to betray their comrades.... while Fraulein Krast, a sadistic biologist, concentrates her efforts on the womenfolk with refined tortures and humiliation, leaving them to the mercy of a sex-crazed half-man, half-beast she has created with experimental injections.... And as advancing Allied forces approach the village, Krast herself becomes a victim of her own fiendish rituals....",
      "similar": [
         357096,
         281957,
         3134,
         10781,
         123109,
         1696,
         8090,
         15762,
         10285,
         65754,
         281,
         979,
         238636,
         588,
         395834,
         12619,
         575,
         74997,
         445954,
         22825
      ],
      "original_title": "La bestia in calore",
      "runtime": 86,
      "poster_path": "/evayVpPpB10o06ugj609pO1V06p.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Eterna Film",
            "id": 51920,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sonora Films",
            "id": 41573,
            "origin_country": ""
         }
      ],
      "release_date": "1977-07-19",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "Horrifying experiences in the last days of the S.S.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Luigi Batzella"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Lorenzo Artale",
         "Luigi Batzella"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0076649/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZDI5ZjA0ZjUtNzgzOC00NzYwLWEzODUtNmFjNWM0YTEzYTM1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Macha Magall",
         "Gino Turini",
         "Edilio Kim"
      ],
      "reviews": [
         "Luigi Batzella's \"Beast in Heat\" is a hyper sleazy and hyper hilarious and just plain sick nazi exploitation turkey that beats every other film of the questionable genre.The film rips so many other films and documentaries off it makes you laugh alone.There are many scenes of some war documentaries that have extremely bad picture quality.The same thing is with Bruno Mattei's \"Hell of the Living Dead\" that rips also everything possible off,including the Goblin score from \"Contamination\" and \"Dawn of the Dead\".\"Beast in Heat\" is also very graphic with its violence,mainly towards naked females that get abused and sexually violated as we can expect.Plenty of nudity and pubic hair ripped off and then eaten by the monster and so on.The film doesn't even have a credits in its beginning;I've heard that every member of the crew,including the director,wanted to take their names off from this film.Overall,\"Beast in Heat\" is surely wild,so fans of Italian exploitation won't be disappointed.",
         "In theory, the Nazi-sex cycle of exploitation cinema should be an absolute winner. Not only are all these films based on spectacularly non-PC and offensive plot premises, but by their very nature they give plenty of opportunity for the film-makers to work in scene after scene of gore, nudity, sex, and combinations of the three. Of course, as any seasoned Euro-exploitation fan knows, it is very rare that ANY so-called \"video nasty\" lives up to the promise of its garish title and plot outline, and in practice, there is nothing that displays this more succinctly than this genre. The Nazi-sex films are ineptly made, dull, boring, and not nearly as offensive as they should be. Saying that though, THE BEAST IN HEAT does at least enough to raise itself above other dross such as SS EXPERIMENT CAMP. Badly made and boring it might be, but the comedy of the caged \"beast\" is enough to keep you watching (even though its appearances are few and far between). The nastiest gore surfaces at the very end, and although it's all quite unpleasant in theory (particularly the moment where the \"beast\" tears chunks out of an unfortunate victim's mons pubis and gobbles them up), the absolutely dire standard of special effects leaves this whole affair more in the niche of BLOODSUCKING FREAKS than MEN BEHIND THE SUN... Not really worth bothering with unless you are an enthusiast of this sort of thing. \"Fans\" of this particularly surreal thread of exploitation would be well advised to dabble in the seedy climes of the closely-related \"Women In Prison\" cycle, because the best of that genre beats this type of gubbins hands down.",
         "I jotted down some notes about Luigi Baztella's BEAST IN HEAT, which is easily the cumulative apex of both the Italian Nazi Exploitation idiom and Euro War sub-genres all wrapped up into one: 1) The movie is an exercise in applied bad taste ranking up there with Umberto Lenzi's CANNIBAL FEROX or maybe PAINT YOUR WAGON as one of the silliest movies ever made about a potentially serious subject. Anyone who is offended by it is too stupid for their own good, and I wonder how they might get through the day without hurting themselves or accidentally blowing something up. 2) During WW2 there was apparently an ultra-secret Nazi medical experiments division headed by outrageously sexy female bisexual dominatrix type Gruppenfuhrers (here personified by the undeniably arousing Macha Magall, in grave need of a proper spanking for being so naughty) who looked great strutting around in Nazi regalia and spent many hours perfecting the act of crossing & uncrossing their garter/hose encased legs, sexually harassing their subordinates, and sucking on phallic cigarette holders. We are lucky we won. 3) The star of the film is Monkeyboy (veteran character actor Salvatore Baccaro, who was able to convincingly play simian characters without any special makeup or costuming), a name given by one of my drinking buddies to the half ape half man crossbreed creature injected with a serum that enhances it's libido to the point where the thing just exists to hump whatever females are thrown into it's cage. The Nazis then stand around and watch the proceedings while taking notes. Just what they hope to achieve by this experiment -- and just how they cross bred an ape with a human so quickly -- is sadly never addressed during the film's duration. 4) The movie is actually 2 or 3 or 4 movies edited down into about 85 minutes of screen time. The most watchable segments of Mr. Batzella's truly awful 1970 Euro War failure WHEN THE BELL TOLLS with Brad 'Zambo' Harris are combined with newsreel and stolen war movie footage to pad out the approximately 40 minutes of stock exposed for the principal action of the film. Harris must have taken a swing at Mr. Batzella after being informed he was included in this film & viewing the results, and be sure to check out how one character's hair style and costuming changes between scenes taken from one or the other project. Seven years really is a long time. 5) Nazi storm troopers often amused themselves by tossing babies into the air for target practice with their Italian made Baretta machine guns. They may have been evil dirtbags but they knew a good time when they saw it and managed to find a few laughs in between extermination roundups, where the first thing they would do would be to separate out all of the young hotties to be molested by their lesbian dominatrix Gruppenfuhrers. Talk about rank having it's privileges. 6) The film is an extension of the Italian Euro War agenda of painting the Italians not as Nazi collaborators who eventually wizened up but as the Good Guys. This is done not by depicting their own story of coming around to the program of stopping totalitarianism, but by painting the Nazis as the most evil, vile, depraved menace possible with one War Is Hell sequence after the other. The Italians may have been bad but they weren't as bad as the Nazis, and this movie is part of their proof. 7) Guinea pigs will consume the intestines of attractive Italian B movie actresses when placed on their abdomens. 8) Monkeyboy totally rulez this movie, and his climactic encounter with Macha Magall has a kind of Hitchcockian inevitability to it that wraps everything up. The best way to watch BEAST IN HEAT is to glom onto the DVD version so you can fast-forward through the filler material and concentrate on the scenes of Nazi depravity -- which is the whole reason to watch it in the first place -- since the history being depicted is about as realistic as a Three Stooges short. A Cliffnotes version of BEAST IN HEAT should be executed, distilling the film down to it's core 40 minutes of nonstop hilarity. 9) The main reason that the Nazi Exploitation idiom is viewed with such disdain is due to the subject matter, which many have deigned to be \"sacred\". The Video Nasty label wasn't applied here so much for gruesomeness or sexualized content, but for the attitude of daring not to take the subject of Nazi war atrocities with the seriousness it is due. And it bears repeating again that anyone who is offended by this movie is probably a moron for having chosen to watch a movie called SS HELL CAMP it in the first place. If you want to watch something serious about Nazi atrocities dial up the History Channel next time for Pete's sake. In closing, someone whom I discussed this film with asked me if I actually thought what was being shown really happened, and my immediate reply was of course it was all real. Just like FARENHEIT 9/11 or AN INCONVENIENT TRUTH, here is one of the great documentaries of all time, proving once and for all that Italian genre cinema is a fool's paradise. It may not be very well made or pack a social wallop, but it sure is a hell of a lot of fun when consumed in the presence of your friends with plenty of beer. 3/10",
         "I only wanted to see \"SS Hellcamp, only because it's was on the infamous \"Video Nasty\" list. Yes indeed it's still banned in England, why I don't know it's all very Repelling, that SS Hellcamp is banned and \"Spice World\" isn't however. I wasn't at disappointed at all with this. I found it good and its thought provoking. There is some humor. If viewers find this offensive, then get a life and don't watch this. If you are into strange films than you'll love this. There is lots of sexy parts and action. The Nazi's experiments on a half-man and half-beast. They also find female prisoners to have sex with the beast. The only problems once the half-man half- beast is that he kills them. The rebels get to fight the good fight and the Nazi's get. Karma is a bitch.",
         "SS Hell Camp (1977) ** (out of 4) Naziploitation film has a wacked out female German doctor performing experiments on beautiful naked women. This is considered one of the more graphic naxiploitation films but I've seen a couple that are a tad bit worse. Like the others this one here is full of naked women, rape, violence, some blood and various \"Hail Hitler's\". The biggest problem here, much like the others, is that there isn't enough camp and there's way too many disgusting scenes including one where a baby is taken from its mother, thrown into the air and then shot.",
         "Basically here we have just another tasteless, dull, haphazardly and carelessly slapped together Euro-sleazefest cheaply made to capitalize on the drive-in success of the ILSA films. This time, Dr. Helene Krast (Macha Magal), a blonde Nazi torturer, uses her gothic torture chamber to pump secrets out of innocent European villagers during World War II. Oh yeah, there's also a fat, naked, hairy, grunting guy (played by the same \"Boris Lugosi\" cat who portrayed \"Ook\" in FRANKENSTEIN'S CASTLE OF FREAKS) who paws, rapes and kills women thrown into his cell. Endless nudity and violence are mixed with badly incorporated (and dull!) stock war footage, choppy editing and cheap, tasteless sadism. This is available on tape under various titles like S.S. HELL CAMP, THE BEAST IN HEAT and NAZI HOLOCAUST. The version I saw was entitled S.S. EXPERIMENT CAMP 2 (which was the original US video version and is probably missing some of the more explicit scenes). Even if it was heavily cut, I think I'll pass on the 'full' experience of LA BESTIA IN CALORE. Score: 2 out of 10",
         "If one can overlook the gratuitous nudity, lengthy rape scenes, and nasty tortures, La Bestia In Calore does provide solid entertainment for those who enjoy particularly inept cinema. Muscleman Brad Harris stars as a priest involved with Italian partisans and provides the film's best line as he sends the resistance off to battle: \"trust in the Lord! He's the BEST!\" Stock footage from better films with decent budgets is easily discernible, as are toy planes that periodically bomb our heroic partisans--one of whom bears an uncanny resemblance to Saddam Hussein. The award for best torture device must surely go to the 'death by hamster nibbling' sequence, and of course all the actors--including those playing the Nazis--sport truly atrocious 70's hair. Unforgettable!",
         "While obviously flawed in the film making department(budget, script, continuity), one has to wonder just how the idea of this gem came to be, and where the hell they found actors who were willing to perform this type of trash! The story follows 2 plots which eventually converge on each other - The first, is the story of the sadistic female Nazi Dr. who has created a sexually aberrant mutant human, and unleashes his drugged sexual fury on female prisoners. She uses her discovery as a way to climb the chain of Nazi command, while enjoying the torturing of several prisoners, either by throwing them to her beast, or doing the job herself! The second plot follows a group of resistors trying to free Northern Italy from the clutches of the 3rd Reich. Ultimately their adventures lead them to the Nazi Dr. woman, who is running the garrison controlling the area. They rout the baddies, and give the good Dr. a taste of her own sadistic ambitions. This film is fun if you are open minded, not easily offended, and enjoy strange cult films unlikely to be made today. It is worth noting that there is no reference to Jewish imprisonment anywhere in this film, which is odd for a Nazisploitation flick. The budget was so low, that in one scene where a German bomber is destroying the town, it is clearly a model on string being whipped around in front of the camera with a blue screen in the background! Classic! Ed wood himself would be proud.",
         "SS hell camp, or the beast in heat rode the crest of the wave of the late 70's early 80's video nasties phenomenon in Britain- well, in style anyway, since it has always been curiously scarce. An SS atrocities film with an Ilsa style villainess named Krast, who performs human experiments to advance the nazi cause. She creates a brutal beast-man and injects it with a libido enhancing serum, and throws captured virgins into its cage. Why? who knows. The local resistance get p****d, and attempt to invade the experiment compound. Krast in turn gets p****d with the resistance and tries to extract information about the resistance by torturing the locals. The film cuts between scenes of the resistance struggle and the sleazy goings on within Krast-ville, the former being mostly comprised of war footage (Cheap!) and the latter showing assorted torture techniques (Gory but camp). As a film SS hell camp is pretty shabbily made, and including war scenes seems more of a digression than a plot element, but there again, a film like SS hell camp neither has nor needs a real plot, since it simply serves to titilate. Historians will hate it, Genre fans will enjoy it.",
         "This is one of many so called Video Nasties about fictionalised World War 2 Nazi POW camp atrocities. The film focuses on a senior female SS officer who has created a half man/half beast dwarf creature in a bizarre genetic experiment. She goes on to torture the female POW's in her care by giving them to the vertically challenged beast who subsequently \"bonks\" them to death. The SS officer has the tables turned on her at the films climax when the POW's get the upper hand and give her a taste of her own medicine. This film has a load of vile scenes and genital torture. Another video nasty that can actually be called 'nasty'.",
         "The British censors have a lot to answer for. By creating a list of films which in their opinion will deprave and corrupt anyone who watches them they have subjected me to some badly made, boring and extremely bizarre movies which I would probably never heard of if it hadn't been for them and I love them for it! Although censorship in the UK has been greatly relaxed since the video nasty scare, we are still a conservative nation and a few of those films still remain banned and unavailable since it is illegal to sell films in the UK unless it has a rating from the BBFC. The Beast in Heat hasn't actually been submitted to the BBFC since being prosecuted all those years ago and there really isn't any point in trying because if I know one thing it's this - this film will NEVER legally see the light of day in this country. The plot is really nonsense. The Nazis are in town and in some dodgy basement a scary female scientist (the superb Macha Magall) is trying to produce some sort of randy beast for reasons that aren't really that clear. Here she throws poor naked local lasses in with him where he rapes them to death. If this isn't enough she also tortures them in other ways as well. Meanwhile, the local partisans are blowing up bridges and trying to infiltrate the Nazis for information while arguing amongst themselves. The obvious aim of a film like this is to shock and dare to go where no film has gone before. It puts the film on banned lists and it rises to immortality when really it should have been forgotten years ago. Yes, the production values are bad, the acting is bad, the dubbing is laughable. The partisan parts are there to flesh out the run time and no attempt has been made to make those sections coherent. Characters appear and disappear, you haven't a clue really who anyone is and what they are meant to be doing half the time. Although the priest is brilliant, especially when he gets angry! Of course the film is really about what goes on in the Nazi basement. Conceptually these scenes are horrendous. Water torture, finger nails pulled off, eaten alive by rats. In practice though they are so badly done you are almost embarrassed for the filmmakers. There were a few interesting things I found though. The rape scenes are filmed in such a surreal way that it takes the edge of the disgust you should be feeling. Lots of weird camera angles and bizarre close ups of the man-beast are more trippy then anything else and completely at odds with the way the rest of the film is shot. Conversely the scene where the evil Doctor gets her horribly ironic comeuppance is shot in a more conventional way, much less swirly camera and loads more focus on her suffering really made for uncomfortable viewing. Also the ending is rather sad and strange and would almost be poignant if there where any earlier attempts at plotting or character development, even just a little. What I find interesting about exploitation films, even one as bad as this is that you can always find teeny tiny glimpses of attempts made by directors to actually be interesting rather then just shoot and cash the paycheck. All in all this film is likely to offend a lot of people, likely to bore the others but I have a high trash tolerance and I found myself drawn in to the film for all its faults and enjoyed it for what it is - high camp, tasteless, disgusting filth!",
         "Luckily by the time I put this film on I'd drank about six cans of Stella, which meant that when the shaky video to DVD transfer came on screen my brain was perfectly tuned to the trembling, wavery image that greeted me. The Beast in Heat is a sleazy video nasty of the Nazi-sploitation type, which means lesbian action, pubic hair, rape, torture and all sorts of crap, poorly executed so much that it begins after a while (and several cans of Stella) to look like an episode of You've Been Framed. The story? I can't really remember, but I'll describe the first scene. Some Nazi chick (I first thought her name was Dr Crash, then Dr Crap, but on the back of the DVD box it says that her name is Krast) throws a local Italian woman to some freaky pig-like creature, who begins to rape her. We get loads of close ups of his buttocks gyrating about two feet away from her body. And she has her legs closed. Dr Crap asks a German soldier if he's excited, to which he replies yes, and gets a slap for his trouble. Then Dr Crap asks this German chick if she's excited, and the chick says she's excited for the progress of the experiment, and she gets a kiss. Meanwhile, the Italian chick dies because she's begun to realise how this film will turn out. This is classic exploitation stuff, and I mean classic in the sense that it follows the usual pattern these films do - you get some sleaze and violence at the start, then some boring bits, then more sleaze, then more boring bits, then the end of the film. In this film some partisans are brought in to pad out the story, along with a bumbling German officer. Not much of this is of any interest to anyone. In fact it seemed to me that my Stella-addled brain was switching off each time these guys were featured in a scene. What I gathered was that one of the hookers who has really badly-staged sex with the German officer is a spy, and lets on to the partisans that there's some bad doings going down over in Nazi town, which involves all those Italian partisan chicks that keep disappearing. Things like being eaten by rats, tortured by Dr Cramps (did she have to do that topless?), and best (worst?) of all, having their fake pubes ripped off by the beast and eaten. Later I was lucky enough to wake up in time to see Dr Craptastic getting thrown to beast, and get her comeuppance before one of the crew got fed up making the film and machine gunned everyone on set, or something. Crap acting, crap direction, crap transfer. Another video nasty that doesn't live up to it's name, and basically all it boils down to is another Italian hack aiming purely to make cash through some crap genre or other. I had a hangover the next day...or was it this film? I recommend that this film be played at every Church in Britain instead of mass. Every Sunday.",
         "Depraved and sadistic Nazi scientist Dr. Ellen Kratsch (excellently played with lip-smacking wicked relish by the lovely Macha Magall) creates a brutish sex-crazed Neatherthal subhuman beast (hysterically portrayed with slobbering grunting gusto by tubby wonder Salvatore Baccaro) who rapes and eats beautiful young women who get tossed in its cage. Meanwhile, a guerrilla army of dedicated freedom fighters try to liberate Northern Italy from the cruel tyranny of the Third Reich. Writer/director Luigi Batzella scrupulously covers all the supremely seamy and revolting exploitation bases: plentiful tasty female nudity (several guys show their stuff as well), an unsparingly mean and sordid tone, savage animalistic rape (the beasts rips out one hapless victim's pubic hair and devours it by the handful!), truly vile and hateful Nazi villains, vicious, kinky, and excruciatingly graphic torture set pieces that include a gal having her stomach chewed open by rats, another chick having her fingernails yanked out with pliers, a horny male prisoner getting castrated by a topless Krastch, and, in the gloriously tasteless highlight, a little baby is tossed up in the air and heartlessly blown away by the loathsome Nazi swine; and an uncompromisingly gloomy ending. The lousy dubbing, cruddy (far from) special effects (the chintzy Tonka Toy plastic bomber plane in particular in is uproariously shoddy), Ugo Brunelli's crude cinematography, liberal use of obvious poor quality stock footage, Giuliano Sorgin's redundant shuddery synthesizer score, and the clumsily staged action scenes further add to this lovably appalling atrocity's considerable grimy charm. Entertaining low-grade junk.",
         "Many revisionist historians have discussed the Nazi era, with fake claims of weasel pointing and duck larceny... at last! a film that manages total historical accuracy. On first viewing i mistook this fine film for the works of Goddard and Fellini, but on closer inspection realized it is far better. An allegorical tale about mad German women and hairy men who enjoy eating pubic hair. This is a lot of fun, especially for people in the baking or hunting industries. My uncle Phil claims he was the beast in the film, but he also eats live dogs so his opinions are not always valid, Bad films come and go, this one lasts forever, like most Andy Warhol films. Maybe i'm sarcastic or maybe i'm genuine. Watch this film and find out for sure because you will never see another film like it. If you have, phone up the guy who made it and swear very loudly.",
         "I saw this a ways back as \"SS Experiment Camp 2\" hoping this would be good n' sleazy Italian made trash. What I got was bad n' boring Italian made trash. I haven't seen too many of these Nazi SS camp flicks, and this is supposedly one of the better ones...not. To sum up the \"plot\": It's war, the Nazis are taking over by shooting everyone and everything in town (including a scene that involves a really unconvincing baby) while scientists are conducting experiments on this \"Beast\" thingie (of the original Italian title). He is nothing more than a hairy, ugly brute of a man who stays locked up in a cage during much of the film. From time to time he is given the pleasure of torturing some poor, hapless nude woman where he then proceeds to rip out their pubic hairs. Sounds like fun, eh? The movie is executed in such a way that even the most vile, offensive things in this movie wouldn't even shock my own grandmother. It's all done very shoddily and uninteresting. Shame really. These SS flicks have never really peaked my interest, and this movie only decreased it. It's hard to find, but my video chain carries it - in the war section.",
         "SS Hell Camp AKA The Beast in Heat, an infamous (due to its inclusion on the Video Nasties list) Nazisploitation film by director Luigi Batzella, not only has a great title (or titles) but also features quite a lot of camp nastiness and glorious sleaze. Unfortunately, it also has more than its fair share of painfully dull moments, which means that the film is ultimately rather disappointing. Nasty Nazi Dr. Ellen Kratsch (Macha Magall) is conducting experiments on a half-man/half ape creature (Salvatore Baccaro) as part of her research into creating a genetically perfect master race. Female prisoners are taken from a nearby village (which is also the hiding place for a bunch of Italian partisans that the Germans are keen to apprehend), tortured for information about the enemy, and then thrown into a cage with the sex-mad beast, who proceeds to rape and kill the poor girls. As with a lot of other films in this genre, most of the violence is either too silly or over-the-top to really be that offensive; highlights of the film include a Nazi soldier who uses a baby for shooting practice, a woman who is eaten by a couple of ravenous guinea pigs (I think they're supposed to look like rats!), some torture via electrodes to the genitals, and, of course, Salvatore Baccaro's rampant slobbering sex-crazy creature (who, in one amazingly tasteless scene, bloodily tears the pubic hair from a victim's crotch and stuffs it in his mouth!). Between these delightfully silly and outrageous moments, the film is padded with loads of unimpressive war footage from other films and a very tedious plot thread about an Italian priest (Brad Harris) and a beautiful female villager who are helping the resistance.. If you are a fan of the genre, and think you can manage to sit through quite a bit of boring fluff in order to get to the 'good bits', SS Hell Camp is just about worth giving a go.",
         "SS HELL CAMP is another in a long line of relatively dull, yet sometimes entertaining Nazisploit films. I know that seems like a contradictory statement, but almost all of the films that I've seen of this genre fall into that category, namely - most of the film is pretty dull, with atrocious acting, stupid story lines, bad accents and lots of pointless dialog...which are then punctuated with some \"shocking\" scenes of torture and/or sex. I kind of like these films for the sheer \"sleaze-factor\", but I feel that the Nazisploit genre as a whole is relatively disappointing and the subject matter has never really been handled to it's full potential. Amidst the rather dull plot - the basic story is about a bunch of Nazi's trying to track down and kill a bunch of rebels. Throw in a side story about an \"experimental\" beast (which is really just an ugly hairy guy that grunts a lot and makes a bunch of goofy faces...)who rapes the Nazi's prisoners - and there ya have it... There are definitely a few sleazy scenes that are amusing - particularly the baby-target-practice and the female pubic hair removal by the \"beast\", who then proceeds to eat said bush. Of course the FX are horrible, but a few of the scenes are adequate. There is some nudity, but it's mainly by a bunch of nasty looking broads and a bunch of naked dudes with their wieners hanging out - so not much to rave about there (unless that's your thing....). But even so, SS HELL CAMP was mildly amusing and is probably worth a look to hardcore exploitation fans - but I highly recommend trying to find it to rent, as it's not worth buying. 6/10",
         "Some very watchable graphic scenes of full frontal sex and brutal violence have to compete with war footage from other movies, crap dialogue (as the third finger nail is removed: 'Hey, that hurt') and a nonsensical structure. It has to be said that Macha Magall is one of the better looking female Nazi leaders and her idea to inject men to make them rampant at least affords us of the opportunity to see the freakish Sal Boris raping his way through the entire film. The film is unredeemable and at times (attempting pathos!) plain stupid but undeniably it certainly doles out large portions of that good old S and V!",
         "My god, this film is terrible!! One of the hardest films to track down in the UK \"video nasties\" scare, there are instances even now of this selling for £200-£300 on eBay in it's original VHS video format ...!! Unfortunately this film being rare had nothing whatsoever to do with it being any good. \"The Beast in Heat\" (to use its more famous title) seems to be a low budget clone of \"Ilsa She Wolf of the SS\", but without a single ounce of the talent or budget present in any aspect of even that film's production. It's basically a very boring war movie in which we watch grumpy (and very obviously un-German looking) Nazi soldiers trade insults with civilians and members of resistance groups in some anonymous European village. Every so often some very obvious stock footage kicks in of planes and tanks attacking, which, apart from being obviously filmed completely separately, is also in a different aspect ratio to the main feature footage!! Yes it's that bad! This dull state of affairs drags on for 85% of the films running time and is enough to have you reaching for the fast forward after just a few minutes. Everything is awful - the acting, the script, the dubbing, the sets...one hilarious moment occurs early on when a railway bridge is blown up. I guarantee you've never seen anything so lame. I swear they had the camera zoom in wildly on a STILL PICTURE of a very small detonation and even added extra hand drawn flame effects directly onto the celluloid. If it wasn't for the unbearable tedium of the rest of the film, you could at least spend a few happy minutes laughing at this type of stuff. But of course, somewhere in this mess lurks the reason for the film's true appeal - the scenes of SS officers torturing naked women prisoners. I'll give this film one (just ONE!) compliment - it does star a very foxy leading lady in the shape of Macha Magall, as the sadistic \"Doctor Kratsch\". Sadly no match for Dyanne \"Ilsa\" Thorne in the charisma stakes, but it's impossible to tell if she's any good as an actress due to the inept dubbing she is saddled with (along with the rest of the cast). That aside, the \"cruel\" experiments that she is in charge of are real bottom-of-the-barrel trash. Making most shock value in the cheapest way possible is easy - have everyone naked. Right, what next? Well from there the flaws really start to pile up. The central \"experiment\" of the film is a sex-crazed dwarf that Dr Kratsch keeps in a cage, and whom she occasionally whips up into a frenzy of over-acting by throwing a naked woman in with him. What follows each instance of this is a montage of the worst possible face-pulling and general pantomime style rape attacking from the dwarf, and plenty of screaming from the hapless naked actress while she tries to look as though she is being overpowered by the crazed mini monster (rather difficult, as he is so small!) The camera zooms in wildly on splashes of too-red tomato sauce being liberally splashed about, as the beast carries out his assault. In one sequence, the dwarf even ups the outrage stakes by lifting his cross-eyed face from woman's lap to show a mouthful of torn-out bloodied hair...ugh! Don't worry, there's not even a hint of realism to any of this. All the while, Dr Kratsch and her attending guards watch silently, occasionally licking their lips in apparent arousal at the gruesome sight (I don't know where all the unusable footage of them laughing their heads off is, but there must be loads of it). Realism fares no better in other scenes as still more naked prisoners are tortured, eaten alive by rats (yes they are gerbils), or have stuck-on fingernails pulled out, The dubbing in these scenes is the worst synched dialogue you have ever seen. \"Stop it...you're hurting me...\" the soundtrack burbles while a bored looking actress's lips move in completely unconnected directions. Even throwing a baby in the air for rifle target practise or shooting a naked woman directly between the legs can't raise a gasp with production values as low as these. Due to the sparse placement of the torture scenes within the rest of the generally boring war and resistance action, it's rare for anyone to manage the feat of sitting through this rubbish to the bitter end, so should you fail, I'm sure you can guess the well deserved fate that awaits our cruel SS lady doctor...have a guess where she ends up. Sadly it's presented very half heartedly...you'll be only too happy to see the end of the film roll up on your TV. To realise that such a waste of space as this has been given a DVD release is more entertaining than actually watching the thing. They could at least have kept the original cover ( a hint of which can be seen in the lower left corner of the sleeve), it was a masterpiece of trash cinema promotion. The irony is that the British politicians and press who campaigned for films like these to be banned have ultimately succeeded in prolonging their shelf life far beyond that which the films deserve. This should go back to the obscurity in which it belongs.",
         "A beautiful, nefarious senior female SS officer/doctor (Macha Magall) creates a genetic, mutant human Beast (half man/half beast). The Beast is a rapacious, squat, mongoloid sex fiend which she uses to torture and molest female prisoners while the Nazis watch. This film really has no redeeming qualities. A knockoff of \"Ilsa\", it tries to up the ante with more torture, nudity and general excess. Arguably, it succeeds in this attempt, but that does not make it a better movie. Director Luigi Batzella offers nothing interesting, and even has to pad the 86 minutes with footage from another of his films, \"When the Bell Tolls\". Salvatore Baccaro (the \"beast\" of the title) has the perfect body for a character actor. He was in Dario Argento's little-seen \"Five Days\", s well as \"Deep Red\". Though his role in this film is reprehensible, this is really the fault of the script an those involved... in fairness to Baccaro, he is spot-on as far as being a crazed beat goes, so well played.",
         "\"SS Hell Camp\" starts of rather promisingly. In the opening scene we're introduced to an evil Nazi doctor (German actress Macha Magall, playing the role with gusto) AND a weird ape-man creature who has become extremely sex- crazed due to various unspecified experiments. So the idea is that they throw any girl who doesn't collaborate into his cage, so he can awkwardly hump her (without an erection, but why do I check?) until she somehow dies. To me that's a good enough gimmick for 80 minutes of Z-grade schlock, but writer/director Luigi Batzella is a lazy, lazy man. In 1970 he made a war movie called \"When The Bell Tolls\" that nobody saw, so he figured...why not splice it into this one, almost entirely? If you don't know that in advance, this is a really confusing mess. The war scenes come out of nowhere, but they end up making up more than half of this movie. It's so glaringly obvious that Batzella is just using these scenes as padding, while you just want to find out what's going on in the torture chamber (spoilers: torture). So you get fifteen minutes of terrible, yet delightfully cheesy fun and an hour of intensely boring \"sub-plots\" that barely pretend to be from the same movie. The main saving grace of this movie is the aforementioned Macha Magall, an unknown actress that made her last movie in 1982. For shame, because she finds the perfect balance between attractive and freightening. She's certainly an interesting screen presence, but because of Batzella's penny-pinching our lead actress is actually barely in this movie. She deserved to be in much better projects than this, but somehow never really made it into the mainstream. Then again, I guess the lack of a real legacy or any other background information does give her some kind of mystique.",
         "In the mood for something ridiculous and campy? I have the perfect solution. Hogan's Heroes meets Dr. Mengele in SS Hell Camp, where a Nazi officer/scientist creates a hybrid man-beast who would do well in XXX porn. The fellow is insatiable and looks like the caveman in the Geico commercial. The Germans provide an endless stream of prison camp girls to satisfy the lust of the Cro-Magnon man and the result is hilarious. Filled with nudity and violence, and set in a lab with a cage in the middle, this is the ultimate low budget b-movie, or video nasty, as it is called in England. The combination of torture and sex has the epic banned in several countries. Technically, it is at the level of a super 8 home movie; do not expect a Technocolor feature. It is what it is; an Italian masochistic mess."
      ],
      "genres": [
         "Horror",
         "War"
      ],
      "productionCompanies": [
         "Eterna Film",
         "Sonora Films"
      ],
      "summaries": ["This is one of many so called Video Nasties about fictionalized World War 2 Nazi POW camp atrocities. A beautiful, nefarious senior female SS officer/doctor (Magall) creates a genetic, mutant human Beast (half man/half beast). The Beast is a rapacious, squat, mongoloid sex fiend which she uses to torture and molest female prisoners while the Nazis watch. The vertically challenged beast is kept on a diet of mega-aphrodisiacs. There is plenty of sadistic titillations, gore and nudity in this Nazi sub-genre exploitation flick."],
      "budget": 0
   },
   "movielensId": 125892,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1977-07-19",
      "dvdReleaseDate": null,
      "directors": ["Luigi Batzella"],
      "runtime": 86,
      "movieId": 125892,
      "title": "The Beast in Heat",
      "mpaa": null,
      "actors": [
         "Macha Magall",
         "Gino Turini",
         "Edilio Kim",
         "Xiro Papas",
         "Salvatore Baccaro",
         "Brigitte Skay",
         "Alfredo Rizzo",
         "Benito Pacifico",
         "Brad Harris",
         "Giuseppe Castellano"
      ],
      "imdbMovieId": "0076649",
      "originalTitle": "La bestia in calore",
      "genres": [
         "Horror",
         "Thriller",
         "War"
      ],
      "youtubeTrailerIds": [
         "GL9BlnrDrqE",
         "X4p8CE5AMvw"
      ],
      "plotSummary": "In a remote village in occupied Europe, the SS pursue their inhuman treatment of captured partisans in efforts to force them to betray their comrades.... while Fraulein Krast, a sadistic biologist, concentrates her efforts on the womenfolk with refined tortures and humiliation, leaving them to the mercy of a sex-crazed half-man, half-beast she has created with experimental injections.... And as advancing Allied forces approach the village, Krast herself becomes a victim of her own fiendish rituals....",
      "tmdbMovieId": 36879,
      "avgRating": 1.5,
      "releaseYear": "1977",
      "numRatings": 1,
      "posterPath": "/evayVpPpB10o06ugj609pO1V06p.jpg"
   }
}