{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0026095",
      "video": false,
      "title": "La Bandera",
      "recommendations": [],
      "backdrop_path": "/agLuC0LfYkYqDr3DDhrsBan9mhe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Pierre Gilieth",
               "gender": 0,
               "credit_id": "52fe4869c3a368484e0f743f",
               "name": "Jean Gabin",
               "profile_path": "/8CxpWkEoipIsBF9P2D0ypzzSHhs.jpg",
               "id": 11544,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Aïscha, la Slaoui",
               "gender": 1,
               "credit_id": "52fe4869c3a368484e0f7443",
               "name": "Annabella",
               "profile_path": "/lxdcslOw20C2o04YdrqImCV5izu.jpg",
               "id": 82789,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Planche-à-Pain",
               "gender": 1,
               "credit_id": "52fe4869c3a368484e0f7447",
               "name": "Margo Lion",
               "profile_path": "/63c3JlYDtodZLzHRulaRpprWS1I.jpg",
               "id": 35879,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rosita",
               "gender": 0,
               "credit_id": "52fe4869c3a368484e0f744b",
               "name": "Reine Paulet",
               "profile_path": "/yEapSCWQS8fnzO6ejuxcZMyV95q.jpg",
               "id": 580210,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "la fille de Barcelone",
               "gender": 1,
               "credit_id": "52fe4869c3a368484e0f744f",
               "name": "Viviane Romance",
               "profile_path": "/k3WmC0AuUQEDn8xPpmvfAyvk4nO.jpg",
               "id": 39471,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "la fille du restaurant",
               "gender": 0,
               "credit_id": "52fe4869c3a368484e0f7453",
               "name": "Génia Vaury",
               "profile_path": null,
               "id": 140361,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "la femme ivre",
               "gender": 0,
               "credit_id": "52fe4869c3a368484e0f7457",
               "name": "Claude May",
               "profile_path": null,
               "id": 39671,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Fernando Lucas, le mouchard",
               "gender": 2,
               "credit_id": "52fe486ac3a368484e0f745b",
               "name": "Robert Le Vigan",
               "profile_path": null,
               "id": 49000,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "le capitaine Weller",
               "gender": 0,
               "credit_id": "52fe486ac3a368484e0f745f",
               "name": "Pierre Renoir",
               "profile_path": "/vTPiGLkZ2GGOL1sOlDC8Jqc8i3q.jpg",
               "id": 25159,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "le soldat Muller",
               "gender": 2,
               "credit_id": "52fe486ac3a368484e0f7463",
               "name": "Gaston Modot",
               "profile_path": null,
               "id": 11543,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "le sergent dans le train",
               "gender": 2,
               "credit_id": "52fe486ac3a368484e0f7467",
               "name": "Noël Roquevert",
               "profile_path": "/9OOPCNPl0nwsMDd82tJRhgVtTJ6.jpg",
               "id": 12272,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Marcel Mulot",
               "gender": 2,
               "credit_id": "554fcf2492514110bd002f11",
               "name": "Raymond Aimos",
               "profile_path": "/pdKOCpsulH6FnT5toQe6OUnBGWL.jpg",
               "id": 308779,
               "order": 11
            },
            {
               "cast_id": 28,
               "character": "Le ségovien",
               "gender": 0,
               "credit_id": "56d59d48c3a3681e3c019248",
               "name": "Charles Granval",
               "profile_path": "/pKQY2zHCWaOQ3kvOfrDDyckvMgG.jpg",
               "id": 94942,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Le sergent",
               "gender": 0,
               "credit_id": "554fcf55c3a3685b5500238e",
               "name": "Jesús Castro Blanco",
               "profile_path": null,
               "id": 1416665,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Le légionnaire tatoué",
               "gender": 0,
               "credit_id": "554fcf6192514162f2002489",
               "name": "Robert Ozanne",
               "profile_path": null,
               "id": 94947,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Siméon",
               "gender": 0,
               "credit_id": "554fcf71c3a3685b55002392",
               "name": "Maurice Lagrenée",
               "profile_path": null,
               "id": 1342465,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Gorlier",
               "gender": 2,
               "credit_id": "554fcf7dc3a3686d06000062",
               "name": "Louis Florencie",
               "profile_path": null,
               "id": 263123,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Le légionnaire Weber",
               "gender": 0,
               "credit_id": "554fcf8792514110bd002f18",
               "name": "Little Jacky",
               "profile_path": null,
               "id": 1465752,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Le lieutenant",
               "gender": 0,
               "credit_id": "554fcf999251414b38000142",
               "name": "Robert Ancelin",
               "profile_path": null,
               "id": 1465753,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Le lieutenant",
               "gender": 0,
               "credit_id": "554fcf99c3a3685221000759",
               "name": "Robert Ancelin",
               "profile_path": null,
               "id": 1465754,
               "order": 19
            },
            {
               "cast_id": 22,
               "character": "",
               "gender": 2,
               "credit_id": "554fcfa0c3a3687b7d002950",
               "name": "René Bergeron",
               "profile_path": "/xwWIP2CNLP4rb3ZjvBBzO7rHquC.jpg",
               "id": 94943,
               "order": 20
            },
            {
               "cast_id": 23,
               "character": "L'importun de l'auberge",
               "gender": 2,
               "credit_id": "554fcfaac3a3687f63002863",
               "name": "Paul Demange",
               "profile_path": "/zhDJhQApR2gyq7jUsL3WknuDDSe.jpg",
               "id": 144963,
               "order": 21
            },
            {
               "cast_id": 24,
               "character": "Un légionnaire",
               "gender": 2,
               "credit_id": "554fcfb492514110bd002f1e",
               "name": "Marcel Lupovici",
               "profile_path": null,
               "id": 1043503,
               "order": 22
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "554fcfcd9251413ea100094e",
               "name": "Rafael Medina",
               "profile_path": null,
               "id": 1465756,
               "order": 23
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 0,
               "credit_id": "554fcfd7c3a3682254004c5d",
               "name": "Suzy Prim",
               "profile_path": "/cjx8lP22vslwIIBTR07cWeE6HVr.jpg",
               "id": 213448,
               "order": 24
            },
            {
               "cast_id": 27,
               "character": "Le sergent instructeur",
               "gender": 2,
               "credit_id": "554fcfe09251413ea1000953",
               "name": "Noël Roquevert",
               "profile_path": "/9OOPCNPl0nwsMDd82tJRhgVtTJ6.jpg",
               "id": 12272,
               "order": 25
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4869c3a368484e0f743b",
            "name": "Julien Duvivier",
            "profile_path": "/Hm7rqRuqGLtsUdSTyuDXfvXYk5.jpg",
            "id": 39058,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.235745,
      "production_countries": [],
      "id": 72400,
      "vote_count": 3,
      "budget": 0,
      "overview": "Pierre Gilieth has committed a murder in Paris. He flees to Barcelona, where he runs out of money. So he joins the Spanish Foreign Legion. He meets there two fellow countrymen, Mulot and Lucas. He tries to forget his fault... but Lucas's friendship soon appears to be less unselfish...",
      "similar": [],
      "original_title": "La Bandera",
      "runtime": 88,
      "poster_path": "/dSNbNlgOBPtD18zjLBxAVqWnrgp.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1935-09-25",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Julien Duvivier"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Pierre Dumarchais",
         "Julien Duvivier"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0026095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0Nzg5OTk2MF5BMl5BanBnXkFtZTcwMDYxMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Annabella, Jean Gabin, Robert Le Vigan | See full cast and crew »"],
      "reviews": [
         "\"La bandera\" is one of Julien Duvivier's most famous movies,but it seems a bit dated now.People who saw a version of \"Beau Geste\" cannot help but be struck by the similarities between the two stories:the \"legion etrangere\" ,as a way out when the police is hot on your heels.But whereas Beau Geste characters are noble,distinguished and chivalrous,Duvivier's hero and his mates are riffraff .The main character,played by Gabin ,is a good guy who committed an unpremeditated murder. The best part of the movie ,in my opinion,is the description of the fort,the barrack-rooms,the brothel .Here,the hero falls in love with a morrocan girl.There's the rub:she's played by Annabella (who was Tyrone Power's wife) who does not look like a North African,not at all,hence the necessity to make her up outrageously ,with ugly results. Like in \"Beau Geste\",the Arabs are the baddies,period.The courageous legionnaires always call them \"les salopards\" (the bastards).Duvivier achieves a real tour de force here:we never see the enemy when they attack the little fort!The poisoned water is a good dramatic idea and the final echoes Edith Piaf's song \"le fanion de la légion\". However,\"la bandera\",with its military stereotypes, does not equal Duvivier's other pre-war works \"la fin du jour\" ,\"carnet de bal\" , \"la belle équipe\" or \"pépé le moko\" ,the latter taking place in North Africa too.",
         "If you like your meat salty and undercooked and have already tasted the treat that is Jean Gabin on film, this is about as early as you can step back in his career and still get a satisfying meal. He is marching toward his roguish best in this foreign legion romance, and the locations and decor are alluring, even in the faded print I have on DVD. I'm guessing this might be the first film in which he performs his slow burn to explosion, and MAN is this scene -- in close-up -- great! I don't know much about the beginnings of the poetic realist movement in French cinema, but Duvivier was one of its main practitioners, and this is a precursor to his great PEPE LE MOKO, where the powerful, rash man is driven to destruction by love. Though not as accomplished as the later Gabin romances PORT OF SHADOWS, THE HUMAN BEAST, or LE JOUR SE LEVE, LA BANDERA has its charms. In addition to a great role and performance by Gabin, there is a strong supporting cast including Raymond Aimos, Pierre Renoir, and the indispensable Gaston Modot. Recommended!",
         "Duvivier, Gabin, what's to be bad, right. W - e - e - ll, I have to say right off that this could have been better; Gabin had already appeared in an earlier Duvivier entry, Maria Chapledaine and within a couple of years he would score really heavily in Duvivier's Le Belle equipe and Pepe Le Moko - in fact you could argue that this is something of a dress rehearsal for Pepe given that in both films Gabin winds up in North Africa escaping a criminal past in France. Most of the faults are in the script. After a brief opening sequence in Paris - which anticipates Le Jour se leve with Gabin starting the film by ending a life - we switch abruptly - and for no satisfactory reason - to Barcelona where Gabin has his pocket picked with nothing more made of it. Then he enlists in the Spanish Foreign Legion and this is where the story really starts - again there is a foretaste of Pepe Le Moko in that a relentless cop, Robert Le Vigan, clearly mistaking Gabin for Jean Valjean, hounds him as he would be hounded in the Casbah. Top-billed Annabella doesn't really convince as an Arab dancing girl anymore than the instant attraction and marriage between her and Gabin. Another poster has pointed out the ludicrousness of having a well OUTSIDE the fort which makes it that much easier for the enemy to pick off the Legionnaires as they venture outside lest they dehydrate. On the other hand this IS a Duvivier film and Duvivier WAS a genius so there are moments to savour and as I've said before even an off-form Duvivier is light years better than Godard on the best day he ever had.",
         "I read La Bandera a year or two ago and finally hunted down the DVD. It's pretty faithful to Mac Orlan's text (Dumarchais? IMDb must be putting on airs). This adventure yarn is better than a lot of his pirate stories, but still doesn't rise much above an adolescent's fantasy of the Spanish Foreign Legion. I especially liked Gabin - young, athletic, dumb and out of control. The love story with Annabella seems tacked on and out of the blue, but it's true to the text it's taken from. The random stupidity of racing through the desert on Model A flatbeds after phantom snipers and gun-runners rings truest. This film is not on a humanist/moralist level with La Grand Illusion or Paths of Glory. It's an existential image of war-as-it-happens. The settings are stark, bright and always exposed. Sudden death is intertwined with the boredom of the barracks.",
         "A few observations before I discuss the film in detail. First, the English captioning of this DVD is rather poor. While the body of the text seemed okay, the grammar wasn't and a few times sentences just didn't make much sense. Second, Annabella is billed first. However, she's not even in the film until it's half complete and even then, it's clearly a Jean Gabin starring film. She was a bigger star at the time and later married Tyrone Power, incidentally. Third, the film is about the Spanish Foreign Legion--a group started in 1920. Despite three Frenchmen and an American in the regiment, apparently there were actually very few foreigners in its ranks. And, those who did serve were mostly Hispanics from the Americas--especially Cuba. The film begins with Pierre (Gabin) in Spain--having run away from a murder he committed back home in Paris. He's broke, hungry and homeless. In desperation, he enlists in the Spanish Foreign Legion. However, there is an odd man who also enlists, Fernando (Robert Le Vigan)--an odd man who begins bating Pierre. Perhaps Fernando knows about Pierre's past. Regardless, Pierre goes to the commanding officer to request that the two be put in separate units--which is done. However, a bit later, Fernando is back--and a showdown is certain between them. This film, superficially, looks like \"Beau Geste\". However, in style it's quite different. \"Beau Gest\" is quite sentimental and the important part of the film is the back story. You also really like the characters--they are noble and decent. However, \"La Bandera\" is more existential--perhaps like a novel by Camus. Yes, there is a past--but the film really is set in the present and there is very little sentiment. Plus, Pierre is NOT a good guy--and the film is a much more amoral or non-judgmental sort of picture. This makes \"La Bandera\" seem a bit more realistic but also a lot less satisfying. It's just hard to really care about the guy. This, by the way, is true in several of Gabin's films of the era, such as \"La Bête Humaine\". Well worth seeing but I think I prefer the sentiment and style of the American film.",
         "It made me nostalgic for a time and place I never experienced: the mid 1930 in Barcelona, Paris and North Africa. The range of everyday objects is so radically different from my time and space that it makes those olden times simpler, thus more meaningful. This is before TVs, commercial airplanes, computers. It made it easier to concentrate on the scenery, the people themselves, the story and morals behind it, there was less distraction. The protagonist, played by 31 year old Jean Gabin, kills someone in Paris, flees to Barcelona, runs out of money joins the foreign legion, but a cop follows him there too. I won't give away the end of the action though. Despite being a(n accidental) murderer, Gabin plays an honorable man. The movie's focus is about honor as the title (meaning Flag) suggests too. But looking from today the concept of honor is limited: women and Arabs are excluded by default. The former group is clearly subservient and in best case are good looking prostitutes. The latter group is not even shown (with one short exception) despite that the second half of the movie is about the heroic European soldiers who fight them, the inferior \"bastards\". So maybe, thinking about my 21st century social sensitivity I should not think so nostalgically of that era. I loved the overhead shots on the street of Barcelona's markets. They were so full of life.",
         "A loose and baggy French orientalist romance, in which tough guy Pierre Gillieth (Jean Gabin) flees Paris after killing a man in the midst of a violent disagreement, winds up in Barcelona, where he decides to join Spain's Foreign Legion. He and a bunch of other colourful guys do so, and wind up somewhere in North Africa, wearing the tasseled caps of Spanish soldiers and hanging out in an exotic bar where the beautiful dancer Aisha (Annabella) and Gillieth fall in love instantaneously and they marry. She's sparky and irrepressible and he's solid and happy, until the scarily jolly bad guy, actually a cop, shows up and disturbs the escape plan. Fortunately, the Legion needs 24 volunteers to hold off an uprising, and nobody is expected to survive, and of course both Gillieth and the cop go, and everybody dies except the two of them, and just as the relief arrives, Gillieth takes the last bullet, leaving the cop, who has relented, to declare his friend's heroism and deliver the bad news to Aisha, who has a close-up in which her huge eyes fill with tears and her lips tremble and she turns away. The film is mostly awful, a nasty piece of European colonialism, complete with a merciless and faceless enemy. The scenery is interesting, the dialogue mostly tepid, Gabin predictable, leaving only Annabella to stand out, with her exotic dances and her filmy gowns and her enchanting smile for Gabin and the curious henna markings on her forehead and chin.",
         "I grabbed La Bandara because it reunited Jean Gabin and Julien Duvivier, whose Pepe le Moko is a noir masterpiece. I'll give it a few points because Gabin is in it, but the clumsy plot, cheap sets and the ludicrous Annabella making like an Arab princess put the film on my `to sell' shelf. If you watch it, you'll find yourself asking, why didn't the idiots build the fort *around* the well, instead of a deadly few yards away from it. And why use tin roofs in the middle of the desert? But by then the sheer perversity of contrivance that makes up the script should numb you to any further contemplation."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Société Nouvelle de Cinématographie (SNC)"],
      "summaries": [
         "Pierre Gilieth has committed a murder in Paris. He flees to Barcelona, where he runs out of money. So he joins the Spanish Foreign Legion. He meets there two fellow countrymen, Mulot and Lucas. He tries to forget his fault... but Lucas's friendship soon appears to be less unselfish...",
         "Pierre Gilieth has murdered a man in France, and escapes to join the Spanish Foreign Legion. One of the soldiers he meets and becomes friends with is Fernando Lucas who is really a member of the secret police whose goal is to trap Gilieth into admitting his guilt. Gilieth also falls in love with and marries Aischa la Slaoui, an Arabian dancing girl. Gilieth and Lucas, now mortal enemies, are the last two survivors of a desert outpost under siege by Riff soldiers. The troop commandant, before he dies, makes Lucas realize that Gileith has more than expiated his crime back in France by his heroism under fire."
      ],
      "budget": 0
   },
   "movielensId": 125888,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1935-09-25",
      "dvdReleaseDate": null,
      "directors": ["Julien Duvivier"],
      "runtime": 88,
      "movieId": 125888,
      "title": "La Bandera",
      "mpaa": null,
      "actors": [
         "Jean Gabin",
         "Annabella",
         "Margo Lion",
         "Reine Paulet",
         "Viviane Romance",
         "Génia Vaury",
         "Claude May",
         "Robert Le Vigan",
         "Pierre Renoir",
         "Gaston Modot",
         "Noël Roquevert",
         "Raymond Aimos",
         "Charles Granval",
         "Jesús Castro Blanco",
         "Robert Ozanne",
         "Maurice Lagrenée",
         "Louis Florencie",
         "Little Jacky",
         "Robert Ancelin",
         "Robert Ancelin",
         "René Bergeron",
         "Paul Demange",
         "Marcel Lupovici",
         "Rafael Medina",
         "Suzy Prim",
         "Noël Roquevert"
      ],
      "imdbMovieId": "0026095",
      "originalTitle": "La Bandera",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Pierre Gilieth has committed a murder in Paris. He flees to Barcelona, where he runs out of money. So he joins the Spanish Foreign Legion. He meets there two fellow countrymen, Mulot and Lucas. He tries to forget his fault... but Lucas's friendship soon appears to be less unselfish...",
      "tmdbMovieId": 72400,
      "avgRating": 2.5,
      "releaseYear": "1935",
      "numRatings": 1,
      "posterPath": "/iwPGQZOsTfg8h4hYL5ybIjQkIAe.jpg"
   }
}