{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William A. Graham"],
      "runtime": 192,
      "synopsis": null,
      "writers": [
         "Ernest Tidyman",
         "Charles A. Krause"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080832/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4Njg1OTUyNl5BMl5BanBnXkFtZTcwNTk5NjYxNA@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Powers Boothe, Ned Beatty, Irene Cara | See full cast and crew »"],
      "reviews": [
         "I read a few reviews of this TV movie which all said that the film dragged on for too long and that it was basically only sensationalistic entertainment. I agree that perhaps, the film goes on a bit too long (2h30 would have been enough...) but I certainly do not think it sensationalize the subject matter. Jim Jones' expansive power trip and slow degradation into mental illness, paranoia and drug abuse are never treated in a voyeuristic manner. The movie takes its time in showing how Jones recruited followers (Brenda Vaccaro's and Brad Dourif's character are stand-outs in that matter) but also in observing an uncanny shift in Jones' perception of reality. It is mind-boggling to see an egalitarian, left-wing and compassionnate preacher become such a destructive and cruel dictator. Perhaps the movie doesn't explore Jones' motivations enough, which can make the whole ordeal a bit superficial at times (may have to do with censorship as well...) But Powers Boothe's mesmerizing performance makes it all come true. I am not familiar with the details of the real Jim Jones' life, but Boothe sure makes the monster he plays believable and real. The movie features many strong scenes, among them the preaching messes of Jones, Jones's meeting with Father Divine (a remarquable James Earl Jones), Congressman Leo Ryan (Ned Beatty)'s visit to the Guyana camp and of course, the suicide scene. It is quite a gloomy spectable to watch and Boothe is quite commanding in those last moments. Madge Sinclair shines in this scene as one of the suddenly sceptic follower, and so do Veronica Cartwright (as Jones' wife) and Brad Dourif, especially when their time comes to drink the murderous potion. The relative calm of the end of this scene, the tasteful direction and the contrasting beauty of the natural surroundings all work in making those images quite impossible to erase from one's mind. A disturbing reflection on human nature and its weaknesses. Worth watching, if only to keep in mind one of the truly horrific events of the 20th century. Not to let it be repeated again. Like, ironically, the inscription in Jim Jones' camp: \"Those who do not know the past are bound to repeat it\".",
         "Powers Boothe turns in a stellar performance as 1970's cult figure Jim Jones of the Peoples Temple. Jones physical likeness to Jones is uncanny and the story is acted out chillingly. The movie keeps you riveted and is a must see for anyone. check it out.",
         "This is an awesome film and Powers Boothe's performance is what makes it. When it was first broadcast on CBS-TV in 1980, Time Magazine even had an article on it. The magazine didn't think much of the film in general, but it said there is one unforgettable performance in it, \"a young actor named Powers Boothe captures all the rage, power, evil and charisma of \"Dad\" Jim Jones. It was most unusual for them to cast a young unknown actor in such an important role, but Powers Boothe proved his worth in spades! He won an Emmy for his dynamite portrayal. There was an actor's strike at the time and he was one of the only ones who showed up to accept his award, \"this may be the bravest moment of my career or the most stupid\" he said. This film shows Jone's rise to power in the People Temple. Originally he was a good man of God who wanted to help others, but something went horribly wrong. Boothe captures the sinister evil that was Jim Jones, but also his charisma and charm as well. Debbie Layton was one of the few people who survived the massacre in Guyana. She knew Jones very well and said that Jones was evil but he was also very clever and good at fooling people. Jones appealed to poor blacks and people without a direction in life. He promised them a better life and a utopia in \"Jonestown\". The final scenes of the film detailing the horrible mass suicide in November 1978 are gut wrenching. Out of 913 dead, only Jones and his nurse had not taken poison. Boothe captures Jones rhythmic, haunting preacher cadences and his words to the dying are taken from Jone's actual words. He was recording himself at the time. We must never forget this evil man and the horror he perpetrated upon the world. Those who forget the mistakes of history are only doomed to repeat them. In Search Of...had a show on Jim Jones once and at the end the host Leonard Nimoy said that there are still people who venerate Jim Jones who sleep with his picture and who believe that he is the only person who ever loved them. That is truly sad indeed. By the way, it surprised me that Powers Boothe's career never took off the way it should have after he made this incredible debut. He beat out Henry Fonda and Jason Robards to win his Emmy. He played Phillip Marlowe in an HBO series of short films and was in A Cry For Love, Southern Comfort, Red Dawn, A Breed Apart, The Emerald Forest, Extreme Prejudice and Into The Homeland, but the only really good part he played that was close to this one was when he played Soviet spy John Walker in the 1990 tv film Family Of Spies.",
         "When I first saw the video at the video store, I was fascinated. I remember seeing the Waco Branch Davidian cult compound burn and reading about Jonestown in Time and Newsweek in 1993, and I was intrigued as to why so many people would readily lay down their lives for some madman like David Koresh or Jim Jones. So, I rented Guyana Tragedy for some insight into the Peoples Temple cult. What I saw was very interesting to watch. Powers Boothe did an excellent job as Jim Jones, in my opinion. You can see how persuasive, demanding, and maniacal Jones really was. And the other characters in the movie are all well-played. James Earl Jones makes a small appearance as Father Divine, but he stands out as only he can, Darth Vader voice and all. Ned Beatty, Randy Quaid, LeVar Burton all shine here. This surprised me in that it was more watchable than I thought it would be. A VERY nicely-done movie, worth anyone's viewing.",
         "Certainly this is the best work Powers Boothe has done and he deservedly got an Emmy for it. As an aside, I can recall the awards night because there was a Screen Actors Guild strike or something and nearly all of the nominees failed to attend the ceremonies. But when Boothe's name was called out as a winner, he defiantly strode up to the podium to get his trophy. People may want to read the book \"Raven\" which is a biography about Rev. Jim Jones and the Peoples Temple; this TV movie can only scratch the surface of the demonic goings-on in the Temple without demanding more censorship than a TV show could allow, at least back then. Boothe is hypnotic as Jim Jones and you get the sense that he wasn't always whacked out and loony. A particularly good scene is when Jones stands in front of an abandoned synagogue in the black-ghetto part of town. The only white man there, he's soon surrounded by obviously skeptical blacks. \"Will you pray with me?\" Jones asks, and the bystanders do as Jones gives a heartfelt prayer that God will lift their burdens. The bystanders are impressed and in a short time the Peoples Temple is prospering. Boothe perfectly recreates the candence and timbre of Jones' preaching and phony faith-healing and his lustful disposition towards the women of his congregation. Jones's sexual exploits don't end there and he later has an affair with drug-addicted Brad Dourif, as well (in fact, Jones had sex with plenty of his male followers). The end of the movie where the cult members all commit suicide is very frightening. All the more so because nearly all of the dialogue is exactly what was spoken---Jones had been tape recording his harangues and the tape ended probably not long before he was killed himself. By the way, Jones never took the cynanide-laced kool-aid, he was shot which led many to believe that Jones had no intention of going off into the hereafter but was planning his escape when one of henchmen decided to have Jones join his \"flock\".",
         "A well cast summary of a real event! Well, actually, I wasn't there, but I think this is how it may have been like. I think there are two typically American standpoints evident in the film: 'communistophobia' and parallels to Adolf Hitler. These should be evident to most independent observers. Anyway, Boothe does a great performance, and so do lots of other well-known actors. The last twenty minutes of the film are unbearable - and I mean it! Anyone who can sleep well after them is abnormal. (That's why it's so terrible - it all happened, and it probably looked just like that). But, actually, did that last scene on the air station really take place?",
         "Sure Guyana Tragedy eschews sex scenes and four letter words...it still somehow manages to be totally convincing. I can't imagine anyone except Powers Boothe in the role of Jim Jones and his supporting cast is outstanding. There are a lot of familiar faces, but the film avoids the 'hey, look at LeVar Burton in a guest spot!' pitfall. Brad Dourif is particularly good as the young junkie turned Jonestown MD who cooks up the special Kool-Aid at the end. The best TV movie ever? Possibly. It certainly avoids some of the cliches of The Day After.",
         "Just given the fact that it is based on the most infamous mass suicide incident of modern times would have been enough to give this 2-part 1980 made-for-TV film attention. But the fact is that it is a superb recreation of the life of the Rev. Jim Jones, who built a church into a virtual empire, and then encouraged it to disintegrate into a sleazy cult in which a Congressman and his entourage were assassinated, and 917 cult followers committed suicide by drinking Kool-Aid doused with cyanide. Done very tastefully but horrifying enough, unlike the excruciatingly sadistic CULT OF THE DAMNED, GUYANA TRAGEDY features an all-star cast, including Ned Beatty (as Rep. Leo Ryan), Meg Foster, Randy Quaid, Brad Dourif, Brenda Vaccaro, LeVar Burton, and Madge Sinclair. But it is Powers Boothe (in his first big role) that really stands out as Jim Jones. He actually BECOMES the man, and his performance is riveting and chilling. Thus, it is no wonder that this film still manages to attract attention after more than twenty years.",
         "Powers Booth is hypnotic as cult leader jim jones who led his Peoples Temple followers from 1953 until 1978 when he led them in a mass suicide in 1978 where over 900 died. A very well done movie which may seem a little dated due to the 70s time period but well worth the time 8 of 10",
         "I've seen this film literally over 100 times...it's absolutely jam-packed with entertainment!!! Powers Boothe gives a stellar performance. As a fan of actors such as William Shatner (Impulse, 1974) and Ron Liebmann (Up The Academy, 1981)I never thought an actor could capture the \"intensity\" like Shatner and Liebmann in those roles, until I saw Boothe as Jim Jones! As far as I'm concerned, Powers Boothe IS Jim Jones...this film captures his best performance!!!"
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Konigsberg Company"],
      "summaries": [
         "Based upon the true story of Jim Jones, a self-proclaimed prophet. In the 1960s, he began as an idealist helping minorities and working against racism. Later, after increased power and attention, Jim Jones became focused on his belief in nuclear holocaust. He had a loyal following of about 1000 people, who had donated their entire life savings to him to join his commune. When possible illegal activities came to the attention of the authorities, they started to investigate. Rather that faces the charges, Jim Jones committed suicide, and convinced virtually all of his followers to do the same.",
         "The story of the Peoples Temple cult led by Rev. Jim Jones and the events involving its move to Guyana and its eventual mass suicide."
      ],
      "budget": 0
   },
   "movielensId": 125950,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-04-15",
      "dvdReleaseDate": null,
      "directors": ["William A. Graham"],
      "runtime": 192,
      "movieId": 125950,
      "title": "Guyana Tragedy: The Story of Jim Jones",
      "mpaa": "PG-13",
      "actors": [
         "Powers Boothe",
         "Ned Beatty",
         "Irene Cara",
         "Veronica Cartwright",
         "Brad Dourif",
         "Meg Foster",
         "Michael C. Gwynne",
         "Albert Hall",
         "Linda Haynes",
         "Diane Ladd",
         "Ron O'Neal",
         "Randy Quaid",
         "Diana Scarwid",
         "Madge Sinclair",
         "Brenda Vaccaro",
         "Dimitra Arliss",
         "LeVar Burton",
         "Colleen Dewhurst",
         "Clifton James",
         "James Earl Jones",
         "Ed Lauter",
         "John Dukakis",
         "Benji Wilhoite",
         "Danny Nelson",
         "Joe Dorsey",
         "Tony King"
      ],
      "imdbMovieId": "0080832",
      "originalTitle": "Guyana Tragedy: The Story of Jim Jones",
      "genres": [
         "Drama",
         "TV Movie"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of the Peoples Temple cult led by Jim Jones and the events leading up to one of the largest mass suicides in history.",
      "tmdbMovieId": 67866,
      "avgRating": 3.42857,
      "releaseYear": "1980",
      "numRatings": 7,
      "posterPath": "/eQL9eUc17FGrAVPnilQ9TS0BmPO.jpg"
   }
}