{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "counter-culture",
            "id": 12192
         },
         {
            "name": "disciples",
            "id": 163163
         },
         {
            "name": "multiple murders",
            "id": 173224
         }
      ],
      "imdb_id": "tt0068918",
      "video": false,
      "title": "Manson",
      "recommendations": [
         54642,
         250668
      ],
      "backdrop_path": "/5fwqDCKT48q0f3p8cv19xqaxpLe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48a0c3a36847f8171387",
               "name": "Charles Manson",
               "profile_path": "/ukGqBkorrKCK7Psiv3aZCUR1Jml.jpg",
               "id": 150786,
               "order": 0
            },
            {
               "cast_id": 1003,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48a0c3a36847f8171397",
               "name": "Vincent Bugliosi",
               "profile_path": "/bvCHQmiTOawR2oCEqD5mqjPlzhz.jpg",
               "id": 81439,
               "order": 1
            },
            {
               "cast_id": 1004,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe48a0c3a36847f817139b",
               "name": "Lynette Fromme",
               "profile_path": "/6yGitpS8NE2GPb0Y6j5rSNzTgvq.jpg",
               "id": 1173715,
               "order": 2
            },
            {
               "cast_id": 1005,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe48a0c3a36847f817139f",
               "name": "Bruce Davis",
               "profile_path": "/6s24Gw0ua4s3NlowYMGrx4nm3nW.jpg",
               "id": 1173716,
               "order": 3
            },
            {
               "cast_id": 1006,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe48a0c3a36847f81713a3",
               "name": "Paul Watkins",
               "profile_path": null,
               "id": 1173717,
               "order": 4
            },
            {
               "cast_id": 1009,
               "character": "Herself",
               "gender": 0,
               "credit_id": "56418ebf92514128a4001d8b",
               "name": "Mary Brunner",
               "profile_path": null,
               "id": 1533867,
               "order": 5
            },
            {
               "cast_id": 1010,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "5795468ec3a36828e1002aa0",
               "name": "Jesse Pearson",
               "profile_path": null,
               "id": 197464,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48a0c3a36847f817138d",
               "name": "Robert Hendrickson",
               "profile_path": null,
               "id": 1173714,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48a0c3a36847f8171393",
               "name": "Laurence Merrick",
               "profile_path": null,
               "id": 1043175,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "56418e6892514128a1001cf7",
               "name": "Joan Huntington",
               "profile_path": null,
               "id": 151443,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56418e77c3a3685be8001c04",
               "name": "Laurence Merrick",
               "profile_path": null,
               "id": 1043175,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.18046,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 54505,
      "vote_count": 5,
      "budget": 0,
      "overview": "Prosecuting attorney Vincent Bugliosi and Manson \"family\" members Lynette Fromme, Mary Brunner and Sandra Good discuss the Tate-LaBianca murders.",
      "similar": [],
      "original_title": "Manson",
      "runtime": 83,
      "poster_path": "/1vDa2utC30Tc6f19M4vANt5NLko.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Tobann International Pictures",
            "id": 67525,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Merrick International",
            "id": 67526,
            "origin_country": ""
         }
      ],
      "release_date": "1973-01-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "See and hear the actual family.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Robert Hendrickson",
         "Laurence Merrick"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Joan Huntington",
         "Laurence Merrick"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068918/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODE0MjgzODkxNF5BMl5BanBnXkFtZTYwNDgzMjg5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Mary Brunner, Vincent Bugliosi, Bruce Davis | See full cast and crew »"],
      "reviews": [
         "This documentary not only captures the deranged philosophy of the Manson family, but it looks sleazy overall. Much of the footage is grainy and unsteady, adding to the brittle feel of the movie, but the interviews with Manson's followers speak for themselves. Makes for interesting viewing in conjunction with \"Gimmie Shelter\", which documented the clash of hippie culture and violent bikers at the Rolling Stones concert at Altamont Speedway. Both of these events signalled the end of the \"flower power\" movement, but these two movies seem to point out the danger that mind-altering drugs can pose to suggestible kids. Indeed, a lot of the interviews contained in \"Manson\" outline the essential role of marijuana and acid in the lifestyle of \"the family,\" and the film clearly posits that Manson used drugs, as well as sex, to brainwash his followers. What's most terrifying about this movie are the candid appearances of the Manson women, staring wide-eyed and generally behaving like automatons. The time was clearly right for an evil individual such as Charles Manson to invade a supposedly peace-loving culture like the hippies, stoned and generally aimless, and orchestrate chaos, and the altered state that these people were in clearly contributed to their own propensity for disillusion and mind control. What comes off as mostly lacking is the depiction of Manson himself. Although the filmmakers give plenty of background on him, the bizarre images of this man contained in the film do very little to give an accurate depiction of how he must have appeared to his followers. I was haunted by the lingering question of what could possibly have motivated Charles Manson to orchestrate these heinous murders, and even worse is to think that his wishes were carried out by kids who came from seemingly normal backgrounds. The use of split-screen, as well as the \"flower power\" soundtrack, add to the quintessentially 70s feel of the movie, but even through all the kitschy hippie images, the shocking nature of the murders, and the tragic phenomenon of Manson's cult, remains. It left me feeling dirty and disturbed after watching it.",
         "\"Manson\" is a sad, disturbing film. It's horrible enough to hear the details of the Tate/LaBianca murders being recounted and to see the vicious, empty look in the eyes of Charlie's girls as they brandish guns and spout their guru's \"philosophy\"...but that's not all this documentary has to offer. Indeed, it poses a question of even greater importance than Manson's crimes: what happened in the '60s? Why did it all end so badly? The soundtrack, performed by former Family members \"Little\" Paul Watkins (at one time Manson's right-hand man) and Brooks Poston, consists of slow, slightly corny-sounding, but haunting and utterly apt acoustic songs. \"Have you ever wondered what you were here for?\" Watkins solemnly intones during the opening theme. \"Have you ever wondered, 'Is there more?'\" Later, talking about his involvement with Manson, Watkins says frankly, \"I thought Charlie was Jesus.\" It is at this point that the sociological question which meanders its way through the film like a deep, dark river becomes apparent: what made these young people feel so lost and confused that they needed a Christ-figure, and what made them believe that Charles Manson was the messiah they sought? I'm afraid that we lost the last of our innocence and goodwill at the end of the '60s...and that if we do not examine how flower power, peace symbols and the Monterey Pop Festival led to sleaze, the Manson murders and Altamont in the space of just two short years, we'll never get it back.",
         "Manson (1972) was an excellent documentary following the exploits of one Charlie Manson and his family. Unlike the boring and sanitized for the establishment \"Helter Skelter\", this film takes you within Charlie's inner circle within the family. Folks this stuff is real. The one on one interviews are geniunely frightening whilst the film-making is top notch. Parts of this movie was later referenced in \"House of a 1,000 Corpses\". If you ever wanted to find out what it's like hanging with the family, then this one's for you. Great stuff, highly recommended. I enjoyed this movie very much. I wish a restored version of this masterpiece would be re-released sometime in the near future. This is time capsule material. Worth seeking out. Not as preachy or silly as the made-for-t.v. mini-series Helter Skelter or as finger pointing as the book. A xxx",
         "\"Manson\" was filmed in the early 1970s, when Charles Manson and several of his followers were in jail (still on death row at the time of filming, though their terms were later commuted to life imprisonment). At that time many members of the \"family\" were free and still sticking together, and were, amazingly, willing to appear in this documentary. This documentary offers a fascinating window into their world; at times frolicking, childlike in the wilderness, dancing, singing, laughing, swimming, riding horses ... but at other times looking at the camera, brandishing large rifles, shotguns and hunting knives, talking about love and killing and, of course, Manson. Perhaps the most mesmerizing of them is Squeaky Fromme, who a few years later would be sent to prison for trying to assassinate President Gerald Ford, though all of them are fascinating. The producers are careful to point out the solid, often highly educated backgrounds of these women. Also interviewed are a couple of men who fled the family around the time of the Tate-La Bianca murders, who talk about life inside the family. There are also interviews with past cellmates of the women, who tell often harrowing stories of things the murderous women told them. Underlying the movie is the stark generational divide of those times. While the past and present members of the family are young, expressive and with a loose, casual look, the appearance of the prosecutor who tried the case -- and whose own account of the trial, \"Helter Skelter,\" (also a movie) is the main source of information on the case -- appears in a three-piece suit, an earnest tone of voice, and melodramatic mannerisms. If you're wondering why the Manson phenomenon happened, don't watch this hoping for an answer. And if you're looking for more information, don't bother. But if you want to see the people involved, hear them speak and find out how they thought, by all means give it a watch. An excellent documentary, largely forgotten nowadays (alas).",
         "\"Manson\" is an excellent time capsule from a very different time. It's a bit redundant at times, with all the \"shocking\" talk about sex and drugs, but the information about the crimes and the casual attitude of Manson's women (considering their backgrounds) toward violence and death is fascinating. The question is: were these people just stupid and extremely vulnerable to a person like Manson or are all of us capable of more than we'd like to think? Or were they really deeply psychologically disturbed to begin with? \"Manson\" is a beautiful, thought-provoking film.",
         "While \"Manson\" does not contain any really new information about the infamous Manson murders, it does contain lots of new information about who the family is, their \"Helter Skelter\" plan, and what they are doing today (circa 1972). \"Manson\" is a bit hard to find on video, but when I found it, I bought it and loved it! I had read \"Helter Skelter\" about 8 times and knew just about everything about the Manson case. I finally was able to see the twisted Family members being interviewed, shown skinny-dipping and sewing, dancing around, and having sex! Squeaky Fromme, Sandy Good, Nancy Pittman, Capistrano, Mary Brunner, Clem, Bruce Davis, Charles Manson, and plenty of witnesses are interviewed, giving grotesquely fascinating details about life in the Family. This is just too good to miss, any true crime buff or anyone who wants to be scared by something that REALLY happened, see this. It will give you the shivers. Features Manson and his Family singing \"Never Say Never to Always\" and two former Family members doing the rest of the fantastic music.",
         "This is one of the best documentaries made on Manson and his cult \"Family\". There is extensive footage of the most important cult members talking about \"the Family\" and life with Charlie. In addition, the film includes fascinating footage that the family members apparently took of themselves as they lived communally on the Spahn ranch. The most chilling sections involve 3 young women (Lynette Fromme,Sandra Good, Mary Bruner) who explain their views of Charlie and the Tate/La Bianca murders while each one cradles a rifle and passes a snake between them. This film also has very creative cinematography making extensive use of three-panel screens and bold primary colors saturating the frames. Since the documentary Woodstock was shot in 1970, this film seems to have been influenced by it in the use of quick cutting and the tri-panel screens. As part of the sound track there are many \"trippy\" folk songs (good .wav material) sung by two ex-Manson family members -Brooks Poston and Paul Watkins. While some of the narration by Pearson and Bugliosi is creaky and dated, the bulk of the documentary, especially the extensive interviews, is disturbing and fascinating at the same time. A very good film.",
         "I want to thank everyone for their interest in our films, especially \"MANSON\". This being the 40th anniversary of the Manson Murders and The Crime of the Century, we are making both \"The original 1973 MANSON documentary film\" and the new \"Inside the MANSON Gang\" available on Limited Edition DVDs from our new Tobann International Pictures Amazon web store. You can now see \"MANSON\" in its original widescreen format. Simply type \"The original MANSON documentary film\" into Amazon's store search or \"Inside the MANSON Gang\" into the same search box and you can find these two titles for sale. If you enjoyed the original MANSON, now you can actually travel with me as I filmed the Manson Gang 40 years ago in \"Inside the MANSON Gang\". Thank you again and let's all have a great new year. Robert Hendrickson",
         "First things first...I have been interested in the Manson Murders for over two decades. I tend to give movies, art pieces on Manson a wide birth. If I gave these things a narrow birth, this would still be a fantastic film. Everything these people say this film does it does. It is a portrait of very stupid people. It is scary. And it is like hanging out with a bunch freaky murderers... But there is more. This is the only film that captures the family at it's \"height\". (For those of you who say there was no family I use this term to encompass the entire group that worked with Manson.) It is also a fantastic vision for why people and countries need to think on their own. These sheep who were lead to slaughter were led there because of their inability to think for themselves. Most of these people were women. We must remember that this case pre-dates the modern feminist movement by five years. So it was more likely that certain women would be able to put under the influence of a manipulative genius...or a scummy little ex-con. Not that this couldn't happen today...(except for certain sociological reasons it really actually couldn't). There is more to this case but the problem is a lot of the books on this case are badly written...so be it...my recommendations are Taming the Beast and Helter Skelter...also The Family has a ton of information but is quite simply one of the worst written books on earth. The Film gets a little lost and the end and begins to meander but one can attribute this to the druggy feel of this film rather then the fact that the filmmakers may have run out of things to say on this film. What also makes this film interesting is that most of the women do seem extremely intelligent (Mary Brunner and Gypsy should be excluded). It is too bad that these filmmakers couldn't or wouldn't get interviews with the families of these women. This would have pushed this film towards perfection maybe even making it a perfect documentary. There are also a few mysteries that go along with this film. One is why is this not a really well known documentary? Another is Why have there never been a soundtrack released and why has this never been released on DVD officially? Also there is the murder of one of the filmmakers in the parking lot of an acting school that Sharon Tate had attended. Also there have never been any interviews of the filmmakers and there never seems to be any evidence of say the critical reviews of this film. We must remember this film was nominated for an Academy Award for best documentary so someone seems to have seen this film. I guess no one wanted to discuss it. If you are thinking of buying this film go for it...you wouldn't regret it... it will chill you to the bone and make you laugh because of it's narration...",
         "When I rented it the back cover didn't specify what genre it is and I thought it was a movie about Manson. While I was watching it I thought I was unlucky and it was a re-creation of the Family life with actors saying scripted lines supposed to scare us or trouble us. What a surprise when I found that all this was REAL! This is the actual Family interviewed on screen, this is the actual footage from their life! Creepy, no doubt, but a collector's item, if you happen to find it."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "Crime"
      ],
      "productionCompanies": [
         "Merrick International",
         "Tobann International Pictures"
      ],
      "summaries": ["Documentary on Charles Manson and his family. Has a number of insightful interviews with many family members most notably Squeaky and Sandy (Blue and Red). There is also a history of Manson from his birth to the family formation to the Tate/La Bianca murders. Plenty of footage of the family playing at Spahn Ranch."],
      "budget": 0
   },
   "movielensId": 125946,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-01-01",
      "dvdReleaseDate": null,
      "directors": [
         "Robert Hendrickson",
         "Laurence Merrick"
      ],
      "runtime": 83,
      "movieId": 125946,
      "title": "Manson",
      "mpaa": "R",
      "actors": [
         "Charles Manson",
         "Vincent Bugliosi",
         "Lynette Fromme",
         "Bruce Davis",
         "Paul Watkins",
         "Mary Brunner",
         "Jesse Pearson"
      ],
      "imdbMovieId": "0068918",
      "originalTitle": "Manson",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["GXQoSG3IQ2g"],
      "plotSummary": "Prosecuting attorney Vincent Bugliosi and Manson \"family\" members Lynette Fromme, Mary Brunner and Sandra Good discuss the Tate-LaBianca murders.",
      "tmdbMovieId": 54505,
      "avgRating": 3.58333,
      "releaseYear": "1973",
      "numRatings": 6,
      "posterPath": "/1vDa2utC30Tc6f19M4vANt5NLko.jpg"
   }
}