{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "halloween",
            "id": 3335
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "costume",
            "id": 4328
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "trick or treating",
            "id": 180193
         },
         {
            "name": "garfield",
            "id": 195032
         }
      ],
      "imdb_id": "tt0279830",
      "video": false,
      "title": "Garfield's Halloween Adventure",
      "recommendations": [
         29901,
         36934,
         64170,
         13246,
         92168,
         46879,
         65465,
         20785
      ],
      "backdrop_path": "/mv3pEl5CDtQdnEv9r0JlMnaxM0M.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Garfield (voice)",
               "gender": 0,
               "credit_id": "52fe46769251416c750790bd",
               "name": "Lorenzo Music",
               "profile_path": null,
               "id": 78616,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Jon Arbuckle / Binky the Clown (voice)",
               "gender": 0,
               "credit_id": "52fe46769251416c750790c1",
               "name": "Thom Huge",
               "profile_path": null,
               "id": 78617,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Odie / TV Announcer (voice)",
               "gender": 2,
               "credit_id": "52fe46769251416c750790c9",
               "name": "Gregg Berger",
               "profile_path": "/fIb7F9PiTY8kcWfmRlgZ2G7FMOh.jpg",
               "id": 19547,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Old Man (voice)",
               "gender": 0,
               "credit_id": "52fe46769251416c750790d1",
               "name": "C. Lindsay Workman",
               "profile_path": null,
               "id": 78623,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Woman at Door (voice)",
               "gender": 0,
               "credit_id": "52fe46769251416c750790d5",
               "name": "Desiree Goyette",
               "profile_path": null,
               "id": 78624,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46769251416c750790ad",
               "name": "Phil Roman",
               "profile_path": null,
               "id": 78615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46769251416c750790b3",
               "name": "Jay Poynor",
               "profile_path": null,
               "id": 78622,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c750790b9",
               "name": "Phil Roman",
               "profile_path": null,
               "id": 78615,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46769251416c750790db",
               "name": "Jim Davis",
               "profile_path": null,
               "id": 56336,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.227918,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15718,
      "vote_count": 10,
      "budget": 0,
      "overview": "Garfield and his pup pal Odie go trick-or-treating, only to wind up in a house haunted by ghostly pirates.",
      "similar": [
         9479,
         17979,
         13246,
         772,
         1585,
         460793,
         406997,
         8839,
         9714,
         1581,
         10147,
         91586,
         201085,
         620,
         634,
         452507,
         77949,
         290637,
         2655,
         13188
      ],
      "original_title": "Garfield's Halloween Adventure",
      "runtime": 25,
      "poster_path": "/s6wudNXjaprlkFDyba72rAcX889.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/e4dCQJpJjwL46i1WuGpTIO3srL6.png",
         "name": "20th Century Fox Home Entertainment",
         "id": 3635,
         "origin_country": "US"
      }],
      "release_date": "1985-10-30",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Phil Roman"],
      "runtime": 25,
      "synopsis": null,
      "writers": [
         "Jim Davis",
         "Jim Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0279830/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MjE2MzM4Nl5BMl5BanBnXkFtZTcwMzY2MTUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Lorenzo Music, Thom Huge, Gregg Berger | See full cast and crew »"],
      "reviews": [
         "Such a wonderful way to ask for candycandycandycandy. Well it's Garfield's way. And candy he certainly gets in this wonderful Halloween Special. It all starts on one cozy Halloween morn with Garfield waking to the sound of the TV. Normally he'd be irate at waking so early but when he learns what day it is he cannot wait to go trickortreating and get his paws on some candycandycandycandy! He and Odie dress as pirates and go off on an adventure that happens to involve the ghosts of REAL pirates and real buried treasure. In the course of these brilliant 25 minutes we get the typical assortment of great Garfield humor and wonderful songs. If only the movie were this good.",
         "This is an all time classic. It just would not be Halloween without this TV special. Garfield and Odie, set off trick-or treating, but Garfield's greed for candy leaves them on a haunted island with an old pirate house. Great laughs! Great fun!",
         "I am a Garfield fan and this is my favorite special with him in it. Garfield and Odie go Trick-Or-Treating and end up on an adventure. It is very amusing and should be enjoyable for anyone to watch, even people who don't like Garfield.",
         "\"Garfield in Disguise\" is a 24-minute television short movie from 30 years ago and is also known as \"Farfield's Halloween Adventure\". The 1980s are not particularly known for great cartoons or short films, so these Garfield movies may be among the best there is. Awards bodies seem to agree as this one here won an Emmy back then. Garfield and Odie decide to go out trick-or-treating and basically meet ghosts and spooky creatures during the entire movie. These poor two. However, there is a happy ending when, for whatever reason, our duo is stranded on a remote island, but manages to get two big bags full of candy. Still, the last scene shows that Garfield has enough of being a pirate for a while. Maybe until next Halloween. I think Lorenzo Music is really great as usual and his voice was perfect for Garfield. Still, I must say that I cannot like this little movie as much as I love the comics. Nonetheless, this was a good, occasionally spooky, watch and I recommend it with Halloween 2015 coming up.",
         "Early morning of October 31, Garfield receives a very rude awakening by the Binky the Clown show, trying to get the viewers to do exercises, lest they become lazy and meaningless. However, some good news does come out of that cacophonous clown as mentions trick or treating, which instantly gets Garfield excited about the bag full of candy he'll no doubt acquire that night. He even decides to bring Odie along so he'll get twice as much candy, and he might even share a piece with him. So now it was up to the attic to find a proper costume among the sea of junk Jon had never thrown away. After a song and dance of what he should be, Garfield comes across the perfect costumes for he and his canine companion: pirates. Garfield is Orange Beard and Odie is his first mate, Odie the Stupid. So after Orange Beard scarfs down Jon's lasagna, they hit the streets in search of treats... as well as a few tricks, as some of the trick or treaters turn out to be real ghouls, ghosts and monsters. Well, I guess they like candy too. So Garfield and Odie get quite a haul, but the greedy cat decides he wants more. Pointing to some houses across the river, he suggests they go over there and get even more candy. They board an old row boat and head down stream. They venture off course because Odie the Stupid threw the oars overboard. Eventually they reach land ho. A spooky old house with cool lightning effects. They investigate and find a fire in the fireplace, so they go inside to warm themselves when suddenly, they come across a scary looking old man who warns them of an inherent danger that would befall them all. It seems 100 years ago that night a group of real pirates were forced to bury their treasure on that very island, and they swore that they would return in 100 years to reclaim it, even if it meant coming back from the dead, at the stroke of midnight. Feeling they've heard quite enough, Garfield and Odie attempt to leave, when suddenly they find the old man had gone. Looking outside, they see him row away in their rowboat. Now they were stuck with no boat, no candy, dead pirates on the way...unless... when 12 o'clock struck and no ghosts showed up, they assumed they were safe. That's when the gleaming ghost ship arrived and the pirate ghosts came ashore. Garfield and Odie are discovered and the ghosts give chase. Their only option was to swim for it, but unfortunately, Garfield found out too late that he couldn't swim. Thankfully Odie managed to drag him all the way back to shore where, as luck would have it, the row boat with their bags of candy stood waiting. They return home in triumph, glad the night of chaos was finally over, and to show his appreciation, Garfield reluctantly allows Odie to keep his bag of candy. Then he relaxes by the TV, but when he finds out the only thing on are pirate flicks, he decides to hit the hay. If you're a fan of classic Garfield cartoons, this is definitely one to see. Perfect to watch around the Halloween season. This was 3 years before Garfield & Friends premiered, which was a brilliant staple of Saturday mornings for years to come. The animation is standard, and pretty good for it's time, especially the look of the old man, whose voice really fit him. In fact, all the voice acting was great. The story was fun, the songs were catchy. Kids and adults will definitely enjoy this spooky little romp.",
         "This is another Halloween TV Special I love and it's my favorite Garfield holiday special. Garfield's Halloween is also the first Garfield holiday special too. Well the story starts with Garfield and Odie, dressed as pirates on Halloween night, and went off tricking-or-treating. Then by a river dock, Garfield spied a row-boat and houses across the river, and thought they could row across the river to the houses to get more candy. But the row-boat took Garfield and Odie down the river, and landed them on an island with an old house on it. Inside the house, they meet a spooky old man who tells them that the house is haunted by pirate ghosts who buried a treasure under the house 100 years ago, vowing to come back for it that very night. So anyway I love this Halloween special and I loved how Lou Rawls sang the \"trick or treat\" song, he's got an awesome singing voice; the other songs are catchy too.",
         "For a Halloween special, \"Garfield in Disguise\" (or \"Garfield's Halloween Adventure\") practically has it all: comedy, adventure, peril, and a scary-looking old man who tells of pirate ghosts that return every Halloween. As a Garfield holiday special, it does very well in conveying the spirit of the holiday--better, I think, than either \"Garfield's Thanksgiving\" or \"A Garfield Christmas,\" which are also good. For Halloween, this means spooky stories and \"candy, candy, candy.\" This special captures the best of the comic strip's humor and combines it with a frightening Halloween experience for Garfield and Odie, who put themselves in jeopardy while they are out trick-or-treating. The moments that could be scary for kids are very well offset with humor to keep things from getting too tense. There are even a few original songs that are pretty good (even catchy) and well-suited to the moments when they occur. Garfield also manages to show a bit of his kinder side in the end, however reluctantly. In my opinion, this is the quintessential Garfield special, and one of the best ever Halloween specials.",
         "After a wake up call from Blinky the Clown on the TV. Garfield learns that today was Halloween, one of the few Holidays that he gives a care about. Just because he gets free candy. He dresses up as a pirate and brought Oddie along as his first mate because he wants twice as much candy to eat. It was quite a night for Garfield. And he was getting into the Pirate gig a lot. But things become wiry when they got on a boat to a distant island when things become slightly creepy. This is one of the few Garfield Holiday specials ever made. The animation improves slightly in this one. Specially when this was made 20 years ago. And it keeps itself entertaining for a good half an hour. It has the same running gags and open minded jokes from Garfield like in the other TV specials. A lot of the Garfield fans and Halloween fans consider this one a classic.",
         "Let me just start by saying that to this very day, I hold this cartoon to be one of the scariest I have ever seen. For months after first seeing it, I would wake up screaming, thinking of that old man. But in addition to being creepy, the show is also very artistically drawn. The storyboard is also solid. I can identify with the never-ending pursuit for candy. I wouldn't row to the other side of the lake for candy, but Garfield and Odie would. Maybe that is why I loved this special so much; It brings back find memories of trick-or-treating. The pursuit of candy far outweighed actually eating the stuff. For whatever the reason, this and the Garfield Christmas Special hold a special place in my heart. PS, I still break out in a cold sweat every time I think about that old man rowing away in the boat and the ghosts coming",
         "Early morning, October 31st, Garfield lay asleep in front of the TV set. Suddenly the programming began and first up was the most annoying TV clown in history, Binky the Clown. He encouraged the viewers to do exercises, but Garfield would have none of it. It was then that Binky mentioned tonight being Halloween, which mean candy. That caught Garfield's attention. Just the thought of all that candy really got him jazzed up. He goes off and scares Jon half to death, causing the Jack-O-Lantern he was carving to land on his head. Garfield decided to bring Odie along with him when he goes out trick-or-treating, so he would receive double the candy, and he would keep it all for himself. So after eating a large breakfast, Garfield and Odie adjourn to the attic to make some costumes. They find boxes full of old stuff that belonged to the family, some string, sealing wax and all that funny stuff. Finally, out of some old clothing and wooden legs, Garfield and Odie constructed the perfect costumes! Pirates. Garfield was Orange Beard the pirate and Odie the Stupid was his first mate. Garfield gulps down Jon's lasagna and then they head out. Garfield and Odie both got sacks filled with candy, as well as run afoul of some trick-or-treaters that appeared normal on the outside, but underneath their costumes... Well, a few hours later Garfield and Odie had gotten quite a haul of candy. That's when Garfield sees some houses across the river, which meant more candy. So they board a boat and sail across the river. Unfortunately they lose control and drift off into the fog. After a while of drifting along, they see an old house in the distance. The boat reaches shore and Garfield and Odie climb out to see before them a large, spooky old house. They go inside and sit by the fire. That's when they see the frightening figure of the old man in the chair. He tells them that this just might be the worst night of their lives, for 100 years ago that night, a band of evil pirates buried their treasure where that house now stood and they vowed to return to the grounds 100 years later, even if it meant rising from the dead! Garfield and Odie were terrified. Then they look to see the old man had gone. He had taken their boat! And sure enough, before long the pirate ghosts arrived to recover their treasure. They also spot Garfield and Odie, who run. They swam across the river and back to the other side. Garfield had felt the whole evening was a disaster until he saw the boat, and his sacks of candy were still in it! They return happily home where Garfield reluctantly shares his candy with Odie and decided it had been a terrific Halloween after all. I have always enjoyed this Halloween special. It stopped airing on TV about 4 years ago and so I hadn't seen it since then. Luckily I found it on DVD so now I can enjoy it every Halloween. The brilliant voice talent of the late Lorenzo Music is here as Garfield. Thom Huge is Jon Arbuckle, and Binky the Clown whom I believe makes his animated debut in this special. Lindsey Workman is the old man and has a nice voice resembling James Earl Jones. This special was made 3 years before Garfield got his very own hit Saturday morning cartoon series! In 1987, they made A Garfield Christmas, which I love to watch every Christmas. So this Halloween, if you can find it, I recommend Garfield's Halloween Adventure! Also, I've noticed that in this special, the outside of Jon's house looks different than it normally does. Perhaps a short redecoration? Anyway, check out Garfield's Halloween Adventure this Halloween!! It's got thrills, chills and even a few spills--not that of lasagna, thankfully. -"
      ],
      "genres": [
         "Animation",
         "Short",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Film Roman Productions",
         "United Media Productions"
      ],
      "summaries": ["Garfield has one spooktacular adventure on the Eve of All Saints. He fashions himself a pirate costume then takes Odie out trick-or-treating to ensure extra candy. But when attempting to cross a river on a boat, Garfield and Odie end up at a haunted house. Horror and hilarity ensue."],
      "budget": 0
   },
   "movielensId": 125966,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-10-30",
      "dvdReleaseDate": null,
      "directors": ["Phil Roman"],
      "runtime": 25,
      "movieId": 125966,
      "title": "Garfield's Halloween Adventure",
      "mpaa": "",
      "actors": [
         "Lorenzo Music",
         "Thom Huge",
         "Thom Huge",
         "Gregg Berger",
         "Gregg Berger",
         "C. Lindsay Workman",
         "Desiree Goyette"
      ],
      "imdbMovieId": "0279830",
      "originalTitle": "Garfield's Halloween Adventure",
      "genres": [
         "Horror",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Garfield and his pup pal Odie go trick-or-treating, only to wind up in a house haunted by ghostly pirates.",
      "tmdbMovieId": 15718,
      "avgRating": 2.75862,
      "releaseYear": "1985",
      "numRatings": 29,
      "posterPath": "/s6wudNXjaprlkFDyba72rAcX889.jpg"
   }
}