{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0073099",
      "video": false,
      "title": "Hedgehog in the Fog",
      "recommendations": [
         36161,
         36162,
         36079,
         49273,
         94570,
         36163,
         41571,
         44338,
         44473,
         130314,
         147553,
         144886,
         53219,
         16624,
         79701,
         44333,
         131933,
         233880,
         104522,
         100246
      ],
      "backdrop_path": "/oMCZdIauu1svSmSzIQhLU6BQHdu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Bear (voice)",
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f0db",
               "name": "Vyacheslav Nevinnyy",
               "profile_path": "/eFlOfi0BotFk8SZ2NfZb9uXX0j5.jpg",
               "id": 86752,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Hedgehog (voice)",
               "gender": 1,
               "credit_id": "52fe45ce9251416c9103f0df",
               "name": "Mariya Vinogradova",
               "profile_path": "/hG6PBdy0El0Pe2QFniVuKaKlBIA.jpg",
               "id": 86836,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f0e3",
               "name": "Aleksey Batalov",
               "profile_path": "/odKFQfKgoBWWPERlbFUkQW1HD8e.jpg",
               "id": 87001,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45ce9251416c9103f0d7",
               "name": "Yuriy Norshteyn",
               "profile_path": "/4iRz6IsslUKWVIbdMBt1jbmCdZs.jpg",
               "id": 550476,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f0e9",
               "name": "Sergei Kozlov",
               "profile_path": "/mircWGmbog83wiiAQi8JAIRzriM.jpg",
               "id": 1100029,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "596e7f609251412d7b013855",
               "name": "Mikhail Meerovich",
               "profile_path": "/oSw1PsOkCof8KmsEMfubWzJxHiM.jpg",
               "id": 1587508,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "596e7f6e9251412aa6007c0e",
               "name": "Nadezhda Treshchyova",
               "profile_path": null,
               "id": 1336138,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "596e7f749251412d3d013ef0",
               "name": "Francheska Yarbusova",
               "profile_path": null,
               "id": 1853966,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "596e7f7cc3a3687f7e0140e1",
               "name": "Boris Filchikov",
               "profile_path": null,
               "id": 1274488,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "59ead37f925141562c006460",
               "name": "Aleksandr Zhukovskiy",
               "profile_path": null,
               "id": 1679269,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 3.235273,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 36129,
      "vote_count": 62,
      "budget": 0,
      "overview": "A little hedgehog, on the way to visit his friend the bear, gets lost in thick fog, where horses, dogs and even falling leaves take on a terrifying new aspect...",
      "similar": [],
      "original_title": "Ёжик в тумане",
      "runtime": 11,
      "poster_path": "/ujDXcLQOwqklFf7f1OBHEPab4HG.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Soyuzmultfilm",
         "id": 14599,
         "origin_country": ""
      }],
      "release_date": "1975-10-23",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Yuriy Norshteyn"],
      "runtime": 11,
      "synopsis": null,
      "writers": ["Sergei Kozlov"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0073099/",
      "coverLink": null,
      "actors": ["Stars: Vyacheslav Nevinnyy, Mariya Vinogradova, Aleksey Batalov | See full cast and crew »"],
      "reviews": [
         "Russian, and for that matter, most East European animation, is a world away from Disney's sanitised world where nothing bad ever happens. While Disney strived for animation perfection, where the movement of Snow White's dress is more important than the story, the European and Soviet school of animation was always more about the story. \"Hedgehog in the fog\" is one of the best examples of the difference between the two schools of animation. If Disney had made it, the little Hedgehog would probably have been reduced to a Winnie the Pooh type creature and no doubt there would have been a catchy song or two to jolly it all along. All the other animals would have had speaking parts, there would have been jokes and no doubt there would have been a big musical finale when Hedgehog and Bear are re-united around the camp fire. So it's a good job that it was made by Yuri Norstein instead. What he made is a beautiful, lyrical and deceptively simple animated story of how a curious little hedgehog takes a detour through the mysterious fog on the way to see his friend, the little bear, gets lost and then finds his way out again. But there is much, much more in this little movie than just that. Like many great works of art it adopts the philosophy that less is more. There is nothing superfluous here. Not a single frame is wasted. The stop motion animation, like the illustrations, has a magical, dreamlike quality. The unsaturated, almost monochrome colours of the backgrounds takes us into the real magical world of fairy tales and fantasy in a way that Disney et al could never manage. Indeed, it is the absolute simplicity of this wonderful little movie that makes it so beautiful to watch. The dreamlike quality of the images is enhanced still further by the haunting musical score. The sparse narration is gravely intoned like a beautiful Russian poem. The words themselves don't really matter, it is the effect of the sound of the voice that is important. It doesn't matter if you don't understand Russian, the story is told by the images. Images and symbolism, music and dreams, all combine to make a great little movie. Or you can see it just as a simple story if you wish. With Disney and the others you just get the simple story. There are moments of exquisite beauty that transcend description. When the Hedgehog first walks into the mist, like an awe struck child he whispers that he can't even see his paw! This moment alone is worth the price of the movie. As is the moment when he calls to the white horse. All he says is \"Loshad!\"(horse, in Russian) but it's the way he says it. Almost everything about this film has the innocence and wonder of a child's view of the world. The inquisitiveness of a child exploring an unfamiliar and slightly frightening world for the first time. A journey into the unknown, like the journey through life. To get somewhere you sometimes have to leave the well trodden path. It ends up in the same place but you see a whole new world on the way. The world is a beautiful place and there are many places to see. There are countless paths we can take and most of them have no maps to guide us. All we need is a little courage, a little fear and the belief that there is always a light to show us the way through the mist. The light of love and friendship. The final moments tell another story too. Watch the expressions of the bear and the hedgehog as they talk. The bear is so relieved to know his friend has arrived safely but also because it means his life of routine and order is restored. He needs the hedgehog to count the stars and to bring raspberry jam because that's how it has always been. Without the hedgehog his world would fall apart. He is safe within his comfort zone, happy to live his life without change, without challenge, without fear. He's happy to count the stars but would never once think about reaching for them. But the hedgehog is different. Watch the expression, almost of regret, as he listens to the bear. He has seen the world in a different way, he has seen the magical world inside the mist, another dimension. He has felt the excitement of exploring new worlds, the fear of being lost, new emotions, new friends. And as he sits on the log with the bear, he thinks about the white horse in the mist. How is she? You can draw your own metaphorical conclusions. But we know that the Hedgehog's world will never be the same again. Neither will mine. Thank you to Annushka for the light. @->>-",
         "Yozik v tumane seems to be one of the best cartoons ever. It's both simple and very philosophical, but I like it best because it's very lyrical.At first it all seems to consist of nothing but vague images, but what is our whole life but not wandering in the fog? There's almost no story told, but it's all there - friendship and warmth, lyricism, fears and hopes, wanderings and search for something evasive, something all of us long for and almost never get. More than that - it's full of beauty, high-strung and piercing a human heart. And beauty is something we all search for, even if do not admit it.",
         "*** The analysis is thorough - possible SPOILERS *** When watching this cartoon, the approach is crucial. If you watch it like you watch \"Tom & Jerry\", you will perhaps see a boring slide show. The mass culture has made too many people deaf and blind to the true art and beauty. What makes this cartoon a masterpiece, probably one of the best cartoons ever created? It is superb in every area you'll take, starting with the screenplay that includes ideas, understandable to children yet not trifling to adults. The fog is a metaphor of life; the Hedgehog is a man, striving for something good and soulful. He looks at the starry sky in a pool, while the eagle-owl, the image of primitive and evil people, washes its foot in it. The Hedgehog counts stars with his best friend, the Bear (a more exact translation would be \"Little Hedgehog\" and \"Little Bear\"). Counting stars is a wonderful metaphor of what makes man different from an animal: it's a completely pointless action, like wondering, dreaming or art that give life a new quality. The Hedgehog uses a firefly sitting on a stick as a candle (this makes him look like a sorcerer or messiah) but the firefly escapes with its kin in an affectionate dance, leaving the Hedgehog painfully alone. He is awed by the surrealistic image of a white horse that embodies something grand, unreachable, celestial - a sort of religion. The little Hedgehog experiences something similar when he runs into a hollow tree during his wandering in the fog. The tree is giant, probably touching the sky: accompanied by very inspiring music, the image of the tree is one of the most moving in the cartoon. The eagle-owl and the bat are the dark side of life but the sheath-fish (called \"Someone\" by the narrator) carries the Hedgehog on its back when he falls into a river and the funny dog helps him to find the lost bag with raspberry jam he was carrying to the bear. The roaming Hedgehog hears the Bear shouting his name worriedly from time to time so he knows he is missed and needed by someone, although he's too busy admiring and fearing the world around him. There are more profound ideas in this 10-minute cartoon: every line in the screenplay is significant. The cartoon has comic moments as well: the Hedgehog shouts with his weak voice into a well and the hollow tree, or looks at the eagle-owl which is trying to scare him, and says, having turned around: \"Psycho!\". The Hedgehog says this in a very feminine way and I suspect that, despite the apparent sexlessness of the characters, the hedgehog is a vague image of a woman (he also dances like a ballerina when mocking the swirling butterflies) and the Bear resembles a man (the voices are also of respective sexes). Both the Hedgehog and the Bear are wonderfully crafted characters: the former is melancholy, passive (\"let the river carry me itself\" - resignation to the fate), shy and sensitive to beauty or horror. The latter is sanguine, talkative, kind hearted and caring. Translating the language of the movie or even trying to reproduce the voices (especially that of the Bear) is hardly possible. The drawings and animation are exquisite: each shot is masterful hand-drawn art, with pastel colors and surroundings, gently softened by the fog (water and the tree are photo-realistic; drawing was probably mixed with filmed material). The subtle sounds and a splendid pseudo-classical soundtrack make the cartoon complete.",
         "This has to be one of the best animated films ever made! It never fails to move me with its simple, touching story and fantastic images. I think about the little things which we often fail to appreciate every time I watch this marvellous little film. See it - you might discover something new about yourself.",
         "This is one of the most brilliant animated movies I've ever seen. It shows all the little things and the way you can possibly look at it. The Story is touching, and there's something magical at the images...And the whole \"world\" you see in the movie. This really might change the way you look at the world...",
         "It is quite possible this will not appeal to Western audience. You cannot explain what it's about. All you have are those vague emotional harmonics, and image is too subtle, too airy and blurry, and has almost no color... I remember a guy working in a game publishing company explaining the differences in national color perception to me - Russia prefers barely saturated colors, while in the US and especially Japan it's all about contrast and max saturation. The same for emotions, and the same for the plot - the stuff which appeals to westerners is always literal and to the point, while for Russians it should always be about hints and fuzzy shadows, as no one knows what he's living for... However, I would still advise you to try this short cartoon - you might love it...",
         "This is the cartoon film that I love, love with all my heart. This is the little wonderful story that I adore and still watch every time it is on the TV. Why? Well, the plot is amazingly simple - a little sweet helpless hedgehog is lost in the dense fog on his was to his friend, a bear, who awaits him for a tea with jam. The hedgehog is afraid, he is overcoming his innate fear of the dark, of some imaginary evil creatures, of the unknown and the new. He is encountered by a kind dog, a hilariously nervous owl, a kind fish that helps him out of the river, and finally he is at the bear's place... But the music, the very magic, sweet, mesmerizing feeling! This is a touching little story about a kid lost in the dark alone and trying to get out of it. This is a deep philosophical story about the quest for new and unknown things... This is a grand Anthem to the Freindship, Bravery and Curiosity. I love this excellent film. It is incredible...",
         "Yuriy Norshteyn's 'Tale of Tales (1979)' is an undisputed masterpiece of Russian animation, a spectacularly beautiful journey into the depths of the mind, and sometimes held as the single greatest animated film of all time, a title that I would wholeheartedly endorse. The direct predecessor to 'Tale of Tales,' Norshteyn's 'Hedgehog in the Mist' is held in much the same high regard and, whilst I don't think it is quite as good, the fact remains that it is a stunning piece of Russian animated cinema. I had to watch this film twice. The first time around, not understanding a word of Russian, I decided to sit back and just enjoy the images presented to me. Though I greatly enjoyed the beauty and intricate detail of the animation, I was ultimately unsatisfied with some parts of the story that I couldn't quite decipher, without which I was unable to unlock the deeper meaning of the work. Where, for example, was the hedgehog heading that night? What was he carrying in the bundle? Why was he compelled to follow the white horse into the unknown of the mist? After viewing translations for some of the key pieces of dialogue and narration, I approached the film a second time. Armed with a better knowledge of the finer points of the story, I was able to more fully appreciate the beauty of Norshteyn's film, and how the stunning animation and spoken words complement each other. For example, on that fateful evening, the hedgehog was going to meet his friend the bear, whom he meets with every time to drink tea, count the stars and have conversations. In the bundle, he carries a jar of raspberry marmalade that he has prepared for the occasion. As for why the hedgehog decided to descend into the mist, we are told that it is because he wonders if the beautiful white horse would suffocate if he lies down in the fog. I think, however, that it is something much more than that. It is the lure of the unknown. The low-lying mist presents to him all life's beauty and terror, satisfying an underlying desire for the excitement and adventure of the unfamiliar, a means of breaking down the monotony of his usual safe and routine existence. This unconscious thirst for adventure exists in all of us, and the hedgehog is one who felt compelled to take that extra step into the mist. Despite being terrified and shaken by the experience, it nonetheless has changed him, and he will carry the memory with him for the rest of his life, and his daily routine will forever seem mundane in comparison. For the first time in his life, rather than merely counting the stars in the sky, the hedgehog was inspired to reach towards them. The animation itself, it need not be said, is truly a beautiful achievement. Like in all his films, Norshteyn's animation has a certain timelessness about it, seeming to exist in a world that I'm sure we've all visited in our dreams. The fog effects, so crucial to the atmosphere of the film, were created by putting an extremely thin piece of paper on top of the scene and slowly lifting it frame-by-frame toward the camera until everything behind it became blurry and white. To describe this film as beautiful would simply be an understatement.",
         "Because it is a very watchable poetry, an example of magic, which makes me play this DVD again and again. It is 11 minutes of excellence. I've seen a number of other cartoons by Mr Yuriy Norshteyn but I did not like them much. To me they are all right. But this one is something absolutely out of this world. Craftsmanship at its best. The soundtrack is a symphony of sounds and catch-phrases, which vary in depth and attitude. It can be a simple \"Psycho!\" (\"Psih!\" in Russian) or a reflection on one's life and death (cf. the scene where the hedgehog falls into the water). The only thing I'm very sorry about is that this animation legend ends so quickly. 10 out of 10 - this is what I call excellence (I would give it an 11 for its 11 intoxicating minutes). Thank you for attention.",
         "If you want to ask me why, the answer is simple - HITF is highly philosophic though it's just a simple children story. Such combination is very difficult to create. Lets say Shrek, for example. It's a great movie due to fantastic technical side. It's very pretty, just look at that lovely green ogre. I can say no more on that point - it was a great pleasure to see that film. But where is a great idea in Shrek? Love? Yeah... And? What could it be more important that love? That's where the HITF comes. It's a film about a prickly little creature, which is lost in the fog. Not a huge ogre, who can confront any danger without any silly donkeys. Not a Schwarzenegger with a big bazooka or something like that. It (hedgehog) can nothing to do against the evil life around him. By the by, there's love in this film, love of another kind, a sympathy to the poor curious hedgehog, or a closely friendship between Hedgehog and Bear. Sergei Kozlov made a whole book about them (named \"Yozhik\"), and any short story in it could pretend to be a film like that."
      ],
      "genres": [
         "Animation",
         "Short",
         "Drama",
         "Family",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": ["Soyuzmultfilm"],
      "summaries": ["A little hedgehog, on the way to visit his friend the bear, gets lost in thick fog, where horses, dogs and even falling leaves take on a terrifying new aspect..."],
      "budget": 0
   },
   "movielensId": 126090,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1975-10-23",
      "dvdReleaseDate": null,
      "directors": ["Yuriy Norshteyn"],
      "runtime": 11,
      "movieId": 126090,
      "title": "Hedgehog in the Fog",
      "mpaa": null,
      "actors": [
         "Vyacheslav Nevinnyy",
         "Mariya Vinogradova",
         "Aleksey Batalov"
      ],
      "imdbMovieId": "0073099",
      "originalTitle": "Ёжик в тумане",
      "genres": [
         "Adventure",
         "Animation",
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "youtubeTrailerIds": ["kMk_xaV3c5I"],
      "plotSummary": "A little hedgehog, on the way to visit his friend the bear, gets lost in thick fog, where horses, dogs and even falling leaves take on a terrifying new aspect...",
      "tmdbMovieId": 36129,
      "avgRating": 3.88776,
      "releaseYear": "1975",
      "numRatings": 196,
      "posterPath": "/ujDXcLQOwqklFf7f1OBHEPab4HG.jpg"
   }
}