{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "chicken",
            "id": 2479
         },
         {
            "name": "surreal",
            "id": 3307
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0241399",
      "video": false,
      "title": "Hen, His Wife",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cc6c3a36847f823e1c7",
               "name": "Igor Kovalyov",
               "profile_path": null,
               "id": 110873,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cc6c3a36847f823e1cd",
               "name": "Igor Kovalyov",
               "profile_path": null,
               "id": 110873,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 0.282156,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 168202,
      "vote_count": 4,
      "budget": 0,
      "overview": "Extraordinarily detailed and beautifully drawn animation of a bizarre and surreal world; the domestic life of a fat man, his wife, a sort of oversized obese chicken, and their child/pet, a slug-like creature with a human head. This expressionistic and interior vision of Soviet animator Kovalyov is like an animated Eraserhead.",
      "similar": [
         21385,
         11970,
         11544,
         37135,
         812,
         10020,
         10527,
         9479,
         12092,
         10193,
         9016,
         12230,
         10144,
         3933,
         10340,
         10198,
         10882,
         10895,
         10555,
         10530
      ],
      "original_title": "Yego zhena kuritsa",
      "runtime": 13,
      "poster_path": "/ysEH9Rs3Xn95qdSGjpSKhBMaDJP.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [],
      "release_date": "1990-05-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Igor Kovalyov"],
      "runtime": 0,
      "synopsis": null,
      "writers": [
         "Igor Kovalyov",
         "Evgeniy Nazarenko"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0241399/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "Very strange... in a very sketchy sort of animation, rough lines, a fat, blue-skinned man is waited upon in his apartment by a large hen. She serves him a hot drink in a mug and fresh hot water for his feet to soak in. They have a pet dog, except it looks like a giant fat centipede with a human head. He plays music on a record player with the wheels of a wind-up bus rather than a needle. All is well until a man comes to visit with a box of ladybugs and he whispers something to the man. Things start breaking more frequently and several nightmares or nightmarish things happen. I have no idea what any of it means!",
         "Well, this is certainly one of the strangest animations that I have seen in my life (And that's saying something) however, at the same time, I found it to be quite interesting and well done, being a crazy example of surrealism into an animated format. All characters of this short had a very stylish appearance, that even when they are supposed to be \"ugly\" have at the same time something at least something very appealing about their ugliness. The sceneries were pretty stylish as well, with a very subtle use of colors and tones. I think that the result was solid enough, it had plenty of imaginative sequences, and a unpredictable story that could be taken as a metaphor of how sometimes people doesn't notice the most obvious things until somebody points it out.",
         "A long-married couple, somewhere past middle age, live a quiet routine of half-contentment. He sits in a big easy chair reading the paper and puts a (very beautiful, haunting, folk-operatic/cantorial)song on his record player, using a wind-up blue bus instead of a needle. She refills the hot water in his footbath and puts down food for the \"dog,\" a kind of caterpillar-dachshund with a leery human head (their eraserhead son?. He is a swollen, blue-skinned, balding lumpen-man. And she, beneath her apron and polka dot print dress is... a Hen. This evades the notice of the husband until one evening, the routine is disturbed by a visitor, perhaps the husband's younger brother, a mustachioed playboy \"d'un certain age\" clad in a black suit. Also of heavy build, but looks more healthy, with human skin tone. He has brought as a gift a box filled with ladybugs, a treat much enjoyed by the little \"pet.\" As soon as the bustle of introduction has settled, the man notices that his blue brother's wife has become... a Hen. Not an uncommon occurrence in marriage, particularly among the peoples of Eastern Europe (I should know!). When the wife leaves the room, he intimates this discovery to his blue brother in an extended whisper. The effect of his comment sets in motion the film's dramatic arc. Kovalyov is a master animator of the uncanny- the familiar made strange- and his all-too-human monstrosities convulse across the screen with the expressive depth of actors in a silent melodrama, but more, and stranger. Strangeness is the property liberally dribbled onto the reality rendered here in pen and ink- depth, rhythm, texture, cause and effect- all shift and shiver as the laws of cartoon physics, and metaphysics, jump and jive to the tempo of this universal human story.",
         "\"Yego zhena kuritsa\" or \"Hen, His Wife\" is a 12-minute Soviet animated movie from 25 years ago. The director and writer is Igor Kovalyov and this film is possibly his biggest success as it managed a nomination at the prestigious Cannes Film Festival. He was only in his 20s when he made this one, but already an experienced filmmaker as he already worked as an animator for Soviet television when he wasn't even 15 years old. Anyway, this film here is certainly not a movie for fans of beautiful animation. The characters in here all look extremely hideous. If you look at the title of my review, I had to think of a song from the famous musical \"Cabaret\" from the 1970s while watching this. So, his wife is a hen, but maybe she is still beautiful to him. Hands down, he is not exactly very handsome either. All in all, only worth a watch for how strange it is. Neither the animation nor the story impressed me. Is there even a real story? Good thing about this one, there is no Russian dialogue in here, so you won't need subtitles. Still, thumbs down all in all."
      ],
      "genres": ["Short"],
      "productionCompanies": ["Pilot Studio"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 126080,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1990-05-01",
      "dvdReleaseDate": null,
      "directors": ["Igor Kovalyov"],
      "runtime": 13,
      "movieId": 126080,
      "title": "Hen, His Wife",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "0241399",
      "originalTitle": "Yego zhena kuritsa",
      "genres": ["Animation"],
      "youtubeTrailerIds": ["fYdaHaNRMKg"],
      "plotSummary": "Extraordinarily detailed and beautifully drawn animation of a bizarre and surreal world; the domestic life of a fat man, his wife, a sort of oversized obese chicken, and their child/pet, a slug-like creature with a human head. This expressionistic and interior vision of Soviet animator Kovalyov is like an animated Eraserhead.",
      "tmdbMovieId": 168202,
      "avgRating": 2.4,
      "releaseYear": "1990",
      "numRatings": 5,
      "posterPath": "/ysEH9Rs3Xn95qdSGjpSKhBMaDJP.jpg"
   }
}