{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0351080",
      "video": false,
      "title": "How They Get There",
      "recommendations": [104476],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "54fb00459251413aa0001762",
               "name": "Rico Bueno",
               "profile_path": "/ouIogHNyueyx1zOWpqKkSssyxfV.jpg",
               "id": 54428,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "54fb0050c3a368199b00188d",
               "name": "Lauren Curry",
               "profile_path": null,
               "id": 1436171,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "54fb0063c3a3686998001520",
               "name": "Mark Gonzales",
               "profile_path": "/hguPWU40rf12vcqnVDnoruUDpg7.jpg",
               "id": 584563,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "530909c4c3a3684208002b82",
               "name": "Spike Jonze",
               "profile_path": "/uzpGNO2zUV8y830U8LnPyAxhQSf.jpg",
               "id": 5953,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59664923c3a368253c10c1b8",
               "name": "Mark Gonzales",
               "profile_path": "/hguPWU40rf12vcqnVDnoruUDpg7.jpg",
               "id": 584563,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5966492c9251410b8612d0db",
               "name": "Spike Jonze",
               "profile_path": "/uzpGNO2zUV8y830U8LnPyAxhQSf.jpg",
               "id": 5953,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5966493492514122511092be",
               "name": "Vincent Landay",
               "profile_path": null,
               "id": 6955,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5966493bc3a368253c10c1d4",
               "name": "David Thorne",
               "profile_path": null,
               "id": 1688353,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "596649519251410c5611f7a4",
               "name": "Lance Acord",
               "profile_path": null,
               "id": 1781,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "59664959c3a368265d12360d",
               "name": "Eric Zumbrunnen",
               "profile_path": null,
               "id": 6958,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59664961c3a3680d591040a6",
               "name": "Casey Storm",
               "profile_path": null,
               "id": 6961,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5966496c9251410c5611f7bd",
               "name": "Ren Klyce",
               "profile_path": "/tMDHEVa05pe3od1NMpfplPVPnxD.jpg",
               "id": 7763,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5966497ac3a36828a1147ca3",
               "name": "Eddie Bruan",
               "profile_path": null,
               "id": 1849921,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.57971,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 137014,
      "vote_count": 7,
      "budget": 0,
      "overview": "A guy and a girl play copycat with each other from opposite sides of the street, that is, until a slightly abrupt and uncopyable [sic] event occurs.",
      "similar": [
         21385,
         597,
         383498,
         460793,
         74643,
         568,
         37724,
         91314,
         87421,
         56292,
         54138,
         52520,
         75612,
         10527,
         19,
         101299,
         68726,
         81003,
         157336,
         271110
      ],
      "original_title": "How They Get There",
      "runtime": 3,
      "poster_path": "/sqGMBej0vBy2NXF4HhAuGg0ctYt.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Spike Jonze"],
      "runtime": 3,
      "synopsis": null,
      "writers": [
         "Mark Gonzales",
         "Spike Jonze"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0351080/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3NDYwODA5M15BMl5BanBnXkFtZTcwMjY1MjgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rico Bueno, Lauren Curry, Mark Gonzales | See full cast and crew »"],
      "reviews": [
         "Wow, after seeing a long bloated artsy film nearly 25 Mons long comes Spike Jonze's amazing film. Granted he had a budget to do the big surprise at the end (and it is) but man, you are engaged throughout. You will find it extremely cute at the beginning then the film totally smashes your expectations quite literally. Yes this film doesn't have any deep message and that's fine. Nevertheless, it does engage and keep you caring about characters, wonder what will happen next, and so forth. It's cute, funny, violent, sick, interesting, sad, etc. need I say more? And it tells a great story in just 3 minutes - how many directors or films can do that? I'd love to see this again if I could find it somewhere. No wonder Spike Jonze is quickly becoming one of the best directors we have today. 10/10",
         "\"How They Get There\" is a fantastic short film, possibly the best iv'e ever seen /at least the cleverest) and I recommend everyone to watch it at least once, I also recommend you buy \"The Work of Director Spike Jonze\" on DVD. Before I saw this short I really wanted to know what it was about but there weren't any useful information about the plot here so I decided to write some. If you for some reason can't watch this short or simply just wanna know what's it about then read the next following words. **************************SPOILERS****************************** The short begins with a close up on the shoes the lead character, a young man, is wearing. The man is hanging out drinking a small carton of milk, as he almost trips and falls he notices that the girl on the other side of the road has just imitated him. The man starts doing silly things as he walks down the road and the girl starts imitating all his moves and this starts to be like a little game between them, he starts waving his hands and doing silly walks and she does the same, this goes on for like a minute or so. But as the road ends the man fails to notice a car driving behind him. The girl stops and starts giving him signals with her hands to stop, the man thinks she's still just playing the game and waves his hands in the same motion as she does and continues walking over the road. The girl gasps hysterically. The car hits the man who flies over the automobile, the driver loses control and the car suddenly hits something and dives into the air crashing into the sidewalk and on cars, probably leaving the driver dead. The mans shoe, that appears in the first shot, flies in the air and lands on the sidewalks curve, the camera moves forward filming the curve, a little bit further the camera stops on an old shoe that's been lying there for a while. The short explains to you how shoes you see abandoned lying on the road get to be where they are, hence the title \"How They Get There\".",
         "\"How They Get There\" is an almost 20-year-old short film written and directed by recent Academy Award winner Spike Jonze. It's a little romance comedy with a dramatic twist at the end when a man and a woman impersonate each other during pretty much the entire runtime. this runtime is not too many as the film stays easily under the 3-minute mark. Neither the male nor female lead have pursued a career in films after this one, but Jonze obviously has. Initially, he was \"only\" a successful music video director, but now he been active in the world of movies for quite a while and with great success. \"Her\" was a triumph. Still I must say I was not too impressed by this work here and I also believe he has done many better short films. But given that this was still fairly early in his career and he was only in his 20s, it's a mitigating factor and this one is a bearable watch. Not a good one though. Not recommended.",
         "This was Spike Jonzes' first short movie, after a series of videos. He obviously wanted to make an original statement without being boring or \"theoretical\". And he succeeded! The story is a simple one, you could even say frivolous, but this only adds to the ironic and fresh feel about it. Yet, on the other hand, we could say that one can't get rid of the feeling as if he/she was watching a commercial selling a new line of shoes. Be that as it may, it is clear that Jonze already in his first motion picture attempt proved the value of his unorthodox, vibrant and intelligent approach to making movies.",
         "I saw this short on Atom Films a couple of years ago and loved it so much, it hurt. I thought it was so simple yet creative and romantic that I nearly snuffed myself out after watching it. I was in my cubicle at the time of my first viewing, at a job that was going nowhere real fast and I was shook to the bone. With each effort, Spike never disappointed and with \"How They Get There,\" I had had enough. I thought I had ideas, I thought I had something going, but after seeing what Spike did with this film, and how effortless it seemed, I lost everything. My film, \"Girls Without Fathers\" bombed. People booed it. It was a thirty-minute muddy movie. I even had walk-outs. Yet Spike had it all. Every single time he hit. Whether it was with Nike's Y2K campaign, or that dog's video \"Hey, Old Timer,\" he was always on. For months after seeing this short I couldn't come up with a single hook. I had no vision, I couldn't even come up with one lousy snippet of dialogue. I couldn't sleep and I even entertained the thought of re-creating this piece, claiming it as my own. People would love me then. I would love me then. Afterall, who had seen it? Just me, as far as I was concerned. But, I never re-created it. That day, after watching Spike's movie, I shared my thoughts with a married woman. A woman I worked with, just two cubicles over. A woman, who as an independent filmmaker, shook up the local Tulsa, Oklahoma scene with a just-as-stunning-as-How They Get There picture entitled, \"Jimmy.\" She was marvelous, sun-kissed, stunning as a queen bee, and tapped into tons of new ideas, ideas she wasn't afraid to share because they were perfection and because they were abundant. Ideas that the Spike's, Wes Anderson's, PT's or Roman Coppola's of the world could never tap into, never get their hands on. An original with a unique voice and vision. I loved her then, just as I love her now. I was crushed by the fact she was married, just as I was crushed by the existence of \"How They Get There,\" so original, so cute, and so brilliant. I told her everything, how I was useless, how my life had no meaning if I couldn't come up with a single idea, how I was never going to get anywhere by living intimidated by one man's work and how I feared my life was doomed to the confinement of those pink velvet crush walls of my cubicle. She listened. And she eased my pains, temporarily, with down cotton words and I went home that day feeling like someone really looked up to me as a creative entity; I napped on the encouragement. When I woke up, I watched the movie again and again I felt saddened. My girlfriend at the time just laughed at me, as she often did, and drank herself into a vomitous fit, as she often did, and ended messing around with my roommate's best friend, who ended up being, by chance, my co-worker's husband. The next morning, I vowed to never watch, \"How They Get There\" ever again. And I haven't to this day. Call it what you will, but \"How They Get There\" served as a catalyst to how that woman I shared my pain with that day ended up becoming my live-in girlfriend and love of my life. Thanks, Spike. Two years strong. And not only is she a dream-come-true, but she's the secret behind all my fantasy. My muse. And she's incredibly encouraging."
      ],
      "genres": [
         "Short",
         "Comedy"
      ],
      "productionCompanies": [],
      "summaries": ["A guy and a girl play copycat with each other from opposite sides of the street, that is, until a slightly abrupt & uncopyable event occurs."],
      "budget": 0
   },
   "movielensId": 126076,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": null,
      "directors": ["Spike Jonze"],
      "runtime": 3,
      "movieId": 126076,
      "title": "How They Get There",
      "mpaa": null,
      "actors": [
         "Rico Bueno",
         "Lauren Curry",
         "Mark Gonzales"
      ],
      "imdbMovieId": "0351080",
      "originalTitle": "How They Get There",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["7ARH_EzLBO8"],
      "plotSummary": "A guy and a girl play copycat with each other from opposite sides of the street, that is, until a slightly abrupt and uncopyable [sic] event occurs.",
      "tmdbMovieId": 137014,
      "avgRating": 3.22222,
      "releaseYear": "1997",
      "numRatings": 9,
      "posterPath": "/sqGMBej0vBy2NXF4HhAuGg0ctYt.jpg"
   }
}