{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0375824",
      "video": false,
      "title": "Human Touch",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe4cacc3a368484e1c1d2d",
               "name": "Jacqueline McKenzie",
               "profile_path": "/qBAp4Syl6GhbhZFV96BSDM8Fxjv.jpg",
               "id": 28744,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "David",
               "gender": 0,
               "credit_id": "52fe4cacc3a368484e1c1d31",
               "name": "Aaron Blabey",
               "profile_path": null,
               "id": 187070,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Edward",
               "gender": 2,
               "credit_id": "52fe4cacc3a368484e1c1d35",
               "name": "Chris Haywood",
               "profile_path": "/jMVWid44VE90tzmkOBKCWqvT9eW.jpg",
               "id": 3070,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4cacc3a368484e1c1d3b",
            "name": "Paul Cox",
            "profile_path": null,
            "id": 939275,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.178013,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 201561,
      "vote_count": 1,
      "budget": 0,
      "overview": "To try to raise money for her choir's trip to China, Anna poses nude for an ageing artist and upon seeing the finished results goes on a journey of self discovery.",
      "similar": [],
      "original_title": "Human Touch",
      "runtime": 102,
      "poster_path": "/gOp9GoelgUmOLwSRyRsGDg4TDey.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Illumination Films",
            "id": 15010,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Go Paterson Films Pty Ltd",
            "id": 15011,
            "origin_country": ""
         }
      ],
      "release_date": "2005-04-14",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Cox"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Paul Cox"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0375824/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA0NzY1NTk5MTdeQTJeQWpwZ15BbWU3MDYxMDQ2MjE@._V1_SY201_CR43,0,214,201_AL_.jpg",
      "actors": ["Stars: Jacqueline McKenzie, Aaron Blabey, Chris Haywood | See full cast and crew »"],
      "reviews": [
         "This film was the Aussie highlight of Melbourne film festival -- by far. Not hard competition I must say -- Sommersault and Tom White were dreary numbers. Although the dialogue is heavy handed and the performances under directed -- something interesting comes from the poetics of the imagery. Stalictites, Bad modern art, pervy old men, misogyny, exhibitionism, animal instinct -- all of these things combine tastefully to evoke an erotic and heady world -- a bit like a glass of peppery red wine. What it did achieve in its exploration of themes -- was not as brilliantly explored as Ken Russel's \"Women in Love\" but certainly the ideas of the male vs. female instinct was intriguing and mesmerising. What I miss is the detail of performance -- Jacqui and Rebecca (both fine actresses) look lost in front of the lens. Aron Blabey is a bit TV here and Chris Haywood is interesting -- but far from the complex creation he could have been.",
         "I found it hard to watch this film without comparing it Paul Cox's \"Man of Flowers\" from the mid eighties which I loved. Both have the central theme of a wealthy but sexually dysfunctional man persuading a young woman (who has an artist as a partner) to pose naked for him to help him address sexual problems which stem from some sort of Oedipal relationship with his parents. Norman Kaye who played the central figure in Man of Flowers is here relegated to the role of butler. His presence in many of the Anna/Edward scenes only underscores the connection. Where the two films differ markedly is that Man of Flowers was centred on Norman Kaye's story whereas Human Touch seems centred on Jacqueline McKenzie's. However, the encounters between Anna and Edward seem to me to be kept very much at arm's length. We mostly find out about them when she tells David about them, indeed David is the character that I felt I knew most about by the end of the film, and therein lies the problem for me. I didn't understand Anna's transformation because it was never really shared with us, and Edward seemed almost relegated to a minor character by the end of the film, so the final scene with the slideshow seemed unimportant and heavy-handed (like the cave sequence earlier). I did like Ouspensky's installations, even though I couldn't really see the relevance of his character. Paul Grabowsky's music was beautiful and deserves a mention. But my overall feeling is that story seemed interesting, but it failed in the telling of it by not involving us enough. A missed opportunity.",
         "This movie could have better sound,light,music,acting,dialogue and music.And anything else that I missed including photography. *******CONTAINS SPOILERS*************** Anna (Jacqueline McKenzie) gets picked by this old geeza as she sings in her choirs,who want to go to china to sing but don't have the airfare.Why pick her with the line \"you have a good voice.Give me a call if you want me to do anything for you.\"Of course you know what that means. He will pay for the airfares as long as she poses naked for him.Having seen the photos,they are bad,taken with a digital cam,and printed on ordinary paper.Anyone with a digital cam can do that to a flat chested Anna. Once in a while some takes a tray of drink to someone.Old geeza takes more photo.Bad sound,like in daytime soap.You can hear everything,like creaks footsteps,things that shouldn't make noise unless they mean something,or trying to get your attention to it. Anna tells her boyfriend and shows him the picture.He is an artist,and a bad one at that.He gets jealous.How dare he.She has hang up from her ex husband not trusting her.But how dare he.Shes not doing anything wrong.So she sees a shrink.He says she is depressed.Annas boyfriend sees the same shrink,who says he is also depressed.BTW,the shrink,he quotes Confusious.Very confusing.For Western Psychiatry. The old geeza has lots of money.He has a wife,throw in a senile mother, father and a token Indian as the nurse. Anna boyfriend wants to grope her.Buts its not her problem he is horny.The old geezas mum gropes Anna.Old geezas wife gropes Anna. So Anna and boyfriend decide to go to France to sort things out.Get this,by taking a vow of silence.They stay and the old geezas place.Of course he paid for the trip.So they are in France.Some people speak french,but no sub title to tell the audience what was said.So it couldn't have been important.Why put it in. She wants to make out and so they do.Then she lays one on him.The old geeza wanted to touch her.He kissed her all over,because he was impotent(more on this later).Anna boyfriend gets upset.How dare he!Anna feels alive now that the old geeza has kissed her.She knows herself.She is in her 30s for god sake.And it had to be the kissed from the OG.She is revitalised.And how dare he react that way! She finally gets groped by some french dude.Almost raped. This OG has his own hangups.He was not touched enough.He is a lousy photographer.And he used to take pictures of his naked mother.Now this would make me impotant too. The acting is so wooden,and the lighing.Please buy a reading lamp and light it upwards.Put some tinge/hue.Make it blue.And a lot of gaps of doing nothing.Dead air.Could have paced it slower.Once and too many time the movie cuts into 8MM home movie jerky shots.Don't know why.Could be a dream or thinking situation.Some unnecessary nudity that could have been done as a suggestion.Unerotic.And add some useless art,funded by Australian taxpayers. And ,Australia,you paid for this crap too that we could have gone without.There is no point to this film.Hope you can get something out of this movie.I watched The Weatherman the same day,and that is way too superior. Confusious say.Avoid this.",
         "I feel the title 'Human Touch' itself is misleading. Upon hearing its title and reading its synopsis, I was misled into thinking that the film would be a simple story about how touch is important in our lives. But how far it is from the truth. If the title was not meant to be intentionally misleading, I thought it would be far more apt to name it 'The Human Touch' because it is really more about humanity than anything else. But then again, if director Paul Cox really named it that way, not many people would even bother to see it in the first place. I would, for one, dismiss it as yet another existentialist arty-farty piece of crap that nobody can understand. Human Touch is of course existentialist art-house fare, but it is also something else altogether. Because it doesn't purport to know anything about the mystery that is ourselves, nor does it have any theory of the reason of our existence. It too, like us, is seeking in understanding further just exactly what makes us tick, and how we can simply be, after we inherited millions of years of culture. And this shared culture, is so vast and inexplicable, that we simply call it 'humanity'. But what is 'humanity'? And does anyone even understand any cornerstone of it? In this way, the film's provocative nature reaches into many beings of humanity. From the arts, history and religion, to our bodies, morals and emotions like affection and lust, it never ceases to probe and question just what drives us to do things a certain way that other creatures would not do. And how our surroundings and our history binds us together and affect us collectively and yet, splintering us in many different directions and personalities. But the film never engages into verbose intellectualizing a la many French New Wave directors who just get lost in a world of their own by talking and talking about theories and never managing to shut up. This film has a heavy anchor by the very real people in the film and their relationships, such that every decision they make and every emotion they feel, doesn't help us any better in understanding their, say, 'character design', but only manages to open up more vistas of the mystery that is us. This is wholly because the film doesn't seem to be theoretical. In fact, it is far from theoretical, its people often seemingly idiosyncratic and unfathomable but always very plausible. It explores all these questions not by theorizing like most art house directors do, but rather by allowing us to experience. Not unlike Tarkovsky, whose great work similarly explores humanity by framing mankind's actions against our surroundings and nature, the scenes in this movie are not linked by logical linearity or emotion, but rather through ambient noise. From the ancient stalactite caves that echo with baby cries and church bells to the great emotions within people ringing with rapturous choral voices, this film puts us through experiences that connects us--rather than alienate us--and makes us part of a far greater whole - mankind. For what my young eyes and ears can see and hear is little, and bound by my limited sensory capabilities; what sadness or happiness I feel is bound by my shallow experiences in life; what ideas and concrete thoughts I can construe is bound by my fundamental education and understanding of the world. But what connects us all, and can only be reached through intuition, is the spark that the creator puts in all of us, that separates us from the other creatures and the inanimate - the human soul. And this movie touches so unflinchingly on this shared human nerve, that all that I am made of is not as important as what I am part of. Where I share the same blood as generations of creatures who have come into consciousness of themselves and the womb surrounding them. It is what I enjoy finding in cinema, that if any one moment can touch on this what I perceive as the human soul, then that is worth sitting through piles of crap for. For the human soul--the truth, as what more philosophical people would call it--is worth every inch of living for. And this movie uncannily hones in to this same nerve that we all share and quiver for, and holds on to it unflinchingly. True, it may not have been genuinely successful in every inch of its celluloid film. And I would be hard-pressed to say it is good for its individual technical parts. But what little the film understands about its subject matter, it knows this: that most reasoning and emotion cannot bring anyone as close to the human soul as raw intuition. And the intuitive power it brings to screen by merely seeking the human soul, and by large, finding it, is all that matters and all that makes it a truly truly great film.",
         "Unfortunately this film was sadly quite awful. It is really just an aging man's sexual fantasy, with little insight into the inner lives of the younger characters. The best thing about the film, the acting of the two lead performers Aaron Blabey and Jacqueline McKenzie, was heroic considering how awful the script was. The rest of the acting was verging on the ridiculous, although the scenes involving 'Bud' Tingwell and Julia Blake impart a bit of much needed class into what is otherwise a piece of fairly shallow nonsense. In many ways watching this film felt like watching an awful parody of one of Cox's earlier (and much more interesting) film \"Man of Flowers\"."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Illumination Films",
         "Go Patterson Films Pty. Ltd.",
         "Best FX (Boom Sound)"
      ],
      "summaries": ["The wealthy Edward (Haywood) sparks to Anna (Mckenzie), the lead voice in a choir that's raising money for an upcoming trip to China. He donates money to her choir, and she agrees to sit for him for a series of still-life drawings. As Anna is drawn more into Edward's life, their relationship -- quite platonic -- nevertheless causes problems at home for Anna, who lives with David (Blabey), a frustrated artist."],
      "budget": 0
   },
   "movielensId": 126144,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-04-14",
      "dvdReleaseDate": null,
      "directors": ["Paul Cox"],
      "runtime": 102,
      "movieId": 126144,
      "title": "Human Touch",
      "mpaa": null,
      "actors": [
         "Jacqueline McKenzie",
         "Aaron Blabey",
         "Chris Haywood"
      ],
      "imdbMovieId": "0375824",
      "originalTitle": "Human Touch",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "To try to raise money for her choir's trip to China, Anna poses nude for an ageing artist and upon seeing the finished results goes on a journey of self discovery.",
      "tmdbMovieId": 201561,
      "avgRating": 2.25,
      "releaseYear": "2005",
      "numRatings": 2,
      "posterPath": "/gOp9GoelgUmOLwSRyRsGDg4TDey.jpg"
   }
}