{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "chase",
            "id": 3713
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "men in black",
            "id": 208480
         }
      ],
      "imdb_id": "tt0127276",
      "video": false,
      "title": "The Shadow Men",
      "recommendations": [],
      "backdrop_path": "/1G5QbZGnm9nMSZyllsc1MSBvK8g.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "SkippyTexas77",
         "id": "58c05b33c3a36813490005ad",
         "content": "It seems not a single person behind-the-scenes on this project strived to make it anything more than passable. That's not to say the film is bad -- it isn't. It's not great either. It's just... *Meh*\r\n\r\nThere were opportunities in the script for curve balls to be thrown at the audience, but the filmmakers declined. They stuck to the formula, never veered off the path of familiarity, and gave us the plot completely by the numbers. This is the type of movie that you can flip on at any time and not really pay attention, never having to worry if you'll miss any key plot points.\r\n\r\nI'm a fan of Eric Roberts and find him enjoyable in even the worst of movies, so having him in the cast definitely helped.\r\n\r\nAnd kudos to the filmmakers for playing off the ridiculously awful alien costumes for realism. They looked awful, but worked in that \"so cheesy it's fun\" sort of way.",
         "url": "https://www.themoviedb.org/review/58c05b33c3a36813490005ad"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bob Wilson",
               "gender": 2,
               "credit_id": "52fe4613c3a368484e07d73b",
               "name": "Eric Roberts",
               "profile_path": "/45i6fsxBwH1UyA74tWQ6am0DntC.jpg",
               "id": 21315,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dez Wilson",
               "gender": 1,
               "credit_id": "52fe4613c3a368484e07d73f",
               "name": "Sherilyn Fenn",
               "profile_path": "/1AKZocU6gfD1udBPUxYH6Vez8Ll.jpg",
               "id": 6681,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Stan Mills",
               "gender": 2,
               "credit_id": "52fe4613c3a368484e07d743",
               "name": "Dean Stockwell",
               "profile_path": "/gooE10UOH6t4geqsEbji9NiQalP.jpg",
               "id": 923,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Andy Wilson",
               "gender": 2,
               "credit_id": "54819d979251416e7b0056c9",
               "name": "Brendon Ryan Barrett",
               "profile_path": null,
               "id": 45922,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "MIB #1",
               "gender": 2,
               "credit_id": "54819da69251414efa006223",
               "name": "Andrew Prine",
               "profile_path": "/4heJy09ohj94DKYN9C4LN44mR2Z.jpg",
               "id": 15668,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "MIB #2",
               "gender": 2,
               "credit_id": "54819db4c3a36829b500704d",
               "name": "Chris McCarty",
               "profile_path": null,
               "id": 33015,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "MIB #3",
               "gender": 2,
               "credit_id": "54819dc49251416e78005b9f",
               "name": "Tom Poster",
               "profile_path": null,
               "id": 106475,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4613c3a368484e07d749",
               "name": "Timothy Bond",
               "profile_path": null,
               "id": 29287,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4613c3a368484e07d74f",
               "name": "Justin Stanley",
               "profile_path": null,
               "id": 1780,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4613c3a368484e07d755",
               "name": "Eric Miller",
               "profile_path": null,
               "id": 81694,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.723558,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 60009,
      "vote_count": 5,
      "budget": 2000000,
      "overview": "Happily married couple Bob and Dez Wilson and their 12-year old son Andy are being attacked by a blinding light when driving home from a daytrip. They awaken a couple of hours later, seemingly unscathed but soon driven mad by recurring nightmares. It soon appears that they have been abducted by aliens as proved by their sons handycam that had suddenly started running right after the incident. This mysterious fact is discovered by even more mysterious Men In Black who start nagging the family up to the point of threatening to kill them. Laughed at by the police the threesome seek refuge at sf-writer Stan Mills' house and start fighting back.",
      "similar": [
         20424,
         275,
         602,
         49849,
         228161,
         7453,
         16866,
         8067,
         840,
         984,
         2163,
         608,
         2675,
         949,
         47933,
         137113,
         601,
         348,
         10200,
         126889
      ],
      "original_title": "The Shadow Men",
      "runtime": 95,
      "poster_path": "/7eHGW8h7FjMTWD9SKoAe0r2ue8T.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Encounter Productions",
            "id": 40395,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bruin Grip Services",
            "id": 5330,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-24",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "They know that you know",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Timothy Bond"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Justin Stanley",
         "Eric Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0127276/",
      "coverLink": null,
      "actors": [
         "Eric Roberts",
         "Sherilyn Fenn",
         "Dean Stockwell"
      ],
      "reviews": [
         "Okay, all things considered, this movie delivers on a number of issues. There were some good performances from Fenn, Roberts and Stockwell. The dialogue was realistic. Writing was good considering the low budget. The research of the subject matter was excellent! It's just too bad that larger budgets won't support such treatments of well established UFO mythology. This one pretty much got it right, though it relied a little heavily on \"big movie\" gratuities, such as big explosions, high speed action. Overall, the movie was good and is a great addition to the lackluster treatment of UFO lore by Hollywood to date.",
         "Well, This isn't that bad, not as bad as some make it out to be. If you are into UFOs and alien abduction. Some parts are pretty cheesey, but all in all it's not that bad of film. Once you start watching you kind of got to keep watching to see what happens. I'm not much into Eric Roberts movies, but he was actually pretty good in this. If you an actually lover of films then you might like this one. give it a chance. Now, to say that It's unrealistic, you got to remember it is just a movie. I highly doubt that this was based on a real life encounter. just go into with an open mind.",
         "Overall, I was impressed by a number of things. Good casting, pretty good writing, some fine acting from Fenn, Roberts and Stockwell. The lead MIB was well done indeed! Really captures the heart of MIB lore - these folks really did their research (a rarity with these kinds of films, as you know). It's just too bad that this kind of film doesent deserve a larger budget. I give it a solid B!",
         "Saw the last three fourths of this film on TV a while back. While the film isn't all that special, at the least it's a good way to pass the time, especially if you love films about UFOs or alien abductions. It's obvious that the guy who wrote this did some research on the subject, but didn't dig all too deep. It did seem a little cheep that they had scenes of the MIB in black SUVs, a form of vehicle never reported in real life cases. Not bad, but not excellent either. 2 out of 5 stars.",
         "X-files, but with average American family. Alien abduction as \"plausible\" as I have ever seen. Eric Roberts gives a very solid performance. Sherilyn Fenn is beautiful and believable.",
         "It would be interesting to compare this one to Men in Black. (the will smith film.) This was more like what I've heard real life stories of encounters with MIB agents is like. Decent cast, too, with Eric Roberts, Dean Stockwell, and Andrew Prine. Slow and dark at times, but worth the rental if just to satisfy your curiosity. Give it a try. ** 1/2 out of ****",
         "I thought Shadow Men was good, for a direct-to-video flick. Oh sure, the special effects weren't great and there were a few plot holes here and there, but otherwise, it was ok. There was a sort of creepiness about the whole thing. Afterall, would you really want to be chased by the MiB? (And I'm not talking about the light-hearted MiB of Jones and Smith).",
         "Interesting idea, along the lines of the \"real\" men in black, turns into a conventional potboiler about halfway through. Ok action, some good acting, ultimately stock directing... but a good overall attempt by the filmmakers to personalize the characters and give them some depth... out of character for this type of low budget production. Roberts is pretty good, so is Sherilyn Fenn. The stand out for me? It's got to be cult actor Andrew Prine as the main MIB. Above Average, I give it 7 out of ten.",
         "It's not THAT bad... Sure, the photography is flat (considering the DP also shot TWIN PEAKS), uneven performances, rotten editing, bad direction... but let's give the writers their due. They tried to come up with a storyline about the original urban legend of the Men in Black. Characters are well drawn, and it's not the dialogue that's bad, some of it is quite good, it's just the flat, uninspired way the performances are directed. Some stuff is obviously shoe-horned in there, all that ridiculous action stuff, and it's not a good fit... not to mention that protracted alien abduction scene. I've caught the movie a couple of times late night on HBO (not by choice mind you, just works out that way), and if you step back, and look at the story and the writing, you can see that they were going for something a few notches above the standard sci-fi outing. Performances: C+, Direction: D-, Writing: B",
         "This film seems to be an attempt to give a more \"realistic\" portrayal of alien encounters and Men In Black (well I say \"realistic\" because the proof is still lacking). It certainly targets to people (such as myself) who have a strong interest in UFOlogy, aliens, MIBs, the real X files etc. It's not a bad film but not a great film. It's rather predictable throughout because it has all the cliches that we've learnt from the X Files and tv shows about aliens abductions. It is not a bad movie to watch if you are reading a book, playing the guitar or doing something else while it's on. The ending pleasantly and enjoyably excessive but I guess a film needs some sort of closure. There was a lot of talent that was wasted on this film. Both Dean Stockwell and Sherilyn Fenn have made much better films.",
         "Finally, a semi-accurate portrayal of the infamous Men In Black, although I doubt the real MIB agents are alien/human hybrids. Okay, so the plot line was thin and sounded like an x-file, but lets give the writers credit for doing some research in Ufology. Hard core conspiracy buffs and those looking for alternatives to the \"Will Smith\" and \"Tommy Lee Jones\" MIB only.",
         "***SPOILERS*** The movie has to do with a family the Wilsons Bob Dez and 12 year old son Andy, Eric Roberts Sherilyn Fenn & Brendon Ryan Barrett, who when driving home from a hiking trip in the mountains encounter a 100 foot UFO that forces them off the road and into a ditch. It's some two hours later that they find themselves back on the highway with the car or van in working order with no memory of the two hours of missing time. Strange things start to happen to the Wilson's when these strange men in black, black hats sunglasses pants suits shoes as well as socks, lead by this guy who calls himself Perkins, Andrew Prine, show up at the house asking them what happened to them as if they really care. It turns out that these Men in Black-MIB-are only interested in shutting the Wilsons up and keeping them from making public their encounter with the UFO, which Andy secretly video taped with his camcorder, even if they have to murder them in doing it! Bob Wilson now trying to get help gets in touch with top UFO investigator and author Stan Mills, Dean Stockwell, to fill him in about these strange MIB and what to do to get rid them if not with words, the local police aren't any help, or if necessary the use of force. Staying at Stan Mills bunker like home the Wilsons as well as Mills are soon confronted with some two dozen MIB in black driving of course, their favorite color, black SUV's trying to storm the place and, to keep them from talking, murder them. ***SPOILERS*** The usual tame MIB's are a bit more aggressive here then you would expect them to be using military tactics to get things done thus messing up their neatly press black clothes by getting both gun and pellet, from shotgun, shots from Stan Mills and the Wilsons ripping them to shreds. We also get to see these what turned out to be half bred-human and aliens-for what they really are with black bug eyes, under their sunglasses, and this is really strange white soap suds like blood when their shot or battered. the film's star Eric Roberts dose some of his best acting in it by not being the usual psychotic personality that he seems to be playing in most of his movies but a normal well adjusted as well as, in the movies finial scenes, heroic person. One of the better UFO and alien from space movies with the MIB-Men in Black-taking center stage and showing themselves for the scary and dangerous and creepy persons that they really are.",
         "Okay, you've seen Men In Black, right? With Will Smith and Tommy Lee Jones? If so then see this movie for a different spin on the MiB. If you haven't seen Men In Black then see this 1st and Men In Black after. Eric Roberts gives a solid performance? Ummm, can he??? Eric Roberts with a mustache and beard, a family man, father of an 11 year old??? Give me a break! I hope he's on good terms with his sister (Julia Roberts) 'cause if he ever needs money there's surely some in the family! Sherilyn Fenn, though, was Sherilyn Fenn... better in Twin Peaks, eh so so here. The Shadow Men isn't a great flick. The idea, however, I found to be very interesting. Watch it for that (and maybe for Sherilyn!) but not for any artistic value. I don't think there were holes in the plot, it just wasn't very well written. Ten million more dollars, some better actors and a well done re-write and this could have been a pretty good movie... as I said, it's got a good idea... a different spin on Men In Black.",
         "Standard alien-abduction conspiracy-theory story that could be written in one's sleep (and probably was). The centerpiece of the tale is a very unappealing All-American Family...Hollywood Yuppie version. The dad is a complete wimp (he's handed a grenade and says \"What do I do?\"...that really cracked my kids up). The mom is overbearing, overprotective, and humorless...probably heads the local PTA. And the kid is whiny...but then, look at his parents. The only enjoyment I got out of this movie was watching Dean Stockwell....I loved it when he was frying up eggs for breakfast, and then asked the dad if he would rather have granola..or (with great disdain) Yogurt! Personally, Dean would probably have had a better time if he invited the MIB to breakfast...and barricaded his house against the Yuppies.",
         "What a trainwreck. Cheesey family, bisquick-filled villains, horrible dialogue, even worse acting, cliche after awful cliche, large plot holes, non-attention to some details, over-emphasis of other details.... ~Avoid~ this movie, unless you want a good laugh and/or are in the mood to MST.",
         "I was an alien both in the studio (the top floor of the production studio was turned into the space ship hallway boiling hot in that rubber suit), and out on location when the car goes into the ditch (freezing cold - ice on my windshield when I left to go home). I also had to be a body double as the son when he ran out of time (kids can only work so many hours). They wrapped me up in a blanket and Eric had to carry me into the house. The last day of filming, I had to wear a wig and a mole to be Dez (SL was off set that night), and ride around in the minivan as it 'drove through the woods.' This was a fun production to be on! I'm glad that the movie has gotten an OK rating!",
         "For some reason I keep going back to this film. I think it's got something to do with the fact that this film is so bad its compelling to watch. As soon as I saw Dean Stockwell (of Quantum Leap fame) in the opening scene, I could tell this was on of those classic films that you'll remember forever and burst out laughing whenever it is mentioned. After the opening sequence, we are introduced to the family and the father (Bob Wilson, none other than Eric Roberts) a man on a mission, a man with a plan, a man who will drag his beloved family to \"PAINTED MOUNTAIN\" with hilarious but near-deadly consequences. After the unwashed, scabby petrol pump attendant has warned Bob (and given away the plot) we soon discover that the family have been abducted by aliens. In desperation and looking for an answer they contact the military but instead they get two creepy men from the MIB who keep using quirky one-lines such as \"we'll have Coca Colas.........please\" and \"They have a tape, find it!\". An action packed car chase ensues and they seek out the safety of Stan Mills lead-lined estate who's got his phones routed through enough sub systems, that the MIB will never find them, typically however for this sort of films and partly down to tracking device in their son's nose, they do! They have no other choice but to confront the Men In Black, unfortunately for his family though Bob has never shot a gun in his life which he openly admits in front of his scared son and wife who adds \"Got another clip?\" that must've made him feel low. Dean Stockwell comes to the rescue and drives the family away thinking that the single badly thrown granade will rid the of the MIB forever. We end with shots of the new family home of Bob Wilson and his family, but who should be lurking outside? the MIB that's who! I've given this film 4 out of 10, because aside from the tragic plot, bad casting and bad acting it's one of the most memorable and funny things I've ever seen.",
         "Interesting premise, but poor ending. Dean Stockwell explains to the family that the aliens can easily track them whenever they use a credit card, etc. The aliens find the family several times. Near the end, after the battle with the aliens at Stockwell's home, the family and Stockwell leave in Stockwell's car. Part way down the driveway, Stockwell passes the father a couple grenades and tells him to blow up the alien's cars, which the father does. The aliens can be clearly seen still standing around, alive and well, yet for some strange reason the family and Stockwell think they will all be safe from that point on. Why? They could see the live aliens in the rear view mirror. The family moves into a new home and the movie ends with a black car pulling up in front of the new home. Knowing the aliens were not dead, and knowing they had easily tracked the family earlier, it was no surprise they found the family again. One other annoying little thing seen so much in movies. When one of the aliens had been shot or otherwise injured and was lying flat on his back, Stockwell went over, squatted down and practically stuck his face in the face of the alien to check it (the alien) out. Gosh, I wondered what would happen next. Of course the alien suddenly reached up and grabbed Stockwell. Surprise, surprise!",
         "It seems not a single person behind-the-scenes on this project strived to make it anything more than passable. That's not to say the film is bad -- it isn't. It's not great either. It's just... *Meh* There were opportunities in the script for curve balls to be thrown at the audience, but the filmmakers declined. They stuck to the formula, never veered off the path of familiarity, and gave us the plot completely by the numbers. This is the type of movie that you can flip on at any time and not really pay attention, never having to worry if you'll miss any key plot points. I'm a fan of Eric Roberts and find him enjoyable in even the worst of movies, so having him in the cast definitely helped. And kudos to the filmmakers for playing off the ridiculously awful alien costumes for realism. They looked awful, but worked in that \"so cheesy it's fun\" sort of way.",
         "This film, although it is full of movie clichés ufology, is only dealing with the theme \"MIBs\" with the seriousness it is due. Skeptics to be excused, but those who study ufology know there many reports in the world about the presence of these mysterious beings in lives of those who had contact with aliens. The film makes a useful counterpoint MIB series of movies (Men in Black I, II and III success box office in theaters) where they are treated as the \"good guys\" of history. Coincidence or not the film that treats them as villains had little or no visibility, even having been released in the same year first MIB Will Smith.",
         "Any movie with Eric Roberts and Dean Stockwell can't be all bad, and \"The Shadow Men\" confirms this. The film is not all bad, but it is also far from good, in other words average at best. Abducted,typical family, on the run from men in black, with amazing transformation into gun wielding combatants. Most likely no one will be totally satisfied here, certainly not the sci-fi crowd with the simplistic story, and definitely not the action crowd with the laughable gun play. Nevertheless, the presence of Roberts, Stockwell, and Sherilyn Flynn, keeps the acting on track, and aims the film squarely at an average rating (5.0) , where it belongs. - MERK",
         "This is so bad it isn't even funny. I think it must have been written by an unintelligent child. It really is quite unbelievable how poorly-made this film is. It actually has a good cast, but it is one of those films that you can't understand why it got made at all. Best line: \"MIB meet TNT\"!",
         "Apart from the ending scenes, the concept of this movie is really good. If you're into alien abduction or that kind of stuff, you will definitely enjoy this movie. For a low budget film, it's really satisfying. I enjoyed every second while watching, except for the ending scenes which were pretty lame. Acting is good, concept is good. The only bad thing about this movie is the unrealistic encounter scenes, which truly reduces the quality of the film. Especially the alien/human hybrid behavior in the movie is really lame. If that was taken care of, i'd say it's at least a 6 out of 10 for those who haven't seen this one yet. Watch it, it's worth it.",
         "On their way home from a camping trip Robert Wilson and his family saw something in the sky, a bright light that seemed to have been chasing them, the following day Robert Wilson contacts the air force wanting to make sure whether or not it might have been a new type of aircraft being tested, then strange men arrive at their home asking strange questions and soon the Wilson family realize their lives could be at risk. This little Sci-Fi thriller does believe it or not take itself seriously but it comes off as rather cheesy but I was entertained nonetheless, the acting was above average the direction was okay and the storyline was in fact cheesy but it had its moments, the special effects are really nothing to talk about, the aliens look almost like the ones in SCARY MOVIE 3 but that at the end just added to the overall cheesiness of the film. Of course if cheesy Sci-Fi features are you're thing, try tracking down a film called THE SILENCERS directed by Richard Pepin.",
         "Bought the Video for 50 cents, in the local blockbusters 'culling' of 'rust'. Cover looked good,shadowy figures shrouded by mist, a promise of a 'cracker jack' MIB and cover-ups. Pace, energy, dramatic tension empathy with character,there is none there. Eric Roberts, an actor who I was not aware of before this movie,stars as Bob Wilson , a man with very bad facial hair,looking late 70's.There is some scenes in the movie where he looks like he has lost some 'teeth' on the left side and the beard is a beard to hide the fact. It looks and runs like a 'low budget' B,but without the 'whackyness' to become a cult movie. The story has been culled from the 'real' UFO alien abduction case's that were abound during the year 1996 and 1998.These books collectively had concluded the the 'greys' have been here all the time,but are so sensitive to sunlight,they are addicted to 'ray bands' and black suits and cars.Because they are so embarrassed off these 'faults' they are determined to remove any evidence that earthlings may have happened to stumble on, that they exist. The Movie does not get off first base. Dean stock well, who plays the UFO writer Stan Mills adds some , energy' to this movie,but you do feel that somehow Dean is winking to the camera with the thought, can you really believe this..... Howver there was a 'laff', the dog's name was 'anthrax', a sly reference to 'close encounters....' Lisa Dinkins, the desk sergeant, looks more angry towards the director on the set, than to the character who'dosn't make her day'. The Shadow Men, lacks script, and direction.For a film made in 1998 it looks and rides like a 'loss leader'. It deserves only a two, but I'm open to suggestions that it deserves better. BJay,aka gemma100"
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Bruin Grip Services",
         "Encounter Productions"
      ],
      "summaries": [
         "Happily married couple Bob and Dez Wilson and their 12-year old son Andy are being attacked by a blinding light when driving home from a daytrip. They awaken a couple of hours later, seemingly unscathed but soon driven mad by recurring nightmares. It soon appears that they have been abducted by aliens as proved by their sons handycam that had suddenly started running right after the incident. This mysterious fact is discovered by even more mysterious Men In Black who start nagging the family up to the point of threatening to kill them. Laughed at by the police the threesome seek refuge at sf-writer Stan Mills' house and start fighting back.",
         "After a family has an alien encounter, they call the Air Force to report the incident which leads to a visit by Men In Black, who turn out to be alien-human mutants."
      ],
      "budget": 2000000
   },
   "movielensId": 126229,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-09-24",
      "dvdReleaseDate": null,
      "directors": ["Timothy Bond"],
      "runtime": 95,
      "movieId": 126229,
      "title": "The Shadow Men",
      "mpaa": "R",
      "actors": [
         "Eric Roberts",
         "Sherilyn Fenn",
         "Dean Stockwell",
         "Brendon Ryan Barrett",
         "Andrew Prine",
         "Chris McCarty",
         "Tom Poster"
      ],
      "imdbMovieId": "0127276",
      "originalTitle": "The Shadow Men",
      "genres": [
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["oBqgykQ_RTQ"],
      "plotSummary": "Happily married couple Bob and Dez Wilson and their 12-year old son Andy are being attacked by a blinding light when driving home from a daytrip. They awaken a couple of hours later, seemingly unscathed but soon driven mad by recurring nightmares. It soon appears that they have been abducted by aliens as proved by their sons handycam that had suddenly started running right after the incident. This mysterious fact is discovered by even more mysterious Men In Black who start nagging the family up to the point of threatening to kill them. Laughed at by the police the threesome seek refuge at sf-writer Stan Mills' house and start fighting back.",
      "tmdbMovieId": 60009,
      "avgRating": 2.7,
      "releaseYear": "1997",
      "numRatings": 5,
      "posterPath": "/7eHGW8h7FjMTWD9SKoAe0r2ue8T.jpg"
   }
}