{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "surgery",
            "id": 157959
         }
      ],
      "imdb_id": "tt0028958",
      "video": false,
      "title": "Green Light",
      "recommendations": [],
      "backdrop_path": "/eJ0rRIJO21YhMNaUuhb9mdfqC0J.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dr. Newell Paige",
               "gender": 2,
               "credit_id": "52fe4b78c3a368484e18a8b3",
               "name": "Errol Flynn",
               "profile_path": "/2fd8ZORZMGFJQqMcnoNgSnTOpPS.jpg",
               "id": 8724,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Phyllis Dexter",
               "gender": 1,
               "credit_id": "52fe4b78c3a368484e18a8b7",
               "name": "Anita Louise",
               "profile_path": "/dmF7AKtfrjr2xdX2Mbn4s8OSjGj.jpg",
               "id": 34442,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Frances O'Gilvie",
               "gender": 1,
               "credit_id": "52fe4b78c3a368484e18a8bb",
               "name": "Margaret Lindsay",
               "profile_path": "/2lDJFueklrAQBc7gg13NyVAy8HL.jpg",
               "id": 20365,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dean Harcourt (as Sir Cedric Hardwicke)",
               "gender": 2,
               "credit_id": "52fe4b78c3a368484e18a8bf",
               "name": "Cedric Hardwicke",
               "profile_path": "/yaOgPrY8PBPkyqXHm7NVl0p2er7.jpg",
               "id": 99461,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "John Stafford",
               "gender": 2,
               "credit_id": "590558a492514169d0014c6f",
               "name": "Walter Abel",
               "profile_path": "/zaeePX2vbnFw7gzATG5Q1XeTkJv.jpg",
               "id": 77114,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b78c3a368484e18a8af",
               "name": "Frank Borzage",
               "profile_path": "/ywsES5vf5uH4GelIDmaJWJAhdOG.jpg",
               "id": 14855,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b78c3a368484e18a8c5",
               "name": "Milton Krims",
               "profile_path": null,
               "id": 130933,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b78c3a368484e18a8cb",
               "name": "Lloyd C. Douglas",
               "profile_path": null,
               "id": 1154117,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.120516,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 131457,
      "vote_count": 1,
      "budget": 0,
      "overview": "A brilliant young surgeon takes the blame for a colleague when a botched surgery causes a patient's death and buries himself at a wilderness research facility.",
      "similar": [
         40807,
         11005,
         11306,
         510,
         1367,
         2064,
         1903,
         416477,
         10312,
         48138,
         26976,
         797,
         4922,
         4347,
         88,
         567,
         8836,
         1700,
         1955,
         2300
      ],
      "original_title": "Green Light",
      "runtime": 85,
      "poster_path": "/s0Ahbs1krO6aWt5qcEc1wF6OAyg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1937-02-20",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Frank Borzage"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Milton Krims",
         "Lloyd C. Douglas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028958/",
      "coverLink": null,
      "actors": ["Stars: Errol Flynn, Anita Louise, Margaret Lindsay | See full cast and crew »"],
      "reviews": [
         "Green Light is beautifully directed, has a first rate score, and has a melodramatic mood throughout that makes it wonderful to watch. It relates the story of a young doctor who takes the fall for an elder doctor's mistake. Errol Flynn delivers a fine performance as does Sir Cedric Hardwicke, Margaret Lindsay, and Walter Abel. It is a terrible reality that so many fine classics are not yet available on DVD. In my opinion, better than its rating. Fans of Flynn will not be disappointed.",
         "Because Green Light was done under the banner of Cosmopolitan Pictures for Warner Brothers, I've got a feeling that William Randolph Hearst might have originally intended Anita Louise's part for his amour Marion Davies. The thought of Marion Davies and Errol Flynn together in a film boggles the mind, but I'll bet Hearst would not have wanted Flynn opposite Davies for personal reasons as Errol was just starting to acquire his reputation as a rake. W.R. provided Flynn with a change of pace that he requested. After doing adventure films Captain Blood and Charge Of The Light Brigade, Flynn wanted something different. Green Light is based on a Lloyd C. Douglas novel of spiritual values and Universal had just had a smash hit in Magnificent Obsession that made Robert Taylor a major star. No doubt Hearst persuaded Jack Warner to get the film rights for Davies, but then Marion couldn't go through with it. The story does center on the man however and that was never something you would see in a Davies film. Errol Flynn plays an idealistic young surgeon who takes the rap for a botched operation that his mentor Henry O'Neill performed. Resigning the hospital he goes to work for research scientist Walter Abel who is looking for a cure for spotted fever in the west which is deadly to humans and livestock. Along the way he meets and falls for Anita Louise who is the daughter of the woman who died on the operating table, Spring Byington. Presiding over all of this is an Episcopal bishop played by Cedric Hardwicke. In her last hours Byington is heard listening to a broadcast by radio of one of Cedric Hardwicke's inspirational sermons. Hardwicke functions as the author's voice, he shares with the other characters and the audience the philosophy of self sacrifice and good works that Lloyd C. Douglas had. With all these people being so noble and self sacrificing, you know it has to turn out all right. Flynn never quite nails down the character which would have been ideal for Tyrone Power over at 20th Century Fox. Still he gives it a good try and the audience did respond. But it would be a long time before Jack Warner would cast him in a modern drama. For me the character I remember best is that of Margaret Lindsay who plays a nurse who really has it bad for Errol, but who loyally steps aside and even helps Louise get together with Flynn. Now THAT'S a sacrifice.",
         "Though not a 'period piece' \"Green Light\" dates much more than its Errol Flynn-starring predecessors \"Captain Blood\" and \"Charge of the Light Brigade\". And that's not necessarily a bad thing. The film was made when the Art Deco-1930s were in full flower. Frank Borzage's direction and the cinematography are beautifully impressionistic and occasionally artsy in a then-modern way as well. Flynn's smiles a bit too broadly and too often in early scenes, in a seeming bid to bring across a likable character. When he shifts attention to others he is much more natural and believable in the film. Sir Cedric Hardwicke is well cast as the venerable Anglican reverend Dean Harcourt. His booming baritone voice put across his character's appeals for faith and other Christian virtues which are immediately believable (though his pipe-smoking is a bit incongruous with such a character). One drawback of the film is that its script literally contorts to AVOID the direct mention of Jesus Christ, or the quotation of any recognizable Scriptures (until the finale), substituting semi-mystical pieties and somewhat vague aphorisms of encouragement. It is strongly implied that Flynn's character has undergone a conversion by the time the picture concludes, but it is never expressly stated. Anita Louise, a lovely blonde, plays one of the women vying for Flynn's affections. Playing the role of her mother is Spring Byington, a delightful busybody in \"Charge of the Light Brigade\", but here a radiant Christian woman, full of faith, hope, and love which Flynn's initially-sceptical character comments upon long after her scenes are over. The screenplay and film editing are not as sharp as those of Flynn's most beloved films, and Max Steiner's music is beautifully romantic but oddly unmemorable---which is hard to believe considering his catalog of work (the rousing \"Charge of the Light Brigade\", for instance, or the classics \"The Wizard of Oz\" or \"Casablanca\"). The choristers (boys) of St. Luke's Episcopal Church effectively lend their voices to a few scenes, and would do so in Flynn's follow-up film, \"The Prince and the Pauper\". \"Green Light\" is a diamond in the rough, a neglected gem, and somewhat of a spiritual cousin to Hollywood's \"One Foot in Heaven\" which starred Fredric March as a minister some four or five years later. It is aired on occasion on TCM (Turner Classic Movies), but has yet to be officially released on videocassette or DVD. In retrospect it is a bit of surprise choice for an Errol Flynn role, as the film is not nearly so high-budgeted as his preceding pictures. But he desired to prove himself as an actor, not just an action hero in the Douglas Fairbanks Sr. mode, and this was his first non-swashbuckler in which to essay the sort of role Ronald Colman took on in \"Arrowsmith\" six years earlier.",
         "Lloyd Douglas was a popular author whose books, Magnificent Obsession, Demetrius and the Gladiators, the Robe, and this film, Green Light, were all made into films. Since Douglas was a Lutheran minister, his stories often had a spiritual theme. In \"Green Light,\" a surgeon (Errol Flynn) takes the rap for another surgeon (Henry O'Neill) when a patient dies during surgery. He is asked to resign his hospital position, which he does, and he joins a fellow doctor (Walter Abel) in his work to find a cure for spotted fever. Cedric Hardwicke plays an Episcopal minister who is the spiritual adviser of the dead woman's daughter (Anita Louise) and Flynn's nurse (Margaret Lindsay). He is the voice of author Douglas. The theme is self-sacrifice, that no person exists alone, and that we all are part of life's tapestry. The needs of the many outweigh the needs of the one. As others have pointed out, this is a different type of role for Errol Flynn. He doesn't quite nail it. Handsome and charming, Flynn was a sincere actor whose looks and athleticism made up for the fact that he very often didn't get under the skin of a role. This role called for a more solid, contemplative approach. Someone on this board mentioned Tyrone Power, and I agree, he would have been a better choice. Flynn was just too lightweight for this sort of part, though, like everything else he did, he gets away with it. He was a movie star first, and that covered a multitude of sins. Lindsay and Louise don't have much to do. Hardwicke imbues his role with a great deal of dignity. A definite for Flynn fans to see him do a role against type.",
         "If I should choose one American director for the twenties/thirties,I would take Frank Borzage any day. This is a film of a believer ,but a believer who never falls into the trap of bigotry:the \"green light\" of the title is the light that comes from the sky,the light of hope which should enlighten everyone.His early silent movies (particularly \"Humoresque\" ) displays a strong faith in a divine intervention provided that you are worthy of it.\"Seventh Heaven\" ,\"Little man what now\" ,to name but two,featured characters who had nothing,nothing but their love for each other and their faith in providence.It would culminate in 1940 with Borzage's masterpieces,\"the mortal storm\" and \"Strange cargo\",particularly the latter where Cambreau becomes some kind of messiah. Eroll Flynn,cast against type ,-but portraying a physician who predates his role in Walsh's \"Uncertain Glory\" where he finally sacrifices everything- ,gave all:first he took the blame for an operation which cost a patient her life;then he acted as his own guinea pig for his vaccine.It often recalls \"magnificent obsession\" (the first version by J.Stahl was released two years before):both works feature a man of God : the man who tells the hero of \"obsession\" a man died on the cross for man's salvation,the priest in \"green light\".The choir in the church which we heard at the beginning returns for a canticle which climaxes the movie .Be prepared to sacrifice anything and do not ask anything in return,there will be a reward anyway.",
         "Errol Flynn stars as idealistic young doctor who takes the blame for a botched operation that costs a woman her life. Why he does this is supposed to be noble but seems stupid to me. After he's dismissed by the hospital, he joins a friend (Walter Abel) researching a cure for spotted fever. Abel has lots to say about ticks and spotted fever, so have a pencil and paper handy. An odd movie, especially for Flynn. What makes it odd isn't the medical melodrama I summarized above. Those types of movies were a dime a dozen back then. No, what makes it odd and also fascinating is the inclusion of spiritual themes. In particular Cedric Hardwicke's character. Hardwicke plays a perspicacious reverend, equal parts Mr. Miyagi and Gandalf. His scenes are some of the movie's most interesting. Errol's love interest choices are Anita Louise and Margaret Lindsay. I won't spoil which he picks but it wasn't the one I was rooting for. The cinematography and score are excellent, as is Frank Borzage's direction. It's a very good-looking movie. Not always successful but intriguing in many ways. Definitely worth recommending.",
         "... the result is total confusion at best, and that best sums up how I felt watching this film. What saves it and makes it worth watching? First there's the cast, most of all the always charming Errol Flynn in a most unusual role along with the often overlooked Margaret Lindsay, feisty and loyal in her role here. Next there is Frank Borzage's direction. With his love of humanity shining through he makes something that seems weird taken plot point by plot point and makes it a warm enjoyable experience. Now for the confusing part - the entire plot. Errol Flynn plays a brilliant young surgeon, Dr. Newell Paige. Warm to everyone he meets, always with a smile, plus he likes dogs - his dog is a constant companion. The day comes for the operation of a prominent older woman in the community, Mrs. Dexter. The situation is urgent, but the surgeon that is to perform the operation is nowhere to be found (Henry O'Neill as Doctor Endicott). It turns out he's in a broker's office trying to save his portfolio from ruin. Paige starts the operation, but Endicott shows up in the middle and takes over. He cuts an artery too short for it to be clamped and Mrs. Dexter, dies. In private, Endicott admits his blame to Paige, but he refuses to blame himself when the hospital board brings up the whole matter at a hearing that is there for only one reason - to find someone to blame and fire for this incident. Paige doesn't show up at the hearing either, leaving the board to reach the conclusion that Paige is at fault and ask for his resignation - he gives it. Now, we're not talking about some 25 year old retail clerk covering for the mistake of a 60 year old retail clerk and taking the blame so the older less employable person won't be fired. We're talking about a trusted surgeon who made a fatal error because he was distracted. Do you think he's less distracted and therefore less dangerous the next time he's in the operating room with the guilt of the destruction of Paige's career on his conscience in addition to the worries over his personal finances? In spite of this obvious injustice, everyone in the know about what really happened digs their heels in about covering for Endicott even using \"professional ethics\" as an excuse. The only voice of reason here is Margaret Lindsay as Frances, Paige's nurse and obviously more than a little in love with him, but right just the same. She's about to blow the whole thing wide open when she's directed to Dean Harcourt, the minister that has counseled Paige and made him believe he was right to take the blame. Sir Cedric Hardwicke as the sublime old cleric is quite likable in his role, again owing to his own talent and probably to that of Frank Borzage, but if you listen to his words like you are reading a court transcript they are like so many fortune cookie sayings stitched together into some kind of psycho-babble. Worse, this minister seems to think it is a good idea to put people into embarrassing situations by introducing them to one another without them knowing the prominent part they play in each other's dilemmas. He does this to Mrs. Dexter's daughter (Phyllis played by Anita Louise) and Dr. Paige. They fall for one another. That is, until Phyllis finds out Dr. Paige was blamed for her mother's death, then she'll have nothing to do with him. How does Paige deal with this? He goes to the site of the North American plague of the time - Rocky Mountain Spotted Fever - where intense medical research is going on for a cure. He tests a vaccine on himself by injecting himself with the possible antidote and then deliberately allows himself to be bitten by a tick carrying the disease. If he lives, the antidote works. His reason? He somehow feels like he has to make amends and have his life - or death - mean something. What?? He is the guy who allowed himself to be unjustly accused and fired for something he didn't do, lost the girl he loved - Phyllis - to maintain the ruse, and he thinks he's anything but a prince of a guy? Then there's the whole matter of Frances, working side by side with Paige for years, beautiful, smart, and loyal, yet Paige skips over her entirely and falls for a girl he barely knows. In spite of what I've written here I really like this film and watch it periodically - it is a positive experience to watch a film full of characters with the best of intentions even if their reasoning skills are a bit off kilter. You really can't miss with Flynn starring and Borzage directing, but just don't expect for a minute to understand the motivations of any of the characters involved.",
         "This might just be the strangest Errol Flynn film other than the truly odd Cuban movies he made at the very end of his career. It has many strange plot elements and a convoluted religious element that just left me dazed! But, despite the very strange writing, the overall effort is still pretty good--mostly because it's hard to imagine Errol Flynn making a bad film! Heck, drunk and disinterested, he was still a heck of an actor--and here he is young and vigorous and engaging. The film begins with a strange Norman Vincent Peale sort of sermon by Cedric Hardwicke. In fact, whenever this odd preacher talks, he sounds very mystical...but never seems to mention God or the Bible! And you also wonder what the heck he has to do with the rest of the film. Well, honestly, he DOESN'T have much to do with the film--he seems more like a wacky social gospel-spouting plot device--but a pleasant one. The film actually has to do with a bizarre doctor (Flynn) who inexplicably covers for his boss when the boss-man botches an operation and kills a patient. I say inexplicable because his reasons for covering for the elder doctor seemed convoluted to say the least. As a result of taking the blame for something he DIDN'T do (and, by the way, possibly allowed an inept surgeon to keep practicing), agnostic Flynn goes to see Hardwicke--who pulls some strings and manipulates him into meeting the daughter of the woman (Anita Louise) killed by the other doctor. She falls for him but when she discovers that Flynn is the one blamed the death, she despises him and he runs off to a life of self-sacrifice working on Rocky Mountain Spotted Fever! This culminates with him injecting himself with an experimental vaccine--and Louis comes running to him! Does the amazingly self-sacrificing Flynn pull through?! Well, don't expect any surprises! If the plot I described sounds convoluted and weird, that's because it is--and it's actually a bit worse, but I omitted a bit of the plot due to space. The bottom line is that the film STILL manages to be enjoyable even though it is never the least bit believable. A very minor Flynn outing to say the least. At least it IS original!",
         ". . . for preserving Good Old Boys Networks, Institutional Sadomasochism, perpetuating the plague of callous murders-by-malpractice in America's hospitals, and upholding Religion based upon the precept that \"The Richest Person Is Always Right.\" Mr. Douglas probably saw a movie in which one of Walter Reed's buddies lets himself be bitten by a Yellow Fever-infected mosquito, and rushed home thinking \"Let's up the ante--a Tick's bite is Ickier than a 'Squeeter's any day of the week!\" At this time, America thought that 14-year-old girls made Errol Flynn tick. In a brilliant piece of casting against type, Warner Bros. convinced Errol to make GREEN LIGHT to show that it was actually TICKS that made him tick! Though Oscar Wilde was clairvoyantly channeling Errol when he wrote A PORTRAIT OF DORIAN GRAY (autopsy results would show that Mr. Flynn died at 50 in a nonagenarian's body), Mr. Douglas laughed all the way to the bank thinking about such a hedonist being cast as his unlikely saint in GREEN LIGHT. Many may argue over whether this tale's \"Dean Harcourt\" is more Iago or Machiavelli, but most will enjoy seeing the lowly wood tick getting \"in like Flynn.\"",
         "This is a rather uneven production, but still very good. Some of the dialog early on in the film occasionally seems a tad awkward, but on the other hand the scenes in surgery seem far more realistic (in terms of equipment, etc.) than would be typical, particularly for 1937. I will say that after watching part of the film, and then looking up the date, I was surprised it was filmed as late as 1937; I was thinking more like 1935 or earlier. As to the story, I noticed one of our reviewers said it was corny. If he/she means good-versus-bad, then yes, it's corny. Although I would prefer to use the term \"old-fashioned\". There are actually several stories here -- the botched surgery and who does/should take the responsibility; two women in love with the same man; the search for a vaccine for Rocky Mountain Spotted Fever; the guilt felt by one surgeon. It's a good story, and I enjoyed it. As to the performances, this film was made just as Errol Flynn was first moving into his prime movie years. His performance here is excellent, and quite a change from the two films which preceded this one -- \"Captain Blood\" and \"Charge Of The Light Brigade\". Two women are cast here as the female leads. Anita Louise does very nicely here as the daughter of the woman who dies on the operating table. She alternates her feelings for the doctor she thinks is responsible (Flynn) from hate to love...and that's love before she learns he was not responsible for her mother's death. It's a very good performance. Margaret Lindsay as the nurse who loses Flynn but gains a cause is very, very good, as well. Sir Cedric Hardwicke is excellent here as the wise minister...in an interestingly broad portrayal as a man of God. Walter Abel is a fellow doctor who moves west and attempts to track down a cure for Rocky Mountain Spotted Fever. Abel always interested me in films...I always like him, even though sometimes he just seems not quite right in a role...as here...yet, he does add to the enjoyment of this film. Spring Byington -- who actually was once middle-aged! -- is the mother who dies on the operating table; a good role, but brief. It you enjoy old-fashioned right versus wrong films, then you'll like this one. I did."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "When his colleague Dr. Endicott is late for an operation, Dr. Newell Paige decides to proceed with Mrs. Endicott's scheduled surgery. The surgery had already been postponed from the previous day and Paige is convinced the surgery needs to go forward without delay. Part way through the operation however, Endicott arrives and takes over only to make a serious error. When a hospital inquiry finds Dr. Paige responsible for Mrs. Dexter's death, he is forced to resign. By chance he meets Mrs. Dexter daughter, Phyllis, and while there is a mutual attraction, she rejects him when she learns his true identity. With little else to do, Paige decides to join his one time hospital colleague in Montana, Dr. John Stafford, who is continuing his tests into spotted fever. Paige is impatient however and decides to test a possible cure on himself.",
         "Dr. Newell Paige is a well respected and dedicated young surgeon at Baytree Hospital in Massachusetts. The hospital's equally respected senior surgeon is Dr. Endicott, who as of late seems more concerned about fame resulting from his speaking engagements or personal wealth through gains in the stock market. Dr. Paige is to assist Dr. Endicott in the upcoming surgery for Mrs. Dexter, a benefactress of the hospital. Although Mrs. Dexter realizes her situation serious, she is content with whatever happens since she follows the philosophies of the Dean Harcourt, an Anglican priest who espouses that life has its obstacles, overcoming which will lead on a march to a brighter eternity. After a few delays in the surgery of Dr. Endicott's selfish doing, Mrs. Dexter dies on the operating room table due to an error on a distracted Dr. Endicott's part. Everyone in the operating room, including both doctors and the chief surgical nurse, Frances Ogilvie, who is in love with Dr. Paige, know what caused Mrs. Dexter's death. But Dr. Paige refuses to attend the hospital board hearing on Mrs. Dexter's death, and Dr. Endicott refuses to implicate anyone including himself. As such, the board finds Dr. Paige responsible and asks for his resignation, which he provides. Although dismissive of the Dean's philosophies at first, Dr. Paige eventually uses that philosophy to move to the next phase of his life, which includes working for his friend, bacteriologist Dr. John Stafford, in the dangerous mission to find a vaccine for the deadly Rocky Mountain spotted fever. The Dean also assists Miss Ogilvie in how best to help Dr. Paige; Miss Dexter's daughter, Phyllis Dexter, come to terms with her mother's death which she initially blames on Dr. Paige; and Dr. Endicott come to terms with his own life in relation to Mrs. Dexter and Dr. Paige.",
         "Dr. Newell Paige is a dedicated surgeon and physician who is devoted to his patients and to the ethics of his profession. Covering for his mentor, Dr. Endicott, who is consumed by personal problems, Paige operates on a wealthy donor to the hospital, Mrs. Dexter. However, Dr. Endicott rushes in at the last moment and in his haste botches the surgery. Mrs. Dexter dies. An inquiry ensues and Dr. Endicott refuses to take or pass blame. The presumption of guilt then falls on Dr. Paige, who resigns rather than blame his mentor. By accident, Paige meets and falls in love with Mrs. Dexter's daughter Phyllis. When they each learn the other's true identity, Paige leaves rather than cause Phyllis pain, since she blames him for her mother's death. Paige travels to a rural settlement to join his friend Dr. Stafford in a dangerous experiment intended to eradicate spotted fever, which has decimated the local population. Influenced by the religious and ethical expoundings of church dean Harcourt, Paige risks his life in hopes of giving something of value to mankind.",
         "A brilliant young surgeon takes the blame for a colleague when a botched surgery causes a patient's death and buries himself at a wilderness research facility."
      ],
      "budget": 0
   },
   "movielensId": 126249,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1937-02-20",
      "dvdReleaseDate": null,
      "directors": ["Frank Borzage"],
      "runtime": 85,
      "movieId": 126249,
      "title": "Green Light",
      "mpaa": "",
      "actors": [
         "Errol Flynn",
         "Anita Louise",
         "Margaret Lindsay",
         "Cedric Hardwicke",
         "Walter Abel"
      ],
      "imdbMovieId": "0028958",
      "originalTitle": "Green Light",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A brilliant young surgeon takes the blame for a colleague when a botched surgery causes a patient's death and buries himself at a wilderness research facility.",
      "tmdbMovieId": 131457,
      "avgRating": 1.5,
      "releaseYear": "1937",
      "numRatings": 1,
      "posterPath": "/s0Ahbs1krO6aWt5qcEc1wF6OAyg.jpg"
   }
}