{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "manservant",
         "id": 191749
      }],
      "imdb_id": "tt0028353",
      "video": false,
      "title": "Thank You, Jeeves!",
      "recommendations": [],
      "backdrop_path": "/5E5ZLDDPvo8O0GOCUXvcUK7aqQW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jeeves",
               "gender": 2,
               "credit_id": "52fe48469251416c910866c9",
               "name": "Arthur Treacher",
               "profile_path": "/kKHJIUgyUBL5R202XJKj3kXfzXe.jpg",
               "id": 5831,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marjorie Lowman",
               "gender": 0,
               "credit_id": "52fe48469251416c910866cd",
               "name": "Virginia Field",
               "profile_path": "/i4argwaZP21uvWnR4WX43jcoGkb.jpg",
               "id": 83477,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bertie Wooster",
               "gender": 2,
               "credit_id": "52fe48469251416c910866d1",
               "name": "David Niven",
               "profile_path": "/xslrziGA3B24iQ7BG9IO0ugycDo.jpg",
               "id": 14261,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Elliott Manville",
               "gender": 2,
               "credit_id": "56c749cac3a3680d57006893",
               "name": "Lester Matthews",
               "profile_path": "/tCUjqHsBSFO4g7NnbdWlX1tTy7g.jpg",
               "id": 82488,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Tom Brock",
               "gender": 2,
               "credit_id": "56c749d5c3a3680d49007358",
               "name": "Colin Tapley",
               "profile_path": "/wSJSbciHAGNyXa2ywQ346KTFkdE.jpg",
               "id": 96743,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Jack Stone",
               "gender": 0,
               "credit_id": "56c749e29251412454006f2b",
               "name": "John Graham Spacey",
               "profile_path": null,
               "id": 1193858,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mr. Snelling",
               "gender": 2,
               "credit_id": "56c749f0c3a3680d5700689d",
               "name": "Ernie Stanton",
               "profile_path": null,
               "id": 120463,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Bobby Smith",
               "gender": 2,
               "credit_id": "56c749fdc3a3680d3e007b95",
               "name": "Gene Reynolds",
               "profile_path": "/bjrNIqNKFqZsd38FMkrTiXtyzXe.jpg",
               "id": 14874,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Edward McDermott",
               "gender": 2,
               "credit_id": "56c74a0c925141245b0070a6",
               "name": "Douglas Walton",
               "profile_path": "/tRk01D9crSmSeqnP0DK7G9blRB5.jpg",
               "id": 2928,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Drowsy",
               "gender": 2,
               "credit_id": "56c74a1b9251415475004e14",
               "name": "Willie Best",
               "profile_path": "/oy9djmDFfzAaeUiNPOfB8JcxE5c.jpg",
               "id": 34185,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "56c7499cc3a3680d52006d5e",
               "name": "Arthur Greville Collins",
               "profile_path": null,
               "id": 1127087,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56c749a8c3a3680d4e007829",
               "name": "Joseph Hoffman",
               "profile_path": null,
               "id": 120465,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56c749b1c3a3680d52006d65",
               "name": "Stephen Gross",
               "profile_path": null,
               "id": 1580199,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56c749bb92514173970004cd",
               "name": "P.G. Wodehouse",
               "profile_path": null,
               "id": 1279068,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.001763,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 82237,
      "vote_count": 0,
      "budget": 0,
      "overview": "Jeeves tries to keep his young master out of trouble.",
      "similar": [
         413648,
         86914,
         121559,
         42987
      ],
      "original_title": "Thank You, Jeeves!",
      "runtime": 57,
      "poster_path": "/64dsFACsJ0mpeOZcffDohZo9b35.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1936-06-30",
      "vote_average": 0,
      "belongs_to_collection": {
         "backdrop_path": "/vpi9WAWcStFqiTZ5qJu0LagePjm.jpg",
         "name": "Wodehouse P.G. Collection",
         "id": 122778,
         "poster_path": "/q0q7SlFCe0RUpbbhjEf6YatdNWs.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Arthur Greville Collins"],
      "runtime": 57,
      "synopsis": null,
      "writers": [
         "Joseph Hoffman",
         "Stephen Gross"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028353/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjY1NDExMzA5Nl5BMl5BanBnXkFtZTcwNzYwNzY0MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Arthur Treacher, Virginia Field, David Niven | See full cast and crew »"],
      "reviews": [
         "I have two problems with this movie. First: If you've ever read any of P.G. Wodehouse's classic \"Wooster and Jeeves\" stories you will be sadly disappointed by this adaption. Only the names are left from the original, this is a vehicle for British comic actor Arthur Treacher and nothing else. Second: Treacher as Jeeves hogs every scene, and the enchanting (elsewhere) David Niven is left with nothing but feeding him a few pathetic straight-man lines. What a waste, he's one of my favorite actors and would have made a perfect Wooster had they let him anything try. So, what we have is a glorified Music 'All turn by Mr. Treacher preserved on film. Many critics seem to like it, they may be right, I was too blinded by my love of the books to be objective. For fellow Plum fans I recommend the fairly recent adaptations done by Hugh Fry and Stephen Laurie, I believe they're available on video. They're well done and faithful.",
         "He only gets third billing (behind Arthur Treacher & Virginia Field), but this was effectively David Niven's first starring role and he's charmingly silly as P. G. Wodehouse's dunderheaded Bertie Wooster, master (in name only) to Jeeves, that most unflappable of valets. As an adaptation, it's more like a watered-down THE 39 STEPS than a true Wodehousian outing. And that's too bad since the interplay between Treacher & Niven isn't too far off the mark. Alas, the 'B' movie mystery tropes & forced comedy grow wearisome even at a brief 57 minutes. Next year's follow-up (STEP LIVELY, JEEVES) was even more off the mark, with no Bertie in sight and Jeeves (of all people!) forced to play the goof.",
         "When muddleheaded Bertie Wooster - London playboy & man about town - gets himself into trouble, he can always rely on the inimitable Jeeves, his gentleman's gentleman, to extricate him from the plight. When Bertie becomes involved with a beautiful mystery woman, Jeeves must utilize brawn, not brain, to rescue him from a dangerous gang of international thieves. Hopefully, Wooster will once again be able to say, `THANK YOU, JEEVES!' Very loosely based on one of his novels, Sir P. G. Wodehouse's immortal characters come alive in this, the first of two Jeeves films produced by 20th Century Fox. At only 57 minutes long, the film wastes no time in getting into its funny business. Fans of the short stories & novels will notice that liberties were taken with the characters. Jeeves is less of the all-knowing automaton; in fact, he uses not his cerebral matter but a knowledge of fisticuffs to catch the villains. Bertie is still rather zany, but his (eventual) success with the fair sex has noticeably improved. Having played butlers so often, Arthur Treacher here has the plum role of his career. He is perfect as Jeeves: tall, with forbidding intellect - but not afraid to unbend and sing a rousing hunting song or swing a mean battle-ax. David Niven is a lot of fun as Wooster, vague & a bit befuddled, but loyal & brave in defending his lady love. She is played nicely by Virginia Field. Willie Best has some very funny moments as a stranded saxophonist who adds to the hilarity.",
         "Thank You Jeeves! - 1936 Hollywood adaptation of the P.G. Wodehouse characters.Arthur Treacher does a good job as Jeeves and David Niven is fine as Bertie Wooster- but aside from the funny opening drum sequences and some great one-liners- this movie feels like the screenwriter is trying to sandwich the Wodehouse characters into a whodunnit Thin Man style or something.Things really go south when they pick up a wayward sax player played by Willie Best-who shucks and jives his way thru most of the second half of the movie-although he is part of a funny sequence where he is playing the sax and Jeeves is dancing-has to be seen to be believed.This is more a curio-than a true adaptation of the Wodehouse books- it has enough funny stuff to sustain it's 53 minute run time- but it will be a disappointment to hardcore fans of the Wodehouse prose.The DVD has a good 24 minute biography on Wodehouse. C+",
         "Although he's third billed in this film, David Niven finally was noticed by critics in the role of eternal playboy Bertie Wooster. But the first billed individual here Arthur Treacher was typecast for the rest of his life playing P.G. Wodehouse's dour butler Jeeves. This was a B film for 20th Century Fox one of the first under the banner of the new company and it doesn't quite make an hour's running time. Still both Niven and Treacher got their starts. Niven has been described as the man who carried more films with charm than any other actor. That's what Bertie Wooster's about, a rich young and bored heir who is forever getting in situations because he doesn't have to work for a living. This was Wodehouse satirizing the British upper classes between the World Wars. Yet Wooster is likable and charming if completely useless. One fine boring evening Virginia Field changes all that by crashing the Wooster living space being pursued by some men. Then she leaves after spending the night and Niven wants to find her and over Treacher's objections they pursue her as well as her original pursuers. Arriving at an inn they blunder into things without knowing exactly who the players are. In the end thanks to Jeeves it all turns out all right. I remember Arthur Treacher years ago when he was through acting and was an announcer for the Merv Griffin Show. I got to meet him and let us say he was Jeeves to the nines. Thank You, Jeeves is one of two films Treacher played Jeeves, but he played a lot of butlers after that. That's because he was so good at them.",
         "I must point out to you at the onset that I have NEVER seen one of Jeeves & Wooster films nor have I ever read anything by P.G. Wodehouse. So I cannot compare this film to any of the films or stories--and I have no idea how close this film is to the actual characters. But, I do have some of the Fry & Laurie versions on my Netscape queue and might just try one or two of his novels and will update this review at a later date. This B-movie reminds me a lot of the Bulldog Drummond films, though instead of making the leading man a brave and macho hero, Wooster is still brave but a bit daft. This man is no action-hero--more a man looking for excitement and blundering into it. This made for a pleasant character--but one that is hard to love. However, his manservant Jeeves was terrific and I loved the very low-key performance that Arthur Treacher gave. He was sophisticated, proper and yet, oddly, surprisingly tough. And, despite being in the employ of Wooster, it seems that Jeeves was the smarter and more competent. The film begins with the upper-class twit, Wooster, lamenting that he'd bored and craves adventure. In true movie form, a plot drops right into his lap involving a woman on the run from a gang that is trying to steal top-secret plans. Unfortunately, Wooster thinks SHE is the spy and, for a while, does his best to help the gang. Ultimately, it's up to Jeeves to save the day. Along the way, they pick up some comic relief and the total package is quite trivial--but quite fun. Thanks to a breezy script and decent acting, it's well worth seeing....and a bit silly. My score of 7 is relative to other B-films...making it a bit better than average and worth seeing.",
         "This must be, by a very large margin, one of the worst adaptations of all time of Wodehouse's immortal Jeeves and Wooster novels. It features an intelligent sex-mad Bertie, a singing, dancing, and pugilistic Jeeves, an unnecessary black saxophonist, and so on and so on. One can only hope that Wodehouse (whose name appears in very small type in the credits) simply took the money and ran. If I could give it zero out of ten (or even better, minus several hundred, I would) but as the system doesn't allow me to I give it a resentful zero. How on earth did it get to rate 6.3? The mind boggles.",
         "Arthur Treacher and David Niven were terrific in the first big-screen adaptation of P.G. Wodehouse's classic comedy series. As a lifelong Wodehouse fan, I only wish there were more Jeeves & Bertie movies with those two. (The 80s BBC series comes close.) Both were exceptionally funny, although in \"Thank You Jeeves\" Niven's talents were pretty much wasted in favor of Treacher's. By the way, check out Arthur Treacher's appearance in two 1964 episodes of \"The Beverly Hillbillies.\" He's a riot!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": ["Erudite manservant Jeeves hopes to keep his frivolous employer Bertie out of new harrowing adventures, but a damsel in distress, carrying half of some mysterious plans, intrudes on their London flat one rainy night. Bertie follows her to country hotel Mooring Manor, prepared to do slapstick battle with crooks posing as Scotland Yard men."],
      "budget": 0
   },
   "movielensId": 126243,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-06-30",
      "dvdReleaseDate": null,
      "directors": ["Arthur Greville Collins"],
      "runtime": 57,
      "movieId": 126243,
      "title": "Thank You, Jeeves!",
      "mpaa": "",
      "actors": [
         "Arthur Treacher",
         "Virginia Field",
         "David Niven",
         "Lester Matthews",
         "Colin Tapley",
         "John Graham Spacey",
         "Ernie Stanton",
         "Gene Reynolds",
         "Douglas Walton",
         "Willie Best"
      ],
      "imdbMovieId": "0028353",
      "originalTitle": "Thank You, Jeeves!",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jeeves tries to keep his young master out of trouble.",
      "tmdbMovieId": 82237,
      "avgRating": 3,
      "releaseYear": "1936",
      "numRatings": 2,
      "posterPath": "/64dsFACsJ0mpeOZcffDohZo9b35.jpg"
   }
}