{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "mutant",
            "id": 1852
         },
         {
            "name": "post-apocalyptic",
            "id": 4458
         },
         {
            "name": "sequel",
            "id": 9663
         }
      ],
      "imdb_id": "tt0100765",
      "video": false,
      "title": "The Terror Within II",
      "recommendations": [],
      "backdrop_path": "/6ulLdlfxajjXWma9S5351DsG25n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe4bfcc3a36847f821c289",
               "name": "Andrew Stevens",
               "profile_path": "/jaWFCqWahZeUimpEU2GJStm6pKI.jpg",
               "id": 21479,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kara",
               "gender": 1,
               "credit_id": "52fe4bfcc3a36847f821c28d",
               "name": "Stella Stevens",
               "profile_path": "/hsNwoHrAe6ZWaBl4f62YiP2iJqo.jpg",
               "id": 7631,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kyle",
               "gender": 2,
               "credit_id": "52fe4bfcc3a36847f821c291",
               "name": "Chick Vennera",
               "profile_path": null,
               "id": 99815,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Von Demming",
               "gender": 2,
               "credit_id": "52fe4bfdc3a36847f821c295",
               "name": "R. Lee Ermey",
               "profile_path": "/r8GBqFBjypLUP9VVqDqfZ7wYbSs.jpg",
               "id": 8655,
               "order": 3
            },
            {
               "cast_id": 25,
               "character": "Dewitt",
               "gender": 2,
               "credit_id": "59f52a8992514141ed00232a",
               "name": "Burton Gilliam",
               "profile_path": "/vy97LXXW4hRjwJa4h9IbTBwuGN5.jpg",
               "id": 133952,
               "order": 4
            },
            {
               "cast_id": 26,
               "character": "Ariel",
               "gender": 1,
               "credit_id": "59f52a959251414d570215d6",
               "name": "Clare Hoak",
               "profile_path": null,
               "id": 106470,
               "order": 5
            },
            {
               "cast_id": 27,
               "character": "Jamie",
               "gender": 2,
               "credit_id": "59f52aa79251414282002126",
               "name": "Larry Gilman",
               "profile_path": null,
               "id": 12980,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Sharon (as Barbara A. Woods)",
               "gender": 1,
               "credit_id": "52fe4bfdc3a36847f821c299",
               "name": "Barbara Alyn Woods",
               "profile_path": "/5vj7zNu93sgshvy8iLK0V1SR32r.jpg",
               "id": 44033,
               "order": 7
            },
            {
               "cast_id": 6,
               "character": "Robin (as Rene Jones)",
               "gender": 1,
               "credit_id": "52fe4bfdc3a36847f821c29d",
               "name": "Renée Jones",
               "profile_path": null,
               "id": 64201,
               "order": 8
            },
            {
               "cast_id": 28,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "59f52b07c3a3682fd500226c",
               "name": "Lou Beatty Jr.",
               "profile_path": "/vgw7D3yM7ki7Y6TOFNZRqi96E08.jpg",
               "id": 168924,
               "order": 9
            },
            {
               "cast_id": 7,
               "character": "Aaron",
               "gender": 2,
               "credit_id": "52fe4bfdc3a36847f821c2a1",
               "name": "Gordon Currie",
               "profile_path": "/h06Vpwv0XHCogV4xULwNBVXN6dI.jpg",
               "id": 51539,
               "order": 10
            },
            {
               "cast_id": 8,
               "character": "Bo",
               "gender": 2,
               "credit_id": "52fe4bfdc3a36847f821c2a5",
               "name": "Brad Blaisdell",
               "profile_path": null,
               "id": 102906,
               "order": 11
            },
            {
               "cast_id": 29,
               "character": "Lusus",
               "gender": 0,
               "credit_id": "59f52b33c3a3682fd50022d5",
               "name": "Brewster Gould",
               "profile_path": null,
               "id": 105205,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bfdc3a36847f821c2ab",
               "name": "Andrew Stevens",
               "profile_path": "/jaWFCqWahZeUimpEU2GJStm6pKI.jpg",
               "id": 21479,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bfdc3a36847f821c2b1",
               "name": "Andrew Stevens",
               "profile_path": "/jaWFCqWahZeUimpEU2GJStm6pKI.jpg",
               "id": 21479,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bfdc3a36847f821c2b7",
               "name": "Thomas McKelvey Cleaver",
               "profile_path": null,
               "id": 103581,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54e5ad34c3a36816f3001324",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54e5ad46c3a3682af60017ed",
               "name": "Jonathan Winfrey",
               "profile_path": null,
               "id": 102688,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "54e5ad54c3a368166800154d",
               "name": "Terry Plumeri",
               "profile_path": null,
               "id": 930717,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "54e5ad649251415122001310",
               "name": "Janusz Kamiński",
               "profile_path": "/5LNGARjEfMDOcEP6fMNtJypAGYx.jpg",
               "id": 492,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "54e5ad7392514109f9001965",
               "name": "Brent A. Schoenfeld",
               "profile_path": null,
               "id": 64038,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54e5ad8492514109f9001969",
               "name": "Johan le Tenoux",
               "profile_path": null,
               "id": 1428829,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "54e5adc89251410a01001837",
               "name": "Cherie Day Ledwith",
               "profile_path": null,
               "id": 136009,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "54e5addcc3a36816cb001294",
               "name": "Greg LaVoi",
               "profile_path": null,
               "id": 1303225,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "54e5adf2c3a368188d0014b9",
               "name": "Patrick J. Statham",
               "profile_path": null,
               "id": 1341763,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "54e5ae16c3a3682b02001650",
               "name": "Dan Kneece",
               "profile_path": null,
               "id": 1420160,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 2,
               "credit_id": "54e5ae6092514109fc001803",
               "name": "Mato",
               "profile_path": null,
               "id": 1428834,
               "department": "Editing",
               "job": "Color Timer"
            },
            {
               "gender": 2,
               "credit_id": "565ae0a5c3a368507d001a83",
               "name": "Mike Elliott",
               "profile_path": null,
               "id": 37021,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.383618,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 119353,
      "vote_count": 3,
      "budget": 0,
      "overview": "In a world gone mad, the last human colony struggles to survive underground, beneath a land of nightmarish mutants who seek to destroy them. But when the mutant breaks inside humanity's final stronghold, the battle for survival pits the human colonists against their deadly invaders miles below the earth's surface.",
      "similar": [
         7191,
         124905,
         841,
         12244,
         1576,
         9659,
         110415,
         49049,
         198663,
         119450,
         861,
         5876,
         6479,
         68726,
         76341,
         20504,
         131631,
         263115,
         8810,
         534
      ],
      "original_title": "The Terror Within II",
      "runtime": null,
      "poster_path": "/L2du6pxDgxPpxPqaISiRBDPJnz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Concorde Pictures",
         "id": 4527,
         "origin_country": ""
      }],
      "release_date": "1991-01-18",
      "vote_average": 2.7,
      "belongs_to_collection": null,
      "tagline": "Out there lurked danger ... but the real terror came from within.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Stevens"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Thomas McKelvey Cleaver",
         "Andrew Stevens"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100765/",
      "coverLink": null,
      "actors": [
         "Andrew Stevens",
         "Stella Stevens",
         "Chick Vennera"
      ],
      "reviews": [
         "Picking up from where the original left off (and it does go on to clear up loose ends) we see Andrew Steven's character David wandering through the desert heading for another underground scientific base that his team was originally in contact with in the first film. On the way there, he also picks up a lady survivor where they would become more than acquaintances with her soon expecting. Those survivors at the base are waiting on David, who holds a vaccine for the spreading virus, but what awaits them when David and the girl get there is hideous mutations. Roger Corman would also produce the sequel (that looks just as cheap) that came two years later with star Andrew Steven (who here had me thinking of him as a poor man's Kurt Russell) not only acting, but directing and also penning the material in another quite low-budgeted, muggy B-grade offering. Tick off; Mushy make-up effects, lousy props, a tad of nudity, clunky dialogues, junky set designs and gratuitously raw violence. At times it reminded me of the Corman produced alien clone --- \"Forbidden World\". Surprisingly I see this film cop a lot criticism when compared to the first, as I don't see it to be any worse. Sure I wouldn't call it a perfect movie, but in certain regards I enjoyed this follow-up more than the original film. On this occasion it tries to be slightly different in its ideas and execution, but still sharing similarities but consisting of more excitement. It does go on to rehash certain moments in the latter stages. However there seems to be a little more happening story wise (when focusing on Steven's character in the desert or that of a mutating finger from a gargoyle) and its quick tempo makes sure it doesn't wear out its welcome. Steven's practical handling startlingly generates energy and a bit of tension amongst the monster gruel. He's not as confined, but goes for more expansion despite the obvious limitations but these murky visuals/lighting makes for some much needed atmospherics. The cast are all committed with ever reliable R Lee Emery's commanding presence heading the way. Andrew Stevens (sporting a fashionable beard) is sturdy enough in the heroine role, Burton Gilliam is particularly amusing, Chick Vennera is fitting and Stella Stevens (yes that's Andrew's mother) is agreeably good too. What's this type of film without beautiful ladies; in the shape of knockouts Barbara Alyn Woods, Renée Jones and Clare Hoak.",
         "THE TERROR WITHIN survivor David (Andrew Stevens) travels the post- epidemic wasteland with his dog Butch (Butch Stevens, no, really!) trying to get to an underground facility filled with more scientists in Denver. This proves treacherous thanks to the genetically abnormal Lucius creatures roaming the hills. THE TERROR WITHIN was a decent little late 80s Concorde flick and producer Roger Corman wisely let star Stevens make his writing-directing debut here. How good is Stevens? He brings back his freakin' dog while part one's female survivor is toast and written off in a line of dialog (\"She died in the desert\"). Even though this is essentially a remake of the first film, Stevens shows he is adept at handling the action and nudity (something that would come in handy in his T&A thriller work a few years later). He even gets his mom Stella in there alongside fine supporting work from R. Lee Ermey, Chick Vennera and Burton Gilliam. The effects are appropriately gooey and there is a really bizarre monster rape scene (initiated by Cyndi James Gossett, spouse of Louis at the time). Stevens brought Butch back in NIGHT EYES II the following year.",
         "The Terror Within II (1991) ** (out of 4) Andrew Stevens co-wrote, directed and stars as David in this sequel to the 1989 cult film. This time out, there aren't too many humans who survived a nuclear fallout, which resulted in a number of mutants running the land. David meets up with a woman and soon team up with a colony to try and defeat the mutants once and for all. THE TERROR WITHIN was one of the better low-budget ALIEN clones as it featured a terrific monster, a nice cast and some great gore effects. This sequel was obviously working with an even smaller budget but if you're a fan of this type of post apocalyptic film then there's plenty to enjoy here. There's no question that it falls well short of the original movie but there's still enough \"B\" movie fun here to make it worth watching. I've always been a fan of Stevens so it was fun getting to see him play the tough action hero. When we first meet his character he's walking around with a full beard and playing with his lovable dog. From here he is given a love interest and it's pretty much all war from here. Stevens was certainly a lot of fun in the lead role but we also got nice support from the likes of R. Lee Ermey, Chick Vennera, Stella Stevens and Clare Hoak. Granted, these aren't Oscar-worthy performances but that's not what this film called for. The action scenes are well-directed for the most part and Stevens manages to keep the film moving at a nice pace. Add in a little bit of nudity, some sex scenes and you've got the type of R-rated movie people would have wanted to rent back in the day. The creature effects aren't nearly as effective as the first movie but I did like the look of them here. There's also some nice blood and guts scattered throughout the film. With all of that said, THE TERROR WITHIN II features a pretty basic and unoriginal story and there's certainly not enough tension to make it a complete success but it's an entertaining B movie.",
         "this film is not as good as the first but hey it still somehow works although the speed is slow and the makeup is laughable but still it is ok to watch on a boring sunday afternoon but it will not give you the Alien feel of the first one.",
         "Granted that I haven't watched the first \"The Terror Within\" movie, or at least don't have any recollection of watching it, should I have watched it during my teenage years. But regardless, I was intrigued by the synopsis of the movie, and decided to take a chance on it despite it being from 1991. I should have gone with my gut instinct and stayed clear of this one. I managed to endure 35 minutes of this movie, before I gave up out of complete and utter boredom and a lack of interest in anything that happened on the screen. This was low budget in every sense of the meaning low budget. The creature design was just abysmal, and most of the time you didn't see anything more than a poorly constructed oversized hand made out of questionable material. And the guns that people fired had no fire spray at the muzzle, and didn't even leave holes in walls when being shot through thin sheets of plastic. It was just atrocious to bear witness to. The cast in \"The Terror Within II\" was relatively unknown to me, aside from R. Lee Ermey. Now that really puzzled me. How did they actually get him to participate in a movie such as this? From what I managed to witness during my 35 minutes of watching this ordeal of a movie, I suppose the storyline was about mankind struggling to survive in a harsh and barren world overrun with mutants. Now, it was that same synopsis that had me lured in, because it sounded very much like something akin to the Fallout games. It might have been so in theory, but turned out to be a much less effective thing on the screen. I have no intention of returning to finish watching this movie, and I also have no intention of going to sit down to watch the first movie. It just doesn't seem to be worth the time nor the effort.",
         "Wow! The second one is just as stinky as the first entry. I really hope we don't see a third part. I caught this one on late night cable. I didn't really want to watch, but I didn't feel like watching infomercials about back hair removal. Although it may have been more appealing in the long run. Man it's sad that film had to be wasted twice on the Terror Within and Terror Within 2. Our government wants to root out evil, HEY, how about going after these film makers next!! Wake up and smell the coffee. These films SUCK BAD!! The acting, if you can call it that, is really horrible. Matter of fact it's scarier than the stupid mutant. I know people who make movies say that those who can't do, become critics...I know first hand. I made my own rotten horror film in the 1980's. It sucked as well. But not as bad as this!! Be smart. Pass this crap up! I would give it a big fat ZERO!! But 1 was the lowest. So a 1 it is!"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Concorde Pictures"],
      "summaries": [
         "In a world gone mad, the last human colony struggles to survive underground, beneath a land of nightmarish mutants who seek to destroy them. But when the mutant breaks inside humanity's final stronghold, the battle for survival pits the human colonists against their deadly invaders a few miles below the Earth's surface.",
         "In a post-apocalyptic world full of terrifying mutants known as gargoyles, survivors of the last human colony battles against intruding gargoyles a few miles below the Earth's surface."
      ],
      "budget": 0
   },
   "movielensId": 126341,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-01-18",
      "dvdReleaseDate": null,
      "directors": ["Andrew Stevens"],
      "runtime": 0,
      "movieId": 126341,
      "title": "The Terror Within II",
      "mpaa": "",
      "actors": [
         "Andrew Stevens",
         "Stella Stevens",
         "Chick Vennera",
         "R. Lee Ermey",
         "Burton Gilliam",
         "Clare Hoak",
         "Larry Gilman",
         "Barbara Alyn Woods",
         "Renée Jones",
         "Lou Beatty Jr.",
         "Gordon Currie",
         "Brad Blaisdell",
         "Brewster Gould"
      ],
      "imdbMovieId": "0100765",
      "originalTitle": "The Terror Within II",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a world gone mad, the last human colony struggles to survive underground, beneath a land of nightmarish mutants who seek to destroy them. But when the mutant breaks inside humanity's final stronghold, the battle for survival pits the human colonists against their deadly invaders miles below the earth's surface.",
      "tmdbMovieId": 119353,
      "avgRating": 0,
      "releaseYear": "1991",
      "numRatings": 0,
      "posterPath": "/L2du6pxDgxPpxPqaISiRBDPJnz.jpg"
   }
}