{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0080776",
      "video": false,
      "title": "Garlic Is as Good as Ten Mothers",
      "recommendations": [
         85637,
         85635,
         125358,
         132150,
         126597,
         18954,
         19013,
         128442,
         27506,
         68440,
         49836,
         41480,
         18950,
         48708,
         46126,
         27505,
         19011,
         74469,
         92990,
         18953
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 2,
            "character": "",
            "gender": 2,
            "credit_id": "560000d4c3a3681337005514",
            "name": "Werner Herzog",
            "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
            "id": 6818,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe49519251416c910a978f",
            "name": "Les Blank",
            "profile_path": "/44VL7nyzDMTuqZztDf6KBsutqBu.jpg",
            "id": 142594,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.040173,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85642,
      "vote_count": 10,
      "budget": 0,
      "overview": "A zesty paean of praise to the greater glories of garlic. This lip-smacking foray into the history, consumption, cultivation and culinary/curative powers of the stinking rose features chef Alice Waters of Chez Panisse, and a flavorful musical soundtrack.",
      "similar": [],
      "original_title": "Garlic Is as Good as Ten Mothers",
      "runtime": 51,
      "poster_path": "/wP8s5lA0LdEVXIlM2SiXMBzqFBS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Flower Films",
         "id": 2214,
         "origin_country": ""
      }],
      "release_date": "1980-10-12",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Les Blank"],
      "runtime": 51,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080776/",
      "coverLink": null,
      "actors": ["Stars: Antzonini Del Puerto, Kathleen Bendel, Harrod Blank | See full cast and crew »"],
      "reviews": [
         "This is a very good movie about garlic with shots from the Gilroy Garlic Festival and lots of good information about cooking with garlic from some of the best cooks in the SF Bay Area. I view this as a comprehensive guide to garlic provided in a very entertaining fashion. Wish I could find it on DVD!! Information by folks like Alice Water of Chez Panisse in Berkeley showing how to use garlic for cooking a nice pig dish are amazing and make you want to sit down and eat it right there. Other information on uses of garlic that you would never think of such as real garlic salt, for squid recipes, sausages and of course warding off vampires. There are ways to handle garlic for cooking and how to peel it easily as well as how to chop, mince etc for best effect. Highly recommended.",
         "Les Blank has a rarity here that might have one of the best titles I've ever heard, or at least the most original. Garlic is as Good as Ten Mothers is a 50 minute excursion into the world of those who love, cherish, sing, cook, grow and pick and know a good deal about that most polarizing of seasonings and produce. As someone observes, making a dish that has a plentiful portion of garlic will bring out a reaction, and be it good or bad is what making something worthwhile is all about. In that sense garlic is its own cult, but one that already has a strong base of fans in Europe, slowly growing in America (this is 1980 of course, if these figures have changes in 28 years I can't say). What Les Blank gets on film is compelling and fun because he presents people who are passionate, and his camera probes in extreme, artistic close-ups into the preparations of unusual culinary feats, sometimes involving pigs and chickens, other times with dishes that look close to brains or vomit. Yum! Like his Burden of Dreams, Blank has a knack at getting into the little things in a subject and making them paramount (where he found interesting insects and things in the making of Fitzcarraldo, here he has a fascinating at times with musical instruments that are played at garlic festivals). Granted, there is an occasional obnoxious voice-over which explains some of the history of garlic, including its origins and how widespread it is in America (2nd only to black pepper). But it's enlightening to see so much of this, like a cooking show that's given a slightly skewed perspective, loaded with folk songs dedicated to garlic, interviewees like Herzog himself, crumbs and specs and things that fall like they're meant as snowflakes through the compositions. It's oddball and and always loving, including a cool finishing touch of how garlic is farmed and packaged. If you love garlic, or just like some of Blank's films, it's worth checking out.",
         "Les Blank died recently, and so I decided that I'd watch his documentaries. The first one that I've ever watched is \"Garlic Is As Good As Ten Mothers\", which focuses entirely on Allium sativum. Blank interviews people about garlic and looks at its history. There's even a part about garlic's role in Cajun food, complete with a zydeco band! It's hard to believe that the Anglo Puritan types actually suppressed garlic, but's what happened in US history. Fortunately we in the 21st century love the stuff (I sure can't get enough of it). I now hope to see more of Blank's documentaries, and of course I'll never stop eating garlic. It's delicious AND nutritious! And above all, I recommend this documentary.",
         "I saw this film in Seattle when it came out in 1981. A mindless, brain numbing waste of time. I recall one scene: pleasant close up of several piglets playing with each other, then WHAM! the same pigs slaughtered, and (you guessed it) baked or fried in garlic. DUMB and CRUEL. The bulk of the movie is pseudo science, and would be appropriate for a garlic peddler's convention. If you don't want to bother with thinking, or care about scientific research, and want to spout useless drivel, then this is the film for you. It belongs down the garbage disposal! I never liked the way garlic made people smell anyway. Don't waste your time on this loser.",
         "This movie was terrible. It had little useful information about garlic. For the majority of the film, it was just pointless interviews with random garlic-obsessed freaks. I mean, how are you supposed to take a guy seriously when he's wearing a hat shaped like a giant clove of garlic? And the idea of \"pet garlic\" (a plastic clove of garlic on the end of a stiff leash) proves that some people see very little of life. Not even the editing was done well. I had such a hard time trying to read the names of the interviewees printed on the screen. White text on a white background? If you want information on garlic, read an encyclopedia. If you are a garlic loving lunatic, check out this film. 0.5/4 stars"
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Flower Films"],
      "summaries": [
         "Often referred to as a stinking rose, garlic, in its culinary uses, generally evokes a love it or hate it response. Quite often, these responses are on cultural lines, where old world cultures have generally revered it in their cooking, while new world cultures have not. A renaissance of sorts is taking place in the use of garlic in the United States, with more and more immigrants bringing their use of the spice to the country, with more people desiring more spice in their food, with a desire to get back to the land and with the production of plant a large part of the Central California landscape. Many chefs are presented preparing dishes prominently featuring the spice. On the bad side, the association of garlic to bad breath is discussed. On the other side, its purported health benefits are also discussed. Other topics presented include its association to vampirism, and speculation of how people will want their garlic to be presented to them in the future.",
         "A documentary on the history of garlic. Blank interviews chefs, garlic lovers, and historians about the their love of the 'stinking rose.'"
      ],
      "budget": 0
   },
   "movielensId": 126935,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-10-12",
      "dvdReleaseDate": null,
      "directors": ["Les Blank"],
      "runtime": 51,
      "movieId": 126935,
      "title": "Garlic Is as Good as Ten Mothers",
      "mpaa": "PG",
      "actors": ["Werner Herzog"],
      "imdbMovieId": "0080776",
      "originalTitle": "Garlic Is as Good as Ten Mothers",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["0Tl-tjjYL4M"],
      "plotSummary": "A zesty paean of praise to the greater glories of garlic. This lip-smacking foray into the history, consumption, cultivation and culinary/curative powers of the stinking rose features chef Alice Waters of Chez Panisse, and a flavorful musical soundtrack.",
      "tmdbMovieId": 85642,
      "avgRating": 3.57143,
      "releaseYear": "1980",
      "numRatings": 7,
      "posterPath": "/wP8s5lA0LdEVXIlM2SiXMBzqFBS.jpg"
   }
}