{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "in love with enemy",
            "id": 930
         },
         {
            "name": "undercover",
            "id": 1568
         },
         {
            "name": "burglary",
            "id": 11728
         },
         {
            "name": "falling in love",
            "id": 13072
         },
         {
            "name": "police officer",
            "id": 15090
         }
      ],
      "imdb_id": "tt0139429",
      "video": false,
      "title": "Long Hello and Short Goodbye",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Melody",
               "gender": 1,
               "credit_id": "52fe44fe9251416c75047fdb",
               "name": "Nicolette Krebitz",
               "profile_path": "/o9zxIN19qbWyfscH9C2PJlow50L.jpg",
               "id": 33040,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe44fe9251416c75047fdf",
               "name": "Marc Hosemann",
               "profile_path": "/wlSoTU9tbv2Gyl8rzz3WPDwJt3T.jpg",
               "id": 5600,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Aurelia",
               "gender": 1,
               "credit_id": "52fe44fe9251416c75047fe3",
               "name": "Sunnyi Melles",
               "profile_path": "/alnr6zuJ3dI5EEFBy6INVP3afjF.jpg",
               "id": 37411,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Percy",
               "gender": 2,
               "credit_id": "52fe44fe9251416c75047fe7",
               "name": "Axel Milberg",
               "profile_path": "/p4s6tXvvgAhUa7bgSdUeluvci1L.jpg",
               "id": 36010,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Rezeptionist",
               "gender": 2,
               "credit_id": "53f0a94f0e0a2675af0035bd",
               "name": "Michael Benthin",
               "profile_path": "/4FJuEP9aiDan10AvjHZ9CC7ykd7.jpg",
               "id": 5761,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Kahnitz",
               "gender": 0,
               "credit_id": "53f0a9730e0a2675b800360d",
               "name": "Dietrich Hollinderbäumer",
               "profile_path": "/v39OkrrGnhDpzQ2TlOmWjzAtJi7.jpg",
               "id": 38608,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Ida",
               "gender": 1,
               "credit_id": "53f0a9840e0a2675af0035c2",
               "name": "Katja Riemann",
               "profile_path": "/sPvCj1IxlhjI61BVlIuwsXuXEl7.jpg",
               "id": 1874,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Therapeutin",
               "gender": 1,
               "credit_id": "53f0a9970e0a2675b2003659",
               "name": "Hannelore Hoger",
               "profile_path": "/lTszWDQMCnx37DfJwOJcUOAc44E.jpg",
               "id": 39303,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Arzt",
               "gender": 2,
               "credit_id": "53f0a9aa0e0a2675bf00355e",
               "name": "Stefan Kurt",
               "profile_path": "/tfV8ddyjvAVfSz6BG9SdGFbrAAq.jpg",
               "id": 34383,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Verkäufer",
               "gender": 2,
               "credit_id": "53f0a9bb0e0a2675ac003468",
               "name": "Gustav-Peter Wöhler",
               "profile_path": "/taGjNdze4T89L4mmlowmG9xqVbS.jpg",
               "id": 36688,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Sachbearbeiterin",
               "gender": 0,
               "credit_id": "53f0a9e90e0a2675b500348e",
               "name": "Eva Kryll",
               "profile_path": null,
               "id": 53028,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Dealer",
               "gender": 2,
               "credit_id": "571e7c879251416f280008de",
               "name": "Albert Kitzl",
               "profile_path": "/crFJXqlMqTczcQYrG7mnB4IcnmV.jpg",
               "id": 18491,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44fe9251416c75047fed",
               "name": "Rainer Kaufmann",
               "profile_path": null,
               "id": 49625,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fe9251416c75047ff3",
               "name": "Jeff Vintar",
               "profile_path": null,
               "id": 21086,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fe9251416c75047ff9",
               "name": "Martin Rauhaus",
               "profile_path": null,
               "id": 48684,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fe9251416c75047fff",
               "name": "Andre Fahning",
               "profile_path": null,
               "id": 72886,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44fe9251416c75048005",
               "name": "Henrik Meyer",
               "profile_path": null,
               "id": 49043,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fe9251416c7504800b",
               "name": "Klaus Eichhammer",
               "profile_path": null,
               "id": 36597,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44fe9251416c75048011",
               "name": "Ueli Christen",
               "profile_path": null,
               "id": 1871,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.001651,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 12575,
      "vote_count": 0,
      "budget": 0,
      "overview": "No overview found.",
      "similar": [
         257088,
         1089,
         10775,
         96,
         968,
         1422,
         754,
         1572,
         136400,
         341013,
         323675,
         90,
         11062,
         11565,
         663,
         5549,
         4349,
         11647,
         23742,
         36669
      ],
      "original_title": "Long Hello and Short Goodbye",
      "runtime": 95,
      "poster_path": "/yxxWnjdC4M172fgbC6R36JaQ1uh.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Studio Hamburg Letterbox Filmproduktion",
         "id": 2538,
         "origin_country": ""
      }],
      "release_date": "1999-07-15",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rainer Kaufmann"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Jeff Vintar",
         "Martin Rauhaus"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0139429/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NjQzNDYwNF5BMl5BanBnXkFtZTcwNDc2NDMyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Nicolette Krebitz, Marc Hosemann, Sunnyi Melles | See full cast and crew »"],
      "reviews": [
         "I have rarely seen a film that was so rewarding in many ways, yet so disappointing in many others. It still is worth looking at. Here is what I liked: The plot is quite original and full of surprising twists and turns, crossing and double-crossing. The pace of the whole film is excellent, like you're watching a John Carpenter movie (one of his earlier works, that is...). The finale is a masterpiece. Great camera work, great editing. Lots of images you won't forget. Superb performances by all the supporting actors and actresses. One of the best main title sequences I've ever seen. Great score. And here is what I hated: Krebitz is totally miscast as an undercover police officer. You can not believe anything she does or says. The costumes for Krebitz are ridiculous, making her look more like modeling for sexy beach wear. She's always nice to look at, though, but it does not help to make her character believable. There's absolutely no chemistry between Hosemann and Krebitz, no sparkles. There are quite a few giant plot holes, badly covered. Most of the dialogue is so badly written that it hurts your ears. All in all, a movie both to love and hate...",
         "During my last trip to Germany I had the pleasure of finally seeing this film, after having been a fan of the American script for years. Okay, they wimped out and simplified the structure. And what the heck is that sado-masochistic relationship between the detective and the hit woman all about?! But it was still a kick to see this very odd German version of \"Long Hello.\" Lots of flashy visuals, good sack scenes between the leads, plenty of twists, and that great conclusion. Some striking images you probably won't forget. Can't wait for the English-language film--what the heck is taking so long?! But this one is sure worth a look while we wait for the Hollywood version to film from the original script, they say, finally, this year?! Let's hope so! And I got to add, love the title.",
         "Can anyone tell me what happens in the end...I didn't really get it... Do Ben and Melody die?Cos they can't really go to a hospital cos they would have to tell the doctors or someone what happened...I always get annoyed when I don't know what'll happen....!!! I found the film very good though...very good actors/actresses...But I didn't get that bondage thing going on between Melody's boss and that woman...?! Well anyway...I liked the love-story between Ben and Melody...it was very sweet... So please can someone answer my question above and tell me what they think happened to them both...I should really stop taking films so serious... Thanks for reading my comment...!",
         "Excuse my English but this is a great German film called \"Long Hello and Short Goodbye\" by Rainer Kaufmann who also directed \"The Pharmacist.\" This film is made very beautiful and thrilling to see, with exciting performances from the gorgeous Nicolette Krebitz. There are twists and turns, laughs, and a great shoot-out at the end. What I like too is that it says something about the human condition but says so in this telling of a modern film noir. If you like \"Bonnie and Clyde\" and \"Pulp Fiction\" this is the way that I can think only to describe what Rainer Kaufmann has done here. I will give this film five stars for the twists and turns of the plot, three stars for humor and sexiness of the bed scenes, four stars for mood and tension and pacing, five stars for the look and beauty. All in all I say it gets a 4.5/5.0...and so Dietrich says to see it now!",
         "This film is from my country, Germany, and is pure entertainment for people who like film noir mazes, with shifting plots and a grin on its face. My favorite from recent memory, along with Run Lola Run, this one also says something substantial about human values, wrapped up in the smooth film-making of Rainer Kaufman. The game and the style are much fun, but it also has a great love story. The last image of the film of the two [doomed?] lovers is a classic. Watch this film for me!",
         "A friend of mine gave me this movie because I was always a big fan of the American script, which I first read about eight years ago, one of those scripts that keeps getting close to production, with a thousand lives. This version of the story, filmed in Germany, simplifies the structure of the original piece, and in the process actually weakens the characterization--and muddles the whole point. I mean, the script was a structural tour-de-force! Why did the German film-makers simplify it? Cold feet, I understand. But what is left is still an edgy neo-noir that polorized German audiences into \"love it\" or \"hate it\" camps. The director uses a huge arsenal of visual gimmicks including shifting depth-of-field within a shot, and the end result is cool, sexy film-making. Nicolette Krebitz rules the screen, Dietrich Hollinderbaumer oozes menace, and Sunnyi Melles and Axel Milberg steal the film in their funny supporting roles as a couple of con men. The conclusion was filmed exactly as originally written, as far as I can remember, and is really fantastic. All in all, it was a surprise and a pleasure to come across this movie, although I still have my fingers crossed for the American version some day.",
         "A friend of mine gave me this movie because I was always a big fan of the American script, which I first read about eight years ago, one of those scripts that keeps getting close to production, with a thousand lives. This version of the story, filmed in Germany, simplifies the structure of the original piece, and in the process actually weakens the characterization--and muddles the whole point. I mean, the script was a structural tour-de-force! Why did the German film-makers simplify it? Cold feet, I understand. But what is left is still an edgy neo-noir that polarized German audiences into \"love it\" or \"hate it\" camps. The director uses a huge arsenal of visual gimmicks including shifting depth-of-field within a shot, and the end result is cool, sexy film-making. Nicolette Krebitz rules the screen, Dietrich Hollinderbaumer oozes menace, and Sunnyi Melles and Axel Milberg steal the film in their funny supporting roles as a couple of con men. Katja Riemann shows up in an extended cameo as a hit woman. The conclusion was filmed exactly as originally written, as far as I can remember, and is really fantastic. All in all, it was a surprise and a pleasure to come across this movie, although I still have my fingers crossed for the American version some day.",
         "Interesting film that I think will stand the test of time, or at least be more appreciated as the years pass than it was on its initial release. Lots of flashy camera tricks to go along with the plot twists and killer conclusion. I just looked up the American version someone else mentioned and found out that Hilary Swank [Oscar-winner for \"Boys Don't Cry\"] is going to star. Wow! That should be something. But this film is well worth your time. Rainer Kaufmann is called the \"German Brian DePalma.\" Now you can see why."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Studio Hamburg Letterbox Filmproduktion",
         "Warner Bros."
      ],
      "summaries": ["When Ben is released from prison, undercover police agent Melody picks him up at the gate. Kahnitz, her sinister and ambitious boss, wants to see Ben convicted of another crime as soon as possible. Since Ben seems to show only mild interest both in Melody and in safe-busting she has to come up with a plan. Alas, the talkative cop has developed quite a liking for the taciturn gangster."],
      "budget": 0
   },
   "movielensId": 126925,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1999-07-15",
      "dvdReleaseDate": null,
      "directors": ["Rainer Kaufmann"],
      "runtime": 95,
      "movieId": 126925,
      "title": "Long Hello and Short Goodbye",
      "mpaa": "",
      "actors": [
         "Nicolette Krebitz",
         "Marc Hosemann",
         "Sunnyi Melles",
         "Axel Milberg",
         "Michael Benthin",
         "Dietrich Hollinderbäumer",
         "Katja Riemann",
         "Hannelore Hoger",
         "Stefan Kurt",
         "Gustav-Peter Wöhler",
         "Eva Kryll",
         "Albert Kitzl"
      ],
      "imdbMovieId": "0139429",
      "originalTitle": "Long Hello and Short Goodbye",
      "genres": [
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "No overview found.",
      "tmdbMovieId": 12575,
      "avgRating": 3,
      "releaseYear": "1999",
      "numRatings": 1,
      "posterPath": "/yxxWnjdC4M172fgbC6R36JaQ1uh.jpg"
   }
}