{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "nature",
            "id": 18330
         },
         {
            "name": "landscape",
            "id": 175985
         },
         {
            "name": "nature documentary",
            "id": 221355
         }
      ],
      "imdb_id": "tt2317089",
      "video": false,
      "title": "small roads",
      "recommendations": [],
      "backdrop_path": "/p94PfQYtdYaoXKrdLd7r7N597p.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4c23c3a368484e1a9539",
            "name": "James Benning",
            "profile_path": "/zmBy4E6njaoj1z8ZWTj11i8t1Q2.jpg",
            "id": 1012088,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.221411,
      "production_countries": [],
      "id": 137008,
      "vote_count": 3,
      "budget": 0,
      "overview": "Lengthy static shots of various backroads, smaller interstates, quieter roads, and lonely highways.",
      "similar": [
         2698,
         10527,
         568,
         597,
         2268,
         37724,
         7518,
         11886,
         13053,
         105864,
         54138,
         46195,
         52520,
         158852,
         140607,
         157336,
         56292,
         155,
         68726,
         75612
      ],
      "original_title": "small roads",
      "runtime": 103,
      "poster_path": null,
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [],
      "release_date": "2011-09-03",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Benning"],
      "runtime": 103,
      "synopsis": null,
      "writers": [],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt2317089/",
      "coverLink": null,
      "actors": [],
      "reviews": ["James Bennings' small roads opens with a title card bearing its name, \"small roads,\" in lowercase letters, and will be the only title card we see until the film's conclusion when the film states its director, also in lowercase letters, \"james benning.\" The film is eighty-six minutes of peacefulness and, if anything, an encouragement to explore the beautifully simplistic Midwestern countryside. It consists of lengthy static shots of various backroads, smaller interstates, quieter roads, and lonely highways, all shot with the crispness of an HD camera and an appreciation for contemporary landscapes. To some, small roads will play like a sanity test; \"how long must I stare at the same godforsaken road?\" some may ask. I'll be honest and admit I thought that at some points during the film, for its absence of dialog and apparent lack of themes seemed to take a toll on me. But the more I watched it, the more I found the film putting me at a rare and comfortable ease. The kind of ease one experiences when sitting in complete utter silence, or when perhaps when one meditates and makes an attempt to allow their worries to flourish out of them. In that case, small roads provided me with one of the most meditative experiences I've ever had with a film. This is because of how Benning approaches the many \"small roads\" we see in the film. He lets the scenic qualities and the landscapes do the talking, as he simply sits back and films the scenery as it is. This may be the one of the only times on film where locational photography is scouted but it is not burdened with the manipulative qualities of excessive lighting, extensive use of actors, equipment, etc (the only other example I can think of is your average Frederick Wiseman film). With this kind of film - one that waits for something to happen rather than tries to make something happen - your fondness sort of shifts from what you see to what you hope to or may see along the way. For example, every so often, while Benning is filming these \"small roads,\" a car, truck, or eighteen-wheeler will come hauling down the road, interrupting the quietness and stillness of the shot. Benning, who can already be inferred as a fan of natural filmmaking, doesn't flinch, hesitate, adjust the camera, or even cut, but simply allows it to pass. He doesn't even have the nerve to lessen the passing vehicle's sound in post-production, resulting in an unexpectedly ear-shattering noise whenever a vehicle does move past (or maybe it's ear-shattering because we're so used to hearing the birds chipping, owls hooing, or the soft wind blowing, possibly illustrating a \"man vs. nature\" theme). Because of this, the excitement is generated because of the film's unpredictability. You don't know when something will move, a vehicle will pass, or a shot will cut. I wouldn't have it any other way. Roads are also depicted in all kinds of weather. Some are depicted under the sunniness of the current day, some are shown with clearly overcast skies above, some buried in fog, some affected by rain, snow, sleet, mud, and some just remain captured under partly cloudy skies and thoroughly pleasant conditions. This kind of variety heightens the unpredictability-aspect of the film because, since Benning doesn't seem to be illustrating any particular kind of weather-continuity or story with his depiction of weather, there's a nice feeling of not knowing where the next shot will take you. Ultimately, the person who benefited the most from this film is James Benning. No matter where you see the film, be it on DVD, online, or on an enormous theater screen with the sound quality of an IMAX showing, you will not get the experience Benning received when shooting small roads. He got to smell and breath the fresh air the landscapes offer, physically walk on the roads he filmed, and indulge in the magic and beauty of the areas he showcased in this project. Needless to say, I'm a bit envious. Benning seems to be the kind of person who appreciates long car rides through \"the middle of nowhere\" more-so than the actual destination. Of course, because no matter how hard film criticism tries it will always remain subjective, I'm speaking on my personal thoughts of small roads. Many will look away from such a film, and only a selected few will be brave enough to watch it. Half of those brave souls will probably not like it or not make it through the first half hour. The other half that makes it through, and perhaps likes it or develops an appreciation for the beautiful roads that make up America's unsung, unrefined landscapes, embody the characteristics of an optimistic and passionate cinephile, whose very curiosity will keep a long-standing medium going for hundreds of years to come. Directed by: James Benning."],
      "genres": ["Documentary"],
      "productionCompanies": ["James Benning"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 126945,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "2011-09-03",
      "dvdReleaseDate": null,
      "directors": ["James Benning"],
      "runtime": 103,
      "movieId": 126945,
      "title": "small roads",
      "mpaa": "PG",
      "actors": [""],
      "imdbMovieId": "2317089",
      "originalTitle": "small roads",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Lengthy static shots of various backroads, smaller interstates, quieter roads, and lonely highways.",
      "tmdbMovieId": 137008,
      "avgRating": 3,
      "releaseYear": "2011",
      "numRatings": 4,
      "posterPath": null
   }
}