{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2218698",
      "video": false,
      "title": "What Is This Film Called Love?",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b98c3a36847f820b3cd",
               "name": "Mark Cousins",
               "profile_path": "/t5jeJbaZkIuMP31sKzGfGK9doVN.jpg",
               "id": 1061561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b98c3a36847f820b3d3",
               "name": "Mark Cousins",
               "profile_path": "/t5jeJbaZkIuMP31sKzGfGK9doVN.jpg",
               "id": 1061561,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.025539,
      "production_countries": [],
      "id": 116649,
      "vote_count": 0,
      "budget": 0,
      "overview": "What is this film called Love? is a passionate, 77 minute poetic documentary about the nature of happiness.",
      "similar": [],
      "original_title": "What Is This Film Called Love?",
      "runtime": 77,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2012-06-26",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://whatisthisfilmcalledlove.co.uk/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Cousins"],
      "runtime": 81,
      "synopsis": null,
      "writers": ["Mark Cousins"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt2218698/",
      "coverLink": null,
      "actors": [],
      "reviews": ["What is This Film Called Love? takes the viewer on a flamboyant, colourful, iconoclastic journey of three days through Mexico City – or three days inside the head of its creator, quirkily comical film connoisseur, Mark Cousins. There's much sleight of hand, including changing gender and raising Eisenstein from the dead. But it's all done (quite remarkably, beautifully, and in near HD) on a small Flip camera costing a hundred quid. It's inventive and mesmerising, cunningly shot, heavily edited, wittily scripted and charms us into finding simple acts such as a man getting on and off a bus rather mesmerising. To achieve this, Cousins uses his well-trodden alter-ego of an adolescent on a Kerouac-style ramble. He constantly makes the ordinary sound interesting and, for at least half of the movie I held my breath to see what was going to come next. Each shot is exquisitely composed, often with rather boyish self-congratulation, such as when he compares his 'typical' camera angles with those of the great Eisenstein. But, if you have glanced through Cousins' wonderfully erudite yet readable book, The Story of Film, and hoped to gain some insights into the work of the great Sergei Eisenstein (a pioneering Russian filmmaker from about 100 years ago) you'll be disappointed. The closest we perhaps get is to view the delightful montage techniques in Cousins' film as a tribute to Eisenstein's work. But the 'influence' could be called superficial: Eisenstein used montage to make a point, whereas Cousins just wants to have fun. But when the amusingly egotistical Cousins carries a photo of Eisenstein around Mexico City talking to it, or goes running naked through the American desert, we are inclined to forgive the ladishness of such name-dropping. Eisenstein is the main other 'character,' but Cousins doesn't stop there. When he hints that his style is based on Virginia Woolf's stream-of-consciousness technique, the humour reminds me more of Sascha Baron Cohen. A bit like saying a Madras-flavour pot-noodle is based on the fine Indian cuisine. Unfortunately, we sense that beneath it all Cousins is taking himself seriously. Residents of Stuttgart might be equally unimpressed with his throwaway, factual inaccuracies about the philosopher, Hegel. It is someone who is genuinely an expert in one area (cinema) posing as an intellectual in another, and trying to brush it off with false modesty. In some ways it is still forgivable. Think of poetry, and this film resembles poetry. Think of song lyrics – that most unaccountable sort of poetry. And think of Bob Dylan who (by his own account) selected names and phrases from a prestigious shelf of books he had never read. Who cares? Highway 61 Revisited was still an inspiring set of songs, and What is This Film Called Love could be equally inspiring to the right young mindset. Jack Kerouac for the iPhone age. Except the film hasn't the depth or weight of Kerouc. The wittering about ecstasy has one of the most insightful moments of the film - pondering the etymology – ex stasis, hence a 'going away from' the state of standing still. Yet it feels like a Christian rock band singing of the joys of sex and drugs. There's a point where the author surely has to live the dream before inviting us in, and a bottle of Mexican beer plus a few veiled references to drugs is hardly a William Rice Burroughs friendly battle with the devil. PJ Harvey's almost funereal 'To Bring You My Love' explodes two-thirds of the way through the movie and does suggest we might get some depth or seriousness, but the promise quickly fades as it goes back to laconic meandering and sleight of hand in the dialogue (his gender change merely being one of viewpoint). What some will enjoy (and others find infuriating) is the stylishness of technique. Almost every shot is like a picture essay on how to frame or use the camera inventively. The dialogue is self-referentially Brechtian in new and exciting ways. Delivery and timing is impeccable – rather like his illustrated lecture (on Cinema and Creativity) in Edinburgh, where it turns out that the film made in Edinburgh wasn't made in Edinburgh at all. Like the pop-science writer Jonah Lehrer (who Cousins speaks of almost as if he were a guru), Cousins can be inspiring, his enthusiasm contagious; even if some of his details don't seem to stand up well to scrutiny. But if you are enjoying the ride enough, this shouldn't bother you. There were two main flaws in this movie for me. One was of my own making, that of expectation. To think that Mark Cousins, whose book I loved, would have something worth-while to say about (for instance) Eisenstein. The second is its near absence of plot. Even a semi-documentary needs some sort of point to hang it on, and this has very little – beyond being quite enjoyable while it lasts."],
      "genres": [],
      "productionCompanies": [],
      "summaries": ["WHAT IS THIS FILM CALLED LOVE? is a passionate, poetic documentary about the nature of happiness. Filmed in Mexico over three days for just £10, it begins as a film about the soviet director Sergei Eisenstein, and then, using his ideas, opens up to look at memory, landscape and the pleasures of walking. It is a personal film and aims to be very cinematic, using three visual dream sequences and the music of PJ Harvey, Simon Fisher Turner, J Espen Jorgensen and Bernard Hermann. The film draws from a range of filmmakers and writers (principally Chris Marker, but also Virginia Woolf, Frank O'Hara and others) but aims to touch on themes that are relevant to a wide range of people, like where joy comes from, the emotions involved with travel and homecoming and the nature of solitude."],
      "budget": 0
   },
   "movielensId": 127174,
   "movielens": {
      "languages": [""],
      "releaseDate": "2012-06-26",
      "dvdReleaseDate": null,
      "directors": ["Mark Cousins"],
      "runtime": 77,
      "movieId": 127174,
      "title": "What Is This Film Called Love?",
      "mpaa": null,
      "actors": [""],
      "imdbMovieId": "2218698",
      "originalTitle": "What Is This Film Called Love?",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "What is this film called Love? is a passionate, 77 minute poetic documentary about the nature of happiness.",
      "tmdbMovieId": 116649,
      "avgRating": 4.25,
      "releaseYear": "2012",
      "numRatings": 2,
      "posterPath": null
   }
}