{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0084479",
      "video": false,
      "title": "The Passerby",
      "recommendations": [
         105670,
         69978,
         111965,
         3424,
         77418,
         64968,
         17677,
         62570,
         59969,
         45694,
         80382,
         76647,
         76482,
         4195,
         55035,
         46334,
         86707,
         55370,
         8425,
         179087
      ],
      "backdrop_path": "/l7qNCUZYCrjH4yAZvxaWsNfsZBf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elsa Wiener / Lina Baumstein",
               "gender": 1,
               "credit_id": "52fe43f1c3a36847f8079a85",
               "name": "Romy Schneider",
               "profile_path": "/jBLkVHZFCsjVDJSCffq0ccL11N2.jpg",
               "id": 6250,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Max Baumstein",
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079a89",
               "name": "Michel Piccoli",
               "profile_path": "/gz91b4tVn6yYsKemek2YkUdjlSH.jpg",
               "id": 3784,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Michel Wiener",
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079a8d",
               "name": "Helmut Griem",
               "profile_path": "/n0DrvSP1u6PP92LXV6ytf0zhQGW.jpg",
               "id": 32059,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Anna Helwig",
               "gender": 1,
               "credit_id": "52fe43f1c3a36847f8079a91",
               "name": "Maria Schell",
               "profile_path": "/xACEJpmvpjVxb58wkIY3k2WXhHv.jpg",
               "id": 40954,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ruppert / Federico",
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079a95",
               "name": "Mathieu Carrière",
               "profile_path": "/bi7jNA5eVdosZYAyCqsPY3VtzDp.jpg",
               "id": 36925,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Max als Kind",
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079a99",
               "name": "Wendelin Werner",
               "profile_path": null,
               "id": 40955,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079a9f",
               "name": "Jacques Rouffio",
               "profile_path": null,
               "id": 19829,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079aa5",
               "name": "Joseph Kessel",
               "profile_path": null,
               "id": 9748,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079aab",
               "name": "Jacques Rouffio",
               "profile_path": null,
               "id": 19829,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079ab1",
               "name": "Jacques Kirsner",
               "profile_path": null,
               "id": 19833,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079ab7",
               "name": "Artur Brauner",
               "profile_path": null,
               "id": 12737,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079abd",
               "name": "Raymond Danon",
               "profile_path": null,
               "id": 32071,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079ac3",
               "name": "Jean Kerchner",
               "profile_path": null,
               "id": 41835,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079ac9",
               "name": "Georges Delerue",
               "profile_path": "/yAlgcnY7fXUQLrxfknp0Jv4dUTv.jpg",
               "id": 3535,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079acf",
               "name": "Jean Penzer",
               "profile_path": null,
               "id": 34907,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079ad5",
               "name": "Anna Ruiz",
               "profile_path": null,
               "id": 41836,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f1c3a36847f8079adb",
               "name": "Dominique Besnehard",
               "profile_path": "/5e23OLMMdVM4PSi9EPJmXcgQUYf.jpg",
               "id": 21680,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079ae1",
               "name": "Jean-Jacques Caziot",
               "profile_path": null,
               "id": 32075,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079ae7",
               "name": "Hans Jürgen Kiebach",
               "profile_path": null,
               "id": 37958,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f1c3a36847f8079aed",
               "name": "Jean-Jacques Caziot",
               "profile_path": null,
               "id": 32075,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079af3",
               "name": "Elisabeth Tavernier",
               "profile_path": null,
               "id": 20859,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe43f2c3a36847f8079af9",
               "name": "Catherine Leterrier",
               "profile_path": null,
               "id": 19058,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe43f2c3a36847f8079aff",
               "name": "Ralph Baum",
               "profile_path": null,
               "id": 41837,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43f2c3a36847f8079b05",
               "name": "William Robert Sivel",
               "profile_path": null,
               "id": 12265,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.647944,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 5063,
      "vote_count": 7,
      "budget": 0,
      "overview": "During an interview, Max Baumstein (Piccoli), respected chairman of a humanitarian organisation, shoots the Paraguayan ambassador dead, in cold blood. Tried for first-degree murder, he explains himself: the ambassador was a former Nazi official, responsible for the extermination of his family.",
      "similar": [],
      "original_title": "La passante du Sans-Souci",
      "runtime": 110,
      "poster_path": "/bmqJwC1Tq8in8w06tTOfFMwtcXr.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1982-04-14",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jacques Rouffio"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Jacques Rouffio",
         "Jacques Kirsner"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0084479/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyNDUxMTQ2Ml5BMl5BanBnXkFtZTYwOTgwNDI5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Romy Schneider, Michel Piccoli, Helmut Griem | See full cast and crew »"],
      "reviews": [
         "Having watched a lot of movies, viewers get better at evaluating their strong and weak points, they can notice the flaws and strengths more easily. And if movie buffs watch LA PASSANTE DU SANS SOUCI, their reactions are usually diverse. It does not occur to be a great production nor a wonderful film that one could watch all over again. LA PASSANTE DU SANS SOUCI is rather an average work. Yet, after viewing the film, the majority occur to remember it. Why? Its content is pretty clichéd, the action is far from good, the colors appear to be clearly long in the teeth. A story of a Jewish family escaping the cruel Nazis is rather a widespread theme nowadays, some people would say... This goes in pairs with weak character development since the film is based on flashbacks, the gist being the events of yore that find the light of truth at present in the court. Murder, suspicion, fear, war hardship, prejudice: these are the themes of the movie. The script is also not very clever except for some minor moments. Of course, we get the insight into the psyche of the main character, a Jew Max Baumstein (Michel Piccoli), his childhood, youth and adulthood; yet, it is all around the things that we all know pretty well. Nevertheless, the movie can boast two aspects that are so powerful that lead us all to pardoning possible flaws. The first strongest point of the movie is the acting from two people, the famous pair of fabulous artists: Romy Schneider and Michel Piccoli. Romy Schneider, in her last movie, plays two roles, two women that appear in Max Baumstein's life: Elsa Wiene, a symbol of motherly love and Lina Baumstein, a symbol of female love. It appears that her two roles are integral, create as if the main character's dream, memory combined with reality and upright thoughts. She is the female of Max's world existing in his inner and outer world. But the most important fact to mention about Romy is not so much her \"double acting\" but the way she executes it. After the first viewing of the movie, I became breathless for a while and asked the person who was watching the film with me: is it possible that this is all acted? Is it possible to achieve such a marvelous insight into art of portrayal? No, these roles are biographical. In the famous scene when Max plays the violin at the Christmas party, Romy looks at him and genuine tears fall on her cheeks. Max reminds her of her beloved son David whom she tragically lost in July 1981. In another powerful moment when she says \"It's all over\" referring to her husband Michel, she desperately looks for relief in drinking. That's what the actress did in the last years of her life. She not only shouts in despair \"I want my Michel\" but also \"I want my David!\" Yet, the destiny occurs indifferent to cry. Besides, you cannot skip the nostalgic scene at the railroad station... Romy Schneider does something absolutely unforgettable, a thrill that goes through your back, something you cannot resist. Therefore, LA PASSANTE DU SANS SOUCI, being Romy's last film, is, undeniably, one of the most \"Romy Schneider films.\" The male star of the movie, Michel Piccoli, is also very convincing in the role of Max. He kills the eminent figure but gives a logically heartfelt justification for his deed: \"I wish no one would have to live so difficult a life I had in my youth due to Nazis and the hell they had given to us.\" Mr Piccoli had appeared in films with Romy before, but I admit that this is the best of his roles. Piccoli appears to be genuine, very memorable and clever enough to manage difficult scenes that create dense atmosphere. Yet, no one can say, in spite of the fact that he plays the main role, that it is so much the Michel Piccoli movie as the Romy Schneider one. The second strong point of LA PASSANTE DU SANS SOUCI is the exceptional sentiment. Due to specific music, dense atmosphere, nostalgia created mostly by Ms Schneider, you as a viewer are, unwillingly even, led into the world of this film, into the tragedies of people that suffered, into the endless walk towards happiness. You, together with the characters, have a feeling, more to say, a desire to create something better in the world. You suddenly realize that there is something missing around us: shortage of empathy, perhaps. It all raises questions and reflections about such critical truths like justice, dignity of life, social relations, etc. Young Max playing the violin seems to symbolize this quest for a better world, lost world that we have to recapture. And that is the strongest power of the film because if it hadn't been for the heartfelt message and reflections, what sense would that all carry? I agree that the Nazis are showed in a very stereotypical way: just a group of bandits who want to raise the terror on the streets and who are only good at beating the Jews whom they meet by chance. However, what could be the view of these people created in the mind of a small boy who lived in fear. I personally think that those scenes showing Max hiding himself under tables and trembling with fear draw our attention to one of the key aspects of war: who really suffers are the innocent children. All in all, there would be, of course, much to criticize about the film. It's a flawed movie, certainly. Yet, it has the fabulous roles/role of Romy Schneider and the truly unforgettable mood. The message is all right too. It makes us realize that both the characters and we all are constantly the endless walkers towards happiness. Therefore I rate it 7/10",
         "Mercy for this movie! It is not one of the greatest, it doesn't avoid some \"kitsch\", and is parallelization of nazism and neonazism is more than naiv... I know. But when you have the chance to see one of the most beautiful women ever appeared on a movie screen - Romy Schneider -, and see her accompanied by such a fine french actor as Michel Piccoli is - wouldn't it be foolish to play the severe judge?",
         "This is one movie I saw when i was a kid: maybe with parents, maybe with school, i can't say now. The only thing I remember before this projection is that's a sad story between Romy and a kid in the Nazi time. surprised to be back in the Paris of the 80s as the start of the movie as it remains a golden period for me. In France, everyone, everything seems filled with a sense of new age, new spirit, new ideas that technology today fails to bring. For those like me who interests in human rights, you can see that maybe the world has gone in a good direction as all the abuses Piccolli addresses in his speech are now closed: Ireland, Apartheid, South America, USSR. Then, the movie goes indeed back to time and it's a bit \"Schindler's list\" and \"Music Box\" before them. Usually now, when a single mother is left with her kid, i get anxious for the family but here it wasn't really my feeling: the kid is too much in Oedipus complex and Romy is too much into her husband. Nothing really happens between them. Piccoli is as serious and rock as usual and it's a bit strange that he begins as the youngest character and ends like the oldest (as the make-up are not really good). In my opinion, all the emotion of the movie comes from Gerard Klein, who plays the typical easy-going French: at first, he can't believe the Nazi system and finally comes to discover it. The final twist is accurate as vengeance can be a never-ending drama and it offers the opportunity to Jean Reno to claim he has played with Romy!",
         "Knowing that this was the last film Romy Schneider would ever make before she died barely halfway through an average life-span inevitably colours the way we approach it; it is the product of a highly respected writer, Joseph Kessel, and a journeyman director whose blushes I will spare, the two leads co-starred on other occasions and the male, Michel Piccoli is still going strong with a new film in the salles even as I write; the female enjoys iconic status and deservedly so, gracing several fine films in her tragically short career. Here she gets to play two roles in two time zones and relishes both. To call the story hackneyed is to call Stallone an acting joke, in other words, what else is new, but there is no denying the powerful 'presence' of Ms Schneider. If she had to go she did so with honour.",
         "The past is part of the present and affects our future. That is the thread that runs through this beautifully produced and brilliantly directed film. This is an idea that is vehemently denied by Neo Nazis in my own country, South Africa, even now. The actors are simply superb and the story is very well written and one becomes totally absorbed as one follows the machinations and plot twists in the film; when one sees what happens in a country where human rights and their violation are at the whim of thugs. The theme music is haunting and memorable as is Romy Schneider's performance in twin roles. The great love that the lovers demonstrate is but a dream for many people - that makes the separation and the loss all the more acute; one feels for the protagonists as they try to overcome the enormous challenges with which they are faced by a brutal, racist Nazi state which demands total subservience and which destroys minorities and the untermenschen quite pitilessly. The film is rich in ironies. One is faced with many questions as one sees a wealthy person risk his life: the organisation he has founded challenges the violation of human beings in the Apartheid state, in northern Ireland, in South America and across the planet. A recurring theme is that of lovers looking frantically for each other... and missing each other; the anguish and the emptiness that fills one as one searches for the one human being with whom one feels whole. The fate of the two loving couples in this tale fills one with emotion. If this was based on true experiences, even partially, one just keeps saying, NO!, NO! NO! The love that human beings can come to feel for other human beings is a divine emotion. It is a love that ensures the immortality of Homo Sapiens. When authoritarian states interfere with, and undermine that emotion then they undermine themselves. This should not happen to any human beings; people who love, who care, who are kind should not have endured this - innocent people who just want to love and follow their careers and nurture them families should not be tormented like this. The film shows Germans who write and publish against the Nazis in a similar manner to how whites, Africans, Indians and coloureds did the same in Apartheid South Africa. Germans caring for brutalised Jews is a recurring theme in post war German films. In my opinion not enough films can be made about that theme. The state might be evil. People do not have to be.",
         "Joseph Kessel was a pillar of the French literary world. A Jewish writer who often wrote about war and exotic locales, he was elected to the Academy, becoming a sort of Hemingway figure. North Americans know him through The Lion (Cardiff), Night of the Generals (Litvak), and The Horsemen (Frankenheimer). The latter had one of the best performances by Omar Sharif I can recall. L'Armee des ombres (Melville) was one of the most moving resistance stories I've seen. Too, he wrote Belle de Jour, which all Deneuve fans are eternally grateful for. This film is not on a level with the others. Slow, talky, and with the political themes not fully brought out (although the scene with Maria Schell and the urn containing her husband's ashes is wonderful), I'd be hard pressed to make a case for it as essential viewing. For Romy Schneider completists.",
         "I have enjoyed some wonderful French films. Among them are some of the most insightful cinema experiences I can recall. Thought provoking, adult in their treatment of relationships, written with interesting characters and subtle performances. Some have remained in my mind for days after seeing them - very satisfying entertainment. But not this one."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Elephant Production",
         "Films A2",
         "CCC-Filmkunst"
      ],
      "summaries": ["Max Baumstein is a reputable businessman, a rich self-made man with a conscience - he founded a highly visible and active international organization fighting against violations of human rights. Why would he commit an act that apparently negates the principles he has striven for so long to uphold? Eventually, he reveals a secret about himself that he kept hidden from his younger wife Lina, and that in a roundabout way concerns her as well. It is the conclusion of a struggle that started many decades earlier, when Elsa Wiener, a German singer exiled in Paris, without money or relations, a refugee among many others, faced two daunting problems: surviving in a foreign city, and saving her husband Michel from the clutches of the Nazis."],
      "budget": 0
   },
   "movielensId": 127258,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1982-04-14",
      "dvdReleaseDate": null,
      "directors": ["Jacques Rouffio"],
      "runtime": 110,
      "movieId": 127258,
      "title": "The Passerby",
      "mpaa": null,
      "actors": [
         "Romy Schneider",
         "Michel Piccoli",
         "Helmut Griem",
         "Maria Schell",
         "Mathieu Carrière",
         "Wendelin Werner"
      ],
      "imdbMovieId": "0084479",
      "originalTitle": "La passante du Sans-Souci",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "During an interview, Max Baumstein (Piccoli), respected chairman of a humanitarian organisation, shoots the Paraguayan ambassador dead, in cold blood. Tried for first-degree murder, he explains himself: the ambassador was a former Nazi official, responsible for the extermination of his family.",
      "tmdbMovieId": 5063,
      "avgRating": 3.25,
      "releaseYear": "1982",
      "numRatings": 2,
      "posterPath": "/bmqJwC1Tq8in8w06tTOfFMwtcXr.jpg"
   }
}