{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0073834",
      "video": false,
      "title": "The UFO Incident",
      "recommendations": [85039],
      "backdrop_path": "/wl1WBLmO8iNMPpqOGfWpnTih4Lq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Barney Hill",
               "gender": 2,
               "credit_id": "52fe49919251416c910b1761",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Betty Hill",
               "gender": 1,
               "credit_id": "52fe49919251416c910b1765",
               "name": "Estelle Parsons",
               "profile_path": "/cBw9l1de3bKjr0LpGEGplJuJmPc.jpg",
               "id": 6461,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe49919251416c910b176b",
            "name": "Richard A. Colla",
            "profile_path": null,
            "id": 40391,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.327456,
      "production_countries": [],
      "id": 86598,
      "vote_count": 6,
      "budget": 0,
      "overview": "In the early 1960s, an interracial couple undergo hypnosis, which unlocks memories of a forgotten event on a lonely road. Soon they believe they were abducted by extraterrestrials.",
      "similar": [],
      "original_title": "The UFO Incident",
      "runtime": 92,
      "poster_path": "/sjnqNELR0nUttpYgvu11nj4hNyH.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1975-10-20",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard A. Colla"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Hesper Anderson",
         "Jake Justiz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0073834/",
      "coverLink": null,
      "actors": ["Stars: James Earl Jones, Estelle Parsons, Barnard Hughes | See full cast and crew »"],
      "reviews": [
         "This made-for-television film made quite a splash when it aired on NBC in 1975, right in the midst of a UFO-mania currently sweeping the country. Chronicling the landmark alleged UFO-abduction case of Betty and Barney Hill on the night of September 19, 1961, the film recounts the turmoil they both suffered for years after experiencing \"two lost hours aboard a flying saucer\" while returning home to Portsmouth from Montreal. Adapted from John G. Fuller's 1966 book \"The Interrupted Journey\", the teleplay cleverly utilizes transcripts of the Hills' hypnosis sessions (which commenced the following year and continued for several months) to frame the retelling of their ordeal. Peppered throughout the recreated hypnosis sessions are intriguing flashbacks of the abduction itself, composed of moodily shot and fleeting glimpses of the confrontation, abduction and examination of the Hills by their alien captors. The presentation of their story is remarkably told in a straightforward, balanced and non-exploitive manner. In the last scene there is even room for doubt in the viewer as expressed by the Hills' doctor's attempt to explain that their experience may have been anxiety-induced and/or subconsciously suggested due to stresses related to their marriage. Yet the element that makes \"The UFO Incident\" uncommonly excellent, particularly for a movie made for television, are the two tour-de-force performances by leads James Earl Jones and Estelle Parsons. Their three-dimensional, full-bodied characterizations cover the full emotional spectrum from beginning to end. They exhibit utterly convincing turmoil, not only during and after their abduction, but in the several scenes displaying their personal doubts and fears about their interracial marriage and the potentially negative perceptions to their plight by friends, family and strangers. Therefore, it's really on an emotional level that \"The UFO Incident\" succeeds so well. Rather than concentrating merely on the facts of the abduction (a la \"Fire In the Sky\"), this film enhances the alleged incident by indelibly personalizing its victims. Kudos should go to director Richard Colla, as well, for utilizing minutes-long takes during a few of Jones and Parsons' scenes together, allowing both of these top-drawer actors to build toward beautiful and natural emotional crescendos. Best watched without commercial interruption, \"The UFO Incident\" is easily one of the fifty best TV-movies ever made.",
         "This movie is very closely based on the true story. I can attest to this, because I have a unique relationship to it. I was 9 years old in October, 1965, when our 4th grade math teacher rolled in the 21\" TV to our classroom abruptly one afternoon, and displayed a live interview on local Boston TV with the Hills. Betty Hill described, verbatim, what the movie depicts, except she was much more detailed in the TV interview, which lasted nearly an hour. What she said was so impressive, I never forgot it for the rest of my life. She is the rarest of abductees, in the sense that she had a lucid conversation with her abductors. I believed every word she said then, and I have believed it for 45 years since, without the slightest modicum of doubt. As to the movie itself, I cannot imagine more perfect casting than Estelle Parsons and James Earl Jones. They were made for these parts. If you have ever seen the real Hills in an interview, the resemblance is uncanny. The film pays strict attention to detail and is well made. It took guts for these people to go public, and even more to make a movie that didn't distort the story to the tastes of greedy Hollywood execs. For a low budgeted TV movie, this is more like a superb documentary.",
         "The UFO Incident was one of the hardest movies for me to see. I remember when it first aired, I had to be at a Boy Scout meeting, so I missed it (back in those pre-VCR days). The second chance I had to see it had the station broadcasting it go off the air for a half-hour, and then come back on with a completely fuzzed out picture, so again I couldn't watch the film. I procured a copy last month, and then I lost the bloody tape. I managed to finally get another and FINALLY got to watch the damn thing. Well, it really was worth the wait. James Earl Jones and Estelle Parsons give very believeable and very moving performances as a married couple beset by completely strange and frightening circumstances. Even if you don't believe in the alien abduction phenomenon that has become so widespread after the big-budget version of Whitley Streiber's Communion, you've got to admire the acting abilities of both stars in this movie. You can definitely feel the pain and confusion that Barney and Betty Hill went through in their performances (particularly Jones, who I think accurately encapsulates all of the pent-up frustrations that Barney Hill was reputed to have, though he did so in a decidedly non-stereotypical way - Barney wasn't your average \"Angry Black Man\" of the seventies). I suppose because of Communion (and the recent Signs) one might chuckle a bit at the alien visitors in this movie, but one has to remember that this was a made-for-TV movie and I think the production values put it on a par with any of the contemporary science fiction or horror films of the time period. One also has to remember this movie was made before that famous cover of Communion was published, so the aliens don't quite look like the willowy Greys that most folks have come to associate with the phenomenon. This is a film definitely worth searching out. Sci-Fi Channel apparently shows it now and again, so that's your best bet, outside of the internet trading circles (which is where I got my copy).",
         "First of all, even though I'm a \"UFO buff\" (depending on how you use that term), I'm tired of many sides of the whole subject, because it's been such a huge, huge pop culture subject for such a long while, and between the believers and the disbelievers (especially the latter, really), you can't get away from it. But, you don't have to like the subject A BIT (either as a believer or a disbeliever) to like this movie. You can watch it as a \"docu-drama\" (one that came along before the whole docu-drama craze), about how this couple dealt with the whole situation (regardless of what you believe that was). Or you can watch it as a regular \"scary story\" (it works entirely well as that). And of course, you CAN watch it for the UFO subject itself, especially since it's one of the most famous stories. One of the great things about the Betty and Barney story is that it sticks a pin in the whole \"abducted hillbilly\" idea (which, even if it weren't such a huge generalization, is such really, really overworked joke). Here's a \"mixed marriage,\" in New England, both people intellectuals. And of course it has three very great actors (one a little less well-known by name than the other two). Estelle Parsons and James Earl Jones draw you completely into the whole thing, especially during the \"regressions.\" And Barnard Hughes as the doctor (he'd played a few doctors already by then), was just right also.",
         "The Ufo Incident is one of the best ufo movies of all time.This movie is suppose to be based on a true story that involved an east coast couple named Betty and Barney Hill. If you have heard of the concept of ufo abductions, and have been intrigued by the thought that it could happen, then you would surely like this movie.The last time that I watched it recently,I was struck by how scary it would be to be,to be abducted by aliens from outer space.This is the movie that started my fascination with ufos.It starts out so innocent and nice, and then the terror just builds from there.I literally would be on the edge of the couch,terrified to watch the next scene, but I had to watch.The writing for the screenplay is excellent. It makes you feel like you are there in the story.The entire cast in this movie is superior.Estelle Parsons was wonderful in her portrayal of Betty Hill. She had the east coast accent down to a tee. James Earl Jones was so effective as the gentle, sweet, husband Barney Hill.Barnard Hughes was compelling as the man who tried to help the couple with their problems that arose from their supposed abduction.I have seen so many ufo movies,but I think that this is my very favorite.I cannot recommend this movie enough to ufo buffs.",
         "I saw this movie in the 70's and it blew me away! I've seen many documentaries about UFO's that include dazzling photographs, but this dramatic recreation of the abduction of Betty and Barney Hill in New Hampshire is even more convincing. It takes supreme conceit and a touch of ignorance to believe that we are the only life forms in the universe. I have a friend named Fred who claims he was abducted by UFO's a few years ago in Vermont. His story was authentic enough that he was featured at length on a major UFO documentary produced by the Turner network. He has told me the story in detail so I have to take the subject seriously! James Earl Jones gives a great performance. Remember, these were the days before he became an obnoxious mouthpiece for Verizon. Estelle Parsons is 47 at the time she made this and I was very attracted to her in this role when I saw it in my 20's. She has a pleasant inner beauty although she isn't really pretty. She also has the New England accent down pat and calls him 'Baaaaney.' I watched it again recently and it was just as gripping the second time. I think this is a very spiritual movie and it definitely had an influence on my life and my thinking. If you see it in the tv guide, grab a tape that has several episodes of CHEERS on it and wipe them out with this tremendous film. I consider it the best made for tv movie ever. Don't look for violence or great special effects.",
         "This film is a classic. James Earl Jones` performance is powerful as we get to see the big man cry,yell,scream,and more! Estelle Parsons put on a great performance as well as the other fine actors.The film is very good and even though not much happens it is not boring at all because it is very interesting.I am aware this film is hard to find on tv or on video but If you ever a have a chance of seeing this film don`t miss it because you will not regret it!",
         "James Earl Jones gives a memorable, highly sympathetic performance as Barney Hill, and Estelle Parsons as his wife Betty matches him, moment for moment. This is a harrowing tale, based on a true story (one which heralds the modern era of alien abduction accounts). Barnard Hughes is entirely believable as the psychiatrist who tries to help the couple. The \"special effects\" are refreshingly not-so-special, the absolutely outrageous events depicted un-hysterically in flashbacks. I loved the entities' eyes: human-seeming, with pupils and whites but magnified, as if covered with big lenses--highlighting one distinction between the Hills' descriptions and all those more recent \"grays\" with their huge, oval, entirely black eyes. The treatment is intelligently grounded in the reality of the couple's seeking help for their anxieties and sleeplessness ( their initial focus) rather than the \"sci-fi\" elements of the story. And not since Edna Mae Oliver bawled the name of her dead husband Barney in \"Drums Along The Mohawk\" (1939) has there been heard anywhere a more New Englandy pronunciation of that name than Ms. Parsons delivers here!!",
         "Had this movie storyline been fiction it would be among the best SiFi entertainments ever. But it depicts a REAL event! There are always the nay-sayers who try to debunk anything out of the ordinary. Yet the evidence of the Hill's experience is so well documented and compelling that it stands on its own merits. The casting for this TV docudrama was first-rate throughout, and glimpses of the aliens and their procedures as reenacted during the hypnotic regression sequences is as frightening and spellbinding as it was back in 1975 when the movie first broadcast.For anyone wishing to pursue the event, this is amplified by hearing the actual voices of the Hills under hypnosis as recorded by Dr.Simon. And adding to the validity of The UFO Incident as shown is the overwhelmingly convincing testimony of countless others who have reported similar experiences. Mike Palmiter, Williams, IN.",
         "This was an amazing piece of work for the 1970's. James Earl Jones added such authentic terror to the role of a person discovering forgotten incidents in this life experience, that anyone who has ever forgotten ( and then remembered, realizing they had forgotten) will find this portrayal chilling and unforgettable. His description of the bunny is particularly remarkable...innocent enough to the mind of a child, or an impatient listener. The wife in the story, is played with such stamina and confidence that you could wish to be her in a time of crisis. the natural bravery and assuredness brings a sense of order to the story. Someone please report that this will be distributed for sale sometime somewhere!"
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": ["Universal Television"],
      "summaries": [
         "Through memory flashbacks accessed by hypnotic regression, depicts the alleged UFO abduction of Betty and Barney Hill on September 19, 1961 in the White Mountains of New Hampshire. Upon returning from a trip into Canada, Betty (a social services worker in Portsmouth, New Hampshire) and Barney (a postal employee in Boston) are plagued by crippling anxiety and nightmarish visions. Turning to Dr. Benjamin Simon for help in piecing together the happenings of that night, the Hills enter into therapy and independently relate a most unearthly tale.",
         "Betty Hill is a social worker. Her husband, Barney, works at the post office. In 1963, they can't be called an ordinary couple: he's black, she's white. But what is truly extraordinary about them is not their interracial marriage. Two years before, in 1961, they had a strange encounter while driving along a lonely road at night. Something happened, but they don't remember what. They both become obsessed with their strange memory lapses. They even think they might have seen a UFO. Now, they are seeing Dr. Benjamin Simon, who is uncovering their hidden memories through hypnosis. Dr. Simon can only believe that what they tell him is fantasy; but Betty and Barney are certain that on that lonely road, they were abducted by extraterrestrials, who forced them to undergo painful medical exams. And their only proof is Betty's memory of a star map.",
         "In the early 1960s, a married couple undergo hypnosis, which unlocks memories of a forgotten event on a lonely road. Soon they believe they were abducted by extraterrestrials."
      ],
      "budget": 0
   },
   "movielensId": 127608,
   "movielens": {
      "languages": [""],
      "releaseDate": "1975-10-20",
      "dvdReleaseDate": null,
      "directors": ["Richard A. Colla"],
      "runtime": 92,
      "movieId": 127608,
      "title": "The UFO Incident",
      "mpaa": "",
      "actors": [
         "James Earl Jones",
         "Estelle Parsons"
      ],
      "imdbMovieId": "0073834",
      "originalTitle": "The UFO Incident",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In the early 1960s, an interracial couple undergo hypnosis, which unlocks memories of a forgotten event on a lonely road. Soon they believe they were abducted by extraterrestrials.",
      "tmdbMovieId": 86598,
      "avgRating": 3.83333,
      "releaseYear": "1975",
      "numRatings": 3,
      "posterPath": "/sjnqNELR0nUttpYgvu11nj4hNyH.jpg"
   }
}