{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "inferiority complex",
            "id": 4952
         },
         {
            "name": "fencing",
            "id": 5330
         },
         {
            "name": "nose",
            "id": 5560
         },
         {
            "name": "poet",
            "id": 5933
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "17th century",
            "id": 207941
         }
      ],
      "imdb_id": "tt0099334",
      "video": false,
      "title": "Cyrano de Bergerac",
      "recommendations": [
         4480,
         4481,
         12157,
         12709,
         26175,
         962,
         64559,
         23383,
         28145,
         11444,
         114718,
         209808,
         280062,
         33454,
         8286,
         8422,
         14320,
         88421,
         146662,
         126197
      ],
      "backdrop_path": "/3f6u2Z0X1bBiidAvhu9SRurjFp7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Cyrano de Bergerac",
               "gender": 2,
               "credit_id": "52fe44769251416c750359bf",
               "name": "Gérard Depardieu",
               "profile_path": "/kWGuy8UI8y3uqqCVoFvBVBe8w0J.jpg",
               "id": 16927,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Roxane",
               "gender": 1,
               "credit_id": "52fe44769251416c750359c3",
               "name": "Anne Brochet",
               "profile_path": "/lQYnFrStFLL0svtXWhzNlPFxy6k.jpg",
               "id": 70182,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Christian de Neuvillette",
               "gender": 2,
               "credit_id": "52fe44769251416c750359c7",
               "name": "Vincent Pérez",
               "profile_path": "/elPFKCVOZyMni2hx7mLlaYkyifD.jpg",
               "id": 20239,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Comte de Guiche",
               "gender": 2,
               "credit_id": "52fe44769251416c750359cb",
               "name": "Jacques Weber",
               "profile_path": "/292lgNBhL1cVHZGWj5M7DGszK4X.jpg",
               "id": 24683,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Sister Colette",
               "gender": 1,
               "credit_id": "52fe44769251416c750359cf",
               "name": "Sandrine Kiberlain",
               "profile_path": "/syUJ4VwJYjrfBzENf92zGebI5ti.jpg",
               "id": 81821,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "The Little Sister",
               "gender": 1,
               "credit_id": "52fe44769251416c750359d3",
               "name": "Ludivine Sagnier",
               "profile_path": "/r9D7cZXUSpOOkXfDj4MpT91x3MR.jpg",
               "id": 4390,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "De Guiche's Officer",
               "gender": 2,
               "credit_id": "575f0a7a9251417dd40002af",
               "name": "Philippe Girard",
               "profile_path": "/50b8e8lfOP3FRxQ5iK1885IlhL5.jpg",
               "id": 226024,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035991",
               "name": "Jean-Paul Rappeneau",
               "profile_path": "/qkSwIu4p6OnQwReNYjBQgOEqfY0.jpg",
               "id": 25950,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c75035997",
               "name": "Jean-Paul Rappeneau",
               "profile_path": "/qkSwIu4p6OnQwReNYjBQgOEqfY0.jpg",
               "id": 25950,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44769251416c7503599d",
               "name": "Jean-Claude Carrière",
               "profile_path": "/nlJZcRlzQKo17GuZ2vSMRdag4iV.jpg",
               "id": 9747,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c750359a3",
               "name": "Jean-Claude Petit",
               "profile_path": null,
               "id": 37187,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44769251416c750359a9",
               "name": "Pierre Lhomme",
               "profile_path": null,
               "id": 17556,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44769251416c750359af",
               "name": "Noëlle Boisson",
               "profile_path": null,
               "id": 12758,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44769251416c750359b5",
               "name": "René Cleitman",
               "profile_path": null,
               "id": 34906,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44769251416c750359bb",
               "name": "Michel Seydoux",
               "profile_path": null,
               "id": 70181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59fc79a3925141137f02cd2d",
               "name": "Ezio Frigerio",
               "profile_path": null,
               "id": 34855,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.871569,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 11673,
      "vote_count": 179,
      "budget": 0,
      "overview": "Embarrassed by his large nose, a romantic poet/soldier romances his cousin by proxy.",
      "similar": [
         1213,
         310,
         11584,
         6557,
         2433,
         2959,
         10472,
         10641,
         7973,
         5817,
         4369,
         7861,
         7797,
         321,
         4171,
         8906,
         83728,
         2232,
         1736,
         890
      ],
      "original_title": "Cyrano de Bergerac",
      "runtime": 137,
      "poster_path": "/huxQL2d1yxjh2QEkug5qt52F1bj.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hachette Première",
            "id": 582,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Films A2",
            "id": 875,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "DD Productions",
            "id": 1524,
            "origin_country": ""
         }
      ],
      "release_date": "1990-03-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jean-Paul Rappeneau"],
      "runtime": 137,
      "synopsis": null,
      "writers": [
         "Jean-Claude Carrière",
         "Jean-Paul Rappeneau"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0099334/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MTI5ODc3Nl5BMl5BanBnXkFtZTcwNjkyNDYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gérard Depardieu, Anne Brochet, Vincent Perez | See full cast and crew »"],
      "reviews": [
         "The subtitles in this movie are done so well, one almost forgets the movie was done in French. The words seem to glide effortlessly off of Gerard Depardieu's tongue, as if only he were meant to speak them. It almost makes you jealous of Cirano's eloquence. Even those with no appreciation of poetry whatsoever can still find this movie entertaining. The action is enthralling; the cinematography, endearing; the movie, entertaining. A must see film if you enjoy poetry, romance, humor, action, suspense, period pieces, aesthetically pleasing images, theatre, French, English, other languages, large noses, good movies, or any combination of the above. In short, rent it, buy it or steal it. Just make sure you watch it. And don't blame me if you get caught stealing it.",
         "WARNING - YOU WILL FALL IN LOVE WITH THIS FILM This is the ONE film that made Gérard Depardieu a world-wide superstar. Although he was a star in the french cinema for years, Gérard Depardieu was an un-heard-of unknown in the United States prior to the success, and critical acclaim of this french language film. This film also won 2 Academy awards in 1990(best foriegn film, and best costume). If you have ever seen this film then you know that this was the role that Gérard Depardieu was born to play. After seeing this I cannot imagine another actor in the world playing this role but Gérard Depardieu. This movie will make you laugh, and it will make you cry. You cannot help but to experience all of Cyrano's passions and his lust for life, as well as his heartache for never getting Roxanne to fall in love with him,and his anger and embarassment he feels about his self-contiousness about his large nose. As the film moves foward you grow to love the Cyrano de Bergerac charactor as you experience his emotions with him.There is some good battle scenes and some action scenes and even some killing(but what little bloodshed is done in this film -is done with good taste and relavence to the story instead of a bunch of meaningless killing like as seen in other films in this genre). This is about as well done as any film will ever get. I give it 5 out of 5 stars, a perfect film- A masterpiece",
         "I saw the first adaptation of Edmond Rostand's novel, the 1950 version with José Ferrer. Despite Ferrer's good acting, it had some things going against it. First it was in English, and the thing is that the whole play is written in verses that rhyme. Of course, you just cannot do that in English. Second, Rostand's story was seriously altered. Now, with this version we finally get the real Cyrano de Bergerac, a man whose nose is as great as his courage and skill at sword play, his talent at writing beautiful love poetry, and his will to resist all temptation to become the servant of higher powers. We get to follow his adventures, to feel his wonderful love for beautiful Roxane, his attempt to win her love in ways that nobody would ever consider, and his struggle to keep the freedom of his spirit. I admired the acting, the direction, the lighting, and the costumes. There is so much in this movie to applaud. But the best of it all is that it keeps so close to the original text. I read the play and I just couldn't believe how good this adaptation is. Watch this movie if you have the heart of both a lion and of a lover, and you can appreciate excellent French poetry.",
         "The subtitles in this movie are done so well, one almost forgets the movie was done in French. The words seem to glide effortlessly off of Gerard Depardieu's tongue, as if only he were meant to speak them. It almost makes you jealous of Cirano's eloquence. Even those with no appreciation of poetry whatsoever can still find this movie entertaining. The action is enthralling; the cinematography, endearing; the movie, entertaining. A must see film if you enjoy poetry, romance, humor, action, suspense, period pieces, aesthetically pleasing images, theatre, French, English, other languages, large noses, good movies, or any combination of the above. In short, rent it, buy it or steal it. Just make sure you watch it. And don't blame me if you get caught stealing it.",
         "If you are a hopelessly romantic guy like me, you will love this movie. :) It is very poetic and moving. The english sub-titles forces you to really pay attention to the words, which are the best part of the movie. French IS the language of love, so they say. I bet your girlfriend will like it too! (In case you don't have a girlfriend, you can watch it and think of yourself as a diamond in the rough, romantic, poetic and underappreciated, just Cyrano. :p",
         "The film that made me realise that it's OK for guys to cry. Cyrano, as played so convincingly by Depardieu, is a great rollicking hero, not the foppish aristocrat of previous productions. Indeed, it is his larger than life robustness that makes his futile, towering defiance at the resolution so poignant; the ignoble end of a hero is a classic theme, right from Beowulf, through John Wayne's \"The Shootist\", to 2000's \"Crouching Tiger, Hidden Dragon\" The lyricism in the English translation of Cyrano is commendable, the filmmaking technically sound, the sets and choreography well presented. Depardieu's portrayal of the legendary swordsman as a bullish brawler rather than a delicate fencer is an interesting take, and I find it works. The downside is that the character of Roxanne is so utterly insipid and moronic that you wonder why Cyrano is so taken with her. The tragedy of this Cyrano isn't that his love is unrequited, but that it's so misplaced. An interesting contrast is with \"Crouching Tiger, Hidden Dragon\", which replaces the Roxanne character with a peer for the hero, a \"companion battleship\" as Henry Higgins would say. This makes for an even more heartwrenching story, and makes you realise that Cyrano could have been even better if Depardieu's superb performance had been tempered just a little in favour of a Roxanne who was more worthy of his regard.",
         "No, no, my dearest love... I don't love you! I was just a teenager when I first saw this film. I really didn't know what to expect of a French movie with unknown actors (at least to me by then), with a story I didn't previously know and with the only reference of some Cesar awards. After all, it was an european movie, it was French, it was based in a classic book and with a romantic theme. But something attracted me. I was shocked. Actually it was the first movie I ever went to see to the cinema more than once. I purchased it on VHS as soon as I could, and I am getting it on DVD now that it's available in Spain. After all this time, I know by heart almost every scene of the movie, and it keeps on bringing tears to my eyes in the final scenes, no matter how many times I've seen it. The movie has so many things so nicely put together, it's almost impossible not to be hooked on some of them. To begin with, I was very surprised with the fact that the whole movie is spoken in verse. I think it was the first time I had ever seen something like that, and it is probably also the last since I can't remember any other movie like this! I don't know how well it was done in English, but I can say it was translated into Spanish awesomely. I can only wonder how beautiful it is in the original French version. Everything is so musically coherent and adequate, that you really enjoy watching the movie spoken in verse. I loved it. Then there is the absolutely magnificent performance by Gerard Depardieu. He perfectly resembles at every moment the personality of the eager and sometimes naive but at the same time extremely intelligent, romantic, desperate and vulnerable Cyrano. His physical look, his facial expressions, his voice... everything makes him the perfect Cyrano de Bergerac. You really share his suffering and at the same time you admire its strong personality and determination. He makes Cyrano an admirable man, an enjoyable human being. Wonderful. Apart from that, there is many more things in this movie that make it absolutely enjoyable. The humor. The sets and props, all the environments created. The music. And the story is an absolute classic that many people will feel related to; the struggle of a man than, even though not physically gifted, wants to live and love with no limits... to the person who is not ready to correspond him. Maybe it's the reason why it was so touching for me when I was a teenager, and maybe that's why it still brings tears to my eyes even today :) All in all, a beautiful romantic tale with great sets and performances and that will touch almost anyone's hearts. My favourite movie of all time, and definetly a classic.",
         "Cyrano De Bergerac remains one of the most tragic romantic heroes of all time. He speaks to those who should have anything they want, but deny themselves everything. This film is a fitting tribute to a larger than life character. It is simple, elegant, and subtle. At the center is a awesome performance by Gerard Depardieu as the tragic renaissance man. The rest of the cast does a fine job as well, including Vincent Perez as Christian and Anne Brochet as Roxane. Roxane is also a very tragic figure. She lives for fourteen years, after the death of her one true love, in mourning being visited by her actual love without knowing. The plot is very complicated with no main character getting an easy ride or coming out happy. This is a film for those who believe that they will never have love, although it may only be in your own mind.",
         "Gerard Depardieu should have won all possible acting awards for this wonderful film. This is his best performance (So far). Brilliant costumes and sets. Perfect dialogue. This is the greatest French film of all time. Certainly the greatest European film I've ever seen. (Not counting films from Great Britain, as Great Britain is not in Europe.) Where the Hell is the DVD?",
         "All I have to say is wow! I think it's safe to say that these French don't mess around when it comes to acting. Gérard Depardieu was absolutely brilliant as Cyrano himself and it was such a refreshing pace from the garbage I've seen recently. This was definitely one of the most brilliant performances in late film history. Yes the acting was theatrical but that was the only real way to carry it out...it would've stunk if they modernized it just for the cameras, I'm sure other versions have done this and that's why you don't hear too much about them. I thought it was funny that Vincent Perez was such a proper performer in this and then they made him Eric Draven in \"The Crow\" sequel which was far from good. Just everything about this movie was well done and while it was very romantic it didn't do it in a mushy kind of way that'd turn off guys that aren't really big on that stuff such as myself. There was some decent swashbuckling but it's not one you'd choose for the action itself per say. Just watching this made me really want to read the book because the script was simply genius and nothing less. The poetic lines sounded like silk feels and I highly recommend this to any couples out there that are looking for a little revitalization! Final Gesture: Movies: It's long but I think I'd make it through just to give it due credit. DVD Purchase: The idea is gnawing away at the back of my mind. Rental: YES!"
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Caméra One",
         "Centre National de la Cinématographie (CNC)",
         "DD Productions"
      ],
      "summaries": [
         "A dashing officer of the guard and romantic poet, Cyrano de Bergerac is in love with his cousin Roxane without her knowing. His one curse in his life, he feels, is his large nose and although it may have been a forming influence in his rapier-sharp wit, he believes that Roxane will reject him. He resorts to writing letters to her on behalf of one of his cadets, Christian, who is also in love with Roxane but just doesn't know how to tell her. She falls for the poetic charm of the letters but believes that they were written by Christian.",
         "The classic, tragic story brought to the screen once again. This French film tells the tale of the soulful poet/philosopher and expert duelist named Cyrano who loves the fair Roxanne, but is ashamed to woo her because of his huge nose. Instead he writes love letters for slow-witted, but handsome Christian in order to win her hand for him. She falls deeply in love with the author, but doesn't know they were written by Cyrano.",
         "Embarrassed by his large nose, a romantic poet/soldier romances his cousin by proxy."
      ],
      "budget": 0
   },
   "movielensId": 1277,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1990-03-28",
      "dvdReleaseDate": "2004-02-10",
      "directors": ["Jean-Paul Rappeneau"],
      "runtime": 137,
      "movieId": 1277,
      "title": "Cyrano de Bergerac",
      "mpaa": "PG-13",
      "actors": [
         "Gérard Depardieu",
         "Anne Brochet",
         "Vincent Pérez",
         "Jacques Weber",
         "Sandrine Kiberlain",
         "Ludivine Sagnier",
         "Philippe Girard"
      ],
      "imdbMovieId": "0099334",
      "originalTitle": "Cyrano de Bergerac",
      "genres": [
         "Drama",
         "Comedy",
         "History",
         "Romance"
      ],
      "youtubeTrailerIds": ["ab6eaj4fdMA"],
      "plotSummary": "Embarrassed by his large nose, a romantic poet/soldier romances his cousin by proxy.",
      "tmdbMovieId": 11673,
      "avgRating": 3.78328,
      "releaseYear": "1990",
      "numRatings": 4439,
      "posterPath": "/huxQL2d1yxjh2QEkug5qt52F1bj.jpg"
   }
}