{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0003037",
      "video": false,
      "title": "Fantômas: Juve Against Fantômas",
      "recommendations": [
         56516,
         56508,
         56512,
         56515,
         190694,
         148791,
         195133,
         231035,
         231044,
         196534,
         114145,
         231040,
         147746,
         195073,
         109632,
         94732,
         231423,
         191594,
         190571,
         190563
      ],
      "backdrop_path": "/our2lErYNz5DUUv2adbXduzeE0s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Fantômas / Dr Chaleck / Le Loupart",
               "gender": 2,
               "credit_id": "52fe4903c3a36847f8185113",
               "name": "René Navarre",
               "profile_path": "/3gECy0IwEN2dzErTib92ryVdUXF.jpg",
               "id": 224423,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Jérôme Fandor, journaliste",
               "gender": 0,
               "credit_id": "52fe4903c3a36847f818511b",
               "name": "Georges Melchior",
               "profile_path": "/vv1laIJihoK9JJoWM3sk6gR9QJn.jpg",
               "id": 224424,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Inspector Juve",
               "gender": 2,
               "credit_id": "52fe4903c3a36847f8185117",
               "name": "Edmund Breon",
               "profile_path": "/ert2KIPU3LeRO729o9zoOz7d2uq.jpg",
               "id": 81291,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Lady Beltham",
               "gender": 0,
               "credit_id": "52fe4903c3a36847f818511f",
               "name": "Renée Carl",
               "profile_path": "/8zq2M38Z938wZMi8TL9hBuFAW9x.jpg",
               "id": 94953,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Joséphine la pierreuse",
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8185123",
               "name": "Yvette Andréyor",
               "profile_path": "/z0NqdxcRnrNZvobJpmJdP3IoTMq.jpg",
               "id": 224429,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Princesse Danidoff",
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8185127",
               "name": "Jane Faber",
               "profile_path": "/xZHlWBwgU42qH1aCFjpDUFlBbcU.jpg",
               "id": 224425,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4903c3a36847f81850fd",
               "name": "Louis Feuillade",
               "profile_path": "/nDgYpE9kEgPoeaQhh3WvaT2pXaK.jpg",
               "id": 102844,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4903c3a36847f8185103",
               "name": "Marcel Allain",
               "profile_path": null,
               "id": 19643,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4903c3a36847f8185109",
               "name": "Louis Feuillade",
               "profile_path": "/nDgYpE9kEgPoeaQhh3WvaT2pXaK.jpg",
               "id": 102844,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4903c3a36847f818510f",
               "name": "Pierre Souvestre",
               "profile_path": null,
               "id": 224422,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.506068,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 56511,
      "vote_count": 15,
      "budget": 0,
      "overview": "When a disfigured body of a woman is found in the lodgings of Dr. Chaleck, Inspector Juve immediately suspects this to be the work of his arch-enemy, the master criminal Fantômas. He and journalist Fandor trail Chaleck across Paris and see him being handed a note by a girl called Joséphine. Joséphine is the lover of Martialle, an employee of a distillery company who is taking a large sum of money by train. Fandor follows them onto the train where he and Martialle are robbed by Fantômas. Fantômas sends a telegram to Juve, purporting to be from Fandor, to lure him to the distillery. Informed by Martialle, Fandor has gone there himself. He and Juve fire shots at each other by mistake, before being caught in a violent ambush. Juve and Fandor return to Paris and decide to pay a visit to Lady Bentham’s former house. To their surprise, Lady Bentham returns to the house to meet her one-time lover Fantômas. They overhear Fantômas saying that he intends to dispose of Juve in three days’ time.",
      "similar": [],
      "original_title": "Fantômas: Juve contre Fantômas",
      "runtime": 59,
      "poster_path": "/s0NFAbdpqyKue9sbLkrHv7HNPuB.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1913-09-12",
      "vote_average": 6.7,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Fantômas Serial",
         "id": 188534,
         "poster_path": "/uDtUG0xUCDlWgnbLjTpGn9Z4GNO.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Louis Feuillade"],
      "runtime": 61,
      "synopsis": null,
      "writers": [
         "Marcel Allain",
         "Louis Feuillade"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0003037/",
      "coverLink": null,
      "actors": [
         "René Navarre",
         "Edmund Breon",
         "Georges Melchior"
      ],
      "reviews": [
         "Much like part one, I have to say how impressed I am for what they were able to accomplish in 1913. The picture is crisp, the story is well-done, there is plenty of action. We even have some rather basic special effects. The focus shifts in this second part to be more on Juve (the detective) rather than Fantomas (the thief). This gives it a feeling of a chase, and indeed on the train there is plenty of movement and pacing. Juve is always on the move, even if he never knows if he is going in the right direction... This whole series is incredible, and I highly recommend it to anyone who has an interest in silent film.",
         "This film is the second part of Louis Feuillade's brilliant 'Fantomas' series. Although I liked the first part better this is also very good film. It is remarkably well done for 1913; the special effects are convincing (for example the train crash) and there is plenty of action and good characters. This film will thrill you for the whole hour and leave you wondering after the fabulous cliffhanger ending. Quite amazing for a film over 90 years old. I recommend this film for film students (who should see the whole series, mind you) and especially for those interested in Pre 1920s french cinema.",
         "Certainly the best of Fantomas series.Besides unexpected plot turns there is very good taste sense of humor in JUVE CONTRE FANTOMAS.Funny scene with exchange of fire between Juve and Fandor around barrels (for example). The characters are more complicated than FANTOMAS - A L'OMBRE DE LA GUILLOTINE.Juve and Fandor wearing and exchange different kinds of masks(suites,mustaches,spectacles,...even inflatable belly for Juve).Pretty good Georges Melies's type of special effects at train crash scene for action drive.And brilliant 10 minutes ecstatic cul-de-lampe (boa-killer for Juve,hide-and-seek at Fantomas's place,final explosion).",
         "While I found part one to be a great film, part two seems to be when things really start to get interesting! Part one certainly has its amazing moments, but this continuation seems to be nothing BUT amazing moments! In fact, I was shocked at how entertained I was during all of \"Juve Against Fantomas\". At the beginning of the film, there's this huge sequence on a train, and the amount of tension, suspense, and sheer epic quality of that sequence actually gave me goosebumps. This film is so amazingly awesome that it will give you goosebumps. How often do you think a film over 100 years old will do that? Not very often. \"Juve Against Fantomas\" proves that bias against such old films is absolutely unnecessary, since quite a few films made in the 1910's still seem great and thrilling as ever!",
         "Based on the second novel of Souvestre and Allain ,this one is the weakest link.All the first part is incoherent ,whereas \"Fantomas:A l'Ombre De La Guillotine\" ,in spite of its numerous unlikelihoods ,-also present in the novel of course-,had a plot which made sense ,so to speak..Although I had read it,I found it hard to catch up with the plot. Things go better in the second half :the basement creates an atmosphere of mystery as Fantomas sends his \"mute executor\" -an idea Pierre Souvestre and Marcel Allain borrowed from Conan Doyle ,one of Sherlock Holmes's cases-to get rid of Juve.This okay part paved a reliable way for the next,far superior episode.",
         "This is the second in the series of detective stories. It is interesting and at times exciting. One feature is the uncoupling of the car from the express and the close-up views of the interior. The collision of the car with the approaching express is very well done. It is studio work, but to many the idea will not occur. The struggle between the great snake and the detective is thrilling. A novel twist is given to the escape of the crook from the detective following the arrest just outside the restaurant. The use of the two false arms will stir any theater. The scenes in the haunted house are finely handled, especially the escape of the crook through his submersion in the tank and the use of the hollow bottle for a breathing tube. As a detective story the picture is of unusual strength. - The Moving Picture World, October 25, 1913",
         "Although I have seen the film listed as about 43 minutes long, the version which I have seen runs about 2 hours long. Which version have the others seen? Obviously, a masterpiece when seen with the rest of the Fantomas serial.",
         "Juve contre Fantomas (1913) ** 1/2 (out of 4) The second film in the series finds Rene Vavarre returning as Fantomas, the master thief who escaped his death sentence and finds himself on the run from Inspector Juve (Edmund Breon) who plans to stop at nothing to bring the man to justice. I had heard that this second entry was a pretty big letdown and that was certainly the case as it really does seem like the filmmakers had forgotten the events of the previous film because there are moments throughout this film where you'd think that they either forgot the previous movie or perhaps another bit was filmed but not shown. The first twenty-minutes of this movie is pretty much a head-scratcher because it really doesn't make since when you look back on the events of the first film. There's a long note that we read that tries to bring us up to date but it does very little. I'm guessing that this note was meant to explain the events that had gone on but they still don't add up very well. Another problem is that the majority of the middle section just features Juve talking about how much he wants to capture his number one case who made a fool out of him. This is fine but it really doesn't add too much entertainment. Feuillade's lack of imagination or style means we really don't get much to look at and the story this time just isn't strong enough to carry us through. Once again Vavarre is good in the role of Fantomas and Breon is good as well. The two actors don't have any problem nor do any of the supporting players. The highlight of the film comes towards the end when Juve is in bed and Fantomas sends a large snake into kill him."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Société des Etablissements L. Gaumont"],
      "summaries": [
         "Naturally, after his last experience, Inspector Juve winces under such rebuff as the substitution of Valgrand and the escape of Fantomas. Eventually a mysterious crime puzzles him and his assistant, Fandor. To the chief of the Criminal Investigation Department, he reports that the body of a woman, found in the house of Dr. Charles, cannot be identified. Papers bearing the name of Lady Beltham had been discovered in her clothing. Was the body that of Lady Beltham, the accomplice of Gurn, or was it the intention that people should believe that she was dead? Juve wondered why the body was found in the house of Dr. Charles. He concerns himself to watch the house, and the patience of Fandor and himself is unexpectedly rewarded. One day Dr. Charles leaves the house, and the car in which he rides is followed. Charles makes a false move. The man who leaves the closed car is not the Dr. Charles who got in. He is now a young man, with a black moustache, whereas Charles is a middle-aged man with a black beard. That is decidedly suspicions, and the detectives are in time to see him accept a note from a woman who is waiting for him. Instructing Fandor to follow the girl, Juve goes after the other man, known to the police as Lawrence, the leader of bandits. Following Lawrence (alias Charles) in a taxi, he is fated to lose his quarry, as an accomplice of the bandit punctures the tire of one of the wheels, and Juve is stranded in a street while Lawrence gets clear away. So far there is nothing to connect Charles, alias Lawrence, with Fantomas, alias Gurn. Fandor fares much better. The girl does not succeed in throwing the younger detective off the track and is apparently unconscious of the fact that she is being followed until she notices Fandor in the same compartment of the railway carriage in which she is traveling. Fandor tracks her to a house. Having seen her safely indoors, he sends a note to Juve, saying that he is keeping a good watch. Meanwhile, Lawrence has rend the note Josephine handed him, and he learns that an elderly man, confidential clerk in the employment of Messrs, Brown and Co., has fallen in love with her. That afternoon he is taking $30,000 to clients of the firm, and thinking that she is attached to him, wishes to take her with him on the journey. They were leaving the Gare de Lyon Station for Bercy by the Northern Express at three o'clock that afternoon. Would Lawrence be at the station with others of the gang? In consequence of the breakdown of the car, the note which Fandor had written did not reach Juve. Fandor, however, had waited near the house of the girl, and when she left, dressed as a lady, followed her to the Gare de Lyon, where she met the confidential messenger. No doubt there was a hidden meaning in this meeting, and Fandor decided to join the train; so did Lawrence and others of the gang whom he had gathered round him. The whole party traveled in the last coach of the train, and when the time bad arrived, one of the men climbed along the footboard and uncoupled the coach. Lawrence recognized Fandor, but his presence on the train made no difference to the plans of the bandits. As the coach began to fall away from the rest of the train, Josephine left the compartment in which a peremptory demand for the money be carried, whilst Fandor was also attacked. By this time the speed of the coach has very sensibly slackened and the gang easily escaped, fleeing in a motorcar waiting for them. In the car they examined the haul, and to their intense mortification discovered that the notes the man carried were all half notes, the remainder of which were to be handed to the clients of Brown and Co. when the contract was completed. When Fandor recovered from the shock of the attack he pulled the communication cord. To his consternation he found that not only had it been severed, but that the coach was running down the decline. He knew that the Northern Express was following the train in which he had traveled, and nothing but a miracle would avert a serious disaster. The coach ran back, and as the express began to cross the bridge the engine collided with the coach and the whole train was terribly wrecked. Lawrence determines to obtain the remaining halves of the notes, but decides that before doing so Juve must be killed. With that purpose in view, he, in the name of Fandor, wires to Juve to come to the Bercy cellars of Brown and Co. the following night. Juve, taking the wire as authentic, goes to Bercy, and. seeing someone moving behind the casks, fires, and then creeps forward, to run against Fandor. Lawrence and his accomplice began firing at the detectives, the barrels of spirit were set on fire, and through a tornado of flames the detectives escape. Fantomas again himself escapes, and they lose entire trace of him until one night when at a hotel, Juve and Fandor meet Josephine, and after Juve is introduced by Fandor, he insists that Josephine divulge the whereabouts of Fantomas. She reluctantly, under the threat of arrest, takes Juve to a place where Fantomas is dining with two wealthy young ladies in the disguise of the supposed Dr. Charles. A card is sent to Fantomas saying that someone is waiting for him outside. Fantomas, believing this to be one of his gang, departs from the hotel and is immediately arrested by Juve and Fandor. After they walk down the street, Dr. Charles suddenly makes a struggle and to the amazement of Juve and Fandor, he leaves in their hands nothing but two plaster casts of his arms with his coat sleeves attached. They decide to track Lady Beltham. After much trouble they discover her to be making midnight visits to her old haunted villa. Here they make a visit in the day-time, and being satisfied that there must be still some connection between Fantomas and Lady Beltham, hide and overhear a conversation where Faniomas decides be must get rid of Juve and will send a silent executioner to destroy him. Juve does not exactly know what this silent executioner means, but he prepares to receive a serpent. He is almost crushed to death in spite of his precaution, but survives and surrounds the haunted villa of Lady Beltham. Fantomas is almost caught unprepared, but being ever ready, he quickly sets a trap in which to get together the whole of the police, including Juve and Fandor, so that he may destroy them all by dynamite. These easily fall into the trap, so quickly but well laid. Fantomas realizes that his opportunity has come, and leaping from a cistern in which he had been hiding, he touches the coil of wire and explodes the dynamite cartridge, blowing the haunted villa to a heap of ruins, together with the occupants. The question still remains unsolved: Are Juve and Fandor still alive?",
         "In Part Two of Louis Feuillade's 5 1/2-hour epic follows FantÃ'mas, the criminal lord of Paris, master of disguise, the creeping assassin in black, as he is pursued by the equally resourceful Inspector Juve."
      ],
      "budget": 0
   },
   "movielensId": 128003,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1913-09-12",
      "dvdReleaseDate": null,
      "directors": ["Louis Feuillade"],
      "runtime": 59,
      "movieId": 128003,
      "title": "Fantômas: Juve Against Fantômas",
      "mpaa": null,
      "actors": [
         "René Navarre",
         "Georges Melchior",
         "Edmund Breon",
         "Renée Carl",
         "Yvette Andréyor",
         "Jane Faber"
      ],
      "imdbMovieId": "0003037",
      "originalTitle": "Fantômas: Juve contre Fantômas",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When a disfigured body of a woman is found in the lodgings of Dr. Chaleck, Inspector Juve immediately suspects this to be the work of his arch-enemy, the master criminal Fantômas. He and journalist Fandor trail Chaleck across Paris and see him being handed a note by a girl called Joséphine. Joséphine is the lover of Martialle, an employee of a distillery company who is taking a large sum of money by train. Fandor follows them onto the train where he and Martialle are robbed by Fantômas. Fantômas sends a telegram to Juve, purporting to be from Fandor, to lure him to the distillery. Informed by Martialle, Fandor has gone there himself. He and Juve fire shots at each other by mistake, before being caught in a violent ambush. Juve and Fandor return to Paris and decide to pay a visit to Lady Bentham’s former house. To their surprise, Lady Bentham returns to the house to meet her one-time lover Fantômas. They overhear Fantômas saying that he intends to dispose of Juve in three days’ time.",
      "tmdbMovieId": 56511,
      "avgRating": 3.58333,
      "releaseYear": "1913",
      "numRatings": 6,
      "posterPath": "/s0NFAbdpqyKue9sbLkrHv7HNPuB.jpg"
   }
}