{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "chicago",
            "id": 520
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "beat cop",
            "id": 180469
         }
      ],
      "imdb_id": "tt0045631",
      "video": false,
      "title": "City That Never Sleeps",
      "recommendations": [
         26948,
         26663,
         26666,
         27446,
         26220,
         27543,
         37084,
         27263,
         60938,
         30784,
         28661,
         74753,
         18871,
         43191,
         36522,
         33814,
         47312,
         121703,
         27999,
         25900
      ],
      "backdrop_path": "/jTLf35kcFvYC1MigNYhTgHHSchN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Johnny Kelly",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c683",
               "name": "Gig Young",
               "profile_path": "/b3ygoxK0hWTDtKdwE0C8fUgLoLu.jpg",
               "id": 70985,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Sally 'Angel Face' Connors",
               "gender": 0,
               "credit_id": "52fe45439251416c9102c687",
               "name": "Mala Powers",
               "profile_path": "/tAoeHopIcwGZ7zYgztpqSbJ4Zi4.jpg",
               "id": 88975,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Hayes Stewart",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c68b",
               "name": "William Talman",
               "profile_path": "/v3EG7QdDBYDcBTPJtWzFrlCZEx.jpg",
               "id": 89581,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Penrod Biddel",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c68f",
               "name": "Edward Arnold",
               "profile_path": "/oYJfe7rvtubC8CNNa8gqY36iNP8.jpg",
               "id": 30211,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sgt. Joe, the 'Voice of Chicago'",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c693",
               "name": "Chill Wills",
               "profile_path": "/mTEBgFQOqRJt14gbZiEHHkr81Ij.jpg",
               "id": 14001,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Lydia Biddel",
               "gender": 1,
               "credit_id": "52fe45439251416c9102c697",
               "name": "Marie Windsor",
               "profile_path": "/dy2787JbnskmAt2vjYTjYfFOYRx.jpg",
               "id": 3340,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Kathy Kelly",
               "gender": 1,
               "credit_id": "52fe45439251416c9102c69b",
               "name": "Paula Raymond",
               "profile_path": "/lfJ4wEmG4DxIsHfmRdW01ZKfMRy.jpg",
               "id": 93944,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Sgt. John 'Pop' Kelly Sr.",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c69f",
               "name": "Otto Hulett",
               "profile_path": null,
               "id": 94164,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Gregg Warren",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c6a3",
               "name": "Wally Cassell",
               "profile_path": "/rR7idcD1L1rav40uXRNzsYnbqQV.jpg",
               "id": 78794,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Stubby Kelly",
               "gender": 0,
               "credit_id": "52fe45439251416c9102c6a7",
               "name": "Ron Hagerthy",
               "profile_path": "/7q9NZO6EBOmQo1SbiN8sKtDteQ4.jpg",
               "id": 111593,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Lt. Parker",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c6ab",
               "name": "James Andelin",
               "profile_path": "/3vXPx3CIr1jHoJfT1MZl1lnjLvZ.jpg",
               "id": 111594,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Detective (as Thomas Poston)",
               "gender": 2,
               "credit_id": "52fe45439251416c9102c6af",
               "name": "Tom Poston",
               "profile_path": "/sWoG9di3UG7ffDGN89TrC7o9sGF.jpg",
               "id": 71728,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Agnes DuBois",
               "gender": 0,
               "credit_id": "52fe45439251416c9102c6b3",
               "name": "Bunny Kacher",
               "profile_path": null,
               "id": 111595,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Maitre d'Hotel",
               "gender": 0,
               "credit_id": "52fe45439251416c9102c6b7",
               "name": "Philip L. Boddy",
               "profile_path": null,
               "id": 111596,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Fancy Dan",
               "gender": 0,
               "credit_id": "52fe45439251416c9102c6bb",
               "name": "Thomas Jones",
               "profile_path": null,
               "id": 111597,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Cab Driver",
               "gender": 0,
               "credit_id": "52fe45439251416c9102c6bf",
               "name": "Leonard Diebold",
               "profile_path": null,
               "id": 111598,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45439251416c9102c66d",
               "name": "John H. Auer",
               "profile_path": "/8DbeeEtX1g2WldkN9kguc21bceO.jpg",
               "id": 95118,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45439251416c9102c673",
               "name": "John H. Auer",
               "profile_path": "/8DbeeEtX1g2WldkN9kguc21bceO.jpg",
               "id": 95118,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45439251416c9102c679",
               "name": "Steve Fisher",
               "profile_path": "/5MXMFUeRZIA98NzDxmBOrDMJlSy.jpg",
               "id": 19408,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45439251416c9102c67f",
               "name": "John L. Russell",
               "profile_path": null,
               "id": 7305,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45439251416c9102c6c5",
               "name": "R. Dale Butts",
               "profile_path": null,
               "id": 96849,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45439251416c9102c6cb",
               "name": "Fred Allen",
               "profile_path": null,
               "id": 105461,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.663734,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33924,
      "vote_count": 9,
      "budget": 0,
      "overview": "Chicago cop Johnny Kelly, dissatisfied with his job and marriage, would like to run away with his stripper girlfriend Angel Face, but keeps getting cold feet. During one crowded night, Angel Face decides she's had enough vacillation, and crooked lawyer Biddel has an illegal mission for Johnny that could put him in a financial position to act. But other, conflicting schemes are also in progress...",
      "similar": [
         9277,
         117,
         1574,
         27582,
         599,
         2064,
         289,
         513285,
         5503,
         525,
         9377,
         2048,
         813,
         239,
         426,
         1092,
         258480,
         996,
         416477,
         845
      ],
      "original_title": "City That Never Sleeps",
      "runtime": 90,
      "poster_path": "/urcyZfO5nXHX0w7BtwgrQPxc5ms.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Republic Pictures",
         "id": 1432,
         "origin_country": ""
      }],
      "release_date": "1953-06-12",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "...from the Honky Tonks to the penthouses...the creeps, the hoods, the killers come out to war with the city!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John H. Auer"],
      "runtime": 90,
      "synopsis": "The story begins with a voice-over the \"Voice of Chicago\" introducing the world and main characters of the film. There's Sally \"Angel Face\" Connors (Mala Powers), an exotic dancer; Gregg Warren (Wally Cassell), a former actor working as a performance artist, a \"Mechanical Man\"; Johnny Kelly (Gig Young) a cop having an affair with Angel Face and struggling with his conscience to leave his wife; Penrod Biddel (Edward Arnold), a successful and smooth attorney; Hayes Stewart (William Talman), a magician who has turned to making a career as a thief. Johnny Kelly is disillusioned with his job which he took to please his father, and writes a letter of resignation which he intends to hand in at the end of his shift. He calls Penrod Biddel to accept an offer that the lawyer had made for employment and agrees to meet him later that evening. Johnny's wife Kathy Kelly (Paula Raymond) discovers Johnny's plan to quit his job and calls his father Sgt. John Kelly Sr. (Otto Hulett) who talks to Johnny and is concerned for his son's happiness. On this night Johnny's regular partner calls in sick and his replacement is Sgt. Joe (Chill Wills) whose voice can be recognized as the introductory \"Voice of Chicago\". As they begin the nightly shift Sgt. Joe has a goodly amount of homespun homiletic advice for Johnny whose negative energy casts a pall on their working environment. As the night progresses Johnny visits his stripper girlfriend Angel Face to re-affirm their plans to go away. He also meets with the lawyer Penrod Biddel who asks Johnny to pick up Hayes Stewart and carry him across the state line for the Indiana Police to incarcerate him. Johnny turns down the offer but changes his mind when Biddel tells him that Johnny's brother 'Stubby' is associating with the criminal and will surely get into trouble unless Johnny intervenes and does what Biddel wants. Johnny and Sgt. Joe also answer a call for a woman having a baby and Johnny performs the delivery; they answer a call for an illegal gambling game on the street arresting the ring leader and getting the money back to the men who have been hoodwinked. After each call Sgt. Joe lays out another bit of wisdom that seemingly begins to affect Johnny to where he begins to reevaluate his life. Hayes Stewart has obtained incriminating evidence on Penrod Biddel and seduced his wife Lydia (Marie Windsor). Stewart shoots the lawyer and he and Lydia escape, running to the nightclub where Angel Face dances. Hayes Stewart, having discovered Biddels's agreement with Johnny to take him out of the state calls the police asking to meet with Officer Kelly, only Johnny's father takes the call. Stewart shoots Kelly Sr. and takes Lydia and escapes but can't get far because of the enclosing police. Stewart believes that the Mechanical Man has seen him and intends to stay close by to kill him. Gregg Warren thinks he can bait the killer for Johnny. This sense of honor, and his father's murder, makes clear to Johnny what he really holds valuable in his life. As the Mechanical Man performs in a window, Angel Face states her love for him and as the man begins to shed a tear Hayes Stewart see that he is indeed a real man and shoots, revealing his hideout. Johnny chases him and Stewart falls to his death from an elevated railroad track. Johnny considers what has happened this eventful night and re-evaluates his station in life.",
      "writers": ["Steve Fisher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045631/",
      "coverLink": null,
      "actors": [
         "Gig Young",
         "Mala Powers",
         "William Talman"
      ],
      "reviews": [
         "Contrary to the croonings of Liza Minnelli and Frank Sinatra, The City That Never Sleeps is not New York, New York but Chicago, Illinois. At least it is in John H. Auer's 1953 movie of that name, sort of a noir-inflected Grand Hotel or Dinner At Eight, that opens and closes with floodlit vistas of the wedding-cake Wrigley Building. Several characters' lives intersect in an urban crime drama that even offers a touch of the fanciful. Gig Young, at the center, plays a cop who's dissatisfied with his job and with his marriage (his wife, Paula Raymond, makes more money than he does). Off hours, he hangs around a strip club called The Silver Frolics on Wabash Avenue to see, both on stage and backstage, headliner Mala Powers. That relationship is a rocky as his marriage, and she's as unhappy with her lot as he with his (`Whaddaya want me to do? Crawl into a deep freeze?' she taunts him during yet another breakup). Then Young heads to the precinct for the graveyard shift, riding in a prowl car with a new partner he's never met before (Chill Wills, who also plays the unseen `Voice of the City'). During Young's nocturnal tour he meets up again and again with the various players in the plot. There's rich, crooked lawyer Edward Arnold, who blackmails him into burglarizing some incriminating papers; his two-timing wife, Marie Windsor; former magician turned criminal William Talman; his own brother (Ron Hagerthy) who's now Talman's apprentice; his pop (Otto Hulett), a police veteran; and a `mechanical man' (Gregg Warren) who entertains passersby in the Silver Frolics' window. Some of the ties among the characters are up front, others furtive, to be doled out as the plots thicken. By the end (Poverty Row having learned the lessons MGM taught a couple of decades earlier in the titles cited above), there's tragedy and heartache, reappraisals and reconciliations. There's even a character who vanishes as mysteriously as he materialized \u0096 a whiff of the supernatural which curiously fails to leave any influence on the way the stories unfold. The City That Never Sleeps shows the right breadth for a big, urban story \u0096 from Arnold's moderne penthouse to Young's middle-class flat to the raffish alleys running off Wabash Avenue. Director of photography John Russell (later to film Psycho) helps Auer out with some crafty touches (a telephone dial glowing from a flashlight shone upon it comes to mind). It's not a haunting movie, but it's a satisfying one \u0096 a title that did Republic Pictures proud.",
         "A 1953 Republic gem and a great noir find. This sort of small black and white drama was actually what finished off Republic as TV shows took up this sort of storyline and style, and the studio didn't adapt. Cop Gig Young and burlesque floozie Mala Powers go adulterous and the realism of the noir photography created on actual Chicago streets allow the viewer to be completely absorbed into their cheap backstreet world. This is such an interesting film, and the low budget actually works in its favour......like Monogram's startling DECOY of 1947. Chill Wills appears as a very special and strange character and I won't spoil who he is at all. A very clever and ultimately quite emotional film from a fascinating period in American Cop-dom: 1953...as LA CONFIDENTIAL proved for that city. Find this and relish it, and thank the crummy world of Republic for making it. As a bonus for all us noir-ees, the sensational Marie Windsor is here as well, by the narrowest of welcome margins.",
         "If you like your mysteries on the strange side, this movie is the one. I keep wondering how they filmed it without any people on the streets. Stock footage to bolster an obviously low budget helps somewhat, but this movie depicts Chicago in the middle of the night, and the only car on the street is the police car occupied by our hero. But this was 1953, so it was a different world at 3:00 a.m. There is a little of \"The Asphalt Jungle\" in this one--including the crooked lawyer, a pretty woman too evil for comfort, a safe to steal something from and the usual payment at the end. Then there is the twist -- the \"ghost\" influence -- who is in the middle of the evening's events, and who also narrates. Plus there's a guy portraying a store window mechanical man. Like I said, this is a strange one, but worth a curious look.",
         "I can't wait to see the DVD release of this film with the features and commentary because it is one of those rare Noir films that stay with you. Not so much for the average domestic problems that Gig Young's character displays but more for his relationship with Mala Powers and their great quotable lines: Sally \"Angel Face\" Connors, dressed in a stripper's costume to Johnny Kelly- \"Come here.\" Kelly's reply: \"I've been there.\" And Angel Face's great speech explaining her disillusionment: \"I'm sick of this town. I'm with you Johnny. When I first came to this town I was gonna be... oh there were a lotta things I was gonna be- become famous. But Chicago's the big melting pot, and I got melted but good\". And there are also the throw-away lines in the bar: Waitress to Bartender: \"Two Old Fashions- no ice, no water, no sugar, no grenadine\". \"City That Never Sleeps\" has a light step and has so many quirky little characters that you might wonder who the story is about. The film does focus on certain characters to make its point, is sometimes great to look at for its night-lit location photography and has some nice noir humor. Gig Young has the unflappable charm and bon vivant attitude that almost gets in the way of his disillusioned cop Johnny Kelly. Kelly is the ultimate Everyman who has become a cop because his father wanted him to, and whose wife unwittingly emasculates him because she earns more money that he. All in all, \"City That Never Sleeps\" is worth catching for its noir look and some good performances.",
         "CITY THAT NEVER SLEEPS tries hard to be a major film noir, and does not quite make it. If THE RACKET had a promising central figure at sixes and sevens with the legal and illegal authorities, but no character development to explain how he got the way he did, CITY tries to be a film noir variant of those films like IT'S A WONDERFUL LIFE or AN INSPECTOR CALLS where characters are not quite human, and are intermingling (and bedeviling) humans and their motivations. We are watching Gig Young, a career cop from a family of cops, who is slowly being corrupted by crooked big - time lawyer Edward Arnold. Young is basically acting like a go-between between Arnold and the police, tipping the lawyer off about current investigations. He does get well paid for this, but he has to deal with Arnold's right hand man William Talman, who is not to be trusted. Young does not like Talman's cultivating Young's younger brother - possibly turning him into a complete criminal. He does not realize that Talman is also working in cahoots with Arnold's trophy wife (Marie Windsor) to get the upper hand over the lawyer. Young's own behavior is not really liked by his father, an honest old style cop who is regarded as a hero by the department. You can see that the situation is going to lead to disaster. Young is working an evening shift, and his partner is unable to show up. An unknown Police Sergeant (Chill Wills) takes the partner's place, and the two go around the night world of the city. And while they do so, both are unaware of the explosions about to rend apart the worlds of Arnold, Windsor, and Talman - and dragging in Young's younger brother. Some things to watch in the film: Talman (having shot someone) is aware that the only \"witness\" is a figure in a window. Is it a mechanical man or a real witness? Talman has to spend hours watching, and to see if the figure remains \"mechanical\" or not. See also the sequence where Young chases Talman along a deserted set of elevated train tracks through Chicago. It is a tense and exciting sequence. Finally, note the appearance (in his first movie role according to this board) of comedian Tom Poston as a police officer, who gets involved in a situation that is far from amusing. It's an odd first role for such a funny figure to have played at all.",
         "...is but one of the many elements in this quirky film that makes it SO enjoyable. The plot is complex, but still masterfully laid out, the dialogue is clean and effective, and the imaginative direction, lighting, cinematography and editing clearly place \"City\" in the ranks of minor classics. In fact, you are rarely aware that this was a low-budget Republic Studios pic. There's one scene near the end...the standard \"calling all cars\" scene in the police station, which could have been shot with a single guy at a microphone with a bare wall behind him; instead, we see a bee-hive of activity, with several radio cops reflected in a magical labyrinth of glass panes, with shadowy figures passing through the hallway in back of them. It's seemingly insignificant details such as this that keep \"City\" bristling with intense visuals and character interplay from beginning to end (yeah, the scene with William Talman breaking into Edward Arnold's office at night could have been edited down to about half its length, and the continually recurring stock footage of the police car's POV while racing past a bunch of 1940's parked cars is pretty comical). Having a heavyweight actor like Arnold in a pivotal role lends acting \"gravitas\"; William Talman, an actor I've never really cared for, is superb---subtle, cunning, and ultimately maniacal. The confusion between John Kelly Sr. and Jr. as the tension builds is but one of the masterful plot devices, and the subplot of the Mechanical Man (Wally Cassell) and his dreams of an idyllic life with his lady love amidst the wonders of nature is positively brilliant, as is his change of heart and willingness to sacrifice himself for a noble cause. Cassell's physical skill is as impressive as the emotional sensitivity he brings to the role* And how about mother-in-law's offstage nagging of Gig Young? I found it subtly creepy, almost like mother's voice in PSYCHO. On top of it all, we have the Chill Wills character; you must decide for yourself if it helps or harms the film; I took it as just another off-beat element in this imaginative story of a single night in Chicago. Who knows?--maybe the whole thing was a bad dream from which Gig Young wakes up at the end. Only Mala Powers disappoints in her role; she was rather miscast as the tough, world-weary dame, though her more sensitive scenes are fine. * NOTE - The December 22nd, 1960 episode of TV's June Allyson Show was entitled \"SILENT PANIC\", and featured HARPO MARX as a deaf-mute who works at Christmastime as a Mechanical Man in a department store window; he also happens to be the only eyewitness to a murder on the street. Sound familiar? Unfortunately, the hour-long show fails miserably to live up to its fascinating premise. But I wonder how many other films, radio shows, stories, etc have used this novel plot device over the years.",
         "In Chicago, the police officer Johnny Kelly (Gig Young) is unhappy with his work that pays low-salary and with his marriage. His wife Kathy Kelly (Paula Raymond) has a better salary and his mother-in-law frequently humiliates him. Johnny was forced by his father Sgt. John 'Pop' Kelly Sr. (Otto Hulett) to join the police, but he intends to quit his job and leave his wife to flee to California with his mistress Sally \"Angel Face\" Connors (Mala Powers), who dances in a night-club. When Johnny gets cold feet, Sally tells that she will move to California with the small-time actor Gregg Warren (Wally Cassell), who performs a robot in the window of the night-club where she works, and plans a show with her. During the night, the crooked lawyer Penrod Biddel (Edward Arnold) summons Johnny to participate in a scheme to arrest the thief Hayes Stewart (William Talman) and protect his younger brother Stubby Kelly (Ron Hagerthy) that has teamed-up with Hayes. However Biddel is betrayed by his ambitious wife Lydia Biddel (Marie Windsor) along the restless and busy night. \"City That Never Sleeps\" is a film-noir with a good story of a cop dissatisfied with his job and wife that has the intention to give up of everything independent of the consequences and go to California with his mistress. The plot has many subplots but the conclusion is moralist and does not fit well to a film-noir. My vote is seven. Title (Brazil): \"A Cidade Que Não Dorme\" (\"The City That Never Sleeps\")",
         "Chicago cop Johnny Kelly wants to run away, from his job with the police force, and from his perceived mundane marriage. Hoping to flee Chicago with his stripper girlfriend Angel Face, he keeps putting it off with bouts of cold feet. Then one night when Johnny is assigned a new partner, Angel finally grows tired of false hopes and promises, just as Johnny is tempted by the dark side to finally realise both their dreams, but other factors are heading their way..... Directed by John H. Auer and starring Gig Young as Kelly, City That Never Sleeps was brought to us out of the low budget Republic Pictures studio. Oddly fusing film-noir with fantastical elements makes for a most intriguing watch, yet it's very much a slog to get to a point where you feel your time has been worth it. But crucially it is worth the wait, lots of character strands all thread together to give us an exciting, and well executed climax, tho the fantastical finish point is something of a head scratcher to me personally. It's a weird film in many ways, and one that probably needs repeat viewings to fully grasp {and appreciate} what the hell is going on with all these characters. The weird feel is emphasised by John L. Russell's {Psycho & The Cabinet of Caligari} grimly lighted photography, who utilises the sparseness of the actual Chicago locations to great effect. Known to be a favourite film of Martin Scorsese, City That Never Sleeps is actually a little better than it's B movie tagging. But it remains a film that one feels should have been much better. It's alright to fuse more than a couple of genre's, but you have to make it work convincingly within the structure of the plot{s}, and realistically they only just manage to pull it off, courtesy of a fine, if weird, ending. 6/10 but it could go either way upon a further viewing.",
         "Unless you've the skill of an O. Henry, it's pretty ridiculous to talk about the spirit of a city, even as a generalization. But when that \"spirit\" takes human form and joins the local police force, really it's too much! Whatever induced scriptwriter Steve Fisher to introduce this bizarrely extraneous element into his otherwise tight little tale of the seamier side of Chicago, it was a mistake. Fortunately, the assignment was handed to John H. Auer, who was most definitely the class director of the Republic stable. The action scenes here are handled with his usual vigorous finesse and there's plenty of excitement. The movie was actually lensed on location in Chicago, the city's streets made forcefully real by John Russell's deft photography. Gig Young registers okay as the hero, while Chill Wills is saddled with the \"spirit\". However there are top performances by seasoned players like Edward Arnold, Marie Windsor, William Talman, Paula Raymond, and Wally Cassell as the mechanical man. Mala Powers is suitably cast as \"Angel Face\".",
         "This was a great movie! Beautiful shadowed images lingering on the screen. I saw this gem at the '06 San Francisco Film Noir Festival #4. The movie was slow early on but when it finally got going it led to an exciting climax. Interestingly narrated is all I'll say about this story. It's a great and sordid tale from a night in the urban jungle. Don't miss this if you get the opportunity. This tight little drama is about a cop ~ Gig Young ~ who gets tempted to dabble in the web of corruption and vice. With Marie WIndsor, Chill Wills, William Tallman, and a few other familiar character actors of the day. And, yes this movie was loaned to the festival by Martin Scorsese. It was his personal 35mm print.",
         "This film set in Chicago in 1952 starts ponderously with a voice-over of 'the voice of the city', strangely that of actor Chill Wills (whose voice is more that of a cowpoke or a ranch hand, thus highly unsuitable for this purpose), who then appears in the crime story as a ghostly police sergeant representing the spirit of the city. Really, we could have done without those affectations, and Wills's acting attempts to be mysterious are worse. However, setting all that aside, the rest of the film is a pretty straightforward crime drama which is very good. Gig Young plays a disillusioned policeman vacillating between leaving and staying with his wife and quitting and keeping his job. One wants to kick him so that he stops dithering, but the story requires him to be like that. There are some strong performances: Mala Powers is good as a wild love interest of Young's, Edward Arnold is suave and persuasive as a bent criminal lawyer, Marie Windsor as usual is svelte and corrupt, and William Talman is very effective as a bonkers criminal who wants to shoot everybody, and nearly does. It's all good entertainment, if you look the other way when the pontificating is going on. One needs to take it with a pinch of paprika (the director, John Auer, was Hungarian).",
         "I almost canned this tape after 50 minutes because it was just too slow-moving and had no characters to care about. However, the last 30 minutes were very good, not only because the action picked up but because of the realistic nature of it. Also, the film noir cinematography really picks up that last half hour. In the end, I was glad I watched it. However, to be honest, I wouldn't look at it again. The villain, William Tallman (who, for some reason, gets no billing on the video box), shoots people who get in his way, with one exception, and is a no- nonsense guy. In other words, he's a killer portrayed realistically. The cops in here are either corrupt or rogue heroes such as we saw two decades later with the \"Dirty Harry\" series. Sidenote: Despite all the corrupt cops shown in the movie, the filmmakers must have felt they needed to cover themselves so, at the end of the film you see the words \"The first line of defense!\" in lauding police.",
         "It is obvious that people are going to think this film noir takes place in New York considering the Kander and Ebb song and the reputation of the Big Apple. However, it is actually the Windy City, an obvious fact in the credits which thanks the Chicago Police Department. The film surrounds one night and a disgruntled, ready to retire cop (Gig Young) who also plans to leave his wife. He seems not only world-weary but a little shady as he makes a deal with legal eagle Edward Arnold while on duty with a wise, older partner (Chill Wills) who seems to be playing the voice of his conscience from the moment they meet for this one-shot evening together. The movie immediately begins with the feeling of its influence by 1948's masterpiece \"The Naked City\" as all of the world weary night creatures are introduced, from dancers in a sleazy revue to the mannequin like robot man in the nightclub's window. The plot quickly turns into a bit of a convoluted mess as Arnold's wife is revealed to be betraying him with his enemy and a series of shoot-outs leads to a violent confrontation on a train track for a horrifying finale. The film definitely has that gritty, film noir feel to it that makes the genre so great as a whole, but the overall story telling in this instance is sometimes dizzying. Cast wise, this is pure delight all the way, from Young who exudes exhaustion from the moment you first see him, to femme fatales Mala Powers and Marie Windsor, and the obviously phony Arnold whose honor on the outside is covered by sleaze on the inside. William Talman is a great film noir villain without that Dan Duryea like obviousness, even though you know what side of the law instantly his bread is buttered on. Some clever lines in the screenplay help hide the fact that this puzzle has a few pieces missing and other pieces from other puzzles thrown in to confuse the person trying to put it all together.",
         "WHEN ALL is said, done and written; History will certainly remember Herbert J. Yates' Republic Pictures Corporation as home to the best in the area of the \"B\" Western par excel lance, inexpensively made B Movie Grade Comedies and for its penchant for making Top Grade Serial Actioners; all being the output of their \"Thrill Factory\" assembly line methods of Movie Making. The obviously unflattering and negatively loaded moniker of \"Repulsive Pictures\" was and still is widely circulated alias in the Movie Capitol. AS IS THE case with all rules, there are many exceptions to be found-even at the address of the Republic Studio. The roll call of those films made by their admittedly \"B\" Movie operation is extensive. Just you stop and consider the following, Mister! We have the likes of: THE QUIET MAN (Argosy Pictures/Republic, 1952) THE RED PONY (Charles K. Feldman Group/Lewis Milestone Prod./Republic, 1949) RIO GRANDE (Argosy/Republic 1950, THE SANDS OF IWO JIMA (Republic/Universal Studios, 1949) and CITY THAT NEVER SLEEPS (Republic Pictures, 1953).. \"WHAT WAS THAT last one\", we hear you asking? \"We've never heard of CITY THAT NEVER SLEEPS.\" Well my dear Schultz, neither had we until relatively recent times. We hadn't been able to screen it until just this past week.* THE PRODUCTION of CITY THAT NEVER SLEEPS came along at a time when the movie industry was taking quite a hit at the old Box Office; which is motion picture business talk for 'the bottom line.' Competition to the movie houses' big screen from the small screen of the TV sets was being met with movie types featuring the depiction of situations and intensity that the audience could not view over the public air waves. (At least not in those days) TAKING A CUE from what had been found to be popular in the Post World War II, elements commonly found in the backbone features made during this period were those most commonly found in the genre of Film Noir. Brutally realistic depictions of violence, ever complicating situations, convoluted plot twists and employment of characters depicting some of the truly basest of human behaviour were all regularly portrayed as mainstays of the 'new look' cinema. DISDAINING THE USE of color filming, not for economic reasons; but rather for the creation of the proper moods evoked by the dark, night scenes, rendered in magnificent black, gray and silver; the typical movie of this time evoked danger, sin and often, outright despair. FOLLOWING A GROWING tradition established by such film titles as THE NAKED CITY, KISS OF DEATH, CALL NORTHSIDE 777 and THE HITCH HIKER, traditional use of filming in the Studios' Soundstages, ready made Sets and Backlots was jettisoned from the plans in favour of shooting on real city streets, in real cities of the real mid 20th Century America. This made \"realism\" even more life-like; while as a side bar to the main purpose of the film provided an accurate historical array of snapshots of those cultural idiosyncrasies of the 1940's, '50's and '60's for posterity. AS FOR THE particulars of today's honoree, CITY THAT NEVER SLEEPS is the story a day in the life of Policeman, Kelly (Gig Young), who is at a crossroads in his life. We are made privy to his emotional struggle with his own feelings of inadequacy in life. Originating with his marriage to a lovely, but economically superior in the area of gainful employment; Officer Kelly's feelings of alienation with his job have caused an excessively intensive strain on his life. OFFICER KELLY plans to remedy his plight in a most extreme manner; plotting to leave his missus Kathy(Paula Raymond), quitting the Police Department and running off to sunny California with night club dancer,Sally 'Angel Face'Connors. Kelly, otherwise exemplary Cop, has come to a defining point in his life. In the time of his overnight Tour of Duty on the mean streets of that Windy City, Kelly will emerge as Saint or Sinner, Good Guy or Bad Guy, Paragon of Virtue or Lowest of the Low. HIS SHIFT on the Midnight Watch begins at roll call, shortened by Detective Sergeant Kelly, his father, who has received distressing telephone call from the younger Kelly's wife; pleading for some help in restoring sense to their marriage and life. THE YOUNGER KELLY finds his night's work to be rendered much more different when he is informed that he is without his regular partner, who is absent from work. He is abruptly joined by a replacement called only by his given name of 'Joe'(Chill Wills). During the course of the night's work Kelly interacts with many a bizarre and selfishly evil characters; ranging from a truly criminal Lawyer and his wandering young wife to a down & out actor turned human mannequin to the hardened burglar/killer (William Talman). SOME UNEXPECTEDLY spiritual happenings are brought to bear their positive forces in creating a rebirth and metamorphosis in the soul of Officer Kelly. Suddenly he decides to make reparations to his wife and continue to work as a Chicago Cop. Director John H. Auer takes the script by Steve Fisher and turns in a Minor Classic; which should be required viewing in all Police Training facilities in the Country (and the City, too!) ALL WE CAN say is, \"where has this been for all of our life?\" (We should make note of fine performances by Edward Arnold, Wally Cassell and William Talman. Yeah Schultz, he was D.A. Hamilton Berger on PERRY MASON.) NOTE: * Both Schultz and meself wanna thank our friend Patrolman Vic Rini, CPD (Ret.) for putting us on to it and being kind enough to lend us his VHS copy. Now if anyone wants to know what to get me for my birthday, or Christmas\u0085\u0085\u0085\u0085\u0085 See You Next Time?",
         "Johnny Kelly is a Chicago cop dissatisfied with his life, marriage and job \u0096 he never wanted to be a cop but his father wanted a family of cops and forced him down that road; although his younger brother has actually fallen in with criminal without any of his family knowing. Johnny decides enough is enough and plans to quit this very night and run off wit his stripper girlfriend \u0096 with money from a 'favour' for lawyer Biddel being all he needs to fund the move. However the favour does not go as planned and Kelly finds his decisions kicking back on others dear to him. As a fan of gritty crime films and noirs from the period, I figured to give this film a try and see if it was any good. The film itself is pretty hard nosed and is enjoyable for that but the plot doesn't back it up and, despite a good start, turns into a simple thriller that has none of the complexity of noir, even though that appeared to be its aim at the start. At its core the plot is solid enough to do the job but it is all rather straightforward and, ultimately, morally upright and, dare I say it, religious & about the influence of God? Even after showing Kelly in the grips of a crooked lawyer and coming clean the end credits even dedicate the film to the brave boys of the American police force. I think this was to offset what had been an interesting start, where Kelly is in the throws of moral complexity and is throwing out some pretty harsh dialogue. Add to this the idea of a cop going corrupt (and being our lead actor) and you can see why the film fell back into line with the moral majority by the end \u0096 hell, even one of main characters is called Hayes! How obvious is that!? Despite this it still works as a crime drama but the tough edge in the early stages show it was aiming for tougher product and it is full of weird touches (an actor working as a robotic man?) will mean that many audiences will feel let down by the second half in a way they might not have done if the film had aimed low all along. I had not heard of anyone in the cast and no faces rang bells but they all did OK. Young does OK with the moral stuff early on but he is not as good when required to just be a square jaw of the law. Powers is OK and is betrayed by the script, meanwhile the support cast all fill their various roles well enough. The weaknesses are not with them regardless of their lack of fame \u0096 it is with the material. Overall this is an OK crime drama but it is obvious that it wanted to be more. The 'happy' ending, religious message and end credits all feel like they have been stuck in in order to get the film past the moral guardians of the time (hey \u0096 the film was banned in Finland for 4 years you know!) and they damage what started as an edgy crime noir with tough dialogue and a surprisingly gritty tone. I wonder if there was another version of the film, or if the writers got leaned on \u0096 I guess I'll never know because this film is not good enough to make me spend time trying to find out.",
         "\"City That Never Sleeps\" is one of the strangest film noir movies I have seen--mostly because there is a real surreal aspect to the story that you just don't find in other noir pictures. I don't want to tell you more about this...suffice to say that one of the characters is VERY unusual and you learn just how unusual at the close of the movie. Gig Young plays Johnny Kelly, a disaffected cop who is very unhappy in his marriage and is contemplating running off with his mistress, a stripper, and quitting his job on the force. When you see and hear why Johnny is unhappy, you do feel a bit sorry for him, as his evil mother-in-law lives with them and CONSTANTLY harangues him about his wife earning more than him! Instead of belting the old broad in the mouth (definitely a noir way of handling it) he plans on just leaving...for good. But before he does this he has one more night on the job...and a very eventful night it is. While there is MUCH more to the story and a plot involving William Talman who plays an amazingly cold and vicious killer, I think it's best you just see the film for yourself. The big reveal at the end will determine whether you like this film or not...see the picture and see what I mean. I'd like to say more...but again, just see it for yourself. And, if you want to see it, it's currently up on YouTube.",
         "The City that never Sleeps is a far-fetched convoluted noir complete with guardian angel wearing sergeant stripes. Featuring dull performances and banal dialogue it gets a major boost from Hitch fave lenser John Russell with some fine camera movement and strong compositions promoting this nightmarish world of double cross but the content fails to live up to the form. Conflicted beat cop Johnny Kelly (Gig Young) frequents a strip joint whose headliner \"Angel Eyes\" (Mala Powers) has him contemplating deep sixing his marriage to a loving but emasculating wife who brings more home in his paycheck than he does. Kelly decides to resign after his last shift while working a deal on the side with crooked lawyer Penrod Biddle (Edward Arnold) involving magician gone bad Hayes Stewart ( William Tallman). Stewart is a step ahead however having seduced Biddle's wife (Marie Windsor) and when things go awry the lead begins to fly with plenty of casualties. With the exception of Tallman's performance Sleep's cast performs like they could use some. Young plays it fatigued whether dealing with leaving the wife, the mistress, the job or hearing his cop pop, Kelly Sr. has been murdered. Powers high wattage stripper follows suit while Chill Wills as the enigmatic ride along, Sarge (and film narrator) steers this noir further away from its roots with his credulity straining presence, turning the story towards parable and failing on both counts. In spite of it's impressive imagery The City that Never Sleeps is far more snoozer than sleeper.",
         "This is a mish-mosh that fits where it touches. Gig Young never really convinces as a cop of any kind let alone one flirting with corruption and Mala Powers was equally ill at ease as a hard-boiled 'dancer' in a down-at-heels nite club. She had recently played Roxanne opposite Jose Ferrer's Cyrano de Bergerac and was much more at home in that kind of role. On the other hand Edward Arnold as a crooked attorney and Marie Windsor as his trophy wife (although the term was unknown in 1953) are right at home here. Chill Wills as a sort of 'Clarence' from It's A Wonderful Life is also something of a fish out of water. I suppose we should be grateful that this time around Republic honcho Herbert J Yates didn't cast his wife, Vera Raslston, as he was wont to do at the drop of a script. The level of ineptness is best summed up by the climax. Young has called for back-up to nail heavy William Tallman and this duly appears yet when Tallman takes off only Young gives chase - and he even stops to talk to his brother, who has been wounded by Tallman, before resuming the chase yet still manages to wind up on Tallman's heels. This Povert Row quickie was screened on British TV yesterday and it just about kept me awake.",
         "***SPOILERS*** Chicago policeman Johnny Kelly, Gig Young, has just about had it with his job on the graveyard shift of the Chicago PD as well as his loud mouth mother-in-law who shares the apartment with him and his wife Kate, Paula Raymond, who's deafening and annoying voice, we never get to see her, is load enough to burst your eardrums. Johnny cooks up this plan to quit the police force and check out with dancer and singer Sally \"Angel Frace\" Connor, Marla Powers, to sunny California and open up a combination dude ranch and avocado farm to support himself as well as Sally. The trouble is that Johnny needs some capital or cash to start up his venture and that's where crooked and mob up shyster Penrod Biddle, Edward Arnold, comes in. Biddle's aid the former magician and later mobster Hayes Stewart played by- the future D.A in the Perry Mason TV series Hamilton \"Ham\" Burger- William Talman has gotten his hands on some damaging information about his past-In that he dodged the draft in both the First and Second World War as well as Korea-that can destroy his career! And he wants Johnny to arrest him and drop him off across state lines to keep him on ice until he cools off or -as confusing as the plan gets-something like that! What in the end screws everything up in that it is in fact Biddle's wife Lydia, Marie Windsor, who's feeding Stewart all this information who's in fact his secret lover! The story gets even more crazier with Sally being the subject of the obsessive \"Mechanical Man\" at the side show Gregg Warren, played by Wally Cassell who just passed away last year at the age of 103, who want's to sweep her off her feet and take off with her to far off Hawaii to see the waves roll in and out on the silvery white sand seashores! What Johnny doesn't know is that his kid but a bit nutty brother Stubby,Ron Hagarthy, has taken a shine to Stewart and want's to follow in his foot stets as a second story man. It's Stubby whom he's later to use as a human shield against the police including his big brother Johnny Kelly! ***SPOILERS*** This whole insane plan backfires when Johnny's dad Sgt. John \"Pop\" Kelly Sr. Otto Hulett, also a member of the Chicago PD- With 27 years under his belt-gets into the act,.As well as getting shot and killed, in him mistaken for Johnny by Stewart, who expected him to just get him out of the state and is instead about to run him in on an illegal gambling charge! Which in being a three time loser can put Stewart behind bars for as much as 25 years! A bit ridicules but still interesting flick with actor Gig Young looking as if he'd rather be somewhere else but staring in the movie but the pay is good so just get with it. It was non other then the \"Mechanical Man\" Gregg Warren who stole the show in his right on target impersonation of the \"Tin Man\" in the film \"Wizard of Oz\" who's touching performance as a man looking for a heart brought tears to the eyes of all of us watching him!",
         "There is a group of films that fall within the definition of film noir that also have an unsettling, eerie mood such as \"Night Has a Thousand Eyes\", \"The Seventh Victim\", \"Nightmare Alley\", and this one, \"City That Never Sleeps\". The film opens on scenes of Chicago with narration from The Voice of the City (Chill Wills). Although this seems an artificial device at first, the oddness of the story is set up early as the camera pans down to a strange mechanical man in the window of a nightclub. Johnny Kelly (Gig Young) is a cop from a family of cops, he is embittered with the job and wants out. He is married, but is having an affair with a singer at the nightclub. The action of the movie takes place over the course of one night as Johnny crosses the line, becoming entangled with Penrod Biddle (Edward Arnold) a corrupt lawyer. Johnny's usual partner for the night is replaced by Sgt. Joe played by Chill Wills - The Voice of the City takes human form. Sgt Joe challenges Johnny's conscience as he strays off the straight and narrow. This, plus the sad mechanical man, take the film into another realm of noir. Director John H. Auer who seems to have had a list of workmanlike, but pedestrian movies under his belt, really dived into a shadowy and moody world for this film. The city at night is as much a star of the film as the actors with great locations in old warehouses, along menacing railroad tracks and down darkened streets. Gig Young was always a likable actor whose shocking ending belied his affability. He is fine in this, as are Edward Arnold and William Tallman playing criminals who fall out. The end result isn't perfect, the final chase, although superbly filmed, goes on just too long, and as was the way with films of the era, characters have quick changes of heart to get the whole thing wrapped up in a few moments before the end titles. However, this one sticks in the memory and it's that touch of other worldliness throughout the story that does the trick.",
         "The acting in this film is very good. Gig Young gives a fine performance in a very serious, hard-drama role. Talman, Arnold and Marie Windsor demonstrate serious, essential film-noir acting skills. So does Powers but she isn't a dancer that's for sure. So if you like noir, view \"City that Never Sleeps\". The cinematography is way above average with deep black and sharp whites, dark alleys with stark lighting and shadows, and some unique camera angles. And I really like the brassy music score and highlights. One aspect I don't understand is an apparition-like approach to \"Naked City\" style narration. It fails because ordinary narration would have sufficed. And they used the wrong narrator - hearing Chill Wills carrying on about the \"pore and magnif'cent citadel\" or being \"talented with his fangers\" seems more appropriate for a horse opera than noir. However this element is kept to a minimum and thankfully used only sparingly. On the plus side of experimentation is an intriguing mechanical man character that strangely does work in this noir. The film's drawbacks are more in the nature of experimentation and uniqueness than ruinous, so I can recommend \"City that Never Sleeps\" for all noir fans."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Republic Pictures (I)"],
      "summaries": [
         "Chicago cop Johnny Kelly, dissatisfied with his job and marriage, would like to run away with his stripper girlfriend Angel Face, but keeps getting cold feet. During one crowded night, Angel Face decides she's had enough vacillation, and crooked lawyer Biddel has an illegal mission for Johnny that could put him in a financial position to act. But other, conflicting schemes are also in progress...",
         "Uniformed Chicago cop Johnny Kelly, Jr., who originally joined the force to make his policeman father happy, has grown restless in the job and has decided to resign the next day. He allows himself to be compromised by a shady lawyer and has decided to desert his wife because of his obsessive affair with a stripper in a sleazy nightclub. Although the sergeant who partners with him for his last night of duty is a stranger to Kelly, the enigmatic cop seems to know Johnny very well. They leave in a squad car for what will be a very eventful last night on duty for the disillusioned young policeman.",
         "In Chicago, the police officer Johnny Kelly is unhappy with his work that pays low-salary and with his marriage. His wife Kathy Kelly has a better salary and his mother-in-law frequently humiliates him. Johnny was forced by his father Sgt. John 'Pop' Kelly Sr. to join the police, but he intends to quit his job and leave his wife to flee to California with his mistress Sally \"Angel Face\" Connors, who dances in a night-club. When Johnny gets cold feet, Sally tells that she will move to California with the small-time actor Gregg Warren, who performs a robot in the window of the night-club where she works, and plans a show with her. During the night, the crooked lawyer Penrod Biddel summons Johnny to participate in a scheme to arrest the thief Hayes Stewart and protect his younger brother Stubby Kelly that has teamed-up with Hayes. However Biddel is betrayed by his ambitious wife Lydia Biddel along the restless and busy night.",
         "Johnny Kelly, who plans on resigning from the police force and leaving his wife the next day, has a very eventful last night on duty."
      ],
      "budget": 0
   },
   "movielensId": 128179,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-06-12",
      "dvdReleaseDate": null,
      "directors": ["John H. Auer"],
      "runtime": 90,
      "movieId": 128179,
      "title": "City That Never Sleeps",
      "mpaa": "",
      "actors": [
         "Gig Young",
         "Mala Powers",
         "William Talman",
         "Edward Arnold",
         "Chill Wills",
         "Marie Windsor",
         "Paula Raymond",
         "Otto Hulett",
         "Wally Cassell",
         "Ron Hagerthy",
         "James Andelin",
         "Tom Poston",
         "Bunny Kacher",
         "Philip L. Boddy",
         "Thomas Jones",
         "Leonard Diebold"
      ],
      "imdbMovieId": "0045631",
      "originalTitle": "City That Never Sleeps",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["ppqYlHW2He4"],
      "plotSummary": "Chicago cop Johnny Kelly, dissatisfied with his job and marriage, would like to run away with his stripper girlfriend Angel Face, but keeps getting cold feet. During one crowded night, Angel Face decides she's had enough vacillation, and crooked lawyer Biddel has an illegal mission for Johnny that could put him in a financial position to act. But other, conflicting schemes are also in progress...",
      "tmdbMovieId": 33924,
      "avgRating": 3.5,
      "releaseYear": "1953",
      "numRatings": 2,
      "posterPath": "/urcyZfO5nXHX0w7BtwgrQPxc5ms.jpg"
   }
}