{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2245188",
      "video": false,
      "title": "Contest",
      "recommendations": [
         12839,
         26823,
         163710,
         81707,
         192623
      ],
      "backdrop_path": "/wRdA2VE5oeIwnp7NXFFb2i07fl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Matt Prylek",
               "gender": 2,
               "credit_id": "52fe4c64c3a368484e1b5ee1",
               "name": "Kenton Duty",
               "profile_path": "/xdJ5YVp2RyPg7u5MkqhFFlnLGHf.jpg",
               "id": 98286,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Tommy Dolen",
               "gender": 2,
               "credit_id": "52fe4c64c3a368484e1b5ee9",
               "name": "Danny Flaherty",
               "profile_path": "/biCdcKOnIfB3Sue9IS8X4k7Z4rG.jpg",
               "id": 512749,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sarah O'Malley",
               "gender": 1,
               "credit_id": "52fe4c64c3a368484e1b5ed9",
               "name": "Katherine McNamara",
               "profile_path": "/9kBsMW17rUk9O5BrBONCQUtSi7B.jpg",
               "id": 968006,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Angela Maria 'Gran' Tucci",
               "gender": 1,
               "credit_id": "52fe4c64c3a368484e1b5eed",
               "name": "Mary Beth Peil",
               "profile_path": "/whRB3eKxwmy83BaS1GcVKoclOf4.jpg",
               "id": 36554,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Kyle Prylek",
               "gender": 0,
               "credit_id": "52fe4c64c3a368484e1b5ef1",
               "name": "Kyle Dean Massey",
               "profile_path": "/tWfDtOYAuODptyWur52G76FFPL5.jpg",
               "id": 1268969,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Rhonda",
               "gender": 1,
               "credit_id": "52fe4c64c3a368484e1b5ee5",
               "name": "Tina Benko",
               "profile_path": "/oG8RmZ2vzuIgl6t5lHEa1CW7DKf.jpg",
               "id": 60120,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Will Terkin",
               "gender": 2,
               "credit_id": "52fe4c64c3a368484e1b5ef5",
               "name": "Talon G. Ackerman",
               "profile_path": "/ifBR9ObVEN7wT39yTdR2N35w0d5.jpg",
               "id": 1268971,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Ned",
               "gender": 2,
               "credit_id": "52fe4c64c3a368484e1b5ef9",
               "name": "Chris Riggi",
               "profile_path": "/AdMqjWBbKDyN5t3F3eYq88FX5tr.jpg",
               "id": 108919,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Rip",
               "gender": 2,
               "credit_id": "571015db9251416a56001eff",
               "name": "Ricky Ullman",
               "profile_path": "/fZwAI5VgU0D6EVi2eXCMKi3zopK.jpg",
               "id": 90577,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Philip King",
               "gender": 0,
               "credit_id": "59c6033ec3a36813ed03d143",
               "name": "Jan Uczkowski",
               "profile_path": null,
               "id": 1364982,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Bobby Butler",
               "gender": 2,
               "credit_id": "59c602f5c3a3681454039a56",
               "name": "Owen Teague",
               "profile_path": "/reBPuiffmHcktvIAjnOVl5oHA0f.jpg",
               "id": 1586047,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Anya Bartosh",
               "gender": 0,
               "credit_id": "59c603499251415b5d03b3a4",
               "name": "Kelley Missal",
               "profile_path": "/jl8az2NpKc1NImDtPuNQbjkrFbG.jpg",
               "id": 1893345,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c64c3a368484e1b5ed5",
               "name": "Anthony Joseph Giunta",
               "profile_path": null,
               "id": 1110610,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c64c3a368484e1b5eff",
               "name": "Anthony Joseph Giunta",
               "profile_path": null,
               "id": 1110610,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5301a1fdc3a3680a2820c9ba",
               "name": "Howard T. Alter",
               "profile_path": null,
               "id": 1293513,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5301a217c3a3680a2820c9ed",
               "name": "Nick Andrus",
               "profile_path": null,
               "id": 1293514,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "5301a230c3a3680a211fdd33",
               "name": "Steven N. Lerner",
               "profile_path": null,
               "id": 1293515,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.504476,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 139459,
      "vote_count": 6,
      "budget": 0,
      "overview": "Bullied high school student Tommy is suddenly befriended by his chief tormentor, Matt, the school's most popular student and star athlete. Tommy is suspicious, but is forced to accept the awkward friendship in order to enter a cooking contest with a big prize. And besides, it's so much easier to impress his crush, Sarah, when he's not getting beat up by Matt and his team. As the cooking contest heats up, Sarah sniffs out a conspiracy, but nobody wants to hear about it. Can Tommy trust his budding friendship with Matt or is it all a huge joke on him?",
      "similar": [],
      "original_title": "Contest",
      "runtime": 88,
      "poster_path": "/veJHd3fnSkn0FFtF6sje18xKztt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Contest LLC",
            "id": 20127,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Percolate Productions",
            "id": 20128,
            "origin_country": ""
         }
      ],
      "release_date": "2013-12-31",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Some Friendships are an Acquired Taste.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Joseph Giunta"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Anthony Joseph Giunta"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2245188/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BOTY2NDU2MzAwM15BMl5BanBnXkFtZTgwODQ1NTc1MDE@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Kenton Duty",
         "Danny Flaherty",
         "Mary Beth Peil"
      ],
      "reviews": [
         "When I saw \"bullying\", I thought \"Oh, geez, another over-the-top, sensitive, feel-good movie that doesn't make a real point.\" but Contest isn't so far off from real life, although it tosses in a few over-the-top points, which are supposed to help the viewer become aware, not distract them from the message. It's obvious that it would be tricky to attack bullying without seeming ridiculous, especially since no one really knows how to handle it in real life. I suspect that everyone has been bullied in real life, especially the bullies, but dealing with it in in real life always seems to be non-confrontational. It's also obvious that everyone in the film tried to make it work and that there was some good chemistry between the characters. Daniel Flaherty's character, Tommy, seems as good a victim as you would hope--someone who just can't catch a break, but still hard-working and caring. It's evident in a scene where he's being swindled by another teen who says his parents lost their jobs. Kenton Duty's character, Matt, doesn't really seem a bully though his brother Kyle does, but that he doesn't want to be bullied, so he goes along with it rather than be ostracized by the rest of the team, and tries to have some fun along the way. Katherine McNamara's character, Sarah, is the intelligent, don't-take-no-for-an-answer type. Tommy's grandmother is the only character that seemed unrealistic, as she wanted to cook for the bullies, to ply them with food, to make them see reason. I don't know of any place in the northeast where that works and I don't recall a grandmother who wasn't at least a little feisty. Still, along the way she has words of wisdom and becomes the voice of reason. There is plenty of scheming and double-dealing and you might need a score card to keep up with who is on which side. Sarah seemed to be keeping up with most everything, but strangely never threatened. In the end, things work out pretty well for Tommy, despite the minor disasters and soul-searching but all the scheming behind the scenes because of Kyle and Joe made me wonder if Matt was safe. Kyle and Joe didn't seem to learn or regret and there weren't any real consequences that would make them change their minds. Wrapping up the story with a perfect ending is fine when you don't have a fabric store full of loose threads, like a 1960s sitcom.",
         "Good family movie about bullying in high school. The cast of young folk all were great! It plays like an after school special, which in my mind is a good thing. I still remember the ones I was shown as a kid in the 70's and 80's. One thing that stood out to me was the lack of a mean girl focus. These kinds of story lines seem to leave the boy friendships in the background and focus on the girls. Most impressed with the soundtrack. Katherine McNamara, Kenton Duty, And Daniel Flaherty all have amazing songs! Daniel sounds like a young Bob Dylan and Katherine's voice is beautiful and I understand she co-wrote the song.",
         "Contest is an entertaining and satisfying look into the bully and the bullied. The rolls of, and the exchanges between characters are eye-opening portrayals of everyday people that I knew growing up. I think everyone knows and can identify with a character in the story that represents the feelings they had as a youth or adolescent... along with the awkward, confusing yet often beautiful emotions that they conjure. I wish this movie were around when my kids were younger, as I feel they could have benefited from seeing it. If you have teenagers, try to get this in front of them. It would be helpful, I believe, to show this film on a class-wide or school-wide level so kids could watch it together.",
         "Warning: Spoilers With everything Matt's brother and legal guardian did and was behind and responsible for, the movie should not have ended like it did. Matt's brother should have been arrested and brought up on charges and faced a judge in court. We've got breaking and entering, assault, child abuse and intent to harm. No way it should have ended like it did without repercussions. Matt's brother was behind making the grandmother fall and injure herself in the kitchen. Actually planned the crime and executed it. He is also legal guardian to Matt and very abusive. I was waiting for the movie to have had CPS remove Matt from his brothers care because that guy is twisted. Nothing happened!",
         "I was beyond impressed with this movie. I knew before seeing it that it carried an anti-bullying message, but I wasn't prepared for just how inventive the messages would be made in the film. It seemed like so many of the characters in the movie had been bullied in ways large or small, and some were the bullies themselves. I got the impression the creators of the film really wanted to highlight the complexities of the issue, how it's not easy to just find one person completely guilty and the rest innocent, or vice versa. Really well done! I was also extremely impressed with how funny the movie was! At totally unexpected moments, I found myself laughing hysterically. Great acting, great story, great movie! Well done to all involved, and thanks for giving the world a new anti-bullying movie that's far from the cookie cutter expectations of the past!",
         "I saw this film at the Mill Valley Film Festival and loved it. It's well-crafted and well-acted, and I think kids will actually enjoy watching it. I say this as someone who works with kids as a librarian in a K-8 school. It has all the components: appealing characters, dramatic moments, and a satisfying conclusion. All in all, a very nice story arc that will hold the viewers' interest and leave the door open for discussion. The movie's greatest strength was in the way the relationship between the three leads developed over time. It provided a more nuanced view of bullying, taking into account that the bully is usually someone who has been bullied himself. The cast of young actors were all appealing and talented. I imagine we'll be seeing more of them. The sound track is also excellent. After watching so many mindless (or violent) films for kids, it's refreshing to watch something that succeeds in getting a positive message across without being didactic or clichéd.",
         "This film devotes itself to a series of increasingly unbelievable escalations that are more about out-of-school criminal behavior than about school-bully problems. The theme is endearing, but the delivery is way, way off-topic. Worse, a fair amount of this movie seems almost comedic, which makes it hard to be sure sometimes just whom to feel sorry for. The script was hard to follow and the direction literally seemed to leave out moments that one had to infer or guess at. Our twelve-year-old son kept asking questions that started with, \"Wait! Why did he just say...?\" An amazing number of characters are played by actors who look rather a lot like each other, too, so it wasn't always even clear who was whom. Overall, this wasn't really a story about bullying. It seemed more like an episode of one of those cookie-cutter Disney Channel shows that all seem to star the same adolescent kids, with an unconvincing set of problems dealt with by absurd solutions, all coming together in a silly ending. If you're looking for a way to connect with your child about this topic, I really would stay away from this one. It unintentionally makes light of a serious issue, and confuses the phenomenon of bullying with complex (and over-the-top) criminal conspiracies. If you even suggest to your child that bullying is similar in school to what it is in this movie, expect to hear the words, \"You just don't get it.\"",
         "Watched this with my kids and we all loved. I appreciated my kids getting the important message, but they kept also commenting on the great music:) One of my kids has experienced bullying first hand, and I think it was very powerful for him to see this story, as he could relate to the experience. Even if your child has not personally experienced bullying, this movie will help them understand the impact it can have, and ways to make a difference if they see it. I would recommend this movie to anyone with kids ages 8-18. The soundtrack was also really great, with some up and coming young artists. We had heard Ian Axle before, and were excited to have some more of his music to listen to. I will definitely be keeping this in our CD library to watch again!",
         "Very well done movie. I watched this with my grandchildren who liked the movie very much. The message was loud and clear and finely portrayed by an ensemble of good actors who were very appealing. I highly recommend this for ages 6 through teens. The end of the film was impressive as it showed both of the main characters had experienced changes and matured through the process of getting to know one another. Although I have watched many movies with my grandkids, I had never seen any of the actors before. It's clear that many of them are going on to careers that will give them more and more exposure. The movie was well directed by this first-time director and is to be applauded.",
         "This is an extremely well- written movie that sends powerful messages about bullying, family love, and friendship. Contest does a terrific job presenting an anti-bully message in a way that audiences of all ages can related to. A wonderful and talented cast who portray the characters they play in a way that engages the audience throughout the twists and turns of the story. Tommy's grandmother a quiet and strong woman is a powerful role model of love, simplicity, and forgiveness. Contest is a truly an enjoyable and well done movie in all respects (i.e. writing, acting, and the unique way the anti -bullying and other messages are portrayed).",
         "Message movies can be a bore but not contest. A good cast and a refreshing twist on encouraging positive behavior with a very timely cooking contest at the core Contest is like a sports movie with food! As in most sports movies you may well guess the ending, but you may be surprised, and the journey is with it. Young actors and a fresh group go filmmakers make this a new entry that will hopefully reach the target audience. This is a good film for families to see together. But as teenagers and young adults may balk at that prospect parents can be comfortable with this as a date night special for their teenagers. The cast is attractive and the romance angle is well played. Contest delivers a message without being preachy and that is very welcome.",
         "This movie was horrible. The people giving this 10 stars either saw a different movie or are Disney channel fanatics because this was just bad from start to finish. There was barely much plot except for the protagonist trying to save his grandmothers shop and the acting and camera work were just downright bad. This was nothing but over dramatized bullying to the extreme and overzealous teens lashing out. I give it 2 stars because I found the shy kid with the accent charming and the blogger crush witty and cute for the small scenes they both got but thats about it. This is a movie you wait for release on DVD and never rent. Save your cash and especially your time and go watch something else you got an abundance of choices.",
         "The premise is a noble one, boy popular bullying unpopular boy. Popular boy gets into trouble. Unpopular boy is super responsible, in this case a talented cook, and good student. Popular boy gets suspended. Principal launches anti-bullying campaign. Popular boy will have shorter suspension if he helps unpopular boy. Yada Yada Yada. Although the characters are developed, the plot is shallow. There are a million and one inconsistencies and improbable scenarios that unfold. The theme of bullying turns into a PSA reminiscing the good old 80's and there 'Just Say No' egg crackling, brain on drugs commercials. Of course, in the end everything is fine. They're are no consequences for the wrong doers. But the boys are friends and that makes it OK, right? The only reason for the higher rating is because my 11yo daughter enjoyed it and extrapolated the intended lesson. Of course, she's not a bully, lol, she's a philanthropic girl scout. But she is empathetic and instantly aligned herself with the underdog in the story.",
         "I believe this was shown on Cartoon Network in the USA and its aimed at the tweenage audience that the Disney channels do well aiming at. Tommy seems to be a perennial bullying victim at High School but his tormentor Matt under the threat of suspension befriends him and joins him to enter a cooking contest where Tommy could earn enough money to save his grandmother's pizza shop. Matt's brother Kyle is cooking a deal where the pizza shop is part of a redevelopment plan and gets his brother, Matt to sabotage the competition. However it seems Matt and Tommy might have bonded but Tommy's friend Sarah is suspicious. The is a lot of double dealing going on in the plot and some of the characters are flawed so its not all black and white but my word this film is giving mixed messages. The High School needs to be closed down given how much bullying goes on there, it needed to build its own hospital wing to treat its victims. At the end of the film one of the characters who has cynically sabotaged, hurt people, manipulated people seemed to have faced no consequences of his actions. A strange outcome for film with an anti bullying message. Some of the acting is fine, some of its broad. Its a low budget film but the script lacks polish and it would had been more focused if he Disney channel had made it.",
         "You'll find a number of familiar faces from the small screen in the film Contest which was made as part of an anti-bullying initiative. It's a decent effort, but sad to say the main reason, the main taunt that bullies use was never in the film. That is that pejorative beginning with the letter \"F\" referring to sexual orientation. That in itself makes this an inferior product. In this film young Danny Flaherty is the target of the jocks in his high school specifically the swim team who love to toss him in the pool as he can't swim. The leader of the bullying and the swim team is Kenton Duty. However one day Duty is caught in the act and is given a choice, expulsion and curtailment of his athletic activities or befriend Flaherty and head an anti-bullying initiative. Duty calls and Duty chooses. But Kenton is raised by older brother Kyle Dean Massey who has his own reasons for wanting this to fail. Flaherty's grandmother who raises him owns a pizzeria that someone wants her out of. It's where Flaherty has learned to cook and he's entered a cooking contest where the winner receives $50,000.00 and TV show entitled TV chef. Flaherty has a team of four for the contest and Duty is part of his team. It goes without saying that when the two are thrown together even though Kenton is initially thinking of sabotaging Flaherty's efforts, eventually he and Flaherty bond in a unique way. What can you say about a film that totally ignores the chief reason for bullying in school, real or perceived gayness. Maybe had Flaherty been made a gay character this film might have had some bite to it. But I suspect the producers didn't want to hear from religious right. Contest, a sincere but very weak film.",
         "WOW! I really enjoyed this movie! As a middle school teacher! I appreciate the efforts of the cast and the writer/director to deliver a much-needed anti-bullying message in an accessible, highly entertaining way. School authorities, stressing their serious commitment to zero tolerance of bullying, often promote their message in a heavy-handed manner. Not Contest. Sure, the subject matter is serious (one character even contemplates suicide briefly). But this script also embraces the foibles present in teens, tweens and adults: namely, being used to doing certain things (like being a loner or a bully) for our \"right\" reasons and then having to deal with those reasons being challenged. And the cast--especially, but not limited to, the five leads--demonstrate their talent as their characters respond to those challenges, for better or worse. Kudos! To Kenton Duty (bully Matt) and Daniel Flaherty (victim & teen chef Tommy) to realistically portraying the rocky relationship between their characters, with its twists & turns of ingrained mistrust vs. building trust. To Katherine McNamara's strong-minded & lovely Sarah, an observant, forthright blogger who challenges both Tommy & Matt in her quest for the truths underlying their unlikely partnership. To Mary Beth Peil and Kyle Dean Massey: the lovingly supportive Gran contrasts well with Matt's manipulative older brother Kyle. How these adults dispense their respective wisdom (Gran's selfless vs. Kyle's self-driven) to the teens they're raising reminds us how \"children live what they learn.\" Just like life, Contest is funny, eye-opening and touching. Tommy and his teen chef crew's lively run-ins with the female Bartosh cousins' team and every appearance of obnoxious teen chef opponent Dennis (a hilarious Dan Fabi) cracked me up. Ravi Ullman's frazzled but smooth TV host kept me smiling. Alex Boniello scarily impressed me as Joe, Matt's friend & swim teammate, with his funny yet vicious streak. And Owen Teague's Bobby (a Team Tommy member) won my heart whether he was impishly flaunting his success with the Bartosh girls or brokenheartedly crying when targeted by a cyber-bully. Contest send an uplifting message: be open to friendships with people who might not seem to be your \"type\"--a reminder that well serves tweens & teens beyond their school experiences. I highly recommend Contest for students 4th grade & up through early high school. Ideally, families would benefit from watching it together. (Also recommended by Stuart Snyder, president of The Cartoon Network where Contest first premiered in October, Anti-Bullying Month.) I also purchased a copy for my classroom library--principals take note!"
      ],
      "genres": [
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Contest LLC",
         "Percolate Productions"
      ],
      "summaries": [
         "Bullied high school student Tommy (Daniel Flaherty) is suddenly befriended by his chief tormentor, Matt (Kenton Duty), the school's most popular student and star athlete. Tommy is suspicious, but is forced to accept the awkward friendship in order to enter a cooking contest with a big prize. And besides, it's so much easier to impress his crush, Sarah (Katherine McNamara), when he's not getting beat up by Matt and his team. As the cooking contest heats up, Sarah sniffs out a conspiracy, but nobody wants to hear about it. Can Tommy trust his budding friendship with Matt or is it all a huge joke on him?",
         "A bullied high school student is suddenly befriended by his chief tormentor and together they face challenges that will change their lives forever."
      ],
      "budget": 0
   },
   "movielensId": 128183,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-12-31",
      "dvdReleaseDate": null,
      "directors": ["Anthony Joseph Giunta"],
      "runtime": 88,
      "movieId": 128183,
      "title": "Contest",
      "mpaa": "PG",
      "actors": [
         "Kenton Duty",
         "Danny Flaherty",
         "Katherine McNamara",
         "Mary Beth Peil",
         "Kyle Dean Massey",
         "Tina Benko",
         "Talon G. Ackerman",
         "Chris Riggi",
         "Ricky Ullman",
         "Jan Uczkowski",
         "Owen Teague",
         "Kelley Missal"
      ],
      "imdbMovieId": "2245188",
      "originalTitle": "Contest",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["3yigmZRyQfc"],
      "plotSummary": "Bullied high school student Tommy is suddenly befriended by his chief tormentor, Matt, the school's most popular student and star athlete. Tommy is suspicious, but is forced to accept the awkward friendship in order to enter a cooking contest with a big prize. And besides, it's so much easier to impress his crush, Sarah, when he's not getting beat up by Matt and his team. As the cooking contest heats up, Sarah sniffs out a conspiracy, but nobody wants to hear about it. Can Tommy trust his budding friendship with Matt or is it all a huge joke on him?",
      "tmdbMovieId": 139459,
      "avgRating": 2.5,
      "releaseYear": "2013",
      "numRatings": 1,
      "posterPath": "/veJHd3fnSkn0FFtF6sje18xKztt.jpg"
   }
}