{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1823125",
      "video": false,
      "title": "Greetings from Tim Buckley",
      "recommendations": [
         42731,
         121703,
         382212,
         27999,
         84299,
         17665,
         14689,
         45881,
         42257,
         33924,
         68201,
         78734,
         43321,
         123742,
         128215
      ],
      "backdrop_path": "/wr21M2zOidvONHY2UEboFX6zRbV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jeff Buckley",
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e73",
               "name": "Penn Badgley",
               "profile_path": "/d4bbCP295s4u1RWLC9Wlmj6FhhQ.jpg",
               "id": 110927,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Allie",
               "gender": 1,
               "credit_id": "52fe4b11c3a368484e175e77",
               "name": "Imogen Poots",
               "profile_path": "/jhirGwxoletj6wAzAttWJj3ra3H.jpg",
               "id": 17606,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Lee Underwood",
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e7b",
               "name": "William Sadler",
               "profile_path": "/nnr5u5lTL9cScrMSKV5MwslgSnn.jpg",
               "id": 6573,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hal Wilner",
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e7f",
               "name": "Norbert Leo Butz",
               "profile_path": "/aDgCIA7QgtivhjuA7pFKjNjWGke.jpg",
               "id": 52020,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Gary Lucas",
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e83",
               "name": "Frank Wood",
               "profile_path": "/7g06FytDzIpbRTw7ONlB2ofara5.jpg",
               "id": 52021,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Tim Buckley",
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e87",
               "name": "Ben Rosenfield",
               "profile_path": "/fFy2OqoaSeXTpuMvgpaHnhQaUDi.jpg",
               "id": 1088672,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Linda",
               "gender": 0,
               "credit_id": "55745ee69251413efe001999",
               "name": "Jadyn Douglas",
               "profile_path": null,
               "id": 1474983,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Paula",
               "gender": 1,
               "credit_id": "5574600d9251413fd20017f4",
               "name": "Ilana Levine",
               "profile_path": "/bSC9KWkORZaNebzcTTVUthnjgQx.jpg",
               "id": 1212620,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Carter",
               "gender": 2,
               "credit_id": "5574602dc3a36824c2001820",
               "name": "Stephen Tyrone Williams",
               "profile_path": "/iVDAfPSonAxYnZJrmISaCipde5t.jpg",
               "id": 588319,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Janine Nichols",
               "gender": 1,
               "credit_id": "55746054c3a368234e001acc",
               "name": "Jessica Stone",
               "profile_path": "/6yeVuDbhW2pHhsFfjau8KrO2mJJ.jpg",
               "id": 1474984,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e6f",
               "name": "Daniel Algrant",
               "profile_path": null,
               "id": 69696,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b11c3a368484e175e8d",
               "name": "Amy Nauiokas",
               "profile_path": "/3uHOzPrIZQ8HZf5JFUQ3bld6Lxj.jpg",
               "id": 1143384,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b11c3a368484e175e93",
               "name": "Daniel Algrant",
               "profile_path": null,
               "id": 69696,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55745d8dc3a36824d8001b8e",
               "name": "Patrick Milling Smith",
               "profile_path": null,
               "id": 1474980,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55745dc6c3a368234c001a3b",
               "name": "John Hart",
               "profile_path": null,
               "id": 2860,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55745e0fc3a36838d3006966",
               "name": "Frederick Zollo",
               "profile_path": null,
               "id": 71263,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55745e46c3a36824c20017f3",
               "name": "Gary Lucas",
               "profile_path": null,
               "id": 1174588,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "55745e599251413dda001877",
               "name": "Andrij Parekh",
               "profile_path": null,
               "id": 53649,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55745e6fc3a3686b7d003ee2",
               "name": "Bill Pankow",
               "profile_path": "/3cX0GVPg9YnqRFKFoZ5Xa7fjSX5.jpg",
               "id": 1264,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "55745e7ec3a36823b900170f",
               "name": "Avy Kaufman",
               "profile_path": "/yQPGktsmkKkhkOQAUlmYlxHJOiJ.jpg",
               "id": 2952,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55745ea3c3a36824d8001bae",
               "name": "Linda Haftel",
               "profile_path": null,
               "id": 1474981,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "55745eb79251413efe00198f",
               "name": "Dani Weinstein",
               "profile_path": null,
               "id": 1474982,
               "department": "Crew",
               "job": "Unit Publicist"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.116029,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 128073,
      "vote_count": 13,
      "budget": 0,
      "overview": "A young Jeff Buckley (Penn Badgley) struggles to make peace with his late father Tim's legacy while preparing to perform at a tribute concert to the late singer-songwriter, in this stirring drama about the prelude to the tragically short-lived singer's creation of his monumental album Grace.",
      "similar": [],
      "original_title": "Greetings from Tim Buckley",
      "runtime": 99,
      "poster_path": "/sbvDtFAKN5zLra6IvLtpuSCltTh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "From A to Z Productions",
            "id": 55066,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Archer Gray",
            "id": 41640,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Smuggler",
            "id": 55067,
            "origin_country": ""
         }
      ],
      "release_date": "2012-09-09",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Daniel Algrant"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Daniel Algrant",
         "David Brendel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1823125/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTkyNTI0MzkxMF5BMl5BanBnXkFtZTcwMDE1MzU0OQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Penn Badgley",
         "Imogen Poots",
         "Norbert Leo Butz"
      ],
      "reviews": [
         "A gentle, touching film about young musician Jeff Buckley, 3 years before his break out (and only) album \"Grace\" traveling to NYC to perform in a tribute concert for his father Tim. Having never known his father, but living in his shadow, and yet gifted with some of the same talent it's an unusual and quietly intimate look at the connections and hurts between fathers and sons, even those who never met. Penn Badgley does a very nice job not only with the young Jeff's angst, but also his voice, which is not an easy one to capture. Imogen Poots is lovely as a young fan of Jeff's father with whom Tim has a sweet momentary romance. Not all the performances are at the same level, and the film doesn't delve very deep, but seeing a father and son (there are various flashbacks to Tim played by Ben Rosenfeld) at about the same age, so similar and so different is an effective and unique structural concept. The tragedy that both men completed their lives eerily alike, dying far too young, casts a haunting melancholy over it all.",
         "The very idea of producing a dramatic film about such beloved, tragic, and incomparably gifted people as Tim and Jeff Buckley might seem like a dubious venture, a bite that would be too big for any director and cast to chew. And yet Greetings From Tim Buckley is a beautiful, touching, electrically charged success, capturing the essence of these two adored musicians with a synergistic magic that, unbelievably, does them both justice. The film uses a true story from the life of singer/songwriter Jeff Buckley (Penn Badgley) -- his preparation and performance at a tribute concert for his father, the late Tim Buckley (Ben Rosenfeld), in 1991. Over the span of a few days, Jeff is forced to contemplate the similarities between himself and the father he never really knew -- their uncanny, iconic visages, their hauntingly similar tenor voices, their shared musical genius, and their mutual ability to remain in the moment of artistic creation and expression 24 hours a day, not just while standing in front of a microphone or expertly manipulating a guitar. Meanwhile, Tim is seen two decades earlier on a journey that mirrors Jeff's, as he spends time on the road and learns via a late-night phone call that his semi estranged wife has given birth to his only son. One of the many things that makes this movie so incredible is that Jeff doesn't confront his long-festering emotional confusion through heavy-handed speeches or overwrought melodrama; much of the largely internalized story is simply presented through music. Tim Buckley's original, earth-shockingly emotive songs provide more than enough narrative momentum for many affecting scenes with either father or son to play out almost without dialog. And in another smart move, any necessary exposition regarding Jeff's personal arc is handled through Before Sunrise-esque exchanges he has with a young woman he befriends while preparing for the concert, conversations that are always strikingly on point, but never too on the nose. It also cannot be overstated how magically and completely Penn Badgley inhabits Jeff Buckley as a man and a musician. The mere fact that Badgley performed all of his vocals for the part live is reason enough to see the film, as Jeff Buckley had a rare, otherworldly voice and dexterous musical ability, both vocally and on the guitar -- and Badgley nails it with absolute perfection. He does this not only when he sings prearranged songs, but when he riffs and improvises during jam sessions, always with every ounce of Buckley's range, not to mention his strange and clever rhythmic and tonal choices. But even greater still, perhaps, is Badgley's overall characterization, which channels Buckley's unique personal mannerisms with such organic precision that we can sense the very physical and psychological undercurrents that they derive from. Often, Badgley conjures the singer's combination of energetic mania and laid-back California fluidity with what looks like total ease. The narrative in Greetings From Tim Buckley only takes place during those few days leading up to the concert, so it's up to the audience to know what lies ahead for Jeff: the groundbreaking solo album, the untold critical acclaim, and the deeply tragic untimely death that befell him, drowning in a river he impulsively dove into just on the heels of his plans for a sophomore album. But the odd mixture of doom and grace that would follow Jeff in life is still present in the movie, lending a further sense of beauty and loss to what would already be one of the most moving musical stories told on film.",
         "i had very low expectations for this and put off watching it for ages as it is not THE true Jeff biopic etc, BUT i have to say it is really well done. they really captured the legendary St Ann's church concert brilliantly, the lead actor was great too, very surprising to me. they weaved back n forth between that time and Tim flashbacks to the 70s, comparing and contrasting pretty much, but it worked really well. and even though they didn't have the permissions to play any Jeff songs, they still were able to sneak in Jeff and Gary Lucas planting the seeds for the song Grace together, that was really cool:) Anyway, this movie is more than good enough to tide us big fans over until the proper Jeff bio movie finally comes out...some day.",
         "A wasted opportunity. The stories of Tim and Jeff Buckley are both tragic ones: massive talents cut short in their primes. Here was an opportunity to tell their stories in an interesting yet sensitive manner (and throw in some good music to boot!). The good music is certainly there, but the interesting story is not. This movie just seems to meander aimlessly, and end up not really making a point. Many scenes just seem like padding, not really developing the characters or plot and just taking up time. There is a degree of sensitivity, but maybe too much. It all just seems so pretentious and punch-pulling.",
         "Before watching 'Greetings from Tim Buckley' I'd never heard of either Tim Buckley (a folk singer in the 1960/70s) nor his son Jeff (a folk rock singer in the 1990s), so approached the film with no pre-conceptions, treating it almost as a work of fiction (with apologies to the Buckleys' fans). The plot (based, of course, on real-life events) surrounds rehearsals for a Tim tribute concert, at which his son Jeff is due to perform. It provides lots of human-interest drama, as Jeff reacts to other people's admiration of a father he barely knew. I cannot judge how accurate the portrayals of the two Buckleys are, but certainly, after ten minutes of Penn Badgley's nervy, twitchy performance as Jeff I was ready to give him a jolly good slapping. But the film did not seem to last as long as its 99 minute running time; always a good sign!",
         "I was impressed by Penn Badgley's portrayal of Buckley in this 'snapshot in time' genre of movie. It was not, as other reviewers seem to miss, a biography of either Jeff or his father Tim Buckley. Rather, the movie focuses on Jeff's reluctant participation and eventual musical and personal redemption via a tribute concert to his father that took place in NYC in 1991. The action takes place over just a few days prior and leading up to the concert. I might add that the St. Ann band backing the various tribute musicians was tremendous. Its my impression that what you hear of them on film was live...or very well near it. I did notice some inconsistent editing and out of sync instrumentals, but this is not the first movie coming up short in this area. Back to Penn Badgley...his musical takes were live and done with no lip syncing. His guitar playing was real...when is the last time you've seen that in a movie? His character was, for me, as honest an interpretation of a tragic character as I've seen in a very long time. The movie takes place in a period prior to Jeff's musical self discovery, a few years before his first album. He comes across as a idiosyncratic, often annoyingly self centered young person still searching for his voice. I didn't actually like the character portrayed in the movie and suspect I wouldn't care much for Jeff Buckley in person, (if Penn's portrayal is accurate) however, this is certainly not the point of the movie. The pace of the film, which others criticize, worked for me...and, in some respects, had the feel of a documentary rather than being scripted. I was a huge fan of Tim Buckley's first few albums...after Lorca, I moved on. Goodbye/Hello is one of the hallmark albums of the 60's: Happy Sad was a haunting art piece blending transitional jazz with folk. I didn't know Jeff's music nearly as well...so, I must confess that his portrayal is personally prototypical. Imogen Poots is lovely and steals every scene she is in...I thought her acting was fresh and unassuming and did a credible New York accent despite being British. All in all, I liked the film on many levels. -Jim",
         "The problem is: how would you like to hear more than one hour of Tim Buckley's songs? What do you think about him as a singer and songwriter? This movie is beautifully made, I doubt that anybody could have done better than Dan Algrant in representing the doomed story of the two Buckleys, their art and their songs. But if you don't like their music you will find the film boring. If you love the music, on the contrary, you will love the movie too. And if you don't know where to stand (just like me) you will patiently watch and appreciate that films like the present one, obviously destined to a small market niche, are still made.",
         "Before watching this movie I had been quite familiar with Jeff Buckley and the album 'Grace' but was not familiar with the story of his father. The scene in the apartment where they are composing 'Grace' - features Jeff playing an an acoustic guitar - a Taylor 800 series (the guitar in the movie looks like an 814c or 814ce from early to mid 2000s\u0085 By looking at the fret inlays and the black plastic key tuners). At that time Taylor had stopped using Grover tuners and had started manufacturing their own tuners. So this is very recognizable to musicians. Probably a small point. Otherwise I liked the movie a lot! Bill Sadler and Imogen Poots - excellent casting choices. Very sad indeed what happened to Jeff.",
         "this is my first IMDb comment and after watching this crap i have to say smthing .I have been a fan of Jeff Buckley right after the release of Grace. reading the comments and the note on IMDb, i really tried to watch this movie with an open mind and also considering how i would have reacted if i haven t had a clue on who Jeff was. Everything in this movie is a waste, Jeff was a true artist( art is very much what all his music was all about), and if i had directed this movie i would have centered everything around this idea... However this is just 1 h 45 of nothing more than watching the time and thinking when smthing interesting is going to happen ... the acting of jeff's character is so bad that it tends to slip into showing you how Justin Bieber could have done a better job. i could really spend the next 10 mins writing about how stupid and nonsense this movie is all about but i ve been spending too much time already. If you have any idea about who jeff and his work was really this is a movie that will offend you ... Somehow an insult to the man... Not really sure why this was allowed to be made and released, obviously there has been stories about people trying to earn a living around Jeff s death and it just continues. I just hope if Jeff could watch from the other side he would at least laugh about it.",
         "The inane title, taken from the invitation to the Tim Buckley tribute concert, is a foreboding of how dull and vague is the movie to follow. This movie was to me at times frustrating, at other time just boring, most of the time frustratingly boring. I have a healthy appreciation for Jeff Buckley and was curious to see a bit about his father's life, as well as explore the relationship between the two. Unfortunately what we're given is a string of thematically incoherent scenes, too lacking in substance to be considered vignettes. There's almost no progression - plot doesn't unfold, themes aren't explored, we never dig deeper into the characters who don't develop anyway. With each new scene I found myself initially engaged, partly as relief from the having the last meaningless scene end, and partly in anticipation that the next might delve into something a bit more meaty and substantial. Alas, each is as directionless as the last. Penn Badgley, as Jeff Buckley, is quite convincing as a troubled creative mind. Though many times the wistful aloofness does not endear himself to us. The character lacks charm. Tim Buckley is thematically central to the movie, but the script effectively leaves him with the status as a secondary character, appearing in a jumble of cut scenes smattered here and there. Imogen Poots does well as an unnecessarily cliché love interest. The acting was overall quite good, but lets us down with a miserable script. The cinematography department mostly did a good job. Some of the scenes are very pretty. The sensitive serenity of other scenes are ruined when, for no apparent reason, the cameraman does away with the tripod and shifts to the shaky-camera style that has gotten all trendy the last few years (my headache-inducing bane!). The audio seems a little rough. Some of the interpretations (I don't believe there's any of Tim or Jeff's original music there) are lovely, but the levels jump around a bit. A lot. And Badgely does his darndest to hit the wailing falsettos characteristic of Jeff, but let's face it - it wouldn't ever sound as good. His voice could have been put through a compression filter with a bit of delay or something - anything to take the edge off his voice, which really starts to grate on one's nerves with some extended scenes of him singing to himself. Though the movie is not for want of detailed post-production audio editing - for some reason a few scenes are filled with annoying electronic whines of amp-feedback or TV static, filled to such an extent as to sound like tinnitus as it verges on being painful (more headaches)(Why??). To sum: the movie fails mostly due to a complete lack of storytelling. The potentially very interesting story of paralleled talent and tragedy, and the intricate inter-generational themes behind it, are all left untouched.",
         "This is awful; is this conceptual; do We know, Jeff, found his voice, after breaking into his One his late fathers, pads? Who are those Terrible musician caricatures supposed to be? the script, is moody bleak, confused, and dull, is there anything else to offer here, but ' that obviously, Jeff Buckley's; own music; was foreshadowed, by his Absent father, who Jeff's producers, would rather have conjured up on a Ouija; board then give time and study, to his own beautiful voice, an instrument, that plays like, the Devi's the characters are Flat! this wants to be a homage, and only hemorrhages, hollow and Uneven, No angels singing Hallelujah here, just' the cinematography; is shaky, sorta like The Blair witch at moments, this should have include, Dream imagery; and less Empty flash backs of how incredibly immature and Selfish Tim Buckley seems to have been."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Archer Gray",
         "From A to Z Productions",
         "Smuggler"
      ],
      "summaries": [
         "Greetings from Tim Buckley follows the story of the days leading up to Jeff Buckley's eminent 1991 performance at his father's tribute concert in St. Ann's Church. Through a romance with a young woman working at the concert, he learns to embrace all of his feelings toward the father who abandoned him - longing, anger, forgiveness, and love. Culminating a cathartic performance of his father's most famous songs, Jeff's debut stuns the audience and launches his career as one of the greatest young musicians of his time.",
         "A chronicle of the days leading up to Jeff Buckley's performance at his father's tribute concert in 1991."
      ],
      "budget": 0
   },
   "movielensId": 128193,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2012-09-09",
      "dvdReleaseDate": null,
      "directors": ["Daniel Algrant"],
      "runtime": 99,
      "movieId": 128193,
      "title": "Greetings from Tim Buckley",
      "mpaa": "NR",
      "actors": [
         "Penn Badgley",
         "Imogen Poots",
         "William Sadler",
         "Norbert Leo Butz",
         "Frank Wood",
         "Ben Rosenfield",
         "Jadyn Douglas",
         "Ilana Levine",
         "Stephen Tyrone Williams",
         "Jessica Stone"
      ],
      "imdbMovieId": "1823125",
      "originalTitle": "Greetings from Tim Buckley",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["pyPoTI-59HU"],
      "plotSummary": "A young Jeff Buckley (Penn Badgley) struggles to make peace with his late father Tim's legacy while preparing to perform at a tribute concert to the late singer-songwriter, in this stirring drama about the prelude to the tragically short-lived singer's creation of his monumental album Grace.",
      "tmdbMovieId": 128073,
      "avgRating": 3.16667,
      "releaseYear": "2012",
      "numRatings": 3,
      "posterPath": "/sbvDtFAKN5zLra6IvLtpuSCltTh.jpg"
   }
}