{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0069817",
      "video": false,
      "title": "The Borrowers",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Pod Clock",
               "gender": 2,
               "credit_id": "52fe4acdc3a36847f81e291d",
               "name": "Eddie Albert",
               "profile_path": "/tScju2xZ42MpXqx5WSYKFtwzH8r.jpg",
               "id": 11998,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Aunt Sophie",
               "gender": 1,
               "credit_id": "55b8bdab92514123d8001881",
               "name": "Judith Anderson",
               "profile_path": "/ryTVWN7XI2WejLsFhicfx3yJ6y9.jpg",
               "id": 3362,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Homily Clock",
               "gender": 0,
               "credit_id": "5818eb4b9251417b72001373",
               "name": "Tammy Grimes",
               "profile_path": "/bUWIHI7EqFXcnks9vtUwjqnbNuV.jpg",
               "id": 63998,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mrs. Crampfurl",
               "gender": 1,
               "credit_id": "5818eb57c3a368421a001302",
               "name": "Beatrice Straight",
               "profile_path": "/bN8PXaFCpG6c0qp9FRynCc98c7M.jpg",
               "id": 10083,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mr. Crampfurl",
               "gender": 2,
               "credit_id": "5818eb639251417b690011bf",
               "name": "Barnard Hughes",
               "profile_path": "/jvHz3TjqROc3Wixeq6dbFBas3EB.jpg",
               "id": 2549,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "The Boy",
               "gender": 0,
               "credit_id": "5818eb71c3a368421a00131e",
               "name": "Dennis Larson",
               "profile_path": null,
               "id": 190652,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4acdc3a36847f81e2923",
               "name": "Mary Norton",
               "profile_path": null,
               "id": 27814,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4acdc3a36847f81e2929",
               "name": "Jay Presson Allen",
               "profile_path": null,
               "id": 6928,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "533bcfacc3a36844dd001182",
               "name": "Walter C. Miller",
               "profile_path": null,
               "id": 1227247,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.213975,
      "production_countries": [],
      "id": 110227,
      "vote_count": 1,
      "budget": 0,
      "overview": "An eight-year-old boy discovers a family of tiny people, only a few inches tall, living beneath the floorboards of a Victorian country home.",
      "similar": [],
      "original_title": "The Borrowers",
      "runtime": 81,
      "poster_path": "/jvjAbpYrB3JPQraolZ8Bpebc4LU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1973-12-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Walter C. Miller"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Mary Norton",
         "Jay Presson Allen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069817/",
      "coverLink": null,
      "actors": [
         "Eddie Albert",
         "Tammy Grimes",
         "Judith Anderson"
      ],
      "reviews": [
         "Previously I had only seen the 1997 remake of this. This version is oriented more towards a younger crowd. It does not play up the comedy angle as much. I felt it was nicely done, and appropriate for the up to age 10 crowd. You may find this on DVD in the $1.00 family bin at Walmart. At least, that's where I found it. One word of warning on the DVD. It's nice that Digiview put it out on DVD. Having said that, the master must have been pretty bad. Don't expect top-notch quality here. It plays more like a well-worn VHS, with audio to suit. There are places where wear on the film shows through, and areas where it was obvious the film had been spliced. Thankfully, the entire movie is better in this regard than the opening credits. But hey, for a buck who's complaining?",
         "Saw this Hallmark Hall of Fame presentation growing up, don't know if it's available on video but it absolutely should be. Fine performances all round, with a nice tight script that does full justice to the really important things in the book: the details of how the Clock family live, the amusing relationships between Pod and Aunt Sophy and Arietty and the boy. Definitely one of the better films for children of the past 30 years. Literate and never condescends. And never falls into the trap of making any of the characters too cute.",
         "this version of the borrowers with eddie albert is a true classic. it is perfection in every way. great sets, good effects and top notch acting. karen pearson who plays arrietty gives one of the all time best performances by a child star and has great stage presence with her elaborate victorian dresses and beautiful long straight hair. this film has just been released on DVD on the digigrew label and is good quality. the borrowers is a classic equal to the 1993 version of the secret garden in production values. not to give much away, the story is about the tiny clock family (albert, pearson) who live under the floor and \"borrow\" from the big folks. run out and \"borrow\" it. better still buy it!!!!",
         "I read a lot of children's books while growing up, though I have to admit that I never read Mary Norton's \"The Borrowers\", even though it's considered something of a classic. So I have no idea if this made for television adaptation follows the book closely or not. However, I did see several months ago the Japanese animated adaptation \"The Secret World of Arrietty\", and I thought it was a charming low key movie. \"The Borrowers\" is also a low key movie for the most part, but the movie forgets to add enough stuff to keep the audience's attention. Except for the last twenty or so minutes, it feels really slow and doesn't seem to be going any place. The characters, both regular sized and tiny, also are lacking spirit. I expect children who watch this will soon get restless. More patient adults will get through it, but I think they'll agree with me that the movie is lacking juice.",
         "I do remember this. I think I found it once, apparently on tape then, and was surprised to see Eddie Albert and Tammy Grimes listed as the little parents. It was long before the internet, so I really don't recall how I saw the casting. As it was, when I first viewed it, I didn't recognize Albert, about the only one I would have known. I just saw the Arrietty movie and decided to check out this one to see how different it was. I won't spoil it, but I do recall an attempt to take out the little people, and how effective it seemed to me, seeing the furniture that had been to the little people's size (and therefore was natural size for Albert and Grimes) suddenly being trounced around. This 'attempt' wasn't in the cartoon, so clearly someone did some re-structuring of the story. Don't know which. I know this version was very low-budget looking, and clearly must not have been that well done for a 7-yr-old to notice. I do remember there was a pleasantness to it. Don't recall any of the big people tho. Wouldn't mind seeing it again for some of the actors and some of the effectiveness."
      ],
      "genres": [
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "20th Century Fox Television",
         "Charles M. Schulz Creative Associates",
         "Foote, Cone and Belding Productions"
      ],
      "summaries": ["An eight-year-old boy discovers a family of tiny people, only a few inches tall, living beneath the floorboards of a Victorian country home."],
      "budget": 0
   },
   "movielensId": 128241,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-12-14",
      "dvdReleaseDate": null,
      "directors": ["Walter C. Miller"],
      "runtime": 81,
      "movieId": 128241,
      "title": "The Borrowers",
      "mpaa": "",
      "actors": [
         "Eddie Albert",
         "Judith Anderson",
         "Tammy Grimes",
         "Beatrice Straight",
         "Barnard Hughes",
         "Dennis Larson"
      ],
      "imdbMovieId": "0069817",
      "originalTitle": "The Borrowers",
      "genres": [
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["EIQ1qJfUoMk"],
      "plotSummary": "An eight-year-old boy discovers a family of tiny people, only a few inches tall, living beneath the floorboards of a Victorian country home.",
      "tmdbMovieId": 110227,
      "avgRating": 0.5,
      "releaseYear": "1973",
      "numRatings": 1,
      "posterPath": "/jvjAbpYrB3JPQraolZ8Bpebc4LU.jpg"
   }
}