{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "guardian angel",
         "id": 184559
      }],
      "imdb_id": "tt0089265",
      "video": false,
      "title": "The Heavenly Kid",
      "recommendations": [
         40752,
         30467,
         35371,
         317953,
         76297,
         112969,
         238622,
         200580,
         21959,
         61702,
         61418,
         25088,
         117553,
         53027,
         31546,
         30296,
         30049,
         2348,
         32013,
         257442
      ],
      "backdrop_path": "/t6j5cQUjla2ehHD1zsTPM7WEYCK.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bobby Fantana",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e0231c9",
               "name": "Lewis Smith",
               "profile_path": "/6kBdu6PCpEZ0U2FeGm9PFMuLmgL.jpg",
               "id": 36041,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lenny Barnes",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e0231cd",
               "name": "Jason Gedrick",
               "profile_path": "/mTaV9lBl4GYy2Mjs2l6xEkjoCKX.jpg",
               "id": 48012,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Emily Barnes",
               "gender": 1,
               "credit_id": "52fe4470c3a368484e0231d1",
               "name": "Jane Kaczmarek",
               "profile_path": "/s03JyfEdklnzXsgC8dFop9FuL00.jpg",
               "id": 27725,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rafferty",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e0231d5",
               "name": "Richard Mulligan",
               "profile_path": "/8WhTCXvnAZgfOMQJEZK7DFJcJJI.jpg",
               "id": 58661,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Joe Barnes",
               "gender": 2,
               "credit_id": "52fe4470c3a368484e0231df",
               "name": "Mark Metcalf",
               "profile_path": "/qjxCggGQH99OkXjDxm33QPIJZcl.jpg",
               "id": 55194,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Melissa",
               "gender": 1,
               "credit_id": "52fe4470c3a368484e0231e3",
               "name": "Nancy Valen",
               "profile_path": "/4Z8j3v767vS6R0PqqA2xMhPcZEr.jpg",
               "id": 105197,
               "order": 5
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4470c3a368484e0231db",
            "name": "Cary Medoway",
            "profile_path": null,
            "id": 994095,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.606654,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23614,
      "vote_count": 23,
      "budget": 0,
      "overview": "When Bobby dies in a car accident he is not allowed to enter heaven but has to stay in one of the lower levels until he has worked enough as an guardian angel in order to deserve paradise. One of his jobs is Lenny, a gifted boy, who loves his schoolmate Sharon who is the most beautiful girl of the class. But she does not even notice him so that he is about to commit suicide. Bobby prevents this and dresses Lenny up making him a playboy and tough guy so that he gets what he wants although Bobby knows that this is not the best. Thinking that his job is done, Bobby realizes that Lenny's mother is his former girlfriend who has married another guy. Although not being allowed he makes himself visible to her...",
      "similar": [
         1585,
         5994,
         11352,
         26525,
         24811,
         127750,
         103711,
         461092,
         43498,
         450105,
         73474,
         97659
      ],
      "original_title": "The Heavenly Kid",
      "runtime": 90,
      "poster_path": "/yn4ri4OJI29M6wvn2ziXhHd8EuX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Engelberg-Sumner-Cheikes",
         "id": 11094,
         "origin_country": ""
      }],
      "release_date": "1985-07-26",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Thou shalt be cool!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cary Medoway"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Cary Medoway",
         "Martin Copeland"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089265/",
      "coverLink": null,
      "actors": [
         "Lewis Smith",
         "Jason Gedrick",
         "Jane Kaczmarek"
      ],
      "reviews": [
         "I have loaned this to my friends (and their kids) of many ages and all have really enjoyed it. The sketch about the \"spazola\" had me in stitches although not politically correct these days Also, catch a look at Richard Mulligan as Rafferty (the man from \"Soap\" I'm told) I believe this film is very underrated but Sadly it is seldom seen on English TV apart from occasionally on Sky. However, should you ever get a chance to watch it...I would thoroughly recommend it ! It has sadness, humour, sex (A little), comedy and a story which is more than a lot of films these days. And..... The whole family can sit down together and enjoy it",
         "Basically this movie is about a guy that ends up dying way too young from a car crash. In order for him to get into heaven, he has to help out a teenager with certain things. I don't want to go too far into it b/c I don't want to risk spoiling it for anyone who hasn't seen it. Looking back at it now, it's a little aged but no matter how many times I've seen it, I still laugh at this movie. I know that it's quite predictable at times, especially after you've watched other movies with similiar plots/scripts. But it's still one of those films that I watch e every time I see it on cable. :) Good family movie that can bring up some laughter in the process.",
         "I have two sons who have watched this movie over and over. I enjoyed watching it with them. Even their dad watched it and enjoyed it. Yes, it is a family movie - If you are looking for a good movie that leaves you feeling good, this is it. The actors are excellent - WE JUST ENJOYED IT! Thanks.",
         "There were a lot of great flicks that came out in the mid to late 80s. Many of them (most directed by John Hughes) went down as classics. Others were overlooked and underrated. Some became sleeper hits (John Cusack flicks) and still get heavy play in my VCR, especially during the Summer. \"Heavenly Kid\", however, is one of my faves that not too many people have heard of. It's a pretty straight forward story that could have been lifeless, but struck an emotional chord with me due to the acting and the sentimental value of the whole thing. It's also a great father-son story done from a different and original take. Bobby is your typical badass, black leather jacket wearing, cigarette smoking, drag racing, babe magnet who is killed in a game of chicken. This happens within the first five minutes of the movie and the next thing you know, Bobby is on the train to heaven. Upon getting there, he's presented with a small problem. They won't let him in unless he plays guardian angel and gets his wings. So it's back to earth for Bobby. He's sent back approximately seventeen years later to help a young geek get his life straight and to give the kid a little self-esteem. This is a wholly enjoyable film that anyone can enjoy. Although, some may complain that the ending is predicatable, they would be disappointed if it ended any other way.",
         "Bobby, a hotshot high-schooler from the 60s, ends up in the 80s to coach a dweebie kid into being a more confident, popular guy. I cant tell you how Bobby got there as it would spoil one of the films more dramatic moments, but I can say you should enjoy all the scenes dealing with his tutoring of Gedrick. He gives him a better look, hot wheels, and a little toughness to stand up to the jerks at school. Its executed pretty well and the pair make a good mismatch. The film also does a nice job when it has to be dramatic, as when Bobby has to deal with a few surprises. The ending is perfectly heartfelt without going over the line into sappiness as well. Great soundtrack, too, with a lot of nicely placed (though all unknown) songs to accentuate the scenes. A teen 80s film that got lost in the mix of so many of them, this belongs on the list of the good ones.",
         "It is unfortunate that \"The Heavenly Kid\" became lost under the vast muddle of slick teen comedies that were so rampant during the mid 1980's. This film, which has a pre-\"Malcolm In The Middle\" Jane Kaczmarek, \"Animal House's\" Mark Metcalf, \"Backdraft's\" Jason Gedrick, and veteran actor Richard Mulligan, really shined through for me as an entertaining (yet predictable) dramedy on guardian angels. It is the story of a brash 1960's greaser named Bobby Fantana, amiably played by TV actor Lewis Smith, who meets an untimely demise in a drag race accident. Once transported into the Afterlife, Bobby teams up with his roguish, motorcycle-driving spectral mentor Rafferty (Mulligan) and discovers from him that he hasn't quite earned his right into Paradise, and the only way he can redeem himself is to undertake an earthly assignment in assisting the mortals. Fast forwarding to the 1980's, Bobby is given the dubious task of coaching Lenny Barnes (Gedrick), a gifted, gawky teen who is a popular target for the class bullies. It's up to him to befriend and guide the boy through his little life crisis, and he decides to transform Lenny into a cool, confident splitting-image of himself that soon gains the attention of his peers. All is fine until Lenny's newfound cockiness butts heads with his family and with two of his old tormentors, who finally challenge him to a drag race of their own. It's then up to Bobby to rectify the damage he has unintentionally done and save Lenny from repeating history while hopefully garnering his wings at last. Although many critics have scathed this film for a rather shallow, loopholed storyline, \"The Heavenly Kid\" does exude some attributes that I have come to enjoy over the years. The soundtrack is one of the best I've heard for an 80's teen flick; just love \"Out on the Edge\" during Bobby's fatal racing scene. Lewis Smith's performance gives a uniquely genial quality to his loner character that makes a sometimes funny \"Odd-Couplesque\" persona with both Gedrick and Mulligan. Seeing Bobby acclimate to the radically different 80's pop culture brings a laugh or two to myself! Finally, even though the ending is entirely predictable, it always leaves me feeling good inside, even on a bleak, rainy Saturday. It is also unfortunate that \"The Heavenly Kid\" has gone out-of-print in recent years! I was lucky enough to record it off of HBO this past summer for my collection, but I think it does deserve a chance for a VHS/DVD re-release. This is one comedy that the entire family can enjoy, provided there's no objection to some PG-13 based language and adult humor.",
         "This film is an unknown classic. I caught it one time on vacation and rented promptly afterwards. Sure, it has a few plot holes here and there, but please-what movie doesn't? Seriously, has anybody looked at the \"goofs\" section for other movies? Come on! It's a teen movie which should have been released in this day and age...my generation would appreciate it much more. My friends and I were rolling on the floor during such parts as *spoiler* when Bobby and Lenny get high, or when Lenny thinks he's so studly after he's \"scored\". There are also sweet moments when *spoiler* Bobby reunites with his old girlfriend Emily (he died in a car crash in the '60s and has come back as an angel to protect Lenny so he can get into heaven...not exactly on the line with my beliefs...but anyways) who is Lenny's mom...and we find out later *spoiler* that Bobby is Lenny's dad. Very cute-Bobby is willing to go \"downtown\" (Hell) for his son...it shows true character and heartfelt love. Beautiful soundtrack, beautiful plot, beautiful movie.",
         "I felt that it was clean, non violent and after all it was for family so it was nice to see it was catered in that direction. Taught the children to look out for others. I feel children learn a great deal off movies etc and by making good movies like this one it does make a difference to our children. The humour was great, and I think they choose well in the people that they had playing the roles. It didn't target any religion, it was opened minded so it was enjoyed by all, It is good to have movies back in the past to help you remember those good times and fun times. The movie made you look at yourself and wonder what you were really doing. An Excellent movie all round.",
         "A kid (Lewis Smith) from the late-1960s (who appears to be from the 1950s due to his antics and wardrobe) dies one night in a chicken car race. He is unable to get into Heaven though because of his life on Earth so thus he goes back to the 1980s and tries to help a dorky high school student (Jason Gedrick) become popular and cool. Also along for the ride is Gedrick's mother/Lewis' old girlfriend (Jane Kaczmarek of \"Malcolm in the Middle\" fame) and motorcycle-riding guardian angel Richard Mulligan. So many plot holes and predictable twists stall this one pretty fast. Smith and Mulligan do what they can together, but they have elementary-styled aspects of film-making to work with. Everything else is not worth your time or effort. Not the worst film of the time period, but another one of those unwanted footnotes from the mid-1980s. 2 stars out of 5.",
         "... you might enjoy the location, as it was filmed there! If I remember correctly, the film was shot over the summer of 1984 at the school. Noticeable is part of the main hallway, one of the classrooms in the main hallway near the east entrance (the few with windows - most of the remaining classrooms had them removed) and the dreaded cafeteria. In the background there's familiar posters and signs from the era: the \"SKATEBOARDING USA\" sign honors Mr. David Hudak, one of the school's English teachers and the 'Pioneer Regiment' is the name of the school marching band. Contrary to popular belief, the school wasn't painted pink for the film, it was done afterward.",
         "One of the best moments in the film is both times when Bobby is in the car about to run over the cliff, where he shouts his infamous \"Oh Sh..!\" catchphrase, adding hilarity to what would usually be considered a tragic situation. I think the movie is one of the classics of the 80s, from the cheesy special effects to the even cheesier dialogue. But it has a good lesson in the end, even though it is curtailed by endless attempts at visual amazement. The actress who plays Bobby's love interest doesn't seem to age a day from the first scene to the last, which supposedly takes place over at least 17 years. Even funnier is how the entire handcuff scene and locked door scene during the races are never explained. Grade A storytelling!",
         "The Heavenly Kid is poorly written, poorly acted, has bad effects and the cheesiest soundtrack of all time. However, it's always hilarious. The scene in which Jason Gedrick tries on various outfits always gets me laughing. This film is so bad, it's great.",
         "Nothing earth shattering here. Still, this is a cute film about an early sixties era teen, sent to the eighties to help out an unhip schoolboy. Twists and turns, plus some good moral lessons make this film work. If you look close, you can also find a key figure from the movie, \"Animal House.\"",
         "I'm glued to the TV every time I'm lucky enough to catch this gem on cable. I've never caught this whole movie on TV, always somewhere in the middle and every time it captivated me. Did a little research and finally found out the name and now I'm going to buy the DVD. I mean, what can be better than an angel who drinks beer, smokes cigars and tries to teach an awkward kid how to be cool? The angel is a riot, kind of like a cross between Eddie Haskell and Fonzie. Rafferty is awesome too (the older guy from Soap who oversees the cool angel earning his wings) is a blast. There's a message in this movie as well, as the angel tries to teach the kid what is important in life. You can't beat this movie, guaranteed you will never forget it. Even look at the reviews of people who didn't like this movie, some said they couldn't stop watching in spite of not liking it. What's that tell you? Awesome heartwarming comedy, don't miss it.",
         "A Fonzy like character dies in his the peak of life, you assume is he not much beyond a teen when he dies in a game of chicken. He sits on a train going nowhere for 16 to 18 years, and then gets his chance to redeem himself by helping a gawky kid named Lenny. His 'help' is not exactly helpful all the time, he does save his life, but then gets Lenny to do some not so 'heavenly' things while giving him a bit too much confidence for his own good. There are some lessons to be learned and a moral of sorts in a bit of a warped way. There are some totally goofy moments, and a few touching ones, but not bad for a low budget 80s movie. They were all a bit goofy in those days. Raferty is hilarious!",
         "Who thought Lewis Smith back then looked hot as a greaser?! I know I do, he was just gorgeous! Too bad he is older now but what the heck, he is just a legend in this! I was so happy to see Jane Kaczmarek being involved in this, I haven't seen her appear in ages since she was Lois in the hit TV show \"Malcolm in the Middle\". I will always remember her as the shouting mum, I know well she ain't, she is like literally sweet and of course, she probably is! Anyways I thought Jason Gedrick looked too baby faced as a greaser but he looked good at the same time! At least he got the girl who really means so much to him which was Melissa. They were so totally meant for each other. It was too bad his father isn't with Emily in the end but at least it was a happy ending that the lovebirds reunited! I love the fact this movie is a 50's/80's crosser and that it was genuinely funny. This will definitely become an absolute favorite of mine!",
         "I'm a fan of 80's movies and The Heavenly Kid was a nice yet charming story filled with emotion, drama and just the right touch of romance added to it. The story is about a a teenage rebel who died in a car accident in the late 60's and is sent down to earth in the 80's on a mission to help a nerdy young man and gain his entrance into heaven. Lewis Smith was perfect as Bobby Fantana he played the part of a rebellious greaser very well. During the film his character discovers quite a few surprises along the way and learns the importance of sacrifice and getting a second chance. Jane Kaczmarek in her days before Malcolm In The Middle was well casted as Bobby's former girlfriend Emily and the mother of the young lad he was sent to help. In the 1960's Bobby Fantana (Smith) is a rebellious, greaser with attitude who challenges Joe Barnes(Metcalf) to a game of chicken after he made a pass at his girlfriend Emily. Bobby wins the race but unfortunately isn't able to get out of the car in time and dies in an explosion. 17 to 18 years later he's given an assignment and that is to help an awkward kid become more confident aiding him in the job is his guide Rafferty (Mulligan). Once on earth he meets his project who turns out to be geeky Lenny Barnes (Gedrick) a teen in love with a popular girl named Sharon. Soon enough Bobby begins working his magic and the once shy young man becomes more confident and cool.However with this newfound coolness Lenny becomes cockier and defiant towards friends and family. During the course of the story Bobby discovers that Lenny's mom is his former girlfriend and that she's married to Joe his old rival. There is a scene where he makes himself visible to Emily and they spend a nice night out reminiscing and then she drops the biggest bombshell of all Bobby is Lenny's father. Trouble soon arises when Rafferty informs him that Lenny is going to die in the same manner as he did, it's then that Bobby learns about the true meaning of love and sacrifice when he decides to give up his soul in order to prevent his son's death. Filled with nice music and a good ending The Heavenly Kid is a pleasant surprise for anyone who deserves another chance at life.",
         "First off, learn how TO spell------in the way that you used it, it is 'to' not 'too'----also, regardless of being able to enjoy a film for pure entertainment value or actually looking at a film's script, direction, etc., this one (Heavenly Kid) was just plain horrible! Being a 'movieminister' I think you should watch this one again. It had a lot of potential, the plot was primary and the acting was below local live theater quality, but it had moments of endearing cuteness. But, overall, there is good reason why it has become lost in the shelves of even the most sub-par video stores. Of course there has been many good little movies that have suffered such a fate. But, this one's fate is well deserved. Everyone has their guilty pleasure movies that they think were great for one reason or another. But, to say that panning this movie for bad script, etc. is (I think the word you used was--)'ridiculous' is just plain silly and one sided. Some people can enjoy a movie for pure entertainment value and still look at it in a critical way----there is nothing 'ridiculous' about that.",
         "This is an 80's comedy that was released exactly the same time Back To The Future was released in the summer of 1985. Back to the Future was enormously more successful than Heavenly Kid not for conceptual reasons, but Back to the Future had better supporting cast, better lead characters and was gifted with a better screenplay. In fact you can ask anyone over 40 today about Back to the Future and 9/10 would remember the popularity of Back to the Future while I am certain that 1/10 of them would recall The Heavenly Kid. It was basically a Box Office bomb. Although Heavenly Kid suffers from corny and cheesy clichés whilst having an inferior cast of actors I cannot help but have a strong sentiment attached to it. It has a very sweet and altruistic message of love and sacrifice while earning salvation through the main character. The theme here is actually more deep and profound than Back to the Future, so I think it's inferior popularity begs the question as to why this is so. Heavenly Kid suffers from a lack elementary directing skills, a satisfying script and perhaps some realistic twists. Technical merit and acting is not top notch here and these few deficiencies contribute to its inferiority compared to its better contemporary. It is important for every serious movie reviewer to analyze movies with similar themes in order to decode what went wrong for the poorer of the two. The story begins in the early 1960's where a group of youths are meeting near a cliff to watch two adversaries duel in a game of chicken to settle their differences. As we think our hero, Bobby, has won the match he gets his jacket sleeve caught in the gear shifter - (In typical fashion reminiscent of Rebel without a Cause. His car plunges down a cliff where it explodes into his demise. The following scenes are set in a Limbo-esque environment where he is unsure where he is. He meets with Rafferty, perfectly played by Richard Mulligan. Rafferty is sort of his Liaison who will guide him from Limbo to heaven. This is sort of a meet-cute where we have an experienced and crusty old man teaching the young and rebellious kid about how to earn his wings and seek redemption. Richard Mulligan has never been better and he is perfectly comfortable in this role as a no nonsense mentor. He explains to Bobby that his job is to help another person. But Bobby is not very sophisticated or intelligent to understand what this entails. At first this gets over his greasy haired head. Bobby is to help a weak and wimpy teenager named Lenny who gets picked on by a couple of bullies at school. Lenny has that typical aggravating existence of insecurity where he gets little respect and cannot muster enough self-confidence to defend himself. Bobby is the polar opposite of Lenny in Character. He's slimy, confident, tough as nails, stronger than an ox and is as manly as they come. When Bobby observes Lenny and learns that this will be his assignment he is not too keen on the idea, but would rather go through than settle for the alternative. While Lenny is reading a poem near a cliff he unexpectedly loses his balance and the clumsy kid plummets about a 100 feet until this strange guy, Bobby, catches the clumsy Lenny in his arms. Bobby makes a wry comment about how the kid should be careful. As Lenny's limp body is cradled in Bobby's arms he precariously opens his eyes to see what has happened. Befuddled by this stranger's sudden appearance and incredible strength, he regains composure. Bobby plants Lenny back on his feet and walks off as the kid thanks him. Bobby thinks this is the extent of his assignment, but Rafferty doesn't let Bobby earn the prize so easily. His job is to inspire confidence in this insecure and wimpy teenager. You can pretty much guess at this point where the movie is headed. The rest of the film combines a mixture of mildly crude and scatological humor while also being corny. The parents always appear to be your typical parents of 80's movies. The cute girls are always flirtatious and suggest a propensity to sex more than girls in reality are. The Heavenly Kid is actually pretty stupid at times with its silly themes, but the story redeems itself in the final 20 minutes where our lead character chooses to save his friend's life instead of saving his soul - the ultimate expression of loyalty and friendship. Lenny does become more popular with the girls as a result of changing his dress and attitude, courtesy of Bobby's mentoring. But Lenny only changes his façade. He lacks the toughness and strength to defend himself against physical fights. He relies on Bobby's toughness and fighting strengths to save his life and protect him in fights. Bobby, in essence, acts as his Guardian angel, bodyguard, mentor and fiend. In the climax, it's Bobby who learns the most about himself and that sometimes being tough and acting cool is not enough in life.",
         "beautiful film,very nice. Flight of navigator 6.6 In this place there are two weights and two measure As to the usual one, the usual negative comments which talk about a classical film some years 80 which everyone does not like it to the nostalgic ones are met.Sure Heros that this film had to have a judgment in this site. In fact reviewers' good part has put a high vote to the previous episodes. Because this contrast? I know the reason. Since assumptive reviewers' good part favorably sees the past and as the past is \"better\" than the present they have given several credit to the preceding episodes being still the last episode more explosive and spectacular. At this point should reject also the old episodes but there are here two weights and two measure.In fact also cinema masterpieces have been criticized and denigrated. Good part some reviewers of this site belong to the very bad reviewers. Better think separately with its head. In this place the films of the 80'years are hated.",
         "Heavenly Kid, The (1985) *** (out of 4) Rebel Without a Cause and It's a Wonderful Life meet the 80s teen comedy in this film which is certainly very bad but I've enjoyed it for many years now. The film starts off in the late 1960's as the rebel (Lewis Smith) gets killed in a chicken race. Fast forward to the present day and the rebel must do a good deed before he can enter Heaven. That good deed just happens to be taking a dork (Jason Gedrick) and turning him into a winner. Everything about this film is rather campy and corny but I've been a fan of this film since I was a little kid and caught it on some station that I can't remember now. This was my first time watching the movie in at least ten years and I must say it did contain that nostalgic feel and I still enjoyed it. The film has some of the dumbest lines but they made me laugh. The story is stupid but it's still funny. The performances are all one note but I've always felt Lewis Smith was very funny because he's playing someone cool yet he really doesn't come off too cool.",
         "This movie sucked in more ways than I can say. OK. It's not that bad. Wait yes it was. It was awful. How many times do we need to see this plot. Dead guy turns angel to help others, only he does things his way and learns lesson that his way is the wrong way, and the kid is more than just some random kid. Ohhh. Didn't see that one coming. Brother. 1.5/10 try and miss this flick. I was stuck in a hotel with a brother in law that likes this crap.",
         "Truly terrible 80s teen flick about a greaser from the 60s (Lewis Smith) dying in a car crash. To get into heaven he has to help this total nerd (Jason Gedrick) in the 80s to become a stud. The plot is totally predictable, the humor is either childish or PG-13 raunchy and the acting truly sucks. But...this movie was so incredibly bad I couldn't stop watching! Smith's acting is so terrible it's actually fascinating to watch. Gedrick (a very good actor) is totally miscast and the poor guy looks embarrassed for most of the movie. In small roles Jane Kaczmarek and Richard Mulligan shine...but it's not enough to save this. The script is beyond belief--it has such ridiculous twists and turns that I actually thought they were kidding! Cliches that were being laughed out of theatres in the 1950s are dredged up and presented with straight-faced sincerity. Seriously, did the screenwriters REALLY think this was a clever funny little movie? Did they really think throwing old, hoary cliched situations at the audience was a good idea? SPOILER AHEAD!!!! I almost stopped watching when it was revealed that Gedrick's mother was Smith's lover in the past. Come on! We're really supposed to take that seriously? It's just a prime example of lazy script writing. SPOILER OVER!!!! Worth seeing as a prime example of how NOT to do a teen comedy. This was a huge bomb in 1985--it's easy to see why. I'd love to know what Gedrick and Smith think of this film now.",
         "See, there's this kid who recreates the drag racing scene from Rebel Without A Cause, decked out in leather jacket, rolled up denim jeans, and slicked back hair. All his buddies wear stereotypical late 50s outfits and he LOVES Elvis. The first piece of music we hear is Jerry Lee Lewis' \"Whole Lotta Shakin' Goin' On\". Unfortunately for our hero (and for us, the discriminating filmgoer) he dies in a fiery wreck. Suddenly his soul is transported to the present day (1985!) where he must help a hapless teen score with the ladies. (SPOILER ALERT) Only the hapless teen turns out to be our hero's real life son! Much hugging ensues! Let's back up. Our hapless teen is still in high school, so let's assume that he's no more than 18 years old. This would put his birthdate somewhere in the region of, er, 1967 AT THE EARLIEST. And yet his true father seems to have died about ten years earlier! The whole premise of this film collapses like a flimsy deck of cards. Even if you overlook the logical flaws of the film, it's a stinker. Maudlin and manipulative, it also features one of the worst '80s big hair' soundtracks you're likely to run across."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Engelberg-Sumner-Cheikes"],
      "summaries": [
         "When Bobby dies in a car accident he is not allowed to enter heaven but has to stay in one of the lower levels until he has worked enough as an guardian angel in order to deserve paradise. He is first given an assignment of helping a young kid named Lenny, who later Bobby founds out is his son. Lenny has a crush for a girl named Sharon who is the most beautiful girl of the class. But she does not even notice him until Bobby helps Lenny change his image and boosts his confidence. By doing this Bobby dresses Lenny up making him a playboy and tough guy so that he gets what he wants although Bobby knows that this is not the best. Bobby later realizes that Lenny's mother is his former girlfriend who has married another guy. Although not being allowed he makes himself visible to her... after some situations take place he vows to give his soul up to help his son from losing his own life. This unknowingly earns Bobby a trip to Heaven or \"uptown\" as the movie refers to it.",
         "After revealing himself to his former girlfriend, he learns that Lenny is actually his son that his girlfriend was pregnant with when he died. Expecting to be sent to hell for breaking the rules he then learns he gets into heaven for his selfless act.",
         "A hip guardian angel named Bobby Fontana, who died in a car race in the 60s, reluctantly agrees to watch over lonely 80s high schooler Lenny Barnes who needs guidance on how to become cool."
      ],
      "budget": 0
   },
   "movielensId": 128251,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-07-26",
      "dvdReleaseDate": null,
      "directors": ["Cary Medoway"],
      "runtime": 90,
      "movieId": 128251,
      "title": "The Heavenly Kid",
      "mpaa": "PG-13",
      "actors": [
         "Lewis Smith",
         "Jason Gedrick",
         "Jane Kaczmarek",
         "Richard Mulligan",
         "Mark Metcalf",
         "Nancy Valen"
      ],
      "imdbMovieId": "0089265",
      "originalTitle": "The Heavenly Kid",
      "genres": [
         "Fantasy",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["La-H5mQbj9g"],
      "plotSummary": "When Bobby dies in a car accident he is not allowed to enter heaven but has to stay in one of the lower levels until he has worked enough as an guardian angel in order to deserve paradise. One of his jobs is Lenny, a gifted boy, who loves his schoolmate Sharon who is the most beautiful girl of the class. But she does not even notice him so that he is about to commit suicide. Bobby prevents this and dresses Lenny up making him a playboy and tough guy so that he gets what he wants although Bobby knows that this is not the best. Thinking that his job is done, Bobby realizes that Lenny's mother is his former girlfriend who has married another guy. Although not being allowed he makes himself visible to her...",
      "tmdbMovieId": 23614,
      "avgRating": 3.15385,
      "releaseYear": "1985",
      "numRatings": 13,
      "posterPath": "/yn4ri4OJI29M6wvn2ziXhHd8EuX.jpg"
   }
}