{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2405862",
      "video": false,
      "title": "Closure",
      "recommendations": [],
      "backdrop_path": "/1xOxQyFSftMsLbB9RLVorCwbeWq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "as herself",
            "gender": 0,
            "credit_id": "53da7b5ec3a3687293000026",
            "name": "Angela Tucker",
            "profile_path": null,
            "id": 1348144,
            "order": 1
         }],
         "crew": [{
            "gender": 0,
            "credit_id": "53da7a45c3a36872a6000016",
            "name": "Bryan Tucker",
            "profile_path": null,
            "id": 1348142,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.06075,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 284568,
      "vote_count": 1,
      "budget": 0,
      "overview": "A documentary about a trans-racial adoptee who finds her birth mother, and meets the rest of a family who didn't know she existed, including her birth father.  A story about identity, the complexities of trans-racial adoption, and most importantly, CLOSURE.",
      "similar": [],
      "original_title": "Closure",
      "runtime": 76,
      "poster_path": "/xULl8qJ3aMe8P7MTZMCWYdzBmwr.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-12-01",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "A documentary about adoption.",
      "adult": false,
      "homepage": "http://closuredocumentary.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bryan Tucker"],
      "runtime": 76,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2405862/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2NzI5MzYyNF5BMl5BanBnXkFtZTgwMTk0Mzk2MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Angela Tucker | See full cast and crew »"],
      "reviews": [
         "If they did it might eradicate much of racial discrimination, misunderstandings. I absolutely loved this film and was in tears through most of it. My own family has become multi racial through, adoption, marriage and birth. First who would not love Angela with her wonderfully mobile face? Her enthusiasm, sensitivity, talents and intelligence. All of the people were lovely (and flawed too) and kudos to her husband who so fairly must have edited many hours of film to get this story told so concisely and yet so fully. This made me feel really proud of my country. That we can learn and change, that basically people are good are willing to experience different ways of thinking. When I say all of Angela's family were lovely, I mean in their willingness to bond over this one person whom they all love, I don't mean that individually they did not have faults, that obviously is so, more so in some cases than in others. But as adoptive mother, Theresa says this is not the place to dwell on faults, this is a place to come together in acceptance and love. This movie has this in abundance.",
         "This is an excellent documentary on adoption. It's rare to see all perspectives sensitively handled this way - the adoptive parents, biological parents, and most importantly, the adopted child herself (now an adult). Not to give anything away, but it took a lot of courage on all sides to allow a lot of what's seen in this film, as it's perspective we rarely see, particularly with trans-racial adoptions. It's easy for people to make negative assumptions and value judgments when they see racially blended families, as unfortunately, things don't always turn out well culturally. But, again, without giving anything away, this film, is so refreshingly honest that I was deeply moved. I Highly recommend it!",
         "I watched it twice. First, after a long night of insomnia. Second, 2 days later w my husband, who thanked me afterward for sharing the movie w him. Every part of this documentary keeps you riveted to the screen and we loved sharing the journey. I've always said that the BEST documentary I have ever watched (my brother and hubby agree) is the one about John Walsh from America's Most Wanted. My brother and I held hands through parts of it, crying and saluting his courage and bravery. But, now I have 2 favorite documentaries and am thankful for it. BRAVO Bryan and Angela and super big hugs to their (now) super big family! Oh, we downloaded 4 songs from the movie. Yes, very well done, indeed!",
         "I\"m very picky, but when I find something excellent, I let people know. This documentary is truly excellent. The filmmaker captures people effectively with a variety of styles. The video isn't always perfect, but it captures the real emotions and tells the story with subtle elegance. This is a very moving and very well told story about a very special couple who adopt a menagerie that seems to exceed that of Ben Affleck and Angelina Jolie's brood. One of their adopted clan decides she wants to learn more about her biological roots and begins a quest to find her birth parents. Beyond probability she succeeds thanks to a variety of seeming coincidences. But what does she find? Will her biological parents be happy to see her, or will her search result in a fresh rejection?",
         "A trans-racial adoptee finds her birth mother, and meets the rest of a family who did not know she existed, including her birth father. A story about identity, the complexities of trans-racial adoption, and most importantly, closure. Although I cannot say the topic of adoption is particularly interesting to me, the topic of roots is. Family history is important, at least to me, and this film combined both. It talked of the adopting parents, the biological family, the other kids in the home. It had that element of mixed race (though, like the mother said, the kids are just \"people\" and not a certain race beyond \"human\"). For those who have adopted or were adopted, this probably has even deeper meaning and emotional impact. Great work.",
         "I was very impressed by this little documentary with a big subject. Angela Tucker is a 20-something African-American woman raised by white parents who goes in search of her birth mother, and finds a huge family that didn't know she existed. I think part of what impressed me with this film was how little the race issue came up in spite of it being ever-so-present, which I think kinda says something about how far we've come as a nation with race relations. Angela's well-being was the top issue for both her adoptive white parents and African-American birth mother and father, in spite of the color or culture of her environment. And kudos to her family (both adopted and birth) and husband (the director of the film I believe-?) for being so supportive. We all should be so lucky to have so many people in our lives that care about us. And just a heads-up: have some Kleenex nearby when watching this... ;)",
         "Adoption, even in its most perfect form, is rooted in a painful decision. For the biological mother the painful choice to give up a child and for the adoptee the pain of knowing someone gave you away. The process of reunion can be tricky. The pain of the adoption is often buried beneath decades of secrets, lies, and shame. The Tucker family does a superb job of showing the loving nature of adoption and the complex process of reunion. The pain that is inherent with adoption never goes away, but reunion can provide closure. CLOSURE is as close as one can get to going through the adoption reunion process without going through it yourself. Bravo Tuckers!"
      ],
      "genres": [
         "Documentary",
         "Adventure",
         "Biography",
         "Drama"
      ],
      "productionCompanies": [],
      "summaries": ["A trans-racial adoptee finds her birth mother, and meets the rest of a family who did not know she existed, including her birth father. A story about identity, the complexities of trans-racial adoption, and most importantly, closure."],
      "budget": 0
   },
   "movielensId": 128740,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-12-01",
      "dvdReleaseDate": null,
      "directors": ["Bryan Tucker"],
      "runtime": 76,
      "movieId": 128740,
      "title": "Closure",
      "mpaa": "",
      "actors": ["Angela Tucker"],
      "imdbMovieId": "2405862",
      "originalTitle": "Closure",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["g__N9YW78XU"],
      "plotSummary": "A documentary about a trans-racial adoptee who finds her birth mother, and meets the rest of a family who didn't know she existed, including her birth father.  A story about identity, the complexities of trans-racial adoption, and most importantly, CLOSURE.",
      "tmdbMovieId": 284568,
      "avgRating": 3.5,
      "releaseYear": "2013",
      "numRatings": 2,
      "posterPath": "/xULl8qJ3aMe8P7MTZMCWYdzBmwr.jpg"
   }
}