{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0078792",
      "video": false,
      "title": "Arabian Adventure",
      "recommendations": [
         60481,
         25728,
         68338,
         38293,
         35139,
         5065
      ],
      "backdrop_path": "/k5piL4jyAvTfhhqmb5gxaO3HHb9.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "587119cec3a3684f2300ae25",
         "content": "The Rose Of Arabia.\r\n\r\nArabian Adventure is directed by Kevin Connor and written by Brian Hayles. It stars Christopher Lee, Milo O'Shea, Oliver Tobias, Emma Samms and Puneet Sira. Music is by Ken Thorne and cinematography by Alan Hume.\r\n\r\nA prince is sent by an evil sorcerer (Lee) on a quest for a magical rose. Should he succeed, he hopes that as a reward he will win the hand of the princess.\r\n\r\nSometimes to moderately enjoy a film of this type, you just got to take yourself back to a time when simple children's adventure movies were made with simple film making techniques. This obviously doesn't hold up well these days, where even given the year it was made it was way behind advancements that were being made in special effects. Thus it's highly unlikely that the prepubescents of today would have the patience or care for such a production. Yet it doesn't lack for charm.\r\n\r\nIs charm enough? Well it's not a great or very good film, it's heavy on chatter, the effects are indeed a little crude, acting and accents are borderline dire, and it seems to take an age to get going, yet it's not insulting like many far bigger budget pictures have been: even nowadays! It's best just to roll with it, enjoy the whimsy and the many small roles by the likes of Peter Cushing, Mickey Rooney, Capucine and, erm, John Ratzenberger. \r\n\r\nForgettable once it's over, but harmless with it. 5/10",
         "url": "https://www.themoviedb.org/review/587119cec3a3684f2300ae25"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Caliph Alquazar",
               "gender": 2,
               "credit_id": "52fe48519251416c910880e1",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Wazir Al Wuzara",
               "gender": 2,
               "credit_id": "52fe48519251416c910880e5",
               "name": "Peter Cushing",
               "profile_path": "/1qtKVu16REL2YLVrhayjVey4al.jpg",
               "id": 5,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Daad El Shur",
               "gender": 0,
               "credit_id": "52fe48519251416c910880e9",
               "name": "Mickey Rooney",
               "profile_path": "/bgCm55k2eo2YV5bMn3D0O4NPwU.jpg",
               "id": 1937,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Prince Hasan",
               "gender": 2,
               "credit_id": "52fe48519251416c910880ed",
               "name": "Oliver Tobias",
               "profile_path": "/q2k817KtKit4yAUgdpdrS0NJPxm.jpg",
               "id": 24701,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Achmed",
               "gender": 2,
               "credit_id": "52fe48519251416c910880f1",
               "name": "John Ratzenberger",
               "profile_path": "/yGechiKWL6TJDfVE2KPSJYqdMsY.jpg",
               "id": 7907,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Khasim",
               "gender": 2,
               "credit_id": "54ad6b03c3a368536f000173",
               "name": "Milo O'Shea",
               "profile_path": "/axJwk4Mwj1ZBx09YE3Lu5qU0QkE.jpg",
               "id": 47137,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Princess Zuleira",
               "gender": 1,
               "credit_id": "54ad6b18c3a3682870000042",
               "name": "Emma Samms",
               "profile_path": "/dSkHW1DogK1DdvRN6YEb5HGvtvX.jpg",
               "id": 47901,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Majeed",
               "gender": 0,
               "credit_id": "54ad6b27c3a3687d080000e5",
               "name": "Puneet Sira",
               "profile_path": null,
               "id": 1060556,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Vahishta",
               "gender": 1,
               "credit_id": "54ad6b3ac3a36802f10000c0",
               "name": "Capucine",
               "profile_path": "/pGzEiXMc77pxXwhiH4j0vdb20IO.jpg",
               "id": 14262,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Bahloul",
               "gender": 2,
               "credit_id": "54ad6b5492514132a800006b",
               "name": "John Wyman",
               "profile_path": "/lGudB77HPoaaWJ2F7dP18b9BkxJ.jpg",
               "id": 10506,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Nubian",
               "gender": 2,
               "credit_id": "54ad6b6ac3a36802f10000c9",
               "name": "Roy Stewart",
               "profile_path": "/4b4vCgdVQLAghAWU785nuF0HVVv.jpg",
               "id": 1350577,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48519251416c910880dd",
               "name": "Kevin Connor",
               "profile_path": "/ke8acwv2T9YfIIwPqh5zJg7aBh5.jpg",
               "id": 95329,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48519251416c910880f7",
               "name": "Brian Hayles",
               "profile_path": null,
               "id": 105712,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.322856,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 82430,
      "vote_count": 9,
      "budget": 0,
      "overview": "An evil caliph (Christopher Lee) offers his daughter’s hand in marriage to a prince if he can complete a perilous quest for a magical rose. Helped by a young boy and a magic carpet, Prince Hasan (Oliver Tobias), has to overcome genies, fire breathing monsters and treacherous swamps to reach his prize and claim the hand of the Princess Zuleira (Emma Samms).",
      "similar": [],
      "original_title": "Arabian Adventure",
      "runtime": 98,
      "poster_path": "/w1BbWYBuOziFQM3Hik5PqkdWPCT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "EMI Films",
         "id": 8263,
         "origin_country": ""
      }],
      "release_date": "1979-07-08",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Soar into a Magical World of Action, Excitement and Enchantment!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Kevin Connor"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Brian Hayles"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078792/",
      "coverLink": null,
      "actors": [
         "Christopher Lee",
         "Milo O'Shea",
         "Oliver Tobias"
      ],
      "reviews": [
         "I saw this many years ago when it was first released, and though I thought the SFX were dated even for its time, I still enjoyed the film as a whole. The score was above average for a film like this, and the acting was respectably comic for the genre; kids'-adventure. Some familiar faces make their appearance; Ratzenbergger (Cliff from \"Cheers\"), legend Christopher Lee, Mickey Rooney, Emma Sams and more, adding an amusing and delightful bit of levity to the film. All in all it's an okay film for kids, but today's young ones may get somewhat impatient with some dated effects--notably some of the process shots and miniature work. Still, if I had a copy on DVD I'd most certainly add it to my collection. It's worth taking a look at with your kids on a rainy afternoon or lazy Sunday. Enjoy :-)",
         "This was a really nice rediscovery on UK DVD for me; I remember I've watched 'Arabian Adventure' on TV in the 1980s but not since then. I mean, you get flying carpets, jinns, belly-dancers, a beautiful princess to save and Christopher Lee as an evil wizard turning people into toads (\"You call yourself my servant?\") - what more could you ask for? 'Arabian Adventure' knows the genre standards and delivers. Lest I forget, fire-breathing metal monsters and Peter Cushing with a silly beard are in it as well. One has to admit that the limited budget shows in the set decoration, as the palace looks more like cardboard than marble, and then some effects like the superimposed jinn are rather TV quality than big screen. But fairy tales from 1001 Nights don't need realism that much, I found I could successfully switch into fantasy mode and simply enjoy it. It's an old-fashioned production like they did in the 1940s and 50s, maintaining the same naive charm and that's fine for such kind of things.",
         "Director Kevin Connor shot a nice movie for 4.000.000 US$: Arabian Adventure. If one keeps in mind that this film was produced a long time before CGI and for such a \"low\" budget (if one compares is with other ones), one could say that this film is really successful and a great fun to watch. The story is a simple fairy of Arabic nights and one night. A young hero loves the attractive daughter of a bad magician. To marry this young lady he has to find a talisman and bring it to the father of this princess. Some of his friends help him to do this job, but one of this \"helpers\" is a traitor. After a long journey, a lot of dangers and fights he marries his princes and everybody is happy ... The actors aren't that good, many of them haven't a lot of experience and in those days the stunts were not as successful as they are today. But all in all they were OK. If the team had the technical possibilities of today, the special effects would have been quiet good. But for those days, they were really successful. The set-design and the clothes were really very good. One can't say anything against them. I highly recommend this film to all fairy fans. The film keeps what the title promises, it's a real Arabian Adventure.",
         "I LOVE THIS MOVIE!!!...Yet I haven't been able to find a copy of it for years.. As a child I watched this movie constantly, esp' due to my love of LEE..And it has remained as a special movie to me. It seemed to be one of those movies back then, that was one of the newer 'style' movies in the late 70's (effects and stuff)..so back then i just loved it..It's a true fantasy!! I think most children would absolutly love this film..though if i saw it now, i'd proberly laugh at the effects! But no one i've met has ever heard of it..I think it's a hidden gem..hopefully not lost forever!!!",
         "Arabian Adventure is directed by Kevin Connor and written by Brian Hayles. It stars Christopher Lee, Milo O'Shea, Oliver Tobias, Emma Samms and Puneet Sira. Music is by Ken Thorne and cinematography by Alan Hume. A prince is sent by an evil sorcerer (Lee) on a quest for a magical rose. Should he succeed, he hopes that as a reward he will win the hand of the princess. Sometimes to moderately enjoy a film of this type, you just got to take yourself back to a time when simple children's adventure movies were made with simple film making techniques. This obviously doesn't hold up well these days, where even given the year it was made it was way behind advancements that were being made in special effects. Thus it's highly unlikely that the prepubescents of today would have the patience or care for such a production. Yet it doesn't lack for charm. Is charm enough? Well it's not a great or very good film, it's heavy on chatter, the effects are indeed a little crude, acting and accents are borderline dire, and it seems to take an age to get going, yet it's not insulting like many far bigger budget pictures have been: even nowadays! It's best just to roll with it, enjoy the whimsy and the many small roles by the likes of Peter Cushing, Mickey Rooney, Capucine and, erm, John Ratzenberger. Forgettable once it's over, but harmless with it. 5/10",
         "An unimaginative title is a pre-warning that this movie isn't much cop, and it even makes Kevin Connor's previous outings - which include the incredibly tacky AT THE EARTH'S CORE - look like Oscar contenders. A kiddie fantasy film full of stock characters, an overload of cheap effects work, poor comedy, and cardboard sets conspire to sink it from the start. I usually get a kick out of this genre, but everything is so by-the-book and unimaginative - did I mention cheap? - that it just doesn't offer up any interest whatsoever. Even the fight scenes are boring. The biggest disgrace is the waste of a good cast in this dull outing. Whoever decided to cast Milo O'Shea (THEATRE OF BLOOD) as an Irish Arab needs shooting, but that's just the start of the problems that plague this movie. Oliver Tobias (COBRA MISSION) is handsome but ineffectual as the leading man, his acting weak. Christopher Lee makes one of those embarrassing latter-day performances that plague his career (POLICE ACADEMY 7 anyone?) as the evil Sultan, Alquazar, but the film doesn't stretch his talents at all - instead he just looks bored, with silly headgear, a villain distinctly lacking in villainy. Elsewhere we have a bland love interest, an annoying cute Indian kid and his pet monkey, a before-he-was-famous appearance from Art Malik, and of course wasted turns from British character actors including Shane Rimmer. Even Peter Cushing puts in a cameo role as a prisoner (!), only two years after STAR WARS and he was reduced to this level - a sad state of affairs. The special effects are typically appalling, the nadir being the magic carpet rides which are achieved via some really poor and unconvincing back projection. There's supposed to be a \"chase\" between these carpets, but they move at a snail's pace so any excitement is non-existent. There's also a sandstorm in which people supposedly fly through the air but are instead suspended by really obvious wires and a giant genie which is just a bald overweight man with his face painted blue superimposed over the background. What the?! On the plus side, there's a cool scene in which three mechanical fire-breathing monsters appear over the top of a mountain range to menace our heroes like they're come from some Toho flick, some interesting matte work and good location scenery, and colour filters which give the setting an other-worldly look. Unfortunately these aren't enough; ARABIAN ADVENTURE is a waste of talent and money, and a sad reminder of the level British cinema had fallen to by 1979.",
         "I generally agree with most of the former reviews that Arabian Adventure is a cheaply-made, decently made story about a wicked sultan(I think) played with gusto by Christopher Lee who wants to basically take over the world. In order to do so he must gather some cheap-looking rose that is protected by three mechanical, very unconvincing robots that look like some kind of bizarre animals. The story is all over the place at times, little exposition or character depth is painted, and the acting is not great. Lee is good but knows what he is working with. We also get Milo O'Shea as his toadie...he hasn't much to work with either but is entertaining. Emma Samms plays a hidden princess and prize to whomever can retrieve the magical rose. She is beautiful if nothing else(and you get virtually nothing else from her!) Her \"boyfriend\" Oliver Tobias, on the other hand, as the hero is as wooden as they come. His acting range goes from 1 to 2. Capucine and Peter Cushing have cameos as does Mickey Rooney. The three are pleasant spots in this film. Cheer's John Ratzenberger plays one of Lee's henchman in an early performance, and he is very noticeable with his accent and look being very out-of-place in this film. The young boy with the monkey who befriends Tobias, gets a date(not the female or male variety but the fruit kind)(again I think) that turns into a magic non-red sapphire which houses a woman that grants him three life protecting wishes is played very nicely by Puneet Sira. He has some presence on film and a great \"little\" voice. Director Kevin Connor works well despite the budgetary concerns. some of the special effects, for 1979, are pretty decent. The flying carpet scenes are generally good. I liked the layout of Lee's labyrinth of evil, if you will, and thought the village scenes were nicely done too. Yes, the story is childish, the acting amateurish generally, and the production values less than stellar but Arabian Adventure has heart which is something you don't always get but should always expect when creative peoples get together to make art. It also is another film where Christopher Lee and Peter Cushing are together - though do not share a scene. I think the only film after this one where they are in the same film is House of Long Shadows.",
         "The film though done with a limited budget is a classic and the last of a kind we do not see anymore as I will explain. Before the 1970s Arabs and other nations of the Middle East were represented in an exotic and romantic manner with a curious interest of the areas culture in terms of the literature of the Arabian Nights classics and European accounts of the Classical Arab Empire. The film is well produced with a good cast especially Christopher Lee, Emma Samms and Oliver Tobias who can pass as Arabs and do a good representation and acting along with the rest of the costume and background setting of the film with protocol and respect. The story is interesting and takes its inspiration from the original stories that fascinated Europe with Arabic literature on its themes of adventure, mysticism and imaginative content looking for a rose along with good chemistry with the differing characters protagonist and antagonist. The film is not politically incorrect or prejudice rather it a fair and positive representation of Arabs and Muslims at their classical zenith that is entertaining and interesting. The minor faults i find with the film is the characters are slightly clichéd and in some parts it is cheesy that only targets a particular audience rather then a broad one. With the negative stereotyping of all things Middle Eastern in today's Films and Media this film deserves more credit and attention then is given.",
         "It's pretty fun but it's let down by its slowly paced (though still quite good) script, the less than stellar direction of Kevin Connor and its low budget look. The special effects were not terribly good by 1979 standards but I was more concerned with the cheap sets. I hoped that it would be as outrageously fun as Connor's previous film \"At the Earth's Core\" or a Ray Harryhausen film but it wasn't, I'm afraid. None of the Caucasians make very convincing Arabs - particularly John Ratzenberger and, of all people, Mickey Rooney - but it was a good idea not to overdo the make-up. Christopher Lee, Milo O'Shea (even if his Irish accent seems particularly incongruous!) and, in a nice cameo, Peter Cushing are certainly the strongest cast members. Oliver Tobias and Emma Samms are not very engaging leads but they're fine. The same is true of the child actor Puneet Sira, now a successful Bollywood director. It also features nice, small appearances from Shane Rimmer and a very young Art Malik. 6.5/10, maybe 7/10 if I'm feeling generous.",
         "this film is pathetic the acting (if you could call it that is cardboard and predictable) the plot again is predictable and so clichéd (with no real attempt to even disguise the cliché). I didn't know that thieves had cockney accents in 'arabia'. what makes it even worst is that all the actors are supposed to be Arab but just have lots of fake tan on. it looks like everything from every fantasy and storybook has been thrown into a bag and pulled out in some random order. the story doesn't seem to focus on one magic thing to the next this is too dull a film to mention in fact i couldn't get through the whole thing without giving up and deciding that this is a wholesale waste of my time. i was very surprised to see that this film had been made in 1979. i mean, star wars had been made by then, Indiana Jones wasn't far off. jaws had been made and yet the effects in this film are pathetic. i could not justify giving this film any more than a one as a rating.",
         "Prince Oliver Tobias will be granted permission to marry Princess Emma Samms if he succeeds in a quest to find a magic flower for her father, wicked Caliph Christopher Lee. However, the wicked Caliph has contrived to send along duplicitous Milo O'Shea to make sure the quest fails. This fantasy adventure features special effects which weren't all that special back at the time (back projected backgrounds behind flying carpets with wiggly edges, and models which scream \"I am a model!\" chief among them), some dodgy fighting, some screamingly though unintentionally funny dialogue, not massively heroic performances from Tobias and Samms, Mickey Rooney overacting as if his life depends on it, and beautifully understated villainy from Christopher Lee. For all that, there is a naïve enthusiasm about it which pleases and, at the time, we had nothing better. But these days we are used to our fantasy being a little less unsophisticated."
      ],
      "genres": [
         "Fantasy",
         "Adventure"
      ],
      "productionCompanies": [
         "EMI Films",
         "British Lion Film Corporation"
      ],
      "summaries": ["An evil magician seeks to gain power by obtaining a magic rose. A peasant boy and a prince join forces to stop him."],
      "budget": 0
   },
   "movielensId": 129484,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-07-08",
      "dvdReleaseDate": null,
      "directors": ["Kevin Connor"],
      "runtime": 98,
      "movieId": 129484,
      "title": "Arabian Adventure",
      "mpaa": "",
      "actors": [
         "Christopher Lee",
         "Peter Cushing",
         "Mickey Rooney",
         "Oliver Tobias",
         "John Ratzenberger",
         "Milo O'Shea",
         "Emma Samms",
         "Puneet Sira",
         "Capucine",
         "John Wyman",
         "Roy Stewart"
      ],
      "imdbMovieId": "0078792",
      "originalTitle": "Arabian Adventure",
      "genres": [
         "Fantasy",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["f8PhM66FmxA"],
      "plotSummary": "An evil caliph (Christopher Lee) offers his daughter’s hand in marriage to a prince if he can complete a perilous quest for a magical rose. Helped by a young boy and a magic carpet, Prince Hasan (Oliver Tobias), has to overcome genies, fire breathing monsters and treacherous swamps to reach his prize and claim the hand of the Princess Zuleira (Emma Samms).",
      "tmdbMovieId": 82430,
      "avgRating": 2.5,
      "releaseYear": "1979",
      "numRatings": 1,
      "posterPath": "/w1BbWYBuOziFQM3Hik5PqkdWPCT.jpg"
   }
}