{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0053039",
      "video": false,
      "title": "Un maledetto imbroglio",
      "recommendations": [
         98060,
         64728,
         49697,
         57969,
         65477,
         62789,
         66180
      ],
      "backdrop_path": "/flmaQ6OhPzcYrQMnTUSi88hUqky.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Inspector Ciccio Ingravallo",
               "gender": 0,
               "credit_id": "52fe44f9c3a368484e0417c9",
               "name": "Pietro Germi",
               "profile_path": "/hN3PS1lgTjkKrOeJV4LIMa25RdN.jpg",
               "id": 95040,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Assuntina Jacovacci",
               "gender": 1,
               "credit_id": "52fe44f9c3a368484e0417cd",
               "name": "Claudia Cardinale",
               "profile_path": "/trBLcdRy1jr6DJ46aV28UrG2ObW.jpg",
               "id": 4959,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Franco Fabrizi",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e0417d1",
               "name": "Franco Fabrizi",
               "profile_path": "/1nldEbVB3iaUsfQDVmMcEBb93Qe.jpg",
               "id": 30832,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Virginia Caracci",
               "gender": 0,
               "credit_id": "52fe44f9c3a368484e0417d5",
               "name": "Cristina Gaioni",
               "profile_path": "/rJkaELFzIMYLHcc0Bgi1naE01en.jpg",
               "id": 237623,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Remo Banducci",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e0417d9",
               "name": "Claudio Gora",
               "profile_path": "/2r37PWTzP8B8S2wipDYOKfH1n7J.jpg",
               "id": 32677,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Liliana Banducci",
               "gender": 1,
               "credit_id": "52fe44f9c3a368484e0417dd",
               "name": "Eleonora Rossi Drago",
               "profile_path": "/As1DUD7xAmLTypqe1cDCCJBcldK.jpg",
               "id": 25789,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Détective Saro",
               "gender": 0,
               "credit_id": "52fe44f9c3a368484e0417e1",
               "name": "Saro Urzì",
               "profile_path": "/JjUgH6kyEyZ4kgfusXENCkhlk8.jpg",
               "id": 119431,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Diomede Lanciani",
               "gender": 2,
               "credit_id": "52fe44f9c3a368484e0417e5",
               "name": "Nino Castelnuovo",
               "profile_path": "/edyUJkPj8k8bEiRb4XFIlnqoCG9.jpg",
               "id": 5476,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe44f9c3a368484e0417c5",
            "name": "Pietro Germi",
            "profile_path": "/hN3PS1lgTjkKrOeJV4LIMa25RdN.jpg",
            "id": 95040,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.21903,
      "production_countries": [],
      "id": 26296,
      "vote_count": 8,
      "budget": 0,
      "overview": "A police inspector comes into contact with people of all types and dispositions during a grueling murder investigation.",
      "similar": [],
      "original_title": "Un maledetto imbroglio",
      "runtime": 115,
      "poster_path": "/tUWPxmLvywlFayIwK4pT7vLlhHO.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1959-10-24",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Pietro Germi"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Alfredo Giannetti",
         "Ennio De Concini"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0053039/",
      "coverLink": null,
      "actors": ["Stars: Pietro Germi, Claudia Cardinale, Franco Fabrizi | See full cast and crew »"],
      "reviews": [
         "The early Germi films, though they take place in Italy, are mostly pastiches of American genre films. IN THE NAME OF THE LAW (1948) borrows from a host of American westerns about sheriffs who, against all odds and without much help from the townspeople, clean up the town and expose the complicity between a prominent town father and the outlaws. THE WAY OF HOPE (1950) is much like THE GRAPES OF WRATH, depicting the trek of a group of dispossessed workers following an evanescent lead for work in another land. (There's even a scene where they get work on a farm and are called scabs by striking workers, very similar to Ford's film.) THE BRIGAND OF TACCA DI LUPO (1952) is similar to Ford's FORT APACHE: the martinet who insists that men on field campaign for three years adhere to strict protocol, who doesn't know the difference between a good Indian and a bad one, and who insists on leading his men into danger against all the advice of seasoned professionals. FOUR WAYS OUT (1952) is much like THE ASPHALT JUNGLE in plot and tone. All of these films are impeccably made, beautifully photographed and acted, with no false notes, and with neorealist overtones (three were co-written by Fellini). However, they're all a bit slow, a bit too derivative, and they all generate more respect than enthusiasm. THE FACTS OF MURDER is something else entirely, It is another genre film, borrowing from many police procedurals, yet here one feels that Germi has finally graduated from respectful pastiches to create a work that is completely successful on its own. The plot, about a robbery in one apartment, and a murder in an apartment across the hall a week later, is so complex that it's hard to follow at times (in some ways it's similar to the complex Chandler novels, and with a similar denouement) but it's richly detailed, with many interesting characters. Germi is a superb actor and his handling of other actors is sure. The interplay between the three detectives is sophisticated and clever, and has the ring of actuality. The pace is fast but not rushed, and the writing and the pictorialization are richly nuanced. Above all, it is a highly entertaining film! This is the film where Germi seems to have come into his own as a master filmmaker, where he still has some the neorealist characters and story structure from his earlier period but also has the biting humor and social satire of his later films. It rivals DIVORCE ITALIAN STYLE as his best film, and is a must see.",
         "This is really a overlooked masterpiece! Germi made a terrific movie from the difficult Gadda's novel. One of his greatest films, together with \"Divorzio all'Italiana\" e \"Il Ferroviere\". The acting, especially Germi's, is perfect, and the rythm he impressed to the movie is unique, a sad ballad with soft humor touches. This movie make me proud to be italian and make me a little less ashamed of the contemporary italian cinema. Take a look at this gem and you'll understand!!",
         "Un maledetto imbroglio (1959) is a very good movie, it tells us about a country -Italy- still far from the wealth of the sixties, where low class people struggled to make a decent living, and illiteracy was still spread ... Higher class people could threaten poor peoples lives for trivial reasons and meantime humiliate them with their unjustified wealth ... Of course the Germi's task was simplified by the great book it started with, still the Director has his merits: the irony to start with. I basically agree with other opinions. if a catch can be found, I'd say acting is a little bit much too heavy. A kind of \"Venus's strabismus\"... Some of the actors (Eleonora Rossi Drago, Nino Castelnuovo and at times also Germi himself)overdo - overindulge in - their roles ... They fall into unnecessary theatrical poses. to my opinion the drama is in the facts being narrated and need not much emphasizing by the actors. very good by all means, but just a bit overacted, to my modest opinion. pion",
         "Well worth seeing for many reasons: for the complex plot with many connections among those involved in a theft and a seemingly unrelated murder; for a look at Italy in 1959; for the good acting and fast cutting; and for the humor in the script.",
         "This movie was poorly translated as \"Murder all'italiana\", so few people guessed that it was a rendition of Carlo Emilio Gadda's well-known novel QUER PASTICCIACCIO BRUTTO DE VIA MERULANA, read with delight at the beginning of the sixties. It had three major trumps: excellent plot, sophisticated language (mixed with Roman dialect)and long suspense, although the murderer is still unknown and at large when the book ends... For the movie, the double talents of Pietro Germi (director and occasional actor) and Gadda (contributing to the script)were supported by a very solid cast, including Franco Fabrizi, one of Fellini's favorite actor, Claudio Gora, a well known Italian old-timer and two major beauties, Claudia Cardinale and Eleonora Rosssi-Drago. Unfortunately, the TV rendition (thanks God, in original version) was scheduled right after the regional elections in France, at 1 a.m. I thought the event could alter the time, so I allowed 15 extra minutes on my VCR to tape it. To my surprise, it began 15 minutes ahead of schedule, but the book helped me to fill in the gap. There was not much to say on TV after the surprising defeat of the government, so they ran the film well ahead of schedule. A replay would be mandatory, but I know they'll never respond to my complaint. The film is considered a classic in Italy, and the remasterized copy was perfect. Too bad French TV doesn't have any consideration for the early birds like me. harry carasso",
         "Pietro Germi is one of the great unsung heroes of Italian cinema. Magnetic actor, brilliant writer and masterful director, he created some of the greatest masterpieces ever made in the Peninsula. Un Maledetto Imbroglio, an adaptation of Gadda's seminal book, is not among those... but a minor Germi is still intriguing. It's a low-key drama / detective story set in a Roman underbelly brimming with life and chaos. Here, Germi writer / director takes a backseat to Germi actor, whose keen, melancholic cop Ingravallo is the most interesting thing about the picture. 6,5/10"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Riama Film"],
      "summaries": [
         "A masked bandit steals valuables from Commendatore Anzaloni's apartment and flees, leaving Anzaloni unharmed. Inspector Ingravallo is called in. The robbery is suspicious; the thief found the jewellery too quickly. The neighbour, Liliana Banducci, employs a servant girl, Assuntina. Her fiancé, Diomede, tries to flee when he sees police tailing Assuntina. But Diomede has an alibi, a rich American woman... Liliana's cousin, Dr. Valdarena, pays her a visit, only to find her body on the floor. But before calling police, Valdarena removes an envelope addressed to him from the sideboard... Liliana's husband Remo was away from Rome at the time of the murder, but he is surprised to hear that Liliana had changed her will only the week before...",
         "The story of this film is freely based on the Carlo Emilio Gadda's novel \"Quer Pasticciaccio Brutto de via Merulana\" (\"Bad deal on Merulana street\"). This Pietro Germi's movie represents the beginning of Italian Commedy, of which Germi will be one of the masters, certainly the most innovative."
      ],
      "budget": 0
   },
   "movielensId": 129419,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1959-10-24",
      "dvdReleaseDate": null,
      "directors": ["Pietro Germi"],
      "runtime": 115,
      "movieId": 129419,
      "title": "Un maledetto imbroglio",
      "mpaa": "",
      "actors": [
         "Pietro Germi",
         "Claudia Cardinale",
         "Franco Fabrizi",
         "Cristina Gaioni",
         "Claudio Gora",
         "Eleonora Rossi Drago",
         "Saro Urzì",
         "Nino Castelnuovo"
      ],
      "imdbMovieId": "0053039",
      "originalTitle": "Un maledetto imbroglio",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A police inspector comes into contact with people of all types and dispositions during a grueling murder investigation.",
      "tmdbMovieId": 26296,
      "avgRating": 1.83333,
      "releaseYear": "1959",
      "numRatings": 3,
      "posterPath": "/tUWPxmLvywlFayIwK4pT7vLlhHO.jpg"
   }
}