{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "sexual abuse",
            "id": 739
         },
         {
            "name": "sheriff",
            "id": 798
         },
         {
            "name": "suspicion",
            "id": 3301
         },
         {
            "name": "pig",
            "id": 4931
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "dismemberment",
            "id": 157444
         },
         {
            "name": "mental",
            "id": 199214
         }
      ],
      "imdb_id": "tt0070537",
      "video": false,
      "title": "Daddy's Deadly Darling",
      "recommendations": [
         89514,
         39913,
         64342,
         109962,
         88410
      ],
      "backdrop_path": "/b0x37Jpi249kOO4qn1JAQ155Y3f.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Sheriff Dan Cole",
               "gender": 2,
               "credit_id": "52fe4a169251416c910c2c25",
               "name": "Jesse Vint",
               "profile_path": "/yJKMTKJgvoqEdy4ExnJlNjrszVi.jpg",
               "id": 12123,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "57910a719251416bad0007d1",
               "name": "Walter Barnes",
               "profile_path": "/m7OtPTdxtRSRFJeAYnBSTFjINgX.jpg",
               "id": 33544,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Zambrini",
               "gender": 2,
               "credit_id": "52fe4a169251416c910c2c2d",
               "name": "Marc Lawrence",
               "profile_path": "/hCQP4Ym8u94WdcMsJ6QXvaEd8qX.jpg",
               "id": 3140,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Lynn Hart",
               "gender": 0,
               "credit_id": "52fe4a169251416c910c2c21",
               "name": "Toni Lawrence",
               "profile_path": null,
               "id": 104354,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Johnny",
               "gender": 0,
               "credit_id": "52fe4a169251416c910c2c29",
               "name": "Paul Hickey",
               "profile_path": null,
               "id": 188453,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Miss Macy",
               "gender": 0,
               "credit_id": "579109f2925141609a000b23",
               "name": "Catherine Ross",
               "profile_path": null,
               "id": 1654084,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Annette",
               "gender": 0,
               "credit_id": "57910a279251416038000b63",
               "name": "Iris Korn",
               "profile_path": null,
               "id": 1400881,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hoagy",
               "gender": 0,
               "credit_id": "57910adbc3a3684441000926",
               "name": "Erik Holland",
               "profile_path": null,
               "id": 220033,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a169251416c910c2c33",
               "name": "Marc Lawrence",
               "profile_path": "/hCQP4Ym8u94WdcMsJ6QXvaEd8qX.jpg",
               "id": 3140,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54d63afbc3a3683b8c0024eb",
               "name": "Marc Lawrence",
               "profile_path": "/hCQP4Ym8u94WdcMsJ6QXvaEd8qX.jpg",
               "id": 3140,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57926a0f9251410cbb002fab",
               "name": "Marc Lawrence",
               "profile_path": "/hCQP4Ym8u94WdcMsJ6QXvaEd8qX.jpg",
               "id": 3140,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57926a24c3a3687c730020c5",
               "name": "Donald Reynolds",
               "profile_path": null,
               "id": 1654642,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "57926a33c3a3683a840003f7",
               "name": "Charles Bernstein",
               "profile_path": null,
               "id": 13669,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57926a409251410d12002c81",
               "name": "Glenn Roland",
               "profile_path": null,
               "id": 52626,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57926a4cc3a3683a50000356",
               "name": "Irv Goodnoff",
               "profile_path": null,
               "id": 1087621,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57926a62c3a3687c730020fd",
               "name": "Boris Michael",
               "profile_path": null,
               "id": 1654643,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "57926a719251413d3c000db7",
               "name": "Chuck House",
               "profile_path": null,
               "id": 1654644,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 1.249955,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 89351,
      "vote_count": 9,
      "budget": 0,
      "overview": "Teenager Lynn kills her father while he tries to rape her - the receiving officer at the mental hospital cannot convince her that her father is dead. After electric shock treatment she escapes in a nurses car. There is a farm where the manager is unable to feed his pigs on the usual swill, they have tasted blood - Human Blood! Lynn stumbles on the farm, she is looking for work she explains. \"Papa they tell me, what do you see One little girl as deadly as can be.\" The circle begins, feed people to the pigs - then eat the pigs.",
      "similar": [
         298312,
         300665,
         310137,
         357096,
         24124,
         3134,
         948,
         238636,
         588,
         3600,
         9538,
         281957,
         74997,
         11309,
         341006,
         133805,
         6312,
         434873,
         10017,
         9373
      ],
      "original_title": "Daddy's Deadly Darling",
      "runtime": 80,
      "poster_path": "/6ArLIV9BUaLeewz05h32dseIQVz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "D&R",
         "id": 46048,
         "origin_country": ""
      }],
      "release_date": "1972-04-07",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "A mad man... A psycho killer... And mean cannibal pigs... All together in the scariest film you'll ever see!!!",
      "adult": false,
      "homepage": "http://www.troma.com/films/pigs/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Marc Lawrence"],
      "runtime": 80,
      "synopsis": "**This synopsis is regarding the original cut of the film, not any of the various re-edits** The film opens as we see a man feeding a corpse to a pen full of squealing pigs. This man is Zambrini (Marc Lawrence). He talks to the corpse as he prepares to toss it into the pen, explaining that the pigs were roaming free one night and they happened upon a drunk sleeping in a field. After eating the sleeping drunk, the pigs gained a taste for human flesh. A Volkswagen bug driven by a young woman down a series of increasingly isolated roads. This is Lynn (Toni Lawrence), and the song that plays over the opening credits advises her to \"keep on driving till the end of the road\", because \"somebody's waiting for you\". After driving past a series of oil wells in rural California, she stops at a dead-end road, where she finds a diner. There is a sign in the window that says \"Waitress wanted\". As she steps out of her car, she is startled by the screaming of pigs, but she continues inside, where she meets Zambrini. This is his diner, and without much dialogue passing between them, he hires Lynn as a waitress and helps her get settled into a spare room where she will stay. She finds a strait razor in the medicine cabinet while she is preparing for bed. She has a nightmare that Zambrini enters her room and slashes her to death, but she wakes and realizes it was just a dream. She goes outside and starts looking around the property and hears the pigs, but before she can approach the pen, Zambrini grabs her and warns her never to go looking around back there. A pair of older sisters are Zambrini's closest neighbors, Miss Macy (Catherine Ross) and Annette (Iris Korn). They are in the habit of calling the local sheriff, Dan Cole (Jesse Vint), and complaining about Zambrini's pigs. They can hear the pigs squealing from where they live, but they also claim that the pigs run free at night and come right up to their house. They claim Zambrini victimizes people by feeding them to his pigs, after which another pig will appear in the pen. While Lynn is serving customers at the diner, a customer named Ben (Paul Hickey) begins hitting on her, although she rebuffs his advances. He tells her Zambrini's back story, about how he fell from a high wire during a performance and was pronounced dead, only to be taken to the morgue, where they discovered he was not dead at all. Dan Cole arrives and talks to Zambrini about the complaint he got from the Macy sisters, warning him to make sure his pigs are penned. He also meets Lynn, frightening her for a moment by telling her she is driving a \"missing car\". It turns out he's only referring to her registration, which is outdated. She promises to update it. Afterwards, Lynn makes a seemingly desperate phone call to her father, telling him that she had to leave but that she will return to be with him as soon as she can. We only hear Lynn's side of this conversation. Later, Zambrini pays an uninvited visit to the Macys, entering their home unannounced and terrifying them by wearing bizarre makeup that he used during his days as a circus performer. Ben returns to the diner and asks Lynn out again, this time telling her that he discovered an out of place nurse's uniform discarded in a field nearby, seemingly implicating Lynn, the stranger who has just arrived in town. Although Lynn tries to deny any connection, she agrees to go on a date with Ben. Unfortunately, Ben drives her to an isolated location and tries to force himself on her, seemingly willing to rape her if she doesn't comply. She is rescued by Sheriff Cole, who arrives and gives her a ride back to the diner. Lynn mysteriously invites Ben back to her room at Zambrini's, apologizing for not accepting his advances. She puts on a show for him by wearing sexy lingerie, and then she gets into bed with him. However, she produces the strait razor and violently slashes Ben to death. Zambrini discovers the scene, with Lynn staring off into nowhere and singing to herself next to Ben's dead body. Calming Lynn, he cleans her up and takes her to his own room, where he puts her to bed. Afterwards, he removes Ben's body and feeds it to the pigs behind the diner. Lynn wakes up the next day with seemingly no memory of the incident, but she walks down the road to a payphone, where she places another one-sided phone call to her father. When she can't reach him, she runs back to the diner, \"chased\" by her half-remembered screams of Ben and the threatening squeals of pigs. Ben is missed, and Sheriff Cole begins investigating his whereabouts, leading him to the farm. He talks to the Macy sisters, who claim to have seen him arrive at Zambrini's, never to have left, while the pigs \"went crazy\". Dan questions Zambrini again and tries to look at the pig pen, attracted to it by the howling of Ben's dog, which has apparently located Ben's body by sense of smell. A human hand is lying just outside the pen, but Zambrini manages to hide it by standing on it, and Cole leaves. Dan returns to the Macys, where a doctor (Walter Barnes) is doing a checkup on one of the sisters. Dan and the doctor have a conversation about Miss Macy's belief that Zambrini turns people into pigs by feeding them to the swine, and the doctor tells him that ancient Egyptians actually believed this was possible, and that a human turning into a pig was a step toward becoming divine. Lynn herself proves impossible for Dan to question, staring off into space again and playing with her hair. Cole isn't the only one looking for Ben, either. Zambrini discovers a group of young men prowling around his property, presumably Ben's coworkers at one of the oil wells. They find nothing, but beat Zambrini and tell him to leave town. Things start to unravel for Lynn when a man named Jess Winter (Jim Antonio) arrives in town and starts asking for Lynn. He is eventually referred to the diner, where he approaches her in a non-threatening way and tells her they have some \"mutual friends\" who care about her. Our suspicions about Lynn are confirmed when he implies that Lynn has run away from a mental facility. He tells Lynn that she's welcome to come back, and Lynn is happy at first, asking about a doctor that she seemed attached to in a fatherly way. Zambrini overhears, and when Lynn goes to pack her things in order to return with him, Winter talks to Zambrini and tells him Lynn ran away from an insane asylum. When Zambrini asks about Lynn's father, he tell him Lynn has no father. Having become attached to Lynn, Zambrini doesn't want her to leave, and he asks her to stay. Lynn agrees, luring Winter into turning his back on her and then stabbing him to death with a large kitchen knife. The body is dragged to the pig pen, where the pigs consume it. Lynn's world continues to close in on her when the mental hospital calls the sheriff, telling him that Winter is missing and that Lynn is an escaped mental patient with homicidal tendencies. Dan calls Zambrini at the diner and tries to warn him about Lynn, telling him to act as if nothing is wrong and wait for them to come and take Lynn into custody. Zambrini, however, immediately tells Lynn the police are coming for her and that they need to make it seem as if she's left. When Lynn mentions her father, Zambrini repeats what the doctor told him: her father is dead. Lynn reacts violently and stabs Zambrini in the back, killing him. Knowing the police are coming for her, she makes one final phone call to her \"father\", and this time we hear the recorded message on the other end telling her that she's reached a disconnected number. Lynn thinks she's talking to her father, telling him she loves him. While she's talking, the flesh-eating pigs from the pen suddenly enter the diner and advance on her. Cole arrives at the diner and, presumably, finds the aftermath of the pigs eating the bodies of both Lynn and Zambrini. He later tells Ben's coworker that Lynn murdered her own father after enduring years of sexual abuse from him. The pigs are loaded into the back of a truck and taken away, but Dan is startled to find that instead of the 12 pigs he'd counted on previous visits to the farm, there are now 13 pigs. Also found in the pen is the Egyptian ankh pendant that Lynn has worn throughout the entire film.",
      "writers": ["Marc Lawrence"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0070537/",
      "coverLink": null,
      "actors": [
         "Toni Lawrence",
         "Jesse Vint",
         "Catherine Ross"
      ],
      "reviews": [
         "This film has many titles. Among them are \"Pigs\" \"Daddy's Deadly Darling\" and \"The Strange Exorcism Of Lynn Hart\". It was meant to be a star vehicle for the director, Marc Lawrence's daughter Toni Lawrence (if only she could act!) but turned out to be one of the only movies she ever made. It is filmed in the style of a \"Last House on the Left\" or \"Texas Chainsaw Massacre\" that grainy style of film making that always gives the viewer that \"not so fresh\" feeling. An often overlooked cult classic in it's own right \"Pigs\" is worth a one-time viewing for die hard horror fans but viewers beware the version currently in circulation that is being distributed by Troma is actually a censored version of the film (why anyone would care to bother censoring a film with so much of NOTHING in it is beyond me) it is missing a few key scenes (such as a scene where a victims hand is fed to the pigs) and is disappointingly void of extras (I would LOVE to hear how Marc Lawrence feels about this film nowadays or at least see the theatrical trailer for this sleaze fest).",
         "Lynn(Toni Lawrence-the daughter of Marc Lawrence)stabbed her father to death after he raped her.She believes that her daddy is still alive.She escapes from the asylum-stealing a car she flees into backwoods America,ending up at Zambrini's roadside diner.Zambrini(Marc Lawrence) has twelve pigs-he butchers people to feed his animals!\"Daddy's Deadly Darling\"/\"Pigs\" is another overlooked classic from early 70's.The script is wonderfully bizarre,the acting is pretty good and there is a bit of gore.The photography is grainy,even ugly looking at times-the film actually reminds me \"The Texas Chain Saw Massacre\",\"Last House on the Left\" or \"Eaten Alive\".Some scenes are pretty creepy,so if you like horror movies give this little gem a look!",
         "Good Times! Marc Lawrence makes another memorable character in the old, crotchety Zambrini - an ex-circus performer who supposedly came back from the dead after a tragic high-dive. Well, now he owns and operates a little cafe in the middle of nowheresville and feeds his pigs dead humans after midnight. As luck would have it, his newest employee of the cafe is a runaway psychotic from an insane asylum who likes to cut up men who come on to strong to her. She is really the film's main character and, as it turns out, Daddy's Deadly Darling is actually Marc Lawrence's deadly daughter in real life. Seems that he wanted to jump start his daughter's career so he gave her the lead. Well, unfortunately, she doesn't carry nearly enough quirkiness or depth to bring that character to life, unlike her father, who is a real gem to watch. As a director, Mr. Lawrence had some good ideas to make some creepy, uneasy scenes to watch, but the version I watched (called PIGS) was very choppy and sloppy from an editing standpoint and the camera seems to enjoy shooting things in pitch black darkness. That's low-budget for you, but there's still something charming about this otherwise standard '70s exploitation fare. And any movie that has Marc Lawrence in it is, by default, going to have something going for it.",
         "Possible minor spoilers. This incredibly odd little picture (which I saw as Pigs) almost defies description. Mark Lawrence made the film as a vehicle for his daughter, Toni, with Jesse Vint appearing as a favor. Toni is Lynn Webster (referred to at the end, for some unexplained reason, as Lynn Hart), whose history of madness and patricide is relayed in less than five minutes. This loopy Linda Lovelace-lookalike then escapes the nut barn in a stolen Volkswagen and nurse's uniform. She ends up at a middle-of-nowhere cafe, working for Zambrini (Marc), who robs graves and feeds the corpses to his bloodthirsty pigs. When our busty, batty heroine is reminded of abusive rapist Daddy, she grabs the nearest sharp object and starts hacking. Zambrini and his pigs cover for her. The sheriff (Vint) mostly stands around looking puzzled. Pigs is an absolute wonder to behold--jerky editing, leering camerawork, pointless characters, a funky soundtrack (\"Somebody's waitin' for you/Somewhere down the road/Keep on drivin'...\") that starts and stops of its own accord, an obvious double for Toni at the end...and somehow it all works brilliantly! It's like some bizarre hallucination from the brain of the disturbed heroine. Pigs squeal like rusty vaults being forced open, Lynn go-gos next to the jukebox, old women look scared--doesn't matter why. The acid-trip plot and cheap, over-saturated color give it a kind of creepy-beautiful tone reminiscent of an underground art film, with a perfect atmosphere of backwoods isolation. The Lawrences are terrific, particularly the appealing Toni, and the supporting players are quite convincing. The music makes me wish for a soundtrack LP. If a film ever had Cult Classic stamped all over it, it's this one.",
         "Lynn has a problem. Her father abused her, raped her, and beat her. Lynn killed her father, was put in an asylum, and still believes her father to be alive. Lynn escapes from asylum and heads on the highway to get away. Thus is the first five minutes or so of Daddy's Deadly Darling(Pigs was the title of video I saw). Then comes on one of the best and most ridiculous songs for a horror movie I've seen in a long time, \"Somebody's waiting for you.\" I have to admit it is a pretty catchy tune. The tune plays while Lynn drives away from her troubles till she comes to a small cafe in the middle of nowhere that has a position for employment open. She secures her job here as a waitress and soon creates a bond with the cafe owner. His name is Zambrini and he has a bunch of human flesh-eating hogs in the back. Well, the story really gets bizarre here when we see Zambrini feed a freshly dug corpse to his livestock. Lynn too seems to not haven gotten over her killing ways completely and the two work together going hog wild over their work. This film is actually pretty good. I mean it is not a a good movie, but it is a whole lot better than I expected and I think will exceed many of your expectations. Marc Lawrence wrote, produced, directed, and starred in this film. His daughter Toni plays Lynn. Lawrence is able to create a very eerie feel to the film despite the total lack of logic that exists in the script. Some of the scenes are dream-like and Lynn's nightmare scene is very powerful. Lawrence also does a fine job acting in his professional low-key style. His daughter isn't too bad either and let's just say she sure knows how to fill out a nightgown. The deaths are not particularly plentiful or gruesome. The rest of the acting is adequate with a couple of old ladies doing very well as neighbors complaining about the pigs next door. Watch out for video misrepresentation: one of the older women's names is Katherine Ross(she starred in one movie...this one!) but is given top billing on many videos to try and make you think this is the other Katherine Ross(The Graduate and The Legacy). All in all a better than expected cinematic experience.",
         "Toni Lawrence stars as a psychotic young woman who kills her father after he rapes her. This film is pretty bad; many scenes just don't make sense and some of them seem to come out of nowhere. On the plus side, a lot of the dopey characters are fun to watch (especially Zambrini), and the movie has a bizarre, dreamy (and sometimes nightmarish) quality throughout. The scene where Toni Lawrence hears loud pig squeals and then runs screaming through a field for what seems like an eternity is probably the best example of the weird, out-of-nowhere sequences that continuously crop up. Unprofessional filmaking at its best!",
         "This movie is often marketed under the title \"Pigs!\", but that's actually pretty misleading. Granted, there are in fact some pigs involved in this project, but if you want to see crazed hogs rampaging and eating people and whatnot, look somewhere else. I have no idea where, but definitely somewhere else. Instead, this movie focuses on a strangely attractive young woman who seduces men and then kills them. And then she feeds the victims to a bunch of local pigs, mainly to justify the alternative title. It's a pretty thin plot, but the surprisingly decent acting and the sheer brutality of it all manage to keep the show on the road. Also comes with a really weird lullaby soundtrack that's difficult to get out of your head.",
         "Ladies and Gentlemen, the hall of 70's exploitation obscurity proudly presents \"Pigs\", a movie made by, made for and \u0096 of course \u0096 largely revolving on \u0085 Pigs! Just in case you're looking for a totally incompetent yet strangely fascinating and one of a kind drive in class-sick, I warmly recommend this movie which Marc Lawrence (supportive cast member of such acclaimed classics as \"Key Largo\" and \"The Asphalt Jungle\") wrote, produced, starred in and directed entirely by himself! \"Pigs\", which is a much easier and equally appropriate title to use instead of the official \"Daddy's Deadly Darling\", blends two main story lines that are typical 70's exploitation guff (meaning: absurd and utterly tasteless), yet the wholesome feels refreshing and unique. The opening sequences introduce Lynn Webster. She's a beautiful and impressively voluptuous young girl who has just slain her father because he couldn't keep his hands to himself and a certain other body part inside his pants. One minor problem, however, Lynn refuses to accept her daddy is dead and she even escapes from the asylum to search for him. Why she desperately wants to be reunited with the guy who physically abused her is just one of the many weird kinks in the plot that remains unexplained and neglected. I guess it's because she's mentally unstable and those people tend to desire weird things. Anyway, she arrives at a remote countryside diner where funny farmer Zambrini employs her as a waitress. Zambrini has a couple of issues of his own, though. To a corpse he stole from the local morgue he explains how his pigs accidentally developed a taste for human blood. It started when they devoured a drunkard who fell asleep in their barnyard, but now they exclusively crave human flesh. The rest of the film is pure but amusing nonsense, with Lynn gradually losing whatever's left of her sanity and Zambrini desperately collecting corpses to keep his porkers satisfied. Jesse Vint stars as the handsome Sheriff investigating the odd events at Zambrini's farm and, like any other male character, he falls for Lynn's gorgeous rack. \"Pigs\" guarantees 80 minutes of uncompromising and demented 'Rednecksploitation' fun! Naturally it's a horrible film, complete with amateurish acting performances and dialogs that appear to have been written by the pigs, but trained admirers of cinematic 70's smut won't be able to resist it. The camera-work looks hideous, Marc Lawrence clearly never heard of editing and the make-up effects wouldn't even scare a child. \"Pigs\" also features a misfit but incredibly catchy theme song called \"Somebody's Waiting For You\" (misfit songs were almost obligatory in 70's drive-in classics) and the endlessly repeated \"La la lalalla la la\" tunes. Marc Lawrence donated the role of Lynn to his real-life daughter Toni, presumably to launch her career. It must have been awkward, for the both of them, to shoot all the sequences where she wears a revealing and too tight nightgown. Do I sense incestuous undertones? Sure, why not \u0085 Everything goes in the wondrously twisted world of 70's exploitation, right?",
         "Produced & directed by legendary character actor Marc Lawrence - known for his many gangster roles - the somewhat obscure curiosity \"Daddy's Deadly Darling\" (a.k.a. \"Pigs\" and \"The 13th Pig\") is nothing if not interesting. It's actually kind of appealing in its warped way, largely because it's just so sincere. The dialogue (screenplay by Mr. Lawrence, billed as \"F.A. Foss\") isn't always the greatest, but it's delivered with as much gravitas as the cast can muster. It's well shot by Glenn Roland and features a haunting refrain and score by the consistently reliable Charles Bernstein (\"A Nightmare on Elm Street\" '84, \"Cujo\"). This is largely a vehicle for Marcs' daughter Toni, a pretty and leggy young woman who stars as Lynn, a mystery lady running from something who arrives in a small California community. She takes a job as a waitress in a local cafe, working for a man named Zambrini (Mr. Lawrence), an elderly man who lived through a devastating accident when he worked for a circus. On Zambrinis' property are a dozen pigs, and it is rumored by the locals that these pigs got used to the taste of human flesh long ago, and that Zambrini will resort to murder of drifters in order to keep these pigs fed. Ultimately, the developments in Lawrences' story aren't all that surprising, but the presentation is just offbeat and atmospheric enough to make this an intriguing viewing. Ms. Lawrence does a decent job as the disturbed Lynn, and her dad is likable (for a change) as Zambrini takes a paternalistic care towards his new employee. '70s drive-in favorite Jesse Vint is fine as the local sheriff, and there are other solid contributions by Jim Antonio, Catherine Ross, Paul Hickey, Walter Barnes, and Erik Holland. It's commendable that boutique labels such as Vinegar Syndrome, which released this one on DVD & Blu-ray this year, are doing such a fine job of resurrecting little known cult / exploitation titles like this and giving them such impressive presentations. Eight out of 10.",
         "A doolally feature so disjointed that it makes you feel like you've been drinking Everclear all night, PIGS is one of the more underrecognized films in the 70s horror canon. An attractive girl fresh from the funny farm-(she killed her Father for you-know-what)-takes a waiting job in a Mayberry-hick diner operated by an old wacko who keeps a pen of flesh-hungry swine(a perfect disposal for those dead bodies that keep turning up). Enjoyable soup-kitchen quickie with a groovy bubblegum pop intro, PIGS is plenteous with off-base appeal, and is a moderately more proficient contribution than the standard hireling-level picture of its day. 5.5/10",
         "Lynn Webster (Toni Lawrence, Marc's real-life daughter) is sent to an asylum for shock therapy after killing her father when he tried to rape her. She escapes, steals a car and ends up in a small farming town where weird truck stop owner Mr. Zambrini (Marc Lawrence) gives her a waitress job for room and board. The relationship ends up working out nicely for both -- Lynn goes on a killing spree after almost getting raped again, while Zambrini covers her ass by hacking up the bodies and feeding them to his flesh-craving pet pigs he keeps pinned up behind the restaurant. Familiar character actor Marc Lawrence made his directorial debut (and as 'F.A. Foss,' also his screenplay debut) with this very cheap and dark-looking, but fairly well-acted and sometimes creepy, low-budget backwoods horror flick. It laid unreleased for about 12 years, but I've seen worse.",
         "This was the only film edited by Irvin Goodnoff in his surprisingly long career in the movie biz. When you watch Pigs, you''ll understand why ol' Irv never got around to picking up the scissors and glue again. Quite simply, this is one of the most poorly edited films ever made: rife with continuity errors, incredibly sloppy quick cuts, and general ineptitude, Pigs defies almost every rule in the Big Book of Film Grammar. As a result, much of the film plays like an experimental effort with psychedelic overtones, which (depending on your point of view) renders the whole thing either unwatchable or a must-see junk movie classic. I would love to know what inspired screen heavy Marc Lawrence to write, direct, and star in this film, which also features his daughter Toni in the lead role of a woman who escapes from Camarillo State Hospital only to stumble across Farmer Zambrini's swine facility. Zambrini (Lawrence pere) feeds his hogs premium feed--human flesh--but local lawman Dan Cole (Jesse Vint) isn't convinced this is against the law. The film fosters the bizarre notion that the pigs somehow 'become' those they've eaten! Filled with thunderous hog squealing, human screams, groovy music, and lots of fish-eye lens footage, Pigs is never boring--and the acting is, by and large, very good. Ignore Troma's DVD and wait for someone like Code Red or Scorpion to give this film the lavish special edition treatment it clearly deserves!",
         "After a pre-credit sequence which takes a principled stand against childhood sexual abuse by showing an older adult male's hand feeling up the bottom of a voluptuous and very mature-looking \"teenager\", this movie gets right down to business with it's two chief exploitative elements--sex, of course, and pigs (which is what this movie was originally called). The plot revolves around two psychos--a sexually active young woman (apparently the grown-up version of the \"teenager\" from the pre-credit sequence) who murders her many male conquests, and her elderly partner-in-crime, a pig farmer who feeds the bodies to his porkers. This movie thus is basically a rural version of Mantis in Lace with the LSD sequences replaced by surreal footage of rampaging pigs. Still it should be admired for its sheer audacity and its bizarre and ludicrous plot (it's totally original if nothing else). It also manages to shoe-horn in one of the most hypocritical feminist themes this side of I Spit on Your Grave. What a bucket of slop!",
         "Previously mistreated schizophrenic and former psych ward patient (Toni Lawrence) does a circuit breaker after an attempted rape by her less than gallant suitor, turning into an avenging angel, luring unsuspecting men to sudden death, and feeding their remains to the ravenous pigs of her employer, the shady Zambrini (Marc Lawrence). Local sheriff (Vint) begins to suspect she may not be the perennial victim she appears, while her surrogate protector (Lawrence, at his unhinged best) is abetting her crimes, exploiting her psychopathic capabilities (and keeping his pigs well nourished). The rural setting and bluegrass soundtrack creates some semblance of hysteria, and the supporting cast features some capable, recognisable faces, but the story meanders aimlessly with little punctuation or scene establishment; just a series of unprovoked retributions followed by macabre squeals, as porky and his swine friends poke their snouts into the entrails of hapless victims. It's a paranoid malaise in which the two leads share a co-dependent dementia, each servicing a twisted and morbid lust, the pigs profiting from the residue. While Marc Lawrence can always depict a perverted psychopath, his daughter Toni is a little less convincing, requiring the assistance of that ubiquitous child singing that seems to signify repressed infantile abuse. Jesse Vint, the dependable (and throughout his career, perpetual) country law enforcer is appropriately concerned, and delivers a relaxed, natural performance that almost resurrects this film from the bowels of c-grade cinema; almost. The two dotty neighbours (Ross & Korn) are amusing, suspecting that Zambrini's hogs may be porking out on more than grain feed, even suggesting that he's a cannibal (given that he eats the pigs, ipso facto). The shrill squeals of the ravenous hogs that echo throughout the film are harrowing, and the ambiance is uncomfortable in the same way that made \"The Texas Chain Saw Massacre\" such an ordeal. Script is fine as is the cinematography and acting, but there's just not enough depth to the storyline to make it the minor cult classic it could have become.",
         "Toni Lawrence plays Lynn, a disturbed young woman who escapes from a mental hospital where she was committed for killing her abusive father who raped her. Stealing a nurse's uniform and car, Lynn ends up in a small California town where she meets and shacks up with Zambrini, an old farmer who runs the local motel and roadside cafe. Zambrini also owns a group of pigs that he keeps in a pen behind his house who have somehow developed a taste for human flesh. When Lynn begins killing a number of men who remind her of her dead father, Zambrini helps her out by disposing of the bodies to the pigs. Investigating the disappearances, the local sheriff eventually becomes suspicious of Lynn's past and a private investigator, hired by the hospital to find her, slowly close in on Lynn. Good underrated flick with good acting and gore. Never a boring or a dull moment, although it could have been longer. Rated R for Extreme Graphic Violence.",
         "This movie its a boredom, but that's just me, I watched this movie under the title \"Daddys Deadly Darling\", it varies a lot from the other titles this movie its known for, the other two titles are \"The Killer\" and its most common name its \"Pigs\", this last title was when Troma released this movie, the version I saw had a short intro, it showed the relationship between the father and the daughter, it doesn't add anything to the movie, but it shows him grabbing her butt, so I guess they just added it to be more sleazy, which its fine by me, the gore scenes in the movie are the best part of it, they are the most entertaining part of it, unlike the Troma title suggests the pigs do not kill people in the movie its mainly just our protagonist Lynn, the pigs just eat the body parts of her victims, overall if you want some OK gore scenes and you don't mind being bored sometimes, I would say to check it out, its interesting enough.",
         "Young woman who was committed to a mental institution after killing her father when he tried to rape her, breaks free and ends up in a small town where she takes up with an older farmer who has pigs that like to eat human flesh. Lurid, at time uncomfortably so, film about the weird things that weird people do. I'm not sure what to think about the film. It's a strange little film that seems to be strange for strange's sake. I was watching the film and thought a good amount of the film had run only to find that it had only been about 30 minutes. Its creepy because of the odd people involved. What do I think of it? Its okay. A bit odder than I wanted for the late night viewing. I'm curious why this was paired with the Rock Hudson Embryo on the DVD I had since other than being horror films they have little in common. Going from one to the other made for a weird segue. Worth a look for anyone who wants to see off beat horror films, anyone else should probably look elsewhere",
         "This movie started out interesting. Kinda like \"Chainsaw Massacure\" with it's erieness of the way the characters played their parts and the way it made it looked like everyday life on the farm with a man and his pigs. Then it made a turn when the farmer tried to make the pigs eat a dead man. This dead man looked all too real and his makeup was terrible. Then another switch when an escape mental patient dicides to take a drive and ends up at the mans farm. Then the whole theme about the man feeding dead people to the pigs changes to the lady living at the farm and going phyco. Now whos the crazy one? The man or the lady? Thats when the film lost my intrest, it's all too strange how an old strange man that lets his pigs out at night squeeling to the neighbors has a young pretty lady hiding out in his barn. this movie has one too many flaws and twists.",
         "Daddy's Deadly Darling (PIGS) is one of those films you will remember forever if you see it only once. About a \"Deadly\" girl who meets a deranged old guy who has a group of wild Pigs that eat people!! Not a gore fest but a very interesting and effective film. The few murder sequences are shocking and the script and whole concept of this movie is BIZARRE! Rent the movie because you know you have NOTHING BETTER TO DO!! It took up 90 minutes of my life and was well worth it!!",
         "Yet another Troma acquisition which was clearly meant for Something Weird Video. Pigs, aka, Daddy's Deadly Darlings is one of about a thousand inept, no-budget rural Horrors's from the same era. Few of which are not even half as inept as this one. Directed by Marc Lawrence, and starring daughter, Toni Lawrence, as a crazy person (Lynn) on the run after stabbing her pa to death, after a raping. This chick knows how to disappear, as she couldn't have found a more empty nothing of a town if she tried. Lynn finds work and a place to chill with local crazy person, Zambrini, a pig farmer. The fact that Lynn starts to kill people normally might not go over too well with the old man, but his extremely noisy pigs only happen to eat human flesh, so, he's actually glad to have her around. It's just a win-win situation. On the back of the DVD case, it says Pigs has paved the way for stuff like Last House On The Left, and The Hills Have Eyes, and well, it also refers to Pigs as a cult classic. Sorry, guys, but I wouldn't even call that an exaggeration. This is a terrible, dull pile of garbage and to be honest, I'm having a hard time thinking of stuff to say about it. Although, the fact that Pigs was clearly edited by someone who is legally blind, always makes me laugh. That really is the best part. Seeing pieces of scenes repeat themselves is rare, even in the world of B-cinema. So, Pigs definitely deserves extra points for that. Other than that, not really any gore to speak of (unless I missed it), and no witty one-liners to make you chuckle, and well, not really much of anything but terrible lighting, irritating squeals, and a keen little song which sorta reflects the premise. Not a good movie. Hell, not even a good B-movie, but if you like 'em bad, then you're in for a good time. 5/10",
         "Pigs (1972) *** (out of 4) Lynn Hart (Toni Lawrence) gets a new job working for the rather strange Zambrini (Marc Lawrence) and before long she's luring men to their deaths and feeding them to the employer's pigs. Pretty soon Sheriff Cole (Jesse Vint) begins to think that there's something in Lynn's past that might have a connection to the current events. I had never heard of this film until Vinegar Syndrome released it to Blu-ray so that tells you how obscure this film was at one point. It was released under various titles including DADDY'S DEADLY DARLING and THE 13TH PIG, which is the title available on the print I watched. I'm giving this film three stars simply because it's really unlike any other movie out there and not only does it have an interesting and at times deranged atmosphere but it also deserves some credit for coming before so many other popular horror movies set in rural towns. I guess if I had to compare this to a more popular movie then I'd say THE Texas CHAIN SAW MASSACRE. Both films take place in small locations and both films have a rather warped atmosphere that make them so memorable. I really liked the look and feel that director Marc Lawrence brought to the picture and I thought he perfectly captured that small town mood where everyone knows one another and everyone talks about one another. The two older ladies who are always suspecting something. The town Romeo who tries to sexually assault Lynn. The film really doesn't contain any graphic gore or violence but it still has some unsettling images that once again should have us giving credit to the director. I thought his daughter, Toni, in the lead was also extremely good and believable in the part. I also liked the performance from Lawrence as the crazed diner owner. Father and daughter certainly did a nice job here and the end result is a pretty entertaining slice of 70's horror.",
         "Mainstream character actor Marc Lawrence found himself blacklisted during the '50s and was forced to flee to Europe for a decade. On his return, he found himself producing and directing all kinds of low budget fare including PIGS, his only horror movie. This ultra-bizarre tale was made on a shoestring budget and pairs not one but two psychopathic characters in a very slow moving tale of murder and madness that's pretty predictable. Bizarrely the film fell foul of British censors although I don't really see why. The gore effects that pop up throughout the movie are shoddy and unrealistic with severed body parts oozing bright-red fake blood, although the cockroach running through the grue is pretty artistic and original. Beauty Toni Lawrence (daughter of the director) stars as Lynn, a girl who starts off getting raped by her dad. She murders him in self defence and is carted off to an insane asylum, escaping about five minutes later far too easily. Lawrence goes to live in the country, where she meets would-be suitors and inevitably ends up butchering them when they try to have sex with her or alternatively when she's reminded of her father. The film tries to get inside Lynn's mind and explore her disturbed character, so throughout we're subjected to cheesy childish rhymes and lots of disturbing squealing from the filthy pigs which send her insane. Lawrence isn't bad at all as the lead and is pleasing on the eye to boot. Her new housemate is crazy old Zambrini, played with sleazy relish by the director himself in an excellent little performance. Zambrini goes out grave robbing at night, finding corpses to feed to his beloved pigs. The pigs of the title are actually pretty disturbing, especially when they run around in the dark terrorising people, and the exploitation angle is played for all its worth. Unfortunately the rest of the characters are a bunch of stock clichés, like the dumb sheriff or the asylum guy, and the acting apart from the two leads is appalling. Generally, PIGS is a difficult film to sit through due to the snail-pace story and the poor production values. It's one of those films where everything happens in the dark and you end up with eye strain through trying to watch it. Irritating music and a stupid twist ending adds to the overall effect but PIGS not without charm; it manages to be disturbing and dumb in equal measure whilst the loony tag-team of the central pairing is enjoyable to watch.",
         "Disturbed young lass Lynn (a solid and credible performance by Toni Lawrence) escapes from an asylum where she was committed after killing her abusive father. Lynn winds up in a small rustic California town and seeks refuge at a farm owned by cranky old loner Zambini (a spot-on lively and creepy portrayal by veteran character actor Marc Lawrence, who also produced and directed). Pretty soon Lynn starts bumping off anyone who asks too many questions about her tragic past. Zambini helps Lynn cover up the murders by feeding the bodies to his flesh-eating pigs. Marc Lawrence keeps the arrestingly warped story moving at a steady pace, makes good use of the remote rural locations, and does an ace job of crafting and maintaining a supremely grim and sordid atmosphere. The quirky script offers two unbalanced and equally dangerous psychos for the price of one who form a codependent relationship that proves to be genuinely unnerving and even strangely touching (the fact that said psychos are portrayed by a real-life father and daughter gives the whole twisted affair an extra jarring conviction and intimacy). The amplified pig grunts and squeals are likewise quite unsettling. Moreover, there are fine supporting contributions from Jesse Vint as the amiable, but pesky Sheriff Dan Cole, Paul Hickey as pushy jerk Ben Sharp, Catherine Ross as antsy neighbor Miss Macy, Jim Antonio as the easygoing Jess Winter, and Erik Holland as hotheaded troublemaker Hoagy. Glenn Roland's stark cinematography supplies an appropriately plain look. Charles Bernstein's shivery score boasts a wonderfully haunting children's lullaby as well as a great groovy rock'n'roll theme song. Best of all, the modest budget and basic rawness of the filmmaking further enhances the overall freaky'n'spooky mood. Recommended viewing for fans of outré fright fare.",
         "pigs or otherwise known as daddy's deadly darling is a weird movie, made in 1972 it depicts a young girl(Toni Lawrence)who escapes an insane asylum after killing her father after she is raped,ends up at the restaurant of an ex circus performer(Marc Lawrence)who feeds people to his pigs.interesting concept flesh eating pigs.Marc Lawrence's real daughter plays Lynn,the attractive but unbalanced escapee.Marc Lawrence who i know from the movies;king of Kong's island,and the monster and the girl(1940's)also produced and directed this odd rarely seen horror picture.i first seen this on Elvira's movie macabre.which was like the early mst3k, but with Elvira and her awesome jokes and one liners.if you like strange movies this is for you,5 out of 10."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Ursus Productions"],
      "summaries": ["Lynn Hart is a disturbed young woman who escapes from a mental hospital where she was committed for killing her abusive father who raped her. Stealing a nurse's uniform and car, Lynn ends up in a small California town where she meets and shacks up with Zambrini, an old farmer who runs the local motel and roadside café. Zambrini also owns a group of pigs that he keeps in a pen behind his house who have somehow developed a taste for human flesh. When Lynn begins killing a number of men who remind her of her dead father, Zambrini helps her out by disposing of the bodies to the pigs. Investigating the disappearances, the local sheriff eventually becomes suspicious of Lynn's past and a private investigator, hired by the hospital to find her, slowly close in on Lynn."],
      "budget": 100000
   },
   "movielensId": 129423,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-04-07",
      "dvdReleaseDate": null,
      "directors": ["Marc Lawrence"],
      "runtime": 80,
      "movieId": 129423,
      "title": "Daddy's Deadly Darling",
      "mpaa": "R",
      "actors": [
         "Jesse Vint",
         "Walter Barnes",
         "Marc Lawrence",
         "Toni Lawrence",
         "Paul Hickey",
         "Catherine Ross",
         "Iris Korn",
         "Erik Holland"
      ],
      "imdbMovieId": "0070537",
      "originalTitle": "Daddy's Deadly Darling",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "Teenager Lynn kills her father while he tries to rape her - the receiving officer at the mental hospital cannot convince her that her father is dead. After electric shock treatment she escapes in a nurses car. There is a farm where the manager is unable to feed his pigs on the usual swill, they have tasted blood - Human Blood! Lynn stumbles on the farm, she is looking for work she explains. \"Papa they tell me, what do you see One little girl as deadly as can be.\" The circle begins, feed people to the pigs - then eat the pigs.",
      "tmdbMovieId": 89351,
      "avgRating": 0.5,
      "releaseYear": "1972",
      "numRatings": 1,
      "posterPath": "/6ArLIV9BUaLeewz05h32dseIQVz.jpg"
   }
}