{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0289596",
      "video": false,
      "title": "Urban Warriors",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Brad",
               "gender": 2,
               "credit_id": "52fe4ae5c3a36847f81e73f7",
               "name": "Bruno Bilotta",
               "profile_path": "/2vF1hUDvNivRToIDIoMNO0MZw9v.jpg",
               "id": 27401,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4ae5c3a36847f81e73fb",
               "name": "Alex Vitale",
               "profile_path": null,
               "id": 1050338,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4ae5c3a36847f81e73ff",
               "name": "Bjorn Hammer",
               "profile_path": null,
               "id": 1050339,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Nina",
               "gender": 0,
               "credit_id": "52fe4ae5c3a36847f81e7407",
               "name": " Rosenda Schaschmidt",
               "profile_path": null,
               "id": 1050342,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Angela",
               "gender": 1,
               "credit_id": "52fe4ae5c3a36847f81e740f",
               "name": "Tiziana Altieri",
               "profile_path": null,
               "id": 565403,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "maestro d'armi",
               "gender": 0,
               "credit_id": "52fe4ae5c3a36847f81e7413",
               "name": " Franco Salamon",
               "profile_path": null,
               "id": 1050344,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Julia (as Malisa Lang)",
               "gender": 1,
               "credit_id": "5303bda3925141219264e536",
               "name": "Malisa Longo",
               "profile_path": "/ZtEW6bpgEjVugazUC72YQxgwZc.jpg",
               "id": 99536,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "53878b0a0e0a2614560046b9",
               "name": "Maurice Poli",
               "profile_path": "/3oE1tcK3X85tzGiu4u1GJOGIc7s.jpg",
               "id": 39166,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ae5c3a36847f81e73f3",
               "name": "Giuseppe Vari",
               "profile_path": null,
               "id": 50778,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56eff5709251415ddc0026d3",
               "name": "Piero Regnoli",
               "profile_path": null,
               "id": 49894,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 0.714357,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 110779,
      "vote_count": 2,
      "budget": 0,
      "overview": "Three technicians working in an underground laboratory discover that a nuclear war has destroyed most of the aboveground world. After a brief search for food, the trio find that gangs of murderous mutants want them for their next meal. Will the scientists be able to find other uncontaminated humans to rebuild civilization with, or will they all end up as mutant chow?",
      "similar": [],
      "original_title": "Urban Warriors",
      "runtime": 90,
      "poster_path": "/j85Q9RQQDw2Tr4V50Viiy9D43hU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1987-12-30",
      "vote_average": 2.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Giuseppe Vari"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Piero Regnoli"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0289596/",
      "coverLink": null,
      "actors": [
         "Bruno Bilotta",
         "Alex Vitale",
         "Bjorn Hammer"
      ],
      "reviews": [
         "Three scientists are in their underground lab when WWIII goes down. They make it to the surface and, after 8 short hours (yes, 8 hours), mankind has already broken down into a ROAD WARRIOR do-or-die landscape. Brad (Italian Bruno Bilotta billed as Karl Landgren) is the only scientist to survive and soon finds himself battling a mutant gang (led by THE BRONX EXECUTIONER's Alex Vitale). These mutants are so ineffective in that they fall asleep when the sun sets. Believe it or not, this is the second film I've seen in the past few weeks that borrows footage from THE FINAL EXECUTIONER. Boy, those Italians sure do cannibalize their young. Thankfully, Woody Strode is given a pass in favor of random scenes involving a motorcycle chase and a fight over canned goods. If I see that footage one more time, I might start my own nuclear war. There isn't really much going on here outside of the obligatory chases in a rock quarry. Vitale wears the exact same post-apocalypse chic outfit he wears in BRONX from a few years later. Director Giuseppe Vari did most of his work in the late 60s/early 70s with gladiator and spaghetti western efforts. He bowed out of the film industry with this masterpiece. Also features the wonderfully named Bjorn Hammer.",
         "Urban Warriors has to be one of the most unintentionally funny movies I've seen in a long time. It's the classic case of the rapid degeneration of a film and, shockingly enough, opens with a certain degree of promise. Swiftly though the visage melts away to reveal another hopelessly unoriginal film written by people who amazingly passed the 3rd grade. Ostensibly a MAD MAX clone, URBAN WARRIORS borrows just as much from such gutter \"gems\" as DEF-CON IV, BENEATH THE PLANET OF THE APES, and even JASON AND THE ARGONAUTS, but is severely hampered by a pittance of a production budget and even less enthusiasm. Bruno Bilotta (who would later get to go head-to-head w/ Van Damme in a quality fight scene in DOUBLE TEAM, which ironically costars Ted Rusoff who provides Bilotta's voice in the English language version of this film) stars as a hapless hero who emerges from an underground bunker to find the world destroyed by a nuclear holocaust. The film, while certainly aware of its budget constraints and with its share of disastrous dialog, actually manages to make the most of itself by opening with a focused, low key approach. We follow Bilotta and two other scientists (including Z-movie favorite Maurice Poli) experience a blackout and have to find their way to the surface, facing hardship via rats, cave-ins, and lack of food and water. Okay, so far, so good. However things fall apart immediately upon their emergence as we're soon introduced to nuke mutants and crazed psychopath MAD MAX style bikers who all supposedly evolved within HOURS of the aforementioned apocalypse! The funniest part comes near the end though - after being captured and put on a kangaroo trial for being the last normal person left and a threat to the new order (shades of LAST MAN ON EARTH right here), Bilotta manages to escape when the hopelessly poorly dubbed actress with zero screen presence in charge of the court has a change of heart the following night and springs him from mutant jail while the rest are soundly asleep (sound familiar?). What's funny is that she, the only character in this awful film to experience anything resembling a character arc, is ritualistically and undramatically killed off in the very next scene (a foleyed-in gunshot rings out and an obvious stunt double for her flies off the escape car) and is never even mentioned again! Did she just flake out and not show up for the last day of filming ...or was this entire ending scene just tacked-on after half the cast had left to cash their meager paychecks? Perhaps the director realized just how awful of an actress she was and fired her not bothering to re-shoot her scenes? Who knows? What's even funnier about this chase scene is how completely pointless it is. The hero got away in one of the bad guys' two jeeps (all the production could afford), but this jeep was next to the one the bad guys used to chase him and he was not even in any particular hurry. Now this guy is a SCIENTIST, mind you, and he didn't even think to attempt to disable the enemy car in some way, by say ripping out the distributor wires or even merely deflating the tires?? Good grief. Things like this happen routinely throughout this film, a film called URBAN WARRIORS even though we're never taken to any city - only dirt quarries and the ubiquitous abandoned factory. Also worth mentioning is the multitude of footage taken from FINAL EXECUTIONER, and some nudity brought to the screen in the form of Malisa Longo, who unfortunately is given nothing else to work with. As much of a fan of them I fancy myself to be, it really makes me wonder who the intended audience of these cynical cookie-cutter 80's Italian action movies was. They're so childishly stupid and lazy yet much too vulgar and violent to really be appropriate for any children, but not violent or exciting enough to entice action junkies or gorehounds. While this film has nothing of merit for all but die-hard fans of Mad Max clones, it at least manages to contain a fair amount of comedy gold. It's a crime that MST3K missed it.",
         "The post-apocalypse movie craze was already dwindling in 1987 after the genre had been overwhelmed with dozens of cheap imitations, mainly Filipino and Italian. Despite the redundancy of the craze, Italian director Giuseppe Vari (he of a long and fairly distinguished career in the eyes of the Euro-buff) was persuaded to film one final and unwelcome addition to the Italian post-nuke cycle (okay, not final. Another abomination – BRONX EXECUTIONER – slimed its way from the shores of Italy in 1989). The result is the overlong and often boring URBAN WARRIORS, a trashy and ultra-cheap film that contains all of the clichés we're used to seeing from a good post-apoc film, only even cheaper than ever and filled with plot holes you wouldn't believe. The film starts off in a familiar fashion: we're talking stock footage of atomic explosions and volcanoes, familiar badly-dubbed voices reciting infantile dialogue, a thudding synthesiser score used to vainly generate some excitement. The first plot hole is that although our heroes emerge from their dwelling only days after the bomb, it appears that years have passed on the surface. This is just one of many glaring errors in a particularly unconvincing movie. Anyhow, the action continues in a straightforward manner, as our \"heroes\" hide in some deserted buildings and fight a gang of 'mutant' bikers, who aren't mutants really and instead are just your average murderous meatheads. This film is so cheap that a couple of the major action sequences are actually stolen footage from another, earlier, better Italian post-apocalypse rip-off: namely 1983's THE FINAL EXECUTIONER. The film-makers are cheesy enough to have one of the main characters find a motorbike and costume (black outfit, white scarf) exactly the same as in the earlier film so that the stolen footage can tie together better with the new film. It doesn't work very well. The rest of the action scenes are cheap and poorly-staged, with boring fight scenes and a climax that leaves a lot to be desired. Apart from a totally gratuitous sex scene the film is also missing the usual exploitation values (blood and guts, cheap special effects) that one comes to expect from this genre. The lead is taken by the muscular but wooden \"Karl Landgren\" (hmm, wonder if that's his real name and not just a take on Dolph Lundgren?) who fills a vest well enough but leaves something to be desired in the few scenes he's required to show emotion. The rest of the cast are even worse, not that they get a look in very often. Instead this is a slow and drawn-out film where every plot twist is instantly predictable, where no event comes as a surprise, and where characters live and die without any sign of excitement or relevance. Despite the flaws, the film is sometimes entertaining in a cheesy way for genre lovers, which is why I'm unable to give it a one star rating."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Immagine Productions",
         "Immagine S.r.l."
      ],
      "summaries": ["Three technicians working in an underground laboratory discover that a nuclear war has destroyed most of the aboveground world. After a brief search for food, the trio find that gangs of murderous mutants want them for their next meal. Will the scientists be able to find other uncontaminated humans to rebuild civilization with, or will they all end up as mutant chow?"],
      "budget": 0
   },
   "movielensId": 129677,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-12-30",
      "dvdReleaseDate": null,
      "directors": ["Giuseppe Vari"],
      "runtime": 90,
      "movieId": 129677,
      "title": "Urban Warriors",
      "mpaa": null,
      "actors": [
         "Bruno Bilotta",
         "Alex Vitale",
         "Bjorn Hammer",
         " Rosenda Schaschmidt",
         "Tiziana Altieri",
         " Franco Salamon",
         "Malisa Longo",
         "Maurice Poli"
      ],
      "imdbMovieId": "0289596",
      "originalTitle": "Urban Warriors",
      "genres": [
         "Science Fiction",
         "Action"
      ],
      "youtubeTrailerIds": ["m38DJdfoi2s"],
      "plotSummary": "Three technicians working in an underground laboratory discover that a nuclear war has destroyed most of the aboveground world. After a brief search for food, the trio find that gangs of murderous mutants want them for their next meal. Will the scientists be able to find other uncontaminated humans to rebuild civilization with, or will they all end up as mutant chow?",
      "tmdbMovieId": 110779,
      "avgRating": 0,
      "releaseYear": "1987",
      "numRatings": 0,
      "posterPath": "/j85Q9RQQDw2Tr4V50Viiy9D43hU.jpg"
   }
}