{
   "tmdb": {
      "original_language": "hi",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1433810",
      "video": false,
      "title": "Dhobi Ghat",
      "recommendations": [
         55808,
         21263,
         56338,
         19491,
         61203,
         19637,
         56901,
         42966,
         33556,
         49028,
         208540,
         16987,
         21982,
         85050,
         86004,
         103212,
         53569,
         14705,
         20688,
         147405
      ],
      "backdrop_path": "/ucaF9TqDFwxnezQbRmNb1o8OUPZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Arun",
               "gender": 2,
               "credit_id": "52fe48b2c3a36847f8174c61",
               "name": "Aamir Khan",
               "profile_path": "/jYohlUVkLPFdnDryZ8V1HZkJzDt.jpg",
               "id": 52763,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Munna",
               "gender": 2,
               "credit_id": "52fe48b2c3a36847f8174c65",
               "name": "Prateik Babbar",
               "profile_path": "/1vagpOAVh4KddHCjUJqJSBgoDnl.jpg",
               "id": 126500,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Shai",
               "gender": 0,
               "credit_id": "52fe48b2c3a36847f8174c69",
               "name": "Monica Dogra",
               "profile_path": "/8a3hTM1LtyVu4BMDhvJO9KsMVKx.jpg",
               "id": 223166,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Yasmin",
               "gender": 0,
               "credit_id": "52fe48b2c3a36847f8174c6d",
               "name": "Kriti Malhotra",
               "profile_path": "/fz9Q9PbuQ63QBEEn37kKlSjVR19.jpg",
               "id": 512418,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Salim",
               "gender": 0,
               "credit_id": "599e47b392514110370045a4",
               "name": "Danish Hussain",
               "profile_path": null,
               "id": 1858311,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Vatsala",
               "gender": 0,
               "credit_id": "599e47bdc3a3685a580041c8",
               "name": "Kitu Gidwani",
               "profile_path": "/lpAaynxmON3tIxblRd8eWfAfN6x.jpg",
               "id": 53374,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Pesi",
               "gender": 0,
               "credit_id": "599e47c7925141105c004482",
               "name": "Jehan Manekshaw",
               "profile_path": null,
               "id": 1875564,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Yasmin's Husband",
               "gender": 0,
               "credit_id": "599e47d192514110080046eb",
               "name": "Ashok Varma",
               "profile_path": null,
               "id": 1875565,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Silent Neighbour",
               "gender": 0,
               "credit_id": "599e47dbc3a36859b7004c23",
               "name": "Sanjivani Oagle",
               "profile_path": null,
               "id": 1875567,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Lata bai",
               "gender": 0,
               "credit_id": "599e47e8c3a3685a4000479e",
               "name": "Aasha Pawar",
               "profile_path": null,
               "id": 1875568,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Vanitha",
               "gender": 0,
               "credit_id": "599e47f292514110370045de",
               "name": "Jyoti Pawar",
               "profile_path": null,
               "id": 1875569,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Munna's Client",
               "gender": 0,
               "credit_id": "599e47fd925141100800473e",
               "name": "Babita Sehgal",
               "profile_path": null,
               "id": 1875570,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Karim",
               "gender": 0,
               "credit_id": "599e48089251411008004755",
               "name": "Jitendra Shinde",
               "profile_path": null,
               "id": 1875571,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Amma",
               "gender": 0,
               "credit_id": "599e4813c3a3685a220043c2",
               "name": "Nafisa Amin Khan",
               "profile_path": null,
               "id": 1875572,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Rakesh",
               "gender": 0,
               "credit_id": "599e481ec3a36859ed00450b",
               "name": "Rohit Tiwari",
               "profile_path": null,
               "id": 1875573,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48b2c3a36847f8174c57",
               "name": "Kiran Rao",
               "profile_path": "/sRawiFKYe4aErJb3EE4woSQG0MT.jpg",
               "id": 130959,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48b2c3a36847f8174c5d",
               "name": "Aamir Khan",
               "profile_path": "/jYohlUVkLPFdnDryZ8V1HZkJzDt.jpg",
               "id": 52763,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.007902,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 54890,
      "vote_count": 26,
      "budget": 0,
      "overview": "Arun is a reclusive and lonely modern art painter. Shai is an American banker who is on a visit to Mumbai. Munna is a washerboy also living near Arun and Yasmin. The movie is about these four characters from different class of society and how the lives of four characters are intertwined.",
      "similar": [
         258480,
         27586,
         370663,
         401898,
         244772,
         12793,
         858,
         112160,
         141,
         634,
         376867,
         394117,
         242224,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Dhobi Ghat",
      "runtime": 100,
      "poster_path": "/2vzB2rUZgLVBBsnXxZZGnK9qsmr.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "हिन्दी",
            "iso_639_1": "hi"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Aamir Khan Productions",
         "id": 2140,
         "origin_country": ""
      }],
      "release_date": "2010-01-21",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Kiran Rao"],
      "runtime": 100,
      "synopsis": "Dhobi Ghat (Mumbai Diaries) is the story of four people from very different backgrounds, whose worlds intersect and leave them forever altered. As they find themselves drawn into compelling relationships, the city finds its way into the crevices of their lives, separating them even as it brings them closer... Fragments of their experience - seen through a naïve video diary, black and white photographic images and painting - form a portrait of Mumbai and its people, bound together as they journey through longing, loneliness, loss and love.",
      "writers": ["Kiran Rao"],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt1433810/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ0NDIzMzE3OF5BMl5BanBnXkFtZTcwMDUxNzAzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Prateik, Monica Dogra, Kriti Malhotra | See full cast and crew »"],
      "reviews": [
         "I'm not myself such a big fan of this kind of film, I don't plan on buying the Dhobi Ghat DVD, but I nevertheless give a 9/10 because the movie deserves it. There are writing and technical achievements that you can't take away from the film, even if it didn't appeal to you. The first great achievement of this film is its screenplay, written by Kiran Rao. The danger for a mosaic movie is to have its story drift endlessly or split in too many branches. It's not the case in Dhobi Ghat, and on the contrary it keeps a strong core around which the various characters and stories revolve. What is this core? The city of Mumbai of course, the 5th character of the movie, as the director claims... but not only. The English title of the movie, Mumbai Diaries, could also have been \"Mumbai Visions\". Yasmin makes video recordings of Mumbai as she discovers the city. Shai wants to photograph the real Mumbai. Munna creates another self through Shai's camera, to reach the filmi scene of Mumbai. Arun gets his inspiration by watching the city, or watching the city as seen by Yasmin. One scene I really appreciated is Shai unnoticed taking pictures of Arun watching Yasmin's recordings. So, instead of just having the characters wander in Mumbai, the core of the movie is the sights the city impresses on its inhabitants and our protagonists. The next achievement of Dhobi Ghat is its direction: refined, subtle, it delivers sights of Mumbai in a very intimate way. It's completely appropriate for the screenplay (well, logical, since both story and shooting are from Kiran Rao), and probably helps us rapidly feel close to the characters. I particularly liked all the scenes recorded by Yasmin, featuring small everyday events, but yet really meaningful and emotional. But it's also a strong technical direction, as is enough to prove it that scene where Munna runs in the middle of Mumbai chaotic traffic. A real moment of cinema. To finish, the third good point of the film is its cast. Aamir Khan is flawless, as usual, though in the rather unusual role for him of a loner (he's done that kind of roles before, but not very often). Kriti Malhotra is a particularly moving and very beautiful Yasmin, Prateik Babbar excels in the role of the shy Munna, and Monica Dogra plays very naturally the modern American-Indian Shai. The only thing I liked less in Dhobi Ghat is its end, a bit too open to my taste. But that's very subjective and on the whole the film deserves praise for its coherence, its sensibility and its artistic direction. I would call it a must-see. P.S: People who hated it must only be used to watching Masala stuff. Seriously, the movie can appeal to a large audience, it's not AT ALL an obscure art movie that could appeal only to a very small fringe of audience...",
         "Not much of a story. It revolves around four persons. If you are bored from the movies-for-non-intellectuals (viz, Dabang, TMK..), then this one is also not for you; as it involves poor direction and lack of soul. The main characters: Munna (Muslim Clothes washer), Shai (banker) , Yasmin(Married-Muslim Girl) & Arun (Painter). I think Arun & Shai too are Muslim. MUMBAI DIARIES is a misleading title, as it involves only Muslims. The Narrative is juggling all throughout with recent past & the present. Their is an aunt in Arun's neighboring apartment who is symbolized as Mumbai; always observing, yet non-participating. I was kinda freaked by the Rat killing scene. It was gross and worst part was that it was prateik doing it. I don't like cute people doing nasty things. All the girls who loved Prateik Babbar in 'Jaane tu ya jaane na', will definitely like him in this movie. Actually, I went to see its screening only for him. All the audience was so blown out by his performance. This movie's fate at box-office is highly dependent on Prateik's immensely intuitive acting, which has not much room for it to get better.. It was a good idea of director, to rope in her husband in order to promote the movie. Everyone anticipates the movie to be good & perfect if Aamir is in it. But, I'm sure the viewers are gonna be disappointed. If you love Prateik, go for it. But, if you seek a beautiful performance by cast or an intelligent script then i would say a definite no.",
         "Dhobi Ghaat-Mumbai Diaries:I didn't even know that Mumbai Diaries was a part of the title but thats what the film is truly about.Mumbai is not just a city/habitat but a character which is the common thread linking the 4 human characters.It's like a person molding all of them differently.A bored wife from small town finds Mumbai - a companion,the ocean - a confidante, Mumbai rains- the romance that she could never find in her husband.A girl from New York finds Mumbai to be an exploration of the landscape and of human beings,life in its by lanes and how it changes by day and by night,discoveries and realities of life ,of the wedge still existing between the rich and the poor so simply shown in the way that tea is served to an employer and to a Dhobi.Prateik Babbar perfects the lingo and nuances of a Dhobi/life in slums to the T.Pratik's character is so well defined from how he goes by the railway tracks doing his daily morning ablutions while the sky is still dark, the place where he lives, the bed soaked by the first sign of rains and for some privacy just a curtain made of patches of cloth and no door.Aamir's character becomes intertwined with a woman who is just an accidental and disconnected find and goes on to become a muse and then to someone whose loss is nerve-wracking.There are just too many beautiful moments only to be seen to be experienced in this movie, the first time Prateik/Munna gathers enough courage just to share the armrest in the theater with Monica Dongra/Shai and how happy and blissfully he is doing that, how he finds shame in being a rat killer,how he falls in love but restrains himself even while having the opportunity, how he even tries to make her feel jealous even while realizing the futility of doing so. These characters are what every Mumbaikar is all about, going about our daily lives/chores while still aspire to find love, build a connection with another person,achieve our dreams, find a little romance by the sea, culinary bliss in the Malpua of Mohammed Ali road and Bhel-puri of Juhu. It's all there in mumbai and in this beautiful film. The background score and the Mumbai noise lifts the film, the casting is apt and such a delight and the story lucid.I loved the end.For a first time director its certainly an achievement to transform her vision so beautifully on screen. Sheer Poetry in motion. Take a bow!",
         "What prompted me to write this review is the kind of negativity this movie has received from reviewers on IMDb. I understand that every review written here is an honest opinion, but the number of 1 out of 10 scores I have come across from people who also had time to write a review amazes me. I have taken time to read most of the reviews and I see that they were all disappointed with the movie not featuring Aamir over other actors. I have one thing to say to all of them, THIS MOVIE IS NOT ABOUT AAMIR KHAN!!! There is much more this movie has to offer than Aamir and don't downvote the movie for such a silly reason. I once watched a movie called \"Adrift in Manhattan\", was reminded a lot about it while watching Dhobi Ghat. Yes, the concept of Dhobi Ghat isn't fresh if you have seen many American Independent (Indie) flicks, but it was a courageous attempt if we are talking about Indian Cinema where mass masala has become the recipe for success again. The major thing about this style of directing is that you are either a fan of it or you aren't. This movie does not focus on a burning controversy, nor does it focus on a love couple and certainly does not focus on a one man army daring to bring down the corrupt government. It focuses on 4 common individuals and the common events that happen over a span of few days in their lives. Nothing out of the ordinary happens, just some interesting encounters with people and places which is what the movie is all about. The beauty of the movie lies in how beautifully the writer/director allows the characters to develop based on day to day events. It is so fresh to see this in Indian cinema, I cannot believe such a thing isn't being appreciated. Another major reason this movie is under-appreciated is the fact that you aren't escaping into alternate reality by watching the characters of this movie. The average movie goers, no matter what the nationality is, wants to imagine himself as a guy making beautiful girls fall for him or acquire power or even be an agent of chaos. Watching movies has been the best tool for such a thing, but in this movie, most of the Indian populace would feel like looking into their own lifestyles. Does not sit well with average movie fans, which is why even in Hollywood, movies such as Taxi Driver and The Machinist are critically acclaimed, but not well reviewed by general audience. Of course, over time once the movies age like fine wine, people will realize the kind of masterpiece of Indian Cinema this movie is, like the world appreciated aforementioned Hollywood flicks. I don't know why people are disappointed with Aamir Khan. Does his presence mean his character is supposed to do something extraordinary? For the character he was asked to portray, which I admit could have been pulled off with ease by several others, Aamir did perfect justice. What else is left to complain about? Aamir was fresh as ever to me, and the new faces added to my delight. Really talented bunch that pulled an easy job effortlessly. Overall, I would not suggest this movie to the casual audience, by casual I mean the ones mostly into blockbusters. This movie is more for serious movie goers who mainly are accustomed to the independent Hollywood flicks which really introduced to us great actors such as Christian Bale, Edward Norton and Ryan Gosling in recent years.",
         "Movie is about four people living in Mumbai who in some way or another affect each others life. Yasmin - a newly married Muslim immigrant comes to Mumbai with her husband. She makes home videos for sending it back to her family. She later finds out her husband is having an affair and commits suicide. Arun - a painter starts leaving in Yasmin's apartment and finds the home videos made by her. He gets inspired and paints a master piece. Shai - an NRI investment banker comes to Mumbai to explore her hobby of photography. She has a crush on Arun and finds ways to get closer to him. She also uses the Dhobi ghat as theme for her photography. Munna - a Muslim clothes washer. He has a crush on Shai and helps her in her photography project. OK, now that the cat is out of the bag. Everyone knows how bad the movie fair at the box office. But, very few know the story behind the story of Dhobi Ghat. Dhobi Ghat was the outcome of desperation of the director to cope up status insecurities with mega star hubby. She had scribbled this story after summarizing few mumbai related movies and then assessed the psychology of the movie goers. It was felt that the time is right to give movie goers something that is not glamorous. So, the script was hastily made ready in order to cash the opportunity. It was first assessed with family & relatives. It was decided to follow the proved strategy of first releasing in Canada. Releasing it is Canada for screening was a great advertising gimmick. People like to see well known film stars in person. So, the response at the Canada screening was real good. Then, advertising was started at Movie Theaters in Indian metro cities. It is best to put money in advertising which is more effective and for most relevant audience. However, Aamir had this feeling from the start that this might not 'click' with the audience. So, the expenses made for further advertising were with due economical consideration. It was decided from the very start that the film model will hold; majority of fresh faces, a little known face from a hit movie and of course our well known mega star. With all this the film got bombed. It was a great experience for the director. It was like a training people undergo upon first recruitment. Applause for the strategist!! Movie is a definite no-no!",
         "I dunno why people here have been giving this such bad reviews. I understand this movie is the typical bollywood movie, but that does NOT make it a bad movie. I know many Aamir Khan fans who went to see the film were probably disappointed as it is not like his usual films... I have always enjoyed his work and I think this movie has a LOT more to offer than Aamir Khan. The others actors were INCREDIBLE, and it's amazing that they are just ordinary people. Maybe that's why there were, because in a lot of ways, Mumbai Diaries is about every day life. Kriti (the girl who plays Yasmin) was amazing. I laughed when she laughed and cried when she didn't. I LOVE the way her part was incorporated in the movie and that credit goes to Kiran Rao. Which brings me to my next point. I think Kiran did a wonderful job with this film, and I actually don't see how people could criticize her just because her husband is Aamir. The story lines were written beautifully. Each story had depth and meaning. Every one meant something to one another, but there was no place for them in the each others lives. Munna's character is so endearing and sweet, he makes you fall in love with him from the first scene. And Shai's performance leaves you wanting more. She plays the international girl perfectly, and being a bit of an 'outsider' myself, I know exactly how it is going back to your roots. Shai had it down pat. Yasmin, again, I think for me..was the best character. I loved her from the very beginning. She was innocent and happy and almost child-like, you couldn't help but love her...Aamir was like always, brilliant. The guy's talented as the world knows. This film is not you average Indian movie, but it is a beautiful piece of work and truly captures your attention. Not once was I bored or wondered when the movie would end. Yes it had it had some flaws, main one being the cursing...for some reason that made me laugh. I felt it didn't really go with the situation, and was a bit forced. Other than that, kudos to the whole team for creating this movie. Numbers and 'hit'/'flop' status does NOT make a movie a 'good' movie...every one is different and has their own opinions. For me, this was a great movie. :) Def one of my favourites.",
         "First of all this movie will not appeal the regular Hindi movie audiences who would like to see a hero and a heroine and a romanticism growing with elements of beautiful songs and music. Sorry guys, this is not for you. It will appear tremendously boring for those (Most of the reviews will tell the story). Just change the setting and location, this movie will become a Hollywood movie (Art Type). There is no hero or heroine in the movie. It is a tale of 4 people, their lifestyle, and Mumbai's rapidly disappearing living history. The idea of the movie is little ahead of the regular audiences. If you are into Art Films, watch this and enjoy every bits and pieces. If you do not understand art, please never try to watch this movie.",
         "Before you go on an read this, I would like to make it crystal clear that there is no doubt that I am a big Aamir Khan fan. I love the way he makes movies and puts life into it. He has this ability to show any ordinary story as a special one. We all are aware of this fact but according to me master faltered this time in Dhobi Ghat. I was disappointed to the core because when you go to watch a movie for which you have been waiting since past 2 months and you have put the theme music as your ring tone. Like a loyal patron of Mr. Khan I saw this one on Friday morning show. The movie is about 4 characters, all soaked in different situations. Arun ( Aamir Khan) is a high profile painter, stays aloof from people. He has been shown as a personality having problems to gel in with the social life and a complete loner. Arun meets Shai ( Monica Dogra) at a party. She is a pampered child of a NRI who owns Edulja Builders. Shai is an investment banker in a multi national company and has come down to Mumbai for a break. She intends to see vivid shades of the city and wants to experience the life of Mumbai. Under the influence of alcohol Shai and Arun spend a night discussing their lives, and Shai fell for him. Arun tries to rectify his mistake by explaining Shai about his inability to mix in with the crowd. Munna is a Dhobi ( the movie revolves around him) who attends Shai as well as Arun. Shai has a thing for photography and keeps capturing different shades of Mumbai. She become friendly with Munna in no time, meanwhile Munna's urge to become a model arouses after he came to know Shai can make a portfolio for her, in return Shai takes a promise from Munna that he will show her around. Shai still stalks Arun along with some of her friends. Undoubtedly Munna falls for her, I loved the way his character has been portrayed. Calm, consolidated, loyal towards work. Munna soon realized that Shai like Arun and takes his time to gulp down this fact below his throat. Meanwhile Arun finds out some old tapes of Yasmin( Kriti Malhotra) who used to stay in the flat where he recently moved in. Yasmin who had just moved in to the city ( when the tapes were made) instantly fell in love with it. She has recorded all the places that she visited and misses her younger brother. Arun gets so involved into her tapes that he starts making paintings of whatever he perceived about her life from the tapes. The movie is more of a '' MUMBAI DARSHAN'' that shows various places around the city. At one point I thought the spark in the movie would come up and lift the standards, but unfortunately I was wrong. Very ordinary movie, with pathetic dialog delivery. Most of them are one liners. Don't give me that crap that this is how art movies are made. Come on, we all have seen art movies. Just by showing some strokes of paint, some old Mumbai streets and Munna's innocence you cant get away so easily with the movie. Kiran Rao, I can understand that you a have a celebrity , almost perfect, and a very successful husband, I really sympathize with you, but that doesn't give you the right to make a movie like this. The story makes no sense at all, the ending is abrupt and shortcomings are endless. Aamir Khan productions might have broken even, but people have certainly realized that this time the dish served tasted pathetic, just the garnishing looked tempting. I hope you don't allow your undeserving wife to direct any more so called art movies. The name is very apt. the movie has been pitied just like the clothes at Dhobi Ghat. If I wanted to see Mumbai's beautiful places I would have done that myself, we don't require a movie to show the same.",
         "My God what waste of people's time & money. This is not even a movie. Just a collection of short clips for four people's live. A desperate attempt to combine it into a single clip. I was really hoping to have a gr8 time this republic day, but it was all spoiled by this stupid excuse for a movie. Giving this a 2/10 for prateik. otherwise it would have been a MINUS score!! It was great idea to cast Monica doga, as she neutralizes the classy & royalty looks of Babbar nawab. Would NEVER watch another film by KIRAN RAO!!! Will love Aamir forever, though..",
         "This movie should be stopped from screening at all theaters!! It puts on a really bad image of film industry. A director who starts her career in 2001 in lagaan and then works until 2004 in various others, takes a 3 year gap (;) dunno what happens in this time) and boom comes up in taare zameen pe, jaane tu ya jaane na, peepli live.. and now tries something of her own. I am really sorry for that guy, i know how 'used' he feels. Leaving his ex-wife and putting in line a nice career for this lady!!! The Movie directly goes to the trash bin!!! However, the Babbar kid is great. Other casting is horrible. The side heroine, Monica... omg! i thought she was playing some prostitute or escort, due to her 'kaamwali bai' looks. Please, guys make good movies.!!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Aamir Khan Productions"],
      "summaries": [
         "The lives of 4 different people in the city of Mumbai get entwined by fate and luck; Shai - an investment banker with a penchant for photography, Arun - a lonely painter, Munna - the \"dhobi\" who aspires to become an actor and Yasmin - making a video in her camcorder for her brother, who hasn't been to Mumbai before. The film follows how their lives are changed by the presence of one another. Will it be for better or for worse?",
         "New York-based Banker, Shai, travels to Mumbai in order to take some photographs. She first meets with a reclusive artist, Arun, whose much taller wife divorced him and re-located to Australia along with their son. After spending a night together, she finds out they are incompatible but is unable to get him out of her mind. Arun then re-locates, and she finds out his new address through her Dhobi, Zohaib, rents a room opposite Arun's building and starts to secretly photograph him. She befriends Zohaib, even prepares a portfolio so that he can advance his career as a Bollywood actor, as well as goes to the movies and eats out with him. Things change after Zohaib finds out that she prefers Arun, who is engrossed in watching recorded camcorder tapes of a previous tenant, Yasmin Noor; Zohaib's brother, Salim, is killed; and Shai inadvertently discovers Zohaib's night-time job.",
         "Dhobi Ghat(Hindi-partly English) AKA Mumbai Diaries is the story of four very different people whose worlds collide. As they find themselves drawn into compelling relationships, the city finds its way into their lives. Fragments of their experience - seen through a video diary, black and white photos and paintings form a compelling portrait of Mumbai and its people.",
         "The lives of four people intersect in Mumbai: a washer-man who wants to become an actor, a banker-turned-photographer, a painter looking for inspiration, and a newly-married immigrant who journals her experiences on home video."
      ],
      "budget": 102000000
   },
   "movielensId": 129786,
   "movielens": {
      "languages": [
         "English",
         "हिन्दी"
      ],
      "releaseDate": "2011-01-21",
      "dvdReleaseDate": null,
      "directors": ["Kiran Rao"],
      "runtime": 100,
      "movieId": 129786,
      "title": "Dhobi Ghat",
      "mpaa": null,
      "actors": [
         "Aamir Khan",
         "Prateik Babbar",
         "Monica Dogra",
         "Kriti Malhotra",
         "Danish Hussain",
         "Kitu Gidwani",
         "Jehan Manekshaw",
         "Ashok Varma",
         "Sanjivani Oagle",
         "Aasha Pawar",
         "Jyoti Pawar",
         "Babita Sehgal",
         "Jitendra Shinde",
         "Nafisa Amin Khan",
         "Rohit Tiwari"
      ],
      "imdbMovieId": "1433810",
      "originalTitle": "Dhobi Ghat",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [
         "erIzry9cHpI",
         "Ws1vnnUyX2c"
      ],
      "plotSummary": "Arun (Aamir Khan) is a reclusive and lonely modern art painter. Shai (Monica Dogra) is an American banker who is on a visit to Mumbai. Munna (Prateik Babbar) is a washerboy also living near Arun and Yasmin (Kriti Malhotra). The movie is about these four characters from different class of society and how the lives of four characters are intertwined",
      "tmdbMovieId": 54890,
      "avgRating": 2.91667,
      "releaseYear": "2011",
      "numRatings": 12,
      "posterPath": "/2vzB2rUZgLVBBsnXxZZGnK9qsmr.jpg"
   }
}