{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "tramp",
            "id": 5386
         },
         {
            "name": "sadistic sex",
            "id": 33441
         },
         {
            "name": "pet dog",
            "id": 41316
         }
      ],
      "imdb_id": "tt1614456",
      "video": false,
      "title": "Little Deaths",
      "recommendations": [
         195796,
         71033,
         231082,
         55723,
         223732,
         71326,
         73963,
         10031,
         208656,
         167919,
         80195,
         125558,
         75623,
         65989,
         254174,
         107334,
         15011,
         176990,
         58729,
         28660
      ],
      "backdrop_path": "/iZ77fpUF6ZKiMT3ZH5INbWgc2fz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1015,
               "character": "Richard Gul",
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90fd",
               "name": "Luke de Lacey",
               "profile_path": null,
               "id": 42280,
               "order": 2
            },
            {
               "cast_id": 1016,
               "character": "Sorrow",
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b9101",
               "name": "Holly Lucas",
               "profile_path": null,
               "id": 1200283,
               "order": 3
            },
            {
               "cast_id": 1017,
               "character": "Victoria",
               "gender": 0,
               "credit_id": "54ca8341925141561e00e0e5",
               "name": "Siubhan Harrison",
               "profile_path": null,
               "id": 1420277,
               "order": 4
            },
            {
               "cast_id": 1018,
               "character": "Sorrow's Companion",
               "gender": 0,
               "credit_id": "54ca836c925141635e00a3fd",
               "name": "James Oliver Wheatley",
               "profile_path": null,
               "id": 1420278,
               "order": 5
            },
            {
               "cast_id": 1019,
               "character": "Jen",
               "gender": 0,
               "credit_id": "54ca838cc3a36854a9000829",
               "name": "Jodie Jameson",
               "profile_path": null,
               "id": 1101391,
               "order": 6
            },
            {
               "cast_id": 1020,
               "character": "Frank",
               "gender": 2,
               "credit_id": "54ca839e925141635e00a401",
               "name": "Daniel Brocklebank",
               "profile_path": "/bA44yzPa1imP0g3aM5aRmYhCLUQ.jpg",
               "id": 6367,
               "order": 7
            },
            {
               "cast_id": 1021,
               "character": "Dr. Reese",
               "gender": 0,
               "credit_id": "54ca83ba92514157cc00dcdc",
               "name": "Brendan Gregory",
               "profile_path": null,
               "id": 560167,
               "order": 8
            },
            {
               "cast_id": 1022,
               "character": "X",
               "gender": 2,
               "credit_id": "54ca83d892514157cc00dcde",
               "name": "Christopher Fairbank",
               "profile_path": "/OtvVhW5zzq2J9eiLC0R1H9sZb2.jpg",
               "id": 8399,
               "order": 9
            },
            {
               "cast_id": 1023,
               "character": "Mutant",
               "gender": 2,
               "credit_id": "54ca841b9251416794012006",
               "name": "Christopher Fairbank",
               "profile_path": "/OtvVhW5zzq2J9eiLC0R1H9sZb2.jpg",
               "id": 8399,
               "order": 10
            },
            {
               "cast_id": 1024,
               "character": "Drew",
               "gender": 0,
               "credit_id": "54ca8480925141679401200a",
               "name": "Steel Wallis",
               "profile_path": null,
               "id": 1420279,
               "order": 11
            },
            {
               "cast_id": 1026,
               "character": "Claire",
               "gender": 0,
               "credit_id": "54ca84ca9251416789011e6b",
               "name": "Kate Braithwaite",
               "profile_path": null,
               "id": 1171014,
               "order": 13
            },
            {
               "cast_id": 1027,
               "character": "Al",
               "gender": 0,
               "credit_id": "54ca84e0c3a36854a900082d",
               "name": "Tommy Carey",
               "profile_path": null,
               "id": 1420280,
               "order": 14
            },
            {
               "cast_id": 1028,
               "character": "Lucy",
               "gender": 0,
               "credit_id": "54ca84f4c3a36874b7013628",
               "name": "Amy-Joyce Hastings",
               "profile_path": null,
               "id": 1294462,
               "order": 15
            },
            {
               "cast_id": 1029,
               "character": "Pete",
               "gender": 0,
               "credit_id": "56d59989c3a36870ac00377e",
               "name": "Tom Sawyer",
               "profile_path": null,
               "id": 1584883,
               "order": 16
            },
            {
               "cast_id": 1030,
               "character": "Homeless",
               "gender": 0,
               "credit_id": "5a86ac029251417599036cb7",
               "name": "Jennifer Handorf",
               "profile_path": "/tmbC82ongnTC6Ru6eJIWLX4uUiH.jpg",
               "id": 1290491,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90a9",
               "name": "Sean Hogan",
               "profile_path": null,
               "id": 545138,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90af",
               "name": "Andrew Parkinson",
               "profile_path": null,
               "id": 545139,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90bd",
               "name": "Andrew Parkinson",
               "profile_path": null,
               "id": 545139,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472ec3a368484e0b90c3",
               "name": "Simon Rumley",
               "profile_path": "/dbF5EZxosoZspFUej7KtgoaOWg6.jpg",
               "id": 133403,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90c9",
               "name": "Sean Hogan",
               "profile_path": null,
               "id": 545138,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe472ec3a368484e0b90cf",
               "name": "Simon Rumley",
               "profile_path": "/dbF5EZxosoZspFUej7KtgoaOWg6.jpg",
               "id": 133403,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90d5",
               "name": "Sean Hogan",
               "profile_path": null,
               "id": 545138,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90db",
               "name": "Andrew Parkinson",
               "profile_path": null,
               "id": 545139,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90e1",
               "name": "Samantha Wright",
               "profile_path": null,
               "id": 1200280,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90e7",
               "name": "Rohan Chand",
               "profile_path": null,
               "id": 1190976,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90ed",
               "name": "Urvashi Chand",
               "profile_path": null,
               "id": 1200281,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe472ec3a368484e0b90f3",
               "name": "Milton Kam",
               "profile_path": null,
               "id": 958597,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe472ec3a368484e0b90f9",
               "name": "Camille Benda",
               "profile_path": null,
               "id": 1200282,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.277567,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 66164,
      "vote_count": 30,
      "budget": 0,
      "overview": "Composed of three disturbingly sensual and terrifying short narratives, unified by the twin themes of sex and death.",
      "similar": [
         22705,
         979,
         80752,
         9946,
         39882,
         106646,
         2149,
         6075,
         1278,
         28468,
         1948,
         1813,
         86331,
         13885,
         340837,
         339692,
         263472,
         214,
         8413,
         82023
      ],
      "original_title": "Little Deaths",
      "runtime": 90,
      "poster_path": "/aOHbf3DtzeiP6qDFVtwqmx3moN3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Almost Midnight Productions",
         "id": 25814,
         "origin_country": ""
      }],
      "release_date": "2011-02-25",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "Experimentation...Revenge...All Part of Life's Twisted Games...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Sean Hogan",
         "Andrew Parkinson"
      ],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Sean Hogan",
         "Andrew Parkinson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1614456/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTY1OTcxMzc1MF5BMl5BanBnXkFtZTcwMzAyMDMzNA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Luke de Lacey",
         "Holly Lucas",
         "Siubhan Harrison"
      ],
      "reviews": [
         "\"Little Deaths\" is composed by three segments with short stories of sex, violence, death and revenge in England. 1st segment: \"House & Home\" Richard Gull (Luke de Lacey) and his wife Victoria Gull (Siubhan Harrison) claim that are good Samaritans and invite the starving homeless Sorrow (Holly Lucas) to have a bath and dinner with them at home. However they spike the wine and when Sorrow wakes up, she is tied naked on a bed in the basement. Richard abuses of her and Victoria stays with Sorrow humiliating her while he has a shower. He hears a scream and when he arrives in the basement, he has a gruesome surprise. \"House & Home\" is the best of the three segments and I really had a great surprise with the unexpected conclusion of this sick tale of humiliation. My vote is eight. 2nd segment: \"Mutant Tool\" The former addicted prostitute Jen (Jodie Jameson) lives with her former pimp and drug dealer Frank (Daniel Brocklebank), who also abducts persons to steal their kidneys to deliver to Dr. Reese (Brendan Gregory). Jen gives her best efforts to stay clean and refuses to meet clients from the former \"agency\" where she worked. When Frank asks her to go to Dr. Reese, he gives some tablets for her. Jen has headaches and nightmares and she returns to Dr. Reese, but soon she discovers the truth about the tablets that Dr. Reese gave to her. \"Mutant Tool\" is the weakest segment, with a confused and depressing story of drugs, addictions and abductions. My vote is four. 3rd segment: \"Bitch\" The receptionist Claire (Kate Braithwaite) is addicted in kinky sex with her mate Pete (Tom Sawyer). She has a phobia with dogs and can only satisfy herself with twisted sex. Pete asks her to have normal sex but she invites him to have a threesome with their friend Al (Tommy Carey). Pete does not accept and she has sex with Al anyway. Pete plots revenge against his beloved woman. \"Bitch\" is an erotic tale of revenge totally based on twisted sex and the second best segment. The conclusion is scary with the bitch Claire transformed literally in a bitch. My vote is seven. \"Little Deaths\" is only recommended for very specific audiences. My vote is seven Title (Brazil): Not Available",
         "This is a collection of 3 short films that loosely touch on their subjects of rather twisted stories about sex and death. I guess \"Little Deaths\" is a good title for the movie considering that the French use these words as a metaphor for orgasm. So the title fits each short in this collection. It starts off with the shortest of the three movies entitled \"House and home\" which could fit into any horror anthology. The plot is paper-thin and revolves around a twisted rich and religious couple that lures homeless girls in for their sick pleasure but obviously messed with the wrong girl here. Honestly, this short is not too special... at first the couples dysfunctionality and the hints on their elitist self-conception seemed interesting (with the twist ending it could serve as a kind of class war metaphor) but it just leads nowhere. What still keeps this interesting is the great visuals and the performance of the actress playing the homeless girl. The shots of her on the bed are unmatched throughout the rest of the movie. Second is a pretty strange short about Nazi Doctor experiments, a drug made from the semen harvested from a poor human lab rat fed with human kidneys and a junkie prostitute trying a rehab on the new drug and regretting it. This one is rather on the gritty side visually, throws in some esoteric elements and hints on the connection of all characters involved and how the drug makes the users see the truth when being touched. Its driven by the rather sick central idea and the images of the human lab rat but ultimately falls apart with a \"twist\" ending that make no sense at all and ruined the whole thing for me because there's unconnected dots all over the place. The sexual element in this story feels squeezed into the plot for the sake of it, so the whole story feels forced and fake and definitely is the weakest link in this 3-part-chain. Third off is Simon Rumleys bit entitled \"Bitch\". This one is a rather bleak drama about sexual perversion, power play and dependency. Dogs play a dominant role in the plot, so the title has some irony to it. The look of this part is also on the gritty side, playing a lot with tints which are overused but work well in some key scenes. Like \"Red, white and blue\" this is rather a character study culminating in a revenge that ends with no winners at all. Definitely the best of all three with a great and high impact finale that benefits from the perfect choice of music. Usually these anthology movies fall apart but despite some flaws I can sure recommend it for Rumleys bit as well as for the great cinematography and acting of the first \"House and Home\" part. So check it out if you are into the twisted stuff where drama meets horror.",
         "OK, this is not a GREAT movie, but I am lost with the ratings here. I assume that if you watch this film it is because you like the horror genre, and all three stories do deliver a good and fun time. I think that this is probably the aim: to entertain and amuse, and it delivers. Maybe some stories are predictable, but there is always a funny twist here and there that render them just different. The filming and acting are actually surprisingly good and my feeling was that I got what I was looking for. No more, no less. Definitely recommended to anyone into horror/gore/sex movies with a sense of humor.",
         "When I saw the DVD at the shop I never heard or seen any review of it. But reading what was written on the back I bought it and I must say, I didn't regret it. It's a combination of 3 short stories directed by the writer of \"Summer's Blood\" for example. And were Summer's Blood was low on anything these 3 stories really deliver on weirdness and gore. The first part is the bloodiest one. Part 1 and 2 couldn't really happen but still they deliver the horror you are waiting for. The directors never shade away to show it all, red stuff, blood, and a lot of nudity. The first story as I said is for me the best part, definitely not for the squeamish, the second story is all about experiments done by Nazis and the last part is something weird but the score is so great. All stories have something on their own, one to watch...",
         "I found this movie accidentally, and I am glad that I did. I try to watch all the newest horror movies when they are released. I haven't seen anything this disturbing in a long time. I LOVED it! Very sensual/erotic (little deaths relating to sex) which is a running theme in all 3 short stories. And scary in the context that it could really happen. Very original ideas. Honestly nothing I could compare any of the 3 short stories to which was refreshing. So tired of remakes and sequels. My favorite of the 3 stories was the 1st one, House and Home. Bored married couple trying to spice up their sex life. The hubby picks up homeless women and brings them home for a bit of fun. However, when they bring home Sorrow (yes that is her name), their night of fun turns into a sad event. The 2nd story, Mutant Tool, was a bit sad to me. But seriously sick and twisted. Great original story idea. Won't give it away. I will say though...that was one of the biggest \"tools\" I have ever seen! And finally the 3rd story, Bitch, was about a sadist woman and her masochist boyfriend. Whom she treated worse than a dog. However, every dog has it's day and he gets his in the end. No really, she straps one on and gives it to him! But seriously, he bites her in the ass in the end. Overall, great movie! Great for a new horror movie slut like myself! Not so great for someone with a weak stomach. Bravo for original ideas!",
         "I've always liked horror compendiums going back to the glory days of Vault of Horror or even Dr Terror's House of Horrors, so I snapped this up when I saw it. I'd never heard of this before and presumed it was some low-budget American movie but it's actually British. Unlike the aforementioned movies, there doesn't seem to be any connection between the three stories. Well other than that they are loaded with sex and gore. People in posts I've read seem to dislike the first two stories. The first is basically *spoilers I guess as I'm about to discuss the storyline* about a twisted posh couple who get their kicks drugging and abusing homeless girls. The ending is pretty left-field but what made it for me was the nasty, aggressive wife. The actress clearly relished the part and she was a joy to watch. And I think that's a point I should make - the acting throughout is pretty impressive without exception. And that really is saying something. Especially as the only guy I recognised was an actor in the second story, which is a genuinely bizarre tale, where it's never entirely clear what's going on. And I mean that in a positive way - it's genuinely unsettling. The third tale - Bitch - has dark s and m-y themes running through it - come to think of it all three tales have people being tied up. Anyway, don't want to give anything else away. Check this out - it's an undiscovered treat.",
         "4.6 is what this gets on IMDb.....really???? Tell me whats wrong will this??? three tight little debauched stories of the macabre that are so well acted and directed that I have to say this was a masterpiece. I think anyone for a penchant for the darkside should be smiling down on the dark ominous salacious gods that put this together. I've always loved anthologies since Creepshow and than Trick or treat came in 2007 and that to me was the best of the best. Years later Theatre Bizarre rekindles my great memories for these kinds of films and than I am introduced to this masterpiece. My favourite of the sanguineous triactor was \"bitch\" but the other two are very close in nature. Just three stories that will keep you on the edge of sanity for however long before you snap and realize how outlandish this film really is. Just flawless!!!!! Thank you England..........",
         "I heard it had some BDSM elements, so, I figured I'd give it a shot. I really shouldn't have. A complete waste of potential. And worse than that, actually offensive in it's \"unsophistication\". For example, the first story sets up this couple. They have a really dark dynamic going on. In order to please her, he kidnaps women for her to use. He doesn't \"really\" want to do it, but he loves her, he wants her, and so he does this for her. You get to take a look into something twisted, and into something broken, into something really dark. How he selects and charms the homeless girl, and how they play their parts as she's at their place. It had the potential to intimately explore the minds of human predators. And so far, the writer was spot on. So far, this was authentic. It was scary because it was real. And I think that, in the end, it had to come out of the writer. He was aware of this darkness inside him. He put it on paper, and then on screen. But then, after he got this far, he basically apologizes for it. \"I'm sorry that I showed this, here, let me make it up. Let me take it all back. Actually, the homeless girl is a monster that eats human flesh and tortures them now That makes it alright, right?\" No, it doesn't. It makes it worthless. You had the chance to make a point, and you wasted it by running away from it. And doing so in an incredibly \"unsophisticated\" way. And you did the same exact thing in the third story. I didn't really watch the second one. So I can't comment on it. The \"good guy\" in the third story absolutely horrified me. But not in the way it was intended. I was horrified there was a person who could write someone like that. He was in an unfair relationship by his own choice. And then he decides it's not for him anymore. And he can leave at any time. But he doesn't. He stays. And he pretends. And he lies. And he manipulates. And he has his girlfriend then raped by dogs, dogs being the thing she has a paralyzing fear of. That is NOT a good guy. That is the ACTUAL monster here. Not the girl who gave him spankings and what not, which he agreed to in the first place. Just because the girl does A doesn't make it OK for the guy to do B, and after your protagonist has someone RAPED BY DOGS you're not allowed to portray him as a hero that overcame some kind of odds. He overcame a weak, little, scared woman. Kudos to him. The kindest interpretation of that would be \"blaming the victim\" behavior. The words that came from my mouth when I saw it though were more along the lines of \"despicable\". I don't find the character despicable. I found how he was written, how his motivations and actions were justified to be despicable. Again, you had a perfectly excellent chance to make a point, in this case about power exchange relationships, and how they can be dehumanizing, and increasingly heartless. And again, it was authentic, it was real, until you decided to take it all back as if to apologize for showing what you had so far in the first place. With some conviction and follow through the creator of this might actually create something worthwhile down the road. This though is not that.",
         "The cinematography is good. The mood it is setting, I also liked that. The stories weren't that bad either. Though they had some downfalls (the second one trying to hard with the twist, I guess). I don't feel good about blaming the actors either. Maybe the stories only sound good on paper, but the direction wasn't that good. I can't say for sure what element didn't seem to fit. I can only say, that the sum of it's (3) parts, wasn't as satisfying as I hoped it would be. You have to have a heart for anthologies in the first place of course. Not to mention the fact that this isn't for the squeamish either. But I reckon you have read this before somewhere about this movie. Do not rent it, if you can't handle the gore and nudity!",
         "We live in a bizarre world where flesh and fantasy blur the lines of reality and acceptable behavior. The dance of Eros and Thanatos being omnipresent throughout this film culminating in appropriately designated Little Deaths - le petite morte - contextualizes three effective stories. The scariest aspect of this film is that any of the stories could happen. You know the people. They live down the street, around the block, or perhaps even across the hall. The film's dark and somber cast is perfect. It brings you down from any giddiness that might result from an all too common torture porn treatment of the subject matter like Saw or Hostel. This film seduces you. You find yourself increasingly conflicted as pleasure crosses over with pain. But before you consider this an homage to safe, sane, consensual fetish gone horribly wrong, each story is firmly enough rooted in the world of the sociopath to reassure you that your well-honed moral skills would prevent you from dallying beyond the bounds...maybe. Sit back. Enjoy. Cuddle up close with a loved one but not too close. It might give your significant other ideas too.",
         "I thought and thought for entire seconds just how I might make this sound even vaguely interesting. Then I gave up. Little Deaths finds three directors taking turns to depress the audience with tales that range all the way from drab and morose to dull and dark. The first story tells the tale of a well to do couple who dabble in living on the edge, only to find the edge has moved. It isn't that interesting. The second story introduces a wonder drug from a frankly gross source with incredible qualities. It also wasn't interesting, but at least it had one mildly original concept. The third story was about the very definition of the odd couple. It was terrible, and the ending was even worse than terrible. It was dumb. The first story was sorta horror I guess. The second a Nine Inch Nails film clip concept. The third was just dumb. Final Rating – 4.5 / 10. Look there were moments in the 90 minutes where I wish I understood just what the hell was supposed to be entertaining or subversive about all this, in the end I decided I am happier not knowing. To me this is a waste of time. Lap it up emo-kids.",
         "This movie started with some real promise, and then tanked harder than the Titanic sinking to the floor of the N. Atlantic. The movie, or rather three short stories, each brought a little bit of terrible to the movie that left Little Deaths with a score of 2/10. Story 1) Rich family brings in a homeless girl in to their home and gives her a meal. Then the family proceeds to drug, and then rape her. The homeless girl then unleashes her vampire power and kills the wife. Only part of this movie which could be considered \"horror\". Story 2) Male nudity... Guy sells sperm pills.. No further comment. Story 3) Crazed girlfriend forces her boyfriend to pretend to be a dog while they have sex. Eventually, it turns out that she is terrified of real dogs. The boyfriend gets revenge on her by unleashing a pack of dogs into her apartment. Never watch with kids or your parents. Either/or would lead to the most awkward 2 hours of your life. It was absolutely awful. I wish I could say there was a redeeming quality associated with this film, but there was certainly none present. If you would like to enjoy your night, skip this one. Drugs/excessive nudity/swearing",
         "I am watching this right now. Very interesting movie. The first story is awesome. I thought it was going to be the usual stupid, sadistic torture porn made popular by Saw and Hostel. The twist, however, is brilliant and very funny. That episode gave me impression of a very good EC horror comic. The second one has a Martyrslike premise with some elements of Stephen King (visions, etc). I thought it was a terrible let down in comparison with the first. Certainly a very disturbing torture porn notion about this drug enhanced fluid which is used for industry but quite frankly the acting and characters are so weak so it is hard to care for any of them. The ending or the story had no twist at all and the ending is pretty much nonsensical. At least it could have been elaborated what actually has happened. The third one has some very impressive bsdm. Good use of music as well. Very good description of a psychopath. Moreover, I could follow the emotions and transitions. I think the first and the third rely more on comedy. Anyway, very good movie.",
         "Films which face head on themes of fetishism, masochism and fear have the potential to move an audience to a place where they would not expect to go, even with the knowledge that they are about to watch a film about the darkest corners of humanity. La petite mort, the French idiom, refers to a calmness or melancholia surrounding the orgasm, but it does also refer to the orgasm in general and so the misnomic nature of the film can be forgiven. All three are fast, intense and short explorations of sexuality with barely any pace below frantic and very little concept of transcendence, the very meaning of the phrase \"little deaths\". Every orgasm we witness: the rape, the post-pub lust and indeed the post-poor-sex vibrator-induced are cheap, quick thrills. Episode two, perhaps, could be excluded from this issue when a character describes the strange constant-orgasm state as being \"not human\", but equally it's not really about an orgasm at all, not as we know them. If episode two is analysing what a \"little death\" is, it is creating something non-human which renders it, although fascinating to watch, defunct. The horror genre has the uncanny ability to disgust and deeply affect a viewer, and the only thing we ask in return is that it doesn't make fun of us, by drawing us to invest ourselves emotionally in the film and then being half-hearted with the storytelling. With Little Deaths, the half-heartedness is in the overselling of the idea. There was no effort to create empathy away from the bedroom-nature of the characters which basically renders the film no more than porn minus explicicity. Furthermore themes of drug use, prostitution, and bondage and discipline, dominance/submission, and sadomasochism are all problematic. It feels as though the filmmakers are telling stories on these subjects because they want to and not because they themselves are invested in the activities. Dialogue regarding the drug use and prostitution in episode two does not read naturally and detracts from what is designed to be a naturalistic film. More serious, though, is the motivation for the male lead's breakdown at the end of episode three. The filmmaker spends a great deal of effort in establishing that the sexual relationship is of bold and exploratory deviancy, and that the relationship between the two is one of a deep, and necessary, trust. With the line \"I don't deserve you\" and the subsequent reply, this trust is strongly established. There is no foreshadowing of the finale but for the use of dog-imagery and the main inciting incident is one which would, in a relationship such as theirs, not cause such a great stir but simply cause discussion and a break up, considering that there was little attempt to stop it at the time. Either there was a lot more hate felt for the female lead by the male lead, which we are not told about, or the narrative makes fun of the Dominant and submissive relationship by devaluing it. The performances from the actors were strong and very well directed, which adds value to each story and ensures that we do feel empathy with each, and the cinematography was at times magical. Unfortunately it is difficult to maintain a relationship with this film and its characters, however aesthetically strong and empathetic, when there are such issues with its very core.",
         "A trilogy of tales in the old anthology mode, the first offering, \"House and Home\" has an affluent couple bored by mundane lives, and looking for a little fun. The husband brings home a homeless woman for a sex game. The woman provides some entertainment and this segment has a small twist of an ending; very average, overall a 5/10' Story number 2 involves a woman, a hooker and former junkie who is recovering with the help of a boyfriend, her previous pimp, now involved in bizarre medical experimentation's with a doctor using a new drug for detox. It gets a bit sadistic and I would give it a 6/10. Number 3 is \"Bitch\" a couple behaving badly, including the boyfriend wearing a dog mask. This one is a complete waste of time and pointless. The last five minutes is wickedly clever but the lead up is tedious and silly. A 3/10.",
         "What can I say, it is ridiculous beyond belief. A few short stories, that are absolute trash, made into 90 minutes of complete and utter drivel. The acting is awful, the stories were conceived by someone who should be in a mental hospital. If you are into sadistic sh?t - Nazis doing penis transplants, blending kidneys in a mixer to feed some bloke strung up with a horses dick being held captive to produce buckets of sperm so this Nazi Dr. can turn the sperm into tablets that then in turn make the people who take the medicine into the guy who was initially chained up! Only this time, the chained person is a woman who overdosed on the medicine - and she now has a horses cock! Honestly, do yourselves a favor and go and watch a real movie - go and watch \"Carnage\" This garbage really should never have had been made.",
         "When I sat down to watch \"Little Deaths\" it was because the movie was labeled as a horror movie. However, you have to look long and far to find anything that is even remotely in the shade of being horror. The movie is a collection of three tales, each more bizarre and boring than the other. The first story, \"House & Home\" is about an outwardly Samaritan Christian couple who do small deeds to help those less fortunate. But their agenda is far from being pure, helpful and selfless. But their 'good' deeds don't go unpunished when they decide to 'help' the wrong person. This segment was initially interesting, but then turned out to be steadily on a downward hill when you find out the motive behind the couple's acts of charity. And it totally topple at the end where it just becomes ludicrous. The second story, \"Mutant Tool\" is about an alternative way of creating recreational drugs. And this was actually the most interesting and captivating of the three stories. But still it wasn't overly impressive, but compared to the other two segments, it was outstanding. The third and final story, \"Bitch\" is nothing short of softcore porn. It was unbearable to watch, and there was so much nudity and sexual deviation in it that was it was a pain to sit through. The story is about a couple that enjoy some bizarre, twisted and perverted sexual games. For a horror movie, then \"Little Deaths\" was a disappointment unlike anything else. There wasn't a single scary moment in the entire movie. At best, the movie rates as bizarre and twisted, but surely not as a horror movie. Having suffered through all three stories in the movie, I can honestly say that this movie left no lasting impression on me at all, and it will be forgotten by tomorrow. This movie doesn't have any appeal or any valuable contents to support a second viewing at all. I am sure there is an audience out there for this particular type of movie (and stories), however, I was not in the target audience.",
         "I watched this film on the strength of the reviews and wasn't impressed with this film at all. The first story about the homeless girl was by far the best. It was great to see the nasty rich couple get what they deserved. I would've got the girl chop off his penis and make him choke on it as was said in the early exchange between the man and the girl. The acting was extremely good in this short story. The way the woman taunts the girl calling her a worthless nobody before the girl gets her revenge was great. The second part was bizarre and by far the weakest of the lot. A prostitute hallucinating on drugs made from nazi experiments from the semen of a man fed on the livers of murdered people. WTF. Vivid imagination but too weird an idea that didn't work for me. The third installment was a good idea of a man treated badly by his girlfriend who gets his revenge on the 'bitch' in the real sense of the word. However I thought this was badly acted and executed. The characters weren't fleshed out properly and no explanations were given for the mood swings of the girl or why their relationship was as it was. The ending disappointed as it was left to the imagination what the dogs did to the girl. Apart from the first installment I was disappointed with this. So just 3/10 from me.",
         "There are several unrelated stories in this \"little deaths\" movie. However, there is a common theme: bloody gross, and that seems to be the only trick in this movie. Since there is very little story and no continuity from one story to another, you might as well surf the web for gross photos. After watching two stories, I stopped. The plot gets thinner. I like scary movie, but these are not scary; they are just exercises in gross makeup effects. I believe this genre is started by the movie Saw. Since I did not finish watching the DVD, I may be missing some brilliant finale, but probably not. I borrowed the DVD from a local library. I hope nobody pays to see this.",
         "While most horror anthologies have a central unifying theme, or at least, a concluding wrap-up, the three short episodes in this film are totally unrelated and unconnected. This is the novelty or perhaps the weakness of this film. The first episode rocks, and Holly Lucas hit me like a tornado in this one. She was too pretty and sophisticated anyhow, to be playing the part of a homeless vagrant. With hardly any lines, she looked so vulnerable initially, when bound and raped.. so stunningly seductive when topless, with her ample, swinging assets, she herself mounted her captor, and so frightening, when she reverted to her true feral form at the end. Its her film all the way. The second episode is dull, confusing, morbid and OTP. Useless to discuss it. The third was a wicked tale of revenge by a mild guy on his overly aggressive and perverted girlfriend. Quite novel. LOL. But wholly unrealistic. I would vote 9/10 for Holly alone, but overall, the other episodes drag down the entire film, and it gets an average 4/10 from me.",
         "An abhorrently orgasmic ejaculate of short films, Little Deaths is a ghastly, decadently exploitative spunkfest of misogyny and misandry. Harnessing obtuse pontification in sexual gratification, ergo an inevitable ruckus with the BBFC, the tawdry trio unrelentingly goad us with all amounts of bodily fluids in ode to the anniversaric copulation of Horror's bride and groom: Sex and Death. Best of three 'House and home': A cult of personalities - the homeless and the upper class compete in a tete a tete. Bland at first and hugely predictable, yet filled with sorrow. 5/10 'Mutant': Nazi experiments, grafted giant cocks, blended kidneys and a nostalgic hint of thalidomide. Yep. 6/10 'Bitch': Vengeance is a dish best served in a dog bowl. The mightily poetic MTV finale will scorn the imagination. 9/10 Submissive, alienated and emasculated: the stereotypes of the traditionally hegemonic patriarchal society are explicitly smashed to smithereens. The revised totalitarianism demarcated is a world in which women not only rule, but where men are reduced to nothing but breadwinning toys or abused pets. Owing much to the anti-authoritarian exploitation films of the 70's, notably Russ Meyer and John Waters, horrors 'final girl' becomes the 'final boy'. A perversion in postmodernity, all three segments are triumphantly difficult to visually consume. For their daring vulgarity and literal buckets of bodily stew (mostly semen), the consequential subordination of context is marginally excessive. The seeded theme of compulsion via addictions and obsessions manifested to restrain partnerships in all vile states of toxicity - physical, sexual and emotional - relays an equally visceral reply in its counteract. The literal sex=death rhetoric is quintessentially satiric, a fervent leaf from the episodic 'Creepshow' tales, ending on a righteous or incredulous note. Though there is much to celebrate in its art-house attire, the niggling question still resides: did its visionaries go too far to give too little? For the first two instalments there is an unbalanced focus on crossing boundaries, in it purest form merely because they could. The third ('Bitch') is the piece de resistance, it's pedigree refined by a role reversal in rape-revenge. Urine, vomit and man-gravy galore, be prepared for the candid unpleasantries in store.",
         "This was the opening movie at Frightfest Glasgow one year. And you can see why they would open with this, because it is just not very good. (they tend to start with the weaker movies, to build up. smart) One of the stories is pretty good, at least better than the others, but all in all this is a little bit of a mess. We get some half way disturbing images, some bizarre stuff. But it's just not even close to cool enough. Understandable, as the directors (Q&A) talked about how this idea had come to them at a pub, over a lot of beers. Yeah, maybe skip the ideas that come from beer next time, yeah? One of the story has some originality to it, but mostly, the movie as a whole, just wants to be original, without actually being original.",
         "Three part anthology starts with Director Sean Hogan's \"House and Home\" as a married couple takes in a homeless woman (Lucas) for the night. They offer her a long bath, a sumptuous dinner and expensive wine. The couple's motivations turn sinister as the homeless woman wakes up chained and nude where she is raped by the husband (De Lacey). A cool twist towards the end of this segment proves the couple has made a serious error in their would-be-victim who isn't what she seems. The second segment is Director Andrew Parkinson's \"Mutant Tool\" in which a former prostitute named Jen (Jameson) takes a new drug to help her fight her addictions. This leads to an increase in sexual appetite and a psychic connection with a man who is chained up and is being slowly tortured to death in bizarre fashion. The third story is Director Simon Riley's \"Bitch\" in which a domineering woman named Claire (Kate Braithwaite) orders her boyfriend Pete (Sawyer) around and humiliates him in front of her lovers. Pete finally has enough and plots a brutal revenge on her. Bizarre and sexually twisted seems to be what is motivating this horror anthology. Hogan's 'House and Home' is by far the best and the end twists are actually scary. The other segments are just weird and decadent, not scary. Even Hogan's segment has some middle uneasiness to it with some of the torture of the homeless girl until the ending is revealed which saves it. Watch the first segment and then pop it out."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Almost Midnight Productions"],
      "summaries": [
         "\"Little Deaths\" is composed by three segments with short stories of sex, violence, death and revenge in England. 1st segment: \"House & Home\" Richard Gull and his wife Victoria Gull claim that are good Samaritans and invite the starving homeless Sorrow to have a bath and dinner with them at home. However they spike the wine and when Sorrow wakes up, she is tied naked on a bed in the basement. Richard abuses of her and Victoria stays with Sorrow humiliating her while he has a shower. He hears a scream and when he arrives in the basement, he has a gruesome surprise. 2nd segment: \"Mutant Tool\" The former addicted prostitute Jen lives with her former pimp and drug dealer Frank, who also abducts persons to steal their kidneys to deliver to Dr. Reese. Jen gives her best efforts to stay clean and refuses to meet clients from the former \"agency\" where she worked. When Frank asks her to go to Dr. Reese, he gives some tablets for her. Jen has headaches and nightmares and she returns to Dr. Reese, but soon she discovers the truth about the tablets that Dr. Reese gave to her. 3rd segment: \"Bitch\" The receptionist Claire is addicted in kinky sex with her mate Pete. She has a phobia with dogs and can only satisfy herself with twisted sex. Pete asks her to have normal sex but she invites him to have a threesome with their friend Al. Pete does not accept and she has sex with Al anyway. Pete plots revenge against his beloved woman.",
         "Composed of three disturbingly sensual and terrifying short narratives, unified by the twin themes of sex and death."
      ],
      "budget": 0
   },
   "movielensId": 130038,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2011-02-25",
      "dvdReleaseDate": null,
      "directors": [
         "Sean Hogan",
         "Andrew Parkinson",
         "Simon Rumley"
      ],
      "runtime": 90,
      "movieId": 130038,
      "title": "Little Deaths",
      "mpaa": "R",
      "actors": [
         "Luke de Lacey",
         "Holly Lucas",
         "Siubhan Harrison",
         "James Oliver Wheatley",
         "Jodie Jameson",
         "Daniel Brocklebank",
         "Brendan Gregory",
         "Christopher Fairbank",
         "Christopher Fairbank",
         "Steel Wallis",
         "Kate Braithwaite",
         "Tommy Carey",
         "Amy-Joyce Hastings",
         "Tom Sawyer"
      ],
      "imdbMovieId": "1614456",
      "originalTitle": "Little Deaths",
      "genres": [
         "Horror",
         "Thriller",
         "Romance"
      ],
      "youtubeTrailerIds": ["hMEuvD5ZTvw"],
      "plotSummary": "Composed of three disturbingly sensual and terrifying short narratives, unified by the twin themes of sex and death.",
      "tmdbMovieId": 66164,
      "avgRating": 1.66667,
      "releaseYear": "2011",
      "numRatings": 6,
      "posterPath": "/aOHbf3DtzeiP6qDFVtwqmx3moN3.jpg"
   }
}