{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "farce",
            "id": 10280
         },
         {
            "name": "dinner party",
            "id": 191260
         }
      ],
      "imdb_id": "tt0021189",
      "video": false,
      "title": "Not So Dumb",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dulcy",
               "gender": 1,
               "credit_id": "52fe4dc59251416c75140347",
               "name": "Marion Davies",
               "profile_path": "/tprYuX0944egt854y6JFnZeW2AT.jpg",
               "id": 34742,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gordon",
               "gender": 2,
               "credit_id": "52fe4dc59251416c7514034b",
               "name": "Elliott Nugent",
               "profile_path": "/2VpK69oI5uOSnk4Ei4gv30K5Bkm.jpg",
               "id": 89914,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bill",
               "gender": 0,
               "credit_id": "52fe4dc59251416c7514034f",
               "name": "Raymond Hackett",
               "profile_path": "/72XgDUKqVO9WSIPvvBsaBogoxqE.jpg",
               "id": 122142,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Leach",
               "gender": 2,
               "credit_id": "52fe4dc59251416c75140353",
               "name": "Franklin Pangborn",
               "profile_path": "/lVePP6Rv9qxqayS22DrtzUF1fP8.jpg",
               "id": 13966,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Forbes",
               "gender": 1,
               "credit_id": "52fe4dc59251416c75140357",
               "name": "Julia Faye",
               "profile_path": "/zOoz6IVKVabPOVVR7nB09QCHx64.jpg",
               "id": 130494,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mr. Forbes",
               "gender": 0,
               "credit_id": "52fe4dc59251416c7514035b",
               "name": "William Holden",
               "profile_path": null,
               "id": 89501,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Van Dyke",
               "gender": 2,
               "credit_id": "52fe4dc59251416c7514035f",
               "name": "Donald Ogden Stewart",
               "profile_path": "/eS4tJHSN4fm81yXXiUXnvoRnmGu.jpg",
               "id": 14676,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Angela",
               "gender": 0,
               "credit_id": "52fe4dc59251416c75140363",
               "name": "Sally Starr",
               "profile_path": "/jlyevAGAHmIIdUhlCpGiYhvGWmw.jpg",
               "id": 1178567,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Perkins",
               "gender": 2,
               "credit_id": "52fe4dc59251416c75140367",
               "name": "George Davis",
               "profile_path": null,
               "id": 120701,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Blair Patterson (uncredited)",
               "gender": 2,
               "credit_id": "582aeda4c3a368360103d43e",
               "name": "George Irving",
               "profile_path": "/js2u7KGDeYSKf4eOrVQJxDPfaUP.jpg",
               "id": 13823,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "(uncredited)",
               "gender": 2,
               "credit_id": "582aedb59251417b18042835",
               "name": "John Miljan",
               "profile_path": "/6C1k1y0gVOq3nSoBG29CJPJs1N1.jpg",
               "id": 90000,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dc59251416c75140343",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "530cd088c3a3685bee0013cf",
               "name": "King Vidor",
               "profile_path": "/2NN8iywApiKiI0nwKuv5SKadEpT.jpg",
               "id": 29962,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "530cd0a0c3a3685c120013b5",
               "name": "Marion Davies",
               "profile_path": "/tprYuX0944egt854y6JFnZeW2AT.jpg",
               "id": 34742,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53f319250e0a2675ac00832f",
               "name": "Adrian",
               "profile_path": "/fnsEX7RnTRGuh32x8WmHrtz25D5.jpg",
               "id": 9064,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "53f3193f0e0a2675a9008785",
               "name": "Cedric Gibbons",
               "profile_path": "/w8tc9iVH87Iu1KKFDZ9B99NhnBc.jpg",
               "id": 9062,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "53f319540e0a2675bc0081e3",
               "name": "Blanche Sewell",
               "profile_path": "/wkDhyQuhaxZJZqx7UdnSIcyOR6o.jpg",
               "id": 9058,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "53f3197e0e0a2675ac008338",
               "name": "Edwin Justus Mayer",
               "profile_path": null,
               "id": 2489,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 1,
               "credit_id": "54039836c3a3684366005722",
               "name": "Wanda Tuchock",
               "profile_path": null,
               "id": 1010628,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54039857c3a3684366005729",
               "name": "Douglas Shearer",
               "profile_path": "/3kH8o524WTYSGBLcCx9v9ERP9sj.jpg",
               "id": 27969,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "55534207925141499e001877",
               "name": "Oliver T. Marsh",
               "profile_path": null,
               "id": 127523,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.325397,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 221395,
      "vote_count": 2,
      "budget": 0,
      "overview": "Not-so-smart chatterbox Dulcy Parker does and says all the wrong things, but they right themselves to prove she's not so dumb after all.",
      "similar": [
         1903,
         862,
         194,
         2758,
         42888,
         19913,
         55721,
         544,
         222936,
         433310,
         50544,
         59962,
         339397,
         10527,
         1278,
         38,
         116,
         1578,
         1586,
         28468
      ],
      "original_title": "Not So Dumb",
      "runtime": 76,
      "poster_path": "/zCv62N3S2FO07vNNhO5uxQoQiTT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1930-02-02",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["King Vidor"],
      "runtime": 76,
      "synopsis": null,
      "writers": [
         "George S. Kaufman",
         "Marc Connelly"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021189/",
      "coverLink": null,
      "actors": [
         "Marion Davies",
         "Elliott Nugent",
         "Raymond Hackett"
      ],
      "reviews": [
         "I have a feeling that Marion Davies fans have voted in droves to artificially elevate her scores because many of her films are rated in the high 7s or 8s. I have enjoyed many of these films but I hesitate to place them that highly. A case in point is \"Ever Since Eve\", her last movie, coming in with an 8 which in my opinion is highly overrated as is the score for this film, a 7.8 as of this writing. Be that as it may, \"Not So Dumb\" is actually superior to \"Ever Since Eve\". Davies is absolutely delightful playing a ditsy socialite trying to advance her boyfriend's career. Her body language makes the film which otherwise has little contact with reality. She lives in a mansion with no apparent income, neither she nor her brother work and yet they enjoy a quite opulent lifestyle. This very fact undermines the film's central premise because if she were wealthy why then does she not set her boyfriend up herself? The other characters are merely ornaments although two are somewhat noted minor Hollywood personalities: Julia Faye, C.B. DeMille's longtime companion who appeared in all his films and Sally Starr, known as the \"pocket Clara Bow\" for her diminutive size.",
         "Stiffly-done farce in which Davies plays an obnoxious character, and the result is not only obnoxious but almost unbearable. Way before Lucy, this is the wacky dame who puts her foot in her mouth too many times and in endless variations. Kaufmann and Connelly's lines fall flat, and Vidor seems to be a little frightened of the microphone in this early talky. Some of the lesser characters are funny in a Rodney Dangerfield sort of way, and the \"other William Holden\" is good as a pompous businessman.",
         "Sound quality is TERRIBLE for most of the film, but i guess that can be forgiven since talkies hadn't been around very long. Marion Davies stars as Dulcy Parker, who is hosting a get-together for the big shot \"Forbes\" coming into town for the big business deal. Keep an eye out for the always-fun Franklin Pangborn as \"Leach\", who gives the weirdest hand-shake we have ever seen, and Dulcy tells us he has some secret... Raymond Hackett is Dulcy's sarcastic, wise-cracking brother. Hackett had about ten speaking roles, and seven of those were in 1930 alone! One of the funniest roles here is the facial expressions on Perkins the butler - George Davis doesn't have a lot of lines, but his appearance as the guests come and go add a lot to the performance. Elliott Nugent is \"Gordy\", Dulcy's boyfriend, trying to close the deal. Lots of yackety yack, since this is based on a play. This was a remake of the silent 1923 version, and it would be remade again in 1940 with Ann Sothern and Billie Burke. There are some bad editing cuts here and there, but the conversations are mostly clever and fun, with some sight gags and one-liners by various characters. I think some of the comedy bits, including Pangborn's big scene in the living room, were probably very funny back in the day, but just seem to go on and on by today's standard. Directed by the amazing King Vidor, who had done it all in the early days of Hollywood. Original play written by Kaufman, who had also written \"Man Who Came to Dinner\" and \"You Can't Take it with You\", also made into films.",
         "Not So Dumb (1930) * 1/2 (out of 4) The third film between director King Vidor and star Marion Davies isn't in the same league as SHOW PEOPLE or THE PATSY and really comes off as a major disappointment. Based on the play Dulcy, Davis plays that character, a blond moron who tries to help her boyfriend get his foot in the door of a big business by inviting his boss and his wife over for the weekend. Once there, Dulcy plays host to try and make herself appear smarter than she actually is. I've said this about a lot of films from this era but here it goes again. This is an early talkie that is so impressed by the fact that words can be heard that it never knows when to shut up. You can tell Davies and Vidor aren't too comfortable with the new format because it's hard to look at this film and see any of the director's trademarks. The film looks rather ugly and some of the editing will leave you scratching your head and wondering if only one take was done on certain scenes and they had to cut away from it quickly. Davies, God bless her, gives it her all but it seems Vidor just let her go off in any direction and the end result is a bit of a mess. Her character is a complete idiot and Davies gets this across just fine but after a while she starts to get very annoying because she's reduced to silly facial gestures and various facial \"shock\" moves. Franklin Pangborn steals the show as Leach and George Davis is also good as the rather strange butler. Fans of Davies will probably watch this no matter what but the only others that might be mildly interested are those interested in early talkies. I'm sure they've had to sit through some pretty rough films so this here is yet another. I've yet to see the original 1923 version or the remake in 1940.",
         "I'm surprised that so many IMDb voters have given Not So Dumb a '10', because much as I enjoy Marion Davies, this is surely one of her poorest efforts. That's all the more puzzling considering that she co-produced this dud with director King Vidor, a director who made very few misfires in his career. This is the prototypical creaky early talkie, a static drawing room comedy that will leave you wilting in your armchair. Even the presence of prissy Franklin Pangborn can only elevate this mediocre material so far, though George Davis delivers an amusing performance as Davies' felonious butler. All in all, tremendously disappointing, unless you're happy watching Marion repeatedly express surprise and astonishment over the course of 76 minutes.",
         "In 1930 taking advantage of the fact that sound demanded that the movies now have lots of dialog what was better than a play where the title character keeps a constant stream of chatter. Not So Dumb was the first sound version of the George S. Kaufman-Marc Connelly play Dulcy and had Lynne Fontanne as its star on Broadway. A silent version of the play was made in 1923 that starred Norma Talmadge. Every reassessment of Marion Davies has always said that William Randolph Hearst's obsession with Davies had to do roles as the heroine in such costume drama as When Knighthood Was In Flower and Janice Meredith. Her real talent lay as comedienne and the role of Dulcy is a natural for Davies. Best line in the film was her ever so innocent put down of Franklin Pangborn about \"it's the early worm that gets the bird\". You got to wonder who actually thought up that gem, Kaufman or Connelly. The play is set over a 24 hour period and it deals with a small party that Dulcy is hostess. It's to put over a business deal that her husband Elliott Nugent is trying to get William Holden to agree to. Nugent is repeating his role from the stage. Dulcy was prototype of the dumb blond, a character Marie Wilson honed to perfection in several film and on radio and TV. In our modern era Jessica Simpson is the successor. Watching this I also wonder why Burns&Allen never did a version of Dulcy for the screen. This was the perfect vehicle for them, Gracie was born to play the title role. I'm surprised that this is never revived it seems. It would have been so right for Jessica Simpson. Still adjusting to sound Davies really hones this one to perfection. Having not seen a later version with Ann Sothern I wonder how it compares?",
         "This early talkie is a bit creaky—sound recording technology certainly wasn't perfected yet, for one thing. It's also very evident that it's a movie version of a stage play—there's no doubt it's \"stagey,\" which bothers some people. So it takes some doing, but Marion Davies' wacky performance eventually overcomes these distractions. Davies is both nutty and charming as Dulcy, a wealthy young socialite who is determined to help her fiancé put over a big business deal. Elliott Nugent is fine as the fiancé who would much prefer that Dulcy mind her own business; his performance, like his character, is pretty much overshadowed by the much bigger and bolder Davies personality. Old character actor William Holden is very good as the blustery and flustered business magnate with whom Davies is trying to match up Nugent. Davies' extremely expressive face places her much more in a class with fellow comedians than with other female movie stars of the day; while her screen presence is nothing at all like, for example, Joan Crawford's—it's not entirely unlike Stan Laurel's or Harold Lloyd's. Her appeal lies in a kind of well-meaning goofiness that other characters may find irritating but is both hilarious and endearing to us viewers. A great example: the drawing room scene in which a house guest sings a song while Davies aggressively shushes everyone and then noisily unwraps a box of candy. The comic plot is okay and there is some funny dialog. But the main attraction of the picture is certainly the star—this is lots of fun for fans of Marion Davies and her other comedies.",
         "Marion Davies never mentions Not So Dumb in her memoir The Times We Had, and it's easy to see why. While praised by Leonard Maltin as a precursor to the screwball comedies of the 1930's and 1940's, Not So Dumb is a not so entertaining weekend with ditzy Davies and guests. Davies is trying to give her boyfriend's career a boost by mixing with important guests during the weekend. However, she has a huge problem with malapropisms and saying the wrong thing at the wrong time generally. A few scenes of this are funny, but it grows tiresome as the film goes along, absent any sophistication in the script, supposedly based on the play by Dulcy by George S. Kaufman and Marc Connelly. Supporting players Franklin Pangborn as Vincent Leach, George Davis as Perkins the Butler, and Playwright David Ogden Stewart in a rare acting role as Skylar Van Dyke/Horace Patterson are more entertaining. King Vidor directed and co-produced the film with Davies. ** of 4 stars.",
         "In sunny California, madcap party hostess Marion Davies (as Dulcinea \"Dulcy\" Parker) tries to impress stuffy businessmen for fiancé jeweler Elliott Nugent (as Gordon \"Gordy\" Smith). Tailor-made for Ms. Davies from dependable material (a hit play and silent film adaptation as \"Dulcy\"), \"Not So Dumb\" doesn't live up to the new title. The soundtrack is primitive, with Davies' voice sounding the worst. MGM's production team, director King Vidor, plus a supporting cast led by cute Raymond Hackett (as Bill \"Willie\" Parker) and comedian Franklin Pangborn (as Vincent Leach) help a little. Davies scatterbrain character is evidenced by her mixing up sayings, like: \"The early worm always gets the bird,\" and \"I just knew there was a woodpile in the\u0085\" Not so funny. **** Not So Dumb (2/2/30) King Vidor ~ Marion Davies, Elliott Nugent, Raymond Hackett, Franklin Pangborn",
         "This, the first sound picture based on the Broadway hit \"Dulcy\", is possibly the worst Marion Davies movie I've seen. She monopolizes and mugs her way through every scene. There is even a very un-PC comment she makes toward the end of the scene in the billiard room. Her co-stars' acting is awkward and stilted. The only exception is Raymond Hackett as Davies' younger brother. I haven't seen any of his other work, but he seemed to have a natural presence before the camera. Then, of course, there is Franklin Pangborn's stereotypic characterization. The editing and continuity are awful. The director also wastes a chance to see a rare acting role from the writer Donald Ogden Stewart(Sr.).",
         "This was an egregious misfire, considering the talent involved. I kept waiting for a belly laugh or even a chuckle, but I could barely force one throughout the picture. Marion Davies was a talented comedienne, but here her timing seemed off and she appeared ill at ease with the material. All I could think of was that this must have worked better onstage, as it was adapted from a play by George S. Kaufman and Marc Connelly, two of the biggest names on Broadway at the time. To top that, the Director was King Vidor, one of Hollywood's best. I thought the website rating was overly generous by half, which is what I rated it; half of it.",
         "I usually like Marion Davies. She was an underrated comedienne and if William Randolph Hearst hadn't been so ham handed and controlling with her career, she'd be better remembered today for her talent rather than as the Susan Alexander caricature in Citizen Kane. At any rate, this is not one of her better films. She comes off as beyond stupid and annoying. You wish that you could reach into the TV and slap her when she refuses to shut up. This is a brief synopsis of the movie: Gordy (Elliot Nugent) wants to sell part of his business to stuffy Mr. Forbes. (William Holden. NO, NOT THAT WILLIAM HOLDEN. This is the original one.) Anyway, Mr. Forbes and his family for some reason are spending a weekend with Dulcy (Marion Davies), her brother a butler who is on parole and other questionable people that Dulcy has found along the way. The scene that I am talking about with the racial slur is when Mr. Forbes, Dulcy's brother Willie and Gordy retire to the billiard room. However, they can't find the billiard balls. Dulcy comes in and finds them, one being used as a darning egg. She then says that it would be \"in a woodpile with a n****r.\" My jaw dropped to the floor and I had to rewind the DVR just to make sure I heard it correctly. I am shocked that TCM would allow such a word in a movie they show, even if it is a pre-code. After getting over the shock, we learn that Mr. Forbes daughter wants to elope with one of Dulcy's guests, a screenwriter named Leach, played by Franklin Pangborn, who in the beginning of the film where he's introduced, gives Gordy a limp wristed handshake, which makes one wonder why she is determined to run off with him. Before the \"billiard scene\" Dulcy makes a remark to him to the effect of all of the men are in the billiard room, alluding to the fact that Mr. Leach may not be a real man. Well by the end of the film, when you think Dulcy has made a mess of everything, all works out well. Mr. Forbes daughter marries her real love, Willie, and Gordy gets to sell his business at a higher price, thanks to Dulcy. This might have been a decent film if 1) If they had better camera work. (The camera stays on the character's faces way too long.) 2) Better editing (hence, the camera staying on everyone way after the reaction has ended.) 3) A less silly character for Ms. Davies. A fine comedienne in her own right, there is no need for her shrill and yappy performance. She could have(and had done in the past) done this character a lot more subdued and gotten the point across.4) That racial slur. There was no need for it in the movie. also, I was shocked when Mr. Forbes says \"damn\" in the beginning of the movie and that got pass the censors. Therefore, based on the above, I give it a 4/10."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Cosmopolitan Productions"
      ],
      "summaries": ["Not-so-smart chatterbox Dulcy Parker does and says all the wrong things, but they right themselves to prove she's not so dumb after all."],
      "budget": 0
   },
   "movielensId": 130130,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1930-02-02",
      "dvdReleaseDate": null,
      "directors": ["King Vidor"],
      "runtime": 76,
      "movieId": 130130,
      "title": "Not So Dumb",
      "mpaa": "",
      "actors": [
         "Marion Davies",
         "Elliott Nugent",
         "Raymond Hackett",
         "Franklin Pangborn",
         "Julia Faye",
         "William Holden",
         "Donald Ogden Stewart",
         "Sally Starr",
         "George Davis",
         "George Irving",
         "John Miljan"
      ],
      "imdbMovieId": "0021189",
      "originalTitle": "Not So Dumb",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Not-so-smart chatterbox Dulcy Parker does and says all the wrong things, but they right themselves to prove she's not so dumb after all.",
      "tmdbMovieId": 221395,
      "avgRating": 2,
      "releaseYear": "1930",
      "numRatings": 1,
      "posterPath": "/zCv62N3S2FO07vNNhO5uxQoQiTT.jpg"
   }
}