{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "animal attack",
            "id": 5160
         },
         {
            "name": "water monster",
            "id": 7994
         },
         {
            "name": "piranha",
            "id": 158045
         }
      ],
      "imdb_id": "tt1587807",
      "video": false,
      "title": "Mega Piranha",
      "recommendations": [
         42905,
         44548,
         35891,
         27727,
         63749,
         39158,
         44809,
         17306,
         18177,
         100669,
         31196,
         83101,
         24683,
         71628,
         7292,
         52454,
         17911,
         48333,
         27860,
         54099
      ],
      "backdrop_path": "/fNSxch9HXdUK2YnMnjhPsXkozBJ.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "UTubeNazi",
         "id": "52a94d79760ee37285105973",
         "content": "OMG, You cant kill it with a Nuclear Bomb, but a U.S. Soldier with a knife. OMG the stupidity.",
         "url": "https://www.themoviedb.org/review/52a94d79760ee37285105973"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jason Fitch",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b27b",
               "name": "Paul Logan",
               "profile_path": "/lx2bemjfnJpHqLREnvUOC0YFRZh.jpg",
               "id": 98157,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Dr. Brian Higgins",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b27f",
               "name": "Jude Gerard Prest",
               "profile_path": "/iOXXKpw4LBKPvXfkvSNwkuCMtWX.jpg",
               "id": 105374,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Lt. Julia",
               "gender": 1,
               "credit_id": "52fe47239251416c9106b283",
               "name": "Cooper Harris",
               "profile_path": "/2yaTl4a74koYGffWCZbyUABQnvy.jpg",
               "id": 127472,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Captain Jonas",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b28b",
               "name": "Clint Browning",
               "profile_path": "/qD7A5wxG3CuGHTFgIaAvAHGvUcQ.jpg",
               "id": 102807,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Lt. Stritch",
               "gender": 0,
               "credit_id": "52fe47239251416c9106b287",
               "name": "William Morse",
               "profile_path": "/hrwminfZeqELFfaD5csD8zNDu1n.jpg",
               "id": 109794,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Submarine Captain Jim",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b28f",
               "name": "Matt Lagan",
               "profile_path": "/4hEcqTUQ3sPfFpTYitJba16VxwT.jpg",
               "id": 131740,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Mort",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b293",
               "name": "Jonathan Nation",
               "profile_path": "/yhIRbVE9dWZlzCQFoe00fkA2Es4.jpg",
               "id": 95988,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Ensign Filbert",
               "gender": 0,
               "credit_id": "52fe47239251416c9106b297",
               "name": "Joseph Porter",
               "profile_path": null,
               "id": 80881,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Sarah Monroe",
               "gender": 0,
               "credit_id": "52fe47239251416c9106b29b",
               "name": "Tiffany",
               "profile_path": "/Ai8kneSQt1VMGPNrT3n1LcWh9cq.jpg",
               "id": 148120,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Bob Grady",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b2b3",
               "name": "Barry Williams",
               "profile_path": "/k6TXjKCksh7AnbyKAnlJQrBo1ep.jpg",
               "id": 1212425,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Dr. Eli Gordon",
               "gender": 2,
               "credit_id": "52fe47239251416c9106b2a3",
               "name": "Jesse Daly",
               "profile_path": null,
               "id": 229689,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Mom",
               "gender": 0,
               "credit_id": "52fe47239251416c9106b2a7",
               "name": "Jesel Ortloff",
               "profile_path": null,
               "id": 1092009,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Steph",
               "gender": 0,
               "credit_id": "52fe47239251416c9106b2ab",
               "name": "Lola Forsberg",
               "profile_path": null,
               "id": 1085502,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Jane the Reporter",
               "gender": 0,
               "credit_id": "52fe47239251416c9106b2af",
               "name": "Jillian Easton",
               "profile_path": "/wbXv3iYUDRCb2ON5LUiLbxrxKo1.jpg",
               "id": 1006619,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Colonel Antonio Diaz",
               "gender": 2,
               "credit_id": "575beb64c3a368483a00182a",
               "name": "David Labiosa",
               "profile_path": "/eMuL5HjGvJbf0O7DacLpreRJ7BW.jpg",
               "id": 1217016,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47229251416c9106b271",
               "name": "Eric Forsberg",
               "profile_path": null,
               "id": 112019,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47229251416c9106b277",
               "name": "Eric Forsberg",
               "profile_path": null,
               "id": 112019,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.205886,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39522,
      "vote_count": 60,
      "budget": 3000000,
      "overview": "When a science experiment goes horribly wrong, gigantic fish gain appetites for human flesh.",
      "similar": [
         75174,
         119450,
         135397,
         258489,
         308531,
         571,
         17692,
         762,
         2062,
         332567,
         806,
         71668,
         635,
         43593,
         44363,
         37227,
         29343,
         42245,
         579,
         847
      ],
      "original_title": "Mega Piranha",
      "runtime": 92,
      "poster_path": "/f7jol00uMdExQWVKY7buBZOiL41.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/ic2bTizdzRLDVzAvN7MXdUg3WQV.png",
         "name": "The Asylum",
         "id": 1311,
         "origin_country": "US"
      }],
      "release_date": "2010-04-10",
      "vote_average": 2.9,
      "belongs_to_collection": null,
      "tagline": "They were created to save mankind. Something went wrong.",
      "adult": false,
      "homepage": "http://www.syfy.com/movies/originals/index.php?pageid=127",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Eric Forsberg"],
      "runtime": 92,
      "synopsis": "he film focuses on the Orinoco River in Venezuela, where a strain of genetically modified piranha have escaped into an isolated tributary of the river. Through human interference of the local environment, the megapiranha manage to escape from their isolated spot and swim downstream, killing all that crosses their path. The megapiranha gradually make their way towards Florida at the height of the tourist season. After the outbreak, a team including Special Agent Fitch and Sarah Monroe, work to contain the megapiranhas within Venezuela. They begin to get into trouble with the authorities when they attempt to cross over the Venezuelan border. Not having proper clearance and documentation, Special Agent Fitch resorts to using the diplomacy of his fist and drives off. He is pursued by Colonel Antonio Diaz in a high-speed chase through the jungle. Throughout the chase, Fitch alternates driving a Toyota Camry and Hyundai Elantra while Diaz is seen at different points in a GMC Jimmy, Chevrolet Suburban, and Ford Explorer. Fitch escapes by stealing a helicopter and heads to the International Super Bunker (ISB). During the journey, the helicopter runs out of fuel and Sarah Monroe rigs the emergency oxygen tank to the fuel line to make it to the ISB safely. The megapiranhas continue to move north, consuming two battleships and a nuclear submarine. They eventually reach south Florida, where they kill at least five Puerto Ricans on a beach and manage to blow up two hotels. Meanwhile, the only force that can stop them is located at the ISB. After the megapiranhas prove impervious to both torpedoes and depth chargesand even a nuclear missile fails to stop themSpecial Agent Fitch and Professor Sarah Monroe conclude that the only way to stop the megapiranhas is to face them in their own terrain: underwater. An army of SCUBA divers armed with guns (really, NERF Longshots painted black) would make the huge fish bleed, causing them to enter a feeding frenzy and kill each other. If this were to fail, then a massive nuclear strike would be used to destroy the megapiranha, as well as most of Florida. In the middle of the operation, Colonel Diaz arrives in a helicopter, presumably using multiple oxygen tanks to fuel his journey. The Colonel aims to get revenge on Agent Fitch and throws a rope into the water to trick him into climbing up into the enemy helicopter. Fitch, upon his arrival, shoots the pilot in the mouth with a flare gun, which causes the pilot's head to explode. Fitch then uses a homing beacon to attract a megapiranha, jumping out of the helicopter shortly before it is consumed by the fishy behemoth. Fitch is pursued by the megapiranha that ate the helicopter, eventually hiding in a reef where the megapiranha is unable to follow. When the piranha opens its mouth, Fitch shoots his gun at the helicopter still in the beast's jaws. The helicopter explodes, killing the piranha. The other megapiranha converge on the bloodshed and Fitch is able to escape as the piranha enters a feeding frenzy and begin tearing each other to pieces, seemingly resulting in them wiping themselves out.",
      "writers": ["Eric Forsberg"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1587807/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU3ODY2NzMwNV5BMl5BanBnXkFtZTcwNjg4MzI1Mw@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Logan, Tiffany, Barry Williams | See full cast and crew »"],
      "reviews": [
         "If you are a fan of really bad movies, and I am, this is a must. I think it was conceived and written by a bunch of teen aged boys who aren't into women yet (no T and A). It has everything else that they love. It has lots of car chases in exotic locals, with big shiny American cars racing down dirt roads, lots of stuff blowing up, lots of shooting and a lot of really, really big fishies. The dialog is what you would expect, also conceived by a bunch of little kids. The scenes along the river are just plain stupid. Why, when you know that the big fishies are able to jump for unknown distances, would anyone stand on a river bank. It is doom from the word go...in every sense of the word. I am 70 years old and have seen some really badly conceived plots and dialog, but this one is a keeper.",
         "Mega Piranha is on, right now on the SciFi Channel (I refuse to call that channel what its actually been renamed; that's just bloody stupid). There are piranhas as big as jumbo jets jumping out of the river and exploding on impact. Some bad-ass martial arts dude just used some mixed martial arts to kill some baby piranhas which were as big as refrigerators. Anyway, I was just talking to a buddy of mine. Years ago back in junior high, my friends and I used to come up with stupid ideas for movies to pass the time away in school. Well, one of those ideas were about giant piranhas as big as Godzilla terrorizing some city. We were kids and we knew that was frig gin' stupid. But Asylum Films, they're laughing all the way to the bank. I went hundreds of thousands of dollars in debt to get a master's degree to teach English Lit. to kids who don't even give a crap when I could have taken all those stupid ideas for movies way back in the day and made them for the SciFi Channel. Jesus! I am an idiot!",
         "Well, folks...Syfy has done it again. Another sub-B movie churned out in the same tier as Mega Shark vs. Giant Octopus. I normally get a laugh out of this sort of flick; the purple prose script with cheesy delivery, the absurd plots with more holes than a screen door and the shockingly bad cg are all fodder for mocking and jeering with friends. Still, these movies can only achieve the rank of risibly bad classics if the writers, actors and directors are completely oblivious to just how terrible a film they've unleashed upon the world. Syfy originals seem to exist for the sake of being entertainingly awful, and it is that bent-on-wrecking-this-train mentality that makes this and many other movies lame. The movie follows the same formula that plagues the made for TV nature-horror scene. Follow these steps and you too can be a Scifi writer! Take some normal animals that aren't much of a threat and make them huge/super strong/intelligent (pick any super-animal attribute. It really doesn't matter). Science creates then tries to control the bastard chimeras, but of course scientists are nerds, so they should fail. This is usually because the military/some evil corporation ruins everything with snafu after snafu. This step is important because it serves as a diatribe to meddling scientists, overconfident military leaders and corporate America. Your script now has depth and you can tote your worth as a writer that cares about the issues. Insert the big, bad protagonist. He should be able to punch and kick his way through hordes of monsters that have ripped through countless crewman number 6s and still look damn good doing it. You can also add a strong independent and flawlessly attractive girl to the script. The more independent you make her, the more substance the script has. It is important to acknowledge that women are every bit as amazing your beefcake hero and your creation will be so revolutionary that even a feminist won't scoff at it(you'll also have a slightly better chance of scoring with the lead lady). You now have the tools to start your own script. I don't want to flood the market with great writers, so you'll have to figure out the end for yourself. Use a lot of fake blood, clean up obvious plot holes with single lines like, \"Yeah, well things change,\" and insert as many bikini-clad women as your budget will allow and I'm sure everything will be fine. This movie works on many of the same levels, and it is sure to be one of the most critically acclaimed thrillers of this or any year. Just remember: regardless of whether a piranha is doubling in size every 2 days or 36 hours, it is growing exponentially.",
         "Everyone loves a bad monster movie, right? There is a great charm in the so-bad-it-is-good film, and for a while Mega Piranha delivers the goods. Alas, but then the unremitting awfulness wears you down due to endless repetition of scenes and CGI that is so bad that it can't be unintended (I hope). Add the unlikely return of a really rubbish villain (flying a helicopter that seems to be able to circumnavigate the whole world), and a truly bizarre finale that suggests that everyone just got bored and pulled the plug, and you just have ultimate tedium (well, for me, at least). Still, it is not everyday that you get to see Tiffany playing a hydro-biologist, and I'm hoping to see Britney Spears as a Navy Seal in 'Mega Shrimp' and Ke$ha as the US President in 'Monster Manatee' vs. Giant Gecko' some time soon.",
         "This is one of the worst movies I have seen on SyFy. Their ability to make good movies decrease with every new \"original movie\" they make. While the location shots were great the film itself was one of the worst I have ever seen. Paul Logan was the only good actor in the movie. It was hard to see Barry Williams diminish his star quality by doing such a low quality picture. Tiffany proves she has no acting skills at all. She could not deliver lines while doing anything else. One scene she was running from danger, had to stop, deliver lines and wait for someone to give her a cue to run again. The extras were just as bad! Doesn't look like they were given any direction in what to do. One scene they go to arrest the hero and he's not there. They just stood there and looked around, no movement just stood in look. I would only recommend this film to film students wanting to know what to do to make a quality film.",
         "I had too much fun laughing at this to vote it lower than a 5. Piranhas are already pretty fearsome creatures. So naturally, some scientists genetically mutate them. Things go wrong; the creatures escape into a Venezuelan river, and start to \"grow exponentially.\" So a big guy on steroids named Fitch is sent to aid Venezuelan soldiers to fight the menace. They look like Castro impersonators, and end up chasing him around, for whatever reason. When the Sec. of State looks like a Brady and is named Grady, you know the \"Asylum\" movie makers are just \"winking at the audience.\" The action-film meets sci-fi motif is played with over-the-top gusto: look for piranha jumping high into the air and slamming their victims down like a sledgehammer. I didn't know they could do that. Even mutated ones. Steroid Fitch kick-boxes an entire school of piranha senseless in a great Jackie Chan moment. The super-sized creatures crash themselves into Key West hotels. Battleships get turned into Fish Filet sandwiches. The TV news reporter doing play-by-play of a piranha attack, the bit about tail fins, Col. Valdez inexplicably showing up in Florida; hilarious. Most of the time it makes absolutely no sense what's going on, with absurd scientific plot holes everywhere. There's no intent for this to be taken seriously; and taken at face value it's classic B movie silliness.",
         "Alright, this movie is bad. B, A, D! Bad! I had an expectation that it would not be a super great movie, being a SyFy movie and all, but wow! This was beyond anything I had imagined or could imagine. First of all, they kept showing the same scenes over and over and over and over and over... And those scenes were not even nice to look at. Already here the movie was starting to go downhill. The effects in the movie were laughable at best. There weren't a single moment in the movie that were above mediocre. As for the acting, well it was strained and hard to digest. But at least they gave it a shot! This movie is good for one thing only, and that is cheap laughs. I am going to make my friends watch it, because it cannot be put into words how bad this movie really is. \"Mega Piranha\" is a movie that should be avoided if you are a movie-lover. Or if you are going to watch it, do it solely for the super cheesy effects and the lack of everything else!",
         "This movie is pure awesomeness! The Piranhas in this movie are the size of whales! They're jumping 1000ft into the air and eating helicopters! They're jumping into buildings and exploding! They can't be killed even with nuclear weapons! They could probably jump up and eat satellites in outer space if they wanted to. But if you poke even one of them with a toothpick, it will bleed and all the Piranhas will eat it and eat each other in a feeding frenzy, and apparently that is the secret to killing them. And apparently there is some clown in this movie, who is even cheesier than Vin Diesel (if that's possible), and he can kill the Piranhas by just kicking them. I mean what's not to like? Rarely have I ever seen a movie of such quality. I was is pure awe of this awesome spectacle of a movie from beginning to end. How could someone create such an awesome movie? I just couldn't believe the greatness of this movie. It has to be seen to be believed.",
         "This was truly an experience. to keep people interested they just add some girls in bikinis! coral reefs in the amazon river? giant fish jumping into a building warranting an explosion? the same footage replayed and mirrored throughout the film presumably to save money. the acting was atrocious, melodramatic and in many scenes just bizarre. favorite moment was where the fish (that were supposedly huge and knocking down buildings with explosions) were attacking Jason and he was just lying on his back kicking them away. take this movie seriously and you will not enjoy it. don't take it seriously and you will at least be able to laugh at it",
         "This is a great movie.....if you're looking for a laugh! I found myself absolutely killing myself with laughter through out the whole movie. The drama of it all is what really gets you. The acting is extremely intense and serious which just adds to how funny it actually is. Although most of the storyline makes sense for most of the movie, the resolution isn't really clear and leaves you thinking, 'what?!?'. And the chemistry between Fitch and Monroe wasn't obvious at any stage of the movie until the very end. This was probably due to the acting for Jason Fitch who seemed angry for almost the entire time except for on an unusual occasion when he would laugh awkwardly and then go back into his hard, aggressive face. It's hard to imagine any kind of romance could come from that, but I guess he was just trying to portray himself as a tough and solid army guy. All in all, it was a wonderful movie to watch when you're in desperate need of a good laugh."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Asylum, The"],
      "summaries": [
         "Mega Piranha (also known as Megapiranha) is a 2010 science fiction disaster film produced by The Asylum. It was directed by Eric Forsberg and stars Tiffany, Paul Logan and Barry Williams. In the tradition of The Asylum's catalog, this film is a mockbuster of Piranha 3-D.",
         "A mutant strain of giant ferocious piranha escape from the Amazon and eat their way toward Florida."
      ],
      "budget": 3000000
   },
   "movielensId": 130384,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2010-04-10",
      "dvdReleaseDate": null,
      "directors": ["Eric Forsberg"],
      "runtime": 92,
      "movieId": 130384,
      "title": "Mega Piranha",
      "mpaa": "R",
      "actors": [
         "Paul Logan",
         "Jude Gerard Prest",
         "Cooper Harris",
         "Clint Browning",
         "William Morse",
         "Matt Lagan",
         "Jonathan Nation",
         "Joseph Porter",
         "Tiffany",
         "Barry Williams",
         "Jesse Daly",
         "Jesel Ortloff",
         "Lola Forsberg",
         "Jillian Easton",
         "David Labiosa"
      ],
      "imdbMovieId": "1587807",
      "originalTitle": "Mega Piranha",
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["pFhSogGnu4I"],
      "plotSummary": "When a science experiment goes horribly wrong, gigantic fish gain appetites for human flesh.",
      "tmdbMovieId": 39522,
      "avgRating": 1.23077,
      "releaseYear": "2010",
      "numRatings": 13,
      "posterPath": "/f7jol00uMdExQWVKY7buBZOiL41.jpg"
   }
}