{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard T. Heffron"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "John Sacret Young",
         "Phil Caputo"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081443/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2MjY0NzQxNV5BMl5BanBnXkFtZTcwODUwNjk5Mw@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Brad Davis, Keith Carradine, Michael O'Keefe | See full cast and crew »"],
      "reviews": [
         "The movie is a true story. The book gave me bad nightmares, especially the chapter \"Officer in Charge of the Dead\". Saw it's premiere on TV, which had big time graphic warnings at the end of each commerical break. Sad to say - I doubt the REAL original cut exists. To date I've rented 3 different versions on VHS, none matched the original and one was cut to deliver a different theme - pure butchery. Your experience with this flick will vary wildly, depending upon which release you've happened upon. Probably Brian Denehey's best performance ever. One release I rented cut all the Marine Officer Training school and Ofcr in Charge of the Dead chapters entirely. My advice - read the book, then look for the longest version of this masterpiece that you can find. This sorely needs a restored DVD release. Marine Officer veterans of Vietnam should see this flick, it's the only Vietnam movie that won't leave a bad taste in their mouths. Many fine performances, amazing jungle photography. Fave quote; \"You stay here - you learn!\"",
         "Found this really neat and tight little tv-production on an old vhs x-rental tape the other day. Wholeheartedly recommendable to anyone with the slightest interest in the psychological aspects of warfare. Hardcore action/shoot 'em up-fans should proceed with care, as emphasis is not on the bodycount...luckily!! Great acting all around...perhaps best of all by the possible \"VC-agents\" in minor roles. Oh, and Ken Foree...of DAWN O T DEAD fame...does a funny scene as an MP. Danish tape runs a fully 3 hours and some secs(pal system) and a hard find for collectors....I was dirt lucky. Cheers",
         "I served my time in Korea. Five years after I came back old time school mates of mine were being drafted for Vietnam. I later heard their stories over quarts of beer and doobies. This movie IS their story. I was sitting on my couch watching the big ambush scene and it scared the hell out of me in my own living room. The scene where Brian Dennehy tells Lt. Catuto that 19 year old kids in Korea checked their rifle sights by shooting down Korean farmers came home to me. My brother, who fought from the first of the Korean war through the Chosen battle, told me the same thing. This movie has it all. The boredom, the terror, the frustration, the slaughter, the sadness, the futility. And it is real. It starts out slow but when it kicks in it gives no quarter, cuts no slack and takes no prisoners. If you ever carried a rifle in a combat zone at night alone you can relate to it. But even if you have no recollection of the Vietnam war era you can still sense the reality.",
         "This was one of my favorite books when I first read it overseas as a young Marine grunt back in 1978. When I returned stateside just a year later I ,along with seven other Marines from my unit, was chosen to serve as an extra in this Phil Caputo movie which was filmed (mostly) just south of Mexico City. Owning an original VHS copy, I wanted to also obtain a DVD copy of the original cut. The problem is that the DVD copy that I bought online (same that's pictured here on IMDb - not the original cover) is an edited/foreign version with subtitles. Since then I've had my VHS copy burned to DVD, but I wish could find the original cut on DVD (professionally done). Oh, and my other beef with this foreign cut that sells online is that they cut out my only speaking scene with Lt. Cohen (Michael O'Keefe)...sad. Aside from the experience of being in the movie, I really enjoyed the final product as I thought it brought a lot of realism (both Marine Corps and Vietnam) to the screen. If you get a chance to see the original cut, I believe you'll enjoy it as I did.",
         "Gripping war drama with a fine performance by Brad Davis. Ranks with many of the best of the Vietnam movie genre (Platoon, Go Tell The Spartans, Gardens of Stone, etc.). Could have easily been a theatrical release."
      ],
      "genres": [
         "Biography",
         "Drama",
         "War"
      ],
      "productionCompanies": [
         "Charles Fries Productions",
         "Dick Berg-Stonehenge Productions"
      ],
      "summaries": ["The memories of a US private in Vietnam who slowly gets disillusioned as the war progresses."],
      "budget": 0
   },
   "movielensId": 130408,
   "movielens": {
      "languages": [""],
      "releaseDate": "1980-09-24",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 191,
      "movieId": 130408,
      "title": "A Rumor Of War",
      "mpaa": "",
      "actors": [
         "Brad Davis",
         "Keith Carradine",
         "Keith Carradine",
         "Richard Bradford",
         "Brian Dennehy"
      ],
      "imdbMovieId": "0081443",
      "originalTitle": "A Rumor Of War",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "The memories of a US private in Vietnam who slowly gets disillusioned as the war progresses.",
      "tmdbMovieId": 264321,
      "avgRating": 3,
      "releaseYear": "1980",
      "numRatings": 1,
      "posterPath": "/jvffnoYVrkPS2QylQGIaDTsUVyg.jpg"
   }
}