{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "manchester city",
            "id": 968
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "fugitive",
            "id": 10718
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "police inspector",
            "id": 174539
         }
      ],
      "imdb_id": "tt0053900",
      "video": false,
      "title": "Hell Is a City",
      "recommendations": [
         35895,
         4926,
         42066,
         73027,
         48234,
         31144,
         51198,
         93175,
         64319,
         51555,
         73363,
         27560,
         26294,
         62098,
         33686,
         60743,
         59895,
         116712,
         85926,
         38103
      ],
      "backdrop_path": "/aNkhaZVwLwTzSlNEPndPT40N9WB.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "53b18415c3a3682eee00661c",
         "content": "I don't play cards. I don't even touch coins. \r\n\r\nOut of Hammer Films, Hell is a City is directed by Val Guest, who also adapts the screenplay from Maurice Proctor's novel of the same name. It stars Stanley Baker, John Crawford, Billie Whitelaw, Maxine Audley, Donald Pleasence, Vanda Godsell, Joseph Tomelty and George A. Cooper. Music is by Stanley Black and cinematography in HammerScope is by Arthur Grant. \r\n\r\nWhen violent criminal Don Starling (Crawford) escapes from prison, Manchester cop Inspector Harry Martineau (Baker) correctly assumes he is on his way back to the area to collect some hidden loot from a previous job. Sure enough a serious crime rocks the city and all roads lead to Starling, but what price will Martineau pay to nail a man whose mere name strikes fear into the locals? \r\n\r\nHas some bastard been passing me snide money? \r\n\r\nBritish crime drama at its best, absorbing as a suspense tale, clinically unflinching in its characterisations and directed with a deft hand by the multi talented Val Guest. Hell is a City is without question a very British movie, but in the same way that greats like Brighton Rock and They made Me A Fugitive were Britannia Rule Grimarannia, so it be here where Guest makes the most of Manchester's gloomy locales to pump bad blood into the edgy narrative. It's a Manchester of creaky terraced houses, working class bars, soiled streets and the unforgiving Moors. The latter of which a visual beauty to the eye, but home of misery both in fact and fiction. \r\n\r\nA Starling in the Attic. \r\n\r\nTale unfolds as a sort of warts and all semi-documentary police procedural. Harry Martineau is the lead man, but this is no cliché addled copper, he is a tough bastard who is not adverse to using strong arm and dishonest tactics to get results. He's a hero, of sorts, but the happiness he craves outside of his work, at home, is moving further away from him. He's not alone, either, for many of the vivid characters on show here are either life's losers, illicit gamblers, unfaithful wives, lonely hearts, or cheaters and beaters, and that's before we get to Crawford's villain. Don Starling infects everyone with his evil stink, a robber, a rapist and a murderer, he may not look much physically in Crawford's shoes, but his name, voice and mere appearance has all but Martineau in a cold sweat. \r\n\r\nIf a man ain't got kids he's still fair game! \r\n\r\nThe script is devoid of pointless filler and no scene is wasted, there's an air of realism throughout. Sure there's a little leap of faith to be taken at times, but nothing that remotely could hurt the movie. The performances are from the better end of the scale, with Baker excelling as a stoic, but lonely man of the force, and Whitelaw and Godsell impressively force themselves up above the parapet to be rightly noticed in a movie predominantly beefed by machismo. Could Don Starling have been played by a better actor? Yes of course. Or just have been played by someone more menacing in appearance (like Baker in his villain roles for instance)? Again, yes of course. But the more you watch the more you will see that it's a frightening portrayal because it's very human, just like that given to Harry Martineau. \r\n\r\nSome scenes shock and distress, others hold you and enthral, Hell is a City is one hell of a film and highly recommended to crime and noir fans. 9/10",
         "url": "https://www.themoviedb.org/review/53b18415c3a3682eee00661c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Insp. Harry Martineau",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069bef",
               "name": "Stanley Baker",
               "profile_path": "/tuxxdeqxX8kTS8tBFon31IrXPvb.jpg",
               "id": 67449,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Don Starling",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069bf3",
               "name": "John Crawford",
               "profile_path": "/wyBwzmRGML0PoIxJ2DnQAOBgmqu.jpg",
               "id": 15693,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Gus Hawkins",
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069bf7",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Julia Martineau",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069bfb",
               "name": "Maxine Audley",
               "profile_path": "/1hsZ54YqubfXJcyGj8QFA1OcxPz.jpg",
               "id": 30141,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Chloe Hawkins",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069bff",
               "name": "Billie Whitelaw",
               "profile_path": "/5XSUS3oSuG2CtJQPiEBQd9AAmg4.jpg",
               "id": 8226,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Furnisher Steele",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069c03",
               "name": "Joseph Tomelty",
               "profile_path": null,
               "id": 101501,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Doug Savage",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069c07",
               "name": "George A. Cooper",
               "profile_path": null,
               "id": 101985,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Lucretia Luske",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069c0b",
               "name": "Vanda Godsell",
               "profile_path": null,
               "id": 101722,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Bragg",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069c0f",
               "name": "Dickie Owen",
               "profile_path": null,
               "id": 101986,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Sam",
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069c13",
               "name": "Alister Williamson",
               "profile_path": null,
               "id": 82554,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Cecily Wainwright",
               "gender": 1,
               "credit_id": "52fe45b2c3a368484e069c17",
               "name": "Lois Daine",
               "profile_path": null,
               "id": 100098,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Fingerprint Officer (uncredited)",
               "gender": 0,
               "credit_id": "56b74a57925141566f00296d",
               "name": "John Harvey",
               "profile_path": "/2HDwZtlvwS9iSpgEFKqLSoj9nPb.jpg",
               "id": 1573982,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069bcd",
               "name": "Val Guest",
               "profile_path": "/99rZHWC9WKCyVgFLpBy1fKDkyLB.jpg",
               "id": 39853,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069bd9",
               "name": "Michael Carreras",
               "profile_path": null,
               "id": 29664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45b2c3a368484e069bdf",
               "name": "Stanley Black",
               "profile_path": null,
               "id": 101984,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069be5",
               "name": "Arthur Grant",
               "profile_path": null,
               "id": 30138,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b2c3a368484e069beb",
               "name": "James Needs",
               "profile_path": null,
               "id": 30172,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "596655869251410bfa132d77",
               "name": "Maurice Procter",
               "profile_path": null,
               "id": 1849992,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "59665576c3a36828a1148f6e",
               "name": "Val Guest",
               "profile_path": "/99rZHWC9WKCyVgFLpBy1fKDkyLB.jpg",
               "id": 39853,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5966559ac3a368253c10d1cb",
               "name": "Robert Lennard",
               "profile_path": null,
               "id": 13320,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "596655afc3a3680d59105332",
               "name": "Robert Jones",
               "profile_path": null,
               "id": 33218,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "596655c49251410bfa132df0",
               "name": "Colin Garde",
               "profile_path": null,
               "id": 1849993,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "596655d09251410c5612080f",
               "name": "Pauline Trent",
               "profile_path": null,
               "id": 1582125,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "596655e49251410bfa132e21",
               "name": "Don Weeks",
               "profile_path": null,
               "id": 1207591,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.533523,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 28784,
      "vote_count": 8,
      "budget": 0,
      "overview": "Set in Manchester, heartland of England's industrial north, Don Starling escapes from jail becoming England's most wanted man. Ruthless villain Starling together with his cronies engineered a robbery that resulted in the violent death of a young girl. Detective Inspector Martineau has been assigned to hunt him down and bring him in. From seedy barrooms, through gambling dens the trail leads to an explosive climax high on the rooftops of the city.",
      "similar": [
         4771,
         357096,
         949,
         1572,
         75780,
         948,
         395990,
         281957,
         445954,
         2142,
         8292,
         3134,
         994,
         10651,
         11564,
         36349,
         2749,
         7007,
         15069,
         26390
      ],
      "original_title": "Hell Is a City",
      "runtime": 98,
      "poster_path": "/lRQ4grtpVScvvdUPGcyq9QkAi0y.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/pi7SHIi3CNAyDUCt6Jpr1q9UW3t.png",
         "name": "Hammer Film Productions",
         "id": 1314,
         "origin_country": "US"
      }],
      "release_date": "1960-04-10",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Murder money stained his hands....",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "£",
      "directors": ["Val Guest"],
      "runtime": 88,
      "synopsis": "Inspector Harry Martineau (Steve Baker), a hard-nosed detective stationed in Manchester England, feels that an escaped thief Don Starling (John Crawford) is going to return to town to retrieve a cache of stolen jewels that he hid before he was convicted. Martineau has domestic troubles as he and his wife Julia Martineau (Maxine Audley) bicker about his role as a policeman and their childless marriage. The escaped criminal Starling arrives in town and immediately forms a gang to rob a bookmaker Gus Hawkins (Donald Pleasance), of what they think will be the minimal amount of money to get the crook out of town but what they steal is a large amount of money marked with a green ink by the bank to prevent theft. Starling accidentally kills a young girl during the robbery and while dumping the body at a deserted location the gang is spotted and Martineau instinctively knowing who is responsible, takes steps to track down as much information as he can, in many instances only steps behind the crook. On the run Starling starts going to as many places as he can for refuge, at one point hiding in the attic of the bookmaker he robbed Gus Hawkins, threatening his philandering wife Chloe (Billie Whitelaw). Starling manages to knock Hawkins unconscious sending him to the hospital and Martineau, following up on his hunch, figures out the truth and squeezes more information from Hawkins wife Chloe. At a large coin-flipping gambling game, where some of the tainted money exchanges hands, Martineau catches up with the accomplices in the robbery and gets closer to the murderer. When Starling recovers the cache of stolen jewels from a furniture dealer he confronts a young girl Silver Steele (Sarah Branch) and draws the attention of the neighborhood and Martineau who pursues the thief to a final showdown on the rooftops above Manchester.",
      "writers": [
         "Val Guest",
         "Maurice Procter"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053900/",
      "coverLink": null,
      "actors": [
         "Stanley Baker",
         "John Crawford",
         "Donald Pleasence"
      ],
      "reviews": [
         "I had been postponing my purchase of this and another Stanley Baker crime drama, Joseph Losey's THE CRIMINAL (1960; see below), ever since their DVD release back in 2002; ironically, what eventually pushed me into ordering them was the recent death of this film's director Val Guest - at the venerable age of 94! Well, all I can say is that I was foolish to have deprived myself of it for so long; this is surely one of the best British crime films ever and, being an atypical release for Hammer, is also one of their finest non-horror efforts! During the excellent Audio Commentary included on the splendid Anchor Bay DVD edition, Guest admitted that one of his major influences (and not only on this particular film) had been Jules Dassin's innovative THE NAKED CITY (1948) and, curiously enough, one has to go back to Dassin's own NIGHT AND THE CITY (1950) to find an equally hard-hitting British noir!; then again, the film was ahead of its time since it would be years before a similarly truthful depiction of a policeman's domestic life would emerge in the U.S. (THE DETECTIVE and MADIGAN {both 1968}, for instance). The film is a veritable class act in every department: Guest's direction never puts a foot wrong and his screenplay (adapted from a novel by Maurice Proctor and deservedly nominated for a BAFTA award) is truly exceptional; Arthur Grant's chiaroscuro camera-work (mostly shot in real Manchester locations) is stunning; while Stanley Black's jazzy score lends the fast-paced if rather involved proceedings the requisite urgency. Stanley Baker has one of his best leading roles as the tough cop who tries to make several ends meet - catch a dangerous criminal (American actor John Crawford, very effective) who's basically his alter ego, save his childless marriage with selfish Maxine Audley, and escape the daily temptation of a fling with the carnal (despite being middle-aged) but genuinely concerned barmaid Vanda Godsell (who also happens to be Crawford's old flame). Donald Pleasence has an important, scene-stealing supporting role as a bookmaker marked for robbery by Crawford - who had also been intimate with Pleasence's sluttish young wife (Billie Whitelaw who, despite this being her 12th feature film, was impressive enough to be up for the \"Most Promising Newcomer\" BAFTA award - and is even featured in a brief but startling nude scene which was promptly snipped for the U.S. version!). The rest of the cast is filled with familiar character actors, many of them members of Guest's own stock company. Among the film's best scenes are the swift alleyway heist towards the beginning (which ends in murder), the wonderful \"tossing school\" (an illegal form of gambling) scene which takes place on the moors, several grueling interrogation scenes (with Baker often reduced to blackmailing his hard-as-nails 'customers') and the remarkably violent rooftop climax. By the way, I wasn't as displeased as Guest was with the alternate ending included as an extra (and which he had never seen before!) - inverting a couple of scenes and adding a brief hopeful coda (not filmed by Guest) with Baker and Audley - but I totally respect the director's decision to stick with his uncompromising original vision.",
         "I watched Hell is a City on DVD again the other day and was struck by how fresh and undated the story and acting still appears. It was a breakout Brit film for 1959/60- with its semi-documentary approach to police procedure,meshed with a tough on women approach and attempt to show relationships that don't have happy endings. On the DVD there is an alternate ending shown, which the director Val Guest claims to have no knowledge of at all! It's much weaker i think than Guest's own choice of ending. Stanley Baker is excellent; successfully showing all dimensions to an Inspector's working/personal life; Billie Whitelaw got nominated that year with the BAA for in the Newcomer category and deservedly so. All the support cast flesh out their characters' quirks very well. Actual location shooting (in this case-Manchester) was still quite unusual and there is a world of difference between this and a studio based crime thriller of maybe 10 years before.",
         "I just had to reply after reading this totally condescending piece of tripe regarding \"Hell Is A City\". Personally I have always thought this film to be one of the best British police dramas of its genre! I do not know where in Britain you live, but it is obvious you know little about the Northern/Manchester accent or local dialects!! For a start there is no \"one size fits all\" Manchester accent. When I was a child growing up in South Manchester in the 50s & 60s you could walk a mile in any direction and hear a totally different accent. Also every community is made up of people from different parts of the country or the world for that matter, so you would be likely to hear different accents/dialects. In the area where I lived, Levenshulme, we had neighbours from Ireland, Scotland and even Canada!! As for the character Don Starling having an American accent. American actors were quite often seen in British productions during the 1950s. This was partly to enable the films to be sold in America, and partly because of The Eady money levy, which was a levy on American films enabling many Hollywood stars to appear in British productions. A good example of this would be Jules Dassins \"Night & The City\", which was a British based story with 3 American actors in the leading roles!!",
         "Out of Hammer Films, Hell is a City is directed by Val Guest, who also adapts the screenplay from Maurice Proctor's novel of the same name. It stars Stanley Baker, John Crawford, Billie Whitelaw, Maxine Audley, Donald Pleasence, Vanda Godsell, Joseph Tomelty and George A. Cooper. Music is by Stanley Black and cinematography in HammerScope is by Arthur Grant. When violent criminal Don Starling (Crawford) escapes from prison, Manchester cop Inspector Harry Martineau (Baker) correctly assumes he is on his way back to the area to collect some hidden loot from a previous job. Sure enough a serious crime rocks the city and all roads lead to Starling, but what price will Martineau pay to nail a man whose mere name strikes fear into the locals? Has some bastard been passing me snide money? British crime drama at its best, absorbing as a suspense tale, clinically unflinching in its characterisations and directed with a deft hand by the multi talented Val Guest. Hell is a City is without question a very British movie, but in the same way that greats like Brighton Rock and They made Me A Fugitive were Britannia Rule Grimarannia, so it be here where Guest makes the most of Manchester's gloomy locales to pump bad blood into the edgy narrative. It's a Manchester of creaky terraced houses, working class bars, soiled streets and the unforgiving Moors. The latter of which a visual beauty to the eye, but home of misery both in fact and fiction. A Starling in the Attic. Tale unfolds as a sort of warts and all semi-documentary police procedural. Harry Martineau is the lead man, but this is no cliché addled copper, he is a tough bastard who is not adverse to using strong arm and dishonest tactics to get results. He's a hero, of sorts, but the happiness he craves outside of his work, at home, is moving further away from him. He's not alone, either, for many of the vivid characters on show here are either life's losers, illicit gamblers, unfaithful wives, lonely hearts, or cheaters and beaters, and that's before we get to Crawford's villain. Don Starling infects everyone with his evil stink, a robber, a rapist and a murderer, he may not look much physically in Crawford's shoes, but his name, voice and mere appearance has all but Martineau in a cold sweat. If a man ain't got kids he's still fair game! The script is devoid of pointless filler and no scene is wasted, there's an air of realism throughout. Sure there's a little leap of faith to be taken at times, but nothing that remotely could hurt the movie. The performances are from the better end of the scale, with Baker excelling as a stoic, but lonely man of the force, and Whitelaw and Godsell impressively force themselves up above the parapet to be rightly noticed in a movie predominantly beefed by machismo. Could Don Starling have been played by a better actor? Yes of course. Or just have been played by someone more menacing in appearance (like Baker in his villain roles for instance)? Again, yes of course. But the more you watch the more you will see that it's a frightening portrayal because it's very human, just like that given to Harry Martineau. Some scenes shock and distress, others hold you and enthral, Hell is a City is one hell of a film and highly recommended to crime and noir fans. 9/10",
         "Inspector Martineau knows in his gut that a recently escaped criminal will come back to the scene of the crime to recover the goods that he's stolen. It's up to him to piece together the new assignment that he's given and trace it back to the guilty party. Stanley Baker shines as Martineau (one year later Baker would be in one of the greatest war films ever with \"The Guns of Navarone\") in this taunt, gripping little crime thriller by Val Guest. All the minor characters are equally good. This is one film that I wouldn't mind revisiting. Another great film to come out of the sadly defunct Hammer studios. My Grade:B+ DVD Extras: Commentary by Val Guest and Journalist Ted Newsom; Alternate Ending; Talent Bios for Val Guest and Stanley Baker; and Theatrical Trailer Eye Candy:a blink and you'll miss it Billy Whitelaw topless scene",
         "HELL IS A CITY - 1960 Hammer films is best known for horror and vampire type fare. But they did produce the odd crime and noir before the swing to the more profitable blood- letting films. Stanley Baker headlines here, as a tough as nails, no nonsense, Detective with the Manchester Police Service. Baker has just been informed that a man, John Crawford, a gangster Baker had sent up the river has escaped from prison. The swine had killed a guard during the escape. Needless to say Crawford heads back to Manchester. He wants to pick up a stash of jewels he has hidden from a previous robbery. He also wants to pull another job to get some readies to blow the country with. A new life somewhere else seems like the ticket. Crawford makes contact with several of his old gang about a job he has figured. They are going to hit a race track odds makers, Donald Pleasence's bag of cash. Crawford knows about this because he used to bed Pleasence's new wife, Billie Whitelaw. The gang pull the robbery but of course they end up killing the young girl carrying the cash. The Police are quickly on the case and pull in all the usual suspects. A little bit of heavy leaning, soon has the Police onto all the \"proper\" people. Crawford is forced to go to ground as his possible hideouts dry up. This leads to a great chase over the various rooftops and ends with a full-fledged, knockdown, drag out, knuckle exchange on said rooftops. Crawford is corralled and is soon on death row. This is a very good crime/noir film with top work from the entire cast and crew. Director Val Guest hits all the marks squarely in this one. This one has it all, superb b/w photography, good acting, top jazzy score and more than enough violence to go around. A keeper in anyone's book!",
         "Hammer studios are, of course, best known for their horror films; but early on in the studio's history, there were a number of noir style films produced; and while this is one of the later efforts, it's surely one of the best! The film is clearly intended to mimic the American film noir being produced en mass during the fifties; although the film does retain an aura of Britishness which is achieved through the locations and strong accents of most of the lead characters. The film is suitably dark, though not as dark as many of its American counterparts. The plot focuses on a criminal that has escaped from jail after committing a robbery that went wrong. Inspector Harry Martineau, who happened to have gone to school with the criminal, guesses that he will return home to Manchester in order to pick up his share from the job. The criminal does return to Manchester and ends up with the inspector on his tail as he moves through the underworld, trying to find a place to hide. Writer-director Val Guest (who previously directed a handful of Hammer's earliest horror films) spins an interesting story that remains intriguing throughout. The dialogue is surprisingly witty at times, and the characters are 'cool' enough to rival the films that this one is trying to imitate. There's more to the plot than just what is immediately going on, and the inspector's personal life is one of the main sub-plots. This thread is somewhat well expanded; although it has to be said that some other areas of the plot do not go as far as they could; although at only ninety minutes, there was obviously only so much that could be squeezed in. The film moves forward well, although at times it is a little silly; a plot that hinges on the idea of nobody looking at their hands is somewhat far fetched. The cast is strong, with Stanley Baker and John Crawford taking the lead roles and doing well with them; there's also a small appearance for the great Donald Pleasance. Overall, Hell is a City is an excellent British noir, and well worth a look.",
         "This is a wonderful example of how worldly some british films can seem, while maintaining their local flavor. I believe that this film is very appropriately set in Manchester, anyone having been to Manchester will tell you its quite a tough place. 50s British entertainment was heavily influenced by Hollywood and continued to be influenced especially on TV until the late 70s, when things all started to get a bit colorless. This movie was made in a time when entertainment came first and the needs of the audience and hence a box office return, came before the politically correct requirements of the day. Having said that I have to say I'm VERY glad that you don't see many characters quite as sorry as Martineau's repressed housebound wife these days! For those who are not familiar with director Val Guest - check out his other movies. He was a director who knew exactly what he was doing.",
         "Director Val Guest has said of Hell is a City, that he was very influenced by Jules Dassin's classic Naked City, and many of the location shots attest to this influence. The final pursuit scene with Martineau and Starling in combat are as thrilling as the Williamsburg Bridge scenes from Naked City with the action of the streets below serving as backdrop to the fighting men clambering high above. Inspector Harry Martineau (Steve Baker), a hard-nosed detective stationed in Manchester England, feels that an escaped thief Don Starling (John Crawford) is going to return to town to retrieve a cache of stolen jewels that he hid before he was convicted. Martineau has domestic troubles as he and his wife Julia Martineau (Maxine Audley) bicker about his role as a policeman and their childless marriage. The escaped criminal Starling arrives in town and immediately forms a gang to rob a bookmaker Gus Hawkins (Donald Pleasance), of what they think will be the minimal amount of money to get the crook out of town but what they steal is a large amount of money marked with a green ink by the bank to prevent theft. Starling accidentally kills a young girl during the robbery and while dumping the body at a deserted location the gang is spotted and Martineau instinctively knowing who is responsible, takes steps to track down as much information as he can, in many instances only steps behind the crook. On the run Starling starts going to as many places as he can for refuge, at one point hiding in the attic of the bookmaker he robbed Gus Hawkins, threatening his philandering wife Chloe (Billie Whitelaw). Starling manages to knock Hawkins unconscious sending him to the hospital and Martineau, following up on his hunch, figures out the truth and squeezes more information from Hawkins' wife Chloe. At a large coin-flipping gambling game, where some of the tainted money exchanges hands, Martineau catches up with the accomplices in the robbery and gets closer to the murderer. When Starling recovers the cache of stolen jewels from a furniture dealer he confronts a young girl Silver Steele (Sarah Branch) and draws the attention of the neighborhood and Martineau who pursues the thief to a final showdown on the rooftops above Manchester. What is admirable about Hell is a City are the great locations shots taking place in the streets, and moors of the city of Manchester. Guest sets up his camera consistently to show the actions of the protagonist and antagonists mixed into scenes of everyday life, showing how the element of crime exists as something endemic to society as a whole. The film teeters over into the world of melodrama at points but only to show how Martineau tromps into that world and drives through to get what he wants. The way that Martineau questions Chloe Hawkins shows what he knows about the woman and the ruthless methods he uses to get to the truth. The way the director sets up this relationship is masterful, by introducing Chloe as she is passionately kissing a younger man before going home to see her husband Gus we understand immediately that she is the trophy of an older wealthy man. The later scene with Starling we understand further that her philandering ways has a history as we understand that the two have had a previous relationship. Later as Martineau questions her we know that he is aware of the woman&#146s behavior, and he uses this information to essentially blackmail her for cooperation. Director Guest manipulates the mise en scene so well that we can practically feel the breeze hitting our faces on the moors. His choice of background actors at the coin-tossing gambling game says volumes about this community in England. The garage where the taxis are maintained is covered with excellent high-angle shots showing the large windows and arched ceiling of a burned out church. On the commentary tract director Val Guest talks about some of the choices for locations in the film, and his comments on this building is an interesting one. There isn't really anything that his location manager is trying to put forth with this old religious building as a garage but it certainly adds to the overall appeal of the film. The commentary tract has a goodly amount of additional perks for the film buff. Journalist Ted Newsom leads a discussion with director Val Guest that includes casting American actor John Crawford in the lead role of Don Starling and his ultimate successes with other Hammer Studio films. In particular the alternate ending is something that should impress many viewers given today's circumstances regarding leaving a positive ending on a movie. The colorful names add to the pleasure in this detective actioner. Names like Don Starling, Silver Steele, Lucky Lusk, Clogger Roach add to the background for the action in the movie. The fact that Hammer Studios left this kind of great filmmaking to go heavily into the Horror genre was probably a decision based on economics. Hell is a City is a wonderful Actioner but probably doesn't have a big effect on box office receipts like a good blood splattering slasher or vampire flick. If you like Film Noir this movie will whet your appetite! Enjoy it with a good black cup of Starbuck&#146s brew for that extra noir kick!",
         "Cunning, lethal, ruthless criminal Don Starling (excellently played by John Crawford) escapes from jail and returns to Manchester to perform a robbery. Rugged, no-nonsense, hot-tempered Inspector Harry Martineau (a superbly hard-boiled performance by Stanley Baker) is bound and determined to nab Starling. Things get sticky when Starling kills a 19-year-old girl during the heist and the manhunt becomes a much more deadly pursuit. Writer/director Val Guest keeps the pace rattling along at a brisk clip, maintains an uncompromisingly tough-edged tone throughout, and does an expert job of creating a seedy urban atmosphere. Stanley Black's rousing, swinging jazz score really hits the spot. Arthur Grant's crisp, handsome, agile black-and-white cinematography likewise impresses. The occasional outbursts of raw violence are shockingly brutal. The climactic rooftop chase between Starling and Martineau is genuinely tense and exciting. Baker and Crawford excel in the leads; they receive fine support from Donald Pleasence as irritable book maker Gus Hawkins, Maxine Audley as Martineau's fed-up, neglected, long-suffering wife Julia, Billie Whitelaw as Gus' trampy wife Chloe (she's also Starling's frightened former old flame), Vanda Godsell as sassy bar maid Lucretia \"Lucky\" Luske, Joseph Tomelty as feisty old duffer Furnisher Steele, and George A. Cooper as petty gambler Doug Savage. A highly atypical Hammer Studios production, this rough and hard-hitting crime thriller winner makes for completely absorbing and satisfying viewing.",
         "No other film of this period gives such a clear indication of the attempt of British crime thrillers to become more exciting. The introduction of John Crawford as the American bad guy and one time buddy of Stanley Baker is enthralling to watch and can seem slightly odd and out of place. The opening sequences are reminiscent of British TV show 'Z Cars' and were later spoofed in Naked Gun (though not as a direct result of this). Donald Pleasance is very reliable as the Jewellry Shop owner who has much to reveal, while Baker himself plays another tough cop as he did in Blind Date (1959) and Violent Playground (1958) - the latter was also directed by Val Guest. Look out for the climactic sequences - gripping stuff and still ever so British.",
         "Hammer Films, best known for horror movies, stepped into film noir with Val Guest's \"Hell Is a City\". Stanley Baker plays a police inspector who suspects that an escaped criminal will head for Manchester to collect some loot. The dreary look of the city is as much a character as any of the actors. The post-war British film industry wasn't generally known for these sorts of movies, but they did an excellent job here. The chase at the end of the movie is impressive but I thought that the most effective scene was the whole sequence where the criminal hides in the woman's house. I've liked every film noir that I've seen, but HIAC has to be one of the best. Baker's forceful performance as the hardened inspector is the epitome of acting. I recommend the movie. The rest of the cast includes Donald Pleasance (Dr. Loomis in the \"Halloween\" franchise), Billie Whitelaw (the nanny in \"The Omen\") and Joseph Tomelty (the father of Sting's ex-wife).",
         "image1.jpeg HELL IS A CITY, 1959, Director Val Guest VIEWED in London at a special Hammer classics reissue press screening, c. 1996. Inspector Harry Martineau (Stanley Baker), a hard-boiled detective stationed in Manchester England, suspects that a ruthless escaped criminal Don Starling (John Crawford) will come back to town to retrieve a cache of stolen jewels he hid there before his conviction. Martineau has problems at home where he and his wife Julia (Maxine Audley) constantly bicker about his role as a cop which monopolizes his time, and their childless marriage. Starling arrives in town as expected and immediately forms a gang to rob a bookmaker Gus Hawkins (Donald Pleasance), to raise enough cash for a clean getaway but what they grab turns out to be a large amount of money in bank marked bills to prevent their theft. Starling kills a young girl during the robbery and dumps the body by the side of the road out in the country but is spotted by Martineau who is hot on his trail following down one hot lead after another. On the run with Martineau in hot pursuit, now wanted for murder, Starling takes refuge at one point hiding in the attic of the bookmaker he robbed (Pleasance) and threatening his philandering wife Chloe (Billie Whitelaw) he once had an affair with. When discovered by Pleasance Starling manages to knock him out with injuries that put him in the hospital. Martineau, following up another hunch, squeezes more information from Hawkins wife Chloe. At a large outdoor gambling game, where some of the tainted money changes hands, Martineau catches up with the accomplices in the robbery and is now just one step behind his quarry. Starling recovers the cache of stolen jewels from a crooked fence (Furnisher Steele) but has to hide in the storeroom upstairs when the police, tipped off, arrive on the scene. Here, in an extremely harrowing sequence which becomes the unforgettable centerpiece of the film, he holds the beautiful blonde daughter of the fence, Silver Steele, (Sarah Branch) hostage, but she is unable to scream for help because she is deaf and dumb. a( What a twist!) ~ As he stalks her around the attic room piled high with furniture, in desperation she manages to knock out a window which draws the attention of the neighborhood. Martineau breaks in and pursues the vicious killer in a final showdown up on the rooftops above Manchester -- the most suspenseful Mother of all rooftop chases ever filmed. At the end Martineau chooses his job over his marriage. In a wistful coda at his favorite saloon he runs into Lucky Lusk (Vanda Godsell) the attractive barmaid he has been flirting with all along, and she offers herself to him full on, but he turns her open ended offer down on the grounds that he is still married. \"Well, she says, in wry resignation, \"If you ever have a kid name it for me\". The Martineau hard boiled cop figure who doesn't mind bending the law to get his man is a predecessor of Dirty Harry by some twenty years and the mean streets of the city of Manchester are portrayed like another main character hovering over the picture. A major city really seen in British films sits for a remarkable portrait. I had seen this movie years ago when it first came out but quickly disappeared. All I remembered was the white knuckle scene in the attic with the vicious killer relentlessly stalking the pathetically defenseless deaf and dumb girl -- every bit as harrowing and suspenseful now as it was back then. BRAVURA filmmaking beginning to end by Val Guest in a classic B/w mold. Unforgettable. The perfect thriller. Stanley Baker, usually seen in meaty supporting roles, never quite became a top star, but was nevertheless one of the best and most businesslike British actors of his time.",
         "A surprisingly tough,no-nonsense crime thriller for it's time,HELL IS A CITY (set in my hometown Manchester) has a fairly routine plot but has compensations with fast-moving direction by Val Guest,a decent script,a fine jazz score by Stanley Black,and most of all,first-class photography on actual Mancunian locations.This was something of a first for British crime thrillers for this period,which were mostly shot in dingy studio sets,but director Guest's decision to film many scenes outdoors,and in a provincial city as well(virtually all of this film's contemporaries were set in London,particularly Soho),is refreshing,fairly innovative and gives a sense of realism that is unusual but welcome,especially in this era(the late 50's -early 60's) of UK film-making. Unfortunately,there are some compromises that mitigate against the film;one is the casting of American John Crawford(who appeared in several other British thrillers around this period)as the murderous villain which strains credibility somewhat;Crawford makes no attempt to hide his American accent,which makes his role as a native(as the script makes clear) hard to take;there are rather obvious domestic scenes of strife with Inspector Stanley Baker and spouse that drag the pace down somewhat(it would have been better simply to concentrate on the basic story)and seem irrelevant,and Guest falters when he makes some obvious attempts to imitate Hollywood film-noirs;he is better when he sticks to straightforward,semi-documentary realism. The film features very few Mancunian actors (only John Comer,and Doris Speed,who very soon after began her stint as TV's most famous barmaid,Annie Walker,in CORONATION STREET);they are mostly from Yorkshire or Southern England,and Welshman Baker occasionally struggles with his Northern English accent. Never afraid to play unsympathetic,dislikable heroes,Baker is still good in the lead role,in his familiar virile,aggressive and uncompromising persona.This style of acting led the way out of the rather stuffy,RADA-accented manner that had held back British cinema for years into more a working-class,gritty and realistic era,and somewhat better films. HELL IS A CITY has it's faults,but is valuable today as an unexpected social document of Manchester of the time,and has much more than a touch of class than other contemporary routine crime dramas,thanks to the reasons stated above. Rating:6 and a half out of 10.",
         "Inspector Harry Martineau is a hard-edged police man in gritty Manchester. When a major criminal, Don Stirling, escapes from jail by killing a guard Martineau makes it his person responsibility to hunt him down. Stirling gets his old gang together to steal £4000 from wealthy businessman Gus. However the theft goes wrong and a young girl is killed and the money begins to leave behind a trail that will lead to the gang. This desperately wants to be an English 1950's American style film noir. It has the gritty urban title, it has a moody lead actor with an iffy moral code, a pumping jazz soundtrack and is surprisingly tough. It isn't completely successful because of one main problem - it's in England. In Manchester. It's tough even for someone who lives here to take it as seriously as the Bogart-esque equivalents. It's an unfair criticism perhaps but it is off-putting to hear the thick Yorkshire accents in the setting of an urban crime drama. There is quite a lot to like here. The plot is interesting with gritty levels, the whole idea of the money being dyed and staining hands is a good concept and only seems stretched occasionally and is actually a very effective way of leaving a money trail. The jazz score does give the film a real feel of a urban crime zone, but at times it feels a bit out of place with some of the scenes. The 2 lead performances are mixed in their roles. Stanley Baker is good as Martineau mixing the role with a bad guy edge by being distant from his wife etc, but he isn't as convincing as his American equivalents. You never are totally convinced that he is anything but a good guy, with his only real faults being his commitment to work over his wife. John Crawford is better as Stirling who benefits from not having an English accent. He plays the violent, cruel criminal well and is totally convincing. It's also good to see Donald Pleasance in a small role as Gus, but his accent is frighteningly thick. The film is surprisingly tough. I assumed that this would be a lesser film because it's British but this has quite strong language (although not by today's standards) and is very violent considering when it was made. There is quite a bit of violence towards women all of which gives the film a much more believable very tough edge that adds to it's credentials as a crime thriller. Overall a strong attempt to make a British film noir. It loses something with Baker being too clean-cut in his role and the Manchester setting and accents are hard to line up mentally with the action. But hey - it's pretty good.",
         "HELL IS A CITY, 1959, Director Val Guest UNKNOWN Classic FILM NOIR From England is one of the best of the genre TEN STARS ********** VIewed in London at a special Hammer classics reissue press screening, 1996. Inspector Harry Martineau (Stanley Baker), a hard-boiled detective stationed in Manchester England, suspects that a ruthless escaped criminal Don Starling (John Crawford) will come back to town to retrieve a cache of stolen jewels he hid there before his conviction. Martineau has problems at home where he and his wife Julia (Maxine Audley) constantly bicker about his role as a cop which monopolizes his time, and their childless marriage. Starling arrives in town as expected and immediately forms a gang to rob a bookmaker Gus Hawkins (Donald Pleasance), to raise enough cash for a clean getaway but what they grab turns out to be a large amount of money in marked bills to prevent their theft. Starling kills a young girl during the robbery and dumps the body by the side of the road out in the country but is spotted by Martineau who is hot on his trail following down one lead after another. On the run with Martineau in hot pursuit, now wanted for murder, Starling takes refuge at one point hiding in the attic of the bookmaker he robbed and threatening his philandering wife Chloe (Billie Whitelaw) he once had an affair with. When discovered by Pleasance Starling manages to knock him out with injuries that put him in the hospital. Martineau, following up another hunch, squeezes more information from Hawkins wife Chloe. At a large outdoor gambling game, where some of the tainted money changes hands, Martineau catches up with the accomplices in the robbery and is now just one step behind his quarry. Starling recovers the cache of stolen jewels from a crooked fence (Furnisher Steele) but has to hide upstairs when the police, tipped off, arrive on the scene. In an extremely harrowing sequence which becomes the unforgettable centerpiece of the film he holds the beautiful blonde daughter of the fence, Silver Steele, (Sarah Branch) hostage, but she is unable to scream for help because she is deaf and dumb. As he stalks her around the attic room piled high with furniture, in desperation she manages to knock out a window which draws the attention of the neighborhood. Martineau breaks in and pursues the vicious killer in a final showdown up on the rooftops above Manchester -- the most suspenseful Mother of all rooftop chases ever filmed. At the end Martineau chooses his job over his marriage. In a wistful coda at his favorite saloon he runs into Lucky Lusk (Vanda Godsell) the attractive barmaid he has been flirting with all along, and she offers herself to him full on, but he turns her open ended offer down on the grounds that he is still married. \"Well, she says, in wry resignation, \"If you ever have a kid name it for me\". The Martineau hard boiled cop figure who doesn't mind bending the law to get his man is a predecessor of Dirty Harry by some twenty years and the mean streets of the city of Manchester are portrayed like another character hovering over the picture. A major city rarely seen in British films sits for a remarkable portrait. I had seen this movie years ago when it first came out but quickly disappeared. All I remembered was the white knuckle scene in the attic with the vicious killer relentlessly stalking the pathetically defenseless deaf and dumb girl -- every bit as harrowing and suspenseful now as it was back then. BRAVURA filmmaking beginning to end by Val Guest in a classic B/w mold. Unforgettable. The perfect thriller. Stanley Baker, usually seen in meaty supporting roles, never quite became a top star, but was nevertheless one of the best and most businesslike British actors of his time. K",
         "This is a very competent action crime film with an excellent cast and very atmospheric photography - the Northern industrial scenes are almost surreal. Stanley \"Could Have Been James Bond\" Baker is on great form with a good supporting cast. The script is tight and fast paced with good lighting/cinematography. One of those films to watch late at night and stay up to find out what happens in the end. The treatment of women is typical of 1960's Britain - it's a period piece and the attitude/demeanour of men, given that many went through the Second World War, is a notable contrast with today's society. My only aside is that the opening/closing credits inappropriately reminded me of Police Squad...",
         "This 'Hammer Films' production is still comfortable viewing, even now (2017), largely because of the familiar cast and memorable outdoors scenery. It also helps that the rapid-fire screenplay keeps us moving along with the plot at a brisk and exciting pace. There's also lots going on to pay attention to besides the main cop pursuit. Inspector Martineau (Stanley Baker) marches through the plot leaving his neglected wife, Julia (Maxine Audley) behind. (Despite a rather significant part in the story and being an actress of some renown, she isn't on the list of credits. I have no idea why.) American actor John Crawford plays villain Don Starling and is convincing as the hardened prison escapee trying to round up his swag while avoiding the cops. There are familiar faces aplenty for those 'spotters' among us... and even a turn from an unrecognizable Warren Mitchell (In Sickness and in Health) as a traveling salesman who comes across a dead body. (If you look carefully you can see the victim blink when she's discovered.) A busy Donald Pleasance found time to squeeze in this project with nearly 20 other film and TV commitments in 1960! He plays a bookie with a heart... and a cheating wife (Billie Whitelaw). Sarah Branch (Who?) plays a beautiful deaf and dumb girl innocently caught in the crossfire of crime. And I must say that my only real peeve about this movie is that she never got together with the young detective Devery (Geoffrey Frederick), who comes to interview her. There were obvious sparks going on here yet the viewer is left hanging! Boo! The story is actually a rather complex one, but basically, Starling escapes from jail and teams up with his old partners in crime. Inspector Martineau reckons he knows what the villain is gonna do next so he races off to Manchester to see if his hunch pays off. It does of course as Starling beats it back to the scene of the crime to pick up some stashed jewelry. He and his gang also pull off a robbery which nets them a lot of cash but results in a murder. The body is dumped on the Manchester moors but even that doesn't go according to plan... I suspect that director (and writer) Val Guest was paying his respects to the American 'noir' films of the 1940s here. Hard boiled cops and robbers, fancy dames and dark sleazy surroundings... and it's filmed in black and white! Get yourself over to YouTube and find out for yourself. There's a great copy there in full wide-screen.",
         "Well-made noirish drama involving a prison escapee returning to Manchester to collect the loot from the theft that landed him behind bars. Val Guest's direction is spot on - he really knew how to tell a story. Stanley Baker is a standout as the conflicted cop that's obsessed with his work - is tired of his wife - and is in love with another woman. Equally good is John Crawford as the truly menacing criminal. The rest of the cast does a great job. The filming in and around Manchester was an added bonus and gave the film greater authenticity. I recommend this to anyone that enjoys the genre.",
         "\"Life on Mars\"?This is more like life on Pluto.Mr Stanley Baker plays the type of cop who feels compelled to try it on with any female with a pulse. He can't walk past an open pub door and threatens to rape his wife in order to impregnate her against her will.Just another day at the office for one of Manchester's finest. \"Hell is a city\" is an over - rated pseudo Don Siegel opus.Possibly seeing itself as a herald of a new hard - hitting school of Britcop movies,it has a sub - sub Elmer Bernstein/Leith Stevens/Shorty Rogers soundtrack of generic Britjazz cobbled together by that clever musical chameleon Mr Stanley Black that places it exactly in its era. It borrows that hoary old Western plot about childhood companions turned deadly adversaries that ends with one of them dangling on the end of a rope.Full of British actors assuming the all - encompassing \"Northern\" accent that is both inaccurate and insulting to its Manchester setting, it deals the English language a further blow by having an American play a Manc villain,a piece of casting of breathtaking audacity and indifference to the audience's intelligence. Cardboard character follows cardboard character muttering \"eee by gum\" imprecations,Yorkshire and Lancashire dialects being freely mixed.Stanley Baker's Inspector Martineau is a despicable woman - hating psychopath.Novelist Maurice Procter who wrote the novel on which the movie was based was said to be \"delighted\" with the result.It all seems a bit rum to me.",
         "Local bad boy Don Starling has busted out of the big house determined to return to Manchester and claim his ill gotten gains. Nemesis detective Martineau ( Stanley Baker) is certain he will return and when a botched robbery resulting in murder takes place he is certain Starling has something to do with it even though superiors doubt it. Hell is a City is comprised of one abrasive conversation after another whether dealing with desperate characters or disinterested wives. Everyone seems under pressure as they trade curt sentences between each other with very little development of character over the long haul. Martineau is clearly married to his job since his relationship with his wife is remote at best while he fends off flirtations from others. The males en masse mostly snarl and complain while the women are reduced to being either cold, seductive cheaters or in one case dead. After a few improbable coincidences Martineau and Starling meet high above Manchester on a rooftop locked in mortal combat. It is the most dramatic scene in the film that showcases its true star, the industrial city of Manchester as backdrop but director Val Guest fumbles this as well and Hell is a City fails to dig any deeper into its outline than an hour episode of Naked City and its emphasis on the urban mean streets."
      ],
      "genres": [
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Associated British Picture Corporation (ABPC)",
         "Hammer Films"
      ],
      "summaries": [
         "Committed but seen-it-all police inspector Martineau rightly guesses that after a violent jailbreak a local criminal will head home to Manchester to pick up the spoils from his last job. Martineau is soon investigating a murder during a street robbery which seems to lead back to the same villain. Concentrating on the case and using his local contacts to try and track the gang down, he is aware he is not keeping his own personal life together as well as he might.",
         "In Britain, a Manchester police inspector becomes obsessed with capturing a criminal who escapes from prison."
      ],
      "budget": 115000
   },
   "movielensId": 130422,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1960-04-10",
      "dvdReleaseDate": null,
      "directors": ["Val Guest"],
      "runtime": 98,
      "movieId": 130422,
      "title": "Hell Is a City",
      "mpaa": "",
      "actors": [
         "Stanley Baker",
         "John Crawford",
         "Donald Pleasence",
         "Maxine Audley",
         "Billie Whitelaw",
         "Joseph Tomelty",
         "George A. Cooper",
         "Vanda Godsell",
         "Dickie Owen",
         "Alister Williamson",
         "Lois Daine",
         "John Harvey"
      ],
      "imdbMovieId": "0053900",
      "originalTitle": "Hell Is a City",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["z20Kdo8af7M"],
      "plotSummary": "Set in Manchester, heartland of England's industrial north, Don Starling escapes from jail becoming England's most wanted man. Ruthless villain Starling together with his cronies engineered a robbery that resulted in the violent death of a young girl. Detective Inspector Martineau has been assigned to hunt him down and bring him in. From seedy barrooms, through gambling dens the trail leads to an explosive climax high on the rooftops of the city.",
      "tmdbMovieId": 28784,
      "avgRating": 2.75,
      "releaseYear": "1960",
      "numRatings": 2,
      "posterPath": "/eAID6JZhiY44NDTqkYA80GjD0Nd.jpg"
   }
}