{
   "tmdb": {
      "original_language": "he",
      "keywords": [],
      "imdb_id": "tt0076398",
      "video": false,
      "title": "Operation Thunderbolt",
      "recommendations": [],
      "backdrop_path": "/yAFNoILf1pmISBb7fpqLFj48KOJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Col. Yonatan Netanyahu",
               "gender": 0,
               "credit_id": "52fe44eec3a368484e03ee35",
               "name": "Yehoram Gaon",
               "profile_path": "/h5tkxb8j11fyh5DMP3QRaEFDWQm.jpg",
               "id": 1108872,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Nurit Aviv",
               "gender": 1,
               "credit_id": "52fe44eec3a368484e03ee39",
               "name": "Gila Almagor",
               "profile_path": "/huI6d4w3zl4Q6N2QTLMKfQgBKhM.jpg",
               "id": 8787,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Wilfried Boese",
               "gender": 2,
               "credit_id": "52fe44eec3a368484e03ee3d",
               "name": "Klaus Kinski",
               "profile_path": "/7gsJB7xlovz1khNID0B8yKA9TO0.jpg",
               "id": 14277,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Shuki",
               "gender": 0,
               "credit_id": "52fe44eec3a368484e03ee41",
               "name": "Assi Dayan",
               "profile_path": "/6fNE08cxs0eXxJbIcTSDfWguHfJ.jpg",
               "id": 41644,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Familienoberhaupt",
               "gender": 0,
               "credit_id": "57f3b2ef9251410c2e00aace",
               "name": "Shmuel Rodensky",
               "profile_path": "/8Ms8VZS6f0xw8m6PWXoIOyM3zHV.jpg",
               "id": 25809,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Air France Co-Pilot",
               "gender": 2,
               "credit_id": "57f3b303c3a368334c009eed",
               "name": "Rolf Eden",
               "profile_path": null,
               "id": 22635,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Halima",
               "gender": 1,
               "credit_id": "57f3b317c3a368334e009749",
               "name": "Sybil Danning",
               "profile_path": "/6WydVNd7JTYY0zbYtH2iwKGGo7k.jpg",
               "id": 29541,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44eec3a368484e03ee25",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44eec3a368484e03ee2b",
               "name": "Ken Globus",
               "profile_path": null,
               "id": 65659,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44eec3a368484e03ee31",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "58c9042fc3a36875d500659e",
               "name": "Sybil Danning",
               "profile_path": "/6WydVNd7JTYY0zbYtH2iwKGGo7k.jpg",
               "id": 29541,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58c9043cc3a368760a005b87",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58c9044792514110e5006de2",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "590a8950c3a368438300b1cb",
               "name": "Dov Seltzer",
               "profile_path": null,
               "id": 47103,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "590a8957c3a36843c800a526",
               "name": "Adam Greenberg",
               "profile_path": "/te3aqArBCPkza8DeJpDx0Rncen8.jpg",
               "id": 2723,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "590a895ec3a3684356009771",
               "name": "Dov Hoenig",
               "profile_path": null,
               "id": 15842,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "590a89649251414fbe009c86",
               "name": "Kuli Sander",
               "profile_path": null,
               "id": 1149120,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "590a896bc3a368438300b1f4",
               "name": "Alfred Gershoni",
               "profile_path": null,
               "id": 1809856,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.641718,
      "production_countries": [{
         "iso_3166_1": "IL",
         "name": "Israel"
      }],
      "id": 26113,
      "vote_count": 4,
      "budget": 0,
      "overview": "In July 1976, an Air France flight from Tel-Aviv to Paris via Athens was hijacked and forced to land in Entebbe, Uganda. The Jewish passengers were separated and held hostage in demand to release many terrorists held in Israeli prisons. After much debate, the Israeli government sent an elite commando unit to raid the airfield and release the hostages.",
      "similar": [],
      "original_title": "מבצע יונתן",
      "runtime": 124,
      "poster_path": "/wagQ3iSBVbAnHZiyZgn9jzH474e.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         }
      ],
      "production_companies": [],
      "release_date": "1977-06-06",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Menahem Golan"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Ken Globus",
         "Menahem Golan"
      ],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt0076398/",
      "coverLink": null,
      "actors": [
         "Yehoram Gaon",
         "Gila Almagor",
         "Assi Dayan"
      ],
      "reviews": [
         "Mivtza Yehonatan (or as it is better known around the world, Entebbe Operation), in which the Israeli army managed to take over the Entebbe airport in Uganda, to free all hostages of the kidnapped Air France plane and to bring (almost) everybody home in one piece, is a story told a million times over, was made into a very bad Hollywood action movie and was used as the basis for countless B-movies. This version, however, is unique. To begin with, many of the key characters of the operation (Shimon Peres, Yitzhak Rabin and Yigal Alon, all of whom played key rolls in the decision making process of this operation) were acting as themselves. Secondly, the Israeli army actively participated in the making of the movie, thus making the level of realism higher than most other action movies ever made. Third, Yoram Globus, in his break-through movie (that opened the gates of big-time Hollywood for him) proves that he can direct a good action movie, based on a great story, and coming out on top of his game. All in all, a great movie to watch. 9 out of 10 in my book-keeping.",
         "I really liked this movie. I rented it through Netflix and they do not have the extras so I was not able to see the other parts. I liked where the Commandos were practicing their moves and their exiting the planes and entering the practice buildings. Usually in movies you do not see the training and practicing that goes into a rescue like this. When the Commandos landed they put lights where the other lights were and I wondered why when there were already lights there. When the tower was told to turn off the lights, it all made sense. I wondered why the Commandos were not wearing helmets or caps or something on their heads. I also wondered why, when the plane landed, there were bright lights inside the plane. In a night operation, you would think they would have a red light or no lights at all to enhance their night vision. I did like where the Commandos would throw a grenade in the room first, one man went left and the other right spraying the room with bullets. The part where the Commandos used RPG's to blow up the planes and the control tower was good too. The Uzi's, RPG's and AK47's were real looking and used in a proper manner. I also liked the part with Idi Amin giving a speech to the hostages-he really sounded nuts! All in all I liked this film. I hope to find a DVD with the extras so I can watch them also.",
         "Not that I've seen all that many Israeli action movies, but it's definitely the bets one I've seen. Yes, this movie is dated. It relies on stereotypes and is full of cliches like the \"oh-no!\" quick-zoom. The dialogue is sometimes silly and there are a variety of flubs, both in continuity and historical accuracy. But, it's fun! From the music (which is so wonderfully 70's) to the memorably cheesy lines, and of course the sheer audacity of the mission that gives the movie its title, it all makes for an exciting and surprisingly emotional film. It's also the only film I know of where most scenes were shot twice so it could be released in two different languages. There is a Hebrew version out there (recently released on DVD, but hard to find) and an English version (first released on VHS and Beta in 1984, after which there may or may not have been a subsequent 1991 VHS re-release). And neither version is dubbed! Gotta love it.",
         "This is an amazing retelling of Israel's great Entebbe victory. It doesn't sink into melodrama, but shows us how all the pieces were brought together for this singular achievement. Exciting, gripping, and with a sense of realism rarely seen.",
         "While peace in the middle east seems as far away now as it did in 1949, you gotta hand it to em that they sure can still make a hell of a good movie. While the actual operation of the 1976 rescue of the 100+ hostages held at Entebbe airport is not probed into as much with this film as with RAID ON ENTEBBE, this is the infinitely more fun one of the two to watch. Dov Seltzer's music is really the star with this film, particularly with the really cool opening theme which plays in many variations whenever Yoni is onscreen and the theme that plays at Entebbe airport whenever it shows the guards standing around, etc. The music works best during Yoni's death scene (this is no spoiler since the events of the film are historically accurate, and pretty well-known too) where it really takes his usual theme but drags it out to sound all tragic. Gotta love the ultra-70's style filming and editing. Lots of zoom-ins and odd use of models, stock footage, and stand-ins which is sometimes cheesy, but always entertaining in some way. It's all pretty standard stuff until the ending battle, which is handled in a very high-octane way as opposed to RAID ON ENTEBBE, where they did a lot of standing around and things tended to work out better (It would be more interesting to know which of the two is more historically accurate). Klaus Kinski and Sybil Danning are the other stars here. Their problem though is that they are underused. Klaus doesn't act quite crazy enough (though he does a lot of running around and has a really cool death scene), and Sybil Danning's stunning unearthly beauty is not exploited enough, hidden behind poofy hair, bulky dress, and a large pair of sunglasses. One might be angry at watching this and not getting their full Kinski or Danning's-worth, but it's better than not having them here at all. The authenticity involved in much of the rest of the film is amazing, with Rabin and Peres doing some acting (though they never speak, on-camera and the scenes where people are talking to them look suspiciously like they used doubles) and supposedly 12 of the original hostages returned to reprise their roles in this film. However, it goes out of its way to demonize the PLO, Che Guevaranians, and Idi Amin (though with him that's another story). Everything with the villains is a lot darker and more mean-spirited than in RAID ON ENTEBBE, but it all works to make this film more fun. Just take it as entertainment and not as fact, because of course it was the winners that made this. Just a fun and fast-paced little forgotten movie. Where's the DVD?",
         "Accurately historically, keeps the rhythm to the very end. Seems even better than the two other versions of it. I liked it very much. It was a good idea and implementation the usage of real video of Israeli leaders. The film describes the Operation Entebbe, which took place on the night of July 3 and early morning of July 4, 1976. Originally called Operation Thunderbolt by the Israeli military who planned it and carried it out, and it was subsequently renamed Operation Yonatan after the raid commander, Col. Yonatan \"Yoni\" Netanyahu, the only Israeli soldier to die in the raid. \"Yoni\" was the brother of the former Israeli primer minister Benjamin Netanyahu, of the Likud party. The Israeli singer and actor Yehoram Gaon played Col. Netanyahu and there is a good acting by the German actor Klaus Kinski as the leader of the terrorist gang. A good war film but more than that a must for those who like films on international affairs.",
         "The movie depicts the true operation to release hostages in Uganda by Israeli commandos. The movie focuses on the leader of the operation - who ends up as the only casualty - very much like a french movie. The movie uses 4(!) different languages (Hebrew, English, German and Arabic) that lend to the credibility and authenticity of the movie. The plot has good pace and does not let you dose off for a second. The story is \"classic\" and powerful.",
         "This 1977 Oscar nominated film in the category of \"Best Foreign Film\" is based on the true story of the rescue mission led by a young Israeli Army officer, Jonathan \"Yoni\" Netanyaho that astounded the world. Yoni's brother, Benjamin Netanyaho would go on to become the Prime Minister of Israel. This film still stands today with the other films about the Entebbe rescue as an inspiration of what can be accomplished when heroic people of honor and determination, the Israel Defense Forces, come face to face with the forces of evil, in this case German and Palestinian terrorists. There is no fluff in this movie, just an honest portrayal of heroism by the innocent civilian hostages, the Air France flight crew and the IDF soldiers, pilots and flight crews. To truly define this film I would like to quote in part a letter from Benjamin Netanyaho which come with each 25th Anniversary DVD. \"........The story of Yoni and his comrades in Entebbe sheds light on the other heroes of Israel, known and unsung alike, who through their sacrifice and courage delivered our people time and again from the abyss of disaster, in the wars of Israel as at Entebbe. I can only hope that their great spirit, as captured in this film, will serve to meet the great challenges that still await us.\"",
         "In 1976 an airplane travelling from Tel Aviv to Paris made a stop in Athens and was hijacked by Palestinian and German terrorists. They flew the plane to the Entebbe airport in Uganda, then under the rule of the dictator Idi Amin, separated the Israeli passengers from the others and threatened to kill them if Israel didn't release several Palestinian prisoners. Israel's response was to organise one of the most perfect rescue operations in the history of rescue operations. Operation Thunderbolt was not the first dramatisation of this rescue but was the first one fully made by Israelis, with the collaboration of the Israeli government and the Israeli Air Force. This has worked simultaneously in its favour and detriment. From a purely factual and realistic perspective, it's the best dramatisation of the events. But the movie carries a slight stench of propaganda – one gets quickly tired of listening to characters declaring Israel as the greatest country in the world; even if that is true, there is a thing called modesty. Israel is a small country that has successfully repelled attacks from its neighbouring enemies. I can understand how that inflates its citizens with a sense of ego. But one thing is national pride; chauvinism is something quite different. Watching this movie I also remembered some of the criticism the Brazilian movie Elite Squad was levelled with: this movie sounds and looks like a massive recruitment campaign. Join the army and kick ass! The movie also has a bipolar approach to some of the factual events of the hijacking. On the one hand, it surprisingly portrays the terrorists in a very objective light. I can't imagine a better choice to play the terrorist leader than the devilish Klaus Kinski, an actor who portrayed evil so seductively. Kinski's terrorist sees himself as a freedom fighter, an idealist who believes in the Palestinian cause. He's smart, in control and attentive to the needs of his hostages. Kinski plays Wilfried Böse. Böse's terrorist career was recently portrayed in the French TV series Carlos, which briefly references the Entebbe Operation. Böse was a left-wing revolutionary who opposed imperialism and dreamed of a world revolution to make the world a fairer place. Like many revolutionaries of his time, he embraced the Palestinian causes as a just one. This movie sadly skips most of the historical context but still portrays him as a credible person and not as a caricature. On the other hand the movie fails to clearly address the fact that this wasn't about kidnapping Jewish people but Israeli citizens. In the harrowing sequence when the passengers are separated in two groups, we're shown the passengers being divided between Jews and Gentiles. In fact several Jewish people who did not have an Israeli passport were released. The terrorists retained only Israelis citizens. This for me is the movie's major weakness – trying to frame the event as a crime of anti-Semitism and not putting in the context of the Israeli-Palestinian conflict, where terrorists are motivated not by ethnic but political reasons. In other words, the movie shows the Israelis being kidnapped just because they're Jews and not because they belong to a country whose successive governments have been accused of committing war crimes too. This simple victimisation and lack of self-scrutiny is the strongest criticism I can level against this otherwise remarkable thriller. Politics aside, Operation Thunderbolt is an amazing adrenaline rush, tightly edited and always moving at a frantic pace, shifting between the Israeli forces and the terrorists, keeping the viewer glued to the screen as he impatiently waits for the spectacular climax. The movie opens with Colonel Yonatan Netanyahu (Yehoram Gaon) training with his men for hijacking situations in a foreshadowing of the actual operation. Yonatan is never satisfied with his men's results and has them repeat the exercises over and over. Then the action moves to Athens, introducing the passengers. Several are described in broad strokes and immediately gain the viewer's sympathy. When the terrorists take over the plane, the viewer is already on the hostages' side. Although the outcome is already known, the movie sustains a high note of suspense. The ending doesn't lose one iota of its emotional impact just because we know the hostages will be saved. After sharing with the hostages their plight, I think any viewer will finish this movie feeling a triumphant joy. There are happy endings a dime a dozen and then there are endings that fill us with a deep sense of justice, that leave us with the impression that the world has been put back in order. I couldn't finish this review without praising Dov Seltzer's score, whose powerful main theme is played throughout the movie with several variations in tone, from elegiac to a fast-paced groovy theme that screams '70s. Seltzer's music is almost the cement that holds movie together and deftly underscores the tension and the horror of the story. Like the movie, the score is an unknown gem awaiting greater recognition. Menahem Golan achieved some success in the United States after this movie. He went on to make The Delta Force, with Chuck Norris. I never saw it and I don't know much about Golan's style. In this movie he thankfully didn't try to make anything too ostentatious. He shoots the scenes with simplicity and the certainty that the true story is enough to carry the movie, and indeed it is.",
         "Following my recent viewing of Israeli director Moshe' Mizrahi's French movie MADAME ROSA – the 1977 Oscar winner for Best Foreign Language Film – I decided to watch the only remaining contender in that category sooner rather than later. As it turned out, the official Israeli entry was the weakest of the five final selections and I am guessing that its sheer topicality – being based on a very recent hijacking episode that had grabbed world headlines – was what made it jump ahead of other notable competitors among the 24 international Oscar submissions, namely Larisa Shepitko's THE ASCENT, Wim Wenders' THE American FRIEND, Bo Widerberg's THE MAN ON THE ROOF (1976), Paul Verhoeven's SOLDIER OF ORANGE and Krzysztof Zanussi's CAMOUFLAGE. For the record, my relative disappointment with OPERATION THUNDERBOLT has just been exacerbated by my discovering that I had acquired and watched the U.S. Theatrical Version (culled from a TV screening on the MGM channel) – which has characters mostly speaking their lines in English, barring the occasional lapses into French and German – rather than the original version which has characters (be they Israeli, German, French or African) rightfully speaking in their native tongue...and which is available as a \"Full Movie\" video on \"You Tube\" and on a renowned torrent download site! Having said that, craggy-faced chief hijacker Klaus Kinski's equally distinctive voice can be heard in both versions but, apart from his trigger-happy cohort Sybil Danning and nemesis Assaf Dayan (as the Israeli commando second-in-command), he is the only recognizable name in the cast...that is, if one is to discount the personal, silent appearances of the Israeli politicians that faced the crisis in real life, Yitzhak Rabin and Shimon Peres; in any case, the acting honours here are stolen by Yehoram Gaon as the ill-fated commando leader Yonatan Netanyahu (who, at one point, is amusingly seen reading Alistair MacLean's \"Circus\" - a novel I also read myself as a kid). This sharply contrasts with the contemporaneous, star-studded, rival re-enactments of the events for U.S. TV, namely VICTORY AT ENTEBBE (1976; which I had intended watching last year for Burt Lancaster's centenary but had to jettison it due to time constraints) and RAID ON ENTEBBE (1977) – both of which, incidentally, also exist in longer and shorter edits. While the fact that the viewer is aware from the outset of the narrative's outcome can perhaps lead to the film feeling rather predictable, the presence of a surprisingly restrained Kinski (billed \"Kinsky\" in the all-English opening credits!) and Danning make up for that; on the other hand, while the final assault on Entebbe airport occurs towards the very end of the film and can thus appear to be a long time coming, the swift depiction of it is quite electrifying (especially the sight of Kinski's twitching body as it expires early on in a hail of machine-gun bullets). Seeing the names of commercial 1980s Hollywood entity Cannon Group founders Menahem Golan and Yoram Globus among the makers of this film somewhat undermine its proposed authenticity (shot with the full co-operation of the Israeli government and Air Force); indeed OPERATION THUNDERBOLT (which, decades afterwards, also became the name of a video game!) succeeds more as an action movie than a psychological or political thriller which might not have been congenial to this particular subject but serves as a veritable template for the later Cannon Group star-studded blockbuster THE DELTA FORCE (1986; also helmed by Golan and easily Chuck Norris' most prestigious star vehicle) complete with overblown rousing music throughout.",
         "This is a terrific movie. I probably ought to rate it higher than I do. The use of clichés in the film, on the other hand, might have lowered the score I gave it. Even though most of us know the Entebbe story well (that is the spoiler), I found the anxiety the movie produces intense. I almost felt a need to use a nitro patch. One jarring note is recorded as a flaw in continuity: The opening is of the actual Air France Airbus; however, subsequently, the movie uses a Boeing 707 with inaccurate Air France colours. Otherwise, realism dominates the narrative. The Hebrew version makes the movie feel more authentic than the English version does. One does not have to know a language to appreciate hearing it in a film. The film uses Hebrew, English, German, and Arabic in a great mix. I adore Sybil Danning. As always, Klaus Kinsiki is wonderful.",
         "Golan & Globus at their best, which is to say it's a mediocre movie. A one and a half hour movie crammed into two hours. I was surprised they didn't have an epilogue, since it's history it would have been nice. Not nearly as good or as historic as \"Raid on Entebbe.\" It's only bad enough to be entertaining in a few spots. Klaus Kinski is wasted and Sybil Danning is dressed with HUGE sunglasses and a potato sack for a dress.",
         "It seems that just after the events, the subject was so hot that is went on to be over exploited in both small and wide screen movies. Unfortunately, all movies are near-sighted and tell the story from a single point of view, the Israeli one, which seems to be deemed equivalent to the entire world's point of view. When a movie recounts historical events, I would like that movie to exploit the subject to a reasonable depth and keep the circumstances realistic. I have held the same problem against the more recent '300' movie, as well as others and this happened with most movies that have one side against another: simply telling the world \"we're better than the others\" isn't enough, this has to be shown from a fair and direct comparison that the spectator can relate to."
      ],
      "genres": [
         "Action",
         "Drama",
         "History"
      ],
      "productionCompanies": [],
      "summaries": ["In July 1976, an Air France flight from Tel-Aviv to Paris via Athens was hijacked and forced to land in Entebbe, Uganda. The Jewish passengers were separated and held hostage in demand to release many terrorists held in Israeli prisons. After much debate, the Israeli government sent an elite commando unit to raid the airfield and release the hostages. The film is based on the true facts and follows the events since the flight's takeoff and until the hostages' return to Israel."],
      "budget": 2500000
   },
   "movielensId": 130680,
   "movielens": {
      "languages": [
         "العربية",
         "English",
         "Deutsch",
         "עִבְרִית"
      ],
      "releaseDate": "1977-06-06",
      "dvdReleaseDate": null,
      "directors": ["Menahem Golan"],
      "runtime": 124,
      "movieId": 130680,
      "title": "Operation Thunderbolt",
      "mpaa": "",
      "actors": [
         "Yehoram Gaon",
         "Gila Almagor",
         "Klaus Kinski",
         "Assi Dayan",
         "Shmuel Rodensky",
         "Rolf Eden",
         "Sybil Danning"
      ],
      "imdbMovieId": "0076398",
      "originalTitle": "מבצע יונתן",
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In July 1976, an Air France flight from Tel-Aviv to Paris via Athens was hijacked and forced to land in Entebbe, Uganda. The Jewish passengers were separated and held hostage in demand to release many terrorists held in Israeli prisons. After much debate, the Israeli government sent an elite commando unit to raid the airfield and release the hostages.",
      "tmdbMovieId": 26113,
      "avgRating": 2.64286,
      "releaseYear": "1977",
      "numRatings": 7,
      "posterPath": "/wagQ3iSBVbAnHZiyZgn9jzH474e.jpg"
   }
}