{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0084387",
      "video": false,
      "title": "Nana, the True Key of Pleasure",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Nana",
               "gender": 0,
               "credit_id": "550706a39251412c050049d7",
               "name": "Katya Berger",
               "profile_path": null,
               "id": 43192,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Count Muffat",
               "gender": 2,
               "credit_id": "550706c9c3a3686b750022ac",
               "name": "Jean-Pierre Aumont",
               "profile_path": "/zmH3P6Wr5hkiRo8Rx060nhvAEdX.jpg",
               "id": 18766,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Steiner",
               "gender": 2,
               "credit_id": "5507070792514174b60045bf",
               "name": "Yehuda Efroni",
               "profile_path": null,
               "id": 39784,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sabine",
               "gender": 2,
               "credit_id": "5507077cc3a3682529004aa0",
               "name": "Yehuda Efroni",
               "profile_path": null,
               "id": 39784,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Faucherie",
               "gender": 2,
               "credit_id": "550707a292514179fb00229a",
               "name": "Massimo Serato",
               "profile_path": "/vQlY5M9F1KERGi5xr35ynderDMy.jpg",
               "id": 14148,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Satin",
               "gender": 1,
               "credit_id": "550707bac3a3682529004aaf",
               "name": "Debra Berger",
               "profile_path": "/6z1DBoQPi0K5oVZ34LdOC6lXU5n.jpg",
               "id": 20117,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "550707d2c3a3683d78000b42",
               "name": "Shirin Taylor",
               "profile_path": null,
               "id": 1229207,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Rennée de Chéselles",
               "gender": 0,
               "credit_id": "550707f1c3a36862e9004eb9",
               "name": "Annie Belle",
               "profile_path": "/vmLEPb1WZ1eIbGcjDnMaWFt1lJL.jpg",
               "id": 101576,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Xavier",
               "gender": 2,
               "credit_id": "550708249251412c050049ec",
               "name": "Paul Müller",
               "profile_path": "/v3tZduw1pzCx6eeoYO6eWkwB0cu.jpg",
               "id": 101549,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Hector Muffat",
               "gender": 0,
               "credit_id": "5507083fc3a36862e9004eca",
               "name": "Marcus Beresford",
               "profile_path": null,
               "id": 1440944,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Fontan",
               "gender": 0,
               "credit_id": "5507085ec3a368262e004989",
               "name": "Robert Bridges",
               "profile_path": null,
               "id": 172953,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "George Mellies",
               "gender": 2,
               "credit_id": "5507087c9251416cb7002893",
               "name": "Tom Felleghy",
               "profile_path": "/7Q1KOJeCp2ZODPiSVQXqrmXr5QE.jpg",
               "id": 39432,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5507066c9251416cb700287d",
               "name": "Émile Zola",
               "profile_path": "/oXA6DkOtc1xYaKmmbAUc2l56UEh.jpg",
               "id": 87667,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "550705c99251411db4002d6c",
               "name": "Dan Wolman",
               "profile_path": "/qr83K1R6gbT4oq8WAWFx16k4GOA.jpg",
               "id": 139107,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "550706449251412c050049d2",
               "name": "Marc Behm",
               "profile_path": null,
               "id": 29496,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 1.468198,
      "production_countries": [],
      "id": 168538,
      "vote_count": 3,
      "budget": 0,
      "overview": "In Zola's Paris, an ingenue arrives at a tony bordello: she's Nana, guileless, but quickly learning to use her erotic innocence to get what she wants. She's an actress for a soft-core filmmaker and soon is the most popular courtesan in Paris, parlaying this into a house, bought for her by a wealthy banker. She tosses him and takes up with her neighbor, a count of impeccable rectitude, and with the count's impressionable son. The count is soon fetching sticks like a dog and mortgaging his lands to satisfy her whims.",
      "similar": [],
      "original_title": "Nana",
      "runtime": 92,
      "poster_path": "/pg4PUHRFrgNfACHSh5MITQ2gYch.jpg",
      "spoken_languages": [],
      "production_companies": [
         {
            "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
            "name": "Cannon Group",
            "id": 1444,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1983-06-13",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Dan Wolman"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Émile Zola",
         "Marc Behm"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084387/",
      "coverLink": null,
      "actors": [
         "Katya Berger",
         "Jean-Pierre Aumont",
         "Yehuda Efroni"
      ],
      "reviews": [
         "Nana (1982) was an \"erotic\" film that was loosely based upon the Emile Zola novel. I saw this film when I was in high school on pay cable during the late 80's. There was only a couple of scenes that made the movie enjoyable. The rest was pretty lame, tame and filler. I have to warn you that the movie is pretty \"Euro\" and some people will be turned off by the \"realism\" of the way women are shown in this movie. But if you love the \"au natural\" look, then you'll be in heaven. Today this film is pretty hard to find. I don't think that their was a strong demand for this film on video. But seriously, I wouldn't go out of my way searching for a copy. Okay, not thrilling. Just okay.",
         "This is my first time watching a film like this and I'm not sure what I was expecting--both more and less? The film seemed to be at most a sexual farce done in as a series of pretty tame soft porn vignettes loosely held together by a rather clichéd plot line--the greedy Jezebel taking down every man who crosses her path. If this is some kind of take regarding female sexual power I definitely have mixed feelings about the way it is portrayed: On the one hand it plays every man as leering pervs only out for the own sexual satisfaction--yet helpless idiots in the face of her (apparently very young)faux innocence. In that regard they pretty much deserve what they get--but on the other hand she has no care for the consequences of her own greed or the men she uses (as they use her). It is hard to feel much of anything for any of the characters and that is likely the film's biggest failure. There is a strong undertone of pure hostility for both sexes in this film that is hard to miss and rather odd for a film outwardly celebrating sexual freedom. The strongest clue we get as to what is really going on is actually expressed by the main \"wife\" of the story when she disapprovingly says something along the line that our heroine is \"one of those girls who actually enjoys....\" you know. Apparently we are being lead to believe that every man falls at Nana's feet because they are totally sex-starved at home. So, ultimately everything that happens is the fault of wives who don't give their husbands what they need? As far as the film itself: I have to say that it can be very hard to judge anyone's acting when viewing a dubbed film; flat voice dubbing can bring down even an excellent character portrayal. As a result I can't fairly rate the acting; the music was very distracting-sometimes seeming to celebrate the unconscionable. I have no idea if that was original or not to the film, so again cannot fairly judge. Dubbed films rarely do justice to the original. I had a problem with the main actress's supposed sexual allure given I didn't feel she was that attractive--those eyebrows! But perhaps they chose that look in order to make her look younger and more innocent--which would fit with the entire theme. Certainly other reviewers disagree with my personal assessment--and in fact some of histories most notorious femme fatales (Cleopatra, Violet Wodehouse of painter Sargent fame, etc) weren't physically beautiful; there was apparently some other intangible allure. Beauty certainly is in the eye of the beholder! I had to laugh at some reviewers criticisms of the \"au natural\" look. I suspect at least SOME of those were \"merkins\", nothing natural about those at all--and at least unshaved 'pits were accurate for the time and place (and still are in some cultures!). As far as historical accuracy, France was notorious for it's sexual freedom even at that time and yes, primitive moving pictures did exist. Lots of full frontal female nudity; sorry ladies, no male genitalia-though we do see suggestive silhouettes and otherwise nicely masculine (unshaved) nude males. The sex isn't graphic, despite the nudity and is mostly done to draw in the audience as voyeur, in much the same way as the rest of the cast when they're around. The whole film is voyeuristic. As a story though, pretty tame. It would have helped a great deal if there had been at least ONE character we could have identified with and cared about.",
         "In the opening titles of this movie it says that is \"loosely based\" on the fin-de-siècle novel of Emile Zola. I haven't read the novel, but I am a little suspicious about the lesbian scenes and the bizarre \"human cockfighting\" scene. I am also quite sure that Zola never claimed that his contemporary, George Melies, a real-life silent French filmmaker (who was also a character in Scorcese's \"Hugo\")made porn loops to show in Parisian brothels. I suspect the notorious 80's low-rent Israeli producers Golan and Globus took at least some liberties with both fiction and reality. This is a movie about a young actress and prostitute, who shows up at a brothel and becomes an object of obsession for numerous men--a Jewish banker, a count, and the impressionable son of the count--and proceeds to blithely destroy all their lives. The lead, 18-year-old Katya Berger, is not an especially beautiful girl, but she has a very nice body, which is useful since she spends a great deal of the movie nude. Berger is one of a several young German actresses of the 70's (including Lara Wendel, Katja Bienert, and most famously Nastassia Kinski)who actually appeared in a lot of nude and erotic roles BEFORE they were \"legal\" by modern-day US/UK standards. Berger's 1978 debut, \"Labias Piccolas\", for instance, is available in the US today, but reputedly shorn of about 11 minutes of underage nude scenes. But that is not a problem in THIS movie made five years later. Of course, she does have a lesbian scene with an actress played by her real-life sister, Debra Berger (both are daughters of spaghetti Western actor William Berger)and an inter-racial oral sex scene. And there are a couple other notorious figures in the cast including Annie Belle, a French \"lolita\" actress from the earlier 70's, and 60's British party girl Mandy Rice-Davies, who was caught up with Christine Keeler in the \"Profumo Affair\", which brought down a British government and was later chronicled in the movie \"Scandal\". Clearly the Go-Glo boys were trying to court a little controversy here. Given all that though, this movie is surprisingly boring. One problem is that the only really strong actor here is Jean-Pierre Aumont, but a lot of it is that director Dan Wolman is not very adept at drawing out any believable drama. Still, it is not a terrible movie and isn't worse than any other Golan-Globus film--whether or not you consider THAt a recommendation. . .",
         "Nana DVD \"Rare\" Young Katya Berger plays many Nude scenes in the unedited version,Rated R contains extensive nudity, Katya is a absolute beauty! Young Katya Berger bares a lot of skin in this costume drama about a young Parisian lady who finds work at a burlesque club and then takes advantage of the perverts who come there. The film takes place in the 1880's, one of the stars of the club has created movies, the movies created were not very exciting but nudity all the same and very tame for today's standards. Mandy Rice-Davies, who helped bring down the British Government years ago, appears in this film. Costume drama for completest or those who want to see a poor man's Brooke Shields/Eva Ionesco, anyway you put it Katya is a stunning beauty that could steal any older man's heart and that is exactly what she did in this movie, very seductive, sexy and gorgeous all in one bundle! A true must have and to own. Purview",
         "Katya's gorgeous body is on display in this film, along with a lot of other naked beauties. She also has captivating eyes. The nudity should be enough for any straight male, but it's entertaining and engaging even if it wasn't packed with nudity. Fun story, better than a lot of Cannon films. Nana is an actress who puts on nude shows along with a lot of other women for a crowd, sometime around the turn of the century. Nice costumes, sets and the acting isn't bad. Katya's beauty, however, steals the show. This film should really be on blu-ray.",
         "Usually I don't review anything I haven't watched in its entirety, but it was 2 at night, half an hour still to go, and I was certain that I would not miss anything of value by going to sleep. (Was anything produced by Golan and Globus ever of value?) There are two major problems in this film. First is the plot: too many scenes are individual sketches that don't connect to anything. Not that this is a surprise in softcore porn... The second, and worse, problem is Katya Berger. She is supposed to bewitch every man in the film but I totally fail to see how. All I saw was a little girl with zero acting abilities, not even that pretty. OK, the green eyes are cute in close-up, but several other women in the film are far better-looking. Nothing else is too convincing either. What seemed interesting at first was the presence of the legendary Georges Méliès as a character. There, too, is a dual problem: the two examples of his films do not look like genuine films of the era, and they have none of the inventiveness that was his trademark.",
         "There was an interesting aspect of this film: Golan, Globus and Dan Wolman made two versions of this film. One was a PG version that they hoped to sell to T.V. and the R-Rated one that was filled with nudity. 18 year-old Katya Berger bares a lot of skin in this costume drama about a young Parisian lady who finds work at a burlesque club and then takes advantage of the perverts who come here. The film takes place in the 1880's yet one of the stars of the club has created movies. Not very exciting and very tame for today's standards. A turn-off in this film is the women who didn't shave under the arms. Ewww. Mandy Rice-Davies, who helped bring down the British Government years ago, appears in this film. Costume drama for completists or those who want to see a poor man's Brooke Shields."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Cannon Group"],
      "summaries": ["In Zola's Paris, an ingenue arrives at a tony bordello: she's Nana, guileless, but quickly learning to use her erotic innocence to get what she wants. She's an actress for a soft-core filmmaker and soon is the most popular courtesan in Paris, parlaying this into a house, bought for her by a wealthy banker. She tosses him and takes up with her neighbor, a count of impeccable rectitude, and with the count's impressionable son. The count is soon fetching sticks like a dog and mortgaging his lands to satisfy her whims. She bankrupts him, arranges the debauching of his wife, and seduces his son on his wedding day. What else can she accomplish before she leaves Paris airborne?"],
      "budget": 0
   },
   "movielensId": 130744,
   "movielens": {
      "languages": [""],
      "releaseDate": "1983-06-13",
      "dvdReleaseDate": null,
      "directors": ["Dan Wolman"],
      "runtime": 92,
      "movieId": 130744,
      "title": "Nana, the True Key of Pleasure",
      "mpaa": null,
      "actors": [
         "Katya Berger",
         "Jean-Pierre Aumont",
         "Yehuda Efroni",
         "Yehuda Efroni",
         "Massimo Serato",
         "Debra Berger",
         "Shirin Taylor",
         "Annie Belle",
         "Paul Müller",
         "Marcus Beresford",
         "Robert Bridges",
         "Tom Felleghy"
      ],
      "imdbMovieId": "0084387",
      "originalTitle": "Nana",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In Zola's Paris, an ingenue arrives at a tony bordello: she's Nana, guileless, but quickly learning to use her erotic innocence to get what she wants. She's an actress for a soft-core filmmaker and soon is the most popular courtesan in Paris, parlaying this into a house, bought for her by a wealthy banker. She tosses him and takes up with her neighbor, a count of impeccable rectitude, and with the count's impressionable son. The count is soon fetching sticks like a dog and mortgaging his lands to satisfy her whims.",
      "tmdbMovieId": 168538,
      "avgRating": 2,
      "releaseYear": "1983",
      "numRatings": 1,
      "posterPath": "/pg4PUHRFrgNfACHSh5MITQ2gYch.jpg"
   }
}