{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0064625",
      "video": false,
      "title": "Maidstone",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Norman T. Kingsley",
               "gender": 2,
               "credit_id": "52fe4bb5c3a36847f82108f5",
               "name": "Norman Mailer",
               "profile_path": "/m35HzjfGleHYTRbVuAi8o4JSzEu.jpg",
               "id": 143280,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Raoul Rey O'Houlihan",
               "gender": 2,
               "credit_id": "52fe4bb5c3a36847f82108f9",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4bb5c3a36847f82108f1",
            "name": "Norman Mailer",
            "profile_path": "/m35HzjfGleHYTRbVuAi8o4JSzEu.jpg",
            "id": 143280,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.099102,
      "production_countries": [],
      "id": 117424,
      "vote_count": 1,
      "budget": 0,
      "overview": "Over a booze-fueled, increasingly hectic five-day shoot in East Hampton, Norman Mailer and his cast and crew spontaneously unloaded onto film the lurid and loony chronicle of U.S. presidential candidate and filmmaker Norman T. Kingsley debating and attacking his hangers-on and enemies. This gonzo narrative, “an inkblot test of Mailer’s own subconscious” (Time), becomes something like a documentary on its own making when costar Rip Torn breaks the fourth wall in one of cinema’s most alarming on-screen outbursts.",
      "similar": [],
      "original_title": "Maidstone",
      "runtime": 106,
      "poster_path": "/zdnCePCERpYIqWqXQteACuJS1Rs.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1970-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Mailer"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Norman Mailer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064625/",
      "coverLink": null,
      "actors": [
         "Norman Mailer",
         "Rip Torn",
         "Paul Austin"
      ],
      "reviews": [
         "This film can be considered significant only as a tribute to Norman Mailer's monumental ego. It is a total bore, and there is hardly anything memorable about it. The only thing that is memorable is a scene in which Rip Torn unexpectedly bites Mailer on the ear, hard enough to draw blood. This causes Mailer and Torn to come out of character and have a real confrontation, in which Beverly Bentley, Mailer's wife at the time, inserts herself. Other than that, completely forgettable.",
         "I recently saw Maidstone in a French DVD and have to say this movie is nowhere as bad as its reputation would have you believe. In fact, in light of the now pervasive presence of 'reality' based TV, the kind which thrives on humiliation, preying on our secret blood lust for murder, Maidstone, like the best of Mailer's literary work, is outright prophetic. Mailer's ambition may not be as long as his reach, but flawed as it is, Maidstone still works like a cinematic Cassandra machine. Not only is it a fascinating dissembling of Mailer and his infamous ego, but it captures the apocalyptic delirium of that terrible year of 1968 better than numerous documentaries made around that time. A significant, tragically under-appreciated, work of the underground cinema that is ripe for rediscovery and re-evaluation!",
         "Maidstone is another flight of insufferable ego from Norman Mailer in which the \"great man\" plays radical filmmaker and presidential timber Norman Kingsley. Shot in color and the wide open spaces of East Hampton on a bigger budget it is a marked departure from Mailer's two earlier claustrophobic bores but it still suffers from the same disjointed improvised stuttering about by clueless characters attempting to interact with Mailer's badgering. It's all moribund living theatre as Mailer/Kingsley and camera roam grand East Hampton estates and get in the face of a bevy of false eye lash candidates explaining obliquely what the role entails which from the looks of the footage a substantial amount of it calls for making out with the sybaritic Norman. There are some pallid attempts to shock with some crass soft porn as well as address social issues with disenfranchised minorities along with heavy doses of Mailer pontificating in a couple of accents. Meanwhile he hacks at the editing with a machete turning everything into a sound bite. Later under a shady tree Norman summarizes to cast and crew what he was attempting to get at with his seesaw reality/fiction production likening it to a battle and attack, something it seems actor Rip Torn takes to heart when he attacks Norman with a hammer since fictional Kingsley is target for assassination. Mailer is taking a beating before wife Betty Bentley and the kids step in to save Norm. But the camera keeps rolling as the winded, bleeding and incredulous writer stumbles off (along with his traumatized family), a victim of his pretentious hyperbole but not before recording the most powerful and absorbing scene of the whole film in which Mr. Torn must be given writing credit. Despite this happy ending it remains an arrogant mess of smarmy guerrilla theatre filled with the fatuous musings of a guy desperate for attention willing to say anything to do just that.",
         "It's just as incohesive as his other directorial efforts, but as a sociological study of late 1960s America, Norman Mailer's MAIDSTONE is a masterpiece. Shot in 1969 in the Hamptons, Mailer assembles a large cast of ne'er do wells, freaks, family members, hippies, black radicals and at least one professional actor for this epic look at the massive egomania that goes into creating a work of \"art.\" Mailer himself plays a film director and possible presidential candidate shooting a remake of Luis Buñuel's BELLE DE JOUR...of course, this being a Mailer production, the whores are all men and the clients are all sexy women. Rip Torn is the nominal star, but the supporting cast, including Ultra Violet, Joy Bang, and Hervé Villechaize (in a cameo, playing piano) is really something. Mailer gives each player a shot at a close-up. He also manages to insert himself into basically every scene. The finale, featuring Torn & Mailer in a brutal fistfight, has become legendary."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Supreme Mix Productions"],
      "summaries": ["Norman T. Kingsley, famous movie director, runs for President."],
      "budget": 0
   },
   "movielensId": 130812,
   "movielens": {
      "languages": [""],
      "releaseDate": "1970-01-01",
      "dvdReleaseDate": null,
      "directors": ["Norman Mailer"],
      "runtime": 106,
      "movieId": 130812,
      "title": "Maidstone",
      "mpaa": "",
      "actors": [
         "Norman Mailer",
         "Rip Torn"
      ],
      "imdbMovieId": "0064625",
      "originalTitle": "Maidstone",
      "genres": [""],
      "youtubeTrailerIds": ["R4HVMYRz3SU"],
      "plotSummary": "Over a booze-fueled, increasingly hectic five-day shoot in East Hampton, Norman Mailer and his cast and crew spontaneously unloaded onto film the lurid and loony chronicle of U.S. presidential candidate and filmmaker Norman T. Kingsley debating and attacking his hangers-on and enemies. This gonzo narrative, “an inkblot test of Mailer’s own subconscious” (Time), becomes something like a documentary on its own making when costar Rip Torn breaks the fourth wall in one of cinema’s most alarming on-screen outbursts.",
      "tmdbMovieId": 117424,
      "avgRating": 2.25,
      "releaseYear": "1970",
      "numRatings": 2,
      "posterPath": "/zdnCePCERpYIqWqXQteACuJS1Rs.jpg"
   }
}