{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "rape victim",
            "id": 11527
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "crack house",
            "id": 207874
         }
      ],
      "imdb_id": "tt0097119",
      "video": false,
      "title": "Crack House",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Steadman",
               "gender": 2,
               "credit_id": "52fe47c2c3a36847f8146b23",
               "name": "Jim Brown",
               "profile_path": "/u2woKBMGvouznYELvlPwqj4Y81A.jpg",
               "id": 4774,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dockett",
               "gender": 2,
               "credit_id": "52fe47c2c3a36847f8146b07",
               "name": "Anthony Geary",
               "profile_path": "/gCxW4Bx4u1pXSLxXaCCh6Jw0Cq0.jpg",
               "id": 92684,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lt. Johnson",
               "gender": 2,
               "credit_id": "52fe47c2c3a36847f8146b0b",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mother",
               "gender": 1,
               "credit_id": "52fe47c2c3a36847f8146b0f",
               "name": "Angel Tompkins",
               "profile_path": "/uKsybLhwT46UWpA9lsJpaa5SNfP.jpg",
               "id": 45002,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "B.T.",
               "gender": 2,
               "credit_id": "52fe47c2c3a36847f8146b13",
               "name": "Clyde Jones",
               "profile_path": "/sSJWqS8cBveSoMkSbDVMR3DSZ9C.jpg",
               "id": 108188,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Chico",
               "gender": 2,
               "credit_id": "52fe47c2c3a36847f8146b17",
               "name": "Albert Michel Jr.",
               "profile_path": "/99jKLcRRWgiEzc5QLEo39LPNUCB.jpg",
               "id": 53766,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tripper",
               "gender": 0,
               "credit_id": "52fe47c2c3a36847f8146b1b",
               "name": "Kenny Edwards",
               "profile_path": null,
               "id": 112502,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Melissa (as Cheryl Kay)",
               "gender": 0,
               "credit_id": "5446ba210e0a26633600bc1b",
               "name": "Cheryl Butler",
               "profile_path": null,
               "id": 138680,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "5446b9f9c3a3683df700b8f8",
            "name": "Michael Fischa",
            "profile_path": null,
            "id": 100645,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.001562,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 50295,
      "vote_count": 0,
      "budget": 0,
      "overview": "Rick and Melissa are a pair of young lovers hoping to get out of the slums for good and escape the poverty and crime their families and friends have gotten involved in. All this comes to an end when Rick feels he must rejoin his old gang to avenge the killing of his brother by a rival gang. In the course of getting even, Rick is arrested, leaving Melissa without anyone to protect her. She falls in with a crack dealer and quickly becomes addicted to the drug. When she gets sold to a drug kingpin by a minor dealer to pay off a debt, only Rick can save her.",
      "similar": [
         4771,
         979,
         627,
         339692,
         429733,
         23949,
         8363,
         948,
         138832,
         12143,
         6075,
         96,
         37094,
         7516,
         281,
         1572,
         97020,
         180863,
         277216,
         15069
      ],
      "original_title": "Crack House",
      "runtime": 90,
      "poster_path": "/xuFYop3DJrBelUtzriYGkyI5LMJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Silverman Entertainment",
            "id": 35933,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cannon Films",
            "id": 4110,
            "origin_country": ""
         }
      ],
      "release_date": "1989-11-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Getting in is easy... Getting out is pure hell.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Fischa"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Blake Schaffer",
         "Jack Silverman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097119/",
      "coverLink": null,
      "actors": [
         "Jim Brown",
         "Anthony Geary",
         "Richard Roundtree"
      ],
      "reviews": [
         "Crack House (1989) was one of the few film during the 80's that falls into this genre. What's supposed to be an anti-drug film turns out to be nothing more than some white-exploitation exercise in depravity. There's nothing wrong with that however. The video presentation even has an anti-drug message from one of the stars of the show Richard \"turncoat\" Roundtree, The movie follows two young lovers in high school. One of them is a quasi tough guy and the other is his girl. One of them get's turned out by a mutual friend whilst the other is given a trip to the slam and is later on given a chance to get back at his ex-friends. Jim Brown appears as the movie's \"Mister Big\", he's one bad dude who still can punk-out anybody and is a very sadistic guy who likes to smack his hoes and beat the tar out of those who try to defy his word. Luke from General Hospital makes a guest star spot as well. If you like hard edge sleaze then this movie's for you. Sadly, Hollywood doesn't make these any more and when they do, it's neither exploitative nor entertaining. Recommended for sleaze fans.",
         "This film essentially contains all the elements of a great 70's exploitation film, except it was done in the late 80's for the direct to video market. You have a young couple in love, but the whole world around them is involved either in crack dealing or gang violence. When the boyfriend goes to jail, the girlfriend ends up vulnerable to all the criminals, who are everyone in this movie except for the cops. First she gets hooked on crack by a dealer and then because he owes drug lord Jim Brown money, she becomes Brown's property. Then she's basically enslaved in a military style crack house that the movie is named for. As if this isn't enough reason to see this movie, you also have Anthony Geary playing a seemingly conservative school guidance counselor, but he's really a major crack dealer. In a sleazy yet hilarious scene, he demands sexual favors from the heroine because she has no money for a fix. In an earlier scene it was established that he is her counselor. That scene and another where Jim Brown forces her to take a scalding hot shower because she stinks are hysterical. Lead actress Cheryl Kay was really good in this film. Tarantino, bring her back. It's not surprising to me that someone mentioned in another review that Tarantino is a major fan of this. It has just the right blend of comedy, action, sex, romance, and yes a central message to stay away from drugs. Jim Brown's villainous turn here deserves to be mentioned in the same breath as another great 80's B villain, Wings Hauser in Vice Squad. Sometimes I think there should be a b movie Oscars where performances like this could be acknowledged. In the meantime let's hope that the modern straight to DVD filmmakers learn learn to use this same type of tongue in cheek humor.",
         "Brilliant. Cannon Films does it again. Man I enjoy this movie on so many levels, the hi-energy 1980's 'Rapping music' score, the brutally realistic depiction of the horrors of Crack addiction (Just Say No! kids), the politically incorrect portrayal of the Hispanic/Black LA gang wars, and the generally brutal and sadistic violence committed on the two fragile white girls by a host of visible minorities. The story is basically a tale of two lovers (a bi-racial couple) who get torn apart by the plagues of east LA circa the late 1980's; gangs and drugs. Will their love for each other help them over come these evils? The MGM DVD is brand new 2007 and Widescreen.",
         "Pretty sleazy exploitation flick from Cannon that has decent production values and above average action scenes. \"Crackhouse\" is pretty brutal and the violence is quite gritty. Ex-Playmate of the month Cheryl Butler (credited as Cheryl Kay here) shows off her assets but also turns in a rather haunting performance. She played a strung out junkie very convincingly. The rest of the acting is typical 80's cheese and Richard Roundtree plays his usual useless cop role. \"Crackhouse\" is pretty brutal and the violence is quite gritty. The best part about \"Crackhouse\" is that is features Jim Brown as a sleazy drug dealer who keeps women locked up in his crack house. After Brown has his way with the girls he tosses them over to his fellow drug dealers so they can perform gang rapes. Brown even tells a lady she \"smells like sh*t\" and that she needs to wash her a**hole. Pretty entertaining stuff. The dialog is also amusing. During a fight with a drug dealer who strung his lady out on crack, hero Rick screams \"Fu*k you, fu*ker!\" before smashing the guy's head through a van window. Then he blows up the guys van and walks away (without looking at the explosion of course). Luke from General Hospital pops up as a school teacher who happens to also be the biggest drug supplier in town (?) and forces a student to strip for a crack rock. Check the film out if you like 80's exploitation or Cannon Films. It's entertaining and well made.",
         "I saw this movie for the first time when Quentin Tarantino showed it to a bunch of us at the Alamo Drafthouse in Austin. He prefaced it with how freaking awesome he thought he was and how funny it was and in the context of his explanation, it was HILARIOUS. I can see how it would be damaging to some audiences, and the subject is not funny at all, but there are at least three lines in the film that had me laughing so hard I thought I'd pee. They don't come until after the halfway point, but when they do, oh God...you will die. Oh and Jim Brown is brilliant. He's not in a lot of the movie, but when he's there, you know whose movie it is. Naturally, the best line in the movie (and the funniest) is his; you'll know it when you hear it.",
         "Rick Morales (Gregg Thomsen) and his girlfriend Melissa (Cher Butler) are two inner city kids who have the potential to escape their grim surroundings. But he blows it when he impulsively goes gunning for revenge, after his cousin is shot dead. While he's in prison, she hooks up with the charismatic B.T. (Clyde Jones), who gets her hooked on drugs. Eventually, Rick gets word of the sorry state she's in - among other things, she is acquired as \"collateral\" by powerful drug kingpin Steadman (Jim Brown) - and works out a deal with police detective Lt. Johnson (Richard Roundtree) to get out of prison so he can dig up some dirt on Steadman. The script, by Blake Schaefer, is very routine, and the direction, by Michael Fischa, is largely uninspired. Still, there's something to savour about these trashy \"message\" potboiler features, this one produced by the almighty Cannon Group. It does create a reasonably seedy and depressing atmosphere, due largely to some good location filming. This is a world that chews up many a young person and spits them back out, and there are characters, predictably, who don't make out too well. The violence is effective, as are the moments of sex and T & A. Bad ass dudes Roundtree and Brown are worth watching. Roundtree doesn't exactly have to stretch himself a whole lot, but he's still cool. Brown is subtly powerful as the head bad guy. Anthony Geary of 'General Hospital' fame is cast as the well meaning teacher. Future film director F. Gary Gray (\"Friday\", \"The Negotiator\", \"Law Abiding Citizen\") has a tiny part as one of many gang members. Lovely Angel Tompkins does fairly well in a change of pace de-glamorized character role as Melissas' alcoholic mother. Thomsen and especially Butler are good as the kids at the centre of the story. There's nothing special about this one, but it does entertain. Six out of 10.",
         "\"Rick Morales\" (Gregg Thomsen) is a high school senior who has quit his neighborhood gang and wants out of the slums. \"Melissa\" (Cher Butler) is his girlfriend who also wants out and has dreams of pursuing a life in the fashion industry. Unfortunately, when Rick's cousin \"Jesus\" (Louis Rivera) gets killed in a drive-by shooting Rick seeks revenge and rejoins his former gang. During the attack on the rival gang he is subsequently arrested for attempted murder and put in jail awaiting trial. This leaves Melissa with no one to turn to and she is now forced to fend for herself. In no time she gets involved with a local pusher named \"B.T.\" (Clyde Jones) who she thinks will protect her from members of Rick's old gang. Instead B.T. gets her hooked on crack cocaine and her life spirals into a living hell not long afterward as she soon becomes nothing more than a sexual commodity to him and others in the drug chain. Now, rather than reveal the rest of the story and risk spoiling the film for those who haven't seen it I will just say that this a film that is raw,sleazy and graphic. I liked the fact that Jim Brown (as \"Steadman\") and Richard Roundtree (\"Lt. Johnson\") both appeared in this movie along with the performance of Cher Butler who played her role brilliantly. I also liked the presence of Heidi Thomas (\"Annie\") who lent some nice scenery to an otherwise ugly atmosphere. In any case, as I stated earlier this film is quite brutal in nature and may not appeal to everyone so viewer discretion is advised. All things considered I rate the film as average.",
         "This film may have been funny in parts but overall it was wrong!I had the misfortune of seeing around age 9.It was supposed to be about a girlfriend and boyfriend that tried to escape slum life but were confronted with the harsh realities of street life-particularly gangs and drugs. I had no idea what I was getting into; and was not looking forward to it. It scarred me for life! They would have been better of just making a straight \"hood\" or\"porno\" film anyway. This subject matter here was too serious to be trivialized for sexual kicks.Also, it was bad enough that the girls were drug addicts but they were also sex slaves.Yet another topic that is far from a joke.Other films at least show female drug addicts with some agency and choice about the levels they are willing to stoop to.This film did not even do that.I also did not like the fact that the main villains were mostly black. I am not saying you do not have black men that are this cold.But people seethe black villains all the time.Law Abiding, honest, compassionate black men DO exist. You did have a Latino and White villain; but for the most part,the black men are the villains once again. Anyway, I am not one to think that all films with serious themes should never be funny or entertaining;But this was nothing but a freaky porno film masquerading as an anti-drug message film. Like school on Sunday, just nothing classy about it ;but then again this film obviously made no pretense of going for that. Fine, but this film was a trip!I can't think of any films similar to this one off the top of my head. I have stumbled across films where they have used prison films as sex exploitation films but they did not always disgust me the way this film did. In summary, this film was a hot straight to DVD mess!It gets your attention, but then again car wrecks have the sinking ability to do that too."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Silverman Entertainment"],
      "summaries": ["Rick and Melissa are a pair of young lovers hoping to get out of the slums for good and escape the poverty and crime their families and friends have gotten involved in. All this comes to an end when Rick feels he must rejoin his old gang to avenge the killing of his brother by a rival gang. In the course of getting even, Rick is arrested, leaving Melissa without anyone to protect her. She falls in with a crack dealer and quickly becomes addicted to the drug. When she gets sold to a drug kingpin by a minor dealer to pay off a debt, only Rick can save her."],
      "budget": 0
   },
   "movielensId": 130802,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-11-10",
      "dvdReleaseDate": null,
      "directors": ["Michael Fischa"],
      "runtime": 90,
      "movieId": 130802,
      "title": "Crack House",
      "mpaa": "R",
      "actors": [
         "Jim Brown",
         "Anthony Geary",
         "Richard Roundtree",
         "Angel Tompkins",
         "Clyde Jones",
         "Albert Michel Jr.",
         "Kenny Edwards",
         "Cheryl Butler"
      ],
      "imdbMovieId": "0097119",
      "originalTitle": "Crack House",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["hFk6VVOCwwY"],
      "plotSummary": "Rick and Melissa are a pair of young lovers hoping to get out of the slums for good and escape the poverty and crime their families and friends have gotten involved in. All this comes to an end when Rick feels he must rejoin his old gang to avenge the killing of his brother by a rival gang. In the course of getting even, Rick is arrested, leaving Melissa without anyone to protect her. She falls in with a crack dealer and quickly becomes addicted to the drug. When she gets sold to a drug kingpin by a minor dealer to pay off a debt, only Rick can save her.",
      "tmdbMovieId": 50295,
      "avgRating": 2,
      "releaseYear": "1989",
      "numRatings": 1,
      "posterPath": "/xuFYop3DJrBelUtzriYGkyI5LMJ.jpg"
   }
}