{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt0128332",
      "video": false,
      "title": "Innocence",
      "recommendations": [
         46629,
         44105,
         83567,
         79084,
         31415,
         41187,
         49828,
         37523,
         96049,
         29934,
         81550,
         31176,
         300953,
         124611,
         220002,
         53206,
         80841,
         13296,
         57892,
         69610
      ],
      "backdrop_path": "/gQNSpV34v2rVRUdJJJ0RUyW30BA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Yusuf",
               "gender": 0,
               "credit_id": "52fe447c9251416c91012537",
               "name": "Güven Kıraç",
               "profile_path": "/osIuKmkvquXJ5w1YRo0V47BGbHg.jpg",
               "id": 5120,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Bekir",
               "gender": 2,
               "credit_id": "52fe447c9251416c9101253b",
               "name": "Haluk Bilginer",
               "profile_path": "/gOrSNwrctPP6k23GnP3np7wvjOR.jpg",
               "id": 117640,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ugur",
               "gender": 1,
               "credit_id": "52fe447c9251416c9101253f",
               "name": "Derya Alabora",
               "profile_path": "/gdI0Q4x6zgHaD8SRTRXYAIVQhgf.jpg",
               "id": 133818,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Cezaevi Müdürü",
               "gender": 0,
               "credit_id": "54ad0d949251414d6700a9f6",
               "name": "Yalcin Cakmak",
               "profile_path": null,
               "id": 1410158,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Otobüsteki Polis",
               "gender": 0,
               "credit_id": "54ad0da092514156790058d6",
               "name": "Iskender Altin",
               "profile_path": null,
               "id": 1410159,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Çilem",
               "gender": 0,
               "credit_id": "570a2579925141036e0004c9",
               "name": "Melis Tuna",
               "profile_path": "/whcHOFpSjC3zrD12EyJXlJKrrhU.jpg",
               "id": 1603650,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Abla",
               "gender": 0,
               "credit_id": "570a26cac3a3687796003cec",
               "name": "Nihal G. Koldas",
               "profile_path": null,
               "id": 1108183,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447c9251416c9101252d",
               "name": "Zeki Demirkubuz",
               "profile_path": "/pMablGX4RR8gAcN2cD1BIG7Z232.jpg",
               "id": 145518,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe447c9251416c91012533",
               "name": "Zeki Demirkubuz",
               "profile_path": "/pMablGX4RR8gAcN2cD1BIG7Z232.jpg",
               "id": 145518,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "570a24c8c3a368757000309d",
               "name": "Mevlüt Koçak",
               "profile_path": null,
               "id": 1603644,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570a24d9c3a3680b770038c5",
               "name": "Unurtan Burcu",
               "profile_path": null,
               "id": 1603645,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570a250ec3a3680b770038d5",
               "name": "Recep Biçer",
               "profile_path": null,
               "id": 1603648,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "570a251ec3a3681d3a006f1b",
               "name": "Namik Eken",
               "profile_path": null,
               "id": 1603649,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "54ad0dbbc3a3680c1a000f76",
               "name": "Zeki Demirkubuz",
               "profile_path": "/pMablGX4RR8gAcN2cD1BIG7Z232.jpg",
               "id": 145518,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54ad0dc49251414d6700aa06",
               "name": "Cengiz Onural",
               "profile_path": null,
               "id": 1410161,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "54ad0dce92514116c80010e4",
               "name": "Ali Utku",
               "profile_path": null,
               "id": 1410163,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "570a24eb9251415a28000b13",
               "name": "Eray Kantarci",
               "profile_path": null,
               "id": 1603646,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "570a24fdc3a3681d3a006f0d",
               "name": "Mehmet Subatan",
               "profile_path": null,
               "id": 1603647,
               "department": "Art",
               "job": "Assistant Art Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.897189,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 31413,
      "vote_count": 14,
      "budget": 0,
      "overview": "Yusuf is released from prison after serving a ten year sentence. He is scared of life outside as he goes to an address given to him by another prisoner.",
      "similar": [],
      "original_title": "Masumiyet",
      "runtime": 110,
      "poster_path": "/wSURNatILX7lWMTgejzOgWwXxyF.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Mavi Film",
         "id": 43382,
         "origin_country": ""
      }],
      "release_date": "1997-10-24",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Zeki Demirkubuz"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["Zeki Demirkubuz"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt0128332/",
      "coverLink": null,
      "actors": [
         "Güven Kiraç",
         "Haluk Bilginer",
         "Derya Alabora"
      ],
      "reviews": [
         "Demirkubuz seems like being aware of the place of gates in life. We all open and close many doors throughout our lives. 'Masumiyet' begins with an appearance of the manager's gate and we see Guven Kirac who offers a satisfactory performance. And 'Kader' is closed with a half-open door where Bekir grasps that 'this is his destiny'. It is impossible for Bekir to close the door opened by Ugur on the day at the carpet store. The audience may capture many details based on 'gates'. Now I want to talk about the spectacular preaching of Ugur with which she takes our breath for a while. At the motel room, Ugur warns Yusuf about the destiny waiting for him. But as Bekir does, Yusuf ignores this warning because he is already taken over by love. See this movie, then 'Kader' (or the reverse if you like a chronological telling).",
         "An f word: Demirkubuz is maybe the only director in nowadays Turkey, who bothers himself with the everyday life, or life in general, of the so-called damned. This is one of the most obvious features of his filmography. Lives that are hidden behind the curtains, which go on when 'we', the 'ordinary' people sleep or work, or lives which we read about in the newspapers and blame (much more the case) or appreciate them. Lives that are not familiar with some words like big money, stocks, career, future plans, fame or how it is called in Turkey: pacayi siyirmak (similar to get off the hook). Those characters do not have or make plans for the next few months: they try to live the next day through, and as in Masumiyet, some decide to not to. There are always spontaneously opening doors in life, and it depends on you as the observer, or the reader-watcher of those \"far away lives\" to try to understand or to tell between seeing and looking. Masumiyet is a lecture for this, too. The acting: Haluk Bilginer, one of the most famous and also well playing actors of Turkey really had better performances. Derya Alabora, quite well acting and let me no words to say. And, Guven Kirac. You can observe how a talented actor can act. He is that successful in acting in this movie that his playing builds up a big shadow over the whole scene going on through this film. He and the others mentioned are quite fine and professionally acting, which gives this film a taste of artificiality; something you might understand when you watch Kader (2006). The Story: both at the same time: minimalist and extraordinary. An important critic of TV in our everyday life is mixed in this descriptive narration. The directing: superb. Demirkubuz, might be regarded as a bridge between Dogma \"philosophy\" and Italian neo-realism. But certain scenes exist which interrupt the fluency of the film. When Yusuf (Guven Kirac) and the little girl (also referenced unnecessarily to Chaplin's The Kid in the film) arrive in Ankara and go to the place called KralDisco, there is a song in the background of the kurdish music group \"Koma Amed\". One can think that this music comes from inside of that place, but a sort of music which is totally unrelated to such places. This scene turns a trivia to a goof. Finally: Demirkubuz managed to open an anti-heroic era in Turkish cinema, after the long lag of Yilmaz Guney (ceased in 1984). Lives of the outsiders defined without abstractions is one of his main routes. And, god thanks, he is doing this. This is a movie about people who have nothing else to offer except love and solidarity in the very bottom. About people living in a society where there is a sharp line between interests such as daily stocks figures or supply of daily bread.",
         "You can see and feel life throughout the film with the help of players. All three have their choices for life, which they can fight for. And their choices bring them together in a strange world. Absolutely a wonderful story about pure feelings and life.",
         "Turkish filmmaker Zeki Demirkubuz exploded onto the international scene with this extraordinary sophomore feature which won him a legion of admirers, and detractors, across Turkey as well as top prizes at the Antalya Golden Orange and Adana Golden Boll International Film Festivals and inspired a prequel a decade on. Güven Kiraç puts in a wonderfully nuanced performance as the painfully lost sole at the centre of this narrative with powerful support from Derya Alabora and Haluk Bilginer, who both won Golden Orange awards for their performances, and the young Melis Tuna who gives a pitch perfect debut performance. The contemporary director has a curious fascination with the sort of characters so often sidelined by Turkish filmmakers eager to show their country at its best and this comes through in his use of language, somewhat lost in subtitle translation, and the carefully woven back-story, which inspired a prequel, that drive this compelling film forward. Let's get out of this place.",
         "Probably one of the most depressing and strongest movie ever. But very enchanting scenario and poetic expression. That's where unrequited love would drift the man's life to rueful & how a man could have turned to be totally loser. Even for Haluk Bilginer's tirade-like dialog only , while sitting on the grass field at 42 min., it'd worth to watch. Theatrical acts, deeply heart-touching theme. Don't miss it. 9 of 10. After 6 years of this movie, director Zeki Demirkubuz, deeply impressed by Dostoyevski and Albert Camus' works, has directed a movie named Kader 'Fate' on 2006 which expresses the beginning of the story..I suggest you to watch both movie in a row..",
         "Set in the seedier areas of İzmir, Ankara, and İstanbul, MASUMİYET focuses on Yusuf (Güven Kıraç) who is released from prison after ten years but fears the outside world. Having been given the name of a suitable contact, he travels to İzmir to stay in a seedy hotel and encounters musician Bekir (Haluk Bilginer), Uğur (Derya Alabora), and her deaf-mute daughter Çilem (Melis Tuna). Yusuf becomes friendly with the family but by doing so becomes involved in a peripatetic existence fraught with danger that leads to death and disillusion. Several of the themes characteristic of director Zeki Demirkubuz's work resurface here. There are several shots of darkened rooms, that are instantly filled with shafts of light at the center of the frame as doors are opened, and return to darkness once more as the doors are closed. Such shots metaphorically summarize the protagonists' lives as consisting of unremitting darkness penetrated by shafts of light. Yet they are only occasional; for the most part the characters are prisoners of their existences, as shown by the repeated use of metal or iron bars through which we view the characters, or which form a backdrop to individual scenes. This hopelessness is contrasted with the idealized lives portrayed on the almost continuous Yeşilçam films from the Sixties and Seventies that are broadcast on the televisions in Yusuf's hotel and other public places. These broadcasts have an almost magical-like power to attract the guests' interest, to such an extent that the hotel owner (Doğan Turan) keeps encouraging Yusuf to set his troubles aside and watch television, a cup of tea in his hand. The televisual world is an uncomplicated one of good triumphing at evil's expense; where justice is meted out and the path of true love is clearly defined. Such moral absolutes prove a welcome respite from the stresses of daily life. Yet Demirkubuz shows how fiction and \"reality\" can become confused, as Uğur's face appears on television as part of a news broadcast. Unable to separate the two, Çilem watches the screen with the same fascination as with the Yeşilçam melodramas. We understand, however, that television has the power to distort people's view of the world, even while providing some form of narcotic for viewers. The characters live rootless lives, as symbolized by the repeated point of view shots showing public buses traveling along deserted roads, full of passengers, and only stopping occasionally for half- hour food breaks. Yusuf would like to achieve stability, but finds himself unable to do so; his sister will not even speak to him, while his brother-in-law (Ajlan Aktuü) has been rendered half-crazed by a sterile marriage. Hence Yusuf has to move on with Cilem in tow, first to Ankara and then to İstanbul. Yet life isn't much better in either city. Yusuf has been given a name, but finds that the person concerned is not there, as he visits Ankara. He goes to a seedy disco (ironically called \"The King's Disco\"): grand it certainly ain't. Traveling on to İstanbul, he moves through Beyoğlu's netherworld of cramped streets and darkened, deserted houses, whose windows are almost invariably lined with iron bars. There is no sense of resolution in MESUMİYET; as the epigraph (from Beckett's suggests), the characters always lose, however much they try. The only thing they can hope for is to become better losers.",
         "Demirkubuz sets out to explore the marginalized, the downtrodden and the hapless as he ends up provoking the audience to explore their own realities, to see if their grounding in existence holds up to such a merciless scrutiny. Devoid of all roots and conformities, his characters are free to roam the earth in search of peace and happiness in any way they can and perhaps in the only way they know how, in many instances in spite of themselves. That's a misfortune (or a fortune) depending on which side of the coin you prefer to look at. One thing is certain though, this coin looks shiny side up and once you pick it up off the dirty street, it will be too late to ignore the muddy flip side.",
         "Zeki Demirkubuz's sophomore feature, Innocence represents a marked stylistic departure from the fragmentation and narrative asymmetry of Block-C and converges towards what would prove to be more quintessential recurring elements within his body of work: long takes, painstaking observation of temps mart, stationary camera framing, the inclusion of a hyper-extended dialogue \"ellipses\" (or in the case of The Third Page, a monologue) that approaches abstraction, the running television as a surrogate for self-imposed isolation, and a temporal ambiguity that projects an epic scope to intrinsically intimate, chamber dramas. Opening to the shot of a recently paroled prisoner, Yusuf (Güven Kiraç), pleading his case before the warden to remain in jail despite having served out his sentence for murder and attempted murder, arguing that he has lost touch with his sole remaining family (the married sister whom he attempted to kill along with her lover, apparently on behalf of his abusive, but weak willed brother-in-law) and does not have the appropriate support system to survive in the outside world without resorting to crime once again, as the official's door repeatedly springs open for no apparent reason, the seeming randomness of the broken door (a recurring image in his films) becomes a metaphor for the ambiguity of his future. A strange and fateful encounter with a couple forcibly removed from the bus reinforces this sense of destiny. Arriving at a rundown boarding house in a rural town to rest for the evening, he comes to the aid of a little girl stricken with fever after her parents fail to turn up for the evening to claim her. Returning the next morning to the boarding house after their mysterious disappearance, the parents turn out to be the detained couple from the bus, a genial, but mercurial drifter named Bekir (Haluk Bilginer) and the elusive object of his affection, a wanton lounge singer, Ugur (Derya Alabora) (perhaps a wink to Josef Von Sternberg's The Blue Angel), who has been travelling across the country for twenty years (with Bekir ingratiating himself into her company) to be near her imprisoned first, \"true\" love. With little hope for reconciliation with his embittered and suffering sister, Yusuf returns for an indefinite stay at the boarding house and embarks on a friendship with the volatile couple. However, as Bekir and Ugur's relationship continues to be strained by the cumulative toll of their corrosive dysfunction, Yusuf, too, becomes drawn into their seductive, dark world of mutual self-destruction. Evoking the emotional intensity of an Ingmar Bergman chamber film and infused with the idiosyncratic combination of understated humour and soap operatic melodrama (not unlike the television programs that the lodgers watch each evening at the lounge), Innocence is an elegant, remarkably complex, and painstakingly rendered study of destructive obsessions and codependency. But beyond the psychological addiction that defines Bekir and Ugur's interminable journey to nowhere, Demirkubuz's framing of their relationship through the perspective of innocents, initially, through Ugur's deaf mute child, then subsequently, through the well-intentioned (and all too accommodating) Yusuf, Demirkubuz presents an intriguing portrait, not only of a pliable personality, but also the hypocrisy inherent in abusive relationships, where cruelty is rationalised by a sense of helpless, self-entitled victimisation.",
         "Innocence is a different Turkish film as it does not rely much on a visual style which is found in other Turkish films which have made their mark on international film festival scene. In this film, director Zeki Demirkubuz has filmed the tragic lives of ordinary people who don't have much left in their midst to improve their situation. In cinema, it is often shown that a character X leaves a place Y in order to go to Z. It is Yusuf, a main protagonist who experiences something similar as he is not able to finish his journey. However, he does not feel disappointed as he gets to learn that he has been useful to some people in his life. Innocence starts with a very unusual request made by an innocent man who has been released from prison. It is from that moment that the film creates its impact by depicting how Yusuf's life would change when he is going to come across vulnerable characters from small Turkish towns where life seems to have stopped for good. Lastly, viewers get to learn that Zeki Demirkubuz takes his cinema seriously as his film is a nice tribute to richness of Turkish cinema which is welcomed by this film's different characters when they sit quietly to watch classics of Turkish cinema on television.",
         "After watching a film you completely dislike you usually wonder: was this the worst film I have watched?, normally the answer is not, there was this... and that other one... which were still worse. Well, this time it has not been like that, because I can assert, with absolute conviction, that Masumiyet is, by far, the worst film I have ever watched in my whole life, and if you have a look at my ratings list you will see there are above a thousand by now... I just cannot describe how terrible this film is, it can be easily summarized just by saying that there is not a single scene in the whole film which is not completely foolish and nonsensical. Everything from the absurd script to the horrific performances of each of the actors makes of this film something unique in the story of cinema... that once finished you have no idea if you have just watched a tragical melodrama or an attempt of comedy, I honestly am still wondering..."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Mavi Film"],
      "summaries": ["Yusuf is released from prison after serving a ten-year sentence. He is scared of life outside as he goes to an address given to him by another prisoner."],
      "budget": 0
   },
   "movielensId": 130992,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "1997-10-24",
      "dvdReleaseDate": null,
      "directors": ["Zeki Demirkubuz"],
      "runtime": 110,
      "movieId": 130992,
      "title": "Innocence",
      "mpaa": "",
      "actors": [
         "Güven Kıraç",
         "Haluk Bilginer",
         "Derya Alabora",
         "Yalcin Cakmak",
         "Iskender Altin",
         "Melis Tuna",
         "Nihal G. Koldas"
      ],
      "imdbMovieId": "0128332",
      "originalTitle": "Masumiyet",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["opkxU0dXMww"],
      "plotSummary": "Yusuf is released from prison after serving a ten year sentence. He is scared of life outside as he goes to an address given to him by another prisoner.",
      "tmdbMovieId": 31413,
      "avgRating": 3.725,
      "releaseYear": "1997",
      "numRatings": 20,
      "posterPath": "/wSURNatILX7lWMTgejzOgWwXxyF.jpg"
   }
}