{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3479316",
      "video": false,
      "title": "Parallels",
      "recommendations": [
         273271,
         118612,
         291866,
         301728,
         174678,
         222461,
         381935,
         178603,
         277688,
         132064,
         258086,
         187010,
         176570,
         137217,
         121606,
         224815,
         276488,
         294308,
         146229,
         300467
      ],
      "backdrop_path": "/dauVGkvcPIGVRBtC9O84tWtHTZ4.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Dan_Tebasco",
         "id": "58f683e19251415df0002ae3",
         "content": "Could tell 15 minutes in or so that this was gonna be a botched tv pilot, and sure enough it leaves you with a cliffhanger at the end of the 'film'.\r\n\r\nThat said I'm sure if it was developed to a tv series that it would have it's share of fans... I would however probably not be one of them. Unless it got far more interesting in the following episodes.\r\n\r\nBut yeah as a movie, it doesn't have alot to offer.",
         "url": "https://www.themoviedb.org/review/58f683e19251415df0002ae3"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ronan Carver",
               "gender": 2,
               "credit_id": "54f61b32c3a3683a730008d2",
               "name": "Mark Hapka",
               "profile_path": "/vYtceyK4VtmJfohvYfNbLWJLTT4.jpg",
               "id": 207509,
               "order": 0
            },
            {
               "cast_id": 0,
               "character": "Beatrix Carver",
               "gender": 1,
               "credit_id": "54f61b0a925141501900040e",
               "name": "Jessica Rothe",
               "profile_path": "/8sV1fAj98dwuYZbqvs059QOR18R.jpg",
               "id": 1427680,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Harold",
               "gender": 2,
               "credit_id": "54f61b4d925141240b000857",
               "name": "Eric Jungmann",
               "profile_path": "/jQRzMelNrWbtXuYmuLrQZSuMLD8.jpg",
               "id": 37005,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Polly",
               "gender": 1,
               "credit_id": "59055e5fc3a3684ad7015907",
               "name": "Constance Wu",
               "profile_path": "/1ODwPGq6EpAJXfUG38jDBOAOL7a.jpg",
               "id": 206444,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Alex Carver",
               "gender": 2,
               "credit_id": "59055e6bc3a3684a680156b0",
               "name": "Yorgo Constantine",
               "profile_path": "/5ZVK1VUnbijgZPAO14yIpiihtpX.jpg",
               "id": 21051,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Chief Stone",
               "gender": 0,
               "credit_id": "59055e799251416a14015c0a",
               "name": "Davi Jay",
               "profile_path": "/2kdp8yFfVPLi56PYqDm9xAQcM3S.jpg",
               "id": 232702,
               "order": 5
            },
            {
               "cast_id": 1,
               "character": "Tinkler",
               "gender": 0,
               "credit_id": "54f61b1dc3a3683a730008cd",
               "name": "Michael Monks",
               "profile_path": "/vsr0F5putQdlh0h8z7OvdAn1iKa.jpg",
               "id": 53249,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Mike",
               "gender": 0,
               "credit_id": "59055e8292514169d80155e9",
               "name": "Ian Casselberry",
               "profile_path": "/J9CYhZq7IZXRxLKCGjJZVNeDav.jpg",
               "id": 1299674,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Dispatch",
               "gender": 0,
               "credit_id": "598648709251413d18007596",
               "name": "B.J. Grogan",
               "profile_path": "/xsmujDugTXcrETEaHydwB7BLuEP.jpg",
               "id": 1718146,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Paramedic Sal",
               "gender": 0,
               "credit_id": "5986539fc3a368326600800c",
               "name": "Han Soto",
               "profile_path": "/yNeZnnkO7aux7uKRM7AoOxX3mbG.jpg",
               "id": 1116011,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Promoter",
               "gender": 2,
               "credit_id": "598653e0c3a3683266008073",
               "name": "Marco St. John",
               "profile_path": "/12DFOaqp5e2deR8yQyrzsXIwE41.jpg",
               "id": 94182,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Local Savage",
               "gender": 0,
               "credit_id": "59865406c3a36832760075da",
               "name": "Luke Hawx",
               "profile_path": "/hxCm0WeU1NfEbfLxh2oy4s9nf0W.jpg",
               "id": 1814863,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Middle-Aged Man",
               "gender": 0,
               "credit_id": "5986541a9251413d18008431",
               "name": "Kim Collins",
               "profile_path": "/jDLFUKnTXv2pPo3Mv3JRnOXATv.jpg",
               "id": 1044195,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Food Stand Waitress",
               "gender": 1,
               "credit_id": "598654309251413d2b00804e",
               "name": "Lindsey G. Smith",
               "profile_path": "/keL4ago7ud1REGXeiLkG1J0Y9jY.jpg",
               "id": 1566766,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55097b3fc3a3682b4e0036c7",
               "name": "Christopher Leone",
               "profile_path": null,
               "id": 1234970,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55097b4b92514110cc00362f",
               "name": "Christopher Leone",
               "profile_path": null,
               "id": 1234970,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55097b6cc3a3682b4300337f",
               "name": "Laura Harkcom",
               "profile_path": null,
               "id": 1029055,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55097b8ac3a3682b40003467",
               "name": "Laura Harkcom",
               "profile_path": null,
               "id": 1029055,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55097b9d9251413c71001b8c",
               "name": "Christopher Leone",
               "profile_path": null,
               "id": 1234970,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55097bbac3a3682b4c003859",
               "name": "Bryce Fortner",
               "profile_path": null,
               "id": 1419623,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "56c8ffe1c3a368408e004156",
               "name": "Thomas Verrette",
               "profile_path": null,
               "id": 1121480,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 5.964902,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 328595,
      "vote_count": 170,
      "budget": 0,
      "overview": "An underground MMA fighter must confront his sister and his past in an adventure through parallel universes",
      "similar": [],
      "original_title": "Parallels",
      "runtime": 83,
      "poster_path": "/j7a8OZ408LlP8vnpLEBHYNBNOAA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fox Digital Studios",
         "id": 25250,
         "origin_country": "US"
      }],
      "release_date": "2015-03-01",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "What is the building?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christopher Leone"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Laura Harkcom",
         "Christopher Leone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3479316/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4ODM3MjUxMl5BMl5BanBnXkFtZTgwNTY5NTIxNTE@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Mark Hapka, Jessica Rothe, Eric Jungmann | See full cast and crew »"],
      "reviews": [
         "Found this on Netflix highly recommended based on my previous ratings of movies. Watched it. REALLY enjoyed it. Kind of like Sliders meets Lost. But here's the thing--what a total waste. Meant to be a pilot for an entire series, the \"movie\" so prematurely ended that not even a single mystery was explained. I'm guessing that FOX, once again, gave the axe to a promising series, but enough was filmed that someone just said, \"screw it, make it a movie.\" The pilot is really really good. As a movie, it really really sucked. You can't just write a screenplay for a pilot and call it a movie, it doesn't work like that. It's too bad, because this is a series that I would really love to watch.",
         "I saw this on Netflix. Marked as a movie. We watched this with enthusiasm. We really enjoy seeing alternate realities and how people overcome their obstetrical. But this \"episode\" left the viewers wanting. The end is a total cliff hanger. WITH NO QUESTIONS ANSWERED. The ending even posed more questions than not. For a show/movie with no adverts claiming future productions, this movie left me almost feeling angry that there was no conclusion. I had to watch something else after just to get over my frustration. Some shows pull off cliff hangers perfectly, this show failed. If they find funding and fans enough to continue, we'd love to watch it. But, without awful cliffhangers. Great plot and acting otherwise.",
         "I just finished this on Netflix and I must say it was very entertaining and creative. Obviously the ending is a massive cliffhanger and after reading other reviews and googling it's clear this was meant to be a series. Well it would be great if this were picked up as an ongoing series but there is another way to complete this if that isn't an option for the creators. It's simple. Two more feature length films that complete the story arc this began. That gives them room to flesh out the concept, story, characters, and give us some more sweet universe hopping. I specifically want to know what the triplets are all about. I'd recommend this, buy, and stream the next films/season. I assume many others will as well. Whoever may read this that has the ability to get the ball rolling I encourage you to do so.",
         "It's not perfect but it deserves my ten stars because I really want it to continue. In contrary to many other TV-series (I suppose this is a pilot of a series?) I think that \"Parallels\" must have been made by people that really like what they do. The main characters feels almost as Real People, not just actors doing their work. Of course this is not the Oscar league, please understand that I'm comparing to similar productions. The plot is far from novel: We have the involuntary protagonists, a phenomenon with a vessel that uses the phenomenon, a couple of persons with unknown objectives, and an abundance of different world settings. But the ingredients are well cooked into a delicious taste. This is a \"what if\" story with a thriller, not a \"it's like this\" with BangBoom in the lead. No mind-boggling stuff... Well, it would be if it happened to me, but as a watcher I'm carefully taken through the loops and I can forgive the few plot holes I noticed. The feeling I get is that this is made with intelligence, it has been given more than a half thought! And it has humor! Not much but just enough. When I left \"Fringe\" I felt sad for a long time. Now I'm happy again, I hope this new affair will continue!",
         "I really liked this concept, and the cast is solid. I think the writing is a bit forced from time to time, but that's to be expected with the material, cast, etc...overall, I enjoyed the show. I do believe, however, that this script was clearly written to be episodic. This 'movie' feels more like an extended pilot. Obviously this entire concept is open-ended to be episodic. It's set up perfectly for it. I was very let down to find it wasn't a pilot--I actually thought I was watching a pilot all the way up until my Google searching after the 'show.' Sad. I hope they continue this idea...if they don't I think the movie should have been written differently. I think if done correctly this could continue to be a fun show with endless possibilities...or it could be totally ruined by bad writing. I hope they pick this up and run with it, and keep it somewhat hard sci-fi.",
         "I'm a sci-fi junkie! Heroes, Sliders, The 4400, The Tomorrow People, Fringe, The X Files , Agents of Shield, Alphas, Eureka, The Flash, The 100, and more shows like these are what I love. My wife and I watched \"Parallels\" last night, and we loved it. As soon as the building took them to another Earth, we were living inside the show. The acting is good, characters are o.k., although I'd like to see a black male as a lead role ( if the director ever reads the please contact me, I'd be the perfect addition, lol, no.... but... I'm serious), and the different earths are done WELL. I'm very picky with the authenticity of any alternate world or time travel show, however I was thoroughly pleased with the 3 earths in the show. Now, when it ended, I felt like it was cut short. I said to my self this is not a movie, this has got to be a series. Unfortunately , I haven't found any evidence to prove this is a series. I hope CW, Netflix, or some network picks up this show. I NEED TO SEE THE NEXT EPISODE, please, I NEED TO SEE OTHER EARTHS. I'm hoping the other episodes aren't in an alternate universe some where...then where all screwed and disappointed.",
         "I have to give this a 5 because it is unfinished. Apparently it was suppose to be a TV show but didn't get picked up so they made a stand alone movie.. Well, I guess the pilot episode was turned into a movie and of course it has no closure, it just ends. No questions were answered that it poses which is a shame because it was a pretty decent flick accept for a few performance issues and some pretty cheesy dialogue. Other than that, the premise was good, inventive and much darker than Sliders. ohh well. I wondering if anyone will pick up the rest of it and I am just writing more cause it says I have to have 10 lines of review and I don't have that much cause it just ends.",
         "It's pretty much Sliders. Timed jumps to other worlds, no (known) way home. Only it's been TheCW-ed up. In Sliders you had a goofy looking gangly giant, Gimli (middle-later aged bearded professor), a middle-later aged black dude and a petite woman (some replaced later). In Parallels you have four attractive twenty-somethings. In Sliders there's techno-babble and problem solving. In Parallels you just run from stuff and have dramatic moments, usually involving your family. Sliders uses a fixed camera and dolly and whatnot. Parallels uses good ole Shaky- Cam where the camera operator has to deliberately do a bad job, even on tight shots during an exposition scene because that's just the style now. That said, it's fine. The CW model is simple and it works well enough. And I'm a sucker for a sci-fi premise. The dialogue and situations are cheesy but not cringe inducingly so. Ronan's triangle wasn't good enough to actually put someone to sleep but hey, you could tell what they were going for. It's fine. It's totally fine.",
         "OK, so three young people find a building that every 36 hrs teleports them to another, parallel universe. One of my biggest problems with the film, is that in all the other versions of Earth, everything is almost the same. I think the filmmakers should consider the huge possibility for no humans to ever have been developed on another earth, or that Earth might be gone due to a meteor crash, etc. Instead, everything is almost equal. Not likely at all. Also, the acting is very bad, and the script is very bad. Embarrassing to watch. Also, the film ends as a series episode would, like they didn't have enough money to complete the film? All in all, a very poor production, and I don't understand how IMDb users can give this 7,4 in average. Stay clear, don't waste your time on this.",
         "I was hoping this would become a series because there is so many possibilities.. infinite in fact, when you go with a storyline of parallel worlds. The acting was very good. the characters were very likable and cmon you get to see constance wu from \"fresh off the boat\" with no accent whatsoever. :) Ill be brief as I don't want to spoil anything but its well worth a watch.. and FOX .. please shop this to the syfy channel or something. though we may be waiting a bit now while fresh off the boat has its run..."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": ["Fox Digital Studios"],
      "summaries": [
         "PARALLELS is a science-fiction adventure series that follows the story of a small band of people traveling across parallel earths. The group is led by an estranged brother and sister, Ronan and Beatrix Carver, who are looking for their father. What they discover is that their family is shattered across multiple earths. The question is: can they put their family back together again?",
         "Ronan, Beatrix and Harold go to find Alex Carver (Ronan and Beatrix's dad) at a strange abandoned building in the middle of the city. They enter the empty building and all the lights start to flash. As they leave the building they discover that they are no longer in the same city as they knew. They meet a new girl called Polly who seems to know what is going on who tells them that they need to be back in the building within 36 hours or it will leave without them.",
         "A mysterious building is the gateway to infinite parallel Earths."
      ],
      "budget": 0
   },
   "movielensId": 131170,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-03-01",
      "dvdReleaseDate": null,
      "directors": ["Christopher Leone"],
      "runtime": 83,
      "movieId": 131170,
      "title": "Parallels",
      "mpaa": "NR",
      "actors": [
         "Mark Hapka",
         "Jessica Rothe",
         "Eric Jungmann",
         "Constance Wu",
         "Yorgo Constantine",
         "Davi Jay",
         "Michael Monks",
         "Ian Casselberry",
         "B.J. Grogan",
         "Han Soto",
         "Marco St. John",
         "Luke Hawx",
         "Kim Collins",
         "Lindsey G. Smith"
      ],
      "imdbMovieId": "3479316",
      "originalTitle": "Parallels",
      "genres": [
         "Science Fiction",
         "Action"
      ],
      "youtubeTrailerIds": ["uyknfocH8t4"],
      "plotSummary": "An underground MMA fighter must confront his sister and his past in an adventure through parallel universes",
      "tmdbMovieId": 328595,
      "avgRating": 3.11983,
      "releaseYear": "2015",
      "numRatings": 121,
      "posterPath": "/j7a8OZ408LlP8vnpLEBHYNBNOAA.jpg"
   }
}