{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "attack",
            "id": 10563
         },
         {
            "name": "wagon train",
            "id": 160522
         },
         {
            "name": "indian attack",
            "id": 162722
         }
      ],
      "imdb_id": "tt0046722",
      "video": false,
      "title": "Arrow In The Dust",
      "recommendations": [],
      "backdrop_path": "/zZqveS5DfPxI9z4mMligpejsd0l.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5719b028925141115f000fe0",
         "content": "The Laramie Redemption.\r\n\r\nArrow in the Dust is directed by Lesley Selander and adapted to screenplay by Don Martin from the L. L. Foreman novel. It stars Sterling Hayden, Coleen Gray, Keith Larson, Tom Tully and Tudour Owen. Music is by Marlin Skiles and Technicolor cinematography by Ells W. Carter.\r\n\r\nBart Laish (Hayden) is an army deserter, a gambler and a killer, but soon he is going to get a shot at redemption...\r\n\r\nIt's all very formulaic in plotting, yet there's some thought gone into the screenplay, whilst Selander wastes no chances to keep things brisk by inserting another finely constructed action sequence. Laish (a typically robust Hayden) finds himself in command of a wagon train, with soldiers and civilians, all now looking to him to stave off the wave after wave of Indian attacks, which interestingly sees the Pawnee and the Apache teaming up.\r\n\r\nNaturally there's trouble in the camp, not only via some suspicious business men whose motives will reveal a key narrative thrust, but also by way of Gray's Christella Burke. She wanders in from some Estée Lauder advertisement (we don't care, we love 50s Westerns!), and pulses quicken for protagonist and viewers alike. Thematically the narrative is honourable, with decent amounts of angst and tortured heroics. There's some nifty war tactics, plenty of splendid gun play, and of course there's a human redemptive beat pulsing away - just begging to be found?\r\n\r\nThere's the usual \"B\" Western issues, such as weakly choreographed fighting between man versus man, dummies being flung over cliffs, and some average acting in support slots (not Lee Van Cleef, though, who is pottering around with menace). However, the Burro Flats location filming is beautifully photographed - in sync with Skiles' genre compliant score, while Hayden does enjoyable stern backed machismo, which plays off of Gray's sensuality perfectly, and Tully does grizzle to actually provide the film's best performance. \r\n\r\nOne for fans of this era of Western genre film making. Not a waste of time. Good show. 6.5/10",
         "url": "https://www.themoviedb.org/review/5719b028925141115f000fe0"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bart Laish",
               "gender": 2,
               "credit_id": "52fe4c4bc3a368484e1b11f5",
               "name": "Sterling Hayden",
               "profile_path": "/zFntWs4OdfXszzEauHrMURQJkRD.jpg",
               "id": 3088,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Christella Burke",
               "gender": 0,
               "credit_id": "52fe4c4bc3a368484e1b11f9",
               "name": "Coleen Gray",
               "profile_path": "/oQhVm1YUKaAAAT9TcBJ8RtrUuZS.jpg",
               "id": 3336,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lt. Steve King",
               "gender": 2,
               "credit_id": "52fe4c4bc3a368484e1b11fd",
               "name": "Keith Larsen",
               "profile_path": "/roXXjk8fBhAF2dDTA5LgXwDlde8.jpg",
               "id": 176860,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Crowshaw",
               "gender": 2,
               "credit_id": "52fe4c4bc3a368484e1b1201",
               "name": "Tom Tully",
               "profile_path": "/reBpi3E34yudxU7mxtiZBolJovi.jpg",
               "id": 19414,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Pvt. Carqueville",
               "gender": 0,
               "credit_id": "52fe4c4bc3a368484e1b1205",
               "name": "Jimmy Wakely",
               "profile_path": "/ad93fuqLxSDeGiT478BJIIy4BiB.jpg",
               "id": 1108912,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tillotson Henchman",
               "gender": 2,
               "credit_id": "52fe4c4bc3a368484e1b121b",
               "name": "Lee Van Cleef",
               "profile_path": "/oEEsdGCBjpyJyVZlx1X8PKvHe7S.jpg",
               "id": 4078,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Tillotson",
               "gender": 2,
               "credit_id": "555b537092514163b500033c",
               "name": "Tudor Owen",
               "profile_path": "/wl75h6SDHDJ9kYjzDK3NCXKtduM.jpg",
               "id": 106101,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Sgt. Lybarger",
               "gender": 2,
               "credit_id": "555b60889251412576002e1a",
               "name": "John Pickard",
               "profile_path": "/rUhld5l6uxr0nJEXCGFs6tQIeru.jpg",
               "id": 115550,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Maj. Andy Pepperis",
               "gender": 2,
               "credit_id": "592cda649251417c5900629b",
               "name": "Carleton Young",
               "profile_path": "/lqKVSnYegb7WprJk2bcSuzSqGas.jpg",
               "id": 2098,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c4bc3a368484e1b120b",
               "name": "Lesley Selander",
               "profile_path": "/iQMfk2Ujf2AW24XeIFVgLxGicKW.jpg",
               "id": 130325,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c4bc3a368484e1b1211",
               "name": "Don Martin",
               "profile_path": null,
               "id": 104405,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c4bc3a368484e1b1217",
               "name": "L.L. Foreman",
               "profile_path": null,
               "id": 1108913,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 0.980895,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 138486,
      "vote_count": 3,
      "budget": 0,
      "overview": "Director Lesley Selander's 1954 western stars Sterling Hayden, Coleen Gray, Keith Larsen, Tom Tully, Lee Van Cleef and Jimmy Wakely.",
      "similar": [
         121,
         13909,
         12444,
         14869,
         10196,
         375315,
         10212,
         10090,
         205321,
         995,
         6072,
         961,
         75638,
         15705,
         6217,
         27429,
         19185,
         10496,
         10911,
         242166
      ],
      "original_title": "Arrow In The Dust",
      "runtime": 79,
      "poster_path": "/2FGsPIVisiNRf8PWQyZzQnU9ABl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Allied Artists Pictures",
         "id": 4928,
         "origin_country": ""
      }],
      "release_date": "1954-04-25",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Ablaze with the gun-thundering terrors of the West's most violent days!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lesley Selander"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "L.L. Foreman",
         "Don Martin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0046722/",
      "coverLink": null,
      "actors": [
         "Sterling Hayden",
         "Coleen Gray",
         "Keith Larsen"
      ],
      "reviews": [
         "The use of stock footage and uninspired acting and direction make this a very slow, routine western effort. Despite the cast (Hayden, Larson) this one is just too predictable to suffer through. And yet, in spite of it's failings, it often appears on TV while better efforts rot in a can somewhere. Go figure.",
         "Sterling Hayden stars in this fast moving western about an army deserter who takes the place of his dying cousin and leads a wagon train out of danger from Indian attack. We never get the back story here, why Hayden deserted, we're told he's not a person of good character, but what we see of him he's pretty noble. Certainly he provides the leadership that does the job even if civilian scout Tom Tully knows who the real army major is and it's definitely not Hayden. But there's more than one person on the wagon train who is not whom he seems to be. Rich merchant Tudor Owen is carrying both rifles and whiskey and the Indians want them real bad, they don't even want to wait to pay for them. Seems to me they should have just waited and paid Owen's price. That however would have gotten in the way of the action and veteran western director Lesley Selander was known for action. The battle scenes are well staged. It's a good B western could have been better with a little more attention to the story.",
         "I enjoy Sterling Hayden and his gritty and realistic acting style. So, I thought I'd give this one a try even though both reviews for this on IMDb are really poor. I hoped they're wrong and it was worth my time. Hayden plays a guy named Bart Laish. When the film begins, you learn that Bart is a deserter from the Cavalry and is hiding out west. However, as fate would have it, he comes upon a group of dying soldiers that were attacked by Indians. The dying leader just happens to be Bart's cousin and begs Bart to take his place and assume command of the rest of his outfit--which is a few miles away from this massacre! And, the deserter DOES!!! Later, after proving himself against wave after wave of faceless and stupid natives (who seem to just ride by hoping to get shot), all is forgiven with the US Cavalry and Bart is once again allowed to legally wear the uniform. Talk about impossible and ridiculous! In addition to a ridiculous plot and faceless Indians, it's also one of Hayden's relatively flat performances. I guess the other two were right after all.... By the way, in one scene it's supposed to be at night but it appears to be daylight! Huh?!",
         "Arrow in the Dust is directed by Lesley Selander and adapted to screenplay by Don Martin from the L. L. Foreman novel. It stars Sterling Hayden, Coleen Gray, Keith Larson, Tom Tully and Tudour Owen. Music is by Marlin Skiles and Technicolor cinematography by Ells W. Carter. Bart Laish (Hayden) is an army deserter, a gambler and a killer, but soon he is going to get a shot at redemption... It's all very formulaic in plotting, yet there's some thought gone into the screenplay, whilst Selander wastes no chances to keep things brisk by inserting another finely constructed action sequence. Laish (a typically robust Hayden) finds himself in command of a wagon train, with soldiers and civilians, all now looking to him to stave off the wave after wave of Indian attacks, which interestingly sees the Pawnee and the Apache teaming up. Naturally there's trouble in the camp, not only via some suspicious business men whose motives will reveal a key narrative thrust, but also by way of Gray's Christella Burke. She wanders in from some Estée Lauder advertisement (we don't care, we love 50s Westerns!), and pulses quicken for protagonist and viewers alike. Thematically the narrative is honourable, with decent amounts of angst and tortured heroics. There's some nifty war tactics, plenty of splendid gun play, and of course there's a human redemptive beat pulsing away - just begging to be found? There's the usual \"B\" Western issues, such as weakly choreographed fighting between man versus man, dummies being flung over cliffs, and some average acting in support slots (not Lee Van Cleef, though, who is pottering around with menace). However, the Burro Flats location filming is beautifully photographed - in sync with Skiles' genre compliant score, while Hayden does enjoyable stern backed machismo, which plays off of Gray's sensuality perfectly, and Tully does grizzle to actually provide the film's best performance. One for fans of this era of Western genre film making. Not a waste of time. Good show. 6.5/10",
         "\"Hopalong Cassidy\" director Lesley Selander's Cavalry-versus-the-Indians survival saga \"Arrow in the Dust\" ranks as one of the prolific western helmer's better efforts, and it reunites him with his \"Flat-Top\" star Sterling Hayden. This above-average, 80-minute Allied Artists outing delivers as much violence as it does budget. Tall, grim, and gruff Sterling Hayden plays an army deserter who redeems himself after a wagon train is attacked by hordes of savage Indians. Eventually, we learn why the Native Americans are so hell-bent to destroy the wagon train. Our hero learns about the settler's dire trouble when he discovers a dying comrade on the trail and decides to masquerade as an officer. It seems that Bart Laish (Sterling Hayden) quit West Point and became a gambler, but now he returns to the fold when his cousin Maj. Andy Pepperis (Carlton Young of \"Reefer Madness\") persuades him to help the settlers. The cast and the production values stand out, while the redskins are obviously white stuntmen in colorful costumes with blankets draped over their saddles. Nevertheless, there seems to be an endless procession of these villainous Indians. Of course, \"Arrow in the Dust\" cannot compare with anything that the legendary John Ford did, but it is still worth the time to watch it. Lee Van Cleef has a small supporting role before an Indian clobbers him with a tomahawk. Tom Tully and Keith Larson round out a good cast.",
         "Well, after reading the other reviews I have to concur that this movie is pretty darn horrible and boring. TCM is having a Sterling Hayden festival and unfortunately this movie was thrown in for good measure. Where did they get these Indians? Regarding another reviewers 'Review' of the 'School of Bottom Lip Acting' from Hayden, I started to find myself transfixed and staring at Hayden's bottom lip jutting out during the very slow arduous task of viewing the movie. At one point a young cavalry soldier asks Hayden 'should we stay and fight or retreat'. I expected Hayden to reply, 'Not sure, let me consult with my bottom lip'. Early in the film a dying cousin Andy comments to deserter Hayden, 'Surely there is still some good in you?' I expected Hayden to say, 'Nope, this ol' six-gun and bottom lip do the talking' for me..' o.k. well, actually it's the bottom lip that does the talking and the six-gun does the shooting but whatever'... Another annoying thing in his performance is Hayden seems to be faking a deep gruffy voice that makes him sound like Ted Baxter (Ted Knight) on the Mary Tyler Moore show. Lou!? Are any of you Indians named 'Lou'? Just avoid this film at all costs is all I can suggest.",
         "A Fine Actor, Sterling Hayden, seems to be Broken by the Blacklist, and is at His Worst in this almost Incompetent Western. The other Cast Members are not that good either. The Indians, with Blankets not Covering Up the Fact that They didn't use Saddles, are only On Screen for the Killing, and are Never Shown in Close-Up, making Them Disposable and Less than Human. \"You know what Indians do to Women and Children.\", is a Line in the Awful Screenplay. The Battles are Frantic and Bullet Ridden with a few Arrows Flying and couple Landing in the Dust to Justify the Title. Overall, a rushed and Routine, Low-Budget 50's Western (as if We needed more of those in the Decade). This will be an Embarrassment to Sterling Hayden Fans and despite the occasional good shot of Colorful Scenery, it is easily Forgettable."
      ],
      "genres": [
         "Romance",
         "Western"
      ],
      "productionCompanies": ["Allied Artists Pictures"],
      "summaries": [
         "Army deserter Bart Laish decides that the best way for him to get away is to join a wagon train headed for Oregon. They're about a week ahead of him and on the trail Bart comes across an old friend, Major Andy Pepperis who is dying from wounds received in an Indian attack. He warns Bart that the Indians will next attack the wagon train and afterward finds the army station, Camp Taylor, destroyed. He assumes Pepperis' identity and catches up to the wagon train taking command of the soldiers escorting it. He proves to be a capable leader and quickly gains everyone's respect. As they get closer to their destination, Bart is closer to being caught and has to decide if and when he will leave them.",
         "A calvary deserter risks his life to warn and protect a wagon train from an impending Indian attack."
      ],
      "budget": 0
   },
   "movielensId": 131196,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1954-04-25",
      "dvdReleaseDate": null,
      "directors": ["Lesley Selander"],
      "runtime": 79,
      "movieId": 131196,
      "title": "Arrow In The Dust",
      "mpaa": "",
      "actors": [
         "Sterling Hayden",
         "Coleen Gray",
         "Keith Larsen",
         "Tom Tully",
         "Jimmy Wakely",
         "Lee Van Cleef",
         "Tudor Owen",
         "John Pickard",
         "Carleton Young"
      ],
      "imdbMovieId": "0046722",
      "originalTitle": "Arrow In The Dust",
      "genres": ["Western"],
      "youtubeTrailerIds": [],
      "plotSummary": "Director Lesley Selander's 1954 western stars Sterling Hayden, Coleen Gray, Keith Larsen, Tom Tully, Lee Van Cleef and Jimmy Wakely.",
      "tmdbMovieId": 138486,
      "avgRating": 0,
      "releaseYear": "1954",
      "numRatings": 0,
      "posterPath": "/2FGsPIVisiNRf8PWQyZzQnU9ABl.jpg"
   }
}