{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0082145",
      "video": false,
      "title": "Cattle Annie and Little Britches",
      "recommendations": [24790],
      "backdrop_path": "/vfVWCxggnnWLDg3cNrjvbsnzGUx.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "59c0cb43c3a36804ec00e707",
         "content": "Completist Curio.\r\n\r\nCattle Annie and Little Britches is directed by Lamont Johnson and Robert Ward co-adapts the screenplay with David Eyre from his own novel of the same name. It stars Burt Lancaster, Amanda Plummer, John Savage, Diane Lane, Rod Steiger, Scott Glenn and Buck Taylor. Music is by Sahn Berti and Tom Slocum and cinematography by Larry Pizer. \r\n\r\nA strange Oater, one that's high on promise via its cast list and premise, but ultimately ends up unfulfilling. Story is based around how two teenage girls - fascinated by tales of outlaw's movements - hook up with the remnants of the Doolin-Dalton gang and inspire them to attempt former glories. Naturally it's all historically dubious and is bogged down by its derivative nature, while the quirky parodic blend of drama and cheery never sits comfortably, the later of which compounded by a string based score that would be more at home with Hanna- Barbera.\r\n\r\nMixed notices upon release are perfectly understandable given that Lancaster and Steiger offer fine presence to the play, and Plummer is electric on debut, but the chance for something more wistfully potent is sadly wasted. 5/10",
         "url": "https://www.themoviedb.org/review/59c0cb43c3a36804ec00e707"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bill Doolin",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239c9d",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cattle Annie",
               "gender": 1,
               "credit_id": "52fe4cacc3a36847f8239ca1",
               "name": "Amanda Plummer",
               "profile_path": "/uICpVUj29yBcwCEGVZzE77FL98W.jpg",
               "id": 99,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jenny (Little Britches)",
               "gender": 1,
               "credit_id": "52fe4cacc3a36847f8239ca5",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bill Dalton",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239ca9",
               "name": "Scott Glenn",
               "profile_path": "/aKUJwCKhl4qCi7j7M7TRpqWLmmO.jpg",
               "id": 349,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tilghman",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cad",
               "name": "Rod Steiger",
               "profile_path": "/cc96tXM1O0PAoyog9hzo1GgSwB5.jpg",
               "id": 522,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bittercreek Newcombe",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cb1",
               "name": "John Savage",
               "profile_path": "/4cNKdr2E2gAvAjjydcwJGscoBsD.jpg",
               "id": 47879,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Little Dick Raidler",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cb5",
               "name": "William Russ",
               "profile_path": "/cqUD0Jm0owYxcmnMZMTKpEnrKOR.jpg",
               "id": 829,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Dynamite Dick",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cb9",
               "name": "Buck Taylor",
               "profile_path": "/8rGjtybdOWL0trJOJ6LTpz7ffgc.jpg",
               "id": 71562,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Elrod",
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cbd",
               "name": "Perry Lang",
               "profile_path": null,
               "id": 124783,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239cc3",
               "name": "Larry Pizer",
               "profile_path": null,
               "id": 1043953,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239cc9",
               "name": "David Eyre",
               "profile_path": null,
               "id": 66805,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239ccf",
               "name": "Robert Ward",
               "profile_path": null,
               "id": 1148940,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cd5",
               "name": "Rupert Hitzig",
               "profile_path": null,
               "id": 66807,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239cdb",
               "name": "Alan King",
               "profile_path": "/gYtn6UNocRfxISIAKmUfRxl7zOr.jpg",
               "id": 7169,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239ce1",
               "name": "John Daly",
               "profile_path": "/aSn9EdjxbU5VkmF7INPdumGfJWG.jpg",
               "id": 2721,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239ced",
               "name": "Stan Jolley",
               "profile_path": null,
               "id": 352394,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239cf3",
               "name": "William Haugse",
               "profile_path": null,
               "id": 107201,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4cacc3a36847f8239cf9",
               "name": "William Haugse",
               "profile_path": null,
               "id": 107201,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4cacc3a36847f8239d05",
               "name": "Lamont Johnson",
               "profile_path": "/2RerOy0iKbUtDmzOQrPgfofgMwh.jpg",
               "id": 1214133,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 1.108509,
      "production_countries": [],
      "id": 167262,
      "vote_count": 3,
      "budget": 0,
      "overview": "Cattle Annie and Little Britches is a 1981 American film[1] starring Burt Lancaster, Rod Steiger, Diane Lane, and Amanda Plummer, based on the lives of two adolescent girls in the late 19th century Oklahoma Territory, who became infatuated with the Western outlaws that they had read about in Ned Buntline's stories and left their homes to join the criminals. It was scripted by David Eyre and Robert Ward from Robert Ward's book and directed by Lamont Johnson.",
      "similar": [],
      "original_title": "Cattle Annie and Little Britches",
      "runtime": 97,
      "poster_path": "/vOOxaM9SWE3fTaQ6uN6hybIZrKD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1981-04-24",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "They told the Doolin-Dalton Gang where to go.  Then...they went with them.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Lamont Johnson"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "David Eyre",
         "Robert Ward"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082145/",
      "coverLink": null,
      "actors": [
         "Scott Glenn",
         "Diane Lane",
         "Burt Lancaster"
      ],
      "reviews": [
         "Amanda Plummer and Diane Lane are perfect complements in the title roles. Cattle Annie, as played by Plummer, is assertive, questioning, and somewhat rambunctious. In contrast, Lane's character is a lot like Barbara i One Day At A Time. The two young ladies get in the middle of Legendary Marshal Bill Tilghman's attempts to take the gang led by Burt Lancaster. The dialogue is sensational, and the acting, including terrific performances by Scoot Glenn and John Savage, could not be better. This is one to savor.",
         "Robert Ward and David Eyre adapted Ward's fictionalized book about two true-life outlaw women who headed west from Oklahoma in the 1890s and attached themselves to the Doolin-Dalton gang, who had given up robbing trains and moved on to robbing banks. Undistinguished western has corny dialogue thick with purple prose and is blanketed with generic bluegrass music. Burt Lancaster as Bill Doolin faces off against Rod Steiger as vigilant U.S. marshal Bill Tilghman, and their combined charisma gives the movie whatever personality it has, the ladies of the title being negligible. As mercurial Annie, Amanda Plummer (in her film debut) has an eccentric quality that fails to engage the audience; with her mop of untamed hair, her wild eyes and wise-old-lady speaking voice, she's a human tumbleweed. It takes over an hour into the proceedings for Diane Lane's baby-faced Jenny to exhibit some sign of life; too modern for this scenario, it's easy to forget she's even in the picture. Lamont Johnson directed, erratically. Film improves in its second-half, but the tone of the movie is off. It has elegiac qualities that aren't used to bolster the narrative, which Johnson then drops entirely for a more standard, upbeat western-genre feel. *1/2 from ****",
         "Cattle Annie and Little Britches is directed by Lamont Johnson and Robert Ward co-adapts the screenplay with David Eyre from his own novel of the same name. It stars Burt Lancaster, Amanda Plummer, John Savage, Diane Lane, Rod Steiger, Scott Glenn and Buck Taylor. Music is by Sahn Berti and Tom Slocum and cinematography by Larry Pizer. A strange Oater, one that's high on promise via its cast list and premise, but ultimately ends up unfulfilling. Story is based around how two teenage girls - fascinated by tales of outlaw's movements - hook up with the remnants of the Doolin-Dalton gang and inspire them to attempt former glories. Naturally it's all historically dubious and is bogged down by its derivative nature, while the quirky parodic blend of drama and cheery never sits comfortably, the later of which compounded by a string based score that would be more at home with Hanna-Barbera. Mixed notices upon release are perfectly understandable given that Lancaster and Steiger offer fine presence to the play, and Plummer is electric on debut, but the chance for something more wistfully potent is sadly wasted. 5/10",
         "Amanda Plummer and Diane Lane have the title roles as Cattle Annie And Little Britches in this really outstanding film that seems to have disappeared. As it was it was given limited release and held up for two years being shot in 1979. Usually that means bad news for a film. But not in this case. According to a recent biography of Burt Lancaster the collapse of the elephantine budgeted Heaven's Gate made the studios gun shy about westerns. It was the main reason the film was held up. Probably Lancaster Oscar nominated performance in Atlantic City made the studio change its mind. A pair of Hollywood legends Burt Lancaster and Rod Steiger make their only joint film appearance in Cattle Annie And Little Britches. Lancaster plays legendary outlaw Bill Doolin who operated in the Oklahoma Territory primarily and who the girls who've had their heads filled with dime novel fantasies become camp followers and are christened with those names by Lancaster. Steiger is legendary lawman Bill Tilghman who is on the trail of the Doolin gang. Worth seeing this film just to see them together in one scene. According to the Lancaster biography Amanda Plummer regarding Lancaster as an acting mentor. She was impressed with his sheer physicality even in middle age. Burt certainly was no longer playing roles like The Crimson Pirate, but still he used his whole body and not just that clear speaking voice to get you to notice him. Steiger too has one memorable voice for the screen. Cattle Annie And Little Britches is a sleeper western ready to be discovered by film fans. Make sure to see this if broadcast."
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": [
         "Cattle Annie Productions",
         "Hemdale",
         "Monday Films"
      ],
      "summaries": ["In 19th century Oklahoma two teen girls, fans of stories about outlaws, are on a quest to meet and join up with them. They find a shadow of a former gang and although disappointed still try to help them escape from a vigorous marshal."],
      "budget": 5100000
   },
   "movielensId": 131353,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-04-24",
      "dvdReleaseDate": null,
      "directors": ["Lamont Johnson"],
      "runtime": 97,
      "movieId": 131353,
      "title": "Cattle Annie and Little Britches",
      "mpaa": "PG",
      "actors": [
         "Burt Lancaster",
         "Amanda Plummer",
         "Diane Lane",
         "Scott Glenn",
         "Rod Steiger",
         "John Savage",
         "William Russ",
         "Buck Taylor",
         "Perry Lang"
      ],
      "imdbMovieId": "0082145",
      "originalTitle": "Cattle Annie and Little Britches",
      "genres": ["Western"],
      "youtubeTrailerIds": [],
      "plotSummary": "Cattle Annie and Little Britches is a 1981 American film[1] starring Burt Lancaster, Rod Steiger, Diane Lane, and Amanda Plummer, based on the lives of two adolescent girls in the late 19th century Oklahoma Territory, who became infatuated with the Western outlaws that they had read about in Ned Buntline's stories and left their homes to join the criminals. It was scripted by David Eyre and Robert Ward from Robert Ward's book and directed by Lamont Johnson.",
      "tmdbMovieId": 167262,
      "avgRating": 2,
      "releaseYear": "1981",
      "numRatings": 1,
      "posterPath": "/vOOxaM9SWE3fTaQ6uN6hybIZrKD.jpg"
   }
}