{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "california",
            "id": 387
         },
         {
            "name": "sailboat",
            "id": 544
         },
         {
            "name": "diary",
            "id": 2913
         },
         {
            "name": "reincarnation",
            "id": 5484
         },
         {
            "name": "drama",
            "id": 8029
         },
         {
            "name": "deception",
            "id": 9758
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "heiress",
            "id": 41185
         },
         {
            "name": "ancestor",
            "id": 193151
         },
         {
            "name": "accident",
            "id": 207819
         }
      ],
      "imdb_id": "tt0059487",
      "video": false,
      "title": "My Blood Runs Cold",
      "recommendations": [],
      "backdrop_path": "/Ai5BpSFvlJqftSNvQDnc2J9BAJv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ben Gunther",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303a7",
               "name": "Troy Donahue",
               "profile_path": "/53FpBBfRDva2XYjxbQijNxsC8Vd.jpg",
               "id": 45363,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Julie Merriday",
               "gender": 1,
               "credit_id": "52fe4d1c9251416c751303ab",
               "name": "Joey Heatherton",
               "profile_path": "/ot0WAlKEFiKLMYesSK99iydOvXr.jpg",
               "id": 97013,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Julian Merriday",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303af",
               "name": "Barry Sullivan",
               "profile_path": "/kRuBQnFWbrqwwbIh5BCD34uq2JF.jpg",
               "id": 40433,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Harry Lindsay",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303b3",
               "name": "Nicolas Coster",
               "profile_path": "/xg77v3immsYabbSE3WOKRAH5tt2.jpg",
               "id": 13731,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sarah Merriday",
               "gender": 1,
               "credit_id": "52fe4d1c9251416c751303b7",
               "name": "Jeanette Nolan",
               "profile_path": "/8E7iDMu0WIbtiKsY1kb8rBYziey.jpg",
               "id": 7520,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sheriff R. Seaton",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303bb",
               "name": "Russell Thorson",
               "profile_path": "/8t1XUJz3ZKKDAed0LHeUsza8I79.jpg",
               "id": 136129,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Lansbury",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303bf",
               "name": "Ben Wright",
               "profile_path": "/tZNIdYR7rtzhj0aBOafrU4XmhQ2.jpg",
               "id": 71781,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mrs. Courtland",
               "gender": 1,
               "credit_id": "52fe4d1c9251416c751303c3",
               "name": "Shirley Mitchell",
               "profile_path": "/lnbqYnVBBtaHM7WRtNZDcP1pvUK.jpg",
               "id": 153325,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303c7",
               "name": "Howard McNear",
               "profile_path": "/pqe7uwiUrPXruIuYefjO5MOtEFI.jpg",
               "id": 19786,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Mayor",
               "gender": 0,
               "credit_id": "52fe4d1c9251416c751303cb",
               "name": "Howard Wendell",
               "profile_path": "/vMzTLs16JgRkveZmESmkYPZgsh.jpg",
               "id": 48961,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mr. Courtland",
               "gender": 0,
               "credit_id": "52fe4d1c9251416c751303cf",
               "name": "John Holland",
               "profile_path": "/1ctCrOanIch8iCkoVu6jxOw08dh.jpg",
               "id": 126656,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Owen Farley",
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303d3",
               "name": "John McCook",
               "profile_path": "/37ufNlgxwAPWoLTtQe3SMEPnJiX.jpg",
               "id": 105179,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d1c9251416c751303a3",
               "name": "William Conrad",
               "profile_path": "/7tMF2QMwu5nFja1BZcGEDmYze5X.jpg",
               "id": 16412,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "572724d9c3a3685bd9001e47",
               "name": "John Mantley",
               "profile_path": null,
               "id": 155275,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "572724e7c3a368549e001e2a",
               "name": "John Meredyth Lucas",
               "profile_path": null,
               "id": 15922,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "57272532c3a3685bd9001e62",
               "name": "William Conrad",
               "profile_path": "/7tMF2QMwu5nFja1BZcGEDmYze5X.jpg",
               "id": 16412,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "572725519251411d220011d6",
               "name": "George Duning",
               "profile_path": null,
               "id": 16748,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57272560c3a3683841004d73",
               "name": "Sam Leavitt",
               "profile_path": null,
               "id": 870,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5727256ec3a3685bd9001e69",
               "name": "William H. Ziegler",
               "profile_path": null,
               "id": 2773,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5727257dc3a36844350006be",
               "name": "LeRoy Deane",
               "profile_path": null,
               "id": 1403614,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5727258bc3a3685871002874",
               "name": "Ralph S. Hurst",
               "profile_path": null,
               "id": 4311,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "572725a4c3a3683841004d7f",
               "name": "Gordon Bau",
               "profile_path": null,
               "id": 4313,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "572725b5c3a368549e001e42",
               "name": "Jean Burt Reilly",
               "profile_path": null,
               "id": 16538,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.333294,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 187482,
      "vote_count": 0,
      "budget": 0,
      "overview": "Wealthy, reckless Californian Julie Merriday, accompanied by her boyfriend Harry Lindsay, an attorney, narrowly avoids crashing into a motorcycle driven by young Ben Gunther. Ben temporarily abandons his damaged cycle and accepts a ride from Julie but insists upon calling her Barbara. Later, at the Merriday beach house, Julie's Aunt Sarah tells Julie that her great great grandmother was named Barbara, and furthermore, that ancestress had an illegitimate child fathered by one Benjamin Gunther.",
      "similar": [
         445954,
         26390,
         238636,
         339692,
         281957,
         133805,
         2163,
         3134,
         357096,
         9378,
         9654,
         9093,
         1949,
         2253,
         979,
         8456,
         431,
         59,
         101,
         205
      ],
      "original_title": "My Blood Runs Cold",
      "runtime": 104,
      "poster_path": "/7xZksh48bbITmX4fKWnyyVF7xel.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "William Conrad Productions",
         "id": 16064,
         "origin_country": ""
      }],
      "release_date": "1965-03-24",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "Is It Possible That The Dead Can Be Reborn?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["William Conrad"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "John Mantley",
         "John Meredyth Lucas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059487/",
      "coverLink": null,
      "actors": [
         "Troy Donahue",
         "Joey Heatherton",
         "Barry Sullivan"
      ],
      "reviews": [
         "One of our local TV channels used to show this movie frequently on the late show--but not at all in the last 10 years, so it appears \"My Blood Runs Cold\" is another in the long line of forgotten '60s potboilers. Too bad, because it's dopey fun. Joey Heatherton proves she's quite the little thespian here, portraying swinging single meeting a strange young man who is convinced he was her lover in a past life! Story is fairly tight, until the last reel when it begins to unravel. The chase-climax is straight off the assembly line. However, Joey is really charismatic here and had me glued to the screen. She overcomes the obvious exploitation angle director William Conrad takes and gives the picture a big boost. **1/2 from ****",
         "This silly potboiler starts out promisingly enough to get you hooked, but sadly veers off track toward the end. However, the plot is not the reason to watch this film. It's the 1965 trappings - the cars, the clothes, the sharp-focus black & white photography - that keep you glued to this picture. It's an inadvertent but accurate time capsule. Viewers with a camp sensibility will have a field day with Jeanette Nolan's hairdos alone. Each scene she's in brings yet another mind- blowing creation which we're supposed to believe she whips up on her own. Joey Heatherton sports a few odd coifs herself. Joey was a fine 60's-style sex kitten and her look is immortalized here. Troy Donahue's acting skills, which were passable in previous films, here prove why his career didn't last much longer. Nice scenery along California's 17-mile Drive. Watch this film for a guilty wallow in 1965 mindset.",
         "Plot—A polite but obscure young man gains entrée into a wealthy household by claiming he and the family's daughter are reincarnations of past lovers. He's got just enough family secrets to lend some credence to the outlandish claim. For a psychological thriller (why else the title) the film never achieves needed menace. Frankly the role is outside actor Donahue's limited range. Here he comes across more as a blandly mixed up beach boy than anything psychopathic. Thus the narrative unfolds rather than rivets. Heatherton is okay as the object of Gunther's (Donahue) obsession; at the same time, I almost forgot my Gidget flashbacks during the beach scenes. Actually I was most impressed with the unknown Coaster as the buttoned-down attorney, Harry. His sudden turnabout in that showdown scene with Merrivale (Sullivan) is impressive. Harry goes from a passive yes-man to a razor sharp critic in a scene that is both well scripted and acted, and may very well be the film's best. Too bad RKO of the late 40's didn't get the project first. For b&w photography, they would have known what to do with noir material like this. Here the narrative is unfortunately filmed in flat style, at the same time the direction remains largely impassive. Consider what Anthony Mann or John Brahm could have done with, say, the boyish Robert Walker of Strangers on a Train (1951) as Gunther. Perhaps that's not very fair. But considering the potential this film shows, some such comparison is irresistible. Anyway, Donahue's rather sad career again shows the hazards of Hollywood. After all, like many youngsters, his brief moment depended more on youthful good looks than on talent. Too bad he didn't transition into a post-Hollywood career or marriage as many of his peers managed to do. All in all, I prefer to remember him from A Summer Place (1959) rather than for this obscurity. (In passing--The topic of reincarnation briefly seized public attention in 1956 when a Colorado housewife, under hypnosis, claimed to be a reincarnation of an Irish girl, Bridey Murphy, from a century earlier. Apparently, the housewife had the brogue down pat and was just convincing enough to invite serious attention. For a while, many folks were undergoing hypnosis to maybe investigate their own previous lives. Anyway, the fad soon died out, but, for better or worse, I'm reminded of it by this movie.)",
         "Well, not any more. You can tell by the production values in \"My Blood Runs Cold\" that Troy Donahue's stock had taken a nosedive at Warners. It's in black and white, is directed by William Conrad, a serviceable but by no means A list director, and it makes use of the Doheny Mansion, a common setting for lots of movies. The film was made in 1965; by 1966, Warner Brothers had dumped him. Here, Donahue plays a mysterious man named Benjamin Gunther. In another life, he was in love with Barbara Merriday, the great-great grandmother of Julie Merriday (Joey Heatherton). He believes that Julie is a reincarnation of Barbara, and that they are meant to be together. He gives her a necklace with Barbara's picture in it, which looks just like Julie, and takes her to a cave where the lovers would meet. However, the two were separated by Barbara's father, and she would up marrying Merriday. Julie finds herself drawn to Ben in spite of herself; her father (Barry Sullivan) and boyfriend (Nicolas Coaster) disapprove. Are Julie and Ben intended to live Barbara and Ben's love story? And will they meet the same sad ending this time too? Troy Donahue by 1965 was 29 and, due to his drinking, was looking bloated and pasty. For a time he was a huge heartthrob, and this film was intended to appeal to young people, despite the fact that Donahue wasn't playing his usual nice guy. Donahue possessed, in the beginning anyway, striking looks and a good speaking voice. But he comes off as wooden; he wasn't an unlikeable actor, he just didn't have much range. Joey Heatherton was better, even in baby doll pajamas. Jeannette Nolan, as her aunt, is the best in the cast. \"My Blood Runs Cold\" is an entertaining film, probably not for the reasons it was intended, but nevertheless, viewers who don't take it too seriously will enjoy it.",
         "If you go in with your expectations adjusted to the fact that the stars of this are Troy Donahue and Joey Heatherton, hardly renown for their thespic abilities, then you should enjoy this rather overwrought drama that wants to be a thriller but isn't very chilling at all. Troy shows up out of the blue when heiress Joey almost runs him down and is transfixed from the beginning telling her she's the reincarnation of his long lost love, Joey's great, great grandmother. This gives her understandable pause until he shows her a locket of the woman that Joey is a dead ringer for, apparently they had bottle blonds in the 17th century! It doesn't get any more believable from that point on but if you like 60's potboilers this has its charms. Jeanette Nolan as Joey's aunt who knows most if not all the secrets gives the best performance and her hairpieces have to be seen to be believed! One is so mountainous that it's bigger than her head! A great deal of fun in an over the top ridiculous kind of way.",
         "Troy Donahue must have been sick and tired of his parts of nice good-looking boys ;his attempt at a troubled character is certainly laudable,for who could believe he is able to do so very bad things? The problem is the prologue which promised more than we are given :the picture imitates a tapestry,giving the feeling of something of long ago ;and there are four lines of a poem by a poem by Byron ,which finally doesn't bring anything to a plot which steals from \" portrait of Jennie\" \"Vertigo\" and \"Pandora\" -hasn't Donahue got a ship?- to name but three ,but there is more.There's even a \"love story\" side for the girl's dad is a rich man whereas the blond boy has ,it seems ,no penny to his name . After three or four melodramas (the best of which is arguably \"Parrish\" ),it was a good idea to cast this good -looking actor in a disturbing role:at the beginning of the movie,and at least in the first half ,the audience does believe he is a romantic man who lives in the past and comes back (from the dead?) to claim his one and only love.But things go wrong in the second part in which the director seems not able to build an eerie magic atmosphere ;the final chase is the easy way out and the final pictures do not even try to disturb the viewer a little bit.",
         "Cookie Cutter Supernatural Thriller that Reeks of Anthology TV, like \"The Twilight Zone\" or \"Thriller\". Popular Shows in the Late Fifties and Early Sixties. Troy Donahue who was Almost but Not Quite a Major Hollywood Star that Shined for a Few Films and then Burned Out on TV Gigs and Booze. William Conrad Directs without much Enthusiasm and the Movie Suffers from Bland Cinematography, Sets, and Dialog and is only the Least Bit Interesting Outdoors. Joey Heatherton was a Cutie that Never Attained a Long Career but was a serviceable Actress with a High Pitched Voice and a Highly Curvaceous Body. Barry Sullivan Chews the Scenery Playing the Domineering Father and Cutthroat Capitalist. He Thrashes about and Yells a lot, but is still Upstaged by Jeanette Nolan as a Sympathetic and all Knowing Aunt. Nicolas Coaster is the Third Wheel of the Reincarnation Romance between Troy and Joey and it's a Pretty Good Performance. But its all so Routine without as much as a Boo and the End Chase Scene goes on Forever where Nothing much Happens and is very Predictable. Overall, the Movie Barely makes Passable Entertainment, with just Enough Talent hanging around the Set to make this Watchable, but In the End it is a Styleless and somewhat Silly Misfire.",
         "Taking over for Sandra Dee as Troy Donahue's blonde vis-a-vis, that outstanding thespian Joey Heatherton is about as exciting as the film's credits. As for Donahue, he tries valiantly as a psychopathic man who may or may not be a re-incarnation of Heatherton's great-great grandmother, but no matter how many convulsions he has, he still lacks the spark to be a sustainable leading man. This story of a so-called family legend has potential, but can't escape the leads, being notable mainly for its romantic supporting actor, Nicolas Coaster, and the wild and wacky hairstyles of Heatherton's aunt, Jeanette Nolan, who seems to have gotten this role because Ruth Gordon wasn't available. Her initial appearance has her in a hat which resembles a pom-pom, and in subsequent scenes, her overly piled coif resembles everything from roadkill to a soufflé. Her performance of a wacky but wise aunt is fun to watch, sort of like that crazy older relative that manages to be dragged out for family holidays whom the younger members enjoy watching get tipsier and tipsier. Unfortunately filmed in black and white (which really doesn't help make this any spookier), that makes much of the dramatic action truly boring, even its climax on a storm-swept lake. Poor Barry Sullivan plays such a beast of a power-throwing patriarch that it is difficult to feel any empathy for him other than the poor material the actor has to speak. A non-Gothic version of a similar story was \"A Kiss Before Dying\" where Robert Wagner gave a much more convincing portrayal of a psychopath, one you really felt a tinge of sympathy for. Even Robert Walker's psycho in \"Strangers on a Train\" was more ingratiating and fun to watch than Donahue's here.",
         "Troy Donahue was on suspension for a while refusing WB films etc and returned to the studio to film this William Conrad thriller. Troy Donahue excelled in the lush romantic dramas filmed by Delmer Daves at Warners however Troy Donahue lost his footing in this film. My Blood Runs Cold should have been filmed in Color and lost some of its edge by filmed in black and white. William Conrad who would have a TV career in Jake and The Fatman was also a Director and did Connie Stevens' Two On A Guillotine, Jeff Hunter's Brainstorm among other films. Not a great Film Director but Mr Conrad's films are enjoyable. Carol Lynley was first slotted for this film but was optioned by Otto Preminger under a contract Carol Lynley had with Preminger to do a Preminger film. Joey Heatherton took the role. Joey Heatherton made Where Love Has Gone with Susan Hayward, and Bette Davis at Paramount, Twilight of Honor at MGM with Richard Chamberlain and this WB movie. Not sure why Joey Heatherton made no other noteworthy films. This was Troy Donahue's last movie at Warner Bros and his last as a Star",
         "Young 21-year-old Julie (Joey Heatherton) is dating old but dependable Harry (Nicholas Coaster). Then she meets young hunky Ben (Troy Donahue) who seems instantly smitten with her. It seems he thinks she's the reincarnation of a woman he loved in another life! He knows a lot about her family that there's no way he could have known. Is it true? Obscure little thriller. The basic plot is interesting and it moves quickly enough. Donahue and Heatherton are certainly an attractive couple and shown in their bathing suits often. But this movie has problems. It's flatly directed and Barry Sullivan and Coaster are dreadful in their roles. Donahue and Heatherton are bad too but Donahue tries and is actually very good at times. Old pro Jeanette Nolan however is superb as Aunt Sarah. The ultimate resolution was disappointing but I'd be lying if I said I wasn't entertained. I give it a 6.",
         "I put chiller in quotes, because this is just not thrilling or chilling in any way, It needs to be edited down (almost 2 hours for a thin plot), and the writing and the direction needed to be scaled back -- too much scenery chewing and yelling. But there are some fun compensations. The director, William Conrad, was better known as a radio actor, and the small parts of this movie are filled with veteran radio performers: Jeanette Nolan, Howard McNear, Ben Wright, Barry Sullivan, and even Conrad's voice turns up as the helicopter operator towards the end. If you listen to old radio shows, this is a bit of a treat. The fashions are....well, Jeanette Nolan must be seen to be believed. Her hair is tortured into some demented structure in every scene. One dinner scene has her sporting a tower of hair that Marie Antoinette would have envied. Then there is the part where she has her hair in braids like a coronet, this is the scene where she stays up all night long to make sure that her niece is okay. Bright and early, the next morning, her hair is piled up like a castle battlement with curls and ruffles with an incongruous pony tail sticking straight out the back. When does the woman find the time to do her hair? Does she have a fully staffed beauty salon in her bedroom, or does the long suffering butler (the only servant we ever see) do the hot curler thing in addition to everything else? Her costumes are also flowing caftan like things made of satin. Who really dressed like this? Sorry to go on so much about the clothes and hair, but it was absolutely fascinating, in a bizarre way.",
         "***SPOILERS*** Somewhat strange and ridicules story of love and reincarnation that spans something like 100 years with 29 year old former teenage heartthrob Troy Donahue as the mysterious and at the same times freaked out and delusional Ben Gunther. It's Ben who literally runs into-with his motorcycle- pretty and filthy rich Julie Merriday, Joey Heatherton, while zooming along the Pacific Highway at 120 mph. As if it were fate or a sign from heaven Ben realized that Julie and him were lover back in the 1870's who ended up killing themselves-Like Romeo & Juliet- when their parents disapproved of them getting married to each other. At first Julie thinks that Ben is suffering from brain damage due to his accident but in time he proves to her that his crazy statements about him knowing her in a past life are legit. That by providing evidence like photos and trinkets of his romance with Julie 100 years ago when she was actually her own great-great-great grandmother! It's Julie's dad Julian, Barry Sullivan, who sees Ben as a both fraud and gold digger who tries to get Julie to stop seeing him only to have her end up eloping, in Ben's boat,to Mexico with him to get married. \"\"\"SPOILERS***The truth about Ben's true identity slowly comes to the surface together with two of his victims who he strangled to death and dumped into the Pacific Ocean. With the fact coming out about Ben being an escaped inmate from a hospital for the criminally insane he tries to kidnap Julie only to have the local police as well as Julie's former lover and fiancée Harry Lindsey, Nicolas Coaster, try to rescue her before he does her any harm. In the end it's Ben who does himself in-in knowing that the jig is up- by jumping some 200 feet to his death in order to avoid ending up locked up for life in a mental institution or being strapped into the San Queinton gas chamber for multiple murder. P.S This film -\"My Blood Runs Cold\"- turned out to be the last major movie that Troy Donahue was to star in before his film career hit rock bottom co-staring in such low budget and forgettable films like \"The Cock Fighter\" and \"The Chilling\" before dropping out of sight altogether. Troy in the end ended up broke and homeless sleeping on a park bench in New York City's Central Park and dying of a heart attack in 2001 at the age of 65."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "William Conrad Productions"
      ],
      "summaries": [
         "Wealthy, reckless Californian Julie Merriday, accompanied by her boyfriend Harry Lindsay, an attorney, narrowly avoids crashing into a motorcycle driven by young Ben Gunther. Ben temporarily abandons his damaged cycle and accepts a ride from Julie but insists upon calling her Barbara. Later, at the Merriday beach house, Julie's Aunt Sarah tells Julie that her great great grandmother was named Barbara, and furthermore, that ancestress had an illegitimate child fathered by one Benjamin Gunther. Despite her father's protestations and Ben's irrational conviction that she and he are reincarnations of the past lovers, Julie breaks off with Harry and elopes with Ben. While aboard a small ketch Ben claims he owns, Julie finds the earlier Benjamin's diary, reads of his affair with her ancestress, and realizes that Ben lied.",
         "Disturbed young man meets a girl he believes to be a long-dead ancestor."
      ],
      "budget": 0
   },
   "movielensId": 131373,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1965-03-24",
      "dvdReleaseDate": null,
      "directors": ["William Conrad"],
      "runtime": 104,
      "movieId": 131373,
      "title": "My Blood Runs Cold",
      "mpaa": "",
      "actors": [
         "Troy Donahue",
         "Joey Heatherton",
         "Barry Sullivan",
         "Nicolas Coster",
         "Jeanette Nolan",
         "Russell Thorson",
         "Ben Wright",
         "Shirley Mitchell",
         "Howard McNear",
         "Howard Wendell",
         "John Holland",
         "John McCook"
      ],
      "imdbMovieId": "0059487",
      "originalTitle": "My Blood Runs Cold",
      "genres": [
         "Mystery",
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Wealthy, reckless Californian Julie Merriday, accompanied by her boyfriend Harry Lindsay, an attorney, narrowly avoids crashing into a motorcycle driven by young Ben Gunther. Ben temporarily abandons his damaged cycle and accepts a ride from Julie but insists upon calling her Barbara. Later, at the Merriday beach house, Julie's Aunt Sarah tells Julie that her great great grandmother was named Barbara, and furthermore, that ancestress had an illegitimate child fathered by one Benjamin Gunther.",
      "tmdbMovieId": 187482,
      "avgRating": 0,
      "releaseYear": "1965",
      "numRatings": 0,
      "posterPath": "/7xZksh48bbITmX4fKWnyyVF7xel.jpg"
   }
}