{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mystic",
            "id": 2795
         },
         {
            "name": "india",
            "id": 14636
         },
         {
            "name": "rajah",
            "id": 192389
         }
      ],
      "imdb_id": "tt0013802",
      "video": false,
      "title": "The Young Rajah",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Amos Judd",
               "gender": 2,
               "credit_id": "52fe4cbb9251416c75123e07",
               "name": "Rudolph Valentino",
               "profile_path": "/c3haf3X3LGE1ysuOyZlFofbV2Eo.jpg",
               "id": 116367,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah Judd",
               "gender": 0,
               "credit_id": "52fe4cbb9251416c75123e0b",
               "name": "Fanny Midgley",
               "profile_path": null,
               "id": 1150904,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joshua Judd",
               "gender": 0,
               "credit_id": "52fe4cbb9251416c75123e0f",
               "name": "Charles Ogle",
               "profile_path": "/mptT872tCO8rTQ0Cql99MOsHCCn.jpg",
               "id": 28971,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "General Devi Das Gadi",
               "gender": 0,
               "credit_id": "552ca3ab9251413871002e7a",
               "name": "George Periolat",
               "profile_path": null,
               "id": 128326,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Prince Rajanya Paikparra Munsingh",
               "gender": 0,
               "credit_id": "552ca3bd9251413c3e002a91",
               "name": "George Field",
               "profile_path": null,
               "id": 1004060,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Maharajah Ali Kahn",
               "gender": 0,
               "credit_id": "552ca3ccc3a3681ad0000346",
               "name": "Bertram Grassby",
               "profile_path": null,
               "id": 592832,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Narada - the Mystic",
               "gender": 2,
               "credit_id": "552ca3dc925141031e0007b1",
               "name": "Josef Swickard",
               "profile_path": "/ddpJxjE5VOcWuJrxjOe53ws1Nyx.jpg",
               "id": 133099,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Stephen Van Kovert",
               "gender": 2,
               "credit_id": "552ca3f1925141093a001752",
               "name": "William Boyd",
               "profile_path": "/hASlEm6UEICi8HI5oeLZwkzI4ad.jpg",
               "id": 130491,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Horace Bennett",
               "gender": 0,
               "credit_id": "552ca4019251413873002db7",
               "name": "Robert Ober",
               "profile_path": null,
               "id": 29976,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Austin Slade Jr.",
               "gender": 0,
               "credit_id": "552ca4129251413c3e002ab6",
               "name": "Jack Giddings",
               "profile_path": null,
               "id": 1454054,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Molly Cabot",
               "gender": 1,
               "credit_id": "552ca4209251413873002dc5",
               "name": "Wanda Hawley",
               "profile_path": "/k3abgb4k80K6c9G8xicAcp3lRnh.jpg",
               "id": 148819,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "John Cabot",
               "gender": 0,
               "credit_id": "552ca42f925141093a00176e",
               "name": "Edward Jobson",
               "profile_path": null,
               "id": 144048,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Amhad Beg - Prime Minister",
               "gender": 2,
               "credit_id": "552ca4409251413871002eaf",
               "name": "J. Farrell MacDonald",
               "profile_path": "/7FFR9E9T4SsLFL27cYqLSjmzWV1.jpg",
               "id": 9091,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Dancing Girl",
               "gender": 1,
               "credit_id": "552ca45b925141093a001780",
               "name": "Julanne Johnston",
               "profile_path": "/yZ7EGmb3MdAh2yf0rIoQ0rnhP1b.jpg",
               "id": 29981,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Amos as a Child",
               "gender": 0,
               "credit_id": "57221f8a9251412e92002795",
               "name": "Pat Moore",
               "profile_path": null,
               "id": 1170317,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Miss Elsie Van Kovert",
               "gender": 0,
               "credit_id": "57221fe0c3a36879f20031f0",
               "name": "Maude Wayne",
               "profile_path": null,
               "id": 1365705,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Dr. Fettiplace",
               "gender": 0,
               "credit_id": "5722201192514121c6000af1",
               "name": "Joseph Harrington",
               "profile_path": null,
               "id": 148415,
               "order": 16
            },
            {
               "cast_id": 22,
               "character": "Caleb",
               "gender": 2,
               "credit_id": "572220219251413c83001853",
               "name": "Spottiswoode Aitken",
               "profile_path": "/9fObG6w4UQHqBqD9JXXYmMRbDek.jpg",
               "id": 8835,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4cbb9251416c75123e15",
               "name": "Phil Rosen",
               "profile_path": "/bkEhiu49mM8jiGSNiiv3vXQID0p.jpg",
               "id": 103931,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4cbb9251416c75123e1b",
               "name": "June Mathis",
               "profile_path": null,
               "id": 35501,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "552ca47d9251413876002c8e",
               "name": "Natacha Rambova",
               "profile_path": "/5MbO9ls2wz6LhGhLOclNvhzPLyY.jpg",
               "id": 1353811,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5726518cc3a368589900333e",
               "name": "James Van Trees",
               "profile_path": "/mN09qHVEEF0QvNPV0n7J7LlyJ2Q.jpg",
               "id": 144124,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.2212,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 184267,
      "vote_count": 1,
      "budget": 0,
      "overview": "A young man raised in the American South discovers he is an Indian prince whose throne was taken by usurpers.",
      "similar": [
         87827,
         97630,
         244267,
         783,
         4538,
         334543,
         87,
         38167,
         700,
         11236,
         12177,
         9824,
         8079,
         49009,
         11082,
         10631,
         268238,
         10303,
         7508,
         74513
      ],
      "original_title": "The Young Rajah",
      "runtime": 54,
      "poster_path": "/aAIiud72SJT2ldyWmc3zbXkloo2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1922-11-11",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "HE WAS A PRINCE of India, she an American girl.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Phil Rosen"],
      "runtime": 54,
      "synopsis": null,
      "writers": [
         "Alethea Luce",
         "John Ames Mitchell"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0013802/",
      "coverLink": null,
      "actors": [
         "Rudolph Valentino",
         "Wanda Hawley",
         "Pat Moore"
      ],
      "reviews": [
         "A badly deteriorated print with Spanish titles was discovered in Europe recently - however only the last three reels totaling about 35 minutes had survived. The first fifteen to twenty minutes represent a collage of studio stills, bits of a trailer, modern photographic inserts and bridge material from June Mathis' continuity script to replace the first two or three reels that have disintegrated. Nitrate damage is evident in the remaining footage as well as some fading and streaking. The missing sequences include a fantastic Art Deco costume ball (designed by Natacha Rambova) and a rowing team boat race showing off Valentino's physique in tight fitting trunks and nothing else. Valentino, whose subtlety and intelligence are evident in every picture he made, plays Amos Judd (born Sirdir Singh), the mysterious adopted son turned Harvard man. Amos' ancestors included Arjuna, the hero of the Bhagavad Ghita whose forehead was touched by the God Krishna and he and his offspring have been given powers of prophecy. This turns out to be a blessing and a curse for Amos Judd as his past comes after him and threatens his love for Molly Cabot, an American girl played by blonde and lovely Wanda Hawley. Fortunately, her father seems to be a Unitarian judge with remarkably liberal attitudes, so their union is not out of the question. The film deals head on with issues of racism with remarkably enlightened and forward-thinking attitudes for that period. The issue of interracial relationships is explored in a very sympathetic light. The attitude expressed is that a man should be judged by the quality of his thought and not his religion or the color of his skin. Amos Judd, himself the product of an interracial marriage between an Italian woman and an Indian Rajah, is shown as being a student of all religions who believes that there are many roads to one God. The film is intriguing for its stunning design, magnetic star and free-thinking philosophy. Evidently the film was not a great success, came out just at the time Valentino was arrested for bigamy and preceded a period of conflict with the star and Paramount studios. Valentino didn't like this film but I found it rather enticing and one can only hope that somewhere there is another print in better condition.",
         "I caught this picture on TCM's Silent Sundays an May, 2006. The last forty minutes of a nitrate print were discovered and using stills and trailers, Paramount did a very commendable job giving the viewer the as much of the full experience as they could. Valentino gives an excellent performance and looks enough like an Indian in his turban to pass for their prince. The climax occur rather quickly but how the picture concludes is definitely on the clever side. But what is most interesting about this picture in the incorporation of prejudice and equality into the romance between Valentino's and Hawley's characters. Being only 18, prejudice and equality are different to me than they are to my parents, but I couldn't help but be amazed at how the film tackled the issue and rapped it up in an engrossing, almost epic motion picture experience.",
         "I unfortunately missed the introduction (if there was one) to \"The Young Rajah\" on Turner Classic Movies, but the film was pieced together - the entire beginning is lost, told with dialogue cards, story cards, and stills. Eventually there is a clip of badly preserved film, more stills, and then finally \"The Young Rajah\" is completed using the actual film. The entire presentation only runs about an hour. The silent era was the great equalizer - only in silents could an Italian with a thick accent play an Indian living on an American farm under the name of Amos Judd. As a young boy, the heir to the throne of India is brought to the farm of his father's friend, where he grows up, goes to Harvard, and falls in love. He has the gift of foretelling the future - which is where the frustration comes in for this viewer - but I digress. As his wedding day draws near, he is asked to return to India, where a usurper has taken over the throne and chaos reigns. Valentino was very much of his time. He was an Italian working in silent films, and there's every chance he would not have survived sound or, as tastes changed, kept his leading man status. While Ramon Novarro enjoyed a career in talkies and television in character roles, we don't know if this would have happened to Valentino or would have been acceptable to him. Yet appearance-wise, he's ahead of his time, too. When one views him with today's eyes, he looks like one of the current Italian models with his slicked back hair, handsome face, and knack for looking elegant in suits. No man around him comes even close in appearance. People must have had better vision in the '20s - the film contains many notes various characters received, and despite them being clear, I couldn't read them from where I was sitting. At the end of the movie, the film is almost completely deteriorated during the young rajah's vision - so I can only guess at what happens. A real pity, but what a credit to the people who worked to preserve what was left. A movie of great interest for those fascinated by film history.",
         "Fascinating film from 1922 and great detective work in piecing together a whole film from the 30 minutes of discovered footage. Rudolph Valentino plays the rajah who is brought up in the US out of harm's way while his village is India is embroiled in a holy war. He is brought up as a young gentleman and attends Harvard. He's a total American except for his gift of second sight, handed down through the generations and a gift from Krishna. But he makes enemies at Harvard (racists) and after he wins the big regatta again Yale (in a very brief swim suit). At a party later, a sour student accuses him a buying the seat on the team and thereby cheating him out of the big win. Valentino gets a vision and steps aside just as the student lunges at him. He goes out the window and is killed. Enter Wanda Hawley as the rich girl who moves into the neighborhood for the summer. Rudy falls for her but she's appalled by his race even though his mother was an Italian Countess. Of course the dead student's friend is also interested in her. They battle a few times and the coward chucks a rock at Rudy as he's walking away. Wanda comes to his rescue. About this time a delegation comes from India to find Rudy and take him back to his proper place in life. He goes back after a few more glimpses into the future. He quells the uprising and restores peace, but he is sad until he wanders alone in his garden and has a final vision in the mist of a water fountain. It's his marriage to a mysterious veiled lady...... Valentino is good from what we can see. He underplays and looks great. His regatta scenes must have caused a stir since we don't usually see men that naked in the 20s and 30s. Hawley is good but doesn't have much to do. Josef Swickard, J. Farrell MacDonald, and William Boyd co-star.",
         "The Young Rajah is a decently good movie but does little for Rudolph Valentino's talent. Sadly enough most of the movie has been composed of still photographs especially in the beginning. Most of this movie in the original version has been lost and is yet to be found. The plot for this movie is about Amos Judd played by Rudolph Valentino who has been raised in America with a American family. But is truly the prince of India. With basically the whole world standing in his way he falls in love with an American girl played by Wanda Hawley. The movie is based on the novel, Amos Judd. It's basic plot is of an Indian prince raised in America but born with a six sense which was placed upon the sons of this noble Indian family from which he comes. His sixth sense serves him well when the usurpers of the kingdom within India learn of his existence in America and threaten his life. This movie is one of Valentino's most commercially and critically unsuccessful films. Many of the costumes he wore which were made by his then wife Natacha Rambova leave little to the imagination.",
         "Rudolph Valentino (as Amos Judd) is a holy Indian prince, brought to America as a small boy; there, he was adopted by the Judds. The throne of Amos's real father had been seized by tyrannical Bertram Grassby (as Ali Kahn). Mr. Valentino is told of his true identity, but happily remains in America, where his muscles and magnetism make him a popular student at Harvard University. Valentino's innate precognitive abilities surface as he meets and falls in love with Wanda Hawley (as Molly Cabot). Due, undoubtedly, to his divine past, Valentino's gift of prophecy grows more pronounced. After his life is threatened, he must decide whether or not he should return to India and reclaim his throne. Excellent restoration by Flicker Alley, the Library of Moving Images Collection, and Turner Classic Movies - the available footage and supplementary material have the integrity of the full film; the beginning footage is mostly lost, so the viewing pleasure improves over the running time. However, the story's \"Mystical Eastern Hindu\" exoticism hasn't aged well, and the film is only partially successful in its intent. Valentino and Grassby are passable as Indians (from India); actually, Valentino is better as an All-American. The best aspect of the film is how it addresses racism - and, it is best portrayed by Wanda Hawley as Valentino's love interest; in effective scenes, she struggles with her own racism. She loves Valentino, but questions marrying a man who isn't her \"kind\". The film advises, \"Men should be judged not by their tint of skin, the Gods they serve, the Vintage that they drink, nor by the way they fight, or love, or sin - but by the quality of thought they think.\" Ms. Hawley's struggle parallels Valentino's own - should he stay in America, or return to native India? ****** The Young Rajah (11/12/22) Phil Rosen ~ Rudolph Valentino, Wanda Hawley, Bertram Grassby",
         "Love to look at old films way before my time and especially this film which was made up of mostly still photos and about one-third of the film on tape. Fanny Midgley gives a great performance with Rudolph Valentino who captures his heart and Valentino does everything in his power to bring her to the altar, but Fanny is not convinced because of the color of his skin being from India. Fanny reads in a book that skin color should not make a difference if you are in love and Fanny discovers she changes her mind and her way of thinking. This film will take you to India, Connecticut and some people are able to foretell about the future. If you like very old films, this is a great 1922 Classic. Enjoy",
         "Considering that less than half of the original film exists today and that the rest of the movie was pieced together using stills and title cards, it is very difficult to objectively rate this film. However, despite this, I was a little surprised how favorable all the other reviews were here on IMDb. While I do agree with them that it is very frustrating to see the movie in this \"restored\" condition, I just can't see it being THAT good a movie--probably even if the entire picture ever is discovered. The movie has a very bizarre plot to say the least. An Indian king is murdered and his throne usurped. However, his young son is spirited out of the country and is raised by a foster family in America. This boy grows into the character played by Valentino. He's a decent guy but struggles with ESP--having flashes of future events. One such flash helped save his life from a jealous Harvard classmate that tried to kill him. The would-be murderer falls to his own death and Rudy is cleared of all blame--except by the would-be murderer's friends. Oh well, you can't please everyone. Across the globe, the usurper sees a newspaper clipping about the event and concludes that this MUST be the long lost prince, so he sends agents to America to kill him! Well, Rudy talks precautions that seem awfully lame but still manages to avoid being killed. The usurper is forced to flee the country, Rudy returns to become king and his girl from back in the Good Old US of A comes to him to become his bride. As you can see, the movie's plot was indeed strange. This strangeness made it interesting to watch, but also made it seem like a lot of hooey to me. Plus, if you had the foreknowledge that people were coming to kill you, you certainly would have taken more reasonable steps to protect yourself--such as going to the police, buying a gun or hiring a group of armed guards--none of which Rudy did! The movie loses a point or two for this plot hole. All-in-all, an odd a diverting movie but no more. Valentino certainly did better and more complete films.",
         "Even though this film only partially exists in rough quality, it's not difficult to see why The Young Rajah (1922) was not one of Valentino's more popular films. The story has interesting ideas: a displaced prince with psychic powers, a love interest who must overcome her racial prejudice before she can be with the hero, and a sense of religious tolerance which feels odd in such an old Hollywood film. Unfortunately, the film is uneven, with a villain who's barely allowed to have much presence and a rather bland main character. Valentino in particular is pretty stiff. From what we see of it, this performance has to be among the weakest of his career, alternately wooden and overdone. Really, the only plus in this film are Natacha Rambova's costumes and sets. Everything else is interesting in theory, but in execution, quite forgettable. Still, I do hope they find a full print of it someday; maybe a complete print would change my opinion.",
         "Young Rajah, The (1922) ** (out of 4) Rudolph Valantino drama, which was considered lost for many decades. When a print finally showed it in was in very bad shape with nearly 2/3rds of the film too bad to show so they took the decent footage and added photos to it to try and get back as much as they could. The film tells the story of a young man (Valantino) who was brought over from India as a small child who, when learning his background, goes back to India to fight for his crown. The film doesn't make too much since due to all the footage being missing but apparently this film wasn't that good in its complete form so I'm not sure how much better it would have been complete. Valantino actually does a good job in the few remaining footage of film and the costume design and sets are appear to be top-notch as well. Charles Ogle, the man who played the monster in Edison's 1910 version of Frankenstein, has a role here as well.",
         "As others have said, what is left to this film is put together with stills and interspersed with the actual film. Very, very difficult to watch; even understand because of this. I really don't know if it should have ever been accomplished as it is incoherent and unsubstantial in this chopped up way. In any case, we see the young Valentino, an amazing actor from so, so very long ago, yet it is difficult to say anything because of the film's deterioration. Too bad, but for Valentino fans, of long ago and today, it is nice to watch. He has or shall I say \"had\" a distinctive Italian young man look, and as others have said, whether he would have been successful at or in any other time in motion picture history is also difficult to judge."
      ],
      "genres": [
         "Romance",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["A young man raised in the American South discovers he is an Indian prince whose throne was taken by usurpers."],
      "budget": 0
   },
   "movielensId": 131427,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1922-11-11",
      "dvdReleaseDate": null,
      "directors": ["Phil Rosen"],
      "runtime": 54,
      "movieId": 131427,
      "title": "The Young Rajah",
      "mpaa": "",
      "actors": [
         "Rudolph Valentino",
         "Fanny Midgley",
         "Charles Ogle",
         "George Periolat",
         "George Field",
         "Bertram Grassby",
         "Josef Swickard",
         "William Boyd",
         "Robert Ober",
         "Jack Giddings",
         "Wanda Hawley",
         "Edward Jobson",
         "J. Farrell MacDonald",
         "Julanne Johnston",
         "Pat Moore",
         "Maude Wayne",
         "Joseph Harrington",
         "Spottiswoode Aitken"
      ],
      "imdbMovieId": "0013802",
      "originalTitle": "The Young Rajah",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A young man raised in the American South discovers he is an Indian prince whose throne was taken by usurpers.",
      "tmdbMovieId": 184267,
      "avgRating": 3,
      "releaseYear": "1922",
      "numRatings": 1,
      "posterPath": "/aAIiud72SJT2ldyWmc3zbXkloo2.jpg"
   }
}