{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "perfect crime",
            "id": 584
         },
         {
            "name": "murderer",
            "id": 13112
         },
         {
            "name": "brit noir",
            "id": 155451
         }
      ],
      "imdb_id": "tt0039306",
      "video": false,
      "title": "Dear Murderer",
      "recommendations": [
         37504,
         61908,
         131455,
         35852,
         47623,
         28666,
         45679,
         25509,
         26169,
         38417,
         35006,
         81741,
         60520,
         26530
      ],
      "backdrop_path": "/46vrydXOQzJ0aSvbcCYWgxsHGaq.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "52747457760ee35713108794",
         "content": "You can’t kill them all you fool! \r\n\r\nDear Murderer is directed by Arthur Crabtree and collectively adapted to screenplay by Muriel Box, Sydney Box and Peter Rogers from the play by St. John Leigh Clowes. It stars Eric Portman, Greta Gynt, Dennis Price, Maxwell Reed, Jack Warner, Hazel Court and Jane Hylton. Out of Gainsborough Pictures, music is by Benjamin Frankel and cinematography by Stephen Dade. \r\n\r\nLee Warren (Portman), consumed by jealousy over his wife’s unfaithfulness, believes he has executed the perfect murder, however, he hadn’t bargained on another one of his wife’s lovers entering the fray. But sensing a great opportunity to kill two birds with one stone, he executes another cunning plan… \r\n\r\nPerhaps he’s Adolf Hitler in disguise? He’s about the right height. \r\n\r\nA wonderfully twisty British thriller, Dear Murderer enjoys giving off a whiff of unpleasantness as it enthrals from the get go. Classic Brit staples are in place for this type of thriller, a vengeful man, harlot woman, intrepid copper and male suitors caught in a trap. Construction is as such, that it’s initially hard to actually get on side with any of the principal characters, but one of the film’s many delights is in how it constantly alters the trajectory of sympathy towards the actual murderer! It helps as well that the story doesn’t rest on its laurels, this is not merely about one murder, and about one man trying to get away with that murder, it’s about more than that. There’s a lot of talking going on, but it’s all relevant to actions that are soon to follow, so when the flip-flops arrive, we are fully prepared and immersed in the devilish goings on. \r\n\r\nArthur Crabtree (Madonna of the Seven Moons) is something of an unsung director from the British classic era, where often he has been termed workmanlike and steady. Yet he was able to make much suspense and atmosphere from the most basic of set-ups. He also was a good director of actors, as evidenced here with the performances he gets out of Portman (calm, calculated and cunning) and Gynt (a wonderful slinky femme fatale dressed up to the nines). While in conjunction with photographer Dade (Zulu), he puts period Gothic noir tints on proceedings, especially on the exteriors where darkness, shadows and gaslights imbues murky machinations of plot. There’s a big leap of faith required to accept one critical turn of events entering the home straight, but ultimately the finale is not damaged by it, for here a black heart beats strong. Splendid. 8/10",
         "url": "https://www.themoviedb.org/review/52747457760ee35713108794"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Lee Warren",
               "gender": 2,
               "credit_id": "52fe45df9251416c9104154f",
               "name": "Eric Portman",
               "profile_path": "/aNFQIiX4pRPGByJWEvthWuPx7KA.jpg",
               "id": 96994,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Vivien Warren",
               "gender": 1,
               "credit_id": "52fe45df9251416c91041553",
               "name": "Greta Gynt",
               "profile_path": "/gccRQSY1knNrObasbGZHfxsZXXt.jpg",
               "id": 97236,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Richard Fenton",
               "gender": 2,
               "credit_id": "52fe45df9251416c91041557",
               "name": "Dennis Price",
               "profile_path": "/k29Y39ZPSERgbBCsD4b22GwwRNW.jpg",
               "id": 30766,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Insp. Penbury",
               "gender": 2,
               "credit_id": "52fe45df9251416c9104155b",
               "name": "Jack Warner",
               "profile_path": "/8X3laNawVEQN89yCo1DusVSJMi6.jpg",
               "id": 100343,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Jimmy Martin",
               "gender": 2,
               "credit_id": "52fe45df9251416c9104155f",
               "name": "Maxwell Reed",
               "profile_path": "/uPF3XqAOhzFm7Hce4YFbRuUirQ0.jpg",
               "id": 119670,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Avis Fenton",
               "gender": 1,
               "credit_id": "52fe45df9251416c91041563",
               "name": "Hazel Court",
               "profile_path": "/arrnJNt1mJqH7NEwyYr7Mxz0eeY.jpg",
               "id": 101499,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Rita",
               "gender": 1,
               "credit_id": "52fe45df9251416c91041567",
               "name": "Jane Hylton",
               "profile_path": "/wA5uQoOUXNp5i92RiK1eEIRxd3T.jpg",
               "id": 97675,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Sgt. Fox",
               "gender": 2,
               "credit_id": "52fe45df9251416c9104156b",
               "name": "Andrew Crawford",
               "profile_path": null,
               "id": 101721,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Prison Warden",
               "gender": 0,
               "credit_id": "52fe45df9251416c9104156f",
               "name": "Charles Rolfe",
               "profile_path": null,
               "id": 1196677,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Charwoman",
               "gender": 0,
               "credit_id": "52fe45df9251416c91041573",
               "name": "Helene Burls",
               "profile_path": null,
               "id": 1196678,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Hall Porter",
               "gender": 2,
               "credit_id": "52fe45df9251416c91041577",
               "name": "Ernest Butcher",
               "profile_path": "/xbAz2kZ9yfCEosuZEFIqGitomJO.jpg",
               "id": 936929,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "American Secretary",
               "gender": 0,
               "credit_id": "52fe45df9251416c9104157b",
               "name": "Judith Carol",
               "profile_path": null,
               "id": 1196679,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Warren's Secretary",
               "gender": 0,
               "credit_id": "52fe45df9251416c9104157f",
               "name": "Valerie Ward",
               "profile_path": null,
               "id": 1196680,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "52fe45df9251416c91041583",
               "name": "John Blythe",
               "profile_path": null,
               "id": 199070,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe45df9251416c91041587",
               "name": "Howard Douglas",
               "profile_path": null,
               "id": 45250,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45df9251416c9104151b",
               "name": "Arthur Crabtree",
               "profile_path": "/lwJOyPBCvlRLsfBe8SPRgz9fE2L.jpg",
               "id": 103589,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45df9251416c91041521",
               "name": "Muriel Box",
               "profile_path": "/gfkxQzI8r0phXcsJRBFY6SLUULr.jpg",
               "id": 37447,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45df9251416c91041527",
               "name": "Sydney Box",
               "profile_path": null,
               "id": 38061,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45df9251416c9104152d",
               "name": "Peter Rogers",
               "profile_path": null,
               "id": 41828,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45df9251416c91041533",
               "name": "St. John Legh Clowes",
               "profile_path": null,
               "id": 115053,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe45df9251416c91041539",
               "name": "Betty E. Box",
               "profile_path": "/r6QytrjPQtccJbt6EeA2DkaTsAK.jpg",
               "id": 21601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45df9251416c9104153f",
               "name": "Benjamin Frankel",
               "profile_path": null,
               "id": 97450,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45df9251416c91041545",
               "name": "Stephen Dade",
               "profile_path": null,
               "id": 27926,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45df9251416c9104154b",
               "name": "Gordon Hales",
               "profile_path": null,
               "id": 29311,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 1.369993,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 36335,
      "vote_count": 6,
      "budget": 0,
      "overview": "When a man discovers his wife is having an affair, he commits the perfect crime.",
      "similar": [
         539,
         1538,
         6145,
         845,
         136835,
         10795,
         255343,
         21734,
         299,
         397722,
         24150,
         11974,
         381518,
         11462,
         74725,
         38103,
         11657,
         9656,
         67087,
         43461
      ],
      "original_title": "Dear Murderer",
      "runtime": 90,
      "poster_path": "/sUSPVPXrOcWWpLLRJuMqUMRlZGw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Eagle-Lion Films",
         "id": 4927,
         "origin_country": ""
      }],
      "release_date": "1947-06-23",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Arthur Crabtree"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Muriel Box",
         "Sydney Box"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039306/",
      "coverLink": null,
      "actors": [
         "Eric Portman",
         "Greta Gynt",
         "Dennis Price"
      ],
      "reviews": [
         "Dear Murderer (1947) What a fabulous, complicated, feint and double feint movie about murder, attempted and otherwise. It's a very British feeling film, and though it has a film noir darkness (very dark, in my copy), it doesn't have the angularity nor the action of an American noir. More defining, though, is the deliberate parlor game feel to this very deadly situation. You might compare (if comparing is helpful) to the Joan Crawford \"Sudden Fear\" to make this most obvious. There is a lot of sparring with words here, very smartly written, and you have to pay attention as the intentions of the characters seem to be shifting all the time. You have to have the low key, steadfast, opaque, and clever detective of course, and the detective here is brilliantly all those things. And you have to have motive, which we have in abundance. And you need abundance since so much is going to go wrong here. Eric Portman is the key figure through it all, and he plays a jilted husband with laconic brilliance. His wife, and his wife's several lovers, are all excellent in support, each either surpassingly innocent at heart despite their adulteries, or really devious and selfish. It's beautifully constructed, and really a joy. But you have to pay attention. No getting up for popcorn here.",
         "Eric Portman, Greta Gynt, Dennis Price, and Jack Warner star in \"Dear Murderer,\" a 1947 film courtesy of Gainsborough Productions. Portman plays Lee Warren, an Englishman who has to be away for eight months in the U.S. setting up a New York office for his firm. His wife Vivien, who has cheated on him before, promises him she is over all that and will write every day. She keeps it up for a while and then the letters stop. Warren sees a photo of her in a Tattler magazine with one Richard Fenton (Price) and knows she's being unfaithful again. The film actually begins with Warren dropping in on Fenton and announcing that he's going to kill him, and that it will be the perfect crime. Complications ensue, not the least of which is that dear Vivien has another boyfriend as well. Fenton decides to kill two birds with one big stone. Really excellent suspense film with the beautiful Gynt looking incredible in some fabulous clothes, including the gown she wears when we first see her - it would cause a splash at today's Oscar ceremony. Jack Warner, who seems to be always playing a police detective, is here in his familiar role again. A perfect Sunday afternoon movie and if you're a lover of mystery and suspense as I am, you'll enjoy this.",
         "Poor Eric Portman is saddled with a habitually unfaithful wife. He decides to commit the perfect crime, and murder the nasty wife's lover (Dennis Price). Problem is, he soon finds out that little woman has yet another lover. What is our poor, DEAR MURDERER going to do now? This is a perfect English mystery movie for those who love English mystery movies. The murderer is rather sympathetic. The crime is charmingly convoluted -- it might even give Sherlock Holmes a few rough moments. And the Scotland Yard detective is like all Scotland Yard detectives (when not co-starring with some brilliant amateur detective) -- smarter than he looks, visiting his quarry constantly with \"just a few questions, sir.\" Those who are more used to American films might think the pace a bit slow (particularly at the beginning), though this pacing really does pay off with an unexpectedly twisty final reel. If you don't really like old movies, this is not for you. But if you remember being happy when you found that the late show you were about to watch was going to be an English mystery, this will be perfect. Note, though, nothing really stands out about this one. It's all crisply enough acted, with a few noir trappings imported from America for the finale. But ultimately , all it is is a jolly good show, best enjoyed with a crackling fire and some mighty good sherry.",
         "Low budget noir with deep shadows. Greta Gynt is great as the nasal-voiced adulteress. Her tacky furnishings (lampshades like skirts and satin sheets) betray her inner rottenness - spot those coiled serpents on the shoulders of her nightdress! Eric Portman is as brilliant and compelling - and sympathetic - as ever. If you like this, see him in A Canterbuy Tale. xxxxx",
         "A day or so ago I commented on the film (made only a few years after wards) that somehow resembles this one: FOOTSTEPS IN THE FOG. The basic story is of two ill-matched people who are in a marriage from hell. FOOTSTEPS was about a Victorian gentleman who murders his first wife, only to be blackmailed into marrying his socially ambitious maid, and how he starts conspiring to get rid of her as well. The problem with FOOTSTEPS was a lack of decently spirited direction. It lacked spark and pace, and gets boring. The cast tries, but it does not help enough. Not so with DEAR MURDERER. Unlike FOOTSTEPS (which was a Hollywood product - so it had to be burdened by larger budgets, and needed vervier directing), DEAR MURDERER is typical of the success story of British cinema - how with a concentration on minimal effect their films are sharper than bloated productions like FOOTSTEPS . The plot is also more devious. In FOOTSTEPS Jean Simmons' ambitions help destroy her and Steward Granger. But one can easily understand where she is coming from, as we tend to sympathize with people trying to pull themselves out of lower classes into upper classes. But this is dented because she is a blackmailer (though Granger's misdeed deserves such a punishment). Here, Eric Portman is married to a perpetual flirt (Greta Gynt) who despises him. She has been carrying on with Dennis Price, and Portman decides to kill Price. Yet, even in the process of doing just that, Portman gets to know his victim, and realizes that if he had not been sleeping with his wife Price could have been a good friend of his. So his guilt is increased when he discovers that Gynt and Price had broken up their relationship shortly before the murder. See: the story is still melodramatic, but the characterization is more interesting. So is the difference regarding Gynt's personae, as opposed to her opposite number in FOOTSTEPS. Simmons is socially ambitions, but the audience can accept that. Gynt is sluttish and also unlikeable. She is tired about the marriage to Portman (who does, misguidedly, love Gynt), and eventually wonders how she can end it - quickly. The film speeds to it's conclusion. If one dislikes Portman's Nazi in 49TH PARALLEL (his best remembered performance), his performance here certainly makes up for his totally unsympathetic villainy there. I have no problem recommending this film to the readers of these reviews. And of recommending it over FOOTSTEP IN THE FOG to them as well.",
         "\"Dear Murderer\" is a short, very intriguing British mystery that caught my interest by its title. After a long work-related trip, Eric Portman comes home to find his wife not home. But, in fact we find out real quick that he knows a lot more than that and he's intent on killing the other fellow, played by Dennis Price. Greta Gynt is the unfaithful wife. But then there's a twist; Eric soon finds out there's more than one. He can't kill them all, Dennis says. But Eric finds a way to pin the murder on the other other fellow. All these convoluted schemes made for a very complicated but absorbing mess. I liked this very much with its layered plots developing more and more as it went along, but, by the end, the viewer really has very few people to feel any compassion for and therefore it feels a bit mean-spirited and/or downbeat. But the irony of the unexpected, Eric Portman's acting, and his character's egotistical disposition make up for any flaws this film may have. Sit back for a very perverse experience of the British kind.",
         "Dear Murderer is directed by Arthur Crabtree and collectively adapted to screenplay by Muriel Box, Sydney Box and Peter Rogers from the play by St. John Leigh Clowes. It stars Eric Portman, Greta Gynt, Dennis Price, Maxwell Reed, Jack Warner, Hazel Court and Jane Hylton. Out of Gainsborough Pictures, music is by Benjamin Frankel and cinematography by Stephen Dade. Lee Warren (Portman), consumed by jealousy over his wife's unfaithfulness, believes he has executed the perfect murder, however, he hadn't bargained on another one of his wife's lovers entering the fray. But sensing a great opportunity to kill two birds with one stone, he executes another cunning plan\u0085 Perhaps he's Adolf Hitler in disguise? He's about the right height. A wonderfully twisty British thriller, Dear Murderer enjoys giving off a whiff of unpleasantness as it enthrals from the get go. Classic Brit staples are in place for this type of thriller, a vengeful man, harlot woman, intrepid copper and male suitors caught in a trap. Construction is as such, that it's initially hard to actually get on side with any of the principal characters, but one of the film's many delights is in how it constantly alters the trajectory of sympathy towards the actual murderer! It helps as well that the story doesn't rest on its laurels, this is not merely about one murder, and about one man trying to get away with that murder, it's about more than that. There's a lot of talking going on, but it's all relevant to actions that are soon to follow, so when the flip-flops arrive, we are fully prepared and immersed in the devilish goings on. Arthur Crabtree (Madonna of the Seven Moons) is something of an unsung director from the British classic era, where often he has been termed workmanlike and steady. Yet he was able to make much suspense and atmosphere from the most basic of set-ups. He also was a good director of actors, as evidenced here with the performances he gets out of Portman (calm, calculated and cunning) and Gynt (a wonderful slinky femme fatale dressed up to the nines). While in conjunction with photographer Dade (Zulu), he puts period Gothic noir tints on proceedings, especially on the exteriors where darkness, shadows and gaslights imbues murky machinations of plot. There's a big leap of faith required to accept one critical turn of events entering the home straight, but ultimately the finale is not damaged by it, for here a black heart beats strong. Splendid. 8/10",
         "Very slow moving, but still compelling, worth sticking with till the bitter end, if only to see how it all pans out. Lee finds out his wife is having an affair, so he kills the man, and sets it up to look like a suicide. Only problem is, his wife has stopped having an affair with that man, and moved onto a new affair! Greta Gynt, looking a lot like Gene Tierney, is great, as are Hazel Court and Andrew Crawford, whose parts were unfortunately very small. If you're getting bored, take heed that the movie does pick up an awful lot in the last quarter! 7/10",
         "I happened across this movie on Netflix and, due to my love of noir films and its 94-minute running time, I decided to give it a try. I was pleasantly surprised by how much I enjoyed this. The plot set-up is fairly simple: a wealthy British businessman returns home early from a business trip to America, discovers evidence that his younger, seemingly devoted wife has been stepping out on him, and decides to get his revenge. That's where the fun begins. His seemingly foolproof plan doesn't quite go exactly as he thought, which is the case in a lot of movies like this. What separated this movie, though, was that even as the husband's plan began to lose its original shape, what he was able to mold it into became even more diabolical than it was at first intended. Although all of the cast does a decent job in their assigned roles, it's really the lead roles of the husband and wife played by Eric Portman and Greta Gynt, that deserve special mention. Both play their parts quite well, Portman as the well-spoken, egotistical husband, and Gynt as the manipulative, philandering wife. I especially enjoyed watching Gynt's character, who plays the role of the femme fatale here as a treacherous vixen who could stand alongside noir's best. In certain movies where wives seek the affections of someone other than their respective mate, they're portrayed as a character who just desires attention from an emotionally distant husband, or one who is either emotionally or physically abused at the hands of a domineering brute. Here, however, she is a truly terrible person, and some of the reactions she gives when hearing information that would normally be very troubling to a person is pretty fascinating. I don't want to build this movie up as anything more than it is, an enjoyable hour-and-a-half of a formula most of us have seen before, but check this one out on a rainy day when you don't feel like going outside. You might find that it's a bit better than you'd expected.",
         "Would you really do anything for the one you love? She's beautiful, your wife and you've just found out that she's been having an affair while you've been away. You've come up with an idea of the \"perfect murder\". It's going to plan... or is it? This is a really clever plot, you the murderer are getting a two for one deal because you've just found out your wife has been two timing her lover. The police will never suspect you or if they do what are the chances of proving that you did it. There is a great sub-plot which I never saw coming; my evil mind was not focused.",
         "*Possible Spoilers* A successful businessman called Lee Warren (Eric Portman) arrives home from a business trip in New York and discovers that his wife Vivien (Greta Gynt) has been having an affair with the barrister Richard Fenton (Dennis Price). Insanely jealous, Warren confronts Fenton and forces him to write a letter to Vivien terminating the affair before killing him by putting his head in the gas oven and arranging it to look like suicide. But, immediately afterwards, Warren learns that the affair had been over for sometime and his bid to make his crime appear to be suicide on account of that will seem ludicrous to the police. Vivien is a habitually unfaithful wife, however, and quickly found a new lover in Jimmy Martin (Maxwell Reed) so Warren frames him for the crime - killing two birds with one stone, you might say - removing suspicion from himself and getting rid of his wife's latest fancy man. Inspector Pembury (Jack Warner) promptly arrests Martin for the murder, but Vivien begs her husband to intercede on his behalf promising to be loyal to him from now on. Warren, an extremely intelligent and cunning man, devises a scheme to exonerate Martin and divert suspicion away from himself, but Pembury believes that Warren is the real killer only he cannot make anything stick against him unlike Martin who is awaiting trial and would likely be found guilty and face the gallows. However, Warren proves to be too clever for his own good when he underestimates his wife who, apart from being unfaithful is also extremely despising and devious, turns his own ingenious murder method against him. But, will a twist of fate also see her come unstuck? Elegantly mounted Gainsborough-produced murder thriller, which features a clever plot that succeeds in sustaining an audience's interest from beginning to end even though it does betray its stage origins from time to time. The screenplay co-authored by producer and executive producers Betty Box and Sidney Box and Peter Rogers (who would later produce the Carry On series) is well structured and enables the film's director, Arthur Crabtree, to generate some edge of seat suspense as we know that Eric Portman will eventually come unstuck, but we can never quite figure out how and the denouement when it comes is sufficiently satisfying and what has been a good build up hasn't lead to a big let down as too often happens in thrillers. Eric Portman has fun in the leading role as the husband displaying his character's pathological jealously as well as his arrogance and cunning with considerable gusto. Meanwhile, Greta Gynt offers a good performance as his unfaithful, despising but equally cunning wife who brings about his downfall as well as her own. She provides a vivid essay of a sociopath and the look on her face when she learns of Fenton's death and delights in the fact that she believes he committed suicide for her is priceless. It cannot be said that Portman and Gynt offer realistic portrayals as a couple trapped in a marriage from hell, however, since they are both over the top, but they sure are fun! The rest of the cast is no less impressive with Maxwell Reed, who is best known today because he was once married to Joan Collins, offering a better performance than one usually associates with him - he was often inclined to woodenness - as Gynt's lover accused of murder and Jack Warner offers the first of many portrayals as a police inspector, something that would bring him great fame as Dixon of Dock Green. The film benefits from the b/w cinematography of Stephen Dade, which gives the production a noirish feel that suits this kind of plot very well and a good sense of atmosphere and place as well.",
         "What a glorious mess of jealousy, infidelity, murder and aborted intrigue! But with what stylishness all this advanced and intelligent cruelty is worked out! I have never seen Eric Portman in a sympathetic character, more often than not he has been an almost unilaterally determined murderer and nothing else, and this time he is married to the overly beautiful Greta Gynt. Of course he must love her with a passion which makes it impossible for him to live without her, but how little he knows her! You must not trifle with lovely women,for their beauty will always give them the upper hand on you, and you will be helpless. For all his intelligence and perfect scheming, Portman commits the one mistake of actually believing that his wife loves him when she tells him so, and of course she does, but in her own way. In fact, Portman in all his brilliant superiority of intelligent calculation is the only one who commits mistakes, and he does it all the time and doesn't even notice it, deluded as he is by his own self-confidence and trust in his own perfection, which is hopelessly hollow. Dennis Price as usual makes a brilliant appearance, although unwillingly awkward, while Greta Gynt is the main attraction of this extremely intellectually stimulating play. It's impossible to guess the outcome, and when the desperate chess love game is finished and everyone beaten, only Greta Gynt remains and makes her exit with a hearty laugh. Well, for a lovely woman like her with all those lovers and cavaliers, victims and wrecks, she is superior enough to detach herself from her own tragedy with a laugh. Murder is no laughing matter, and Dennis Price for one understands that too well, while all the others... Anyway, Greta Gynt definitely has the last laugh.",
         "This is a gloomy British film noir made just after the War, starring Eric Portman as a wronged husband intent upon revenge. He has been away in America for 8 months on business, but during that time he came to realize that his wife was being unfaithful and going around with another man back in London. He returns without notifying her and sets about his meticulously planned campaign of murdering her lover by means of what he calls 'the perfect murder'. The film is based upon a play of the same title by St. John Legh Clowes. It was filmed twice for television, firstly for the BBC in 1949, and secondly in 1957 for the Armchair Theatre series on the ITV network. The playwright turned it into a novel, and that was filmed in 1972 as a German TV movie entitled GELIEBTER MOERDER. It is rather a sinister tale, and I marvel at its popularity. In this first filming of the story, Portman's wife is played by Greta Gynt. She is excellent as a totally narcissistic and faithless femme fatale, of the most disgusting kind. When she is told that a man has committed suicide over her, the camera closes on her face as we see her thrilled and gloating at the news, and she says to herself excitedly: 'He killed himself for me!' Dennis Price, in his best arch and snobbish manner, plays the lover who is murdered by Portman. But Portman discovers that the murder was pointless, because his wife has already dropped Price and taken up with another man played by Maxwell Reed. There are many twists and turns, much duplicity, lying, and deception, and several false stories. Through all of this the study police inspector played by Jack Warner does not believe anybody and knows something is fishy with all their stories. It would all be very fascinating if the people were not all so horrible and the events so very repulsive. Arthur Crabtree did a very good job of directing, and he uses a great deal of darkness in his shots to underline the awful gloom.",
         "\"Dear Murderer\" starts off very well but the writer just couldn't leave well enough alone. It all begins with a husband confronting his wife's lover and announcing he's going to kill him. This is after he's gotten the man to write a letter that might be seen as a suicide note--then he kills him. In the meantime, the wife and her OTHER lover come into the apartment where the man is about to die--and the husband is hiding. The pair leave--and the husband slip away--leaving the first lover to die. So far, so very good. I liked seeing the husband concoct this intricate murder. BUT, then the film does nothing with this. He does NOT kill the cheating wife but goes so far as to tell her what he's done! And, when she pretends to profess her only love to her husband, he believes it and tries to extricate the second lover--who the police have accused for the first killing. Now think about it--the husband is brilliant and plans the killing. Yet, inexplicably, he then tells his wife the plan and tries to help out the other lover. Why?! Then, in the end, he walks right into the EXACT same killing he committed as the film began. Can a guy be THAT stupid?! No...nor can the audience. I am sure folks at the time felt cheated, as the main idea hooked them--only to see it all fizzle because the writer kept 'over-writing' it. In other words, they wouldn't leave the plot alone and let it play out--and included too many twists--none of which were believable. All in all, a great story idea that went NO WHERE! It's a frustrating film and wish I haven't even bothered. Badly written and desperately in need of a re-write.",
         "ERIC PORTMAN finds his wife has been cheating on him and decides to commit the perfect murder by doing away with her lover (DENNIS PRICE). Sound familiar? Of course, it does. It's been done so many times before and usually more effectively. At least Portman does a commendable job in an unlikeable characterization and his wife (GRETA GYNT) is a sly and cunning female of the type you'd expect in this kind of crime melodrama. She's rather smitten with one of her suitors (MAXWELL REED) and her loyalty to him causes her downfall when she tries to outfox her husband. It's slow moving and obviously based on a stage play with most of the action confined to a few sets with lots of stage dialog. The director lets the pace lag considerably and never speeds things up for what is supposed to be a surprise ending. Anyone looking for a tense crime of passion will be disappointed. It ambles along at its own slow pace, but most viewers will want to see how it all ends. Should have been a lot more suspenseful.",
         "The 'perfect crime' novel, play, film became so ubiquitous that audiences tended to judge them on how credible the 'flaw' that proved the murderer's undoing and in this case it would struggle to rate three out of ten. Director Arthur Crabtree began behind the camera where he had credits on the like of Waterloo Road; he never really made it as a director but this effort begins well enough, boldly even for the time, because we are not told where Eric Portman has been prior to his entering his (we assume) flat, discovering several business cards signed Love Always and decides to confront and kill the sender. Only then does Portman reveal to Dennis Price that he has been in America for six months thus leaving Price clear to bed Portman's wife, Greta Gynt. He cons Price into writing a letter to Gynt that we - seasoned viewers of 'perfect crime' movies - spot as a suicide note, then coolly offs Price but before he can leave Gynt (who has a key, comes in with new lover, Maxwell Reed. This gives Portman a chance to frame Price for the crime and the 'flaw' comes when Gynt tells Portman she has loved him all along and begs him to clear Price without, of course, incriminating himself. HE AGREES. Yeah, you heard; a man who has found incriminating evidence of one lover (Price) and has had it confirmed by Price himself, then sees and hears with his own eyes and ears how Gynt behaves with a second lover, BELIEVES he pathetic story. There is absolutely no chemistry between Gynt and any of the three men (though to be fair we never see her with Price), Reed is as wooden as always and Jack Warner walks through the detective role, possibly mistaking it for the one he played in It Always Rains On Sunday that same year. On a Saturday night in 1947 at the local Odean this would have been perfectly acceptable. Sixty years on it leaves something to be desired.",
         "Little has been done to breathe cinematic life into this perfect murder stage play. Main problem is that none of the main characters are likable or very interesting. The person I was most interested in was Jane Hylton as the maid. She seemed to have far more going on beneath her servant exterior than anything anyone else managed to muster, (but lesser characters often do intrigue me.) Eric Portman does a decent turn as the cold, reptilian villain, and Greta Gynt (with ludicrous period hair-do and frocks) exudes ice as his missus. It's always good to see Dennis Price, and Jack Warner walks through his part as the detective. I was mildly amused by Maxwell Reed's height. He towered over everyone else - must have been a chore composing some of the shots. The editing is nicely judged, but there's a (perhaps typically British) tendency to shy away from an intimate clinches. Maybe it was a censorship thing, but no-one seems to be allowed to have a decent snog.",
         "A husband discovers his wife has been cheating on him and concocts a way to murder her lover... Every thing is good so far...up to the point of the murder when his wife and her new second boyfriend walk unexpectedly into the apartment where the murder is to take place. This should provide all kinds of interesting possibilities, instead it just gets dumb. The husband tells his wife about the murder....then tells the police some stupid story to try and get the second boyfriend off (he has been charged with the murder). Non of it is convincing suspenseful believable or anything other than boring. We see the final murder way before it happens...but by this time you don't really care about anything except to invest a little more time to see how it turns out. There are so many better films from this era this will disappoint guaranteed. Try Hollow Victory.",
         "The opening was one of the longest \"prepare to die\" speeches I have ever seen. Twenty minutes. Suave, cuckolded Eric Portman, visits then subdues his rival. Next, he tells how he learned of the man's bush brushing while he was overseas, and how he intends to kill him. Afterward, he spends another five minutes doing the deed and scattering the false trail. Then all the steam escapes, and the plot plods into police procedural. Turns out, hot, cheating wife (Greta Gynt) has a history of running around. She's already lined up her next man snack. Her husband needs roller skates to snuff everyone grazing her grass. Nice lighting, lot of Noir touches, though this is very much in the British mystery vein. Alright, at best. Dull and disappointing at worst.",
         "It was going good but then it just gets stupid. Why would he tell his wife what he did?? Why would he keep trying to kill/frame her lovers instead of killing her!! And what a horrible ending!!! How could that ring possibly connect her to the murder? Couldn't the husband have found the ring somehow and dropped it before killing himself? Finding a ring like that would be a good reason to. But I have no clue how that at all incriminates her. Just rubbish, smh. I would also like to point out that I watch a ton of old movies and they almost always have a pretty girl playing the main role. But this lady who plays the wife is anything but attractive. Of course that could be b/c she plays the part of a monster so they didn't want a good looking lady but she didn't have to be that ugly. Now the young girl who plays the sister on the other hand is very pretty. :) In conclusion, this movie is an epic waste of time and \"could\" have been good had they stopped it at the 32 minute mark.",
         "Hubby comes home unannounced from long stay in the colonies and discovers his wife has been up to hanky panky with a younger, more attractive, taller guy. He kills him & makes it look like suicide. He tells his wife but she can't go to the cops cause the plot is convoluted. Meanwhile the dead guys sister gets mixed up in this pot-boiler thru more twists & turns than a drive on the Amalfi coast. Then hubby finds out the wife was about to dump the guy he killed for yet someone else, which ticks him off even more. It looks as if his wife simply can not be trusted. Drat! The police are closing in now and so the wife has to kill her husband but the maid leaves the theatre tickets on the hall table and the tables turn and the cops get the real break to wrap up this gnarly situation so that crime doesn't pay. The End."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Gainsborough Pictures"],
      "summaries": ["When successful business man Lee Warren suspects his wife is having an affair, he sets out find her lover, kill him, and make it look like suicide. Complications set in, when he finds out she has another lover as well, so Lee has to change his plans."],
      "budget": 0
   },
   "movielensId": 131431,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-06-23",
      "dvdReleaseDate": null,
      "directors": ["Arthur Crabtree"],
      "runtime": 90,
      "movieId": 131431,
      "title": "Dear Murderer",
      "mpaa": "",
      "actors": [
         "Eric Portman",
         "Greta Gynt",
         "Dennis Price",
         "Jack Warner",
         "Maxwell Reed",
         "Hazel Court",
         "Jane Hylton",
         "Andrew Crawford",
         "Charles Rolfe",
         "Helene Burls",
         "Ernest Butcher",
         "Judith Carol",
         "Valerie Ward",
         "John Blythe",
         "Howard Douglas"
      ],
      "imdbMovieId": "0039306",
      "originalTitle": "Dear Murderer",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "When a man discovers his wife is having an affair, he commits the perfect crime.",
      "tmdbMovieId": 36335,
      "avgRating": 3,
      "releaseYear": "1947",
      "numRatings": 2,
      "posterPath": "/sUSPVPXrOcWWpLLRJuMqUMRlZGw.jpg"
   }
}