{
   "tmdb": {
      "original_language": "tr",
      "keywords": [{
         "name": "parent child relationship",
         "id": 970
      }],
      "imdb_id": "tt1370212",
      "video": false,
      "title": "My Only Sunshine",
      "recommendations": [107889],
      "backdrop_path": "/pVddF3dPckyHDNASKcaIYHc6eGS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Polis (as Onder Acikbas)",
               "gender": 0,
               "credit_id": "52fe46579251416c910515b3",
               "name": "Önder K. Açikbas",
               "profile_path": null,
               "id": 233115,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Baba",
               "gender": 2,
               "credit_id": "52fe46579251416c910515b7",
               "name": "Erdal Besikçioglu",
               "profile_path": "/fkjSn9smg1JcWKSf4iesEbgTiZ7.jpg",
               "id": 130399,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "3. Genc Oglan",
               "gender": 0,
               "credit_id": "52fe46579251416c910515bb",
               "name": "Halim Ercan",
               "profile_path": null,
               "id": 233116,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46579251416c910515af",
               "name": "Reha Erdem",
               "profile_path": "/gMgeXYQ6IkBznPfJSaKly7JMP5d.jpg",
               "id": 46054,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "59bfce969251414750016aaf",
               "name": "Reha Erdem",
               "profile_path": "/gMgeXYQ6IkBznPfJSaKly7JMP5d.jpg",
               "id": 46054,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.803835,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 37573,
      "vote_count": 8,
      "budget": 0,
      "overview": "Hayat, her father and bedridden grandfather live in a riverside shack near the dangerously dark but breathtakingly beautiful waters of the Bosphorus. Hayat's father owns a small boat that secures the family's survival through a miscellany of not always lawful ventures. Beyond the motion and romance of the water, Hayat's life is harsh and unrelenting. But Hayat has an instinct for survival. Her capacity for courage, endurance and hope in the face of these trials suggest that there is Life despite the manifold injustices of an unjust world.",
      "similar": [
         334,
         11631,
         2539,
         8272,
         393,
         8967,
         2288,
         4347,
         69,
         88,
         1164,
         2024,
         401,
         745,
         773,
         858,
         13,
         111,
         142,
         112160
      ],
      "original_title": "Hayat Var",
      "runtime": 121,
      "poster_path": "/jH0wR3iDmNIhL55vib6lIno5OYT.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Türkçe",
            "iso_639_1": "tr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Imaj",
            "id": 27104,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Atlantik Film",
            "id": 5901,
            "origin_country": ""
         }
      ],
      "release_date": "2009-03-05",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Portrait of a lost childhood.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Reha Erdem"],
      "runtime": 121,
      "synopsis": null,
      "writers": ["Reha Erdem"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt1370212/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTdiNTdkN2EtZDE3ZC00ZjE3LWJmOWYtNzE5MGFjODBjYjBhXkEyXkFqcGdeQXVyMjExNjgyMTc@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Elit Iscan",
         "Erdal Besikçioglu",
         "Levent Yilmaz"
      ],
      "reviews": [
         "\"Hayat Var\" means \"There is Life\" in Turkish. The director seems to have made a word game by choosing such a title for its movie. The main character, Hayat, is a teenager stepping into adolescence in a depressing and morally damaged social environment in one of the most marginalised and equally forgotten quarters of the metropolitan city of Istanbul. The environment in question is depressing in its very limited vision of a decent life in terms of both material prospects and social networks.It is morally damaged in the sense that its inhabitants lead the viewers to the opinion that a collectively shared and regulator social environment simply does not exist and the members of this environment does not reflect any behaviour of social norms and integrity.Just like the extremely individualised segments of a modern society, the director's view of the movie's habitat is comprised of \"loser\" individuals fragmented into pieces and destined to be disregarded in the face of rapid social and economic transformation in the core, the metropolitan Istanbul. Rather than focus on the dichotomy of the core versus periphery, the director has devoted his time to remain focused within the context of periphery.This is a very ambitious and determined approach bearing the risk of failing to represent periphery accurately and consequently turning the movie into a movie of orientalism- the act of misunderstanding the lives of what lie behind the curtains of periphery.I congratulate Erdem for his bold handling of periphery and provocative method of drawing the attention of Turkish public in the controversial concepts of Turkish society such as gender codes, sexuality and social fabric largely defined through religious and kinship bonds. The movie is a black representation of a very big Istanbul. The viewers will probably see for the first time very original views of both the Bosphorus and the peripheral Istanbul continuously. The modernized and prosperous quarters of the city can only been viewed in the movie as details far away from the original platform- the riverbanks of a district lying on the Asian shores of Istanbul. Continuously, the Bosphorus appears on the screen through great and ugly sea vessels with their hidden agenda ( Smuggling, sex trade etc.) Hayat is a \"loser\" girl.Unlike her name's meaning full of energy and zest, she is destined to lose from the beginning. As the only child of a broken family, she is given no other option other than try to survive within a \"family\" of a smuggler father oriented to the random and casual sexual encounters with the same sex, an old grandfather suffering from asthma and confined to a miserable bed.Hayat's mother enters into Hayat's life from time to time as she is already married with a baby to a policeman. Leading the viewers to feel that her existence was reduced to a \" exist or not .no problems\" situation, the director surprisingly gives no great level of reaction for the main character. Hayat does not speak a lot, nor does she weep for her \"life\" in abysmal conditions.She is forced to take care of an old man that hates his own son and spends much of her time in the confines of a shabby wooden house by the riverside.As there is no social regulators defining both the intra-family interaction and social network, she shows poor record of expressing herself amongst both her peers at school and towards her teacher and the headmaster. Sliding into social degeneration and moral corruption, Hayat is challenged by several factors: her abuse in the hands of two mature people- a shopkeeper man with pedophilia tendencies and a nextdoor neighbor woman who systematically abuses her.She does not resist towards this constant double abuse.Instead, she seems to have accepted the faith written for her. In my opinion, the director has succeeded in probing into the interrupting issues such as child abuse, broken families and marginalization in periphery remarkably.Rather than dramatize the situation befalling Hayat, he calls for viewer's attention on these thorny issues with care.The use of colors, nature and tarnished quarters of the city helped me see a different Istanbul that \"exists\" in the door gates of the center.Regarding the music, the famous Turkish Orhan Gencebay's several songs are injected into the different scenes of the movie from the beginning to the end. If your aim is to get \"pleasure\", the movie will get you nothing except for frustration and humiliation.However, if your objective is to see with your own eyes how a talented director evolves and enriches Turkish movie industry, then you must \"see\" it.",
         "Reha Erdem's \"Korkuyorum Anne\" is one of my favorite all time local films. Where that was brash and loud, \"Hayat Var\" is a slow placed and reflective piece reminiscent of Erdem previous effort \"Bes Vakit\". Hayat is a pubescent girl who lives with her disconnected father and nagging grandfather in a modest home by a waterway. Her father is a \"fisherman\" who in fact, engages in small time smuggling and delivering prostitutes to ships on the Bosporus. Her mother who had left her father while he was doing military service, has now remarried. Hayat is lonely, her only real companion is a stuffed toy which plays \"My only sunshine\" at the push of a button. The irony is that Hayat despite her name ,seems to have missed out on life (ie. \"hayat\"). This is exemplified by the potent scene where she steals a pacifier, almost as if to re-live her infant days. The story is told entirely from Hayat's perspective;the camera almost never leaves her, except to show us her father's escapades on his boat from a distance. The film is anchored by a wonderfully natural and confident performance by Elit Iscan. You feel sad for her most of the time and euphoric at the end when she breaks free and finally experiences happiness. This is a simple yet very effective film. Highly recommended.",
         "The film successfully captures the handicaps and dangers of growing up in a poor neighborhood and the inner world of a teenager girl (Hayat, meaning \"life\" in Turkish) who learns how to strive and defend against all threats all by herself. Hayat has no choice but to grow up fast, sadly having no joys of a childhood. She is introvert, and lacking communications makes her disliked by her teachers and she does not seem to have any real friends. In one scene, she bribes the kids at school, in the hopes of being liked and accepted by them. Letting go is so easy but yet she keeps the hope for a better day. I think that the \"arabesque\" songs by Orhan Gencebay were a good choice for this film. Besides Director Reha Erdem, young talent Elit İşcan (Hayat) deserves a lot of credit for this successful movie and I hope we will be seeing her in other successful work in future."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Atlantik Film",
         "Imaj"
      ],
      "summaries": ["Hayat, her father and bedridden grandfather live in a riverside shack near the dangerously dark but breathtakingly beautiful waters of the Bosphorus. Hayat's father owns a small boat that secures the family's survival through a miscellany of not always lawful ventures. Beyond the motion and romance of the water, Hayat's life is harsh and unrelenting. But Hayat has an instinct for survival. Her capacity for courage, endurance and hope in the face of these trials suggest that there is Life despite the manifold injustices of an unjust world."],
      "budget": 0
   },
   "movielensId": 131550,
   "movielens": {
      "languages": [
         "English",
         "Türkçe"
      ],
      "releaseDate": "2009-03-05",
      "dvdReleaseDate": null,
      "directors": ["Reha Erdem"],
      "runtime": 121,
      "movieId": 131550,
      "title": "My Only Sunshine",
      "mpaa": null,
      "actors": [
         "Önder K. Açikbas",
         "Erdal Besikçioglu",
         "Halim Ercan"
      ],
      "imdbMovieId": "1370212",
      "originalTitle": "Hayat Var",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Hayat, her father and bedridden grandfather live in a riverside shack near the dangerously dark but breathtakingly beautiful waters of the Bosphorus. Hayat's father owns a small boat that secures the family's survival through a miscellany of not always lawful ventures. Beyond the motion and romance of the water, Hayat's life is harsh and unrelenting. But Hayat has an instinct for survival. Her capacity for courage, endurance and hope in the face of these trials suggest that there is Life despite the manifold injustices of an unjust world.",
      "tmdbMovieId": 37573,
      "avgRating": 3.5,
      "releaseYear": "2009",
      "numRatings": 5,
      "posterPath": "/jH0wR3iDmNIhL55vib6lIno5OYT.jpg"
   }
}