{
   "tmdb": {
      "original_language": "tr",
      "keywords": [],
      "imdb_id": "tt1558877",
      "video": false,
      "title": "Vavien",
      "recommendations": [
         110028,
         52154,
         31415,
         34529,
         110031,
         110029,
         83567,
         53206,
         80841,
         111795,
         89111,
         38614,
         110033,
         103785,
         331126,
         157570,
         111799,
         110040,
         69319,
         31401
      ],
      "backdrop_path": "/ymCOPeLWLI4WxVWRLhpO7tNujDy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Celal",
               "gender": 2,
               "credit_id": "52fe45c49251416c9103dab7",
               "name": "Engin Günaydın",
               "profile_path": "/2sjxm7UmWgQ2r6ioxad3WGIxDPX.jpg",
               "id": 115011,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sevilay",
               "gender": 0,
               "credit_id": "52fe45c49251416c9103dabb",
               "name": "Binnur Kaya",
               "profile_path": "/euS1ktemToz135lgmFSd6nFmuiR.jpg",
               "id": 115012,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Cemal",
               "gender": 2,
               "credit_id": "52fe45c49251416c9103dabf",
               "name": "Settar Tanriogen",
               "profile_path": "/40OH0APpX3CL9N08QQ4AIluiYUl.jpg",
               "id": 40024,
               "order": 2
            },
            {
               "cast_id": 21,
               "character": "Televizyoncu Sabri",
               "gender": 2,
               "credit_id": "570bbcf69251415248001f06",
               "name": "İlker Aksum",
               "profile_path": "/xc41a9VvIt8b6JU89HsPtPTyc5b.jpg",
               "id": 556113,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "Vekil",
               "gender": 0,
               "credit_id": "5a4f6e86c3a3683bbc00c97e",
               "name": "Serra Yılmaz",
               "profile_path": "/8UmVF11zH68DQSeK8Nsie9O4ZBc.jpg",
               "id": 1042718,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Sibel Ceylan",
               "gender": 0,
               "credit_id": "570bbdaec3a3684b5000035c",
               "name": "Günes Berberoglu",
               "profile_path": null,
               "id": 1604334,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Huseyin",
               "gender": 0,
               "credit_id": "570bbdcac3a3680fc2007d55",
               "name": "Tolga Coskun",
               "profile_path": null,
               "id": 1467517,
               "order": 6
            },
            {
               "cast_id": 25,
               "character": "Süleyman",
               "gender": 2,
               "credit_id": "5a4f6ea3c3a3683bbc00c99f",
               "name": "Ercan Kesal",
               "profile_path": "/zWOX8jIJZ8Kanz6XgbBKgs3dhWF.jpg",
               "id": 87224,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Hanife",
               "gender": 0,
               "credit_id": "5a4f6eb30e0a26577400cc4a",
               "name": "Binnaz Ekren",
               "profile_path": null,
               "id": 1669672,
               "order": 8
            },
            {
               "cast_id": 27,
               "character": "Seyfi",
               "gender": 0,
               "credit_id": "5a4f6ebec3a3683bb700d4bf",
               "name": "Şinasi Yurtsever",
               "profile_path": "/eKGn13cyU73QYUcrdbzQH2tLFEa.jpg",
               "id": 1156337,
               "order": 9
            },
            {
               "cast_id": 28,
               "character": "Terzi Fahri",
               "gender": 0,
               "credit_id": "5a4f6ecfc3a3683ba900b4cb",
               "name": "Tayfun Sav",
               "profile_path": null,
               "id": 1159711,
               "order": 10
            },
            {
               "cast_id": 29,
               "character": "Mesut",
               "gender": 0,
               "credit_id": "5a4f6edb0e0a26576b00c8da",
               "name": "Nedim Suri",
               "profile_path": null,
               "id": 1954271,
               "order": 11
            },
            {
               "cast_id": 30,
               "character": "Bold Guy in Disco",
               "gender": 0,
               "credit_id": "5a4f6eeac3a3683ba900b4e4",
               "name": "Serkan Keskin",
               "profile_path": "/oXQJIB5XU0k4R257mHE3HZnqfqa.jpg",
               "id": 72154,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c49251416c9103daad",
               "name": "Durul Taylan",
               "profile_path": null,
               "id": 115009,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c49251416c9103dab3",
               "name": "Yagmur Taylan",
               "profile_path": null,
               "id": 115010,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c49251416c9103dac5",
               "name": "Engin Günaydın",
               "profile_path": "/2sjxm7UmWgQ2r6ioxad3WGIxDPX.jpg",
               "id": 115011,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "570bbbdec3a3684f410043e4",
               "name": "Müge Kolat",
               "profile_path": null,
               "id": 1604325,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "570bbca5925141746d0007cb",
               "name": "Erkan Duraklar",
               "profile_path": null,
               "id": 1604331,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "570bbc57c3a3687570007c67",
               "name": "Erim Gayretli",
               "profile_path": null,
               "id": 1604329,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "570bbbedc3a3680ee10036cf",
               "name": "Attila Özdemiroglu",
               "profile_path": null,
               "id": 1325439,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "570bbbfd92514111f200309d",
               "name": "Gökhan Tiryaki",
               "profile_path": null,
               "id": 456963,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "570bbc0cc3a3680ee10036d7",
               "name": "Bora Göksingöl",
               "profile_path": null,
               "id": 1600453,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "570bbc1cc3a3684b50000316",
               "name": "Nimet Atasoy",
               "profile_path": null,
               "id": 572593,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "570bbc2ac3a3680fc2007cfe",
               "name": "Selim Ünel",
               "profile_path": null,
               "id": 572594,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "570bbc399251412c74002911",
               "name": "Çagri Erdogan",
               "profile_path": null,
               "id": 1600454,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "570bbc4892514111f20030ac",
               "name": "Elif Taşçıoğlu",
               "profile_path": null,
               "id": 1578936,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "570bbc6b92514139e80010a6",
               "name": "Bora Suel",
               "profile_path": null,
               "id": 1604330,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "570bbc82c3a3684f4100440a",
               "name": "Burak Balkan",
               "profile_path": null,
               "id": 1603246,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "570bbcb69251417da700417b",
               "name": "Yasar Ozdemir",
               "profile_path": null,
               "id": 1604332,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "570bbcc89251415248001efc",
               "name": "Agce Ulas ",
               "profile_path": null,
               "id": 1446048,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.613348,
      "production_countries": [{
         "iso_3166_1": "TR",
         "name": "Turkey"
      }],
      "id": 35964,
      "vote_count": 11,
      "budget": 0,
      "overview": "Celal, lives an unhappy family life with his wife Sevilay and his child in a small town. Celal and his brother Cemal, running an electrician shop which doesn't go well. They are in debt. The only fun they have is going to the night clubs in Samsun. Celal's love for Sibel Ceylan who works in the night club, will cause him trouble. Celal's wife, Sevilay, saves her money, sent by her father who lives in Germany. She is unaware of the fact that Celal knows her secret.",
      "similar": [],
      "original_title": "Vavien",
      "runtime": 100,
      "poster_path": "/4DNZkBAZguTpZYWltaRP93N2c9b.jpg",
      "spoken_languages": [{
         "name": "Türkçe",
         "iso_639_1": "tr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Imaj Entertainment",
         "id": 75373,
         "origin_country": ""
      }],
      "release_date": "2009-11-18",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Turkey",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Durul Taylan",
         "Yagmur Taylan"
      ],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Engin Günaydin"],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt1558877/",
      "coverLink": null,
      "actors": [
         "Engin Günaydin",
         "Binnur Kaya",
         "Settar Tanriögen"
      ],
      "reviews": [
         "I'm not getting into artsy fartsy cinematic details since sometimes a movie is an entertainment watch. And this one is indeed your money's worth of very entertaining dark comedy from Turkey. It might start a little slow but that is the only criticism here and i only mention it so you know it's going to get better quickly. All together the subtle humour and the sinister plot are very well balanced. The characters are so delightful in their naivety or down right evilness. It all has the classic elements of a solid dark satire: clean-cut characters, secrets that bite them in the ass and surprising plot twists that make you snicker and chuckle in malicious delight.",
         "Vavien is one of the rare (if not the only) dark humor experiences in Turkish cinema. The movie delivers evil in a naive way, just as might be expected from a life in a small town. Surely, the films strongly stands on its excellent cast. However there are some problems with the script. At least, at some point it becomes unclear that what kind of realism the directors wanted to deliver to the viewers (the scene where Sevilay kicks off the door and enters in a very caricature way). Cinematography is nice but the same does not go for the audio. I also think that the soundtrack is not on the strong side neither here. All in all, this is a satisfactory dark humor flick...this is, of course, if you like the genre.",
         "Celal is an unhappy man, living with his wife and son. He lives in a small town, running an electrician shop with his brother. He is not in love with his wife and he is very critical of his son. On the other hand, he is in love with a singer but his love is only one way. His job is not going well and he is really low in cash and needs a lot of money to pay his debts. His wife Sevilay is also an unhappy woman and her only happy times are when Celal shows her a bit of love. She is so desperate to gain Celal's attention and love. However, financially she is well-off as her father in Germany sends her cash every month and she saves her money in the basement without Celal's awareness(that's what she thinks of course). Before the film released, my expectations was sky high due to the fact that the movie has a great cast. To be quite honest, cast delivers a perfect job from a to z. All actors fit into their roles and does not look ridiculous. Maybe only problem would be that their faces are so familiar as they became famous with TV shows. You see Burhan Altintop sometimes for example. Screenplay is quite good as well but I believe that it could have been perfect to play on Sevilay a bit more and make her scary more rather than desperate especially when she returns. That would have made the film a big hit at least for me and I believe most people thinks the same. People wanted to see Sevilay take her revenge on Celal after what he did to her. This would have been big fun to see. Overall, the film is good, as far as I remember there is no other examples in Turkish cinema as subject matter. As the title says it could have been a great hit but with what it is still worth watching.",
         "The bitter facing of the good and the bad.The story is told in a different way. Normally the story line starts with introduction followed by development and then the conclusion. but in this movie this is a little bit different and this makes the movie unique. In this movie the order is like this: introduction, conclusion, development. A short introduction, a ferocious conclusion and a long development. It does not bore or let the viewer down. On the contrary it makes you open your eyes widely and watch it without blinking. The actress Binnur Kaya who appears as the electrician Celal's wife Sevilay performs wonderful scenes. Also Engin Gunaydin shows us how it is to be a bad person without regretting. A breathtaking black humor. And the family with an absolutely diabolical father, with an angel mother and their teenager son who got stuck in between.",
         "I was one of the best films I've watched in a long time. A story of a family living in a small town struggling against the daily life like in classical melodrama. But this one takes the issue in a satiric way and takes a big step into black humor, even into film noir. While doing it never leaves the control of the movie or lose the center. A movie in harmony with all elements; from plot to actors, from cinematography to directing. It was a very pleasant experience for me, I really enjoyed it. A very satisfying movie coming from contemporary Turkish cinema which needs more films like this. In fact every cinema needs films like this.",
         "Taylan Brothers' career, beginning with commercials and TV series, had already found its stylistic maturity even in their second film Küçük Kıyamet. However, this time, we encounter some other elements, a well-written screenplay, superb acting and a perfect provincial setting are woven together masterfully. Vavien also remarks the beginning of a new age for Turkish Cinema. Its revival in mid 90s has proved itself in an artistic level and has been internationally acclaimed in the naughties. Vavien's virtue is combining this maturity with the expectations of the audience. On the other hand, there are some comments about the Coenesque style of the movie. I think those elements mentioned are not enough to talk for an imitation or a pastiche. The idea of getting rid of a wife or a money bag does not solely make a movie Coenesque.",
         "The movie was praised greatly by the Turkish critics at first.. Apparently that was a trick to \"attract audience\". Movie-goers who watched this movie in movie theaters must have soon noticed that this movie was overrated and informed their friends accordingly..This is why the box-office of this \"cheaty trick\" remained so low. Engin Günaydin is good at one thing though: LOOKING & BEING A LOSER probably because he is one. But being a loser and depicting a loser's life in cinema are not enough to make a \"movie\", let alone a good one. Here are the FACTS about this movie: 1- SOUND is awful. Sometimes I failed to understand what they are saying at all (mind you , I'm a native Turkish speaker and I had a DVD in my hand to re-play whenever I feel like it) 2- I am disgusted to see a teenager jerking-off on the screen 3- The script is full of incoherences., starting with the name of the movie. There are many \"what if\"s 4- The man tries to kill his wife and goes unpunished with it? Thanks for the moral lesson Engin Günaydin... We didn't expect anything better from you anyway 5- The woman (who fell off the cliff and presumed 'dead' reappears at the door days and days later. But her face & body is still covering bruises and her clothes are ragged. So are we, the audience, supposed to be so dumb as to buy such a cheap trick when cinema techniques are so sophisticated today? 6- Does anybody understand why (at the end of the movie) the man came to be at peace with his wife (which he had wanted to kill) and his son (which he despised all along the movie) Apparently the Taylan brothers, in an effort to make up a \"happy ending\" just crashed down all the rules of script writing and film making. I personally pity on all those who would like to see this movie on his/her own dime and tries to make sense of it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Imaj Entertainment"],
      "summaries": ["Celal, lives an unhappy family life with his wife Sevilay and his child in a small town. Celal and his brother Cemal, running an electrician shop which doesn't go well. They are in debt. The only fun they have is going to the night clubs in Samsun. Celal's love for Sibel Ceylan who works in the night club, will cause him trouble. Celal's wife, Sevilay, saves her money, sent by her father who lives in Germany. She is unaware of the fact that Celal knows her secret. Living an unhappy life, Celal thinks that this money will be his salvation and makes a plan. He gets an automatic door fixed to his car. He plans to push his wife off the cliff by making it seems like an accident and he plans to possess 75.000 Euros that her wife saves. He carries out his plan but two days after his wife Sevilay comes back unexpectedly. Does she know that the one who pushed her off the cliff was Celal? She can't find the money that she saved through all those years. She wonders if her husband saw the money? Sevilay's questions confuse everybody's minds and causes both Celal and herself to go through many things in their lives."],
      "budget": 0
   },
   "movielensId": 131560,
   "movielens": {
      "languages": ["Türkçe"],
      "releaseDate": "2009-11-18",
      "dvdReleaseDate": null,
      "directors": [
         "Durul Taylan",
         "Yagmur Taylan"
      ],
      "runtime": 100,
      "movieId": 131560,
      "title": "Vavien",
      "mpaa": "",
      "actors": [
         "Engin Günaydın",
         "Binnur Kaya",
         "Settar Tanriogen",
         "İlker Aksum",
         "Serra Yılmaz",
         "Günes Berberoglu",
         "Tolga Coskun",
         "Ercan Kesal",
         "Binnaz Ekren",
         "Şinasi Yurtsever",
         "Tayfun Sav",
         "Nedim Suri",
         "Serkan Keskin"
      ],
      "imdbMovieId": "1558877",
      "originalTitle": "Vavien",
      "genres": [
         "Comedy",
         "Thriller",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Celal, lives an unhappy family life with his wife Sevilay and his child in a small town. Celal and his brother Cemal, running an electrician shop which doesn't go well. They are in debt. The only fun they have is going to the night clubs in Samsun. Celal's love for Sibel Ceylan who works in the night club, will cause him trouble. Celal's wife, Sevilay, saves her money, sent by her father who lives in Germany. She is unaware of the fact that Celal knows her secret.",
      "tmdbMovieId": 35964,
      "avgRating": 3.45455,
      "releaseYear": "2009",
      "numRatings": 11,
      "posterPath": "/4DNZkBAZguTpZYWltaRP93N2c9b.jpg"
   }
}