{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0091173",
      "video": false,
      "title": "Hardbodies 2",
      "recommendations": [
         41301,
         52736
      ],
      "backdrop_path": "/aA9460jE5iTnfRAwzJXI3ALWW4Y.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Logan",
               "gender": 2,
               "credit_id": "52fe4646c3a368484e087c63",
               "name": "James Karen",
               "profile_path": "/1w2g6IbGpDsEnze2QubIGFKlZQt.jpg",
               "id": 14852,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Cookie",
               "gender": 0,
               "credit_id": "52fe4646c3a368484e087c67",
               "name": "Louise Baker",
               "profile_path": null,
               "id": 194429,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Zacherly",
               "gender": 1,
               "credit_id": "52fe4646c3a368484e087c6b",
               "name": "Alba Francesca",
               "profile_path": null,
               "id": 158946,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Brucie",
               "gender": 0,
               "credit_id": "52fe4646c3a368484e087c6f",
               "name": "Alexandros Mylonas",
               "profile_path": "/d1iJSYNec1RhLxefuAx4W3oh4EI.jpg",
               "id": 144462,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Camera Assistant",
               "gender": 0,
               "credit_id": "52fe4646c3a368484e087c73",
               "name": "Robert Rhine",
               "profile_path": null,
               "id": 589864,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Scotty Palmer",
               "gender": 0,
               "credit_id": "52fe4646c3a368484e087c77",
               "name": "Brad Zutaut",
               "profile_path": null,
               "id": 1116553,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Rags",
               "gender": 2,
               "credit_id": "52fe4646c3a368484e087c7b",
               "name": "Sam Temeles",
               "profile_path": null,
               "id": 114881,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sean Kingsley",
               "gender": 0,
               "credit_id": "52fe4646c3a368484e087c7f",
               "name": "Curt Wilmot",
               "profile_path": null,
               "id": 172447,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Fantasy Stewardess",
               "gender": 0,
               "credit_id": "52fe4646c3a368484e087c83",
               "name": "Nana",
               "profile_path": null,
               "id": 1116556,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Morgan",
               "gender": 1,
               "credit_id": "52fe4646c3a368484e087c87",
               "name": "Brenda Bakke",
               "profile_path": "/nhTQaWKjWnTpYvTN1Le8piHTN0w.jpg",
               "id": 32290,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Lana Logan",
               "gender": 1,
               "credit_id": "52fe4646c3a368484e087c8b",
               "name": "Roberta Collins",
               "profile_path": "/px1c3CgpowpXFWKgFRIrnaT5mYM.jpg",
               "id": 74352,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Cleo / Princess",
               "gender": 1,
               "credit_id": "52fe4646c3a368484e087c8f",
               "name": "Fabiana Udenio",
               "profile_path": "/AiAGqf2P9QaMs3UEV2nQLVPjvTM.jpg",
               "id": 13923,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Bodyguard of Stunt Coordinator",
               "gender": 2,
               "credit_id": "52fe4646c3a368484e087c93",
               "name": "Vassili Karis",
               "profile_path": null,
               "id": 139130,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4646c3a368484e087c5f",
            "name": "Mark Griffiths",
            "profile_path": null,
            "id": 106491,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.651149,
      "production_countries": [],
      "id": 61117,
      "vote_count": 10,
      "budget": 0,
      "overview": "A film crew is travelling from America to Greece to produce a movie. Before their work is done they will have to face many unusual situations, along with numerous opportunities for the actresses to take their clothes off.",
      "similar": [],
      "original_title": "Hardbodies 2",
      "runtime": 88,
      "poster_path": "/yVsC0skEGRCGgjfiNRCjZaFDuJK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-09-12",
      "vote_average": 4.1,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Hardbodies Collection",
         "id": 351231,
         "poster_path": null
      },
      "tagline": "It's sun, sand, and sex in the Greek Islands.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mark Griffiths"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Mark Griffiths",
         "Curtis Wilmot"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091173/",
      "coverLink": null,
      "actors": [
         "James Karen",
         "Louise Baker",
         "Alexandros Mylonas"
      ],
      "reviews": [
         "\"Hardbodies 2\" is harmless, aimless and plot less. I would add \"brainless\" to that list, but the movie-within-a-movie gimmick, although not done very well, helps it to narrowly escape that label. The scenery has changed from the California beaches to the Greek islands, and the only returning cast members from the first film are Sorrells Pickard (the bearded guy) and Roberta Collins (who at one point falls into a mud pit, bringing back memories of her classic catfight with Pam Grier in \"The Big Doll House\"). All the other actors are new, but apparently Brad Zutaut is supposed to be playing the same character (Scotty) as Grant Cramer did in \"Hardbodies\". This sequel lacks the energy and appeal of the first movie, and doesn't come close to matching it in the \"hotness\" department, either. Of course Brenda Bakke and Fabiana Udenio are both very pretty, but the Teal Roberts - Cindy Silver - Kristi Somers team is unbeatable. \"Hardbodies 2\" is not the worst of its kind by any means, but if you only want to see one of these movies, the original is the one to get. (*1/2)",
         "I normally consider myself a bit of a tough guy when it comes to enduring bad movies. Somewhat in the way alcoholics build up a tolerance to hard liquor, I have a thick skin against terrible cinema provided there are at least a few redeeming moments. Inspired by nostalgia for late night cable TV, the only way to see nudity and real debauchery as a kid in the '80s, I decided to watch this wreck on an ultra cheap DVD. But it hit me a Mike Tyson (circa 1987) uppercut. I couldn't watch all of it. It's THAT bad. And I can enjoy basically any CANNON GROUP production (horrid cheeseball '80s action producers) ever made! A much better movie that accomplishes somewhat of what they were trying to do here is Summer Lovers featuring a very young Daryl Hannah. Or the original and much better Harbodies. The entire premise of these '80s airhead summer teen sex movies is naked flesh, but at least some of them had a certain level of comedy or sexiness. But nothing here is funny, or particularly sexy. Brenda Bakke is absolutely stunning, but no one gets to do anything worthwhile because the movie is a failure from start to finish. I guess simply admiring her beauty is worth something (and most starlets did not have fake body parts back then, which is very refreshing). But overall, life is too short to watch movies like this. Or review them. Hey wait.....I just wasted.....uhh THE END.",
         "I know what you're thinking...Why did anyone give this movie an 8? Well, the movie isn't your typical jiggle and giggle fest from the 80s. It concerns the cast of a soft core movie filming in Greece and the relationships and comedy that go along with shooting. Brad Zutaut plays the young actor who falls in love with a Greek waitress and persuades her to play his leading lady in the film and in his real life. He already has an annoying fiancé who spends all his money and with holds sex from him. The leading lady is played by one of the most beautiful actresses of the 80s (or anytime for that matter)Fabiana Udenio. She does an excellent job.James Karen makes the most of his role as a cheating film director. If Zutaut looks familiar you may have seen him in L.A. Goddess and Knockouts but most importantly you may know him for his later work. He left acting and went on to become the CEO of Xingtone; a company that makes people able to up load their favorite songs onto their cell phone and not just the stupid top 40 crap they advertise on the tele. He has done the world a great service.When you're watching this film you can tell he's too good for it. He's charming and has great screen presence. I actually liked this film better than the original and that's because of Brad Zutaut. Three cheers for Brad Zutaut. Master thespian! Comic Genius! Man who made it possible for my cell phone to play \"And we danced\" by the Hooters. That alone is reason to give his film an 8! Watch this film if you have an hour and a half free or if you can't find the remote.",
         "A bumbling group of American filmmakers go to Greece to make a cheesy movie. Dashing lead actor Scotty Palmer (a charming performance by Brad Zutaut) falls in love with the lovely and radiant Cleo (a marvelously sweet and personable performance by the strikingly gorgeous Fabiano Udenio of \"Summer School\" fame), a fetching local waitress who's cast as the female star of the flick. Meanwhile the other cast and crew members fumble and stumble their way through the chaotic shooting of the picture. Director/co-writer Mark Griffiths relates the busy plot at a constant snappy pace and pitches the blithely crude and dumb humor at an amusingly broad level. The cast have a field day with their colorful roles: Zutaut and Udenio make for engaging leads, James Karen has a ball as smarmy lecherous cheapskate producer Logan, Brenda Bakke is perfectly snooty as Scotty's snippy fiancé Cleo, Sorrells Pickard does a pleasing reprise of the supremely affable Carlton Ashby, plus there are neat supporting turns by Sam Temeles as Scotty's goofball buddy Rags, Roberta Collins as Logan's perky, no-nonsense wife Lana, Louise Baker as daffy klutz production assistant Cookie, and Alexandros Mylonas as flamboyant gay production designer Brucie. The jokes about such subjects as dope, making love in airplane bathrooms, out-of-control chainsaws, and hack no-talent actresses making ill-advised stabs at auditioning for the female lead are admittedly pretty stupid, but are done in a breezy and good-natured manner that still proves to be quite funny just the same. Moreover, there's an ample amount of yummy bare distaff skin and the Greek island scenery looks absolutely beautiful. Tom Richmond's bright, sparkling cinematography and the bouncy score by Jay Levy and Eddie Arkin are both up to speed. An entertainingly inane diversion.",
         "When I was 9, about the time this movie came out, I spent a lot of time at the neighborhood pool. While checking out some local hardbodies and doing cannonballs, I overheard some goofball saying to his friends, \"You know what 'hardbodies' means? Good Sex.\" I didn't believe it then, and I don't believe it now. I had often seen the VHS case for the original \"Hardbodies\" in the video store, and I had always understood, mainly from the information given by this video cover, what \"Hardbodies\" meant.That being a collection of sunny, beach side scenes of young, firm, hot, easy girls in bikinis --and the dorks they were involved with. I never actually saw the movie. Tonight, Encore Love played Hardbodies 2, and with nothing else remotely interesting to do, I put it on the TV whilst surfing the net. This movie is, in fact, despite what the first commentator claims, \"a typical jiggle and giggle fest from the 80's.\" But that's not a bad thing. This is perfect summer fodder, it's straight to video schlock that you wouldn't pay 5$ for the DVD of, but as a late night cable movie, it works on the most repulsive level: it's only a notch above LCD, and at that only because it features sunny beach side scenes of young, firm, hot, easy girls in bikinis--and out of them. Whatever. It does feature the girl who played the foreign exchange student in \"Summer School\", Fabiana Udenio. She gets quit a bit of screen time in this one, as the female lead/ romantic interest. She does well, given the script, but her accent and her latina hotness land the type-cast role. Her boobs are not featured, unfortunately. Anyway, it's better than Weekend at Bernie's(1989), though nowhere near it's contemporary, Savage Steve Holland's One Crazy Summer(1986). I can't believe I just wasted ten minutes of my life writing this.",
         "This film was produced and released as a successor to a ghastly - although fairly popular - slapstick Californian beach comedy called Hardbodies, but it has little or no connection with the earlier film and is better assessed completely in its own right. It is certainly better than Hardbodies I, and is more closely related to films such as Venus and Summer Lovers which were also filmed during summer in the Greek Islands. The combination of blissful beaches on blue bays with beautiful bare bosoms makes for seductive viewing, but (except for travelogues just designed to help plan your next holiday) even such films require an adequate story line if they are to hold a viewers attention for more than a very few minutes. Venus was underpinned by the legend of the re-incarnation of the goddess, and Summer Lovers had the viability of a \"menage a trois\" as its theme. In my view both these films were much more successful than Hardbodies II which has a very tenuous story line and depends too much on simplistic semi-slapstick comedy. The use of slapstick quickly becomes tedious, it usually leads to a series of very short self contained cameo sequences that are hard to integrate into an ongoing story line. Mel Brooks achieved this brilliantly with Silent Movie, but few other films have succeeded in the same way, and Hardbodies II unfortunately does not. There is also the problem that the slapstick sequences do not co-habit happily with the idyllic and peaceful scenario in which the film is set. The final airport sequences were no doubt intended to provide a hilarious ending for this film but in my opinion they are an example of the worst type of overplayed slapstick pseudo-comedy. They are also grossly overlong, so I left the cinema with a bad taste left in my mouth. This is a film which could have been much more successful with a stronger story line and with most of its slapstick sequences very heavily pruned. As it was released it certainly does not warrant a viewers rating higher than 3. There is little memorable in the acting, but the cast does its best within the limitations imposed by a meagre story line and poor direction - it is in these latter areas that the failure arises.",
         "wow.i thought the first Hardbodies was lame.this was worse.it's a cross between a soap opera and a romance.there's no comedy involved that i could see.but like the first one,there are of course topless women.the acting in this one isn't very good,but neither is the script or the dialogue.and the music isn't memorable in the slightest.really there isn't much merit to this movie that i can think of.however,as bad as this movie is i have seen a number of movies that are worse than this one.still,i wouldn't recommend it,even with the topless women.but that's just my opinion.the current rating on this site is a 2.3.i would rate it a little higher simply because of the number of worse movies i have seen.for me,Hardbodies 2 is a 3/10",
         "It's simply silly fun in a beautiful setting, the mid 80's Rhodes Greece. Beautiful women running around topless and a funny harmless plot make this a fun popcorn movie from a different era and time. There was something simpler about low budget movies back then they had more character and spirit it seems. It takes me back to my teens and I Love it. Next time it comes around give it a chance for what it is.",
         "Pointless movie about making a movie. No where near the flesh shown in the original, which was quite enjoyable and even had fun music. Not here. It's always fun seeing the Pathmark guy though.",
         "But it doesn't try to be. If you judge it in relationship to it's genre (coming-of-age teen nudie flick) it's - not bad. Bare bones plot and no characters worth remembering, but attractive models (they don't act enough to call them actresses) and a lack of false pretension or nudge-nudge-wink-wink sensuality make this worth a $1 or less rental fee. It's a guilty pleasure, like Moon Pies and cheesecake.",
         "It's just when a band tours, and only has one original member. It's not the same as the classic line up. All new actors playing the main roles of Rag, Scotty, etc, with Ashby as virtually the only returning face from the first movie. And he was of only minor note of the first flick, serving as the only redeemable group of the three guys that Scotty was trying to assist in meeting females. The film is poorly written, featuring the dumbest dialog this side of Armageddon. Even for a T&A movie, this one is a turkey. Not even die hard low budget 80's films fans would want to sit through this movie, which has no plot, and plenty of bad acting. This film would have been better off never being released. Just plain bad.",
         "Hardbodies 2 was a bad idea. A sequel to a movie that's really not a sequel. Huh? I felt just like the audience. But I have to mention that Brenda Bakke is really hot. If you must, watch the first half hour and forget the rest. Stupid movie with bad clueless actors, boring direction and lame dialogue. Skip this movie unless you're a die hard Brenda Bakke fan. For masochists only D+",
         "Do you have nothing to do for the next 90 minutes? Well, here you go - 'Hardbodies 2'! It's a classic masterpiece of American cinematic perfection... OK, that's horse-crap, but I'll bet you chuckle your butt off, that is, if you're like me. Have a couple of shots of Captain Morgan and sit back and let yourself laugh at this wildly silly comedy. James Karen is a blast as a movie company director filming overseas. He loves the cute women on the set, except when he gets a fist or a door slammed into his nose, then he lets out the funniest yelp of pain. There are many pretty girls who take off their tops... those are the best parts of the film. All the guys in the movie... well, who gives a crap? Yula Gavala is funny as an aspiring Greek actress who performs scenes from a play for an actor held hostage.",
         "This one was better with a second look but still is a lame sequel to the superior summer greatness of \"Hardbodies\". Like somebody said in a another review and paraphrasing, the slapstick was overblown and very unfunny. The eye candy in the movie is worth the price of admission. The acting is bad in most cases but the main leads do good with the material that they have. The best thing I could suggest is get the two-pack of both films and view Hardbodies 2 on it's own merit if it has any at all.The cowboy guy from the first movie returns in the second one as well as the real estate lady from the first one but all is lost in the translation. This movie is for completest only in the 80s summer beach flick genre. If you are new to this genre try the 80s classics \"The Beach Girls\" \"Spring Break\" and the orig \"Hardbodies\" before trudging your way through this one.",
         "Believe it or not, this was at one time the worst movie I had ever seen. Since that time, I have seen many more movies that are worse (how is it possible??) Therefore, to be fair, I had to give this movie a 2 out of 10. But it was a tough call.",
         "The '80's were the best of times and worst of times for James Karin, he starred in one of the best cult horror-comedies with \"Return of the Living Dead\" and a year later he acts in this piece of.... this bad movie. A sequel to Hardbodies (but not really), has a group of fairly unlikeable characters attempting to make a movie in Greece. Through design or sheer laziness the line between the film and the 'film within a film' is not only blurred, but throughly non-existent from scene to scene (which would be confusing if I were just interested in anything happening in the movie in the first place. Unfunny would be too generous a term. Eye Candy: Nana, Fabiana Udenio, and many numerous extras get topless; Brenda Bakke shows some T&A My Grade: F DVD Extras: Just trailers for \"Hardbodies\", \"American High School\", \"Strike\", \"Virgin Territory\" (comes in a double-feature DVD with the first film, for the masochistic)",
         "Even if some people think this sequel stinks because I though it should be a good sequel. Although I love the women in bikinis that always agree with me. Even if Hardbodies 1 and 2 will come out on Blu-Ray later on, then I would get them on Blu-ray because it is more fun to watch these two movies in full high definition. I hope Anchor Bay Entertainment would release Hardbodies 1 and 2 on Blu-ray because this should happen very soon. I still think this is a movie with women in bikinis to go for even if this movie does not suit their best for other audiences. The first one is great, but the sequel is fair enough for me to watch even if they come out on blue-ray."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Chroma III Productions"],
      "summaries": ["A film crew is travelling from America to Greece to produce a movie. Before their work is done they will have to face many unusual situations, along with numerous opportunities for the actresses to take their clothes off."],
      "budget": 0
   },
   "movielensId": 131546,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-09-12",
      "dvdReleaseDate": null,
      "directors": ["Mark Griffiths"],
      "runtime": 88,
      "movieId": 131546,
      "title": "Hardbodies 2",
      "mpaa": "R",
      "actors": [
         "James Karen",
         "Louise Baker",
         "Alba Francesca",
         "Alexandros Mylonas",
         "Robert Rhine",
         "Brad Zutaut",
         "Sam Temeles",
         "Curt Wilmot",
         "Nana",
         "Brenda Bakke",
         "Roberta Collins",
         "Fabiana Udenio",
         "Vassili Karis"
      ],
      "imdbMovieId": "0091173",
      "originalTitle": "Hardbodies 2",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A film crew is travelling from America to Greece to produce a movie. Before their work is done they will have to face many unusual situations, along with numerous opportunities for the actresses to take their clothes off.",
      "tmdbMovieId": 61117,
      "avgRating": 3,
      "releaseYear": "1986",
      "numRatings": 3,
      "posterPath": "/yVsC0skEGRCGgjfiNRCjZaFDuJK.jpg"
   }
}