{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0186910",
      "video": false,
      "title": "Can of Worms",
      "recommendations": [
         41302,
         158265,
         44349,
         115054,
         28295,
         31948,
         28758,
         18116,
         36855
      ],
      "backdrop_path": "/f2ntuwGzIN34ji57sQTaTWYwQow.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mike Pilsbury",
               "gender": 2,
               "credit_id": "52fe484f9251416c91087cb7",
               "name": "Michael Shulman",
               "profile_path": "/4YYDD1Gljpg7Nx6d5C8UbD6N5Jq.jpg",
               "id": 84844,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Katelyn",
               "gender": 1,
               "credit_id": "52fe484f9251416c91087cbb",
               "name": "Erika Christensen",
               "profile_path": "/a2o0FlVZegV7f99fCZvwszL9qBd.jpg",
               "id": 21711,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe484f9251416c91087cbf",
               "name": "Adam Wylie",
               "profile_path": "/qSeYVaE3HKf62J4WQY12mEAKjbz.jpg",
               "id": 21402,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jay",
               "gender": 2,
               "credit_id": "52fe484f9251416c91087cc3",
               "name": "Andrew Ducote",
               "profile_path": null,
               "id": 149511,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe484f9251416c91087cc9",
               "name": "Paul Schneider",
               "profile_path": null,
               "id": 543495,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe484f9251416c91087ccf",
               "name": "Kathy Mackel",
               "profile_path": null,
               "id": 566910,
               "department": "Writing",
               "job": "Teleplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.978927,
      "production_countries": [],
      "id": 82401,
      "vote_count": 11,
      "budget": 0,
      "overview": "A teen is visited by aliens after he broadcasts a message into space.",
      "similar": [],
      "original_title": "Can of Worms",
      "runtime": 90,
      "poster_path": "/kSTTFXTAPmmumZ1rvH96VWeEH5Y.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Disney Channel",
         "id": 3213,
         "origin_country": ""
      }],
      "release_date": "1999-04-10",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Who's Got Time to Be a Teenager When You Have to Save the World?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Schneider"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Kathy Mackel",
         "Kathy Mackel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0186910/",
      "coverLink": null,
      "actors": [
         "Michael Shulman",
         "Erika Christensen",
         "Adam Wylie"
      ],
      "reviews": [
         "I think this movie is funny. It is a quirky concept for a movie but it's one that kids will enjoy. I saw it for the first time when I was probably 10 on Disney channel. I thought it was great. I still do. It is a kids movie and kids get it. I love it. Sure the acting isn't the best, but hey, its for KIDS. They don't care. They'll love the weird aliens. It's just a good kids movie. Kids like to create stories which don't make sense to anyone but themselves. This movie is just like that. It makes sense to kids and anyone who understands kids. You just need to watch it and not try to think to hard. Just take it as it is, enjoy the randomness. Love the aliens. My favorite is the dog. But that's just me. Kids will like it.",
         "Beautiful movie! Great imagination and way of presenting common issues. As the main character gets trapped in an environment that mimics his home town it does not quite replace it. This speaks to we as a society or individuals offer others a comfort area or object in order for others to feel at home. However, we miss the most important things which are the connections they have to home not home itself. The alien that collects other creatures and provides them an environment which mimics their hometown may genuinely be trying to help these creatures be happy as they can do as they please in their restricted area. However, he does not see that solitude is not for everyone and that objects (such as a house) is not as important as the relationships they have and their day to day experiences. Many times we too wish to just be abducted by Aliens if only for a moment to not live in such a chaotic world or have to face our fears. However, it is not until we realize that our world has more to offer than our presenting problems that we begin to value it. I watched it as child and for several years still remains a great movie. Perhaps now the special effects may not be as powerful but if you allow yourself to see the movie for what it is and perhaps attempt to see it through a child's eye, or through someone who is eager to please others, someone, who wants to get away, or someone who began their journey with something in mind and lost their purpose on the way, you may greatly enjoy the film.",
         "This movie is interesting, but also overly weird and at times overly annoying. The actors are fine, but only Malcolm Mcdowells voice performance is the one to watch or listen of the voice acting. The special effects and freakish aliens are cute. The reason it gets a 5 is because the movie keeps you awake wondering what the heck is going on. Now this movie can be stupid at times and of course freaking ridiculous. I was never bored when i watched it, but like i said I was annoyed at times. The picture quality of this movie (meaning what and where the camera is shooting) is beautiful. Nice bright colors. But only a 5 it shall receive.",
         "I have seen this Disney movie maybe four times because Disney plays their movies so much, and have every time thought that is was a bit odd. One thing that I found that made this movie not as good as it could have been, was the \"perfect\" family that was in the movie. For some reason, the main character, Mike, thinks he has such a terrible life, when that really isn't true. Even though he thinks that he is upon the area of being incommodious to the place he lives in, Earth, that still isn't a reason to want to leave, is it? There is another thing about his life that makes it exquisitely neat that you will find out if you watch the movie. The family seems to be perfect with no flaws in the family except for some whimsical parents. Even his sister is typical. There really was not a lot of thought that went into making this family different from boring. If the writer was trying to express this family like this, he or she could have make the family more interesting even if they had this family planned like this. The plot of the story is somewhat weird as well. The story does not flow in the end. It shifts to an entirely different kind of story it seems like. Basically what is does is discontinues from what the story had to offer, a movie that took place in a small town. Not somewhere bizarre like where it seems to take place in the end. The movie just sort of turned out not as it could have, and not how I would have expected. This is also the type of movie that someone could like just because they want to, but deep down inside they may think that it is a movie that isn't so good after all. This movie is overall a little boring, it has some action scenes and some good scenes, but all in all I think it is not as good as some of the other Disney Channel Original movies. I think that is is worth seeing once or twice, but you shouldn't expect a lot from it. There are some funny lines, but some are not. I think that overall, I would give this movie a 6 out of 10, for lacking what could be the most important thing in movies: the will to keep the audience watching.",
         "I watched this movie because my favourite actor, Malcolm McDowell does a voice of one of the aliens. I was not very impressed with the story. Young children might find it entertaining for as long as it lasts, but it's not very memorable. The aliens aren't too bad, but the other effects, at the dance and the main character's supposedly high-tech equipment are pretty cheesy. The movie moves very slowly and it takes most of the movie for the premise to set in. If they had either started the movie about half way through and made a bigger deal about the adventure on the other planet, or gone in a totally different direction from the midway point, the movie might have been redeemable. However, it's not. All the characters are pretty shallow. The main character can't seem to decide if he is or isn't an alien. The bully character goes along with their plans just because he is dared which doesn't make a whole lot of sense. Anyway, it's a shallow movie.",
         "About a teenaged boy suffering rejection angst who messages The Universe to come and take him away because he doesn't belong on earth. The movie overall is \"sweet\" - no one is too awful, and nothing too terrible happens to him. The production values are so low as to become distracting; i.e., the aliens are not cute or interesting, the halloween dance has a total of about 20 participants, and his \"high tech equipment\" consists of a laptop and a backyard satellite dish. You have never heard of any of the actors in this, except for the kid nextdoor neighbor. I watched it because TV Guide rated it very very highly - I wonder what they were thinking of.",
         "The first two-thirds of this movie are so neat and so funny, that it is such a shame when the final third is so downright stupid and remedial. It is about a boy, who feels like an outcast at home and school, that he tries to summon aliens using his satellite dish to take him away from Earth. After a lightning incident, aliens finally do hear him, and some of them come to try and take the boy away after he has had second thoughts about leaving. Some of these aliens (especially the lawyer alien) are very hilarious. But then the writing screws up when the boy his friends team up with the school bully to face an evil zoo-keeper alien. This bully-befriending and cliched evil alien make me wonder if we changed writers within the movie. That feeling ruins \"Can Of Worms.\" Zanatos's score: 5 out of 10",
         "I have no idea what convinced the makers of this movie to make it, but this was the strangest, most discusting, most bizarre movie i have ever seen. The idea of a kid being an alien and not knowing it, and then sending a message to space for them to come get him, strikes me as odd. The acting was poor, and the script sounded like it had been written by a ten year old. On a scale of 1 to 10 i give it a 2."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Disney Channel",
         "Gross-Weston Productions"
      ],
      "summaries": ["A teen is visited by aliens after he broadcasts a message into space."],
      "budget": 0
   },
   "movielensId": 131604,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-10",
      "dvdReleaseDate": null,
      "directors": ["Paul Schneider"],
      "runtime": 90,
      "movieId": 131604,
      "title": "Can of Worms",
      "mpaa": "PG",
      "actors": [
         "Michael Shulman",
         "Erika Christensen",
         "Adam Wylie",
         "Andrew Ducote"
      ],
      "imdbMovieId": "0186910",
      "originalTitle": "Can of Worms",
      "genres": [
         "Comedy",
         "Family",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A teen is visited by aliens after he broadcasts a message into space.",
      "tmdbMovieId": 82401,
      "avgRating": 3.375,
      "releaseYear": "1999",
      "numRatings": 4,
      "posterPath": "/kSTTFXTAPmmumZ1rvH96VWeEH5Y.jpg"
   }
}