{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0097905",
      "video": false,
      "title": "Monster High",
      "recommendations": [
         92779,
         126793,
         89319
      ],
      "backdrop_path": "/6xK9Rcj48onoxur0wxbX7ACh6Gx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Norm Median",
               "gender": 2,
               "credit_id": "52fe48b99251416c750b1463",
               "name": "Dean Iandoli",
               "profile_path": null,
               "id": 938817,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Candice Cain",
               "gender": 1,
               "credit_id": "52fe48b99251416c750b1467",
               "name": "Diana Frank",
               "profile_path": "/mb08fC6nFPcR2Sr6cQtnH0HqwWO.jpg",
               "id": 57853,
               "order": 1
            },
            {
               "cast_id": 1003,
               "character": "Mr. Armageddon",
               "gender": 0,
               "credit_id": "57e2d818c3a3685dc0001013",
               "name": "David Marriott",
               "profile_path": null,
               "id": 1197130,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Dume",
               "gender": 0,
               "credit_id": "57e2d82792514101c8001d09",
               "name": "Robert Lind",
               "profile_path": null,
               "id": 1683040,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Glume",
               "gender": 0,
               "credit_id": "57e2d830c3a3683aa6001a80",
               "name": "Sean Haines",
               "profile_path": null,
               "id": 1683041,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "Orson 'O.D.' Davis",
               "gender": 0,
               "credit_id": "57e2d846c3a3685e090010c1",
               "name": "Doug Kerzner",
               "profile_path": null,
               "id": 1683043,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "Stinksucker",
               "gender": 2,
               "credit_id": "57e2d8609251417eda001bbc",
               "name": "Phil Fondacaro",
               "profile_path": "/3Ao8VPvlytIm3DWFffdSPxwxFdC.jpg",
               "id": 12662,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "Eggbert Hoser / Macmonster",
               "gender": 2,
               "credit_id": "57f0444cc3a3683f20005e22",
               "name": "Troy Fromin",
               "profile_path": null,
               "id": 152995,
               "order": 7
            },
            {
               "cast_id": 1009,
               "character": "Body Double / Featured Extra",
               "gender": 1,
               "credit_id": "57e2d890c3a3685dc0001046",
               "name": "Rhonda Gray",
               "profile_path": null,
               "id": 1274160,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe48b99251416c750b145f",
            "name": "Rudy Poe",
            "profile_path": null,
            "id": 938816,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.694561,
      "production_countries": [],
      "id": 90888,
      "vote_count": 4,
      "budget": 0,
      "overview": "Two high school goofs steal an explosive device from another world that has been hidden on earth, and an alien named Mr. Armageddon is sent to retrieve it from them.",
      "similar": [],
      "original_title": "Monster High",
      "runtime": 84,
      "poster_path": "/dkOrydlZE0NfatkvVVnMzuILhqg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1989-12-20",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "A Cosmic Campus Comedy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rudy Poe"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Roy Langsdon",
         "John Platt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0097905/",
      "coverLink": null,
      "actors": [
         "Dean Iandoli",
         "Diana Frank",
         "David Marriott"
      ],
      "reviews": [
         "Lately I find myself hopelessly over the hill, frantically scrambling for vestiges of my long-gone youth to validate my current adult existence. Being that I'm only twenty makes this kind of hard, and besides, I spent my adolescence watching the Gilbert Gottfried magnum opus USA Up All Night. I remembered that as a youngster I enjoyed the Up All Night staple \"Monster High\", which usually aired after \"Dr. Alien\" or \"Surf Nazis Must Die\". Watching it again now, I found it pretty stupid. I think the reason that I liked it as a ten-year-old was that this movie seems to have been made by ten-year-olds (not unlike \"Bats\"). It's packed with corny jokes and pointless scenes, and has some pretty awful acting, even worse and over-blown than Shannon Elizabeth in \"Scary Movie\", and that's no easy feat. However, I must applaud the sheer volume of stuff that they packed into this, a \"quantity over quality\" sort of thing. This movie has got a mummy, a zombie, a killer computer nerd robot, a walking gargoyle, a huge, sentient clump of marijuana, shoes that eat people, and two aliens so annoying they seem to have come from Planet Charles Nelson Reilly. These ghoul's ring-leader is Mr. Armageddon, the embodiment of all evil, who kind of looks like a doughy, aged Corey Feldman. Oh, I figured out another reason that I liked this- there's a cute girl playing the female love interest. What's odd is, the girl and her breasts are played by two different actresses, so every time a scene calls for nudity (which is often, remember, this was made by ten-year-old boys) they cut to a disorienting shot of a headless torso. This made me wonder: The gal playing the lead was pretty awful actress, but they wanted her so desperately that they were willing to let her use a body double? There was no other actress that was just as bad AND would show her breasts? Weird. Anyway, this is a pretty simple-minded, innocuous bit of entertainment. The people making it were probably having a lot of fun, and there are a few funny bits (like the finale's \"basketball on the rim\" gag, worthy of a \"Naked Gun\" movie). If you're a little kid or a heavy drinker you'll probably love it.",
         "Well, I attained a copy of this movie off Ebay, remembering watching it from the good ole USA Up All Night days... True campy hiliarity! This movie is stupid, funny, hilarious, and a down right good time to watch. Nudity, blood, monsters, aliens, nerds, horny teens, drugs, kill pot plants, the most hiliarious names every given to characters....there is so much wrapped into this movie, it seems it could explode from so much camp. It is sad to see this is the only movie the Director ever made...He truly had an Eye for Horror/comedy...I want a DVD release of this film...It should be kept underground...Mainstream this bad-boy...I want deleted scenes, Commentary, etc....I love this movie.. 9 out of 10",
         "Wow. Just... wow. If you are into schlocky horror films, then this is just beyond words. Everything you ever wanted is here: Killer shoes, zombies, strange directing (some characters open up an elevator door and some girl is getting killed as a strobe light blinks and someone sits on a pie or something -- what?!), and plenty of t&a. Oh, and don't forget Satan. And a guy whose voice is overdubbed to sound really evil. And really, REALLY cheap FX. And computers who kill people. And rapping aliens. And amazingness. I mean, the plot of this movie is simple: Earth is about to be taken over, so people play basketball to decide the fate of the world. If this DOESN'T sound amazing, then this isn't the film for you. However, this film is AMAZINGLY entertaining, hilarious, and just completely over-the-top. In a lot of ways, it's similar to Troma films (especially Class of Nuke'Em High) except it is even more clever, and there actually seems to be an attempt on the director's part to make something more out of this film than a cheap B-movie. I really don't know why more people don't know of this film since it used to be on USA's Up All Night, but you can easily snag a copy off of Amazon for a dollar. Really, I can't say it enough: The best trashy B-Movie horror/comedy/whatever film ever. See it now. 10/10.",
         "I found this movie very amusing, it's use of off-beat and cheesy humor is absolutely wonderful! I thought the abstract storyline was very well put together, and is not your typical 80's high school movie. It has all things that make a great movie, blood and gore (check out the excellent microwave scene!), nudity, campy humor, and it even has a killer pot plant! I highly recommend this movie to anyone. If you ever see it in your local video store, check it out, it rocks!",
         "I have seen a lot of bad films, but I tend to find some points of amusement or enjoyment in most of them. However, this is not the case with this movie. While some films can get away with virtually no plot, this film cannot. In addition, the monsters were ridiculous, the jokes were awful, and the basketball scenes were the worst I have ever seen. Simply a terrible film.",
         "Bad movies can be hilarious! They can make us laugh or in some cases cry, and they later are remembered as hilarious cult gems that people quote in everyday life. That seems to be the ultimate goal of the awful film, and only certain movies ever make it to that level. Some make it to a much smaller cultish level of bad where friends gather to watch it and laugh, but most have never heard, nor want to, of the movie. Then there's movies like this. You start off saying, \"Boy, I know this will be horrible, but I bet I'll get a good laugh!\", and by a mere 20 minutes in you just pray this thing will be ending very soon. This is a very annoying, and awful movie, and the overload of humor results in an audience sensory overload where everything goes dead, except for boredom which stays very much alive. Nerdy 35 year old student Norm is quite infatuated with foreign exchange student Candice Cain, but oh no!, the end of the world is coming! Mr. Armageddon, a voice modulated ugly middle aged creeper who molests and kills the students at this high school is going to end the world. This weirdo was freed from his prison by two flamboyant aliens, Dume and Glume, who go around this same school zapping people with their stupid looking guns. Meanwhile all kinds of crazy stuff happens at this school like a mummy coming to life, a killer pot plant, a tennis shoe monster, and many other ridiculous creatures. It's hard to decide what to criticize first with this thing, so I'll go with the least discussed first. This movie has some truly unbearable music! It sounds like bad early 80s video game music, and made this cornball movie even more cornball than ever imaginable. The acting in this is really bad, but compared to most other aspects of this movie, the acting is quite masterful. The actors are actually speaking with straight faces so they get ten points above the writers and director. The characters are stupid, and not funny in the least. There is a random narrator guy who apparently is Mr. Apacolypse's relative, and he is the most random unfunny guy ever, and the actual female narrator has a horrible speaking voice. She sounds like a voice over for a cheap early 90s VHS trailer. Nothing about this movie is remotely funny in any way at all. The lack of plot makes this thing boring, the acting is atrocious the writing is also, and this movie nearly bored me to death. Don't see it! My rating: BOMB out of ****. 84 mins. R for constant nudity, language, drug use and sexuality.",
         "I'd say that this is the worst movie I've ever seen, but I really have seen 3 or 4 worse movies. That being said, this movie is still crap. I'd go into detail, but this movie does not even deserve two minutes of your time (much less the hour and a half of your life that you will never get back). Just... don't see it. Ever. My friends and I rented this from Blockbuster, and ended up having to pay for it because when it was over we took the tape outside and shot it.",
         "When I worked on this movie in 1989 I was new to the business and could tell nobody was out to make a masterpiece or win any awards except maybe in a few cases and then masterpiece would be the wrong word. (Some that worked on this movie have gone on to win big big awards) I am trying to say that on any movie most of the cast and crew (above the line included) work hard and it is well known that it will be great if the movie is released at all, in any market or format. (I suppose some might hope just the opposite, thus the Alan Smithee credit). \"Monster High\" was just a comedy and was not trying to hard to be great. Just to be fun and silly and great in it's own way. I think, IMHO, it did just this. If I remember right anything that would get it a R rating such as nakedness was shot after principal photography was finished. (I am not sure what it's final rating is) It was a lot of fun and hard work and I had a easy job kind of... DTz'r",
         "I saw this movie when I was eleven years old (when I liked basically every film I saw for some sort of reason) and thought it was the worst movie ever. Nowadays I'm not sure which film is worse this one ore urban menace, one thing is for certain though both have to be seen to be believed. So my advice is to buy both of em you should be able to find both of them really cheap and their worth every penny!!!! p.s. the true worst film ever is of course pearl harbor, but that one is so bad it isn't even funny anymore (in fact I don't think of it as a film, movie, flick or any of those I personally think it's what getting you soul ripped out of you must feel like) whereas these I think were intended by the makers to be so stupid you just have to see them and are still funny after repeated viewings (although not in a row!!!)",
         "This cheesy late 80s horror comedy definitely lands firmly on the comedy side of things, with every scene being played for laughs over scares. It's not the funniest movie in itself, but it is just terrible enough to enjoy with a bunch of friends and nothing to do. The plot is frankly schizophrenic, coming out as being a mixture between Detention and Space Jam, in fact I wouldn't be surprised if both movies were at least partially influenced by this film, especially in the case of Space Jam. While the effects, writing, acting and overall story of this film aren't the greatest it is hard to deny that it is a good time. It's certainly not something you should watch if you are looking for rich, deep storytelling, or a fear-tastic fright-fest, but its good for a cheap laugh or two, so why not?",
         "This is an awful movie and I'm surprised that I managed to make it through 58 minutes of this garbage. This movie tries to be funny, but it fails miserably. This a B movie and I enjoy B movies even though many of them can be considered bad, but this movie is not even so bad it's good. It is so bad that it's just bad. The action, costumes, and character ideas are idiotic. Mr. Armageddon's voice is ear grating and I don't understand why he couldn't have a normal voice. I guess this movie is good for people who like boobs in movies because that is almost all this trash has. This is the worst movie that I have ever watched in my life and that is saying a lot. It's saying a lot because not all B movies that I watch are winners and I have seen many of them.",
         "Two bald aliens arrive on Earth with the Doomsday Device, something they have stolen from their own alien planet, much to the behest of the Monster-in-Charge. They unwittingly unleash Mr. Armageddon (David Marriott) upon an all-American high school, and soon this long- fingernailed-bringer-of-doom is busy a-rapin', a-killin', and basically a-f****n' with every kid in the school. Dorky loner Norm (Dean Iandoli) is too busy lusting after foreign exchange student Candice Cane (get it - played by Diana Frank) to notice the arrival of horny gargoyle statues, the living dead, and deadly giant marijuana plants. But when he does, he strikes a deal with Armageddon to have basketball game to end all games, and possibly the world. I'm sure you can gather from the description that this isn't a film to take too seriously. It's a very 80's high school horror/sex flick that is very aware of what it's target audience wants - blood, tits, and goofy humour. And it delivers all that in abundance. It has everything a shlock hound could want. Where else can you find a monster with a computer for a head? Or a teen that gets eaten by his shoes? Or alien twins that were failed rappers on their own planet? Probably nowhere. This is of course an awful film. But where it lacks in subtlety and intelligence, it makes up for in sheer volume and creativity. The edits come thick and fast. The film cuts back and forth between different characters and locations as if it were filmed by a giddy teenager. This approach certainly keeps the film fun and interesting, which is undoubtedly the sole aim of the film. Fans of Troma will love it, as will fans of 80's teen sex flicks such as Porky's and zero-taste gross-out comedies a la Animal House. Special mention must go to the creation of Mr. Armageddon, who dons a crap cape and a long pinky fingernail, and has a voice which is deeper than Barry White. Clearly actor David Marriott, who had a short career starring in B-movie action films, is having a great time, as did I watching him. I feel guilty that I liked this film, as it is indeed awful."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Lightyear Entertainment"],
      "summaries": ["Two aliens steal a doomsday device from another world and abscond to earth. The device is Mr. Armageddon, a living embodiment of destruction who intends to destroy the planet. A ragtag group of high school students stand in his way."],
      "budget": 0
   },
   "movielensId": 131794,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-12-20",
      "dvdReleaseDate": null,
      "directors": ["Rudy Poe"],
      "runtime": 84,
      "movieId": 131794,
      "title": "Monster High",
      "mpaa": "R",
      "actors": [
         "Dean Iandoli",
         "Diana Frank",
         "David Marriott",
         "Robert Lind",
         "Sean Haines",
         "Doug Kerzner",
         "Phil Fondacaro",
         "Troy Fromin",
         "Rhonda Gray"
      ],
      "imdbMovieId": "0097905",
      "originalTitle": "Monster High",
      "genres": [
         "Horror",
         "Comedy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two high school goofs steal an explosive device from another world that has been hidden on earth, and an alien named Mr. Armageddon is sent to retrieve it from them.",
      "tmdbMovieId": 90888,
      "avgRating": 0,
      "releaseYear": "1989",
      "numRatings": 0,
      "posterPath": "/dkOrydlZE0NfatkvVVnMzuILhqg.jpg"
   }
}