{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0082656",
      "video": false,
      "title": "Liar's Moon",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Andrew Jackson \"Jack\" Duncan",
               "gender": 2,
               "credit_id": "52fe49689251416c910ac5fd",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ginny Peterson",
               "gender": 1,
               "credit_id": "52fe49689251416c910ac601",
               "name": "Cindy Fisher",
               "profile_path": "/eorSm5IPzlmph90cw5e70F9LGoF.jpg",
               "id": 122118,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Alex Peterson",
               "gender": 0,
               "credit_id": "52fe49689251416c910ac605",
               "name": "Christopher Connelly",
               "profile_path": "/3kN6SQXpnZhP3U0NiYTyv4RAtxd.jpg",
               "id": 234297,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cecil Duncan",
               "gender": 2,
               "credit_id": "52fe49689251416c910ac609",
               "name": "Hoyt Axton",
               "profile_path": "/sIJjj88LfVpvnxW56Ffr6qlj7wI.jpg",
               "id": 16166,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Babs Duncan",
               "gender": 1,
               "credit_id": "52fe49699251416c910ac60d",
               "name": "Margaret Blye",
               "profile_path": "/hc23lp1JvAqQYKJvrdOJMlhvJ3S.jpg",
               "id": 65552,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lora Mae Bouvier",
               "gender": 1,
               "credit_id": "52fe49699251416c910ac611",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jeanene Dubois",
               "gender": 1,
               "credit_id": "52fe49699251416c910ac615",
               "name": "Yvonne De Carlo",
               "profile_path": "/v2aCRQusYYePhBF2fS1xsVIPr5Z.jpg",
               "id": 41240,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Col. Tubman",
               "gender": 2,
               "credit_id": "52fe49699251416c910ac619",
               "name": "Broderick Crawford",
               "profile_path": "/fCoHg9CyOza4o9Mg1TLd5yXFGM4.jpg",
               "id": 85895,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Connie Peterson",
               "gender": 1,
               "credit_id": "52fe49699251416c910ac61d",
               "name": "Molly McCarthy",
               "profile_path": null,
               "id": 108729,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Lisa Peterson",
               "gender": 0,
               "credit_id": "52fe49699251416c910ac621",
               "name": "Tiffany Strettner",
               "profile_path": null,
               "id": 1263091,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Richard Thompson",
               "gender": 0,
               "credit_id": "52fe49699251416c910ac625",
               "name": "David Underwood",
               "profile_path": null,
               "id": 193952,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Clifford",
               "gender": 0,
               "credit_id": "52fe49699251416c910ac629",
               "name": "Clint Hughes",
               "profile_path": null,
               "id": 1263092,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Pearl",
               "gender": 0,
               "credit_id": "52fe49699251416c910ac62d",
               "name": "Pat Perkins",
               "profile_path": null,
               "id": 196832,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Mike Miller",
               "gender": 2,
               "credit_id": "52fe49699251416c910ac631",
               "name": "Jim Greenleaf",
               "profile_path": null,
               "id": 130131,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Karen",
               "gender": 0,
               "credit_id": "52fe49699251416c910ac635",
               "name": "Tonja Walker",
               "profile_path": null,
               "id": 1222018,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Justice of the Peace",
               "gender": 0,
               "credit_id": "52fe49699251416c910ac639",
               "name": "Ed Holmes",
               "profile_path": null,
               "id": 194155,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Roy Logan",
               "gender": 2,
               "credit_id": "52fe49699251416c910ac63d",
               "name": "Richard Moll",
               "profile_path": "/4MKwdfdu4JxmJ58Mz0Jg66LQFXc.jpg",
               "id": 13591,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Nurse Nancy",
               "gender": 0,
               "credit_id": "57f1ed9fc3a368031b001517",
               "name": "Annie Belle",
               "profile_path": "/vmLEPb1WZ1eIbGcjDnMaWFt1lJL.jpg",
               "id": 101576,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56cfad41c3a3681e3e004a04",
               "name": "David Fisher",
               "profile_path": null,
               "id": 1582981,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56aa9100c3a3681c31000332",
               "name": "Steven Rosenblum",
               "profile_path": null,
               "id": 2484,
               "department": "Editing",
               "job": "Additional Editing"
            },
            {
               "gender": 0,
               "credit_id": "56cfad7dc3a3681e4a003ff1",
               "name": "Janice Thompson",
               "profile_path": null,
               "id": 1582985,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56cfad9fc3a3681e3e004a2d",
               "name": "Billy Hanna",
               "profile_path": null,
               "id": 1582986,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56cfadba9251413e590041ed",
               "name": "David Fisher",
               "profile_path": null,
               "id": 1582981,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.346145,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85948,
      "vote_count": 3,
      "budget": 0,
      "overview": "Matt Dillion  In East Texas, the summer after high school, Jack falls in love with Ginny, the daughter of the town's banker (Jack's mom's high school sweetheart). Ginny's been at boarding school; she's headed for Vassar. Over her father's strenuous objections, she spends time with Jack. At summer's end, Jack and Ginny elope to Louisiana (where 17-year-olds can marry without their parents' permission), and he gets a job in the oil fields. Her dad hires a menacing private eye to find them, Ginny's pregnant, her town doctor gives her horrible news, and Jack's mom has her own agenda. It seems that Jack and Ginny have grown up under a liar's moon. What will these sweethearts do?",
      "similar": [],
      "original_title": "Liar's Moon",
      "runtime": 106,
      "poster_path": "/rP18begiCVMd0i9CYe2RBIjUSyU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1982-09-01",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "A poor kid elopes with a banker's daughter.",
      "adult": false,
      "homepage": "http://www.imdb.com/title/tt0082656/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Fisher"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Janice Thompson",
         "Billy Hanna"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082656/",
      "coverLink": null,
      "actors": [
         "Matt Dillon",
         "Cindy Fisher",
         "Hoyt Axton"
      ],
      "reviews": [
         "This modest pic left me in a dreamy, relaxed state, and I felt like I'd experienced a minor gem. It was not widely released, but it played cable TV outlets in the early 80's and features one of Matt Dillon's earliest screen personas. It's not brilliant, but it's extremely unusual and stylishly directed. It has an atmosphere that reminds me of Jack Fisk's underrated RAGGEDY MAN. A dark, haunting tale of forbidden love, it describes the love affair between dirt poor Matt Dillon and the lovely Cindy Fisher, daughter of a wealthy banker who is the keeper of a terrible secret. Stunning photography and a terrific cast elevate this provocative film into the ranks of \"minor classic\".",
         "Liar's Moon is a coming of age film set in the early Fifties of the Truman administration in rural East Texas. In a role that bares a small resemblance to Cybill Shepherd's in The Last Picture Show, Cindy Fisher is the daughter of the wealthiest man in town, Christopher Connelly and Molly McCarthy. For reasons he won't articulate Connelly takes an unreasoning dislike to dirt poor farm boy Matt Dillon whose parents, Hoyt Axton and Margaret Blye are so far the opposite side of the tracks they're in another zip-code. Still the two young people feel a strong attraction for each other and run off to elope in Louisiana. That drives Connelly into a rage. But it turns out a lie about a past indiscretion told Connelly by McCarthy sets in motion a horrific tragedy. The young leads Dillon and Fisher are perfectly cast in this film about more innocent times. Oddly enough the innocence of those times also contributes to the tragic climax of Liar's Moon. Also in the cast are two Hollywood veterans in small roles, Broderick Crawford as Fisher's grandfather and Yvonne DeCarlo as the proprietress of a motel the two young people elope to. But it's the playing of Fisher and Dillon as a Texas version of Romeo and Juliet that really drives this very neglected and underrated film.",
         "LIARS MOON is a genuine rarity: a very well produced teenage \"Romeo and Juliet' drama made in 1981 and set in the deep south of the good ol' USA in 1950 - and thank god, nobody jumps off the Tallahatche Bridge a-la Ode To Billy Joe. I do believe this gorgeous film made no impression at the time... and I recently found this exquisite film on DVD in 2008 - and I am thrilled to tell ya all, this is a really really good film. There are many excellent and interesting aspects to LIARS MOON: the fantastic and accurate set design and art direction; the astute casting; the fact that the film is also made on genuine locations that really add HUD and RACING WITH THE MOON big studio quality imagery; and then there is Matt Dillon... aged about 18 and on the cusp of super-stardom thanks to THE OUTSIDERS and RUMBLEFISH. Other great acting parts belong to Broderick Crawford, Yvonne de Carlo and Susan Tyrrell, each equally effective in this beautifully created film. The photography and the lighting especially add authenticity with superb photography and image ideology. The costumes and use of real locations are the sort of quality wish-list we all want to see in a film of this style and emotion. It all works because this film is made with love care and some healthy budget. Find it and show it to teenagers.. especially daughters and nieces who will swoon squeal and cry on cue for a delicious family night at home on DVD ..in a film that does not flinch from difficult topics and good romantic suspense. In the credits you will also find Patrick Swayze's mum as choreographer.",
         "This is one of my favorite movies. I saw it on cable when it first came out. The first time I saw it, it was one of those feel good movies. Then the next day when I settled in to watch it again it turned into a sad movie because of the different ending. When it came out on video I bought it hoping the feel good ending was used. It was not. I recently found out that the DVD version doesn't have both ending available on it but it DOES have the feel good ending. Now I HAVE to buy a DVD player!",
         "Interesting story, has some elements of \"Lone Star\", then diverges. Dillon plays a high school boy from an ordinary farming family in 1949 Texas. He and the banker's daughter get sweet on each other but the banker does whatever he can to keep them apart. So they elope to Louisiana while still 17, he gets a job as a pipeline laborer, they are deeply in love, then after 3 months she finds out she is pregnant. Meanwhile banker dad has hired a two-bit detective to find and bring his daughter back. He catches up with them about the time her new doctor calls her old doctor for medical records, only to find out the banker has apparently fathered both of the young couple, they are half-siblings, that's why he was trying to keep them apart! So the only solution is an abortion. In a silly scene at night, after an illegal back-room procedure leaves young wife bleeding and in serious danger, the two-bit detective tries to run them off the road as Dillon's character tries to get her to a hospital. Turns out Dillon's mother had lied, and colluded with the nurse to switch blood types of the possible fathers, and Dillon and his young wife were not related after all. Moral -- see what lies of the father and mother can do to the son and daughter. At the end, young wife recovers, and we see that they will live happily ever after. Not a great movie, only marginally interesting, shot entirely in the Houston area, bad caricatures of Louisiana folk, but interesting for the young Matt d Dillon.",
         "I saw this movie on TV in the 80's and loved it. I was a young teen in love myself at the time and totally related. I taped this on a VCR and watched it over and over until the tape broke. One of the things I enjoyed most was the soundtrack, especially the love song which I have been trying to find out the name and artist for over 20 years! I had wanted to use it in 1984 as my wedding song but no band or DJ knew the song or movie... Can anyone help? The song name might be \"I'll Love you Forever\"?? I am not sure, but it had those words in the song....would appreciate any help. This song was also used years ago in an episode of the soap opera All My Children. It has stayed with me for so many years and when I saw this site I thought maybe I can finally put this lingering question to rest (and use it at my 2nd wedding!) Thank you!",
         "This movie is about a tragic romance that resulted because of lies. True love is found despite those lies, but the lies threaten to stop the love of Jack and Jenny. The viewer is hoping for the best and won't know until the very end of the movie. There were two endings made to this movie - one is sad and the other is happy. It all depends on what the doctor does when he comes out at the end. Watch to find out! It is a sweet movie of love and romance that'll leave the viewer in a teary suspense.",
         "Matt Dillon looks great in this and he was the box office draw in 1982. The entire cast is very capable of getting the audience on their side or against them. Hoyt Axton is Matt's dad in this story of love that cannot wait. The parents have secrets that will be problems for themselves and their children. The boy and girl seem to fall in love during a greased pig chase. Lots of down home humor, but this is a very serious movie that builds to a climax. Good scenes of old cars and trucks and hair styles and life styles. This movie will probably be appreciated by today's young high school viewers. This movie is in a new DVD set of 100 Awesomely Cheesy Movies for about $15 today in December of 2016. It probably will be available in the future. This is a very good movie that probably should be in a better video set.",
         "Liars Moon is probably most immediately notable these days for having a very early starring role from a young Matt Dillon just before he hit stardom. To be fair, it is a movie with a lot more to offer than that and certainly is one that seems to have gone under the radar. Set in the 50's in the rural American south, it tells the story of a poor boy and rich girl who fall in love but the boy's mother and the girl's father do not approve of this class crossing love affair. This was another film from b-movie producers Crown International but it really is very different to most of the features they put out. It's a period set love story which is quite removed from their usual schlock genre offerings. The budget is modest but the production values are high enough to pull off the period setting effectively, while the cast are all very good. The story itself about young lovers from different sides of the tracks is a fairly common one but this one does have the added angle of playing its story out as a real tragedy with an ending that is thoroughly bleak! I do understand that there are two different endings out there for this one, the other being more conventional and happy. But despite the downer nature of the ending I saw, I think it's one that stays in your memory more and is more effective in dramatizing its theme of the way past lies of older generations can shape the present in terrible ways for their offspring.",
         "Earnest working class poor boy Jack Duncan (an excellent and engaging performance by Matt Dillon right before he became a big star) and sweet wealthy lass Ginny Peterson (a fine and appealing portrayal by the fetching Cindy Fisher) fall in love and decide to get married despite the protestations from both of their families. However, a dark secret concerning Jack's lineage threatens to destroy the couple's potential for finding happiness with each other. Writer/director David Fisher delivers a strong and flavorsome evocation of the rural Texas region, likewise offers a vivid and convincing depiction of the early 50's period setting, maintains a pleasant sincere tone throughout, and for the most part manages to handle the story in a tasteful and restrained manner, although the narrative does falter a bit in the last third with a rather clumsy and lurid incest subplot. Fortunately, the enchantingly dreamy atmosphere and the endearing wide-eyed innocence of the central adolescent characters prevents the more melodramatic elements from ruining the picture. The sound acting from the tip-top cast also holds the film together: Dillon and Fisher make for extremely personable leads, with stellar support from Hoyt Axton as Jack's jolly pop Cecil, Maggie Blythe as Jack's forlorn mother Ellen, Christopher Connelly as Ginny's strict and disapproving banker father Alex, Broderick Crawford as amiable old-timer Col. Tubman, Susan Tyrell as brash prostitute Lora Mae Bouvier, Yvonne De Carlo as friendly boarding house owner Jeanene Dubois, Richard Moll as sleazy private eye Roy Logan, and Mark Atkins as surly punk Bobby Adams. John Hora's gorgeously vibrant cinematography provides a wealth of breathtaking visuals. A real sleeper.",
         "As the apprentice editor. My boss, Steve Rosenbloom, went on to edit most of Ed Zwick's films and supervise the editing of Bedford Falls shows (thirtysomething). The editor, Chris Greenbury, was English and was known for the occasional temper tantrum. I didn't know it at the time, but he was one of the fastest cutters in the business. I was seventeen and studying film at HSPVA, Houston's High School for Performing and Visual Arts. There was an actors' strike going on in Los Angeles, so the cast and crew were really top rate for a low-budget local film. I ran the edge coding machine. We worked on Moviolas in two rooms of a large hotel near Sharpstown. Cindy Fischer smiled at me once, and I saved enough money to make a 16mm film the next semester, before coming out to LA and going to film school at USC. I gradually fell into the world of software development, which I love, and recently ended up at DreamWorks. So, if you watch the title crawl at the end of Shark Tale, way below the HP logo, you'll see my second feature film credit -- nearly 25 years after my first. Gavin Doughtie"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Hanna Productions"],
      "summaries": [
         "In East Texas, the summer after high school, Jack falls in love with Ginny, the daughter of the town's banker (Jack's mom's high school sweetheart). Ginny's been at boarding school; she's headed for Vassar. Over her father's strenuous objections, she spends time with Jack. At summer's end, Jack and Ginny elope to Louisiana (where 17-year-olds can marry without their parents' permission), and he gets a job in the oil fields. Her dad hires a menacing private eye to find them, Ginny's pregnant, her town doctor gives her horrible news, and Jack's mom has her own agenda. It seems that Jack and Ginny have grown up under a liar's moon. What will these sweethearts do?",
         "A poor kid elopes with a banker's daughter."
      ],
      "budget": 0
   },
   "movielensId": 131743,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-09-01",
      "dvdReleaseDate": null,
      "directors": ["David Fisher"],
      "runtime": 106,
      "movieId": 131743,
      "title": "Liar's Moon",
      "mpaa": "",
      "actors": [
         "Matt Dillon",
         "Cindy Fisher",
         "Christopher Connelly",
         "Hoyt Axton",
         "Margaret Blye",
         "Susan Tyrrell",
         "Yvonne De Carlo",
         "Broderick Crawford",
         "Molly McCarthy",
         "Tiffany Strettner",
         "David Underwood",
         "Clint Hughes",
         "Pat Perkins",
         "Jim Greenleaf",
         "Tonja Walker",
         "Ed Holmes",
         "Richard Moll",
         "Annie Belle"
      ],
      "imdbMovieId": "0082656",
      "originalTitle": "Liar's Moon",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Matt Dillion  In East Texas, the summer after high school, Jack falls in love with Ginny, the daughter of the town's banker (Jack's mom's high school sweetheart). Ginny's been at boarding school; she's headed for Vassar. Over her father's strenuous objections, she spends time with Jack. At summer's end, Jack and Ginny elope to Louisiana (where 17-year-olds can marry without their parents' permission), and he gets a job in the oil fields. Her dad hires a menacing private eye to find them, Ginny's pregnant, her town doctor gives her horrible news, and Jack's mom has her own agenda. It seems that Jack and Ginny have grown up under a liar's moon. What will these sweethearts do?",
      "tmdbMovieId": 85948,
      "avgRating": 2.75,
      "releaseYear": "1982",
      "numRatings": 2,
      "posterPath": "/rP18begiCVMd0i9CYe2RBIjUSyU.jpg"
   }
}