{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "road trip",
            "id": 7312
         },
         {
            "name": "tourette syndrome",
            "id": 10217
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "cremation",
            "id": 208304
         }
      ],
      "imdb_id": "tt2962876",
      "video": false,
      "title": "The Road Within",
      "recommendations": [
         296025,
         253406,
         300686,
         244403,
         105531,
         80318,
         281418,
         503517,
         231616,
         254023,
         239056,
         332839,
         273610,
         50590,
         310121,
         497757,
         346684,
         128073,
         346699,
         59111
      ],
      "backdrop_path": "/7SiSlICCow2TxmeDgfv0GnWduQ3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Vincent",
               "gender": 2,
               "credit_id": "52fe4ebf9251416c75160fd3",
               "name": "Robert Sheehan",
               "profile_path": "/pamIz7pzThRsQkKHG64AL7wFhPB.jpg",
               "id": 118616,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe4ebf9251416c75160fd7",
               "name": "Robert Patrick",
               "profile_path": "/dpUIbzLpExv69faSRyww8A4ydxf.jpg",
               "id": 418,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4ebf9251416c75160fdb",
               "name": "Zoë Kravitz",
               "profile_path": "/wcl5pdFDAUyDgJ1gfQErXch6FgH.jpg",
               "id": 37153,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe4ebf9251416c75160fdf",
               "name": "Dev Patel",
               "profile_path": "/hd2Aw7JPzA0urEwFLC9yqZ5sjbj.jpg",
               "id": 76788,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Mia Rose",
               "gender": 1,
               "credit_id": "52fe4ebf9251416c75160fe3",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Monica",
               "gender": 1,
               "credit_id": "53b947060e0a2676bf009718",
               "name": "Ali Hillis",
               "profile_path": "/eGlqgtSDDMNRmJ3UFpGTCqKpAzS.jpg",
               "id": 58114,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Cop",
               "gender": 2,
               "credit_id": "53b947150e0a2676c7009ad4",
               "name": "Matt Riedy",
               "profile_path": "/k7uqz7LBD6h2SMaxk0GeID5K3ql.jpg",
               "id": 78665,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Boy",
               "gender": 2,
               "credit_id": "53b947200e0a2676bf00971b",
               "name": "Cooper Roth",
               "profile_path": "/2ZO9c3H5YUfq5iYN1n1aQtXOc3S.jpg",
               "id": 1185799,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4ebf9251416c75160fe9",
               "name": "Gren Wells",
               "profile_path": "/zVQfy9iLZ5uh4nhKqC1x88VT18O.jpg",
               "id": 518972,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ebf9251416c75160fef",
               "name": "Gren Wells",
               "profile_path": "/zVQfy9iLZ5uh4nhKqC1x88VT18O.jpg",
               "id": 518972,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ebf9251416c75160ff5",
               "name": "Brent Emery",
               "profile_path": null,
               "id": 63717,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ebf9251416c75160ffb",
               "name": "Bradley Gallo",
               "profile_path": null,
               "id": 1160627,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ebf9251416c75161001",
               "name": "Terel Gibson",
               "profile_path": null,
               "id": 1182914,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ebf9251416c75161007",
               "name": "Angela Demo",
               "profile_path": null,
               "id": 1021206,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ebf9251416c7516100d",
               "name": "Barbara J. McCarthy",
               "profile_path": null,
               "id": 1176357,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe4ebf9251416c75161013",
               "name": "Nanci Roberts",
               "profile_path": null,
               "id": 1046590,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.593198,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 228108,
      "vote_count": 149,
      "budget": 0,
      "overview": "A young man with Tourette's Syndrome embarks on a road trip with his recently-deceased mother's ashes.",
      "similar": [
         11421,
         8272,
         24684,
         773,
         112160,
         376867,
         244772,
         277216,
         258480,
         43923,
         376660,
         45153,
         1391,
         8967,
         19908,
         598,
         858,
         14,
         73,
         11282
      ],
      "original_title": "The Road Within",
      "runtime": 100,
      "poster_path": "/hqzCjPRNPigo8ProocH99N6tjT4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Amasia Entertainment",
            "id": 15465,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Troika Pictures",
            "id": 15462,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Coup d'Etat Films",
            "id": 17379,
            "origin_country": ""
         }
      ],
      "release_date": "2014-10-24",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gren Wells"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Florian David Fitz",
         "Gren Wells"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2962876/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTU3NDgwNDUzMl5BMl5BanBnXkFtZTgwMjQ0NDA5NDE@._V1_UY268_CR9,0,182,268_AL_.jpg",
      "actors": [
         "Zoë Kravitz",
         "Robert Patrick",
         "Dev Patel"
      ],
      "reviews": [
         "So I just finished watching this film and I would first like to say, if you're looking for an exciting and riveting plot; you've come to the wrong place. However, if you prefer a story with incredibly compelling characters played by incredibly talented actors, than you definitely need to watch this movie. Robert Sheehan, who plays Vincent, does a remarkable job portraying someone with Tourette's without going overboard. Although some of what he says during his ticks are funny, you can tell that they also cause him agony and they is shown through his facial expressions and his tone of voice. Similarly, Dev Patel who plays Alex does another remarkable job of playing someone with OCD (at least in my opinion). Zoe Kravitz's character is both witty and carefree but also intensely tragic. I believe this movie has a good combination of feel good moments and moments where you truly empathize with the characters. Though the concept of a road trip plot is slightly overdone, the landscapes are beautiful and the three young actors have a way of keeping you interested and entertained the entire time. You find yourself wanting to know all of them on an even deeper level which I believe is quite telling of how compelling they are. There were moments that were difficult to watch and made me a bit emotional while there were also scenes where I laughed out loud. It really gives you a perspective on what it is like with a mental illness, especially as a teenager and the complications that they cause. Overall, not a perfect flick but Kravitz, Patel, and Sheehan are definitely worth checking this film out.",
         "I thought this movie was absolutely remarkable. I was scrolling through Netflix for a fun movie with a little bit of drama and I came across this one. I wasn't completely intrigued by the short summary but gave it a shot because (as all Netflix viewers are) I was tired of scrolling. Little did I know, I would fall in love with the movie. This movie made me fall in love with the characters, their hearts, and emotions. It also really truly opened my eyes about mental disorders in a way that I couldn't have imagined. It showed me what these people truly go through and how a little bit of support can change how they live in the world. It was a story of strength, realizing ones self and also understanding other's emotions as well as your own. It's about building new relationships and fixing past relationships with patience and proper guidance. It's truly a satisfying movie. Even better, was that the acting was phenomenal by all 3 leads. It was stunning, and beautiful. Made me want to have a story like all 3 of them, and make friends they way they did. Watch this movie if you want something different, but also warm and friendly. It's like a new genre that has yet to be recognized. It's phenomenal, and if you watch it you'll know why.",
         "Wow! I laughed, cried, throughout this movie. I was amazed to find out that this was a directorial debut for director/writer Gren Wells. If you love falling in love with characters as they head on their journey, this movie is for you! Through the seriousness of the disorders this movie takes on (which, by the way, were beautifully portrayed by Kravitz, Patel and Sheehan) I was able to feel with them, laugh with them, and cry with them. The Tourette's Syndrome, OCD, and Anorexia that they took hold of was captivating. I could tell that a whole lot of thought was put into researching Tourette's by Gren Wells and Robert Sheehan because they gave us just enough of Tourette's. It would have been extremely easy to portray too much of ticks and mannerisms and make him look silly, but fortunately his interpretation was sincere and gave us just enough. I applaud him and the whole cast for the care they took with their characters and their corresponding illnesses. I would call this film 'careful' in the greatest way. It is extraordinary to find a director paired with an outstanding cast that take great care in their art. I loved it!",
         "Absolutely loved this movie! It gives you real empathy for the things people and their families with these disabilities go through. It will make you want to cry at times but there are many laugh out loud moments. Somehow director, Gren Wells, manages to draw you into their world so that you laugh with the characters rather than at them, at the same time as you feel their pain. Can't say enough about the acting in this! Robert Sheehan, Dev Patel, and Zoe Kravitz are each outstanding and portray heartbreakingly real characters. Robert Patrick is wonderful as the frustrated father with no understanding of how to cope with his son and his challenges. Kyra Sedgewick as the doctor and director of an experimental program, is well cast and believable. Don't miss this one!",
         "A very good drama-comedy which mixes the 2 elements of drama and comedy perfectly, which in many cases is not the case Perfectly cast as well Robert Sheehan is excellent in the lead, you truly believe that he has Tourette's syndrome and Zoe Kravitz just keeps on proving with every movie she makes that she is a force to be reckoned with and I wouldn't be surprised at all if she got a Academy Award nomination for best supporting actress for this I've never seen Robert Patrick better and feel more real than in this one A must see if you like independent dramedies",
         "Thoroughly entertaining film. Simple story line. However the characters really build on you. They are interesting. A film with a million facial expressions. Excellent portrayal of facing your demons. Definitely worth watching. The characters are more easily portrayed for the actors due to the illnesses they each carry. They are portrayed as on the extreme of each illness, each being severe. However, the balance is good, surprisingly (and with great humor) it is never too over the top and stays believable. They each struggle with the extra water they try to carry through their lives. The main three deliver a great performance, I felt attached and I must admit I needed to shed a tear.",
         "Two things you should know about this film. 1. It works and you should see it. I don't want to make this more complicated than it needs to be. Humanistic films about an individual's problems set against the backdrop of a \"road trip\" are a tried-and-true Hollywood formula (think RAIN MAN, one of many) and this is one of the best. The characters are empathetic and engaging, the script is tight, and the direction by Gren Wells shows complete control of colors and settings (reminding me in many ways of the brilliant use of color in the series SENSE8). The two seasoned pros, Patrick and Sedgewick, are great but the young stars are nothing short of magnificent. Just see it. 2. Zoë Kravitz basically channels a young Angelina Jolie from the first moment she appears in frame to the last. Her performance is hypnotic, the camera loves her, you likely will too, and one expects to see a lot of more of her in films and in years to come.",
         "'THE ROAD WITHIN': Four and a Half Stars (Out of Five) A remake of the 2010 German drama flick 'VINCENT WANTS TO SEA'; about a teen with Tourette Syndrome, who befriends two other patients (one with OCD and one with anorexia) at the behavioral facility his dad enrolls him in. They steal their doctor's car and embark on a road trip together, to the coast. The film was written and directed by Gren Wells (in her directorial debut) and it stars Robert Sheehan, Dev Patel, Zoe Kravitz, Kyra Sedgwick and Robert Patrick. I enjoyed it immensely. Vincent (Sheehan) is a teenager, that's suffered from Tourette's disorder; most of his life. His mother, who he was very close to, recently passed away; and his father (Patrick), who he's long resented, wants to enroll him in a special clinic. Once there, he's roomed with Alex (Patel); a young British man, with obsessive compulsive disorder. Alex is furious that he has to share his room with another person, and he immediately takes a disliking to Vincent. Vincent also meets Marie (Kravitz), at the facility, who he's immediately attracted to. Marie has a severe eating disorder, and pretty much won't eat anything. After Marie and Vincent get into trouble, with their doctor (Sedgwick), they decide to steal her car and head to the coast; so Vincent can spread his mother's ashes there. When Alex catches them in the act, they kidnap him and take him along with them. The movie is equally funny and emotional. It's not overly heartbreaking though; as it has a lot of optimism, and a great deal of compassion (for it's characters). What I really love about the film, though, are the performances; Sheehan, Patel and Kravitz are all amazing in it (and Patrick and Sedgwick aren't bad either). I found the three lead characters to be all very likable, and relatable too, despite their flaws. It's a very touching and well made movie, especially for outsiders and misfits (like most great films are). Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=4wOi4IC8bxg",
         "Superb movie! incredible acting all around. The pacing of this movie was perfect for engagement as well as reflection. Many, many precious moments.Going on a road trip together was the perfect vehicle to afford the 3 main characters to focus on themselves and begin to heal themselves and each other. Just ideal envelope for their mutual growth...almost like an incubator. Mindful development of Dad's journey---no cheap cliché of Dad being all wrong about everything. I really grew to cherish the friendship created out of pain, honesty and resilience. Just loved the film. Amazing that this is a first-time Director!!",
         "As one who has lived with Tourette's myself and as a parent, I was pleased at how accurately this was portrayed. Robert Sheehan was most impressive and expressive. This actor conveys such sad torture with his eyes whilst in the throes of episode, I just wanted to hug him. Though many with Tourette's display the tics and vocalizing rather than the verbal profanity often used to show example, this film got all angles right. The words of the father in regard to his son made me cry...the writer/director must have dealt with this in life as she got the raw emotion of this disorder from the eyes of both parent and child. The Tic Code starring Christopher Marquette and the late Gregory Hines is another revelation in film focusing on life with and the parenting of one with Tourette's. The way The Road Within ties together OCD, anorexia and Tourette's with these brilliant young performers had me wishing it had debuted bigger and they had received far more accolades for their work. Along with Robert Sheehan, Zoe Kravitz is a study in subtlety without being dull and Dev Patel is all palpable anxiety. Robert Patrick's guilty dad believably shows his true colors and Kyra Sedgwick makes an easy piece as caring clinical director her own. This film should be shown in psychology courses for study.",
         "This movie definitely wasn't what I expected when I started watching it, I didn't read the description and just thought it'd be pure comedy with the pictures it had, as has been said though, it was different, pleasantly surprising. The movie does an amazing job defining the individual characters histories, problems and loneliness in a world dominated with judgement. It is a nice mix of comedy with seriousness in it. This is definitely not for the feint heated as it has lots of swearing, sexual scenes and some blood / fighting in it. All in all, I enjoyed it very much. I'd love to watch this movie again in the near future..",
         "This movie is a cheering (and serious) tale about complicated people sharing a complicated trip to the ocean. The story rolls with a wonderful narrative balance and the result is very entertaining. At the end I wondered who wrote and directed it and found out it was another astonishing female writer/director of these latter Movie years (Gren Wells). Then I asked myself (probably influenced by the Psychoanalytical atmosphere of the movie) why I rated it 8 and not 10. And it was simply because it was too easy for me (as it probably will be for you) to see what was going to come. A small lack of originality however does not affect the overall result, that remains really good. Moreover the movie offers the chance to put a new word in our vocabulary: Abreaction. Maybe you never heard it before but it's easy to figure out its meaning: it's what the story is about.",
         "I found this small movie on Netflix streaming, it apparently was released at several film festivals but never was in theaters. Robert Sheehan is Vincent and we are introduced to him at his mother's funeral. He says some very inappropriate things as the minister is speaking and we soon figure out he has Tourette's. His father, Robert Patrick as Robert, a politician running for office, appears to be at the end of his rope with Vincent and has arranged for him to placed in an institution for misfits. There he gets paired with Dev Patel as Alex, an OCD clean freak who strongly objects to having a roommate. And he is shown around by Zoë Kravitz as Marie who is rail thin and fighting Anorexia. The institution is run by Kyra Sedgwick as Dr. Mia Rose. Each of the three misfits need to resolve old issues and they get a chance as they are thrown into an unlikely road trip from the institution in Nevada to the Pacific Coast, where Vincent wants to carry his mother's ashes. He has a photo of her there and she seems the happiest to him. The road trip of course doesn't go smoothly, starting with their stealing Dr Rose's car but without money or an operating credit card. Their detour takes them through Yosemite National Park and the cinematographer dwelled nicely on scenes with Half Dome and the characters. They eventually work their way to Santa Cruz and in the process are able to learn how to gain some control over their respective issues. It is ironic for me, just 3 weeks ago I made my first visit to Santa Cruz for a mini-vacation and now I see it again in this movie! Not a great movie by any measure but very interesting if you like to see misfits trying to cope with ordinary life.",
         "This is a truly beautiful and tender film. It Portrays three individuals with quite severe mental illnesses, and shows all of us a path to recovery via compassion and a sense of humor. The script is fantastic, and the acting/directing is sublime.Zoe Kravitz and Dev Patel are artists to be admired, but they outdo themselves in this film.",
         "I was absolutely blown away by this movie. I thought it was brilliantly done and is award worthy. Definitely a must see, especially for those suffering from any form of mental illness within their lives. I had never seen any of these actors before but I thought they did an amazing job. I can definitely see how some people could be put off by this movie but you need to have an open mind and an understanding heart to truly appreciate it. I love movies with a parent vs. child struggle and I love it even more when both the parent and child learn a lesson in the end and are able to settle their differences and see eye to eye. You are able to feel for all of the characters and the writing is truly poetic. My favorite part in the movie was how music positively effected the moods of Alex and Vincent. I have heard that music can effect our brainwaves and I found it amazing that this was so comforting for them. The only reason I am not giving it a perfect score is because I wish they had chosen to portray OCD in a manner aside from the \"germ phobia.\" This is the most commonly depicted form of OCD but it is by far the most common. OCD manifests in many different ways and I wish they had chosen to illustrate that more in Alex. But I still think his transformation was brilliantly done. There are definitely some disturbing elements of the movie but I feel that the beauty and growth that the characters experience far outweigh any of their tragedies.",
         "He has Tourette syndrome. Her father does not know what to do with him, and his mother died. So it is parked in an institution where he befriends an anorexic and a boy suffering from obsessive compulsive disorder. The film and WONDERFUL, laugh, cry, travels along all human emotions stripping them of And every garment and leaves naked in front of of a mirror that you put on the wall and will not let you escape, because the naked truth is that you can not bury it in the sand but it always comes back out. It's not easy to make a film with similar topics without resulting in ridiculous or offensive. Robert Sheehan and extraordinary, talented actor here demonstrates all his artistic and professional, in defiance of many actors become famous and you lack talent. VOTE 10 you have to see",
         "Vincent(Robert Sheehan) is a young man with Tourettes Syndrome. The Road Within opens with Vincent in a church screaming obscenities while a priest is saying Mass. His father places him at a private facility where he is roomed with Alex(Dev Patel), who suffers from obsessive compulsive disorder and is a germ freak who can never be touched. They are soon joined by Marie(Zoe Kravitz) who has Anorexia. Maria steals their doctor's car keys and thus begins a very different road trip. The three main actors are magnificent, with a natural chemistry. The story alternates between funny and heartbreaking with ease. The final scenes are a bit sentimental, but I still would recommend The Road Within for its' positive outlook on life.",
         "Despite some of the cheesiness and predictability of this film, there were some moments of pure beauty. I don't think the critics quite understood what this film may mean for people with disabilities. It implies that no matter what may hold you back in life, as long as you have friendship, bravery, and commitment, you can strive to achieve pretty much anything. As Marie (played by Zoë Kravitz), Alex (played by Dev Patel), and Vincent (played by Robert Sheehan) made their way closer to the ocean, they also grew closer together and stronger in their fight against their disabilities. The film was mediocrely structured as it seemed to keep drawing focus away from the overall message. Nevertheless, the message was received by myself and by many others as well. Gren Wells wrote the characters so accurately, yet so innocently, and was able to make audiences laugh about the disabilities rather than feel uncomfortable about them. Overall I give this film 7/10 stars.",
         "Vincent Rhodes (Robert Sheehan) suffers from Tourette Syndrome. After his mother's death, his estranged father Robert (Robert Patrick) sends him away for treatment. He is roomed with obsessive clean freak Alex (Dev Patel). He falls for anorexic Marie (Zoë Kravitz). He and Marie run away stealing Dr. Rose (Kyra Sedgwick)'s car. Alex is going to tell on them so they kidnap him. The trio have an adventure as Robert and the doctor pursue them. Robert is unable to call the cops because of his political ambitions. These are three interesting young performers in a fun road trip. They have great chemistry together. Zoë is enchanting and Dev is funny. I've been a fan of Sheehan since Misfits. As long as the movie stays with the group, it is perfectly fine. I find the ending satisfying. The three characters have their potholes in the road. They're not completely fixed in the end but they are better which is expected for this type of movie. Patrick and Sedgwick form the other half of the movie. Some of their scenes could be cut. In many ways, they are unimportant. I would rather spend the time with the trio as they work out their issues.",
         "So mental illness is something I struggle with. One of the major ones is OCD. I'm tired of movies and shows portraying OCDers as germaphobes. OCD can be much more complex than that. As well, for tourettes, I don't know anyone who has it, but I got the sense it was being used as comic relief and was slightly exaggerated. As far as the female character goes, not all women with eating disorder are the \"rebel type\"... I believe the films creators had good intentions though. The level of filmmaking is only mid tier, as they relied on way too many tropes. Tropes I've seen seeing since I was a little feller and watched my second movie. It was also quite predictable. Honestly though, I don't know if someone with mental illness would write a movie like this and I wonder if the screenwriter even has mental illness himself, or just thought it'd be a \"touching\" story, with the Oscar statue lingering in the back of his mind. Still, it's hard to resist the journey the characters go through and the way they bond over their illnesses. As someone who's been there myself, I know that bond can be very powerful. Social Stigma is still very strong and it's hard to find someone suffering from a debilitating disease that is going to open up to you and be your friend. I also appreciated the use of music in this film. At first, I thought I left my Classical playlist running, but it was just Dev Patel playing Bach while he madly cleaned his room from germs. It snyched pretty well. The other songs were perfect for the scenes as well. Yet this is the only artistic merit I would grant this movie. Stil, I gave it a 7 because overall I think it depicted metal illness sufferers as real, hell even normal, people. It was fast paced, quick and to the point. I enjoyed watching it. Oscar Contender or Indie favorite it is not, it still kept me entertained.",
         "I saw this film and thought why not it will pass the time, however it was surprisingly upbeat, I didn't expect this because of the issues that are raised in this film. It all boils down to one thing and that is finding friendships in the most strangest of places and circumstances. This also touches upon family relationships which really shines in this film and makes you realise what's really important in life It was one of those films where you want to see more however it left you wondering. Its a top film and I would highly recommended it. The acting was brilliant and touching. WELL WORTH THE WATCH :)",
         "I enjoyed the movie right up until the end. The ending felt rushed, and well lame. A big build up then nothing. I took off 1 to 2 points because of that. Would I recommend it to others? Maybe, it depends on the situation. ***Spoiler Alert*** Why would the boy just hand over the ashes of his mother that he loved so dearly just because his father says \"I know what to do with them\" or something of that affect and the boy just walks off. Wouldn't the father who is just now reconnecting with his son say \"I know where she would like her ashes, lets go there together\"? Nothing was done with the girl. The boy says \"I can't help you\" and runs off???",
         "This is another example of where the score shown on IMDb (in this case 7.1) is no indication at all of the merit of a movie. Usually, my own rating is within a hair of the IMDb score; not in this case. This was 96 minutes of Hell for me. I didn't warm to any of the characters at all and I actively disliked most of them. Please, before anyone accuses me of not understanding or of being insensitive to mental illness, I am personally acquainted with it and have a much better understanding than most. This terrible movie made OCD and Tourette's syndrome look almost like fun; I have the impression that we were supposed to laugh every time Vincent went into one of his unconvincing profane rants or when Alex's OCD manifested in some particularly silly way. It probably wasn't the film-makers' intention to belittle the suffering of individuals affected by these conditions. But, all the same, this movie had at least the appearance of a comedy despite the fact that I didn't laugh even once. I had a complete lack of sympathy for the three sufferers and a dreadful desire for this lot of tripe just to end. Thankfully, I didn't pay much for the DVD. It's not one I'll ever watch again, so very poor was the movie. Please don't waste your time on this crap."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Amasia Entertainment",
         "Troika Pictures",
         "Coup d'Etat Films"
      ],
      "summaries": [
         "The Road Within is about Vincent, a young man suffering from Tourette Syndrome. His mother dies so his estranged father, Robert, is forced to step in. However, Robert's running for political office and doesn't want his son on the campaign trail - so Robert puts Vincent in a clinic that's run by the unconventional Dr. Mia Rose. Once there, Vincent falls in love with an anorexic woman named Marie. Together, they steal Dr. Rose's car, and end up having to kidnap his OCD roommate, Alex, when he threatens to tell on them. With Robert and Dr. Rose in hot pursuit, Vincent, Marie and Alex go on a life changing road trip to deliver the ashes of his mother to the ocean.",
         "A young man with Tourette's Syndrome embarks on a road trip with his recently-deceased mother's ashes."
      ],
      "budget": 0
   },
   "movielensId": 131920,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-10-24",
      "dvdReleaseDate": null,
      "directors": ["Gren Wells"],
      "runtime": 100,
      "movieId": 131920,
      "title": "The Road Within",
      "mpaa": "R",
      "actors": [
         "Robert Sheehan",
         "Robert Patrick",
         "Zoë Kravitz",
         "Dev Patel",
         "Kyra Sedgwick",
         "Ali Hillis",
         "Matt Riedy",
         "Cooper Roth"
      ],
      "imdbMovieId": "2962876",
      "originalTitle": "The Road Within",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["-MYzi2TPRcM"],
      "plotSummary": "A young man with Tourette's Syndrome embarks on a road trip with his recently-deceased mother's ashes.",
      "tmdbMovieId": 228108,
      "avgRating": 3.5,
      "releaseYear": "2014",
      "numRatings": 88,
      "posterPath": "/hqzCjPRNPigo8ProocH99N6tjT4.jpg"
   }
}