{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3112966",
      "video": false,
      "title": "Luton",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jimmy",
               "gender": 0,
               "credit_id": "52fe4e05c3a368484e209cd1",
               "name": "Nicholas Vlachakis",
               "profile_path": null,
               "id": 1223381,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe4e05c3a368484e209cd5",
               "name": "Eleftheria Komi",
               "profile_path": null,
               "id": 1223382,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Makis",
               "gender": 0,
               "credit_id": "52fe4e05c3a368484e209cd9",
               "name": "Christos Sapountzis",
               "profile_path": null,
               "id": 1223383,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4e05c3a368484e209cc1",
               "name": "Michalis Konstantatos",
               "profile_path": null,
               "id": 1200309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e05c3a368484e209cc7",
               "name": "Michalis Konstantatos",
               "profile_path": null,
               "id": 1200309,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4e05c3a368484e209ccd",
               "name": "Stelios Likouresis",
               "profile_path": null,
               "id": 1223380,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.151943,
      "production_countries": [{
         "iso_3166_1": "GR",
         "name": "Greece"
      }],
      "id": 215658,
      "vote_count": 4,
      "budget": 0,
      "overview": "Jimmy, Mary and Makis are three people living their everyday day life in an entirely different manner. They seem to have nothing in common and normally they shouldn’t even know each other…",
      "similar": [],
      "original_title": "Luton",
      "runtime": 100,
      "poster_path": "/m9fg97kcjmgoJXDUkeb703Qf70Y.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-10-10",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Greece",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Michalis Konstantatos"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Michalis Konstantatos",
         "Stelios Likouresis"
      ],
      "originalLanguage": "Greek",
      "imdbLink": "http://www.imdb.com/title/tt3112966/",
      "coverLink": null,
      "actors": [
         "Nicholas Vlachakis",
         "Eleftheria Komi",
         "Christos Sapountzis"
      ],
      "reviews": [
         "Titling a film \"Luton\" after a town in the South of the UK and referring to it in passing during one scene (besides having a film poster with an image that evoke the Luton Football Club logo) may be one of the high points in the history of this small and apparently uneventful town, but as far as the film goes it could have been called \"Momotombo\" of \"Limbo\". It is a catchy title anyway and intriguing too, just as scene after scene we are invited to contemplate the everyday life of three persons for more than an hour: a high school student, a woman lawyer and a shop owner. As it has become the norm in observational cinema, watching is believing, watching is learning and discovering too. After an image stays with you for more than 10 times the average shot length of you common action movie, it becomes something else: what it \"turns into\" is a personal thing, for it is a subjective experience: you may infer drastically different interpretations than any other viewer, but that is precisely the pleasure of watching without explanations. And then bang! The last minutes turn upside down all your preceding conjectures. It is true that it is not a new strategy: it has been done before. The one that came to my mind was the Spanish film, \"The Hours of the Day\", only that this time the proposition is more complex. The three characters, each determined by his/her different milieu, each different from the other, they finally reveal that life is a mirror that reflects similar inner fears, no matter the differences of age, sex, social class. There is also a sociological and maybe political reading that should be easier to make for a Greek spectator, but as it is, as a panorama of life in the beginning of a new era (of 2000 years each) or (worst) the ending of an age, when life as we know it is coming to an end, \"Luton\" is a powerful expression of how demoniacally unethical we have become. A welcome applause for Michalis Konstantatos's first feature.",
         "Please spare yourself the trouble of being exposed to this cheap pile of artistic manure. When I say cheap I'm not referring to the production value but the writing itself. With the effort that someone would put into a bowel movement after eating 3 kg of jalapeños coated in hot sauce, the director/writer attempts to shock, kind of, and provoke, kind of, but never seems to have the testicular fortitude, scope of vision or emotional depth to do so. The dialogues are so wooden they might as well have been written by Pinocchio, the plot is so predictable it's borderline painful and would be if you weren't already writhing on the floor from the excruciatingly slow pace. The movie culminates in a climax so uninventive and uninspired that it would be worthy of a student movie that got a D."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Horsefly Productions",
         "Faliro House Productions",
         "Greek Film Center"
      ],
      "summaries": ["Although they seem to have no relations, the lives of a young trainee lawyer in her thirties, a wealthy high school boy trapped within the manners and etiquette of his social class, and a man who owns a convenience store, have a deeply visceral connection, that leads to a chaotic and violent ending, that mirror Greece's years of turbulence in the 2010s."],
      "budget": 690
   },
   "movielensId": 132066,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-10-10",
      "dvdReleaseDate": null,
      "directors": ["Michalis Konstantatos"],
      "runtime": 100,
      "movieId": 132066,
      "title": "Luton",
      "mpaa": null,
      "actors": [
         "Nicholas Vlachakis",
         "Eleftheria Komi",
         "Christos Sapountzis"
      ],
      "imdbMovieId": "3112966",
      "originalTitle": "Luton",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jimmy, Mary and Makis are three people living their everyday day life in an entirely different manner. They seem to have nothing in common and normally they shouldn’t even know each other…",
      "tmdbMovieId": 215658,
      "avgRating": 2.33333,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/m9fg97kcjmgoJXDUkeb703Qf70Y.jpg"
   }
}