{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0076725",
      "video": false,
      "title": "Sleeping Dogs",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Smith",
               "gender": 2,
               "credit_id": "52fe46589251416c91051745",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gloria",
               "gender": 0,
               "credit_id": "52fe46589251416c91051749",
               "name": "Nevan Rowe",
               "profile_path": null,
               "id": 118140,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bullen",
               "gender": 2,
               "credit_id": "52fe46589251416c9105174d",
               "name": "Ian Mune",
               "profile_path": "/iV8i8vAgJOY7edzXqx0D1TT0gO8.jpg",
               "id": 7255,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Col. Willoughby",
               "gender": 2,
               "credit_id": "52fe46589251416c91051751",
               "name": "Warren Oates",
               "profile_path": "/pZG3khTobQkIpGuIyd8DpcJRniT.jpg",
               "id": 8255,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dudley",
               "gender": 2,
               "credit_id": "52fe46589251416c91051755",
               "name": "Ian Watkin",
               "profile_path": "/tRisacMchEHc1chzNO81x0qwZ7A.jpg",
               "id": 11335,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jesperson",
               "gender": 0,
               "credit_id": "52fe46589251416c91051759",
               "name": "Clyde Scott",
               "profile_path": null,
               "id": 118141,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mary",
               "gender": 0,
               "credit_id": "52fe46589251416c9105175d",
               "name": "Donna Akersten",
               "profile_path": null,
               "id": 81875,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Cousins (as Bill Johnson)",
               "gender": 0,
               "credit_id": "52fe46589251416c91051783",
               "name": "William Johnson",
               "profile_path": "/b5cYHL0BJ8DlMML18ZlrSF6ZlMp.jpg",
               "id": 1166385,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Taupiri",
               "gender": 0,
               "credit_id": "52fe46589251416c91051761",
               "name": "Don Selwyn",
               "profile_path": null,
               "id": 7263,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Elsie",
               "gender": 1,
               "credit_id": "52fe46589251416c91051765",
               "name": "Davina Whitehouse",
               "profile_path": "/5GqGsCLEYqzsUVWrYrQnfkMhbrx.jpg",
               "id": 118142,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Melissa",
               "gender": 0,
               "credit_id": "52fe46589251416c91051769",
               "name": "Melissa Donaldson",
               "profile_path": null,
               "id": 118143,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "News Reader",
               "gender": 0,
               "credit_id": "52fe46589251416c9105176d",
               "name": "Dougal Stevenson",
               "profile_path": null,
               "id": 118144,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Prime Minister",
               "gender": 0,
               "credit_id": "52fe46589251416c91051771",
               "name": "Bernard Kearns",
               "profile_path": null,
               "id": 118145,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "52fe46589251416c91051775",
               "name": "Raf Irving",
               "profile_path": null,
               "id": 118146,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Old Maori Man",
               "gender": 0,
               "credit_id": "52fe46589251416c91051779",
               "name": "Tommy Tinirau",
               "profile_path": null,
               "id": 118147,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46589251416c9105177f",
            "name": "Roger Donaldson",
            "profile_path": "/AeqGthH9k1e7FJ8XJHycFNPQVvT.jpg",
            "id": 21370,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.448924,
      "production_countries": [{
         "iso_3166_1": "NZ",
         "name": "New Zealand"
      }],
      "id": 37582,
      "vote_count": 6,
      "budget": 0,
      "overview": "Recluse Smith (Sam Neill) is drawn into a revolutionary struggle between guerillas and right-wingers in New Zealand. Implicated in a murder and framed as a revolutionary conspirator, Smith tries to maintain an attitude of non-violence while caught between warring factions. Written by Mike Welsch",
      "similar": [],
      "original_title": "Sleeping Dogs",
      "runtime": 107,
      "poster_path": "/cf61pYwtld9IwJLePLQlaoe1oG9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "New Zealand Film Commission",
            "id": 294,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aardvark Films",
            "id": 6052,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Broadbank Investments",
            "id": 12821,
            "origin_country": ""
         }
      ],
      "release_date": "1977-10-06",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": "NZD ",
      "directors": ["Roger Donaldson"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Christian K. Stead",
         "Ian Mune"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076725/",
      "coverLink": null,
      "actors": [
         "Sam Neill",
         "Nevan Rowe",
         "Ian Mune"
      ],
      "reviews": [
         "As far as I'm aware, Sam Neill's first film - and what a start! Starring a Kiwi, directed by a Kiwi and packed to the gunwales with Kiwi talent, this is definitely no Hollywood hyperbole extravaganza.Its sole concession to the 'star power' syndrome is the presence of Warren Oates (\"Dillinger\") as an armed subversive type (I didn't dare to use the dreaded 'T' word!). The film is under the very capable guidance of the now-also-well-known Roger Donaldson, who was also responsible for another powerful home-grown effort, \"Smash Palace\". Impressionable youngsters like Peter Jackson may have seen this and decided their futures. Like Jackson's LOTR trilogy, \"Sleeping Dogs\" is filmed on location in New Zealand. As such, the sets and scenery give a fair idea of life in provincial and metropolitan NZ in the mid-70's (but there's no stunning vistas of the majestic Southern Alps here, I'm afraid). \"Sleeping Dogs\" is an adaptation of a story by New Zealand author C.K.Stead and pits an increasingly autocratic government of the near-future against a group of resistance fighters. Smith (Neill), very recently separated from a cheating wife, pretty much accidentally and quite reluctantly, gets involved with this group. One scene in the movie was (and still is) something of a talking point here in NZ because it seemed, in hindsight, so chillingly prescient - life imitating art. In the scene, a large group of protesters have clashed violently with unyielding, merciless, baton-wielding riot police; blood is flowing, injures are rife. Some five years after the film had been released, in 1981, the then-internationally-banned Springbok rugby team from South Africa were allowed to tour here, despite clamorous local and global opposition. New Zealand experienced the horrors and scarring of civil division. Wherever the Springboks played and also in the capital, Wellington, violence erupted. And it seemed to many of us at the time that the scenes that Donaldson had shot many years ago were now being replayed almost nightly on the news. Spooky.",
         "I remember trying to see this film when I was 12 or 13 but the friend who bought the tickets ending up buying tickets for The Magic Roundabout and the Blue Cat. What a disappointment at the time. Seeing it for the first time subsequently, the optimum word is prescient. Donaldson showed scenes that were fresh and on a scale never scene in NZ cinema before. Skyhawks dropping bombs on the terrorists (Mune and Neill). \"Spooky\" is the word most used by those who have commented in this forum. Having met Carl Stead last year in London, I was impressed by his philosophy regarding the films success in NZ at the time. Comprimises were made to the author's chagrin but in the end the story fulfilled its cinematic requirements. Donaldson along with Geoff Murphy were pioneers of a new revolution in film-making for New Zealand. The first NZ film I had seen that opened up the dark under belly of an immature and isolated nation in troubled times. The movie is dated now but the impact in context of the time it was made is undeniable.",
         "This film is a chilling view of how New Zealand could be if ruled by a totalitarian oppressive Government, like so many other countries around the world. It focuses primarily on one character named Smith (played by the now famous Sam Neil). The direction is excellect thanks to the talents of Roger Donaldson (Dantes Peak). But if you read those names and expect a big budget, action-packed, thriller your out of luck, it was made back in 1977 when they were starving artists. This may not appeal to those unfamiliar with New Zealand, but its worth a look if you like well scripted well acted emotional movies",
         "Based on the novel Smith's Dream by academic C. K. Stead, Sleeping Dogs is set in a totalitarian New Zealand. Smith moves to the country to escape trouble but is framed by the state as a terrorist.The rest of the film involves his attempts to avoid arrest and his eventual fate. Released in 1977, the film possessed a poignancy for New Zealanders, who at the time viewed the then Muldoon National Government with some suspicion. A scene involving riot police in an Auckland street was a chilling portent of events during the 1981 Springbok rugby tour to New Zealand, and indeed on its release in the USA, some Americans confused the film's images with media reports of the tour protests. Notable for Sam Neill's role as Smith, the movie started a late 1970s revival in the New Zealand film industry, including movies such as The Scarecrow, Skin Deep, and Smash Palace.",
         "'Sleeping Dogs' was the first major New Zealand feature film to find a wider audience. Featuring a young Sam Neill as a loner caught up by accident in the fight between a Fascist government taking control and those resisting the loss of freedom. The film is directed by Roger Donaldson (whose main stream movies include 'World's Fastest Indian','Dante's Peak' and 'Species') and is based on the excellent book 'Smith's Dream' by C.K.Stead. It features Warren Oates (US) and Ian Mune (who co-wrote the screenplay) as well as a cast of other New Zealand regulars. While action packed the human drama behind the movie is also of interest and the DVD (a double with 'Smash Palace') features an excellent making of documentary highlighting the issues of making a movie in New Zealand in the mid-1970's. This is an excellent movie which realistically portrays a nation accepting the gradual loss of freedom for all the right reasons - which seems very topical even today. The story will grip you and the end will... well see it for yourself!",
         "I first saw this on Channel 4 away back in 1986 and as far as I know it was its only broadcast on British network television and was impossible to find in the preceding years . It was a film that stayed in my memory and I often wondered if it was as good as I remembered . After just seeing it again after an interval of more than 25 years I'm happy to report that my memory hasn't cheated and is every bit as good as I remember it My own knowledge of New Zealand is that it's a country of great natural wilderness . It's slightly bigger than mainland Britain but only has a population of 4 million . New Zealanders I have met have been uniformly friendly and any conversation quickly gets round to either rugby or hiking in the mountains and forests of their homeland . The only complaint Kiwis have of their country is that life there is very mundane and boring . Bearing this mind the scenario of SLEEPING DOGS means if life is grim as it is seen here what hope is there for the rest of humanity ? From a film making point of view it's a movie that is rather flat and low key and this shouldn't be taken in any negative way . The budget could have been bigger but instead of spectacle we're shown the very human elements of political chaos . By that I mean people just want to get on with their lives but are unable to due to a violently repressive state on one side and revolutionaries trying to the state by a system of government that may be just as bad It's interesting how much resonance the film has with New Zealanders on this page but when the film was produced and indeed when I saw it in the mid 1980s the scenario was being played out for real in the killing fields of South America where people would simply \" disappear \" if they'd make their political ideas too well known to the wrong people . Thankfully we've moved on from the dystopian future as seen here",
         "Today I finally got a DVD of \"Sleeping Dogs\" and got to watch it in a wide-screen version for the first time. As a big fan of Warren Oates, I was first interested in this film because of his character. His film \"Dillinger\" is frequently mentioned, and I also recall his excellent work in \"Bring Me the Head of Alfredo Garcia\", \"Black Thunder\" and \"Badlands\". In \"Sleeping Dogs\", it's impossible to ignore Sam Neill as he struggles to survive forces outside his control. I don't know if it's his first film or not, however it's the first one I recall ever seeing him. Coincidentally, I'm also watching the new DVD release of \"Max Headroom\", and it's hard to keep the two films from intermixing. Repressive governments, random violence, all the things that make films like both of these fun to watch again and again. In this genre, I would also add \"Brazil\". \"1984\" goes without saying.",
         "I recall being confused the first time I saw this film, not long after it was first released, probably due to being young and naive at the time. Having revisited the film 30 years later I find that I have been able to follow the subtleties of the plot more easily. The movie is a commentary on life's challenges and how one young man - Smith (Sam Neill) - responds to some of these challenges. I like this movie now because not only does it show something of New Zealand's past and the possibilities the film-makers foresaw (some of which later came to pass as part of NZ history) but because it is an early vehicle for several New Zealand film-maker's craft.",
         "I was slightly confused by the content of this movie. From what I gathered, Sam Neill's character was a family man whose wife had an affair, and he was then mistaken for a guerrilla. There was plenty of guerrilla warfare on the streets who were trying to protest something. I couldn't quite gather what it was. There were plenty of shoot-em-up scenes on the streets and in the wilderness when Neil was trying to escape and clear his name. Other than that, I thought the movie was decent. The scene where he was imprisoned in a dank jail cell was harrowing and unforgettable, and I loved the part where he vomits on the guards to escape from the transport car. I sort of liked the movie and might recommend it. ** 1/2 out of ****",
         "Sam Neill stars, in his 2nd feature film, as Smith, a man who leaves his family when his wife takes up with another man, and moves to an island where he is the only resident. While he's on the island, political turmoil in New Zealand worsens and a form of martial law is declared. Smith is framed as a terrorist and arrested. Facing certain execution, he escapes and goes on the run, eventually hooking up with Bullen (Ian Mune), the man who had stolen his wife. This is the first feature made in New Zealand that received international distribution, and it's readily apparent why. Neill is a magnetic screen presence, and the film has the ramshackle appeal of the best small action films of the 70's. Warren Oates even appears in a small role as a US army officer.",
         "In one of the most acclaimed films coming from New Zealand, Sam Neill plays Smith, a simple man turned into a dangerous one after being confused as a rebel from a resistance group that fights against the new government. Now he has the run from the police and the army to save his life and the only ones who can help him are the same members of the resistance that caused him trouble, including Bullen (Ian Mune), who had an affair with Smith's wife. There's a few gaps in the narrative, some things are half explained and others don't get any explanation at all, also a lack of idealism or reasons to explain why there's a conflict between the rebels and the government, and all that made the film less appealing, and very confusing. Both sides of the political tensions are presented equally distant from us, so we can't decide which one is right and which one is wrong; our empathy must stay at all time with Neill's character, who is an enigma to us, we don't know what was his occupation before his life gets shattered, and he got framed as terrorist because someone planted guns in his boat. But the story tells us this guy's very smart, he knows combative techniques, some tricks under the sleeve (his escape from the police car by forcing a vomit was incredible). In his first film director Roger Donaldson makes a very good thriller, effectively tense, and with good moments and great performances (includes a special appearance from Warren Oates as an American military who is following the rebels). A higher focus on the political aspects and placing the characters motivations more on the surface would make this film perfect. 9/10"
      ],
      "genres": [
         "Action",
         "Thriller",
         "Drama"
      ],
      "productionCompanies": [
         "Aardvark Films",
         "Broadbank Investments",
         "New Zealand Film Commission"
      ],
      "summaries": ["Recluse Smith (Sam Neill) is drawn into a revolutionary struggle between leftist guerillas and the New Zealand government. Implicated in a murder and framed as a revolutionary conspirator, Smith tries to avoid violence while caught between warring sides."],
      "budget": 450000
   },
   "movielensId": 132050,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-10-06",
      "dvdReleaseDate": null,
      "directors": ["Roger Donaldson"],
      "runtime": 98,
      "movieId": 132050,
      "title": "Sleeping Dogs",
      "mpaa": null,
      "actors": [
         "Sam Neill",
         "Nevan Rowe",
         "Ian Mune",
         "Warren Oates",
         "Ian Watkin",
         "Clyde Scott",
         "Donna Akersten",
         "William Johnson",
         "Don Selwyn",
         "Davina Whitehouse",
         "Melissa Donaldson",
         "Dougal Stevenson",
         "Bernard Kearns",
         "Raf Irving",
         "Tommy Tinirau"
      ],
      "imdbMovieId": "0076725",
      "originalTitle": "Sleeping Dogs",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["j-3GMt5i-Lc"],
      "plotSummary": "Recluse Smith (Sam Neill) is drawn into a revolutionary struggle between guerillas and right-wingers in New Zealand. Implicated in a murder and framed as a revolutionary conspirator, Smith tries to maintain an attitude of non-violence while caught between warring factions. Written by Mike Welsch",
      "tmdbMovieId": 37582,
      "avgRating": 2.83333,
      "releaseYear": "1977",
      "numRatings": 3,
      "posterPath": "/cf61pYwtld9IwJLePLQlaoe1oG9.jpg"
   }
}