{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2936470",
      "video": false,
      "title": "Electricity",
      "recommendations": [
         381041,
         102461,
         253277,
         88052,
         352200,
         63367,
         288710,
         172824,
         267433,
         215928,
         334026,
         221243,
         172469,
         186096,
         90949,
         174688,
         314011,
         220746
      ],
      "backdrop_path": "/mq2vBZ78nKnTm7xoM29lCx7sjyT.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Lilly O'Connor",
               "gender": 1,
               "credit_id": "52fe4eed9251416c75167127",
               "name": "Agyness Deyn",
               "profile_path": "/7c3mQs3cfEhgrcYZBrIIGbJZ21V.jpg",
               "id": 1060671,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mel",
               "gender": 1,
               "credit_id": "52fe4eed9251416c7516712b",
               "name": "Lenora Crichlow",
               "profile_path": "/67iysQgwIO7EmVwF9SxXVNBZwNs.jpg",
               "id": 202734,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Mikey O'Connor",
               "gender": 2,
               "credit_id": "52fe4eed9251416c7516712f",
               "name": "Christian Cooke",
               "profile_path": "/lZiBMbI8rSoWG2Xfyg2gA2vlUHR.jpg",
               "id": 116263,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Barry O'Connor",
               "gender": 2,
               "credit_id": "5537ae4ec3a3684c5b000002",
               "name": "Paul Anderson",
               "profile_path": "/fHLtf1RvQ2i6ZudyL0WRwmEeTxv.jpg",
               "id": 220448,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sylvia",
               "gender": 1,
               "credit_id": "56fbdab092514128880027d4",
               "name": "Alice Lowe",
               "profile_path": "/kpBWGfjNfGZ6aAStg7n6upGj9g3.jpg",
               "id": 182327,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Consultant Neurologist",
               "gender": 2,
               "credit_id": "56fbdac3925141288300278d",
               "name": "Julian Firth",
               "profile_path": "/26HGrfEQEoEsptXqokzxrTFFwJ9.jpg",
               "id": 93848,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Dave",
               "gender": 0,
               "credit_id": "56fbdad4c3a36808cf002a84",
               "name": "Ben Batt",
               "profile_path": "/amrTsLHtXjaI1NkQ0ZA9l0ZYPCR.jpg",
               "id": 123496,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "570ec151925141523e000110",
               "name": "Tom Georgeson",
               "profile_path": "/90IirxcNYdJANlTW1i782SGnCkn.jpg",
               "id": 8947,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4eed9251416c75167117",
               "name": "Bryn Higgins",
               "profile_path": null,
               "id": 209373,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "57657c1a925141271000061c",
               "name": "Sukey Fisher",
               "profile_path": null,
               "id": 1637883,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "57657c2692514168ab001e1f",
               "name": "Si Bell",
               "profile_path": null,
               "id": 1164437,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.383601,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 229328,
      "vote_count": 20,
      "budget": 0,
      "overview": "A woman leaves her seaside hometown to search for her long-lost brother, experiencing hallucinations brought on by her epilepsy during her trip.",
      "similar": [],
      "original_title": "Electricity",
      "runtime": 96,
      "poster_path": "/nSLEaCtgC2jTmJX5jPYdTvTd7WP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/vuDafYIcuoY0YyvgcqtjXOKwn6Q.png",
            "name": "British Film Institute (BFI)",
            "id": 7281,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Stone City Films",
            "id": 95096,
            "origin_country": ""
         }
      ],
      "release_date": "2014-12-12",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.stonecity.co.uk",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Bryn Higgins"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Sukey Fisher",
         "Sukey Fisher"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2936470/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTAwMTI3MTk4ODReQTJeQWpwZ15BbWU4MDU4NTUyNjMx._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Agyness Deyn",
         "Lenora Crichlow",
         "Paul Anderson"
      ],
      "reviews": [
         "There are not many films in Hollywood that focus on disability. So upcoming indie movie, Electricity is already something quite unique. Agyness Deyn's lead character Lily O'Connor suffers from epilepsy. Since early in her childhood it has haunted her and fellow school- children didn't let her forget and took to calling her a 'fit- tastic-spastic' – it is fair to say that it was not a nice thing to have. Showing the severity and unpredictability of epilepsy, Lily one moment could be on a pier preparing for a date - but next, on the floor suffering. Having it her entire life, she is now as used to it as you can be and explains that she is like 'Alice falling down the rabbit hole' ... 'as the electric storms start in her head and her brain takes a tour'. But on screen we see it much differently, almost a POV, jumpy electric field. Quite like Doctor Who's Time travel, or Star Trek's Warp speed. Whichever it is, it impresses and gets the point across. Edited with many close-ups, Electricity is visually artistic and director Bryn Higgins accomplishes because of it. After the childhood traumas, and now a middle-aged women, her smitten and quite self-fish mother passes away. As one of the next- of-kin, she gains her inheritance which is due to be spread between her siblings. However one of her brothers, Mickey, has been long- lost for many years. All she knows is a brief past and that he is somewhere in London. Desperate to find him, and struck with recurring epileptic episodes she strives forwards with an innocent Taken-esqe style narrative (without the killings obviously). Onwards she encounters a completely unbelievable homeless woman, and eccentric characters galore. Aesthetically challenged and solely driven by Deyn's performance, Electricity is an eye-opener to say the least.",
         "I was drawn to this small, little-known British film by its star, since I have always found that model Agyness Deyn has such a fascinating face. In fact, Deyn - in her first major movie - is not just the central character but in every scene and, given her lack of acting experience, her performance is remarkable. She plays Lily O'Connor, a young woman from the north who travels down to London to seek the younger brother she has not seen since childhood. The distinguishing feature of this film, directed by Bryn Higgins, is that from a very early age Lily has suffered frequent and severe epileptic fits. I was once travelling on an inter-city train when the young woman sitting next to me had an epileptic fit and I have never forgotten it. This film is part-funded by the Wellcome Foundation and its representation of such fits is very effective and striking.",
         "Maybe because I have epilepsy,I might have a biased view!! I think the film was excellent;well written, extremely well acted and original. Didn't get as much attention as it should, but a film about epilepsy never would, as few have any understanding of it, ask a doctor! Epilepsy scares people, but it is not as scary as having it; that is why the film is great. If you listen closely and read between the lines you'll pick up on the clues and the body language that Lilly shows, it is difficult to show side effects of medication on film, but they got them across as best they could.The story built around Lilly was involving,dark,funny,sad, sometimes fatalistic, but never without hope. Really really enjoyed it.",
         "This movie did receive some promotion when it received a very limited release last year with Agyness Deyn appearing on Sky News explaining how ELECTRICITY is a realistic portrayal of epilepsy , which is what her character Lily suffers from . I've known epileptics myself and I'm sure you have also so I came in to the film expecting a rather expressionistic drama . One thing that puzzled me though was that just before seeing it I logged on to this page and noticed only a grand total of 74 people had given it a rating while only two people had commentated on it . That said ELECTRICITY isn't a film produced to sell out the local multiplex while the salad dodging audience chomp on pizza and suck up Coca-Cola through a straw and just because a film doesn't receive distribution doesn't equate to it being a truly awful film so I went in with an open mind Now to be fair to everyone involved they must have made a film that nails the sheer misery of being an epileptic or having a loved one with suffers from this infliction . The cast are also very good especially the always underrated Paul Anderson in a small role but ELECTRICITY is a very unsatisfying film for a neutral audience . It belongs in a sub genre best described as \"grief porn\" which British film makers are very good at where someone tries to make the most depressing film in the history of cinema . The mood is gloomy and the story is rather threadbare . Lily is looking for her lost brother and the more she looks for him the more obstacles are in the way and the more depressed the audience become As I said the technical achievements are more than competent and the scenes where the audience see an epileptic attack through the eyes of a sufferer are really well done but ELECTTRICITY shows that if you don't have a good story at the core of the film then you won't have a good film and this lack of narrative would have worked much better as a short film",
         "I just watched this on BBC Iplayer and thought I would write a review. Unless you are from the UK you may not be accustomed to what life can be like here. This was a realistic interpretation of life growing up in a broken home on a housing estate. The main character Lily O'Conner (Agyness Deyn)was awesome. I really liked her because she was endearing, brave and understated. Everything about her was perfect. She overcame a difficult childhood and developed into a young woman with a brilliant personality. The acting, directing and screenplay was excellent. Films like this are real gems but often slip through the net. It was a really nice story.",
         "Wow, if ever I could have the perfect two movies to identify with, one after the other, it was the last movie I saw, Infinitely Polar Bear, and a British drama by the name of Electricity. An apt title for a film if there ever was one. The tone of the two films couldn't be more different though. One is a tale of redemption, a man trying to win his family back while struggling with bi-polar disorder in a time where it wasn't understood like it is today. This however is a much more bleak, depressing film that reminded me of Trainspotting more than once as a girl with epilepsy is forced to live under the constant dread that she will have a seizure. She is trying to find her brother, who she hasn't seen since he was taken to juvie when she was 17. The best thing about this film is that the epilepsy isn't all this movie is focusing on. It is actually used as an inventive way to create tension..... Sometimes an oncoming seizure is predictable, but this seems intended at times, as the threat of another seizure constantly looms over the Lily's journey and effectively puts you in the position she is. Dread looms constantly over her journey. When she does have a seizure, the sound numbs, the visuals distort, and on occasion she will narrate what she is thinking, which is completely opposed to her behaviour, which she now does not have control over. Seizures are more than a convulsion, they can often trigger a severe personality shake-up and sudden, out-of-character behaviour. I got chills many times during this movie, it's up there with Requiem for a Dream in how much it got to me in terms of its realism and the way it brought about a sense of familiarity of bad experiences and memories of my own. When she argues with doctors, I am hearing myself, I am hearing so many medications that I am on or have been on at some point in my life. I am hearing the same frustration in her voice. It is realistic and gritty, making for an intense watch for me, and looking from the outside, I imagine this very effectively puts the viewer in that position of what it feels like to live under that constant dread and fear of seizures. Another part of epilepsy that the film portrays, perhaps too bluntly, but unfortunately again realistic, are the reactions of many when they see a person have a seizure. Lily herself uses words like 'spaz' more than once to describe herself - she is used to it. When a person is nice to her, and doesn't mind about the seizures, it moves Lily so much that she is almost speechless. I have lost count of the amount of people who just couldn't put up with my bullshit anymore, so I could again certainly relate to this scene and felt what Lily felt, the amazing sense of gratitude simply because someone is nice, and more importantly doesn't care about the epilepsy. Again shown in the film, epilepsy is always something that I try to hide when meeting new people, but it never seems to let any relationship work. Hence the overwhelming sense of gratitude, just for a friendship. The FX department may have gone a little overboard with the hallucinations, but, when they warp the vision and distort the visuals and audio in strange ways it is extremely effective, again very real, and for me, quite chilling. I was stunned at the accuracy up to a point. They just took it a little far, but this doesn't really affect the movie negatively too much. At its core this is a movie about epilepsy, of course, but the narrative of a sister trying to find a lost brother is touching. The way this story pans out though can be hard to stomach, it isn't an easy journey for Lily as this journey of course has the constant threat of a seizure. This again reminds me of Trainspotting in is raw depiction of fractured people, for whom every day is a mental struggle. Some relief from the depression comes in the form of Lily's brother, a charismatic card player of some kind, a man who has dollar signs for eyeballs. His character arc, as well as Lily's, is interesting and very well written. Apparently the lead actress, is a model-turned-actor, Agyness Deyn. Could have fooled me! I had never heard of her but was thoroughly convinced by her depiction of a type of epilepsy that I deal with every day. The narration, the way she is too trusting, the fact that she can't believe that someone will put up with it all... These aspects couldn't have been more accurate. The frustration in her voice and narration.... I could go on, but for a performance from a model-turned-actor, in an emotionally heavy drama... she was almost flawless. She had a great cast and an extremely well-written script to work with, and she took full advantage of this and nailed it. The supporting actors playing her brothers (Christian Cooke, Paul Anderson) and a friend she meets on her journey to find her brother (Lenora Crichlow) are also great. But Deyn is in almost every scene here and does a fantastic job. The story is moving, as is her performance. This is emotional drama done right, the story becoming more interesting as we find out more about the lost brother Lily is trying to find. This simple but effective story, combined with the realistic depiction of epilepsy and the avalanche of symptoms and barriers than come along with the ride, make for a heavy and tense emotional drama, perhaps a notch down from movies like Trainspotting and Requiem For A Dream in terms of that gritty realism. www.epilepticmoondancer.net",
         "Lilly O'Connor (Agyness Deyn -'Pusher') is a 'Northern lass' who has come from a horribly troubled background. Left with the physical and mental scars of her past she is thrown back to what she had escaped when her eldest brother contacts her. This is to say that their mother has died - it is then that she discovers her long lost and cherished younger brother may still be alive. So with her medication and a newfound hope - she sets off to track him down. The above is the basic synopsis and I do not want to say any more as there is so much to this rather good independent film from director Bryn Higgins; who may be better known for his TV work especially on BBC hospital, drama 'Casualty'. The electricity of the title refers to the electric storm that Lilly experiences when she has an epileptic fit. From my experience of the condition - I have treated a few sufferers - this seems to be a very realistic depiction of the disease. The techniques used are all very effective. There are many other issues looked at here including homelessness and familial bonds, but this is essentially a drama and one of memory, loss and love - a love that transcends most abuses. It is far from being a feel good movie though and that is of necessity intentional owing to the subject matter. It is good to see original British cinema being bold enough to make a film whose subject matter is essentially ignored by the mainstream. From the novel of the same name by Ray Robinson; this is one for indie fans and those who enjoy something off the beaten track.",
         "Top rating for this BFI film, apparently co-financed by the Wellcome Foundation (big pharma) that has the pay-off in its last shot: the heroine's face has cleared up, she's had no attacks on her updated medicine. But the film is perfectly frank about pharmaceuticals and what she has been through on them. It's very distressing to live from day to day with this young woman and suffer her seizures with her, as she searches for her beloved kid brother who stuck up for her throughout her childhood but has since disappeared. Her whole search is extremely credible, and I don't think anyone should miss this picture. Above all, get Agyness Deyn (who once had a real name): she's never taken any acting lessons, but she gets it big time. This is a breakthrough for her that should put her in US indie pix at least. You'll love it when she cuts through blokes' bullshit with an instant \"Bollocks!\" Wonderful stuff, and so rare for the BFI to achieve something as real as this.",
         "Not always an easy subject to talk about, Bryn Higgins in Electricity has brought it home to us all that this is a problem to discuss. Well filmed and with an interesting story, I would recommend that you take a look. The acting by Ms Deyn is surprisingly good, especially considering this is her first ever acting role. She carries off the character with aplomb and during the film you never think that in her other life she is a very successful model. She plays this role with great care, there is never any thought other than she is a victim of circumstance. The film is not always a smooth ride, it has its ups and downs, but overall it is a well directed character driven film that puts Mr Higgins on the map.",
         "Electricity is a low budget film starring Agyness Deyn who plays Lily O'Connor. She works in a cafe somewhere in Merseyside it seems but the film was partly shot in the north east. Like most young girls she wants to have a good time but despite the medication her epileptic fits can set upon her at any time which leaves her emotionally and physically drained. When her mother dies, her eldest brother, a gambler wants her to sell the house and split the proceeds. She does not want to sell because there is a younger brother she has not seen for years. When she is told he might be in London she sets off to track him down. In London she befriends some homeless people who steal her money. At least they told her how to track down her brother and she contacts homeless shelters and people who work with the homeless. However those epileptic fits are not far away but luckily she befriends someone who came to her aid when she blacked out. The film is a straightforward drama of a young woman who has had a troubled family upbringing. She had a rough ride with her mother, problems with her brothers and issues with her disability that has led to a life of taking various medication to control it. The title of the film reflects the visual effects that the director recreates when the epileptic fits occur. The film is not just about epilepsy but the drama about trying to find her long lost younger brother is a little bit mundane and by the numbers. Lily is not cut out for the big city and we can guess she is just too trusting when she is exploring the underbelly of homelessness and drug abuse. There are cameos from Paul Anderson and Tom Georgeson who kind of give this film a country & western feel with a northern beat. I had no idea that Agyness Deyn was some kind of fashion model, then again you are unlikely to look like one if your clothes look like they are from Primark. She really is believable as someone who is not letting her illness define her or get the better of her.",
         "I liked the story-line/acting/occasional visual effects to suggest the epileptic fits. Deyn is sensational as the main character. Visually striking and amazingly empathic. Low budget but goes to show a good movie doesn't need a big spend. Interesting how other reviewers with epilepsy state the way the seizures are presented is very effective. As a doctor it did give me some cause for pause in how we treat this difficult condition and hope that patients will just follow their prescription. Possibly essential viewing for all medical students. I expect the director and cast will always remember this movie fondly - well done all!",
         "Agyness Deyn squanders her singular theatrical talent in this film just as she so well did in Sunset Song. Her performance in Electricity comes on really strong in every single image or frame she is on making her taxing role gain and perhaps surpass credibility. I have seen her in these two films so far and I have grown very fond of her interpreting skills. There's something about her acting that I find captivating. It strikes me though as if she had been suitably pigeonholed to enact really harsh roles that can only fill us with heartfelt sympathy, pity and compassion for the characters she portrays so majestically. They don't half know how to endure pain! I cannot wait to see her in her upcoming films interpreting other roles and we might as well test and hopefully taste her potential versatility. Cinematographically speaking I think she has a promising career ahead of her with lot to offer for us to just behold and relish it jaw-droppingly. Just wait and see! In the meantime, keep off watching the mundane hotchpotch of unsubstantial films that abound these days and stick to this delectable one."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Stone City Films",
         "British Film Institute (BFI)",
         "British Film Institute (BFI)"
      ],
      "summaries": ["A journey seen through the eyes of a young woman with epilepsy that brings extraordinary hallucinations as she searches for her long lost brother."],
      "budget": 1360000
   },
   "movielensId": 132060,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-12-12",
      "dvdReleaseDate": null,
      "directors": ["Bryn Higgins"],
      "runtime": 96,
      "movieId": 132060,
      "title": "Electricity",
      "mpaa": null,
      "actors": [
         "Agyness Deyn",
         "Lenora Crichlow",
         "Christian Cooke",
         "Paul Anderson",
         "Alice Lowe",
         "Julian Firth",
         "Ben Batt",
         "Tom Georgeson"
      ],
      "imdbMovieId": "2936470",
      "originalTitle": "Electricity",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman leaves her seaside hometown to search for her long-lost brother, experiencing hallucinations brought on by her epilepsy during her trip.",
      "tmdbMovieId": 229328,
      "avgRating": 2.6,
      "releaseYear": "2014",
      "numRatings": 5,
      "posterPath": "/nSLEaCtgC2jTmJX5jPYdTvTd7WP.jpg"
   }
}