{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "elevator",
         "id": 188960
      }],
      "imdb_id": "tt2195552",
      "video": false,
      "title": "The Elevator: Three Minutes Can Change Your Life",
      "recommendations": [35004],
      "backdrop_path": "/dCaHwtzcWrK24amXI8KjrzkNBEX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Jack",
               "gender": 2,
               "credit_id": "5491fe5d9251411226001c43",
               "name": "James Parks",
               "profile_path": "/lzdbAVS3ABK8k6xGpYHU8E02OAA.jpg",
               "id": 87312,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Katherine",
               "gender": 1,
               "credit_id": "5491fe76c3a368466b00266f",
               "name": "Caroline Goodall",
               "profile_path": "/f3L5WmEtGjjONTe8qvBZOy2dWTJ.jpg",
               "id": 6692,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "George",
               "gender": 2,
               "credit_id": "5491fe8492514162820001ff",
               "name": "Burt Young",
               "profile_path": "/rbSsSkQ72FoGcvwIHUxQWJ92I3W.jpg",
               "id": 4521,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Emily",
               "gender": 1,
               "credit_id": "5491feb1c3a36846640022b4",
               "name": "Katie McGovern",
               "profile_path": null,
               "id": 972378,
               "order": 4
            },
            {
               "cast_id": 29,
               "character": "Jane",
               "gender": 1,
               "credit_id": "570401eec3a3686974000384",
               "name": "Sara Lazzaro",
               "profile_path": "/cQ2zLLevRJNqpSdY35UqctHaE9M.jpg",
               "id": 124760,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5492012ac3a368465a002562",
               "name": "Massimo Coglitore",
               "profile_path": null,
               "id": 1266201,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56b64ef7c3a36806ee00a339",
               "name": "Mauro Graiani",
               "profile_path": null,
               "id": 1277072,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56b64f18925141566f00022e",
               "name": "Riccardo Irrera",
               "profile_path": null,
               "id": 1277073,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56b64f59c3a36848160041ea",
               "name": "Riccardo Neri",
               "profile_path": null,
               "id": 139346,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56b64f66c3a36806e600a25c",
               "name": "Stefano Caprioli",
               "profile_path": null,
               "id": 570154,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "56b64f729251416615003eea",
               "name": "Vincenzo Carpineta",
               "profile_path": null,
               "id": 1163409,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "56b64f98925141566f000240",
               "name": "Osvaldo Bargero",
               "profile_path": null,
               "id": 135156,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56b64fa3c3a36806e600a269",
               "name": "Michela Forbicioni",
               "profile_path": null,
               "id": 1444966,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "56b64fb19251414a3a004396",
               "name": "Tonino Zera",
               "profile_path": null,
               "id": 996050,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "56b64fbc9251414c4500414c",
               "name": "Anca Rafan",
               "profile_path": null,
               "id": 1573574,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56b64fc69251413ca1002f45",
               "name": "Nicoletta Ercole",
               "profile_path": null,
               "id": 119181,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56b64fe69251416615003ef9",
               "name": "Adel Saada",
               "profile_path": null,
               "id": 1573575,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56b64ff0925141677c00011b",
               "name": "Gino Tamagnini",
               "profile_path": null,
               "id": 1573576,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56b65001c3a36806fc0098d5",
               "name": "Francesco Ruggeri",
               "profile_path": null,
               "id": 1573577,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "56b6501dc3a36806e600a277",
               "name": "Federico Ciommo",
               "profile_path": null,
               "id": 1400009,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 0,
               "credit_id": "56b650329251414c45004156",
               "name": "Angelo Bonanni",
               "profile_path": null,
               "id": 1400069,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "56b6503c9251414a3a0043af",
               "name": "Gianpaolo Catanzaro",
               "profile_path": null,
               "id": 1573578,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "56b65048c3a36806fc0098df",
               "name": "Diego Gualino",
               "profile_path": null,
               "id": 1573579,
               "department": "Sound",
               "job": "Boom Operator"
            },
            {
               "gender": 0,
               "credit_id": "56b650519251413ca1002f4e",
               "name": "Gabriele Gubbini",
               "profile_path": null,
               "id": 1573580,
               "department": "Sound",
               "job": "Sound Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56b6505cc3a36806fc0098e4",
               "name": "Claudio Marani",
               "profile_path": null,
               "id": 1573581,
               "department": "Sound",
               "job": "Sound Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56b65066c3a3684816004201",
               "name": "Gilberto Martinelli",
               "profile_path": null,
               "id": 1573582,
               "department": "Sound",
               "job": "Sound Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56b650739251413ca1002f54",
               "name": "Tonino Corridori",
               "profile_path": null,
               "id": 1573583,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "56b65080c3a36806fc0098e9",
               "name": "Stefano Maria Mioni",
               "profile_path": null,
               "id": 25066,
               "department": "Crew",
               "job": "Stunt Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56b650919251414c4500415f",
               "name": "Ettore Abate",
               "profile_path": null,
               "id": 1573584,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "56b650abc3a36806ee00a36b",
               "name": "Stella D'Onofrio",
               "profile_path": null,
               "id": 1413805,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.10274,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 312316,
      "vote_count": 7,
      "budget": 0,
      "overview": "A disturbing psychological thriller, that engages the audience to the point that it is always caught off guard, thus changing the point of view of the two main performers.",
      "similar": [
         407939,
         44040,
         287415,
         5925,
         431,
         37165,
         511032,
         455558,
         18785,
         341006,
         397243,
         437,
         11033,
         14913,
         5919,
         1093,
         402437,
         11507,
         16611,
         985
      ],
      "original_title": "The Elevator: Three Minutes Can Change Your Life",
      "runtime": 93,
      "poster_path": "/39922RiMkXxRog1z3rDw5oD8kjw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Lupin Film",
         "id": 41656,
         "origin_country": ""
      }],
      "release_date": "2013-01-30",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Three Minutes Can Change Your Life",
      "adult": false,
      "homepage": "http://tombstonedistribution.com/film/The-Elevator",
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Massimo Coglitore"],
      "runtime": 93,
      "synopsis": "The Elevator is set in the confines of an elevator where the host of a famous TV Game Show is attacked and tortured by an apparently demented woman who claims that the kidney transplant he paid for resulted in the death of her son. The elevator is in a New York building where Jack Tramell lives. The woman, Kathryn, has studied her sons revenge meticulously. It is a quiet evening of the Labour Day weekend. Kathryn is cynical and scientific in carrying out her plan. But is she insane or is there truth in her accusations? Is Tramell guilty, or is he caught up in a deathly game not of his making? The Elevator is a drama and a psychological thriller, that keeps the audience on the edge of his seat through a series of sudden twists and nail biting tension.",
      "writers": [
         "Mauro Graiani",
         "Riccardo Irrera"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2195552/",
      "coverLink": null,
      "actors": [
         "Caroline Goodall",
         "Burt Young",
         "James Parks"
      ],
      "reviews": [
         "I assumed this was a low-budget student-made film, based on the number of ratings and reviews, so I was not expecting anything good to come out of it. There were certainly moments that broke my suspension of disbelief; moments in plot that made no sense, ADR that sounded off, and brief moments of unbelievable acting, but overall, it was better than I expected. In contrast, the main cast was phenomenal, both in performance, and in recognition. Imagine my surprise to see that an international director doing his very first feature-length film roped in three world-class actors. In all honesty, it was the acting that held the entire thing together - as you may expect from a film set almost entirely in an elevator. It was definitely slow to get going, though. It wasn't until the half-way mark that the plot actually got interesting. Occasionally things would happen that offered no value to the story line, and until the forty minute mark, a lot of it felt like filler, like the movie wasn't going to be long enough, so more scenes were added. Nothing was more annoying than thinking something interesting was going to happen, only to realise that nothing was happening at all. I began to get bored after the opening sequence. That being said, if you can endure the first act, you may be pleasantly surprised by the second, as things begin to pick up the pace, and the characters really begin to develop and take on their own stories. In the end, I wasn't impressed by the actual plot, and its conclusion. It was an interesting idea, to be sure, but it made for a rather dull conclusion, when it was revealed what it's all about. Basically, I was pleasantly surprised by the film, but only because I expected a no-budget indie film.",
         "This movie reminded me of the 1991 movie \"Closet Land\". Movies with a minimal amount of actors can sometimes be overwhelming with the lack of on screen charisma, but these actors are powerful enough to draw my attention for the limited amount of time they have to tell their story. What I like best about this movie is the ending leaves you with the question, \"What was said in the middle of the movie?\" If you had seen this in the movie theater you would have left with an unanswerable question. Classic move on the writers part, and classic movie for people that like movies.",
         "This is obviously not a big movie. It's as low budget as it can be. Now that I watched it, it feels more like a claustrophobic episode of The Twilight Zone. Movies which don't have the resources to excite otherwise, are often trying to impress with other means like disturbing images or provocative situations. So... this is a thriller about a mature woman who holds prisoner a well known game-show host inside an elevator. No. It's not a \"hostage situation\" (if the production had the money for firemen and SWAT teams and negotiators, I wouldn't characterize this as \"cheap\"). It's more like...well..I won't spoil you...but if you get quickly through the short list of why a 55+ woman could do such a thing...well...soon you will have an idea about what is going on. But it's not the beginning or the middle of the movie that will impress you. You will get a mental puzzle near the end! What is true and what is not. Caroline Goodall, the good wife of ...Liam Neeson, Michael Douglas and even Bruce Willis, is the star in this. Despite the fact that she is a trained and experienced actress her performance is only adequate. You get that \"crazy\" vibe she went for, but in my opinion there was much room for improvement. Burt Young should had let us remember him from the Rockies. Didn't know James Parks, he is good but he is kind of unattractive to play a wealthy game-show presenter. Music works well, especially near the end where you will get the actual thrills. Overall: A Cheap made thriller with OK performances and some plot twists to its last part, but nothing special. If you have time to spare, check it out.",
         "Following the path started with DEADLINE, Massimo Coglitore, Sicilian director, debuted at Tao Film Fest, with THE ELEVATOR independent film produced by Riccaro Blacks. A courageous film, unusual, in English, with excellent acting, great photography and beautiful music, with which Coglitore likes to wink at genre cinema, the suspense. But here we are faced with a film that has its own life, its own soul, no reverence or blinking but only a film made impeccably. Coglitore lends conscientiously to THE ELEVATOR, a film that directs so beautiful and very personal from the technical point of view. Impossible not to be charmed by the basic colors of the photography, that icy green, unsaturated distinguishes the lift and that amazingly does not kill the color but enhances it in order to create the ideal setting in which the characters move to represent a hypothetical, violent chess game, a quiz here, based on primitive instincts. There are many themes, instinct for survival, power, revenge. Extraordinary and magnetic interpreters Caroline Goodall and James Parks where around them prevail only human ancestral impulses. A well-written film by Mauro Graiani and Riccardo Irrera, with a clipped role tailored to evergreen Burt Young. The lift of the film, a few square meters of pure claustrophobia, imprisons Jack Tramell famous American TV presenter, isolating it from the outside world. It 'clear charges of Coglitore the ills of modern society. Men tend to ghettoized, close in sophisticated prisons in which they themselves are the jailers, isolating themselves from the outside world, and the various issues. The woman burst into the comfortable life of the famous presenter, catapulting him on a journey into the unknown, where one misstep means risking their lives. different social realities, among them, but something links them, a thin wire, a terrible secret. Coglitore deftly changes the order of the game and reverses several times their parts, with a strong dramatic where violence - exploding at night in that elevator of an elegant New York -It seems to arm themselves in the hands and thoughts of everyone, without exception.",
         "The Elevator has superb lighting, an innovative use of cinematography in only a few locations and superb acting that is able to hold your attention from the first to the last frame. It jumps right to the inciting incident within the first few minutes, and the bloody fight between the protagonist and the antagonist is heavily suspenseful until the last scene. The superb dramatic action is well synced with the careful psychological crafting of the camera shots, always giving the audience a different look of the scene, even though the characters are at the same place.James Parks and Caroline Goodall are truly amazing at their parts. Overall, The Elevator is truly remarkable for being a smaller budget feature, filmed in the United States by an Italian producer Riccardo Neri and the Italian director Massimo Coglitore.",
         "This is a very underrated film which was surprisingly good. Given that this is a low budget film (the title is a give away. 90%+ of the scenes happen inside the elevator, which can feel monotonous but the director/script/actors did a good job to keep my attention throughout.) You are made to choose which of the two characters is the foe and which is the protagonist. The movie does a good job in changing your pick through out the movie. And then there's a twist in the end (or a couple). The final shot is also an excellent touch. It gives some sort of relief that everything worked out as intended. Though some can miss it as it wasn't as pronounced.",
         "The overwhelming suspense does not detract from the moment-to-moment tension and indeed frees you to enjoy the film's technical accomplishment. The director, Massimo Coglitore, came to prominence in 2003 with your short film in 35mm ''Deadline,'' which similarly discovered new visual and stylistic possibilities. Coglitore also directed ''Uomo di carta,'' a Pirallendiano short movie and the TV movie \"Noi due\" a comedy love story where the look and atmosphere of that picture were so fresh, so persuasive, and so well matched that the logical instability of the story almost didn't matter. ''The elevator'' or \"3 minutes\" with its small cast of characters, and severe constraints on time and space, is a less grandiose undertaking. Aside from brief scenes at the beginning and the very end, the whole thing takes place on a single set in a single night. But its challenges were clearly attractive to the director, and his camera sense and assured pacing make it an above- average thriller. The director has mastered the traditional syntax of cinematic suspense: the shifting points of view, startling cuts and slow camera movements that work subliminally to fill us with dread and anxiety. But he also uses computer- assisted techniques to amplify the effects, extending what the camera can do. Vote 10!!!.",
         "As a critic I indulge myself by scoffing at loopholes in thrillers that could not exist without them. I guess I'm seeking the ideal of a thriller existing entirely in a world of physical and psychological plausibility. \"The elevator\" is about as close as I'm likely to get. Yes, there are moments when I want to shout advice at the screen, but just as often the characters are ahead of me. They also ask the same questions I'm asking, of which the most heartfelt, in a thriller, is \"why didn't we do that?\" The movie, directed by Massimo Coglitore and written by Mauro Graiani and Riccardo Irrera, embraces realism almost as a challenge. The movie resembles a chess game; the board and all of the pieces are in full view, both sides know the rules, and the winner will simply be the better strategist. Once we sense \"The elevator\" isn't going to cheat, it gathers in tension, because the characters are operating out of their own resources, and that makes them the players, not the pawns. The shot combines physical and virtual camera moves, a reminder that Coglitore is a visual virtuoso. He's also a master of psychological gamesmanship."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Lupin Film"],
      "summaries": ["A disturbing psychological thriller, that engages the audience to the point that it is always caught off guard, thus changing the point of view of the two main performers."],
      "budget": 0
   },
   "movielensId": 132165,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-01-30",
      "dvdReleaseDate": null,
      "directors": ["Massimo Coglitore"],
      "runtime": 93,
      "movieId": 132165,
      "title": "The Elevator: Three Minutes Can Change Your Life",
      "mpaa": null,
      "actors": [
         "James Parks",
         "Caroline Goodall",
         "Burt Young",
         "Katie McGovern",
         "Sara Lazzaro"
      ],
      "imdbMovieId": "2195552",
      "originalTitle": "The Elevator: Three Minutes Can Change Your Life",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["_s_QhudX-p0"],
      "plotSummary": "A disturbing psychological thriller, that engages the audience to the point that it is always caught off guard, thus changing the point of view of the two main performers.",
      "tmdbMovieId": 312316,
      "avgRating": 3.66667,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/39922RiMkXxRog1z3rDw5oD8kjw.jpg"
   }
}