{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0288808",
      "video": false,
      "title": "Say Nothing",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Julian Grant",
               "gender": 2,
               "credit_id": "52fe4875c3a36847f8167f93",
               "name": "William Baldwin",
               "profile_path": "/1G9Y076nnZaobTAtzRefZd8rFNN.jpg",
               "id": 13021,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Matt Needham",
               "gender": 2,
               "credit_id": "52fe4875c3a36847f8167f97",
               "name": "Hart Bochner",
               "profile_path": "/2gCrMv3yJlFQxloacxjTAcXGEAz.jpg",
               "id": 7678,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Grace Needham",
               "gender": 1,
               "credit_id": "52fe4875c3a36847f8167f9b",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Christine Barnow",
               "gender": 0,
               "credit_id": "52fe4875c3a36847f8167f9f",
               "name": "Michelle Duquet",
               "profile_path": null,
               "id": 148711,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "5375e6fe0e0a2630370015a1",
               "name": "Jordy Benattar",
               "profile_path": null,
               "id": 8712,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4875c3a36847f8167fa5",
            "name": "Allan Moyle",
            "profile_path": null,
            "id": 55790,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.501108,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 53670,
      "vote_count": 1,
      "budget": 0,
      "overview": "Housewife Grace Needham (Nastassja Kinski) has a one-night stand with Julian Grant (William Baldwin), who then becomes obsessed with sinking her marriage to husband Matt (Hart Bochner). The twist here is that Julian is a millionaire global powerbroker, and Matt works for him! It's a titanic battle of testosterone as the guys duke it out while Grace simmers angrily.",
      "similar": [
         274,
         10285,
         2832,
         1949,
         949,
         336843,
         910,
         996,
         1939,
         8834,
         12150,
         189,
         4638,
         181283,
         845,
         28902,
         9272,
         1923,
         10424,
         2163
      ],
      "original_title": "Say Nothing",
      "runtime": 94,
      "poster_path": "/e5zFhKKniiiep8oM7Y3g6gLygHS.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [],
      "release_date": "2001-08-01",
      "vote_average": 9,
      "belongs_to_collection": null,
      "tagline": "Think Fatal Attraction … in reverse!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Allan Moyle"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Madeline Sunshine"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0288808/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgzNjY1NDE2OV5BMl5BanBnXkFtZTcwMDkyOTQyMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Nastassja Kinski",
         "Hart Bochner",
         "William Baldwin"
      ],
      "reviews": [
         "We've seen a story like this before: a wife in marital troubles (played by Nastassja Kinski) engages in sex with a stranger (William Baldwin) and then wants to go back to her life with husband and girl. When she returns home she finds out that her husband has finally found a job. Everything seems bright. However, Kinski finds out that her husband's new boss is actually the stranger who still shows interest over her and seems to do anything to get what he wants. What to do? Say nothing? I didn't really like the movie. While it wasn't just bad, it clearly lacked \"that something\". Maybe it should've focused more on what's going inside Kinski's head. Nothing to say about the actors themselves (I guess Baldwin was a good choice for the role of the obsessed boss) but the characters seemed somewhat stereotypical, acting the way you would see characters acting in your everyday TV films. Finally, the ending totally ruined what could have been an interesting plot. In my opinion the movie tried to look cool, it had a bit of shaky camerawork here and there, some stills, fast cuts and glamour, but in the end I think it fits Spelling productions much better. Same goes for the music. Otherwise it didn't look that bad. Some might like this but it definitely wasn't my cup of tea. To be fair, I don't usually watch much this type of thrillers. This one felt too long even if it was just an hour and a half long, I think it could've worked better as an hour long episode in some TV series. There was absolutely no need for some of the scenes, especially the shower scene. My advice: Try before you buy!",
         "This film is not groundbreaking. I assume everyone was hired with the knowledge that they were shooting a story for Cinemax, and that they wanted quality in the production...but anything else was optional. It is not horribly bad, it just offers nothing new. Cut out the sex scenes and you have a Lifetime TV movie. But since this is Cinemax, we see a little more skin. I thought I read somewhere that Nastassja Kinski wasn't doing anymore nude scenes. Scratch that. Well...almost. There are some topless scenes with William Baldin, but I'm getting ahead of myself. Basically, this is Fatal Attraction in reverse. One difference is that nothing is as extreme as that film. No pets are boiled, etc. Kinski has a one night stand with Baldwin, who then sets out to wreck her marriage with Hart Bochner, who plays her husband. Baldwin plays a millionaire power player in a global corporation, and offers Bochner a prime position in his company. Of course the poor husband has no clue why he is being hired. This infuriates Kinski, and the manipulation continues. I was quite entertained by the first two thirds of this film. The last third simply gets a little dull. Nothing too drastic really happens, just a lot of power play by Baldwin's character, which threatens the Bochner/Kinski marriage. It fizzles out. The interesting thing about it is that Kinski plays an ex-model very close to her real life persona. Her past history as a top model is emphasized by showing her famous \"Kinski and the serpent\" pose by Avedon, her Andy Warhol tribute, etcetera. Kinski still looks fantastic as ever, does an okay job as the stalked wife. Her little girl voice is out of place at times, but there are a few instances where she overcomes that liability, and belts out her anger in a real woman's voice. My favorite scene is when she has an argument with Baldwyn in the men's room, he leaves, and a stranger who couldn't help but overhear walks out of a stall. She glares at him and yells, \"WHAT!\" I would have liked more of this. Baldwyn is properly snooty and oily, and Hart Bochner gives another unique performance as the betrayed husband. It's just too bad that it all added up to not a whole lot of anything in the end.",
         "It's fatal attraction in reverse but what's interesting is that in Say Nothing, I understood why the cheating took place. In the original Fatal Attraction (where the guy drops his pants), it's assumed that we'll root for him just cause he's Michael Douglas or because \"guys\" screw around. I especially liked that husband and wife are both grey characters -- each with his/her own set of problems. It's easy to relate to the ups and downs of a woman caught in a troubled marriage. The big surprise (which I won't spoil by telling) in the beginning was something I wouldn't have guessed from the trailer which is always good. (hate it when everything's given away in the trailer.) Worked for me on a lot of levels. It was tense, and I ate over my usual quota of popcorn so I know it had me.",
         "Brief marital infidelity comes back to haunt loving wife Grace Needham (portrayed by the always sexy Nastassja Kinski). She had left town, and her depressing husband, to embark on a trip to sunny Miami, where she was pursued and ultimately seduced by Julian Grant, a handsomely evil and manipulative business executive, who is portrayed very well by William Baldwin (why do all of the Baldwin brothers play evil people so damn well?) The seducing of Grace took place as the two drank champagne on a deserted beach they reached privately by sailboat. Grace admitted she drank too much for her own good and revealed the many problems in her marriage. Julian gained her confidence by claiming he would never allow those types of problems to occur, if he had a relationship with Grace. Julian's manipulation continued as he described a \"lost at sea\" fantasy involving the now uninhibited Grace, who sat near, listening to his every word and becoming more and more engaged with his romantic dream. His manipulation paid off as a few subtle nudges led to Grace's soft kisses, paused momentarily by her pulling back as if suddenly thinking to herself `What am I doing? I'm a wife. I'm a mother. I have a real life. Real responsibilities. Sure, the two of us have talked about being together, lost at sea, but that is just a fantasy. Look at what we're doing here. The consequences are real. We're really alone on a secluded beach. Am I going to let this fantasy really happen?' She succumbs to the dream, as her kisses became more passionate. The once guarded Grace, who used to respond to men's propositions by saying \"I'm married\" enjoyed watching as Julian unbuttoned her shirt, leading to more kisses, body caresses and her climbing onto Julian's lap! She smiles, kisses, moans, laughs and frequently looks up at the sun throughout what unfortunately was a brief love-making scene in which everybody seemed to have most of their clothes on. While I thoroughly enjoyed the look of illicit passion on Grace's face as the once devoted wife was being thoroughly satisfied by having sex with a man that clearly enjoys manipulating others, I will say that on the whole, the scene was undeserving of the movie's \"R\" rating. Julian returned home to find her husband rejuvenated from his securing of a high paying job, and she is excited about being able to return to a normal life where she can once again be a loving wife and caring mother. But the evil Julian Grant reenters the picture and is not willing to give up so easily on Grace. Grace has a plan to rid her life of Julian, but will it work? Obviously, I don't want to ruin the remaining story line for you. However, I will say that I always enjoy movies involving sexual pretense by a wife (especially when she exhibits uninhibited attraction and behavior that is normally reserved for her husband) but in actuality, is seeking revenge against the antagonist. This movie would have been much, much better if the movie had included more of that in the story line. My feelings are if the movie brings it up, then the movie should finish it. And this movie definitely brought it up. Unfortunately, certain constraints in the story line prevented this from being significantly pursued. There are many other movies available that succeed with that very point, and I'll include their titles in the \"recommendations\" portion of this section. I'm also open to receiving emailed suggestions of other movies that contain a good story line involving sexual pretense on the part of a seemingly devoted wife. Overall, Nastassja Kinski and William Baldwin are both very good. The movie is not.",
         "Say Nothing provided a good twist on Fatal Attraction from a chick's point of view. Nastassjia Kinski was very fine. Dialogue was good, and sometimes quite amusing, unexpected in a thriller. Some interesting camera action and music. Pretty good flick, however last scene seemed out of character, tacked on.",
         "\"Say Nothing\" tells of a wealthy character disorder (Baldwin) who stalks a woman from the inside attempting to systematically dismantle her life after having a brief affair with her. An okay shoot with decent acting, \"Say Nothing\" runs lukewarm as its implausible psychodrama unfolds and then turns cold for a thrown together and anticlimactic ending. Kinski's performance is solid, Baldwin is always good as an evil doer, but Bochner seems out of place as a good guy. The films shows us nothing new and is marginal fodder for couch potatoes at best.",
         "Sexual harassment takes an interesting turn here. Have an affair with a girl and then hire her husband as a top executive and keep the action going. This is exactly what we see in this film here. Billy Baldwin, as the sinister Julian,has what it takes to provide an excellent performance. Ms. Kinski is also quite effective as the woman taken in by this charade. What Baldwin does to keep he plot going is mind boggling. Trying to kill Kinski's young child while keeping her husband so busy in the business becomes somewhat unreal. The end fizzles out because you want Baldwin to get what is coming to him and that does not occur. Even crippled, Baldwin can still plan a new offensive especially with all the money that he has. Did his former wife kill herself or did Baldwin commit that act as well? This is not explained.",
         "The look and feel of a made for Premium Cable and that is what it is. There are attractive Actors and a borrowed script. The movie suffers from a lack of style and is flat and not very well presented, although, it does have enough melodrama to be a watchable, if ultimately a disappointing affair. Nastassja Kinski is always a cult favorite and plays a close to real-life role as an ex-model given the proverbial punishment of an extramarital fling. Everything seems standard and lackluster and in the end it is an unsatisfying piece of eye-candy for the non discriminating portion of the public that tolerates pap.",
         "Here is a kind of morality tale warning women not to stray -- even if their husbands are jobless, unshaven and depressed, and rejecting in bed. Nastassja Kinski does well as a woman so-afflicted who just can't seem to win. When she lets her defenses down for one night she ends up paying in a major way -- by losing her husband's trust and leaving her young daughter to fall victim to poisoning. Billy Baldwin is less-nuanced as a reptilian titan of industry more evil and conniving than this lightweight script would seem to be able to support. He's almost Shakespearean in his single-minded quest to destroy a rather humdrum family. (And you have to wonder why. Kinski's a pretty lady but hardly seems much out-of-the-ordinary here.) The ending is somewhat anti-climactic but managed to satisfy. This movie could have been a lot worse. It's not bad at all if you're in need of a little superficial distraction.",
         "I watched this movie today on TV and I'll say that it's not bad. It's not groundbreaking material or anything. The story has been done many times before, but the movie itself wasn't bad. I watched because I like Nastassja Kinski and the movie didn't sound boring. It wasn't. The beginning was actually pretty realistic. She is unhappy in her marriage because her husband is out of work and doesn't want to do things with her anymore. Her friends see she could use a break and send her on vacation to Miami where she meets William Baldwin. Even though she doesn't seem interested at first, she sleeps with him anyway. Of course, once she returns home, he insinuates himself into her life by hiring her husband for a job in his company, showing up at restaurants she's dining at, getting himself invited to her home, etc. He's obsessed with her and won't let her forget it. The husband doesn't know anything about the affair until it is revealed later on. Nastassja Kinski is a very good actress who makes every scene in the movie work. She's very believable as a woman who made a mistake and now much protect her family from a madman. At this point the movie becomes more interesting. The plot is somewhat involved, but not hard to follow. The movie sets itself apart from other Lifetime movies when certain unexpected things happen between the husband and wife, and the boss. One scene at the end I found extremely unrealistic. The movie tries to be an action thriller with a car chase scene that ends in an over the top fashion inconsistent with the style of the movie. This movie has it's flaws, but it works well as your typical Lifetime movie. The cast was very good, making it a little above average. The story isn't too cliché. It adds it's own twists to the kind of story that's been told many times. Not a bad way to kill an afternoon.",
         "Say Nothing is a very different film that has a good cast which includes William Baldwin, Nastassja Kinski, and Hart Bochner. The acting by all of these actors is very good. Baldwin is really excellent in this film. I thought that he performed good in this movie. Fans of Kinski should like her in this movie. The mystery is really good and some of it is surprising. The movie is filmed very good. The music is good. The film is quite interesting and the movie really keeps you going until the last moment. This is a very good and thrilling film. If you like William Baldwin, Nastassja Kinski, and Hart Bochner and the rest of the cast in the film, Mysteriers, Thrillers, Dramas, and interesting films then I recommend this film!",
         "I definitely got my moneys worth on this flick. Not to say it was great, but it was alot better than i thought, that's for sure. It is pretty much Fatal Attraction in reverse as someone else was saying. The dialogue was interesting sometimes, but nothing spectacular. I think they could of used a couple of rewrites. Nastasja Kinski does a very good job. The last time i've seen her was in One Night Stand (i think). She looks as seductive as ever. Are her looks ever going to fade? Bochner does a satisfying job as the husband, you can't expect too much more from him. Then there's Billy Baldwin. I just think he stinks as an actor. The only thing he was ever good in was Backdraft. I don't even know if he was really that good, because he has such a great supporting cast. He just doesn't do a good job. For one he's nothing to be afraid of. Two he just wasn't believable. I think you needed someone more intimidating for the part. The special effects in the movie were outstanding. Just the right amount. Whoever did the job, did a fantastic one. Especially the car going off the cliff. Well done. Couldin't have asked for anything more. This film is definitely worth renting, especially if you don't expect much going in.",
         "Egads. I used to think Keannu Reeves was the worst actor in Hollywood. I not so sure anymore, Willy gives Keannu some stiff competition with his \"I'm made of plaster\" performance in this movie. Combine that with the fact that there is almost no plot, and not a single likable character, and it's pretty hard to recommend this turkey. Natasha tries her best, but even Julia Roberts couldn't save this flick from obscurity. Avoid it unless it's really late and there's nothing else on. -Oh heck, in that case just read a book.",
         "If anyone is out there that knows the answer to my question i would love it, I'm looking for that song \"casual affair\" when they are dancing at that party loved it!!!! But i cant seem to find it, Robert Tepper was said to have song it but i cant find him anywhere. If anyone knows the answer please email me at melissa_shmkr@yahoo.com. Other wise i thought the movie was all and all pretty good, i would say rent it before buying it also, but it had some good turns...I don't know if i agree with the R rating it got, maybe i missed something, I don't know. William Baldwin was great but then again i love all of the Baldwin brothers.",
         "I would just like to say that I enjoyed this film. The main characters were well played, the plots ending was week I agree, but William Baldwin as the 'stalker' was 'charismatic' and I would like to add, Billy seems to play these 'quirky' characters extremely well. So well done to all ....very entertaining",
         "Loved all the twists and turns. Nastassja Kinski is wonderful-it reminded me of what a terrific actress she is. Baldwin is sexy/scary. I loved the pace of the film and the clever dialogue. Definitely a fun roller coaster of a film."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Equinoxe Films",
         "Film Bridge International",
         "Leader Media"
      ],
      "summaries": [
         "An ex-model, now a wife and mother, takes a break from her out-of-work husband, who's been surly and drinking heavily. She goes to a Miami resort for a couple of days where she meets a stranger with whom she has a 24-hour fling. She returns home to a renewed husband who has found a job and put aside the bottle. Turns out, he's been hired by the same man with whom she had the affair. She says nothing, and little by little, the boss drives a wedge between the couple, playing one against the other. Soon she and her husband are separated and in a custody battle. Will they come to their senses and realize who is manipulating them? What if he stops at nothing?",
         "An unfulfilled married woman becomes intrigued by an alluring suitor whose attention soon becomes obsessive."
      ],
      "budget": 0
   },
   "movielensId": 132124,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "2001-08-01",
      "dvdReleaseDate": null,
      "directors": ["Allan Moyle"],
      "runtime": 94,
      "movieId": 132124,
      "title": "Say Nothing",
      "mpaa": "",
      "actors": [
         "William Baldwin",
         "Hart Bochner",
         "Nastassja Kinski",
         "Michelle Duquet",
         "Jordy Benattar"
      ],
      "imdbMovieId": "0288808",
      "originalTitle": "Say Nothing",
      "genres": [
         "Action",
         "Drama",
         "Mystery",
         "Romance",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Housewife Grace Needham (Nastassja Kinski) has a one-night stand with Julian Grant (William Baldwin), who then becomes obsessed with sinking her marriage to husband Matt (Hart Bochner). The twist here is that Julian is a millionaire global powerbroker, and Matt works for him! It's a titanic battle of testosterone as the guys duke it out while Grace simmers angrily.",
      "tmdbMovieId": 53670,
      "avgRating": 5,
      "releaseYear": "2001",
      "numRatings": 1,
      "posterPath": "/e5zFhKKniiiep8oM7Y3g6gLygHS.jpg"
   }
}