{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0100904",
      "video": false,
      "title": "Watchers II",
      "recommendations": [
         34094,
         68509,
         84708,
         291545,
         69900,
         25422,
         30771,
         20669,
         42302,
         53355,
         51521,
         168802,
         52318,
         16922,
         17571,
         31394,
         4289,
         47436,
         88410,
         27895
      ],
      "backdrop_path": "/jc9lsFVwXaLTGkcCDjYeFfprPNn.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jason",
               "gender": 0,
               "credit_id": "52fe47f1c3a368484e0e19ed",
               "name": "Timothy Marlowe",
               "profile_path": null,
               "id": 558178,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Paul Ferguson",
               "gender": 2,
               "credit_id": "52fe47f1c3a368484e0e19f1",
               "name": "Marc Singer",
               "profile_path": "/npgKM5FfPKnAukzV11pXOlLeBnZ.jpg",
               "id": 35350,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Barbara White",
               "gender": 1,
               "credit_id": "52fe47f1c3a368484e0e19f5",
               "name": "Tracy Scoggins",
               "profile_path": "/26XspLFBe2nprnjYCcI0VBYTHF3.jpg",
               "id": 52312,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Glatman",
               "gender": 1,
               "credit_id": "52fe47f1c3a368484e0e19f9",
               "name": "Mary Woronov",
               "profile_path": "/s2bYX2L2WYRXw1feRBKpRITDJQZ.jpg",
               "id": 100552,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47f1c3a368484e0e19e9",
            "name": "Thierry Notz",
            "profile_path": null,
            "id": 103580,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.566873,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 70247,
      "vote_count": 9,
      "budget": 0,
      "overview": "A genetically re-engineered dog develops a psychic link with a monster created in a lab experiment which goes awry.",
      "similar": [],
      "original_title": "Watchers II",
      "runtime": 101,
      "poster_path": "/stS5yyINeVns7YCyOuRv3INzRgr.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "1990-08-16",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Don't look back or you'll never see anything again.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thierry Notz"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "John Brancato",
         "Michael Ferris"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100904/",
      "coverLink": null,
      "actors": [
         "Marc Singer",
         "Tracy Scoggins",
         "Jonathan Farwell"
      ],
      "reviews": [
         "I still remember how I was curious to know how they could do a sequel to WATCHERS when I saw this movie on a shelf of the video-store. The curiosity grown when I looked at the back of the cover and saw a gore scene not included in the cassette (which has no real bloody shots). Plus, the movie was forbidden for people under 18 - where the first one (here in Italy) was for all audiences. But what I saw wasn't that good I thought. This is not a remake of the original directed by Hess, but a second adaptation of the novel by Koontz (a quiet good horror novel, btw), more close to it (except for the character's names) than the previous. But it's still very far from the book. Besides some changes (this time there's only a scientist who tracks the beast), the main problem is that the monster's look is very far from being scary and the director had the bad idea to show it completely and very early in the story. In Hess' version, instead, we don't clearly see it and even if this is obtained through simple methods (POVs. shaky camera works, long shots in the fog), it works quiet well. Here Notz tries a little bit to create suspense (the creature's shadow on a wall wasn't that bad), but stops quiet early, preferring to show a guy in a cheesy suit who moves like an idiot. As the previous, the most incredible performance is delivered by the dog - and I mean it in a good way. I still wonder where that gore shot was supposed to be inserted in..",
         "Paul Ferguson(Marc Singer, whose likability and charm bring a respectability to this B-movie)is being taken to a suspension area for punching a superior when his MP's encounter a creature that had escaped and killed several animal rights' activists when the government decides to shutdown the andodyne program(more on this in a moment). Paul is helped to escape from his hand cuffs thanks in part to an intelligent golden retriever. Fleeing from the creature, Paul holes up temporarily with his ex-wife for the night. Paul is able to flee the residence thanks to his wife(Irene Miracle)driving him past police watching her home outside. With the dog in tow, Paul is able to swap his car with a man for a jalopy so that he will not be spotted. Tracy Scoggins(trying to hide her hotness underneath nerd-glasses)is an animal behaviorist named Barabara White who was trying to teach the golden retriever how to read letters in the alphabet. She is pretty much out of college and beginning her career & is green to exactly what the company she works for actually does. Andodyne is actually a military project where scientists(in this case a doctor named Steve Malceno played completely wooden by Jonathan Farwell)create beings from genetics which are in fact linked to canines. It is a new project and the creature that Malceno is over is the first experimental venture. It is explained that the canine would be used to \"spot the enemy\" and the beast would attack and destroy. Unfortunately, the experiment goes awry because the creature has an uncontrollable urge to kill. So everywhere the canine goes, the creature follows leaving a bunch of dead bodies in it's wake. Soon Paul will understand that the canine is much more than just some ordinary dog and will soon be lead to Barbara because she is the only one available to trust. Will Paul and Barabara be able to stop the thing and quiet it's rampage once and for all? The film also shows the obsession of Dr. Malceno to continue his research regardless how many this thing kills. The film has a rather low budget(produced by Roger Corman..need I say more?), and at times the creature really simply looks like a man in a rubber suit. Singer and Scoggins try, but this film suffers somewhat by revealing the creature awfully early into the film. The director does try to shade the monster and this often does work, but when light reflects on it the credibility of the creature takes a lashing. The dog's tricks are fun to watch and I liked Singer enough to at least enjoy the film. This film is perhaps the close you are about to get to the quality of the Koontz novel(the first one tries the approach of \"less is more\", but the unveiling of the creature was laughable;the \"Watchers Reborn\" has that \"so bad it's good\" quality, but is very mediocre;the third film in this series is merely a \"Predator\" rip-off), which is kind of sad. You kind of wish a Koontz novel could get a decent enough budgeted film, but maybe \"Watchers 2\" is about as quality as we'll ever see.",
         "This sequel to \"Watchers\" is just a reworking of the original. Or, more accurately, it uses Dean Koontz's original story as the basis for yet another \"Predator\" knock-off. Pretty lame, with some terribly unconvincing effects (check out that severed head), but an amazingly well-trained dog yet again saves the day (i.e., at least makes the movie bearable). (*1/2)",
         "Watchers II focuses on a secret genetic experiment named 'Project Aesop' that has thus far produced a super intelligent dog named Einstein & a monstrous deformed mutant creature (Tom Poser) who are both psychically connected with one another. During an unfortunate incident in the lab two NSA agents are killed by the creature, the top woman in the job Dr. Glatman (Mary Woronov) orders it's creator Dr. Malceno (Jonathan Farwell) to destroy it which is an idea he is not too keen on. Dr. Malceno devises a plan to move the creature to safety by creating a distraction so he lets animal rights activists into the lab to cause havoc but things don't go according to plan & the creature escapes as does the super intelligent dog Einstein. The creature wants Einstein but the dog is picked up by Paul Ferguson (Marc Singer) who doesn't know what he has gotten himself into. The creature will stop at nothing to get Einstein & starts a murderous campaign of terror to find the dog, Paul quickly becomes aware that he is being hunted by a monster & decides the best form of defence is attack... Directed by Thierry Notz this is the second Watchers film in a series that now totals four films, the original Watchers (1988), this, Watchers III (1994) & finally Watchers Reborn (1998). I must say right now that I have not seen any other Watchers film so I cannot compare them, sorry. The script by Henry Dominic is based on a novel by Dean R. Koontz (haven't read it so I can't compare Watchers II to it either) is really silly, it's stupid, moronic & you can't quite believe what your seeing on screen but when all said & done I enjoyed it for what it was & at least it entertained me which is all I ask for when I watch a film, to be entertained. It moves along at a good pace & is never boring or dull & it's certainly that little bit different which I'm sure most people wouldn't argue with. Of course it goes without saying that Watchers II is far from a brilliant film either conceptually with it's super intelligent Golden Retriever who can understand English & type on a computer keyboard or the creation of a hostile creature for no good reason whatsoever, or technically as it's a pretty low budget affair & it shows. I loved the scene when the monster walked up to a couple of homeless wino's & started drinking with them! Watchers II takes itself very seriously which actually worked & made me smile on a few occasions at just how daft it was getting. Director Notz does an OK job, some sequences are lit quite well, he keeps the film moving along & there's a decent low budget horror film vibe running through the thing. There isn't much blood or gore, someone is impaled on a hook, there's a decapitated head in a toilet, a clawed back & some splashes of blood & wounds but that's about it. Watchers II must have had a pretty low budget as the monster suit itself is pretty poor, it's obviously just some guy stuck in a rubber suit & the head & mouth have no movement at all, it actually reminded me of the monster from Monster in the Closet (1987)... a bit. The acting was OK, V (1984) fans will recognise Singer & everyone plays their parts dead straight. When broken down & analysed properly Watchers II is crap, of that there is no doubt. But for all that wrong with it, the duff looking monster & the absurd plot amongst other things I found it quite entertaining & it passed the time nicely enough. I can't recommend it I just can't but on a personal level I thought it was a worthwhile watch, the decision is yours.",
         "Though this film adheres a LITTLE more closely to Dean Koontz's classic horror novel than the first Watchers film, it's still not very watchable. Tracy Scoggins, once deliciously campy on the old 80s soap The Colbys, appears as a \"temp\" animal psychologist whose \"expert\" abilities include such as displaying letters of the alphabet on a computer screen and sighing, \"Z. This is Z.\" Wonder if the character needed a college degree.... (She must be smart though, because she sports big glasses and a frumpy hairdo through most of the movie.) Marc Singer, as Paul, displays some of his Beastmaster-like love of animals bonding with the beautiful canine star -- but unfortunately he and the mutt have more chemistry than Singer and Scoggins. At least a moment in tightie-whities gives Singer a chance to show he's in even better shape than he was in his Beastmaster days. Of course, the sex appeal in that scene is toned down a bit by his pulled-up knee socks, and the director doesn't bother to try to generate even a little sexual tension between Paul and his ex-wife.) That's just one of many missed opportunities for interesting twists. And several scenes that might be a little suspenseful fall flat because we don't know enough about the threatened characters to care whether they live or die. Early on, Paul's ex-wife mutters,\" Paul, you're not making sense,\" at a moment when he's actually making as much sense as he ever does. Maybe she was just making a comment on the overall script. (She does quickly follow with one of the film's only fairly good lines: \"If you're thirsty, the toilet's open, OK?\" -- delivered to the dog, and probably intended for her estranged hubby as well.) The \"monster,\" which we see much too clearly, much too soon, looks like a reject from an old episode of The Outer Limits. And its potentially layered relationship with its creator is watered down by the creator character's bored delivery of exposition. Spoiling any kind of dark tone, the dog's abilities are played for laughs in moments more fit for an old Disney flick -- like when he drives Paul's convertible. Then again, a numbingly slow scene in which the pup taps away at a computer keyboard does give a clue who might be ultimately responsible for the clunky script. If you're a fan of the book, you might enjoy seeing a few key moments transferred to the screen (thankfully, without Corey Haim, star of the first Watchers film). But amazingly bad dialog, silly writing, cheesy special effects, wooden acting, and poor lighting combine to make this a pretty big waste of time. Based on excellent source material, this could have been camp, or scary, or at least interesting. Unfortunately, it scores on none of these fronts.",
         "Oh yeah,\"Watchers 2\" is really bad,but certainly more enjoyable than \"Grim\" or \"Haunted Sea\".The acting is passable and the dog is smarter than every person in this movie.The monster is lame looking,the gore is almost non-existent and there's also no suspense at all.I still think that this one is slightly better than \"Watchers\"(1988)with its extremely laughable \"monster\",but not as good as \"Watchers 3\"(1994)-very stupid,but gory and fun to watch monster flick set in the jungle.Recommended,if you like this sort of stuff.",
         "\"Watchers II\" isn't that bad for this kind of movie. **SPOILERS** Steve Malcerno, (Jonathan Farwell) a scientist working on a special project for the government, is worried when a group of protesters break into the compound and steal the animals, as one of them was a mutated creature. Another one of the animals, a super-smart Golden Retriever, helps a military prisoner, Paul Ferguson, (Marc Singer) avoid an unseen creature in the middle of the night. Going on the run with the dog, Dr. Malcerno tracks them while the police print him as the culprit in a series of gruesome murders. When Paul reunites the dog with it's trainer, Barbara White, (Tracy Scoggins) they learn that the other creature has been involved in all the murders and try to stop the creature. The Good News: I was expecting much worse from this one. The film has a pretty large body count, so we get some nice deaths as well. As is usual with these kinds of films, it has a requisite number of scratches on the body, as well as a brutal decapitation that is surely the best death here. It's not the goriest film ever made, but it gets the job done when it needs to. There were also some great moments in here as well. The final confrontation with the creature is nicely paced and full of action, and the final resolution scenes are quite moody and effective. A chase through the underground sewers has some nice suspense to it, and it is a little creepy as well. The scenes in the motel room, where Paul and the dog \"bond\" together has some great scenes between them, as they both discover the genius of the dog. Some of the moments were quite good, I had to add. The last thing about the film I really liked was that, just when the human side of things was getting too much, a killing would come along to keep things interesting. It sorted of knew when it was getting a little bogged down, and therefore came up with an exciting kill scene to liven things up again. The Bad News: As I stated above, the film does have a tendency to bog down a little in the middle section. Every now and then, when it would get a little slow, a killing would come along to get things interesting again, but that creates a real stop-and-go effect that gives it a really choppy feel to it. For such a fearsome creature, the monster in here gladly decides to avoid the light, as he looks really close to a knock off of the Gillman from \"The Creature from the Black Lagoon.\" It isn't scary at all, and I do feel sort of glad that most of the time we see it, it's too dark to tell what it really is like. That's actually a common theme in the movie, as while there are plenty of deaths in here, a lot of the time it's too dark to tell what's going on. The Final Verdict: Yeah, there's worse ones out there, and while it does have it's own problems, this isn't all that bad. You could do much worse than this one. This is on par with the first one, so use that as your judging rod. If you think you might like it, by all means, give it a shot. Rated R: Graphic Violence, Graphic Language, Nudity and scenes of animals in peril",
         "In terms of quality, Watchers 2 wasn't great, but it was a far better adaptation of the Dean Koontz novel. Why? The original Watchers movie did follow the book, to a degree, but only to a degree, and the only characters from the novel were the dog and the creature. Watchers 2, on the other hand, included most of the characters from the original story. It's just my own opinion, but I believe an adapted movie should follow the book as much as possible. Watchers 2 did exactly that. Dean Koontz has been known to maintain creative control on many of the later movies based on his books, so that they also follow the book to his satisfaction.",
         "More like the novel than the original, but still unsatisfying. Had its parts that where fun, but still kinda corny. Quality was dark and couldn't see what was going 80% of the time. But still I liked it. Original seemed to be more satisfying, but if your looking for a more novel like movie of Watchers - Watch it. 6/10 Because it wasn't boring, and I enjoyed a few more scenes. Yeah, watch it. Hey, it was better than the Koontz adaptation of Phantoms and Hideaway. IMDb won't let me place this unless its longer. Fine. I do own this on DVD, so it's not too bad. But if you want a REALLY GOOD Koontz adaptation see DEMON SEED. Now thats excellent. WATCH IT!!!!!",
         "Two years after the Corey Haim starring vehicle \"Watchers\", Roger Corman would produce another adaptation of Dean R. Kootnz's best-selling novel. This b-grade sequel is a sober retread changing or adding plot devices and losing the suburban setting for something urban, but probably being a little more faithful to the book as this screenplay would try to delve a bit more deeper in to this top secret experiment of genetic engineering. Here we even get an explanation (nothing special, but it is a reason) to why this creature takes out the eyes of its victim. The hybrid creature known as the Outsider is given human like instincts, but it just can't control what it was engineered to do\u0085 track down the super-intelligent dog it shares a physic link with and eliminated all who have been in contact with it. Quite slow-burn and carefully structured, but still providing the grisly shocks throughout this fugitive-on-the-run / creature-on-the-rampage theme. Instead of trying for cheap jolts, it tends to rely on its shady atmospherics (as its spends a lot time in darkly lit areas), edgy suspense (like the sewer sequence) and moody storytelling, where in doing so it doesn't feel quite as silly and dumb-down as its predecessor. Although the man in an unconvincing rubber freak of nature suit, does get a fair bit of screen time. The director doesn't really try to hide the creation either. Technically sound direction with a steady tempo if somewhat a dragged out climax. This time we have Marc Singer and Tracy Scoggins in the leads and they are quite likable. Jonathan Farwell is adequate as the unstable scientist who led the project. Also showing up in a minor turn is Mary Woronov. \"Can't teach an old dog new tricks. Cant ya?\"",
         "WATCHERS 2 is a pretty lame sequel. The first cheap WATCHERS was mostly watchable, but this is garbage. The creature is from THE TERROR WITHIN, and the cast includes Marc Singer. Avoid this rank imitation of Dean Koontz's original novel.",
         "Watchers 2 (1990) * (out of 4) When you've got nothing original to do with a sequel you simply make it a remake and that's the case with Watchers 2, which isn't worth reading about let alone watching. Another government agency has created a new golden retriever, which is just as smart as the one in the first film. Of course, they also get the idea to create another creature and so the movie can continue, the creature and dog escape (again) and bodies begin to pile up while the government runs all over the place trying to track them down. Paul Ferguson (Marc Singer) is the lucky fellow who finds the dog, falls in love with it and must try and fight off the baboon looking monster. Watchers 2 is pretty much the same movie as the first one, although this time Roger Corman was the actual producer. Apparently he didn't want to spend too much money on a script because there's certainly not one to be found here. While the first movie's monster was silly looking it at least was interesting but that's not the case here. From what I can remember the monster here appears to be the same one as in The Terror Within, another Corman production. Gore hounds might find a few interesting kills but that's not enough to keep your attention through the slow pace that makes this film a real pain to get through.",
         "This movie begins in a top-secret laboratory where a private corporation named is conducting genetic experiments on animals. However, when two agents for the NSA infiltrate the lab and get killed by one of the animals, management makes the decision to destroy all of the evidence as quickly as possible. Unfortunately, the lead scientist named \"Steve Malceno\" (Jonathan Farwell) doesn't agree with this decision and allows the most dangerous specimen to escape. This decision has disastrous consequences for everybody in its path. Now rather than reveal any more I will just say that, rather than being a true sequel, this film is essentially a remake of the original movie. Although not quite as good, in my opinion, as its predecessor it is compensated to a certain degree by the presence of Marc Singer (as \"Paul Ferguson\"), Tracy Scoggins (\"Barbara White\") and to a limited extent Irene Miracle (\"Sarah Ferguson\"). There was also some humor here and there which certainly didn't hurt either. But even so, the predictable plot and lack of suspense definitely affected this film and for that reason I have rated it accordingly. Slightly below average."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Concorde Pictures",
         "Centaur Films"
      ],
      "summaries": ["A genetically re-engineered dog develops a psychic link with a monster created in a lab experiment which goes awry."],
      "budget": 0
   },
   "movielensId": 132294,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1990-08-16",
      "dvdReleaseDate": null,
      "directors": ["Thierry Notz"],
      "runtime": 101,
      "movieId": 132294,
      "title": "Watchers II",
      "mpaa": "",
      "actors": [
         "Timothy Marlowe",
         "Marc Singer",
         "Tracy Scoggins",
         "Mary Woronov"
      ],
      "imdbMovieId": "0100904",
      "originalTitle": "Watchers II",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A genetically re-engineered dog develops a psychic link with a monster created in a lab experiment which goes awry.",
      "tmdbMovieId": 70247,
      "avgRating": 2.75,
      "releaseYear": "1990",
      "numRatings": 2,
      "posterPath": "/stS5yyINeVns7YCyOuRv3INzRgr.jpg"
   }
}