{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0061667",
      "video": false,
      "title": "First to Fight",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jack Connell",
               "gender": 2,
               "credit_id": "55443b44925141586d003189",
               "name": "Chad Everett",
               "profile_path": "/vRqcTOn7cRsioglC3zEnQMSsIUg.jpg",
               "id": 15013,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Sergeant Tweed",
               "gender": 2,
               "credit_id": "55443c80c3a3680cd90032b8",
               "name": "Gene Hackman",
               "profile_path": "/qEKcmwc1XstymEniGuCs3KIsGfP.jpg",
               "id": 193,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Peggy Sanford",
               "gender": 0,
               "credit_id": "55443cf09251414c92000af2",
               "name": "Marilyn Devin",
               "profile_path": null,
               "id": 1461970,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Colonel Baseman",
               "gender": 0,
               "credit_id": "55443b6492514174da00027a",
               "name": "Dean Jagger",
               "profile_path": "/ynPzyxE5xvkKDwr8xw18WoCsITN.jpg",
               "id": 29313,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Lieutenant Overman",
               "gender": 2,
               "credit_id": "55443cb49251415865003460",
               "name": "Bobby Troup",
               "profile_path": "/8Q5X3MIP5i7rIUBlRyIcxIfIVQ5.jpg",
               "id": 161681,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Captain Mason",
               "gender": 2,
               "credit_id": "55443d3bc3a3680ce6003478",
               "name": "Claude Akins",
               "profile_path": "/ul0S3Eb0yt2UC8h5xUuNXQHxdy8.jpg",
               "id": 4307,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Sergeant Carnavan",
               "gender": 2,
               "credit_id": "55443ca1c3a3680cd7003523",
               "name": "James Best",
               "profile_path": "/gEb11akJXaCYWF28RPPnTX5mnmC.jpg",
               "id": 40185,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Sergeant Schmidtmer",
               "gender": 2,
               "credit_id": "55443c92c3a368573b000668",
               "name": "Norman Alden",
               "profile_path": "/vdzvCDT4UtVctmo17OSpU8HVUxe.jpg",
               "id": 7139,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Sergeant Maypole",
               "gender": 2,
               "credit_id": "55443cbfc3a368573b000674",
               "name": "Bobs Watson",
               "profile_path": "/tVVXCJp1gPwKrUck5h89cWdBXUo.jpg",
               "id": 199468,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "O'Brien",
               "gender": 2,
               "credit_id": "55443d44925141586d0031cc",
               "name": "Ken Swofford",
               "profile_path": "/7l4GppNqzi2lvs2R1nbTfxwiKcW.jpg",
               "id": 45308,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Hawkins",
               "gender": 0,
               "credit_id": "55443cd2c3a3680cdb00342f",
               "name": "Ray Reese",
               "profile_path": null,
               "id": 156349,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Karl",
               "gender": 0,
               "credit_id": "55443cc99251414c92000ae4",
               "name": "Garry Goodgion",
               "profile_path": null,
               "id": 1461969,
               "order": 11
            },
            {
               "cast_id": 36,
               "character": "Adams",
               "gender": 0,
               "credit_id": "554447e3c3a3680ce8003559",
               "name": "Robert Austin",
               "profile_path": null,
               "id": 194902,
               "order": 12
            },
            {
               "cast_id": 37,
               "character": "Sergeant Slater",
               "gender": 2,
               "credit_id": "554447ee925141586d003367",
               "name": "Clint Ritchie",
               "profile_path": "/8lEiJ3sHOznsp8cArd9IdxTBRBz.jpg",
               "id": 87473,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "55443b7ac3a3680ce8003339",
               "name": "Christian Nyby",
               "profile_path": null,
               "id": 13973,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "554446a5c3a368573b0007d4",
               "name": "Gene L. Coon",
               "profile_path": null,
               "id": 15609,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "554446c5c3a3680cdb003617",
               "name": "William Conrad",
               "profile_path": "/7tMF2QMwu5nFja1BZcGEDmYze5X.jpg",
               "id": 16412,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "554446f292514174da000467",
               "name": "Fred Steiner",
               "profile_path": null,
               "id": 89220,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "554446ff925141586d003351",
               "name": "Art Loel",
               "profile_path": null,
               "id": 1461988,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5544470ec3a3680cdb003624",
               "name": "Gordon Bau",
               "profile_path": null,
               "id": 4313,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "55444724c3a3680ce8003542",
               "name": "Jean Burt Reilly",
               "profile_path": null,
               "id": 16538,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5544473fc3a3680cd7003709",
               "name": "Russell Llewellyn",
               "profile_path": null,
               "id": 1461989,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5544474f92514119e0000a2f",
               "name": "Victor Vallejo",
               "profile_path": null,
               "id": 1461990,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5544476ac3a368573b0007f2",
               "name": "Robert B. Lee",
               "profile_path": null,
               "id": 4315,
               "department": "Sound",
               "job": "Sound Director"
            },
            {
               "gender": 0,
               "credit_id": "55444779c3a3680cd90034bc",
               "name": "Charles E. Dolan",
               "profile_path": null,
               "id": 1461991,
               "department": "Crew",
               "job": "Propmaker"
            },
            {
               "gender": 0,
               "credit_id": "554447869251415865003638",
               "name": "Budd Albright",
               "profile_path": "/mbzWXPaMrPQbumm0sflSLWHr0ch.jpg",
               "id": 1461992,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 2,
               "credit_id": "5544479cc3a3680cd5003624",
               "name": "Dan Wallin",
               "profile_path": null,
               "id": 74811,
               "department": "Crew",
               "job": "Score Engineer"
            },
            {
               "gender": 0,
               "credit_id": "554447b09251413fc0000863",
               "name": "Ted Ashton",
               "profile_path": null,
               "id": 1461993,
               "department": "Production",
               "job": "Publicist"
            },
            {
               "gender": 2,
               "credit_id": "554447c69251415865003644",
               "name": "Stacy Harris",
               "profile_path": "/jHGoswR4NwJSAnscTuwyAnpbjkH.jpg",
               "id": 93974,
               "department": "Writing",
               "job": "Dialogue"
            }
         ]
      },
      "genres": [{
         "name": "War",
         "id": 10752
      }],
      "popularity": 0.127494,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 281180,
      "vote_count": 0,
      "budget": 0,
      "overview": "Jack is the sole survivor of a Japanese attack on his squad at Guadalcanal. Because of his heroism and the fact that he is still alive, he becomes a Medal of Honor hero. He returns to train new recruits for the Marines and falls for a girl named Peggy. When training and marriage leave him with an empty feeling, he decides on a transfer back to the front lines. Soon he will find that marriage and life will change his outlook on the grueling battles that lie ahead.",
      "similar": [],
      "original_title": "First to Fight",
      "runtime": 97,
      "poster_path": "/fmyYWMwYja2ve57DC52tI5A4WT9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "William Conrad Productions",
            "id": 16064,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1967-01-25",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "The Blockbuster Story of a Fighting Marine That Comes Mortar-Screaming Out of Green Hells and Jungles!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christian Nyby"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Gene L. Coon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061667/",
      "coverLink": null,
      "actors": [
         "Chad Everett",
         "Marilyn Devin",
         "Dean Jagger"
      ],
      "reviews": [
         "Just watched the video. Chad Everett is in his prime as Jack Connell, a marine officer who has won the Congressional Medal of Honor. This film was made shortly before Viet-Nam exploded into all-out war. a gung-ho tale of a once fearless marine who comes to realize that one's life belongs to themselves as well as those with whom they love. Great acting, realistic action scenes, and an impressive performance by Gene Hackman. Sort of strange how in 1967 Chad Everett was being groomed for\"super stardom\" and Gene Hackman received 6th billing. Turns out that Hackman would shortly become a mega superstar with Bonnie & Clyde and The French Connection, while Everett's film career was reduced to \"B\" movies; stardom was his on television however.",
         "Chad Everett is a Marine who survives a brutal Japanese attack on his unit, and because of his heroism is sent Stateside on a morale-building tour, where he falls for the beautiful woman assigned as his guide. This film is actually better than it sounds; Everett is quite effective as the Marine who didn't think much about his own mortality while in combat, but begins to realize that circumstances are entirely different now that he has a wife to worry about. The supporting performances are generally competent, though Marilyn Devin's inexperience as an actress is obvious in her role as Everett's new wife (she later left the industry and became a newscaster). Gene Hackman and James Best are quite good as two of Everett's fellow Marine combat veterans. The battle scenes are well done, the story moves along at a good clip, though it does lag in spots, and overall it's one of director Christian (\"The Thing\") Nyby's better efforts.",
         "I've always had a warm spot in my heart for this \"B\" movie because I watched some of it being made and some scenes were shot immediately in front of the quonset hut in which I lived at that time, at the Second Infantry Training Regiment, San Onofre area, Camp Pendleton, where I was stationed in the training section. It was pretty neat to watch and is the only movie I've ever seen \"made\" and I had the pleasure of driving Chad Everett and Dean Jagger around in a Jeep for two or three days. (Some other lucky Marine got to drive the heroine!) I got Chad Everett's autograph, but way back then he wasn't as famous as he would be later. The movie itself is pretty good - but I'm favorably prejudiced toward any USMC movie!",
         "I was stationed at Camp Pendleton at the time this movie was made, and was very fortunate to be picked as an extra in the movie. It was a very rewarding experience. I have been looking for a copy of the movie ever since, and was glad to find it here. Being a Marine at the time and being part of this movie was one of the high lights of my life., because of the circumstances, I have to rate the movie a 10, but if I am totally honest it was probably more like an 8. I would really like to know how I can get a list of the extras, as most of them were lost in Viet Nam. For that reason alone I would like a list of the extras as most of the extras were friends of mine lost in another war fought by brave Marines who deserve credit for an endeavor of peace, at a time of war...SIMPER FI",
         "When \"First to Fight\" began, I was surprised to see Chad Everett playing a career Marine! But despite my feelings, he was actually pretty good and the film well worth seeing. The story begins at the Battle of Guadalcanal...one of the longest and bloodiest battles of WWII. During this fight, Sgt. Jack Connell (Everett) rises to the occasion and single-handedly fights off a Japanese attack. For this heroism, he's awarded the Congressional Medal of Honor and is taken for an extended State-side publicity tour. Along the way, he gets married and then is given a nice assignment training recruits. But he feels survivor guilt and eventually gets himself sent back into action...but that's not the end of the story. The film is interesting and deals with one aspect of Post-Traumatic Stress Disorder. Everett handles it well and the story never disappoints.",
         "I watched this on TCM, they played it for Memorial Day 2012, I had never heard of it but when I saw Chad Everett it seemed different so was interested. The beginning battle scene is straight out of many films before, it would seem, but especially reminded me of the battle scene in Pride of the Marines with John Garfield. Not that it was bad, it just seemed like a verbatim copy of it to a point. The movie then goes into a love affair part which I always hated before but this one had some realism to it and reminded me of questions in my own life and with todays never ending wars I have had the option as a reservist to go back to a war zone and these issues are address in this film with Chad's fiancé and then wife. I thought that was pretty interesting and I normally hate the domestic relationship parts in these war films. Which brings me to what I now started thinking of this film, it was made in 1967 but sure did seem that it was made in 1957 or 55 or even 52. I'm guessing like others have said that this was made solely to be a B movie/ drive in fare. It's target audience being the Marine Corps, and the South. I believe Gomer Pyle USMC was the number one TV show that year so this was made to cash in on that audience somewhat, IMHO. The final battle scenes seemed rushed and unrealistic in Chad's sudden change of heart but I guess they thought the film needed something, it really didn't they should have just left the good chance of death be enough tension for the audience and then when it gets all solved it really reveled itself as just a B movie action flick. Chad did a good job and showed a wide range of emotions I liked him, Gene Hackman was wasted here especially with the drama of having a coward officer above him, he was not the Gene Hackman you and I know. Claude Akins has major billing but has a very bit part as a Major at the CP, no drama went on there. Dean Jagger does a convincing Marine Colonel, and William Conrad adds his distinctive voice as a narrator. The combat hardware seemed real enough for the period. It was probably post WW2 hardware but unlike a film like Battle Of The Bulge where the Germans are using Pershing tanks as Tigers and it's distracting, since I am not familiar with Pacific WW2 hardware it looks realistic enough and the stock footage was in color and blended in OK. All in all, I was entertained enough but this wont go down as any Sands Of Iwo Jima best of film. I give it a 6 of 10 as far as B movie war dramas go.",
         "I saw this movie as a kid when it first came out in 1967. My father let me use his automobile to go to the local drive in theater to see this movie. I was quite impressed with it as a young lad and join the Marine Corps six months later. This movie has a lot of sentimental value for me. But, I'm a little confused as to why it cost so much at $49.00 and change on VHS. Can anyone give me some insight as to why this movie is so valuable? I want to purchase this movie but not at the current asking price. Thanks Claude W. Butler",
         "After seeing this and being familiar with the series, The Pacific, it seems this is a fictional and weaker version of the real story of Sgt. John Basilone. Nevertheless, this is a decent film and does convey some of the hell our men went through in the early stage of the war over there. The Pacific portrayed it all much better.",
         "A B-Movie at best, but when you're in it changes everything. M1 rifles on Guadalcanal? Japanese soldiers with rubber bayonets. Several modern day vehicles in the background at various points. But hey! It did honor a real life Marine hero.. Manila John Basilone. In August 1966, I was 19 years old, had just graduated Recruit Training at MCRD San Diego and had relocated to Camp Pendleton for Infantry Training Regiment. Reveille went 30 minutes early for us one day... 0500 instead of 0530. Once we were in formation, we were double-timed (shuffle run) 5 miles to a location none of us had ever been to before. It was the location of the current day's shooting of The First to Fight. In one scene, they took two of our platoons and put us behind a platoon of actors on the side of a hill with a path running down it. When they yelled action, the actors were to run down the path and turn left. We were to run down the path and turn right. As we waited, one of the film's crew came up through the platoon of actors spraying water on them that was supposed to make them look sweaty. After he finished when them he came to us, took one look and said I don't think you fellas need this. Having run 5 miles to get to the \"lot\" he was right. Unfortunately, that scene was left on the cutting room floor. The scene we were in that made the final cut occurs about 50 or so minutes into the film. Chad Everett is mad as his men for not picking up on instruction and is berating them. Our 4 platoon company is marching around in rectangles in the background making it appear there were a lot more Marines present than were actually present. I've always wanted to ask Gene Hackman if he remembers the movie we made together. I'm sure that would draw a quizzical look. He'd certainly have no idea who I was... but it's one of my favorite memories and favorite stories to tell... but a pretty crappy movie when you get right down to it."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": ["William Conrad Productions"],
      "summaries": [
         "Jack is the sole survivor of a Japanese attack on his squad at Guadalcanal. Because of his heroism and the fact that he is still alive, he becomes a Medal of Honor hero. He returns to train new recruits for the Marines and falls for a girl named Peggy. When training and marriage leave him with an empty feeling, he decides on a transfer back to the front lines. Soon he will find that marriage and life will change his outlook on the grueling battles that lie ahead.",
         "In WW2, highly decorated Marine Sgt. Jack Connell comes home to the USA from the Pacific War and trains recruits for the army until his fighting spirit prods him to request a return to active duty on the front lines."
      ],
      "budget": 0
   },
   "movielensId": 132249,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-01-25",
      "dvdReleaseDate": "2010-05-28",
      "directors": ["Christian Nyby"],
      "runtime": 97,
      "movieId": 132249,
      "title": "First to Fight",
      "mpaa": "PG",
      "actors": [
         "Chad Everett",
         "Gene Hackman",
         "Marilyn Devin",
         "Dean Jagger",
         "Bobby Troup",
         "Claude Akins",
         "James Best",
         "Norman Alden",
         "Bobs Watson",
         "Ken Swofford",
         "Ray Reese",
         "Garry Goodgion",
         "Robert Austin",
         "Clint Ritchie"
      ],
      "imdbMovieId": "0061667",
      "originalTitle": "First to Fight",
      "genres": ["War"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jack is the sole survivor of a Japanese attack on his squad at Guadalcanal. Because of his heroism and the fact that he is still alive, he becomes a Medal of Honor hero. He returns to train new recruits for the Marines and falls for a girl named Peggy. When training and marriage leave him with an empty feeling, he decides on a transfer back to the front lines. Soon he will find that marriage and life will change his outlook on the grueling battles that lie ahead.",
      "tmdbMovieId": 281180,
      "avgRating": 2,
      "releaseYear": "1967",
      "numRatings": 1,
      "posterPath": "/fmyYWMwYja2ve57DC52tI5A4WT9.jpg"
   }
}