{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "war",
            "id": 6091
         }
      ],
      "imdb_id": "tt2157346",
      "video": false,
      "title": "Rommel",
      "recommendations": [61049],
      "backdrop_path": "/kqaZy547ohe31Qx8MeoKx4OPMtO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Erwin Rommel",
               "gender": 2,
               "credit_id": "52fe4c6fc3a368484e1b814f",
               "name": "Ulrich Tukur",
               "profile_path": "/assJYvivgfukHFWim6o9T3sUmu9.jpg",
               "id": 8198,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Oberleutnant Hofacker",
               "gender": 2,
               "credit_id": "52fe4c6fc3a368484e1b8153",
               "name": "Tim Bergmann",
               "profile_path": "/ekaOuiwfM6D7XZ6Fm99XAtLJWnA.jpg",
               "id": 56970,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Burgdorf",
               "gender": 2,
               "credit_id": "52fe4c6fc3a368484e1b8157",
               "name": "Ralf Dittrich",
               "profile_path": "/2YHIjJiEsclTSKSQLAtShA2zxEK.jpg",
               "id": 239277,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Hans Speidel",
               "gender": 2,
               "credit_id": "536007610e0a266270000079",
               "name": "Benjamin Sadler",
               "profile_path": "/9c9zOtcZOqB6v4WLXliqQtrwBt2.jpg",
               "id": 27419,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lucie-Maria Rommel",
               "gender": 1,
               "credit_id": "536007720e0a266274000084",
               "name": "Aglaia Szyszkowitz",
               "profile_path": "/iNBD18dzCKYVTuDLyfYi7Z44z4w.jpg",
               "id": 32818,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Günther von Kluge",
               "gender": 2,
               "credit_id": "536007840e0a266274000086",
               "name": "Thomas Thieme",
               "profile_path": "/izFcVDulGPf6lhV8zUbRtecCJu7.jpg",
               "id": 8199,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Gerd von Rundstedt",
               "gender": 2,
               "credit_id": "536007940e0a266274000089",
               "name": "Hanns Zischler",
               "profile_path": "/zlVtIH2P4cZLyftZZcfFo037N3t.jpg",
               "id": 169,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Adolf Hitler",
               "gender": 2,
               "credit_id": "536007b90e0a26627000008b",
               "name": "Johannes Silberschneider",
               "profile_path": "/wNoBsSTxoWuRYlr7o3zNI7AUdSf.jpg",
               "id": 23750,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Heinz Guderian",
               "gender": 0,
               "credit_id": "536007cf0e0a2662770000b7",
               "name": "Klaus J. Behrendt",
               "profile_path": "/eNfYGN4LfSWtc9rJH57C2GneJ5O.jpg",
               "id": 28368,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Eberhard Finckh",
               "gender": 2,
               "credit_id": "536007df0e0a266264000091",
               "name": "Rolf Kanies",
               "profile_path": "/sTcgax98lVq7j8LK3wAINUYzO2b.jpg",
               "id": 8801,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Manfred Rommel",
               "gender": 2,
               "credit_id": "58dd9727c3a3687c5d0003ac",
               "name": "Patrick Mölleken",
               "profile_path": "/AoqJfAfydQ18mZyt4N18enl15dZ.jpg",
               "id": 525439,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Comtesse La Rochefoucauld",
               "gender": 1,
               "credit_id": "5a7d30ac9251415504000d5f",
               "name": "Vicky Krieps",
               "profile_path": "/AdcQCdKeZTJ3TYNOzUEEnjTRdmA.jpg",
               "id": 1080195,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c6fc3a368484e1b8145",
               "name": "Niki Stein",
               "profile_path": "/w6jKv29WQn5lDOJgmskQGEzcLeu.jpg",
               "id": 28445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4c6fc3a368484e1b814b",
               "name": "Niki Stein",
               "profile_path": "/w6jKv29WQn5lDOJgmskQGEzcLeu.jpg",
               "id": 28445,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.306626,
      "production_countries": [],
      "id": 139862,
      "vote_count": 13,
      "budget": 0,
      "overview": "A new film about Erwin Rommel has been shown on German television, depicting the general as a weak man undone by his links to Adolf Hitler.",
      "similar": [
         821,
         424,
         14574,
         228150,
         613,
         637,
         9045,
         423,
         324786,
         374720,
         289222,
         369885,
         10105,
         1654,
         289,
         914,
         1771,
         22972,
         16869,
         2253
      ],
      "original_title": "Rommel",
      "runtime": 120,
      "poster_path": "/99QvumY17NTE20M38CkNYSxswsl.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [],
      "release_date": "2012-06-06",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": ["Niki Stein"],
      "runtime": 120,
      "synopsis": null,
      "writers": ["Niki Stein"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt2157346/",
      "coverLink": null,
      "actors": [
         "Ulrich Tukur",
         "Tim Bergmann",
         "Rolf Kanies"
      ],
      "reviews": [
         "If you are interested in WWII movies and enjoy a very realistic dramatic movie rather than an action movie this is the one for you. Great acting by German actors, realistic plots and much detail spend on uniforms, armor and real live settings in WWII. The Geman language enhances the reality of the movie. Ulrich Tukur plays Rommel with great resemblance and talent.The movie reveals the man Rommel and his aversion of Hitle in the afterdaysr and the Plot to kill Hitler (you must remember Valkyrie: with Tom Cruise). Though casted very well, it is hard to identify yourself with the main character. The actors each are casted very well, with actors who play the German Generals and officers with great resemblance. Hope you enjoy the movie!",
         "admirable ambition to present Rommel's last months. and, in same time, to create an answer to Walkiria. only problem is the result, the film itself. it is half documentary, half artistic movie. it seems be a kind of labyrinth and this fact is almost strange. maybe, the sin is viewer expectation. and the pieces from another movies about events. but the great effort, the too realistic scenes, the portrait - obvious pledge for a hero - are too much and, in same time, too little. sure, it is a honest film. the good intentions of director are basic virtue and it is difficult to ignore that. the preoccupations for details gives not the expected result. but, must see the glass half full - it is a German attempt to present a great man. and, after all, each portrait is subjective.",
         "It's an exceptionally good television movie. The performances are uniformly fine, the photography is crisp, judicious use is made of computer-generated effect, and the narrative covering the last seven months of Field Marshall Ervin Rommel is convincing. It's less dramatic and more believable than James Mason's tortured Rommel in \"The Desert Fox,\" less corny actually. This Rommel never kisses his wife, Lucy. He just nuzzles her. And he does not stop on the doorstep every time he leaves and whisper, \"Good-bye, Darling.\" Ulrich Tukur's Rommel marches through his battles and finds himself in a conundrum with only one solution. He's all business and dignity. The effect is less dramatic but more believable. In \"The Desert Fox\" we are never told exactly what it was that Rommel did that earned him a death sentence. Here, we learn that he knew of the plot against Hitler but refused involvement. He would have gone along with Hitler's arrest but not his assassination. That accords with what I've read elsewhere. He knew something was afoot, and he knew many of the men behind the plan, but not exactly what they intended. In \"The Desert Fox,\" Mason as Rommel protests that he is a soldier, not a politician. Here the message is spelled out in boldface. He had wistful dreams, not mentioned in this film, of surrendering peacefully to the Western Allies and perhaps even forming an alliance with them against the Bolsheviks. That's not a politician speaking. The story is a kind of docudrama in which events are presented pretty much as they happened. Private conversations, of course, are fabricated. However, it's gripping throughout -- a docudrama, yes, but a very carefully thought-out and executed docudrama.",
         "This movie has the German stamp of quality: Good acting, good attention to details (uniforms, military equipment), great scenery and great sense of authenticity. If you are interested in history, this movie will take you in the atmosphere of those days. And it will do that so good that you'll have the impression that you see the actual events taking place. However, it lacks the story. Yes, the events did take place as they were presented, but the subject had tremendous potential: Hitler was a crazy and was obviously leading the entire country to disaster. Edwin Rommel could have been representative to all generals around the world who were torn apart between the sworn allegiance to their country and the resistance to the lunatic currently in charge. This could have been the symbol movie for all other military in similar cases: The STASI police, who let the Berlin wall fall although in other occasions they shot everyone who fled into West Berlin. The Romanian generals who refused to shot their own population, although they were ordered to do so by Ceausescu. And all other crazy dictators like Antonio Salazar, Rafael Trujillo, Mohamad Gadaffi, Saddam Hussein, Mobutu Sese Seko, François Duvalier or Kim Jong Il, they all had honest generals in their army serving their countries. Maybe not many, but some of them had problems with their conscience in one way or another and they were forced to make difficult decisions. Same with Rommel here. Yes, he betrays the Fuhrer, but Hitler is not Germany. Yes, he could be killed if he fails. He will probably be killed too if they're on the losing side of the war. But this maniac would rather give cyanide pills to all Germany than to surrender. What's the right thing to do? To whom does a military sworn allegiance to? To the leader or to the people? Instead of exploiting all this drama, the director of this movie chose to make this film a documentary.",
         "ROMMEL 2012 This is a well-made television movie about the last few months of German Field Marshall, Erwin Rommel. The film was shown on German television in Nov 2012. This one starts several months before the allied invasion of June 6th, 1944. Rommel is in charge of putting the defences of the French coastline into shape. He does not have enough men or material to fortify the entire coast. So he must make an educated guess as to where the Allies will land. Most of the German Staff officers are sure it will be in the Calais area, Rommel though is leaning towards Normandy. Rommel, Ulrich Tuker, has to deal with his nominal superior in France, Field Marshall, Von Rundstedt (Hanns Zischler) and Adolf Hitler. (Johannes Silberschneider) Hitler keeps interfering with Rommel's plans for the placement of the important armoured Panzer Divisions. Rommel wants them near the beaches for immediate counter-attacks. Hitler and the General staff think otherwise. Rommel's chief of staff, General Speidel, (Benjamin Sadler) is approached by members of a group planning to overthrow Hitler and his mob. They want Speidel to broach the idea to Rommel of joining the plot. Rommel listens but is rather reluctant to join. Rommel heads back to Germany to visit his wife on her birthday. Needless to say this happens to be June 6th. He has to rush back to France to take charge of the defenders. Of course Rommel is proved right about the location of the invasion. He is also proved correct about the Panzer Divisions being kept too far behind the front. It takes them days under constant air attack to reach the coast. The German forces put up a stiff resistance, particularly against the British and Canadians. The losses though are difficult to replace and it is rapidly becoming a losing battle of attrition. Rommel now decides that Hitler does indeed need to be replaced. He agrees to join the coup, but not if there is an assassination of Adolf. His offer to join goes nowhere as he is badly wounded the next day in a strafing attack by RAF Spitfires. The July plot goes forward and there is an assassination attempt on Hitler. The coup collapses as Hitler survives the attack. The ringleaders of the plot are soon rounded up with most being shot immediately. The rest are in for a severe bit of questioning by the Gestapo and Security forces. Rommel, (Tuker) has been recovering in a hospital in Germany. He knew nothing about the attempt on Hitler's life. He is however soon implicated in the plot. Adolf is not amused, but for political reasons wants to avoid a public trial. Rommel is offered a way to save his wife and son. He will take cyanide and his death will be said to have been from his wounds. He will get a full military funeral etc. Rommel agrees. This is a nicely made bit of television with excellent period detail, solid acting and good direction. Well worth a watch.",
         "Now here is a story that doesn't embellish or does over the top dramatic. The film records the last few months before Rommel was killed by the man who served and the German people. The history includes a lot of small but crucial detail such as he knew and was horrified at the killing of Jews including revenge killing when the S.S. men killed 450 women and children. The film also explores the inner conflict between Hitler, high ranking officers and Rommel. It doesn't portray him as suddenly turning sides but gradually learning of the war crimes, the difficulty with Hitler, working with the German resistances, and eventually suicide. This film was studied and everything carefully studied although the uniforms was sort of wrong at times. Another complain is some of the character seems a little bit heavy weight especially Von Kluge looks a bit too fat, Keitel looks like a skinny man who is like a dirty old man. One thing for sure, the film does portray Rommel as Hitler's right hand general, but soon learns more about crimes committed by the German S.S. and some of the army official. Had he survived, I'm sure he would have been fully against or may defect along with his family. But otherwise, these things you can overlook and ignore because the movie does stand itself as written \"as it had happen.\" The movie seems like a documentary too so treat it as that, not just for entertainment purposes but a general points leading up to his death.",
         "The film is a Rommel biography written and directed by Niki Stein . It's based on true events and real roles . In WWII Field Marshal Erwin Rommel won reputation as Germany's most popular General but he played an important part in the invasions of central Europe and France . At the same time he was regarded by many Allied officers as a master of desert warfare and as a fair-minded professional . Erwin Rommel (Ulrich Tukur) really achieved fame as the commander of the German Afrika Korps , operating against the British in North Africa and he captured Tobruk ,the key to the British defenses . Quick to see advantage and profit from it , he ran rings round the British for almost two years before being stopped at Alamein and then driven out of Africa by General Marshal Montgomery . Later on , Rommel was given command of Army in northern Italy to prevent an Italian defection and to counter an Allied invasion of Southern Europe . In 1944 he was transferred to command of an army group in northern France , his task is the defense of the French coast against the long-anticipated Allied invasion . Rommel has to reinforce the incomplete state of the defensive fortifications , the slow pace of constructing the Atlantic Wall, and the lack of preparedness of the defending units mostly comprised of poorly-trained conscripts . On two occasions, Rommel and Von Rundstedt (Hanns Zischler) saw Hitler and attempted to convince him that he should end the war while considerable German forces still existed . The pale and shaken Fuehrer met their frankness with angry diatribes . The picture concerns about the previous and post days to the D-Day invasion , known as ¨Overlord operation¨. As Rommel has disputes with the German High Command as well as urges his troops to hasten the pace of the Atlantic Wall construction , resolves the complications on subordinates and he puts the most veteran battle-hardened divisions under his command . Five beaches -codenamed Utah, Omaha, Gold,Juno and Sword- were selected as the landings points for the British and US Corps , the operation will be preceded by a month-long bombing campaign to disrupt communications , preventing reinforcements from moving quickly into the threatened area and destroy vital bridges and gun positions . The German response commanded by Rommel was hampered by the damage done to their communications ,by a rigid structure which required a personal directive from Hitler before any significant move could be made and by belief that the landing the major Allied attack would come in the Pas of Calais,a belief fostered by Allied deception operations . Allied casualties during the day amounted to 2.500 killed and about 8.500 wounded .Allied air forces flew 14.000 sorties in support of the operation and lost 127 aircraft .After the Allied invasion of Normandy (June 6,1944) , Rommel was severely injured when his automobile was strafed by a British plane,and he was sent home to Ulm to recover along with his wife Frau Lucie Marie (Aglaia Szyszkowitz) . By this time , he had become increasingly disillusioned not only by Hitler's unrealistic military leadership but also by the worldwide reaction to Nazi atrocities . He opposed the project assassination attempt on Hitler's life on the ground that this action would only create martyr . Rommel never took an active role in the July Plot executed by Colonel Klaus Von Stauffenberg , although the conspirators wanted him as Chief of state after the elimination of Hitler . However the plot failure ,one of the conspirators , before he died in agony on a meat hook , blurted out Rommel's name to his tormentors and his doom was sealed , offered the choice of a court-martial or reprisals against his his family or suicide . The picture is well starred by Ulrich Tukur as Erwin Rommel who gives a notable acting . In the film appears famous Nazi characters who are well interpreted by awesome actors , as Benjamin Sadler playing General Speidel , as Gen. Feldmarschall von Kluge acted by Thomas Thieme , as Gen. Feldmarschall von Rundstedt played by Hanns Zischler , Gen. Feldmarschall Keitel performed by Joe Bausch , General Guderian by Klaus Behrendt and Hitler featured by Johannes Silberschneider who provides an excellent performance (but he doesn't reach to Bruno Ganz in ¨The downfall¨) . The motion picture was professionally directed by Niki Stein . Rating : Good , above average and well worth watching . Others films appearing this mythic figure are the followings : ¨The desert fox¨ (1951) by Robert Wise in which Rommel's James Mason displays a first-rate interpretation and he'll repeat role in ¨The Desert Rats¨ (1953) by Robert Wise ; furthermore : ¨Battle of Alaimen¨ by Giorgio Ferroni played by Robert Hossein and ¨Raid on Rommel¨ by Henry Hathaway played by Wolfgang Preiss .",
         "a correct film. the choice of actors, the atmosphere, the portrait of Rommel who is not only realistic but, in same measure, useful for discover the man behind the hero are inspired ingredients for create coherent fresco of principles, sense of duty, courage and wise vision about the situation of Germany from a Nazi officer who represents the traits of a lost world under dictatorship. a film about principles more than about a man. because the actions of Rommel are fruits of a faith who , translate in smart manner in each scene, represents a kind of map of the contemporary society. a correct film. and that is more important than great, beautiful or profound. because it propose not only a biography but a model.",
         "\"Rommel\" is a German television film from 4 years ago that stars Ulrich Tukur as the title character. It was written and directed by Niki Stein and sadly, he still did not manage to prove that he is a filmmaker who is good enough to make an impact on the big screen. Or the small screen. I am not really sure what the problem here is. Is it that the character of Rommel is simply not suited for film or is it that they just made a very forgettable movie here. It certainly isn't helping that the film runs for an impressive 2 hours. When I look at another recent German television film (\"Stauffenberg\"), then I see everything that this film here is missing: interesting characters, strong focus and a story that will at least be interesting to you, maybe even get you on the edge of your seat. \"Rommel\" has none of these attributes. It is very dry and even if it may be historically accurate than it lacks the heart to really have people interested enough to care about the historic circumstances. It is not Tukur's fault and you cannot really blame the supporting actors either. If one is to blame, then it is Stein here. He had many good actors here to work with, so it is pretty disappointing to see the outcome of this film here in terms of quality. It does not deserve to be called one of Germany's most famous small-screen films from the 21st century. I do not recommend the watch.",
         "Those who seek excuses for Germany's history from 1933-45 and from even earlier in terms of Jew hatred and imperialist ambitions in Europe are quite happy with a portrayal of Rommel as anti-Nazi and a participant in the attempt to murder Hitler in 1944. But the evidence of his anti-Nazi intentions and actions is sparse and the movie is at least honest and realistic in refusing to give this theme more weight than the little it deserves. Of course by 1944, after the Normandy invasion and with the Soviets advancing every more closely to Germany proper, many German in the elite, military and civilian, started entertaining possible ways of putting Hitler out of power and influence. Ordinary Germans did not have enough information to engage in this kind of enterprise and they fought, out of conviction and out of fear, until the end. Personally I must state that anti-Hitler feeling and activity by elites were always very weak, were motivated by fear of defeat by the Allies and fear of being held responsible for what they had done and condoned for so long. These so-called anti-Nazi Nazis were still anti-semitic, still opposed to democracy, still nostalgic for the old Germany of the Empire of Wilhelm II, and still unreconciled to Germany not controlling at least most of eastern Europe; they were still violently anti-communist and not particularly happy with America coming into the picture. So regardless of what positive role Rommel might have played, and I doubt there was much here, the heroic Rommel is part of an attempt to blame Hitler or Himmler and his SS for everything bad. In truth the Wehrmacht participated as much as the SS in murdering Jews and Poles and other perceived enemies; they starved millions of Russian soldiers to death in camps, and did not much to be proud of. Historian Omer Bartov has totally destroyed all interpretations of a neutral Wehrmacht. Participation in the plot against Hitler was not a very serious undertaking and you cannot trust any evidence that creates heroes and resisters where there were none."
      ],
      "genres": [
         "Action",
         "Biography",
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": [
         "ARD Degeto Film",
         "Bayerischer Rundfunk (BR)",
         "Cactus Films"
      ],
      "summaries": [
         "In November 1943 Hitler moves Rommel and his Army Group B headquarters to Normandy. The task is the defense of the French coast against the long-anticipated Allied invasion. In Normandy, Rommel notices the incomplete state of the defensive fortifications, the slow pace of constructing the Atlantic Wall, and the lack of preparedness of the defending units mostly comprised of poorly-trained conscripts. Appalled by this Rommel urges his troops to hasten the pace of the Atlantic Wall construction and he begs the German High Command to place more veteran battle-hardened divisions under his command. He especially wishes to have panzer divisions and SS divisions at his disposal for a powerful counter-attack against Allied landings. Hitler refuses to release the vital panzer divisions to Rommel's command and to make matters worse, Rommel gets wind of a possible assassination plot against Hitler.",
         "The story of the final seven months in the life of German Field Marshal Erwin Rommel."
      ],
      "budget": 6000000
   },
   "movielensId": 132372,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2012-06-06",
      "dvdReleaseDate": null,
      "directors": ["Niki Stein"],
      "runtime": 120,
      "movieId": 132372,
      "title": "Rommel",
      "mpaa": null,
      "actors": [
         "Ulrich Tukur",
         "Tim Bergmann",
         "Ralf Dittrich",
         "Benjamin Sadler",
         "Aglaia Szyszkowitz",
         "Thomas Thieme",
         "Hanns Zischler",
         "Johannes Silberschneider",
         "Klaus J. Behrendt",
         "Rolf Kanies",
         "Patrick Mölleken",
         "Vicky Krieps"
      ],
      "imdbMovieId": "2157346",
      "originalTitle": "Rommel",
      "genres": [
         "Action",
         "War",
         "History",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A new film about Erwin Rommel has been shown on German television, depicting the general as a weak man undone by his links to Adolf Hitler.",
      "tmdbMovieId": 139862,
      "avgRating": 3.08333,
      "releaseYear": "2012",
      "numRatings": 6,
      "posterPath": "/99QvumY17NTE20M38CkNYSxswsl.jpg"
   }
}