{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "special air service",
         "id": 194435
      }],
      "imdb_id": "tt2717318",
      "video": false,
      "title": "I Am Soldier",
      "recommendations": [
         239845,
         220820,
         80583,
         81024,
         66164,
         289716,
         10252,
         241765,
         268060,
         277399,
         91333,
         56913,
         260063,
         51823,
         199556,
         70008,
         238475
      ],
      "backdrop_path": "/dtHYfr21a8XlpyEl6mh89LQwd4F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Carter",
               "gender": 2,
               "credit_id": "5325dc4d9251410c870020e6",
               "name": "Noel Clarke",
               "profile_path": "/2ggZZ3bHvXyvD2fODiAjLLTQ4kx.jpg",
               "id": 76242,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Agent Blake",
               "gender": 2,
               "credit_id": "5325dc6492514113b9002049",
               "name": "Philip Desmeules",
               "profile_path": null,
               "id": 1077056,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Tommy",
               "gender": 0,
               "credit_id": "5326dea2c3a36824b500a918",
               "name": "Duncan Casey",
               "profile_path": null,
               "id": 1301637,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Petrovic",
               "gender": 2,
               "credit_id": "5326ded2c3a36824af003c6d",
               "name": "Lee Charles",
               "profile_path": "/q3eeQOpQR7DH5YxykxHfbdld1WZ.jpg",
               "id": 1301638,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Garland",
               "gender": 2,
               "credit_id": "5326df6fc3a368572500b5b0",
               "name": "Jordan Long",
               "profile_path": "/yMyHIBiyzZbbWapbcdR57MHqSC.jpg",
               "id": 199529,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Cowan",
               "gender": 0,
               "credit_id": "5326df91c3a36813c2003fda",
               "name": "Allistair McNab",
               "profile_path": "/f5bpEswRRUHNVY3XAqc5JDatsVC.jpg",
               "id": 1265256,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Chris",
               "gender": 0,
               "credit_id": "5326dfb5c3a368572500b5b3",
               "name": "Josh Myers",
               "profile_path": "/5BD8lkmIJuZ4TOc5k34GgOzNr1j.jpg",
               "id": 1109987,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Major Pritchard",
               "gender": 0,
               "credit_id": "5326dfecc3a36813c2003fe3",
               "name": "Ian Pirie",
               "profile_path": "/wBQsI3PN3r0cDri8gt3z12kQgoY.jpg",
               "id": 95716,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "5326e07cc3a3682378004445",
               "name": "Tom Hughes",
               "profile_path": "/ct7dnN3uC326B8u3wUM8zDzFBsK.jpg",
               "id": 116264,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Stella",
               "gender": 1,
               "credit_id": "5326e0b5c3a36824af003c94",
               "name": "Miranda Raison",
               "profile_path": "/ivoSaVI3AlsARiSnVc5EHsoPrLC.jpg",
               "id": 195525,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Dawn",
               "gender": 0,
               "credit_id": "5326e151c3a36813c2003fff",
               "name": "Alex Reid",
               "profile_path": "/webuIy1AmYtHVoundonE3eTNw3d.jpg",
               "id": 57576,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "JJ",
               "gender": 2,
               "credit_id": "5326e185c3a36841330044b7",
               "name": "George Russo",
               "profile_path": "/5lzHutdnevjw0HnFcareQgpyGw6.jpg",
               "id": 177240,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Marco",
               "gender": 2,
               "credit_id": "551d17669251416a33002555",
               "name": "Joe Egan",
               "profile_path": "/vyYAT3aKodiJqsEscmHgW9i7TA1.jpg",
               "id": 1000873,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5326dd0dc3a36823780043fe",
               "name": "Ronnie Thompson",
               "profile_path": null,
               "id": 1088094,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5326dd1dc3a36824b500a900",
               "name": "Ronnie Thompson",
               "profile_path": null,
               "id": 1088094,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5326dd6bc3a36824af003c54",
               "name": "Nicola Pearcey",
               "profile_path": null,
               "id": 1301632,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5326ddc5c3a36813c2003f98",
               "name": "Paul Arnold",
               "profile_path": null,
               "id": 1301634,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5326dde4c3a36813c2003f9e",
               "name": "Andrew Barnabas",
               "profile_path": null,
               "id": 1301635,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5326de07c3a3683f040040f5",
               "name": "Heidi McQueen-Prentice",
               "profile_path": null,
               "id": 1301636,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5326de54c3a3683f04004102",
               "name": "James Harris",
               "profile_path": null,
               "id": 239663,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5379b440c3a368552c0054ee",
               "name": "Tim Sidell",
               "profile_path": null,
               "id": 1134084,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5450af220e0a263a10003e57",
               "name": "Colin Jones",
               "profile_path": null,
               "id": 238120,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 5.71838,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 259453,
      "vote_count": 32,
      "budget": 0,
      "overview": "I Am Soldier follows Mickey Tomlinson (Tom Hughes), a military chef, who attempts the most dangerous military selection known to man: The Special Air Service (S.A.S.) selection. The S.A.S. Is the United Kingdom's most renowned Special Forces Regiment, tasked with life threatening missions in some of the most dangerous places on the planet. Mickey has more military experience than simply being a chef, something he doesn't let on to the other candidates... Mickey is smashed by this selection process - his mind, body and soul scream for mercy as he endures torturous speed-marches over the steepest mountains, running for his life during 'Escape and Evasion' and then facing the most evil interrogation possible, during the deadly phase known as: 'Tactical Questioning.' Even after everything, there is still only one way you can really prove yourself: in combat... Many try to get into the S.A.S. Only the elite make it.",
      "similar": [
         389374,
         389378,
         59065
      ],
      "original_title": "I Am Soldier",
      "runtime": 84,
      "poster_path": "/3HSBdnfOOcKWv1fwgM4f0bDHGW3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tea Shop & Film Company",
         "id": 13161,
         "origin_country": ""
      }],
      "release_date": "2014-03-17",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ronnie Thompson"],
      "runtime": 84,
      "synopsis": "A soldier is being tortured by English speaking who demand details of his unit and mission. Mickey (Tom Hughes) and JJ (George Russo) meet and ride a train to Llandovery, Wales. The landscape is bleak and snowy. An attractive woman gives them directions, they get off at a small town and walk half a mile to the camp gates. JJ says his dad was in the SAS. They find out the directions were bad and have to call a cab, they are miles from their destination. The two go to a nearby pub. The woman is there and Mickey introduces himself. Things get tense and quiet, Mickey decides to leave with JJ. The next day (and everyday) at 4:30 they awaken and start training, there are five groups of 40 candidates, the subtitles show they only have two chances to make it. The folks from the pub are the SAS directing staff. Staff Sgt Carter (Noel Clarke) tells them it will be tough and starts them off running a road up into the hills. Mickey reveals he is currently an army cook, the others laugh at him. Then they start running/walking with heavy packs, Sgt Carter tells they are building strength and stamina. The numbers whittle down. They learn hand to hand combat. Carter shows how easy it is to evade a larger man and the woman from the train and pub, Capt. Dawn Canterbury, (Alex Reid), easily puts down a large candidate Chris (Josh Meyers). She says their technique is the best close combat fighting method in the world. They shoot guns, climb trees and practice fighting. Mickey uses a boxing stance and KOs a large fellow trainee, Canterbury notices and smiles. Capt Canterbury sees him leaving the shower and is friendly. An important test is a 40 mile hike with 55 lb packs and rifles in 18 hours, with 2 rendez-vous points. Mickey, JJ and Chris set off. They make the first RV in time, the DI sends them to the next. Very tired they struggle to make the second. Now the third leg, the three help each other and make it with a second to spare. Mickey has flashbacks and nightmares about an airborne parachuting incident. JJ notices and tries to find out what is happening. At night slavic voices discuss explosives over a bright city skyline. Carter now says the final test, the escape and evasion will happen, they will be let out with only an old WW2 overcoat, not to go near buildings, roads or paths or else they will be ``binned``. Mickey and JJ pair up and head off. They set a fire and camp for the night, eating a rabbit. Mickey admits his nightmares are from when he was in the `Paras`. An accident killed a man he tried to save, he stopped jumping and remustered as a cook,now he wants to make ``the SASs`` as they are the best. Later they are caught, Mickey is hung up by his wrists in a warehouse. He is questioned by an attractive blonde (Miranda Raison) who asks him to sign a sheet. He refuses and she insults him and his mother. He is stripped and ridiculed by the woman. Mickey is strung up again. Tired, blindfolded, his captors make loud noises to keep him awake. A long drawn out period with further questioning as the captors try to break his will, Mickey continues to refuse to answer questions, even though faced with dire threats and verbal abuse. Finally he is taken outside, Carter is waiting with a rifle, and...tells him he has passed. More training, a Chinook helicopter carries a squad. They have to jump and land within 10 metres of a target. Mickey freezes at the door until Carter pushed him out. JJ lands and takes off his pack, Mickey lands shortly after, happy. Capt Canterbury gives him a smile and encouraging words on their return to barracks. Less than 10% pass the selection. The men wait nervously, Chris is interviewed first and departs, washed out. Mickey is called in and a Major Pritchard gives him a lecture, then gives him a tan beret. Mickey accepts and the Major says well done. Mickey and JJ gaze at a clock tower, a symbol for the regiment with the names of those killed in action. Then they go to the same pub where the cheerful DS buy them drinks and welcome them to the club. Sgt Carter tells Mickey he was one of the best recruits to come through, and says he has been selected to his squad. Mickey still has a 12 month probation period. Later, Capt Canterbury comes to his room in a blouse and jeans and her hair down, she takes off her shoes and they kiss, start to undress and move to the bed. Her phone rings, she replies in a slavic language, dresses and leaves with a kiss. Then Mickey`s phone rings and Carter is summoning him for 2100 hrs. They are briefed by MI5 about a group of Bosnians and explosives, radioactive material. The SAS Major lays out the plan, the squad is dressed in black uniforms and move out. They enter an industrial complex. Taking out guards they enter and start a firefight with the Bosnians. Canterbury is there in jeans and being beaten up, she gets the upper hand and shoots her assailant, then joins Carter. The squad looks for WMD. One SAS is shot as they push the enemy across the warehouse. JJ sees a enemy attacking their rear, he tackles the man but is killed by a suicide bomb. Carter takes Mickey with only 9mm automatics to enter an office area, both are attacked by large men. The leader, Petrovic has a bomb and runs away followed by Mickey. Carter struggles with his man but eventually subdues the bear-like Bosnian. In the yard Mickey fights hand to hand with Petrovic, knocks him out and secures the bomb. Freeze frame!",
      "writers": ["Ronnie Thompson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2717318/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTY4NzcyMTkyNl5BMl5BanBnXkFtZTgwODI0ODQ3MTE@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Tom Hughes",
         "Noel Clarke",
         "Alex Reid"
      ],
      "reviews": [
         "I didn't expect much but for some unknown reason wanted to give it a go after reading a handful of positive reviews. The movie starts out OK, with a pretty decent depiction of the SAS selection, some even shot on location in Hereford but then \"Mickey\" receive his beret and its all downhill from there (about last 10 minutes of the movie). Skipping years of following jungle training, arctic training etc he is thrown straight into action when Carters team is ordered to take down a terrorist cell, complete with some hand-held nuke/dirty bomb gizmo... The assault is so unprofessional and uninterestingly filmed that I first thought it must be some kind of training but no. I was left with a feeling of \"What just happened?\" It was like somebody had throw in some action shot by some high-school-YouTube-home-movie-makers at the end after the filming had ended and it made it through the distribution process without anyone noticing.",
         "You know, there are at least 15-20 million of people in Europe that know how Serbian sounds like. Why insult them with pathetic attempts of non-native speakers trying to wrap their mouths around it in such a terrible manner that not even native Serbian could understand what a hell they're trying to say? It's unacceptable with today's technology. You could have found local Serbian teens, pay them a hamburger to dub those parts. This way it only amounts to super low production. Otherwise I can't say I didn't find some fun in the movie, even acting is not so bad as other reviews might make you think. If it only wasn't for those joke parts in which (supposedly native?) Serbian woman butchers the language to unspeakable extent...",
         "Very low budget film. If you liked ultimate force then you will probably like this too. As soon as i seen Alex Reid in the story line i instantly thought ultimate force. I initially thought it was going to be a documentary type of film. How wrong. It only contains a few facts about the SAS and its selection. This film could have been a lot better. It should have been a lot more factual that it actually appears. Never mind. Hopefully there won't be a 2nd making of it. However if there is then hopefully they spend a little more money.",
         "Although here and there it surely reminds of other movies and although some footage leans towards TV quality, this film is essentially nice. It's the story of an initiation and even if you never fancied of enrolling yourself in an elite corp you can't help but empathizing with the young man nicely depicted by writer/director Ronnie Thompson and nicely played by Tom Hughes. You won't truly believe the story and in the end you won't be left with any moral lesson, have learned something new or deepened any knowledge you already had. The girl (beautiful actress Alex Reid) however is attractive, Noel Clarke plays a catching Staff Sergeant Carter and if your expectations are not excessively high you'll feel nicely entertained.",
         "I feel the other reviews for this film to be somewhat unfair, yes it'll never win any Oscars nor will it go down as an epic, I feel it certainly provides a fair amount of realism with regard to the selection process, being a former squaddie and in my early years having gone through the same selection process and failed miserably, I feel I can comment from first hand. All I can say is from a personal experience the film certainly portrays a realistic and brutal experience. Watching this film brought back some terrible memories that I would rather forget. If any squaddies currently serving is looking to do this selection course, trust me watch this film, well at least watch the first three quarters and it will give you a taster as to what to expect. It is a low budget film, pretty poor acting and the end mission a complete let down and unprofessional acting, but nevertheless overall entertaining, therefore 6 stars.",
         "I feel that most of these reviews are unfair, and would point to the only soldier posting one who said it was a decent portrayal of the process. Perhaps they didn't follow the plot, judging from another getting upset that the protagonist was a cook, since we find out his full story later on, which explains that. I also wonder if it upset people because it doesn't follow the normal clichés of who the strong are, those unstated truisms that have been created in military movies made in the US. It is true that the hero is not some muscle-bound superhero, so what? It's not about fighting powerfully, it's about fighting smart. I thoroughly enjoyed this film, for a non-soldier it felt realistic in a way most military films don't to me. It isn't pretty - but it shouldn't be. The acting is good - what others are talking about I don't know, I may not know many soldiers, but I was brought up in theatres and I know acting - we're not talking awards here, but it's solid work. The script is passable, there are some plot devices that could have been left out - it is by no means a perfect film, but well worth the watch.",
         "It looks like the writer has watched a few documentaries on the SAS and then copy and pasted from some of Andy McNab's books, and still got it all wrong! I was surprised to see Miranda Raison in such a third rate effort, she should be able to do better. Some half decent acting from other members of the cast but unfortunately it couldn't compensate from the truly awful script and poor continuity. Anyone that has been to Wales knows not to expect bright sunshine in the morning during the winter, it's a rare enough occurrence in the summer! I had to watch it all the way through just to see if the end was as bad as the beginning, and I was not disappointed! More like Ultimate Force/Farce.",
         "Whoever wrote this crap is either delusional or really sucks at writing propaganda movies. Movie is basically about SAS recruitment process, except everything was left out but the torture porn part making it look like SAS just enjoy sexually abusing and torturing all potential recruits. As I never joined SAS I have no idea if they in fact are that demented and weird, but even if they are I doubt they would really want to publicly represent themselves in such manner. So, after being tortured and being extremely happy about it, protagonist participates on some raid against Bosnian Muslim extremists and performs better than Rambo. He is about 5 feet tall, guys he is fighting are about 7 feet tall and 400 pounds of pure muscle. He gets hit, just shakes it off, he slaps those brutes, they keel over like he shot them with a shotgun. Bloody ridiculous. Too badly choreographed to even begin to be entertaining.",
         "Is 'I am soldier' a film about the harsh training one has to go through to become an elite SAS soldier? No, the film fails in this regard. Although we do get to see the candidates go through the infamous SAS marches carrying various weights of bergen, the brutality of this process is not communicated well or even at all. (Remember men have died doing this). Where is the 4 week jungle course, the swimming and running tests, arms training etc? No, this is not a film about the SAS selection process Is it a film about our protagonist overcoming his fear of parachuting? No, although the numerous flashbacks and his story of a comrade dying during a parachute jump would have you think otherwise. How does he get over this fear? He doesn't, his instructor pushes him out of the helicopter and all is hunky-dory, smiles and a pat on the back. What 'I am soldier' is really about is how pretty-boy Tom Hughes manages to keep his perfectly coiffured hair intact throughout this 'grueling' training process whilst at the same time trying to pull a 'bird'. I spent most of the film wondering what product he uses. All in all the film is not about anything much and is extremely vague in its direction and lacks closure in some plot elements. The sub-par acting by our leading man and much of the cast feels forced and lacks conviction, one exception being Ian Pirie as brief his appearance is.",
         "Better than a lot of other war movies out there, when everyone is diving into bullets and everyone seems invisible. The fight looks believable, the only issue for me was the plot, that could have done with some more work. The romance was a bit unbelievable and didn't really seem to blend in well with the plot. The leading two characters were good but seem of the other young actors probably needed some work. I thought the final parts of the movie was a bit rushed but don't want to give too much away. Overall, worth watching and although I did find it a little slow, nice look at what its like in the sas.",
         "Question: Is there any way to watch a movie these days without some kind of Jewish propaganda splattered all over it? Movie Quote: \"Krav Magra is the single best unarmed combat fighting technique in the history of the world ... and that's what we (I..e. SAS) use\" LOL ... or some-such nonsense. Whatever the exact quote, I think puked in my mouth a little. Apparently, the finely tuned Israeli fighting art of \"Flailing While Running Away\" is now the SAS' exclusive fighting system. It's like the entire movie industry's 'needle' is permanently stuck on the almost cartoonish fiction of \"The Inglorious Bastards\" ... FOREVER. Anyway, that laughable quote (above) ... immediately followed the equally laughable scene ... during a SAS training session ... where a 110 lbs scrawny-looking woman (an female SAS instructor? OKaaay then)... punched senseless ... a 245 lbs (presumably) well-trained and thickly muscled young man ... and then submits him ... in under 15 seconds flat. It is exactly at this point in the movie, as I was smoking my Cuban cigar ... and surfing the Heckler & Koch website ... when I realized what kind of ride I'm in for (if I dared finish this farce on the British SAS). Well, I dared ... And I was right. Suffice to say it was all downhill from there on. Ronnie Thompson should seriously consider a new vocation.",
         "I really wanted to love this. Not because I'm that much of a fan of 'war movies' in general, but I just liked the premise, i.e. seeing what it takes to be part of the S.A.S. (something that I would never be able to do myself, due to being too addicted to comfy sofas, Playstation and takeaway pizza – apparently the world's toughest soldiers aren't allowed any of these during missions). The story follows two recruits (each with their own personal demons) as they go on an S.A.S. training mission in the British wilderness to see if they have what it takes. I won't tell you if they succeed or not, only that I wouldn't have made it for five minutes. Noel Clarke (Kidulthood) is one of their various 'drill sergeant-type figures' who is there to mentor them as they go and he does his best to lift the film out of mediocrity. He's about the only star you may really recognise. And, perhaps that's one of the film's main faults: it screams 'cheapness' at all times. It has no real big name actors and the dialogue and acting talent on show isn't exactly top drawer. However, its bleakness does add a level of realism to the film that gives you quite an overall gritty tone. I've read comments online about how there are blatant errors in the story. These seem to all come from people who have actually served in the military and can spot when a British soldier gives an American salute (I didn't even know there were two different types!). But, from my completely nonexistent military background, no 'factual errors' were apparent. If I had to guess I'd say this was a reasonable portrayal as to how tough recruits have it. I rolled my eyes more when our two recruits encounter an attractive woman on the train, only for her to 'coincidently' show up a few scenes later. It's not perfect and definitely isn't for everybody. But if you're in the mood for something gritty and brutal, plus you like soldier movies in general, give it a go. It's not the longest of films, so you won't feel like you've invested too much of your life in it anyway. http://thewrongtreemoviereviews.blogspot.co.uk/",
         "this is farcical, slow and boring and shows nothing of the SAS selection or what the men have to go through and endure. And as above the idea of a girl meets boy in the selections? and the idea that she is some sort of spy as well?? no way! I Have seen better short movies from users on you tube acting is OK, just.I have seen worse from a grade Hollywood actors though! if you want a real idea of what the selections are like find the below \"The search for Warriors\"a 2 part documentary by the SBS on Aus SAS selections",
         "I agree there were many (IMHO) unfair reviews of this movie. I agree this one wasn't destined for Oscars, but it was better than many of the reviews it got here. What I saw was a look at a couple guys trying out for the SAS. The selection process was not an in-depth look at how recruiting and training for this elite regiment is carried out, but I don't think that is the effect being sought after. Notes were given as the number of cadets was whittled down, and after the cut was made, a brief look at a single mission was given. I did think the ending left a LOT to be desired! There were holes left, questions unanswered, and a general feeling of WTF?? left in my mind, which reduces my overall number of stars. However, this was an interesting and otherwise reasonably well-done movie and I was not left with the feeling of 'there's 90 minutes of my life I'll never get back'. If you're expecting Rambo, or Full Metal Jacket, keep looking, this isn't it... but it also is no Lair of the White Worm (my go-to total turkey movie I use to compare a complete unpolished turd). It is worthy of a look, although probably not an addition to a DVD collection.",
         "This film is awful. Way to much \"pensive\" acting. Noel in particular is just acting as Noel always does. Attitude. I assume that aptitude comes into play in UKSF training/selection? The film is believable for about 8 minutes. The end is simply ridiculous.Hilarious. Reminded me of the Rock n Rolla Russian gangsters part. And look how they operate at the final scene, I'm no soldier ,never have been, but they don't look the part. Very poor.",
         "Before I even went near this movie I read all the reviews and saw the rating so I started off with very low expectations, because the reviewers on IMBT are never wrong, right? LOL what a joke. This turned out to be quite an enjoyable movie, nothing special, but not too shabby either. Most of the cast put in a good effort and it was good to see all the familiar faces (UK TV fan here). While the some of the fighting near the end could have been done with improved choreography, for me it didn't really detract from the overall movie. If you are going to see this don't expect too much, if you are looking for an over the top Hollywood blockbuster, give it a miss, you will be disappointed. If you are looking for a semi realistic 90 minutes of entertainment watch it. Overlook the rating, this is better than a 4/10 movie. I gave it a 10 to counteract all the undeserving 1s. It deserves at least a 6/10.",
         "the movie its self was alright. When watching it the actors played their characters well but to the best their characters would let them. When watching the movie i assumed that you would only be watching really important parts of the training. Not for the most of the movie. Once that was finally over he started to get with this girl who he tried to buy a drink for but failed. Then to round off the movie with a very rushed fight scene at the end? especially with a kick to the head to finish the final fight? left me thinking was that actually worth my time watching? Yes i have lots of respect for the armed forces but don't believe this film did any justice to them. would of been a 4/10 but for the even worse CGI it has to be a 3/10",
         "Well what more can I say about this movie that hasn't been said in other reviews already. I have not read Ronnie Thompsoms book so I don't know how this compares to the original story. What I can tell you is that this low budget movie was dreadful. Im not really sure where to start. There clearly wasn't enough research done on the SAS for starters. Considering this movie was predominantly about the SAS selection process, the scenes shot for the first three quarters of the film were unrealistic.The training teams behaviour attitude and professionalism was laughable and unbelievable. The hills phase was not portrayed well, and neither was the Escape and Evasion. The Jungle Phase, missed out completely and the jumps phase.....please! The acting, although OK wasn't the best, I've seen. as previously mentioned by others a little more time with an acting coach might have made the Bosnian terrorists a bit more believable.Ultimately I guess the actors were just trying to make the best of the awful script. The characters felt hollow and unfinished and I never really connected with any of them. By the end of the film I didn't really care if Mickey, the lead character made it through or not Kit and equipment used was either wrong or being used incorrectly and the weapon handling throughout, in particular the last 20 minutes of the film was, to be frank....embarrassing. The final assault would probably in reality left the entire team dead and a dirty bomb on the streets of London. This movie did absolutely nothing to show the true professionalism of the most elite soldiers in the world. In the days of low budget movies, there is no excuse for turning out rubbish like this, particularly when you look at other British made low budget military movies recently made. Where I am Soldier gets everything wrong, the recent movie - Kajaki hits the nail on the head throughout. Don't waste your time watching this, its time you'll never get back, Go watch Kajaki instead and see how movies like this 'should' be made",
         "What a load of tosh, if your going to make a film about the most famous regiment in the world then at least do it some justice. I think the budget for this film was spent on the round of drinks in the bar of one of the scenes. Then the hero of the story has mental issues, would he really make the grade? SAS soldiers are not super human but they have the mental strength to endure where most of us mortals would have given up thats what separates the successful candidates. Our hero makes the grade and 3 months on goes on his first mission, what? wheres all the weapon/survival/combat training, I think in real life he wouldn't leave Hereford for a while. Then we come to doing the mission, again no expense spared here? and appears hurried to get the film finished, if you were hoping to see some SAS tactics used, you will be sorely disappointed. If you want to watch a film about the SAS, although now long in the tooth you could do worse (as in this film) and watch \"Who Dares Wins\". I noticed Mr Richard Kemp was one of the military advisor's, what did he advise the director on? the colour of the combat uniform? with Mr Kemps background you would of thought the film to have a bit more authenticity.",
         "The storyline does not even make sense somehow he was a chef before but then it shows flashbacks of him throwing himself in a parachute obviously in battle.Most of the movie is just watching the main characters trained and trained it gets pretty repetitive.The resolution is pretty bad even some indie movies have better resolution than this.They should at least made a ceremonial for his diseased friend but instead they have more facts at the end.Its up to you if you want to watch this movie ,I know this sounds critical. But at the end of the movie you get this feeling of disappointment that leaves you with many questions about develop ideas during the movie that did not get resolved at the end.",
         "I never heard about this movie before I watched it, and quite frankly, I wasn't expecting I would sit through the whole thing. But I actually came to like it. Having seen many special forces selection documentaries, I liked how this focused on just one main character, instead of some random soldiers, whom we never get to learn about, as in the documentaries. As for realism, I found the selection training to be quite realistic. That is, it seems to fit very well with all the documentaries, but who really knows 'till you been there yourself? As for the lone action scene in the movie, I found it a bit lacking. It could have been a lot worse though. It's a low budget movie, but they generally used what they had well. An alright movie, just one thing majorly annoyed me: There is SO much use of \"black screen\". Sometimes with sound, other times with nothing. At times I felt like 20% of the movie showed a black screen.",
         "Don't listen to the negatives about this film,if you want a good early evening watch then this is just the job. OK there are a few holes in the plot but hey that goes for most films innit tho. The acting is perfectly acceptable and the phases of training are not over done or over long. You can see the ending coming a mile off but it wont spoil the film. Clichés and stereotypes apart this is an easy watch so just grab a beer and some pork scratchings and sit back and enjoy it for what it is a solid little film not trying to overplay anything just trying to entertain you,and it did me.Some people always look for films to be more than they are instead of just watching them for fun.",
         "After sitting in films like \"The Elite Squad\", this film represents the current training that many teams of Special Operations have to overcome. Are these physical and psychological exercises that originated hundreds of books with PsyOps nomenclature. Brave soldiers, in order to be part of Team Intervention Against War and Terrorism, which are part of our current days. A coming UK history, begins with hundreds of candidates that only the strongest can overcome. It is a film that focuses on the main requirement that is essential for extreme operations, the ELITE.",
         "The conclusion of this movie, the Israeli force are the world best, the Islam are the terrorist, and the S.A.S are the elite fighters. Poor story-line, poor picture, and a very lousy end. Fight scenes are very ridiculous, and have now idea why it's rated as 18 This movie should be called \"I am stupid\"",
         "Movies that are this bad, unintentionally, are a joke. The notion that this guy is 'one of the best trainees ever to pass the tests' after he's freaked out in isolation, balked at jumping out of an airplane - he's an abject failure and categorical candidate for dismissal. He removes his helmet in a combat zone to hold a dying friend in his arms. He's an emotional train wreck. Acting is poor and the storyline disjunct, predictable bizarre nonsense. Insanely mediocre heavily ADR'd fight scenes. The SAS likely is ashamed The 'love story' angle is insanely stupid and a cliché which producers likely thought would add a bizarre nuance to this steaming mound. The ending happens with zero denouement or conclusion. Time is money. Don't waste yours."
      ],
      "genres": [
         "Action",
         "Thriller",
         "War"
      ],
      "productionCompanies": ["Tea Shop & Film Company"],
      "summaries": ["I Am Soldier follows Mickey Tomlinson (Tom Hughes), a military chef, who attempts the most dangerous military selection known to man: The Special Air Service (S.A.S.) selection. The S.A.S. Is the United Kingdom's most renowned Special Forces Regiment, tasked with life threatening missions in some of the most dangerous places on the planet. Mickey has more military experience than simply being a chef, something he doesn't let on to the other candidates... Mickey is smashed by this selection process - his mind, body and soul scream for mercy as he endures torturous speed-marches over the steepest mountains, running for his life during 'Escape and Evasion' and then facing the most evil interrogation possible, during the deadly phase known as: 'Tactical Questioning.' Even after everything, there is still only one way you can really prove yourself: in combat... Many try to get into the S.A.S. Only the elite make it."],
      "budget": 0
   },
   "movielensId": 132338,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-03-17",
      "dvdReleaseDate": null,
      "directors": ["Ronnie Thompson"],
      "runtime": 84,
      "movieId": 132338,
      "title": "I Am Soldier",
      "mpaa": null,
      "actors": [
         "Noel Clarke",
         "Philip Desmeules",
         "Duncan Casey",
         "Lee Charles",
         "Jordan Long",
         "Allistair McNab",
         "Josh Myers",
         "Ian Pirie",
         "Tom Hughes",
         "Miranda Raison",
         "Alex Reid",
         "George Russo",
         "Joe Egan"
      ],
      "imdbMovieId": "2717318",
      "originalTitle": "I Am Soldier",
      "genres": [
         "Action",
         "Thriller",
         "War"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "I Am Soldier follows Mickey Tomlinson (Tom Hughes), a military chef, who attempts the most dangerous military selection known to man: The Special Air Service (S.A.S.) selection. The S.A.S. Is the United Kingdom's most renowned Special Forces Regiment, tasked with life threatening missions in some of the most dangerous places on the planet. Mickey has more military experience than simply being a chef, something he doesn't let on to the other candidates... Mickey is smashed by this selection process - his mind, body and soul scream for mercy as he endures torturous speed-marches over the steepest mountains, running for his life during 'Escape and Evasion' and then facing the most evil interrogation possible, during the deadly phase known as: 'Tactical Questioning.' Even after everything, there is still only one way you can really prove yourself: in combat... Many try to get into the S.A.S. Only the elite make it.",
      "tmdbMovieId": 259453,
      "avgRating": 3.33333,
      "releaseYear": "2014",
      "numRatings": 3,
      "posterPath": "/3HSBdnfOOcKWv1fwgM4f0bDHGW3.jpg"
   }
}