{
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 160,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1197580/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTgzOTI4Mjg5Ml5BMl5BanBnXkFtZTcwMjM5MzI4Nw@@._V1_UY268_CR13,0,182,268_AL_.jpg",
      "actors": [
         "Joseph Antaki",
         "Christopher Backus",
         "Danny Blanco Hall"
      ],
      "reviews": [
         "Especially the part about Turkey because I am Turkish. Bodrum was shot like some town from the 3rd world, without even knowing the fact that every single person in Bodrum can speak English and I have never ever seen Bodrum like in the film! Bodrum is just more like Santorini,or a calmer Ibiza but definitely not whats like in the film! And moreover has even its own international airport,a museum of underwater archeology, and a lovely Castle of The Knights of St.John. Some Americans really like to show Turkey like a 3rd. world country -which is not- and if its like that,how on hell I know English! God this is sooo ridiculous!!! And all of a sudden she starts to speak in Turkish,which is very hard to understand what she says even for herself! It has almost nothing the same with the novel, I can understand that the producers did their best to keep it brief but, anyway,though I am quite keen on the history of Templar's, I was not expecting to watch such a mess! Sorry guys but this is nonsense!",
         "This groaner ran in Canada a week earlier than NBC and I don't feel privileged because of it. The production, directing and acting are strictly amateurish. It was produced by Global TV in Canada and it reflects the poor economy and tight budgets likely shadowing the production. Even the \"middle-ages\" boating flashbacks look like they were filmed in a bathtub. Mira Sorvino's character is unrealistically like a female Indy Jones, jousting from the back of a mounted-policeman's steed, overpowering 3 hoods and performing various other unlikely feats of daring-do. It's devoid of mystery, drama or intrigue and too reminiscent of most dull network movies of the past decade.",
         "The writing is a bit amateurish. Several scenes were just hard to accept. The opening scene ends with Mira Sorvino (in heels and mini skirt) jousting in Central Park to stop a medieval knight turned thief. In another scene Sorvino's character goes from old church tunnel to popping out of a manhole cover in mid Manhattan. The romance was clumsy and the ending unsatisfyingly predictable and sappy. Sorvino's acting was fine given the poor script she was burdened with. She is very believable as a smart academician who knows more than most about ancient artifacts. But the romantic relationship was just awkward and uninspiring. It looked like it came from a script a 15 year old boy wrote.",
         "This movie is so fantastically bad I couldn't tear myself away from it. The editing, continuity and logistical errors alone make for a great drinking game. The mocking opportunities are endless. The production value is just plain bad. And the actors display their discomfort at delivering terrible lines at every turn. It's one of those rare instances when the movie is so terrible, it's truly entertaining. I have not read the book it's based on, but since it was a huge best seller, I'm guessing they've taken some liberties. I'm now very curious to read the book.",
         "I read this novel less than a year ago and thought that the writing was on par with the DaVinci code by Dan Brown. I was very disappointed with the TV adaptation of this novel and felt that there was a lack of the menace that was portrayed in the book. I also felt that the kitschy score really was part of the problem. It didn't have the feel of a major conspiracy that the author of the novel had done a very good job of conveying. Raymond Khoury has to be disappointed with this film. Not to mention the waste of the talent in it. Overall, the writing was stiff, the action was condensed and not well explained. The level of intrigue surrounding the Church's involvement really made it seem that the writers were afraid of offending anyone in the catholic church, or anyone who is catholic. Unfortunately the premise of what the book was about centers on a religious cover up much like the DaVinci code did.",
         "I am being generous giving this thing a \"5\" but the desert scenes were interesting and I liked the decoder gizmo. The first 10 minutes of this thing were the most ludicrous I have ever seen. After gaping in disbelief I started laughing, then decided to continue watching and see what else they would do, how bad it could get. Eventually I decided that maybe Mira Sorvino's character could have ridden a horse, carrying a golden staff, and \"jousted\" a 250 lb man in armor off his horse. Mira is a big girl, about 5'10\" tall, not skinny, and she looked all through this thing like she never wore makeup and couldn't care less how she looked - she looked terrible, actually. Ther are clues later on that she has had martial arts training, and she pulls quite a few other stunts that suggest one would not want to meet her in a dark alley. So much for the joke. The crime: the people in this thing do all kinds of things that they shouldn't do, giving archaeology a bad name. I will mention only one. No archaeologist would ever open a flask that had been sealed for 700 years, pull out the scroll she knows is in it, and unroll it, all while sitting on the beach just after finding the flask in a place where she has good reason to believe it had been hidden for 700 years. She could have done irreparable damage to it; it could have crumbled in her fingers. OK, one more. Uncover a buried city, that has not seen the light of day for who knows how long? jump into an underground chamber in it and start crawling around, with your only partner? No way. They could have both been overcome by fumes immediately, and suffocated due to lack of oxygen. A few more questionable things - the Templars were destroyed by the king of France because he wanted their wealth. Simple as that. He spread all kinds of propaganda about them, justifying his actions, but it was mostly BS. The Church only went along with him, mostly because the pope at the time was a stooge of the French king.",
         "Have traveled extensively Turkey and studied the Crusaders, Arab and Ottoman history. The Ottoman empire did not control Southeast Turkey until mid to late 1300's. Templars in book/movie leave Holyland in 1291, when the Mamelukes besiege Acre. They shipwreck in what is now southern Turkey. The area at this time was nominally under the controlled of the Seljuk Turks. The Small Castle and church, Fonsalis, they find is located in a valley, in the shadow of a volcano. The nearest Volcanoes are located hundreds of miles from the coast on the Anatolian Plateau or on the Kulas Field. Did the Author even read any history of the region and look at geography?",
         "I don't know where to start... the first 2 parts have been a serious disappointment and I almost shudder at having to sit through another 2 horrendous parts to finish the story. The first 10 minutes should have been a sign to simply turn it off. When I saw Mira Sorvino's character inexplicably take a large walking stick and jump on a horse to go after bad guys and then joust him with it, I should've known it was another one of NBC's horrible attempt to create worthwhile programming. I couldn't stop laughing at how ridiculous it was. The even tried to go as far as comparing her to Indiana Jones as a joke... what an insult to Indy... The dialogue sounds like it was written by a 2nd grader, and the acting is worse than a high school play... Stop wasting our time with this crap, NBC... maybe you wouldn't have to keep pumping this stupid stuff out if you didn't cancel good shows like Journeyman or My Own Worst Enemy. All you have left is Heroes, and that can't compete with 24 or House... NBC's golden years died with the ending of Friends and Seinfeld. Don't bother to watch it for anything other than the news.",
         "I enjoyed reading Raymond Khoury's novel, except for the ending, which always felt to me like it was added by an insistent editor. The film version is a major disappointment, for all of the reasons I have read in user comments here and more, including ludicrous dialog, totally inane jumps in logic (digging in the middle of the desert and just immediately finding a buried city), finding the long lost sunken ship in the middle of a horrible storm, and on and on. But the most offensive deviation from the novel was the part about the Templars having just \"invented\" the Gospel of Jesus, rather than discovering it in the rubble underneath the Temple in Jerusalem -- and then also turning the character of the older male archaeologist who had been seeking the truth of the Templars into a raving lunatic determined to bring down Christianity. This is the same kind of argument I have found over the years from people who insist that one cannot believe both in God and Evolution --- e.g. that it was not possible for God or a creative force to have created the evolutionary process. Here, the theology is somehow that the transforming message of Jesus is somehow totally irrelevant if one does not believe that Jesus was God, which I find offensive. This was and is the great debate that was central to the struggles in early Christianity between the followers of Peter and the Gnostics, the outcome of which was what determined what gospels made it into the New Testament and which gospels were banned (some of which were discovered in the desert in 1945 or so at Nag Hammadi).",
         "The story line isn't so bad, but just about everything else in this TV flick is. Uninspired acting, stereotypical characters and sophomoric writing all wrapped up in a series of trite clichés. You also get mediocre sound and lighting plus capricious editing at no extra charge along with memorable lines like, \"I don't know what to believe anymore\" and \"Mom, you've always told me to follow my dreams\". The main characters, Mira Sorvino and Scott Foley, which you expect to develop some sexual tension never really connect. The dialog between them seem to be mostly flippant one liners and stock \"detective speak\" plucked from rejected episodes of CSI. You wonder why some of the other characters, like Anthony Lemke are even part of the story. They just seem extraneous. The promos lured me in and I suffered through the first night, but will skip the finale.",
         "Treasure of the Knights Templar, codes, Catholic Church. Combine, switch out Nick Cage/Tom Hanks for Mira Sorvino, make her a single mother and blend until utterly bland. They make an Indiana Jones crack early on, probably to distract you from the obvious ripoffs of National Treasure. A shame, because I like Mira Sorvino (she does looks great in this movie and half the shots are of her legs or derrière, also to distract you), Scott Foley and Victor Garber. If the writers had half the ability of one of these three actors it would have been much better, or never even made. This one belongs on the Lifetime Movie Channel, not NBC. Three stars out of ten",
         "I read the book and was excited at the prospect of a movie. Within the first 10 minutes I was rolling my eyes. My kids (who had not read the book) were trying to follow it out and couldn't because too many things made little or no sense. Her mother & daughter were written out of the museum gathering, I suppose to allow her to go galloping after the horsemen. If you read the book, you'll hate the movie. The book is completely butchered in such a way that it is hard to make heads or tails out of the storyline. The acting is poor. The re-write on the main character makes very little sense. They went from a well written and quite believable character to an airhead who is quite concerned about her expensive designer shoes, and completely unbelievable as ever having been a field archaeologist. I would give this one a 0 out of 10 if that were a choice.",
         "Hi everyone who will watch the movie the last trampler which is one of the unreal story,even places. well there is a scene going on about Bodrum-Turkey,absolutely wrong.that place is not Bodrum or anywhere here in Turkey.Bodrum is located very western part of Anatolia where is cradle of civilization , whole area is covered with green,pine trees,oak trees,Daphne tress and more.The scene in the movie can be desert which is in 'Nevada' in America continent or desert in Arabia,Afganistan.however there is no dessert in Türkiye. American movie maker doing terrible jobs about the other part of the world.there is no country as beautiful as theirs live.so open your eyes and discover what the other countries have which America doesn't.",
         "I watched part one and set up part two to record. All through the first part, I kept thinking, it had to get better. Sadly, it did not happen. Seems this picture has been made before, and a lot better. This is some of the worst acting I have ever seen. Was the working title \"Indiana Jane and the Last Templar\"? Even the musical score was terrible. It is hard to bring to mind a movie that did more things wrong than this loser. I did not read the book, but it has to be better than the movie, or nobody would have bought it. As I said, I recorded the second part. I just do not know if I can actually bring myself to watch it. I suppose I will, just as I finish even bad books that I am reading. I have no one to blame but myself, it was a made for TV mini-series. I should have known better. I gave it a 2 because the rest of it just has to get better.",
         "Well I'm dating myself, but I found this movie to be very similar in many regards to \"The Word\" (1978) with David Janssen. In both cases the story revolves around possession of a religious scroll of disputed origin. That \"The Last Templar\" actually wrote the fake text in the past was not such a big difference. I felt myself wondering if (author) Khoury had seen that miniseries as a kid (hmmm?). If you meld that with a little \"Tales of the Gold Monkey\" or \"Relic Hunter\" then you've basically got it. I was willing to suspend disbelief for most of it, but the ending left me flat. Oopsie! Come on now! Just jump on him!!",
         "The scenes shot in \"Bodrum, Turkey\" are too far from being realistic. To start with, I can say that in Turkey people do not travel on camels, do not wear as the people we are shown in the movie do, do not make snake dance shows on the streets, do not speak a weird language that we cannot even understand whether it is Turkish, or something just made up. We saw deserts in the movie, although we were supposed to see the sea, beaches, forests. We saw one story, desert type mud-brick houses, although we were supposed to see typical white Bodrum houses with blue window frames and bougainvilleas on the walls. Producers should be ashamed of such terribly wrong information they gathered (if they ever searched for!) and the lack of quality in script, actors, scenes etc let's say everything related with the movie.",
         "if i meet the director of this film,first i ask that did he come to Bodrum,turkey.in this film Bodrum was showed as a desert in an Arab country.there are some camels in Bodrum?.Wow,i went there but i couldn't see any camels.i can send Bodrum's real pictures to the director of this film or he can find real Bodrum like writing Bodrum on Google.Every year;lots of actors and actresses come to Turkey especially Bodrum and Antalya.Are they crazy? They are not.I am a Turkish guy and i can not believe that these pictures belong to Bodrum.Secondly,in the casting of this film,why the old Turkish man is not Turkish? he is an Arab.if the creator of this film can find any camels,deserts or people who can not speak Turkish although they are Turkish(!)in Turkey,i will apologize.we can not blame all American people for this film but it hurts me and all Turkish people.PLEASE RESPECT US.we are not Iraq.we are not Syria.we are not Iran.we are not Arab countries.please come to Istanbul,Bodrum and Antalya and see the reality.thanks",
         "Overall I found this movie to be moderately entertaining. I'm not going to regain my Christian upbringing as a result, I'm certainly not going to hail this mini-series as the unopposed champion of religious conspiracy speculations, but I will say its definitely worth a watch if your not too up your own arse to just take it for what it is: a middle of the road romantic drama with some action thrown in! This is the first time I have noticed Mira Sorvino before, although she does look quite familiar. She certainly does a decent job in terms of playing her role: a ninja archaeologist with a passion for her work and the ability to take on 3 men at once in open combat and come out on top. Watch it if you have exhausted your usual avenues of viewing, it may well surprise you!",
         "We'll after trying quite hard to get past the third chapter in the book, I decided to put it down. I was pretty excited to hear about the mini-series, I thought at least I will get to know what happens in the book. But... I must say that although the plot line had many historical mistakes in it, the story all in all was entertaining, which is more than I can say about the cast of this movie. Mira Sorvino should have stayed in retirement, yes she won he Oscar, but it had to of been a miscount as she can not act. As for the rest of the cast, there were some bright moments, but they were few and far between. If you are looking for historically incorrect entertainment, and not expecting much by way of acting then check out the series, if not... I don't think you are missing anything!",
         "In New York, during the opening of the exposition of the Treasures of the Vatican for the public, four criminals posing as Templar knights break in the museum riding horses and heist the valuable artifacts. The archaeologist Dr. Tess Chaykin (Mira Sorvino) steals the horse of a policeman and chases and captures one thief with Red Cross of Constantine. The FBI Agent Sean Daley (Scott Foley) teams up with Tess that learns that the criminals' prime intention is a decoder mechanical device that can provide the location of the Templar treasure. They travel to Turkey where Tess expects to find the treasure and discover a conspiracy of the Church to keep classified information in secret to protect the Catholic Church. Yesterday I saw \"The Last Templar\" on a DVD just released in Brazil and I did not know that this is a mini-series. The DVD has 171 minutes running time; therefore the original series was edited and 69 minutes are missing. The edited film is too long and boring, without the suitable pace of an action movie, but it would be unfair to criticize this aspect since it is not the work of the director but the producer. The romantic corny conclusion is awful. I am a big fan of Mira Sorvino and the shape of this gorgeous actress is amazing and she does not look to be a forty-three year-old woman. The lame screenplay is dreadful, with ridiculous situation such as: (1) Tess cries to the thief in the heist to return the Constantine Cross that does not belong to him; (2) Tess investigates the case with several murders by herself, holding information that might have helped the official investigation, and is released by FBI; (3) The Catholic agent does not drink coffee in the Lent, but he shags a woman that he has just known; (4) The experienced archaeologist Tess drives reckless on the streets to show off to Sean; (5) A city buried by a volcano has light and only dust inside the building; (6) In a perfect storm with a huge wave, the perfect attitude is to jump overboard. There are many other silly and stupid situations that make the film a comedy, and not a suspenseful adventure. My vote is four. Title (Brazil): \"O Último Templário\" (\"The Last Templar\")",
         "If a director plan to make a film about \"anything\", the first thing he must do is, to learn about that \"anything\". A film, so called, \"about history & geography\"; a film that has nothing to do with \"history & geography\". The tourism paradise Bodrum (Turkey) is shown like Arabic deserts! The greatest artists & celebrities come & go all the time, but the director's imagination shows white as black! This is a film that must be seen to understand how a director can turn the realities into his fictions. & His fans watch it as real. See it with your own eyes : http://www.bodrum.com/ Great ignorance, great disappointment...",
         "Bodrum is the one of the most beautiful place in Turkey. Unfortunately in this movie, she was shown like desert. If anyone would like to see this beautiful city, they can follow this link: http://gezi.tatilfm.net/Upload/Resim/973056Bodrum002.jpg Bodrum is the one of the most beautiful place in Turkey. Unfortunately in this movie, she was shown like desert. If anyone would like to see this beautiful city, they can follow this link: http://gezi.tatilfm.net/Upload/Resim/973056Bodrum002.jpg Bodrum is the one of the most beautiful place in Turkey. Unfortunately in this movie, she was shown like desert. If anyone would like to see this beautiful city, they can follow this link: http://gezi.tatilfm.net/Upload/Resim/973056Bodrum002.jpg Bodrum is the one of the most beautiful place in Turkey. Unfortunately in this movie, she was shown like desert. If anyone would like to see this beautiful city, they can follow this link: http://gezi.tatilfm.net/Upload/Resim/973056Bodrum002.jpg Bodrum is the one of the most beautiful place in Turkey. Unfortunately in this movie, she was shown like desert. If anyone would like to see this beautiful city, they can follow this link: http://gezi.tatilfm.net/Upload/Resim/973056Bodrum002.jpg",
         "The place where we see in that film is not Turkey. Turkey is a modern country but in that film they show Turkey like an Arabic country. Especially Bodrum is very Faumos holiday city in Turkey. You should search on internet. You can see the differences between Bodrum in that film and real Bodrum. you can see what a beautiful country is Turkey. you cant compare Turkey with the other east countries. Turkey is a European country. thats why i don't like that film.I don't know why they show us like old county but I hope they will apologize. They should do that. Thanks.",
         "This production was worse than bad: it's literally dangerous to mental health and intellectual progress to watch it. I should first note that I haven't read even a synopsis of the book from which this allegedly derives, so my observations may or may not apply to the novel. Where this movie is concerned, I found no redeeming value at all except an opportunity to indulge my infatuation with Mira Sorvino. It was thoroughly formulaic, and even the script itself acknowledges this with wisecrack references to Indiana Jones. What is far worse, however, is the intellectual cowardice on display in the script. The famed Templars of old may have feared the heathens and heretics, but this script cowers in abject fear of the might and angry wrath of The Church. Unlike the Templars, it makes no effort whatsoever to resist the delusion and stupidity of those it fears, instead completely selling-out in exchange for... what, ratings? The Vance character is early on depicted as having atheistic values, as is Sorvino's Tess character, but Sorvino predictably \"repents\" before the end of the movie; the climactic scene in which the character Vance battles Sorvino's Tess for the supposed Gospel of Yeshua strongly paints the unrepentant atheist as a violently delusional dogmatic lunatic, who seemingly gets punished by God for his heresy. Further, it completely ignores basic history and even geology, as another reviewer has noted. I was especially angered by a particular scene in which the protagonists find a village supposedly buried by ash and a lava flow, Pompeii-like, but which conveniently has a massive underground stadium-sized cavern over what was once an open courtyard in front of the temple which happens to be their objective! This cavern even had a built-in skylight or two! There isn't a known phenomenon of physics, geology, nor vulcanism that could justify such gratuitous ignorance. Continuing this break from reality in true Indiana Jones style, the very instant they retrieve the object they sought this entire cavern begins to collapse as if in response to their trespass, again as if some unseen force is punishing them for their hubris. To sum it up, this production is an affront to reason, logic, and naturalistic fact; the \"believability factor\" suffers horribly throughout the movie. Its only redeeming value, if it can be considered redeeming, is indulging those who might harbor an infatuation with Sorvino, who is truly an Amazonian creature at least in appearance if not always in her choices of roles. She may live to regret this one; I most certainly regret having endured almost to the conclusion of it.",
         "A few days ago I watched the first part of this misadventure and was more or less ready to write down the review for both parts, but for the sake of truth decided to actually watch the second one. It didn't help this review a bit. Even in the first episode the main characters are abysmally flat and unbelievable. Events happen just so they can connect the crappy story in a way, but this hardly helps for the reality factor - You see knights riding horses on the marble floors being trashed by a 45kg blonde right after they've dealt with the helpless NYPD and robbed Vatican-guarded treasures \u0096 that, up to the 15th minute and you know dearly that you are watching mindless chick-flick soaped up with 'Templers, crazy Vatican priests/assassins and the saving of Christianity as a religion' just for the sake of it. But the pace of pure stupidity in the script is mind-blowing. You try to watch, yet another fifteen minutes and you need the break again, because you can't take it anymore. She was finding volcanoes and deserts in the Balkans, sailing into 10-meters waves in the Mediterranean and making love with the lot in between. It is hopelessly unbelievable. On top of that she always managed to get her brassiere fixed and fresh-looking. The development of the relationships between the main characters deserves the opposite of an Oscar and the guy responsible should be sent on a permanent vacation in Alaska. And it keeps spinning on, like a rotary engine fed with b0110cks, feeding the flames with a coal-like screenplay and absurd scenes. Don't waste your time on this one. It was a mistake. Just a mistake and nothing more for now, but if you waste your time watching this mistake you might be part of the reason why other mistakes like that will be made. And that is scary. Actors like Mira or next-guy-on-screen should concentrate over learning to act first and then taking on projects like this one. And about the writers \u0096 they should learn that a movie is based on a book not because they said so or there are some similarities - like Christianity and Turkey.... Here there are none, but yet they say it is made by the book, question being \u0096 WHICH ONE? ... Add again the WORST acting ever courtesy of Mira Sorvino (it never gets too much saying that) and = 1/10 \u0096 AWFUL, Worst movie of the YEAR surpassing the masterpiece 'SHARK IN VENICE' by a mile, if that's possible?"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Fantasy",
         "Thriller"
      ],
      "productionCompanies": ["Muse Entertainment Enterprises"],
      "summaries": [
         "During a gala museum event featuring precious Vatican artifacts, a group of men posing as Templar knights stage a daring robbery. Their primary interest is in obtaining a mechanical decoding device that can supposedly decipher the location of the Templar treasure. Archaeologist Tess Chaykin reluctantly works with FBI Agent Sean Daley to uncover the mastermind behind the plot and possibly locate the treasure.",
         "Now in Turkey, Tess Chaykin and Sean Daley travel to the site where they believe the Templar treasure is to be found. They are not the only ones there however as those who wish to reveal the Templars secret and those who wish them to remain secret are also after the treasure. When the treasure is revealed, it contains information that could rock the very foundation of Christianity.",
         "In New York, during the opening of the exposition of the Treasures of the Vatican for the public, four criminals posing as Templar knights break in the museum riding horses and heist the valuable artifacts. The archaeologist Dr. Tess Chaykin steals the horse of a policeman and chases and captures one thief with Red Cross of Constantine. The FBI Agent Sean Daley teams up with Tess that learns that the criminals' prime intention is a decoder mechanical device that can provide the location of the Templar treasure. They travel to Turkey where Tess expects to find the treasure and discover a conspiracy of the Church to keep classified information in secret to protect the Catholic Church.",
         "An adaptation of Raymond Khoury's novel about a New York archaeologist researching the lost secrets of the medieval Knights Templar."
      ],
      "budget": 0
   },
   "movielensId": 132348,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": null,
      "directors": ["Paolo Barzman"],
      "runtime": 170,
      "movieId": 132348,
      "title": "The Last Templar",
      "mpaa": "",
      "actors": [
         "Mira Sorvino",
         "Victor Garber",
         "Scott Foley",
         "Anthony Lemke",
         "Kenneth Welsh",
         "Omar Sharif",
         "Rebecca Windheim",
         "Christiane Paul",
         "Paul-Antoine Taillefer",
         "Stéphane Demers",
         "Christian Grenier",
         "Mario Davignon",
         "Adam Bramble",
         "Claudia Ferri",
         "Danny Blanco Hall"
      ],
      "imdbMovieId": "1197580",
      "originalTitle": "The Last Templar",
      "genres": ["History"],
      "youtubeTrailerIds": [],
      "plotSummary": "An adaptation of Raymond Khoury's novel about a New York archaeologist researching the lost secrets of the medieval Knights Templar.",
      "tmdbMovieId": 17669,
      "avgRating": 2.5,
      "releaseYear": "2009",
      "numRatings": 8,
      "posterPath": "/uZcfoDuozxNEchp98FAvN5cRrRC.jpg"
   }
}