{
   "tmdb": {
      "original_language": "ja",
      "keywords": [],
      "imdb_id": "tt0124770",
      "video": false,
      "title": "Patlabor 2: The Movie",
      "recommendations": [
         14571,
         16402,
         20921,
         39469,
         31595,
         39468,
         44243,
         11226,
         50482,
         12561,
         39256,
         36243,
         62105,
         55426,
         38986,
         241432,
         25690,
         16405,
         55430,
         39229
      ],
      "backdrop_path": "/tS39rr7z2KPDTic2Ln2o6TpwaCq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Noa Izumi (voice)",
               "gender": 0,
               "credit_id": "540186d50e0a2658e2004661",
               "name": "Miina Tominaga",
               "profile_path": "/aupNoLnmXIKC8FjjMyDeeG2qOWo.jpg",
               "id": 1358320,
               "order": 0
            },
            {
               "cast_id": 22,
               "character": "Asuma Shinohara (voice)",
               "gender": 0,
               "credit_id": "55cbf8e4c3a368570100146f",
               "name": "Toshio Furukawa",
               "profile_path": "/7Pss94t6JTjbIK2JoOA8Ohg5rCJ.jpg",
               "id": 85286,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kiichi Goto (voice)",
               "gender": 0,
               "credit_id": "54018795c3a3684366002c8c",
               "name": "Ryûnosuke Ohbayashi",
               "profile_path": null,
               "id": 1358321,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Shinobu Nagumo (voice)",
               "gender": 0,
               "credit_id": "540187f2c3a3682d98001351",
               "name": "Yoshiko Sakakibara",
               "profile_path": "/aocre8nV2T4VpIHasdguw1W7edM.jpg",
               "id": 624,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Isao Ohta (voice)",
               "gender": 0,
               "credit_id": "5401881ec3a3687d5000119e",
               "name": "Michihiro Ikemizu",
               "profile_path": null,
               "id": 100125,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Hiromi Yamazaki (voice)",
               "gender": 2,
               "credit_id": "54018876c3a3682d9800135d",
               "name": "Daisuke Gouri",
               "profile_path": "/3GR2QRpRr3Kkbpv876K3tAX8trT.jpg",
               "id": 122191,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Shigeo Shiba (voice)",
               "gender": 0,
               "credit_id": "54018895c3a3684360002ea1",
               "name": "Shigeru Chiba",
               "profile_path": "/23GASkx3cOtzgtBkrDTj44nbpVg.jpg",
               "id": 105816,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Mikiyasu Shinshi (voice)",
               "gender": 2,
               "credit_id": "5782bd0fc3a3685e08001da7",
               "name": "Issei Futamata",
               "profile_path": "/pDDSMdVYH0IGdRdFjWhg0EvbzJl.jpg",
               "id": 551981,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Seitaro Sakaki (voice)",
               "gender": 0,
               "credit_id": "540188c0c3a3684363002bfd",
               "name": "Osamu Saka",
               "profile_path": null,
               "id": 83932,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Matsui (voice)",
               "gender": 0,
               "credit_id": "540188f6c3a3680603002952",
               "name": "Tomomichi Nishimura",
               "profile_path": "/kZXRpvXwI0F1qbKNff3dOG2BodA.jpg",
               "id": 81859,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sakuma (voice)",
               "gender": 0,
               "credit_id": "54018947c3a3682d9800136a",
               "name": "Ryûji Nakagi",
               "profile_path": null,
               "id": 1120476,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Buchiyama (voice)",
               "gender": 0,
               "credit_id": "5401896fc3a368060300295a",
               "name": "Fumihiko Tachiki",
               "profile_path": "/tcHbLVf7ddcRvAS68PRR2couCNc.jpg",
               "id": 77934,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Tamiko (voice)",
               "gender": 0,
               "credit_id": "540189a9c3a3687d500011b6",
               "name": "Shinobu Adachi",
               "profile_path": null,
               "id": 1238595,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Kaiho (voice)",
               "gender": 0,
               "credit_id": "540189c6c3a368068c002d4b",
               "name": "Toshihiko Kojima",
               "profile_path": null,
               "id": 1248272,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Yamadera (voice)",
               "gender": 0,
               "credit_id": "540189f7c3a3682d9800137b",
               "name": "Akamasa Oomori",
               "profile_path": null,
               "id": 1358379,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Tsuge (voice)",
               "gender": 2,
               "credit_id": "54018a3dc3a3684372002bdd",
               "name": "Jinpachi Nezu",
               "profile_path": "/jG3BRffmuJRfnuzsi4A0fJ3CudS.jpg",
               "id": 70133,
               "order": 15
            },
            {
               "cast_id": 21,
               "character": "Arakawa (voice)",
               "gender": 2,
               "credit_id": "546e4222c3a368453f0001d2",
               "name": "Naoto Takenaka",
               "profile_path": "/9mAwzOZCWvaqDNOT3a0cIZVByRw.jpg",
               "id": 68704,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46029251416c75069f75",
               "name": "Mamoru Oshii",
               "profile_path": "/2MXFEwxLu7gT9vvi5Otx4LQgsvZ.jpg",
               "id": 12180,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54018aa9c3a3684366002cc2",
               "name": "Kazunori Ito",
               "profile_path": "/gHLjymYpgHONtxLleogmxt5EVj7.jpg",
               "id": 57302,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         }
      ],
      "popularity": 2.171884,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 14572,
      "vote_count": 19,
      "budget": 0,
      "overview": "A Japanese police unit who use giant anthropomorphic robots (called Labors) is caught up in a political struggle between the civilian authorities and the military when a terrorist act is blamed on an Air Force jet. With the aid of a government agent, the team gets close to a terrorist leader to stop things from going out of control when after the military is impelled to impose martial law.",
      "similar": [],
      "original_title": "機動警察パトレイバー 2 the Movie",
      "runtime": 107,
      "poster_path": "/uqXxPg1OLT1hj6bHHSnZqF4tso1.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [],
      "release_date": "1993-08-07",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": "/owvE3lxUTk37jnwDRPbfc0DvELN.jpg",
         "name": "Patlabor Collection",
         "id": 98435,
         "poster_path": "/nyvcnmR73RCDX45mhVyd7RjEpvL.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": null,
      "budgetCurrency": null,
      "directors": ["Mamoru Oshii"],
      "runtime": 113,
      "synopsis": null,
      "writers": ["Kazunori Itô"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0124770/",
      "coverLink": null,
      "actors": [
         "Mîna Tominaga",
         "Briony Glassco",
         "Julie Ann Taylor"
      ],
      "reviews": [
         "Mamoru Oshii's \"Ghost in the Shell\" got all the hype, but his earlier film, \"Patlabor 2,\" is by far the more mature, artistically successful film. This is anime at its finest - sharply detailed artwork, superb animation, and a story that WILL hook you. Disguised as a Tom Clancyesqe techno-thriller, Patlabor 2 is actually a knowing, often cynical examination of global politics. The film at times resembles a surreal CNN report...if it were scripted by Noam Chomsky and directed by Alfred Hitchcock! What does that mean? First, the symbolic visuals are beguiling and plentiful. I would suggest you first view either \"Psycho\" or the \"The Birds\" and then Watch the Birdie in \"Patlabor 2\". Patlabor 2 is a beautiful film. There are many stunning, surreal cityscapes that recall \"Blade Runner.\" These scenes are accompanied by Keiji Kawai's meditative, haunting score. But the film's greatest impact is its disturbing plausibility. There may be giant robot police patrolling the streets of Tokyo, but the patterns of infrastructure and the chaos that breaks out when it breaks down seem all too real. I give this anime my highest recommendation and I would especially recommend it to those who are either unfamiliar with Japanese anime or perhaps think animation is not a \"serious\" artistic medium. (This film will set them straight). Due to it's highly dense dialogue, I would recommend the dubbed version (unless you're fluent in Japanese or just prefer subtitles). The dubbing job is superbly acted and well-timed, preserving the original script's dramatic pauses and moments of silence.",
         "As with Patlabor 1, there's a facade of misleading marketing around this film. There's a picture of a big robot on the packaging, and any teaser will probably promise you a non-stop mecha blasting fest. This is, simply put, a shameless lie. Patlabor 2 is a political thriller (often likened to a Tom Clancy novel with good reasons), and a very slow, brooding, talky, philosophical one at that. Big robots just happen to exist in it's setting, but their presence in the film is so slight you'll hardly notice them. What you will notice, however, are some wonderful visuals and music, and a story that asks the viewer many daring, insightful questions about the world of today. The plot centers around a few terrorist attacks on Tokyo taking place in the winter of 2002 (note that the film was made in 1993). Most of these attacks are really fake, or harmless makebelieve-attacks, but they're enough to create panic and to cause the established sense of security to crumble to bits. Captains Gotoh and Nagumo of the Special Vehicle Units try to unmask the man, and especially the ideas behind these staged attacks. Everything points to a certain Yukihito Tsuge, who's an old familiar of Nagumo. What makes this film special is the way we're given insights into Tsuge's beliefs through the dialogues. The viewer is directly confronted with some very powerful questions. The state of being that we call \"peace\" in the western world - just how peaceful is it really? How fragile is it, and how much do we deserve this relative 'peace' compared to the prices mostly others pay for it? The film is rife with such questions, and they leave a considerable impact on the viewer. I daresay Patlabor 2 is worth it's price alone for being confronted with such thought-provoking issues set to some of the most beautifully haunting images and music ever put on screen. The animation is definitely finely-crafted (there's a scene where helicopters swoop over the city who's smoothness has to be seen to be believed), but it's biggest strong point is the way it's all been directed. Slow, sweeping shots of the intricate semi-futuristic cityscape are the order of the day, with many other impressively beautiful shots. But it's the music that really stole the show for me, with a wonderful use of mostly gentle and haunting melodies. The soundtrack is a true masterpiece, whose tunes will remain with you for a long time after viewing the film. It adds a dimension to the atmosphere that really can't be described very well on paper, so I'll just say it's powerful and beautifully-crafted stuff. The image of snowflakes drifting down onto tanks stationed all over Tokyo while a soft, ghostly melody plays in the background is a good example of the sort of moment where Patlabor 2 shines. It doesn't shine all the way, though. There are a few flaws to this film, which make it hard to recommend to everybody. The talkiness, for one thing, sometimes really goes over-the-top. Instead of showing you what happened, a pretty important development is sometimes only mentioned in a conversation. This makes it difficult to keep up all the time, especially as the viewer is sometimes assumed to be an expert on political powergames; -\"Some minister has just done something or other, and then this and that happened\" -\"I see... that means so-and-so plans to do yakkity-something...\" Dialogues like that pop up a few times in the film and manage to be pretty unpleasant. Likewise, there's no gentle introduction to Patlabor newcomers, so it's recommended that you've seen at least the first Patlabor movie before tackling this. While the few scenes of how the regular Patlabor cast have gotten on with their lives are fairly unimportant, being at least somewhat familiar with them is a welcome help in following a sometimes overwhelmingly complex film (I mean that in a good way, though ^^). Patlabor 2 will never be suited to general public tastes, as it's simply too complex, talky and basically 'different' for anyone just seeking some escapist fun. The DragonBall and Akira crowd need not look into this until they've learned to stop referring to the anime medium as 'ménga movies' while mistaking it for a slew of violent cyberpunk slop which they consider 'kewl' or 'kickass' or whatever. Same to the general Hollywood crowd who'd freak out at the idea of a film demanding efforts from the viewer - Patlabor 2 demands lots of efforts, but has something special to reward you with. Patlabor 2 serves it's doses of food for thought raw, and it takes some effort to swallow them. But I'd say that effort is well worth it. For the unique, powerful atmosphere alone, this is more than worth a look. I guess \"haunting\" is really the most suitable word to describe Patlabor 2's superb feel. It literally does haunt you, with questions about the state of the society we live in that you can't possibly turn a blind eye on (in fact, after the attacks on America in September 2001, Patlabor 2's messages have become ironically up-to-date in their relevance). And a film that achieves such effects so very well deserves to be seen and to be praised. And then there's -that- music. Absolutely brilliant, it makes this film a must-hear as well as a must-see.",
         "This is a fine example of what Japanese animation can produce at its best. The style of this movie strongly reminds me of a Tom Clancy novel, which is unusual for anime. At the beginning I was a little put off by the slow pace of the movie, but as the story unfolded, I was sucked in by its complexity and realism. Indeed, the conflict and the political games between the government, the army and the police are so well constructed that I thought \"this could *really* happen!\" If you liked this movie you should try to see \"Jin-roh\". There's the same kind of political and military intrigue but the story is more personal and close to the action than the high-circle strategy atmosphere which permeates Patlabor 2.",
         "\"Japanese cartoons are for kids\"... This is yet another movie to show to people who wrongfully believe that! A movie like \"Ghost in The Shell\" and the series \"Neon Genesis Evangelion\" have proven to contain more plot in the screenplay, and even afterthought in the mind of the audience, than most Hollywood-movies I know of. \"Patlabor 2\" is definitely another addition to my list of movies I would say disproves the first sentence in this comment. As other commenters have noted, \"Patlabor 2\" resembles a Tom Clancy political thriller. The storytelling was so good that it got my heart racing in some scenes, and that is saying a lot from my point of view (Trust me on that one - I've seen \"The Others\" and similar movies, without moving a muscle when the rest of the theatre screamed). If the story was tightened here, and the plot was elaborated there, \"Patlabor 2\" could be made into a Hollywood-movie as a frame-by-frame copy! I really mean that - There is always room for improvement, but in my opinion there are only very minor blemishes to the flow of the movie. I enjoyed every second, although some other commenters found the \"slow parts\" boring or irrelevant. The music (or lack thereof) is also definitely worth a mention. It's hard to describe - I just couldn't imagine it being any different for this movie. The reason I write lack of music is because there are scenes where any Hollywood-producer would have slapped on some generic classical music, but in this case there is none. For example there is a scene after a climax where you just see different parts of the cityscape, with snow falling, and there is no sound at all. THAT's movie-magic. It's part of what draws me to this strange, exotic type of movies - it's so different than what most of us are used to. Recreate the visuals using a film-camera, actors and a special-effects crew, copy+paste the music, label it \"made in Hollywood\" and you've got yourself a blockbuster-hit! Japanese cartoons are for kids - not. If you have a brain, and an attention-span bigger than your average action-monkey, this movie is for you.",
         "Patlabor 2 is a very good anime, both by the technical quality of Oshii's team's work, and by a very good and smart screenplay, using politic and terrorism as background. This movie show us that anime is not only for kids (see Disney) and that japanese anime can have beautiful picture and good screenplay.",
         "I was like many people upon viewing this film for the first time. I could sit through it without getting bored or falling asleep. It's not your typical robot anime at all. Its more than that really. The film isn't like its mecha predessors - its not about the action. And if your watching this film purely for action than you will be disappointed. Because this film is mostly dialogue and politics all the way through. But once you have a greater understanding of the film, you will realise as I have how wonderful and amazing this film actually is. The film is a commentry on Japanese 'common-sense' pacifism to war. It asks the viewer to question this pacifism: how can Japan claim to be peaceful nation if it ignores the security of others. The film makes it's point very clear, and it is effective in bringing this message across. But of course if you only want to watch the film for its action sequences, then obviously your missing the point of what makes this thoughtful film so amazing to watch.",
         "Director Mamoru Oshii gets it right the second time round. His penchant for deep philosophical stories is executed with the right touch of pathos and aided greatly by the superior quality of animation and more \"mature\" character designs. Followers of the TV and OAV series would know that the chief of Section 2, Goto harbours a crush for chief Nagano of Section 1. However, being the stoic man that Goto is, he could never openly admit his affection for her. The plot focuses on Nagano's past as a brilliant student of labor tatics - and her relationship with her much older mentor.Their affair was doomed as he was a married man. The political fallout caused her high-flying career to to come to a halt and ended up with her posted to the \"lowly\" Special Vehicle Section 1.Her mentor took charge of a UN labor peacekeeping force which got slaughtered in the jungles due to inept commands from his superiors. He returned to Japan a changed man. The story is a vastly superior adaptation of \"SV2's Longest Day\", one of the outstanding episodes in the first OAV series. The film is filled with poignant scenes and quiet, surreal sequences in the heart of the city that are a prequel of sorts to Oshii's masterpeice Ghost in the Shell. Like I said, fans of the series will especially appreciate Goto's dilemma in the closing scene.",
         "Patlabor 2 is an incredible movie all around. Let me begin. Point#1: The Story. The story is superior to Patlabor 1's by far. It is more enthralling and has all questions answered nicely. Point#2: The Directing. Mamoru Oshii does it again! This was his first film when he started becoming artistic, and he already has it mastered. He manages to visualize Ito's screenplay so well, it is just breathtaking. Point#3: The Music. Another beautiful score from Kenji Kawai! He makes some beautifully animated scenes and makes them even more beautiful! He was definitely ready to compose a movie such as Ghost In The Shell. Conclusion: Just watch it. Go out to Blockbuster and rent this movie. Then, buy it. If they don't have it, DEMAND IT! That's all I have to say. See you later. Rating: 5 out of 5",
         "The first time I heard of this japanese anime films I was very sceptic. I thought they are stupid little movies mostly contain erotic scenes. But I changed my mind after seeing this great anime, it has a more complex story than many of the Hollywood productions. Perhaps this also could be a problem, because you have to concentrate on the movie. Somethimes it is really hard to understand all the political maneuvers and the philosophic dialogues. But this movie is worth to look twice or even more times, also the animations are really great. Forgett this stupid Walt Disney style If you have seen a anime one time you will love it! It is one of the greatest movies I have ever seen so 10 points of 10",
         "Mamoru Oshii has created an amazing work of political and military intrigue wholly different from the haunted proto-ghost story of Patlabor: The Movie. Although it parallels its predecessor in some plot elements (lone madman with delusions of affecting a world-change), the movie departs from all other aspects of \"typical\" Japanese cartoon work and enters a realm reserved for potboilers like Three Days of the Condor and The Hunt for Red October. Commander Gotoh, caught between his loyalty to his men, his sense of duty and his relationship with one of his troops and a coming civil war finds himself on the sword point of a massive socio-political upheaval with overtones of covert U.S. backing. What it all leads to is a potential breakdown of civilian governance of Japan and an end to that nation's independent self-rule. The terroristic acts of a lone military mastermind who bears a grudge against short sighted bureaucrats - and has the reasons for his contempt proved time and again during the crisis he engineers - push Japan into a state of near panic as the military and the police including Commander Gotoh's Special Vehicles Unit face off against one another. Will the final showdown end in the madness of a civil war? Watch the movie, find out. Forget preconceptions about Japanese cartoons, and discard the mental image brought up by the \"giant robot\" on the cover of the DVD. The \"Labors\" serve as mere background icons (much as the powered armor did in R.A. Heinlein's seminal Starship Troopers (not the execrable movie loosely based on that work)) and as subtle statements on the separation of men from society by duty and law. Please, if you have a prejudice against Japanimation, don't let it override your judgment. Don't miss this one. It's that good.",
         "This movie has great animation. If you pay attention to the details, you will notice subtle effects, such as someone's hair blowing in the wind. No 2 fps on this anime. There is no obscene violence and no nudity in this anime, which is a plus. It also has a very deep and thought provoking storyline. It is so deep and thought provoking that you should watch it more than once to catch all of the details. It is hard to tell the difference of all of the Japanese names of the characters, which can get a little annoying. This movie is very meditative in that it has many scenes where there are just two people talking and you get views of the city. During these dialogues, they questions on wars, and peace. Which is worse, a just war, or an unjust peace. You will spend many hours thinking about this film after you have seen it.",
         "Patlabor 2's material is complex and very promising, but when all is said and done, a hell of a lot more was said than done. After watching this and getting all the numerous relationships right, I still felt noteably unsatisfied. Patlabor 2 is a very stylishly directed story of Japan in the near future, being held hostage by a terrorist who masterminds a breakdown of civil rule in retribution for the government's incompetence. At the beginning of the movie, his machinations are set in motion, and at the end, there is the lacklustre uninspired payoff. Inbetween lies the sprinkling of philosophical monologues of sporadic merit, all the while the plot somehow unfolds. I say \"somehow\" because I really don't know how. I guess I'll have to take the characters' words for it because, for the better part of the picture, their blatant expositions are the only way the audience finds out that something really big supposedly just happened -- talk about phoned in. For all it's stylish direction and philosophising characters, Patlabor 2 leaves the viewer with very little to digest about it's characters and universe, and as such does equally little to justify being a motion picture. 2/4",
         "It's 2002, 3 years after the events in Patlabor 1. The collapse of the United Nations Labor team in South East Asia began the build-up to form a deadly terrorist plan that threatens to send shock waves throughout Japan's military. A fighter jet crashed into a bridge as a first sign of disaster. With evidence of an impending military takeover, the scattered members of the original Second Division must gather to defend Tokyo against any possible danger or an outbreaking war. This is known to be the most political Patlabor anime ever made. The topics discussed in it make it feel like your watching a live action film. As well as long monologuing scenes that can be a snore. But the characters, story, and labor robots are all there. Unlike the other Patlabor anime. This one focuses on Captain Goto, Shinobu, & Detective Matsui throughout the movie. And it's very meaningful in war, terrorism, and politics.",
         "This movie grabs me in a visual sense more than many other movies, in a way only a few films can compare such as 2001. The melancholy yet realistic nature of the film is one of the highlights. With a deep story, this is a very interesting movie. Actually the theme of this film is probably reality, and if what an image is portraying is actually real.",
         "I have an odd history with the \"Patlabor\" series of Japanese Anime' OVAs, TV shows, comics, and feature-length Anime' films. I saw \"Patlabor: The Movie\" (1989) when it was first released in a limited edition DVD set back in 2006. I had the good fortune of watching the movie over the Fourth of July weekend that year, and I must say that I remember thoroughly enjoying the picture for what it was: a detective story mixed with a strong science fiction backdrop laced with all sorts of thematic material about technology's ascension over human beings (there is little doubt, in my mind, that the story was inspired by \"Blade Runner\"). But I've only seen the movie once, unfortunately, which was just that one time. Now over the Christmas break 2012, I have the fortune of watching the film's sequel, \"Patlabor 2: The Movie.\" If you remember, the series is set over what at that time was the future (1998-2002). The story involved large robots (called \"Labors\") that were used for both construction work and law enforcement duties; the series focused mostly on the law enforcement Labors, which are called \"Patrol Labors\" (\"Patlabors\"). Mamoru Oshii (most famous for the 1995 sci-fi cyber-thriller \"Ghost in the Shell\") returns for the directorial duties of the sequel (as does Kazunori Ito on the screenplay, who also worked on the script for \"Ghost\"), which is set three years after \"Patlabor: The Movie.\" The film shifts the focus of the story from Noa Izumi and Asuma Shinohara, the plucky heroine and hero of the first movie, to Kiichi Gotoh, the understated yet calculating commander of the Tokyo Metropolitan Police Department's 2nd Special Vehicles Section (SV2), Division #2. He and his immediate superior Commander Shinobu Nagumo attempt to investigate a series of terrorist incidents that they believe are the work of a disgruntled ex-Japanese Self-Defense Forces officer named Yukihito Tsuge. His main goal appears to be revenge for a failed United Nations Labor operation in Southeast Asia three years earlier in 1999. \"Patlabor 2: The Movie\" is a very plot-heavy film with a strong political subtext meant to raise questions about Japan's place in world affairs in the late 20th century/early 21st century. Make no mistake, this is a politically-charged Anime' film, one that may be lost on non-Japanese audiences that addresses Japan's role as a (forcibly) pacifist society as a result of its defeat in World War II. According to Carl Gustav Horn in the booklet for the DVD of \"Jin-Roh: The Wolf Brigade\" (1998), Tsuge's campaign of domestic terrorism is meant to force Japan to face up to its largest \"political contradiction\": Its forced rejection of war (as a result of Article 9 of the 1947 Japanese Constitution - which was written by the Allies, not the Japanese people themselves) and the fact that Japan must rely on the United States for its primary defense (as a result of the U.S.-Japan Mutual Defense Treaty of 1954). Tsuge's plan, in effect, almost brings Japan to the brink of war. It is a troubling question, but a thoughtful one of what Japan should do to defend itself - without violating its commitment to peace (or at least within the confines of stiff Article 9 regulations). \"Patlabor 2: The Movie\" is a great film, one that may not be as action-packed as the first movie, but it's a more thoughtful picture than the first movie. 10/10",
         "Mamoru Oshii is a name best known in the \"anime world\" for his work as director in Ghost in the Shell. Ghost in the Shell is a fabulous movie. It's beautifully animated. There are long, beautiful pans of demonic cityscapes set to the haunting score composed by Kenji Kawaii. There are complex, philosophical problems that trouble the two protagonists on a personal level, whom seem to have some sort of unresolved sexual tension going on. There is a heavy, intricate plot, that while puzzling at first, eventually is resolved through brilliant detective work. And the end, all the culminated tension violently explodes on-screen. Now let me tell you about Patlabor 2. It's beautifully animated. There are long, beautiful pans of demonic cityscapes set to the haunting score composed by Kenji Kawaii. There are complex, philosophical problems that trouble the two protagonists on a personal level, whom seem to have some sort of unresolved sexual tension going on. There is a heavy, intricate plot, that while puzzling at first, eventually is resolved through brilliant detective work. And the end, all the culminated tension violently explodes on-screen. That's right, this Patlabor movie is the exact same movie as Ghost in the Shell, or pretty much any Oshii film I've seen (other than the Sky Crawlers, which was atrocious). But I give it a perfect 10... why is that? Because it is flawless. There is nothing wrong with this film. The characters are beautifully written, the plot is, though confusing, complex and laden with important social issues that were not only issues for Japan in the early 90s, but issues that people in the US today. I don't really want to give too much away, but you'll see what I mean. And then there's Arakawa, who is a brilliant character and fit right in with the atmosphere of the movie. If there is one word to describe this movie it is \"atmospheric\". You should expect no less from the guy who directed Ghost in the Shell, right? Yet I feel in some ways this movie is superior to GITS. All the characters here are involving (I've only seen the first two Patlabor movies), whereas the characters in Ghost in the Shell are well-developed, but cold and stoic. In Patlabor 2, the characters are not warm or fuzzy, but are realistic realists. They're brilliant. If there was any problem with this film its that it is very very dialog heavy. If you don't pay attention to what the characters are saying, you're left out of the loop. But you will pay attention, because what they say is just so engaging. Remember the old adage, 'show don't tell'? Well forget it. Go watch Patlabor 2.",
         "I just watched this today and I can't say I'm that impressed with this as an overall movie. I should note first I loved the animation and it's really the strongest point of the movie. Scenes are incredibly detailed, facial expressions are well done, cityscapes and vehicles are gorgeous. There are also some really great meditative shots in the movie that really do a excellent job to set the atmosphere. However the story is where this movie starts to fall apart. First of all this next section will have spoilers; so don't read if you haven't watched this movie. I have never watched the Patlabor anime so perhaps my dislike of the story is because of this but I just found everything that happened in the movie as too thin to be plausible in the storyline. There is a rogue faction in the military that wants to create chaos, and...to do something, because they don't like the peace settled after WW2, and they want to shake stuff up, or something like that. And that's the thing; there was nothing in the movie that made sense with respect to the antagonist's motivations. In fact their motivations are only discussed through philosophical musings similar to high school level views of international relations: the developed world enjoys peace at the expense of the war torn nations or something, so down with the system. It all sounded very juvenile to me. So after the antagonists initiate a terrorist attack, somehow the government makes the incredibly stupid decision to stick their heads in the sand, pretend that nothing happened, until they can't in which case they blame the military. Then the completely unlikely event of a military coup happens... why? because well they don't like being blamed. What's the military's goal for the coup? It's never said, all that's said is that they think the civilian government is weak and they know there's some nefarious guy involved in the terrorist attacks but they won't go after them for some reason even though he's hanging out in plain sight jamming everyone's communications in the middle of Tokyo harbor. So this leaves our plucky band of heroes to do the job, because they're the only ones in Tokyo that have a moral compass or something like that. In summary watch this movie for the great animation but don't bother reading into the story too much. There's also some philosophical musings along the way but they don't have much weight to them. Which leaves some good action scenes, and atmospheric shots to enjoy but not a whole lot else.",
         "patlabor 2 is as good or better then patlabor 1 in my opinion. why can't we in America turn out gems like this? this movie has everything that you would want in a good movie. the script is super-tight, the characters are all interesting, the animation is beautiful, there's mechanized robots and cool battle-choppers, the action when there is, is very intense and well done. you actually care about the characters and what will become of them(a sign of a good movie). this is not an anime movie for kids, not because of nudity or gore or language, its because the story is very deep and complicated and you need a mature mind to break it down. the movie brings back everybody from the first movie and goes deeper into the back story of 2 of the main characters from SV2. this time around the movie talks about government conspiracy and that without a true military big time confusion happens when you don't know who is in charge. i love the fact that the movie is almost 2 hours long and full of intelligent dialogue with the occasional brief action. i watched patlabor like everybody else, thinking it had a lot of Mechs and non- stop action. boy, was i wrong...but i'm glad i got to see patlabor 1 & 2, cause it is as good or better then most stuff that Hollywood puts out. wanna see a very good intelligent movie with action that doesn't dumb you down and is a anime no less...the buck stops right here. if you are a true fan of anime then patlabor 1 & 2 is essential viewing...enjoy!",
         "Patlabor 2: The Movie by Mamoru Oshii could be used as course material for an upper-division political science class. It is that smart. Mr. Oshii is a literal genius. Right alongside Einstein. Some topics are too complex for words alone. This masterful director has found a way to make difficult subjects accessible to us ordinary humans. Historical attempts at exploring complex matters have been required to analyze all the little factors to the point that years of study are required for adequate comprehension. Pictures are worth a thousand words. A movie is many pictures, backed up by dialog, and as such may be the perfect medium to explore complex topics. Mr. Oshii presents a subject and explores it for a few scenes. After completing his idea he then lets the information soak in by using scenes with no dialog, music, or complicated scenery. Then this wonderful director examines another facet of the message that he is trying to convey, followed by some more quiet time to think about it. Masterful! Patlabor 2 was released in 1993. In the movie an incident occurred that was eerily close to a military scenario conceptualized years before. That was in the movie. That scenario was eerily close to 9-11. Yes. I am saying that my reality as an American in 2012 is very similar to the political reality in Patlabor 2. Shockingly so. I did not see any analysis that pointed this out so here it is. View the movie again and the whole thing may disturb you.",
         "I recently saw this film and was less than impressed. I am an anime fan, but disliked this movie. Before you tear me up for 'not getting it', or 'only liking anime for the sex and violence', let me explain that neither of those points are true. Patlabor 2 did have incredible, albeit boring visuals to compliment its deep, albeit boring story. The main character constantly waxes philosophical about war, peace, and society, usually while looking at the city or riding in a car on a periodically lit street. This all combines to create an unspectacular, overlong, story with too much talking and too little doing. This would've been better as a monologue by the Captain, and not as an attempted action movie. In that same vein, GIANT ROBOTS that only once get used! Even the one and only battle scene is slow. If I wanted philosophies on War and Peace, I'd read Tolstoy. Let the giant mechs do what they do best, beat the crap outta other robots. This movie tried to do too much and disappointed at all. To explain my subject line: I believe that those who compliment this movie would've walked out if it had been presented as a live- action film. 5/10 only for the nice visuals and what little learning anyone can glean from the philosophical police captain."
      ],
      "genres": [
         "Animation",
         "Action",
         "Drama",
         "Mystery",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Bandai Visual Company",
         "Tohokushinsha Film Corporation (TFC)",
         "Elastic Media"
      ],
      "summaries": [
         "A Japanese police unit who use giant anthropomorphic robots (called Labors) is caught up in a political struggle between the civilian authorities and the military when a terrorist act is blamed on an Air Force jet. With the aid of a government agent, the team gets close to a terrorist leader to stop things from going out of control when after the military is impelled to impose martial law.",
         "When a terrorist attack is blamed on the Air Force, Special Vehicle Unit 2 gets caught in the middle of a growing political conflict."
      ],
      "budget": 0
   },
   "movielensId": 132362,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1993-08-07",
      "dvdReleaseDate": null,
      "directors": ["Mamoru Oshii"],
      "runtime": 107,
      "movieId": 132362,
      "title": "Patlabor 2: The Movie",
      "mpaa": "",
      "actors": [
         "Miina Tominaga",
         "Toshio Furukawa",
         "Ryûnosuke Ohbayashi",
         "Yoshiko Sakakibara",
         "Michihiro Ikemizu",
         "Daisuke Gouri",
         "Shigeru Chiba",
         "Issei Futamata",
         "Osamu Saka",
         "Tomomichi Nishimura",
         "Ryûji Nakagi",
         "Fumihiko Tachiki",
         "Shinobu Adachi",
         "Toshihiko Kojima",
         "Akamasa Oomori",
         "Jinpachi Nezu",
         "Naoto Takenaka"
      ],
      "imdbMovieId": "0124770",
      "originalTitle": "機動警察パトレイバー 2 the Movie",
      "genres": [
         "Animation",
         "Science Fiction",
         "Action"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A Japanese police unit who use giant anthropomorphic robots (called Labors) is caught up in a political struggle between the civilian authorities and the military when a terrorist act is blamed on an Air Force jet. With the aid of a government agent, the team gets close to a terrorist leader to stop things from going out of control when after the military is impelled to impose martial law.",
      "tmdbMovieId": 14572,
      "avgRating": 3.89189,
      "releaseYear": "1993",
      "numRatings": 37,
      "posterPath": "/uqXxPg1OLT1hj6bHHSnZqF4tso1.jpg"
   }
}