{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "subway",
            "id": 1552
         },
         {
            "name": "spider",
            "id": 3986
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "town in panic",
            "id": 41642
         },
         {
            "name": "subway tunnel",
            "id": 177502
         },
         {
            "name": "giant",
            "id": 189099
         },
         {
            "name": "mutant spider",
            "id": 235512
         },
         {
            "name": "alien dna",
            "id": 235513
         }
      ],
      "imdb_id": "tt1659216",
      "video": false,
      "title": "Spiders",
      "recommendations": [
         197631,
         203552,
         120092,
         73963,
         160897,
         89634,
         108147,
         124054,
         48519,
         178687,
         21166,
         235388,
         21922,
         166660,
         110372,
         213803,
         406582,
         84293,
         69485,
         36965
      ],
      "backdrop_path": "/9RFXPgdcWLQyBnfd7rPBsGXhUYw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rachel",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fca1",
               "name": "Patrick Muldoon",
               "profile_path": "/bQXk6dGI2zjRY2rvfwmpdHpyh9F.jpg",
               "id": 41687,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "52fe4c78c3a36847f822fca5",
               "name": "Christa Campbell",
               "profile_path": "/hWmOTsi5z5wvKcTsaLfWrhAsNJK.jpg",
               "id": 85178,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Phoebe",
               "gender": 1,
               "credit_id": "52fe4c78c3a36847f822fcc7",
               "name": "Shelly Varod",
               "profile_path": "/rZldnhPqzpKMXCzrkckR6pAzkZO.jpg",
               "id": 85516,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Doctor Stella",
               "gender": 1,
               "credit_id": "52fe4c78c3a36847f822fccb",
               "name": "Jon Mack",
               "profile_path": "/fED5w0at8K96ZExOxPQXWPLYAgk.jpg",
               "id": 727467,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "News Anchor",
               "gender": 0,
               "credit_id": "52fe4c78c3a36847f822fccf",
               "name": "Misha Dibono",
               "profile_path": null,
               "id": 1153367,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Dr. Darnoff",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcd3",
               "name": "Pete Lee-Wilson",
               "profile_path": "/aqFnMSaNJDj2w37xoN70gwn9pSo.jpg",
               "id": 24605,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Apartment Soldier",
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcd7",
               "name": "Owen Davis",
               "profile_path": null,
               "id": 599976,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Emily",
               "gender": 1,
               "credit_id": "5a8a5260c3a36862e1070ef6",
               "name": "Sydney Sweeney",
               "profile_path": "/ldYFNS9jD7h7gzERTkbELcUadBa.jpg",
               "id": 115440,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcab",
               "name": "Tibor Takács",
               "profile_path": "/6W3KQ7vcNEs1hOFCkGq9TyeXLFo.jpg",
               "id": 42309,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcb1",
               "name": "Joseph Farrugia",
               "profile_path": null,
               "id": 1144828,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcb7",
               "name": "Tibor Takács",
               "profile_path": "/6W3KQ7vcNEs1hOFCkGq9TyeXLFo.jpg",
               "id": 42309,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcbd",
               "name": "Tibor Takács",
               "profile_path": "/6W3KQ7vcNEs1hOFCkGq9TyeXLFo.jpg",
               "id": 42309,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c78c3a36847f822fcc3",
               "name": "Boaz Davidson",
               "profile_path": "/otx19f3Nuzkfy2PWovnEgaM3qv7.jpg",
               "id": 16830,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.059674,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 164331,
      "vote_count": 48,
      "budget": 7000000,
      "overview": "After a Soviet space station crashes into a New York City subway tunnel, a species of venomous spiders is discovered, and soon they mutate to gigantic proportions and wreak havoc on the city.  Starring Patrick Muldoon, Christa Campbell, directed by Tibor Takacs. Originally called \"Spiders 3D\" but now simply \"Spiders\"",
      "similar": [
         19545,
         49849,
         5876,
         7191,
         228161,
         602,
         348,
         10200,
         47933,
         124905,
         299687,
         137113,
         126889,
         2675,
         339967,
         10127,
         3980,
         7453,
         68179,
         339530
      ],
      "original_title": "Spiders",
      "runtime": 89,
      "poster_path": "/ijvaFP1kX7LiymeJAJxJ74FGoJ2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Millenium Films",
            "id": 1020,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nu Image Entertainment",
            "id": 713,
            "origin_country": ""
         }
      ],
      "release_date": "2013-02-08",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "8 legs, 3 Dimensions, 1 Disaster",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tibor Takács"],
      "runtime": 89,
      "synopsis": "Following a crash of an old Soviet space station in New York City's subway tunnel, a new species of poisonous spiders is discovered. Inadvertently the spiders mutate to gigantic proportions and wreak havoc on the entire city.",
      "writers": [
         "Joseph Farruggia",
         "Tibor Takács"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1659216/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjEwNDQ1NTAyMl5BMl5BanBnXkFtZTcwMDY0NzAzOA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "William Hope",
         "Shelly Varod",
         "Brian Hankey"
      ],
      "reviews": [
         "Problems With Spiders: -Not enough spiders. -The spiders don't kill enough stupid actors. -Christa Campbell's botoxed and sadly altered faced makes her look like Michael Jackson near the end. -Not enough spiders. -When every actor flubbed a line (and they all did at some point, some more than others) it seemed like the director just waved them on to continue. -Seeing the same forty or so extras in nearly every crowd scene (watch for the red hoodie). -Not enough goddammed spiders! I could go on, but it's hot in my apartment right now. PROCEED WITH CAUTION.",
         "Back in the day giant monster movies were all the rage thanks to King Kong and Godzilla. Now they seem to only pop up from time to and usually in low budget films that don't offer all that much. The latest Spiders, is the latest creature feature to crawling onto DVD and VOD, but will it be enough to make your skin crawl or be just another generic SyFy channel style cheese fest. Spiders follow a city under siege from a new species of poisonous spiders as they mutate into gigantic proportions after crashing to Earth on a destroyed Soviet space station. If the plot sounds ridiculous, it is, but that is usually the case in these sorts of films. If you can't separate yourself for the silly nature of things to come then you shouldn't be investing your time into this film. That being sad, Spiders is a lot of fun. Believe it or not, it doesn't come off like a cheesy SyFy channel as you would expect. It shows that this film either had a decent budget or was just used wisely to make it work as opposed to just slapping something together. The story is pretty straightforward and works for what they are trying to accomplish. It's very reminiscent of the film THEM where as the military are forced to take on giant ants, but here with spiders. It starts off a bit slow initially, but quickly kicks into gear to let unleash the spiders on the city with each getting bigger than the next. Wisely they seemed to have spent a good amount of the films budget on the Spiders themselves which makes this film work even better. The spiders look pretty cool, with only a couple times that they feel CGI. There are some great classic giant monster shots, including an ariel shot of the giant spider running through the city complete with tanks and spotlights that is really cool. Make no mistake this is a silly monster movie and doesn't try to be anything else. It works because they take it serious in an attempt to create a fun monster movie and succeeded. There are not major stars here and the acting is average, but if you love monster films, then give Spiders a shot when it hits DVD and VOD in March.",
         "By the time the credits roll you've just had quite enough of the infestation. Spiders (avoid the 3D if you can) starts off on a passé premise and one or two scenes that makes your skin crawl, but any spider movie would do that. The Actors are horrible. The mother (female MJ) has the worst timing and insincere line delivery ever witnessed on screen. She whines, is pathetic and really did drag down what would have been a 90min laugh to a drone. Father, train technician and giant spider killer on the weekends. Totally believable. The CGI should have won us over but it was so inconsistent my head hurt. The size of the Queen changed from a 3 storey gargantuan to barely the size of a subway train dueling with our Hero. WTF?! The military was so inept I'm surprised they knew which end of the barrel bullets exited. And finally the end scene. A spider can take Rocket fire, mortar, bullet hail, Tank fire and Apache gunship missiles, but turns in train track kill? But the little spider that caused all this survived a fall from outer space!! My head hurts.",
         "When a meteor shower hits an old Soviet space station in the orbit of Earth, parts and debris crash into the New York subway tunnel near the Noble Street Station. The traffic controller Jason (Patrick Muldoon) sends his colleague Jimmy (Atanas Srebrev) to inspect the damage but soon he is found dead. The doctor finds a bite on his leg and eggs inside his body, and Jason takes one of them to ask his wife Rachel (Christa Campbell) to test in the laboratory where she works. When he goes with the subway security team to the location where Jimmy was found, they discover a nest of strong and carnivorous spiders. Meanwhile Col. Jenkins (William Hope) and the Russian scientist Dr. Darnoff (Pete Lee-Wilson) discuss the special breed of spiders genetically developed in the space with zero gravity that would build a powerful nest that would be used in military purpose. Further, they need the queen's egg that Jason gave to his wife. Then and he lies to the population telling that there is a deadly virus in the neighborhood where Jimmy was found and they hunt Jason and his family. When they recover the egg, Col. Jenkins put it in the nest to raise the queen and decides to execute everyone that is aware of the spiders. Will he succeed in his plan? \"Spiders\" is a film with a lame and stupid story from the beginning. How can the colonel lie and execute people in a democratic country the way he did? By the way, why execute people? Just to keep the spiders in secret? In a situation like that, why keep powered trails in the subway. The spider queen can resist to machine gun, bazooka, but a traffic operator is capable to contain the giant insect with a steel bar. The corny conclusion with husband and wife forgetting the divorce is also awful. The cinematography and the effects are reasonable but the acting is terrible. My vote is three. Title (Brazil): \"Aranhas\" (\"Spiders\")",
         "Bad acting in a story filled with plot problems, it moves slowly and didn't even scare my wife who is terrified of spiders (which was my main motivation for renting it). The only redeeming quality was that it was actually so bad that we laughed to the point of tears at a couple spots. My favorite moment in the movie is when the main character is surrounded by a s.w.a.t. team and slowly backs away and then successfully runs away without one soldier managing to fire a single shot. The other moment I enjoyed was when the main character fights the mother spider with his fists after tanks, machine guns, and missiles failed to do any damage...sure that makes sense. This movie really doesn't deserve ten lines or ten minutes of your time, but alas my displeasure desires to have a voice.",
         "Spiders (2013) * 1/2 (out of 4) Another \"big monster\" movie with this one here centering on a Russian space station that crashes into the subway system of New York City. At first the \"issue\" seems to be clearing itself up but soon giant spiders are on a killing spree. SPIDERS somehow managed to get a theatrical release, which is kinda strange considering this really isn't any better than the type of monster pictures that show up on SyFy week after week. This is certainly far from a horrible film but I honestly couldn't recommend it over countless other low-budget \"B\" movies that I've seen here the past decade. At least with the movies that you see on SyFy they are cheap, fun and offer up some sort of badness. SPIDERS, on the other hand, really isn't all that fun. The title of the movie should have been \"Walk Around and Talk\" because that's pretty much what happens throughout the running time. We're introduced to our \"heroes\" who pretty much argue with one another as they walk through the streets of New York seeing all the destruction. As for the spiders, the effects are slightly better than what you'd see on SyFy but at the same time they're still pretty cheap and aren't very convincing. The look of the spiders aren't too bad as they're at least mildly entertaining. Of course, they were in 3D in the movie theater so watching at home I wasn't able to judge that. The death scenes in the film are mostly forgettable and there's just nothing special to any of them. The PG-13 rating certainly holds the film back from being \"more\" and, again, the stuff you see on SyFy is better.",
         "I can't believe that I stuck out this movie and wasted 90 minutes of agony on this movie. I'm one of the suckers that keeps watching to see if the movie by some miracle gets any better. The CGI gets worse as the movie progresses and the storyline gets more unbelievable with every passing scene. It would be OK I guess if the script didn't take itself so seriously, but even if I was stoned beyond comprehension I would still find the movie a POS. Steven King's \"IT\" boasted a better spider and it was built by hand. The characters at the start display some promise, but the minute the spiders appear everything implodes into one big steaming pile of audio-visual landfill. Utter, utter garbage",
         "This is one of the worst films I have ever seen in my 35 years, and the sole reason I signed up for the IMDb account. Consider this review my personal therapy to get this filth out of my system. I wanted to see this film because Spiders in 3D sounds tantalizing, right? Who wouldn't have enjoyed the classic Arachnaphobia in 3D? The filmmakers must have decided it was tantalizing too. What a genius way of selling a worthless, pointless and talentless film. Here are 10 reasons why this disaster of a movie should be avoided: a) The doctor who performs the autopsy early on probably skipped Biology class. I quote: \"some insects, such as spiders, plant their eggs in a foreign host\". Well, when I was four, I learned that insects have six legs, spiders have eight. b)Pete, or Jason, or ... who is who, anyway? Why do they have Patrick Muldoon's double playing his friend Pete? I can't tell them apart. They have the same stupid goatee. They both look like porn stars. c) The whole cast looks like porn stars. Every time someone begins a dialogue, I expect them to start undressing. There really is no other way to describe the horrible script, the deplorable acting and the atrociously unnatural conversations people have in this movie. d) Phoebe, Jason's other daughter... oh wait, no, is she the au pair? Why does she have a Russian accent? Oh, OK, she's the director's niece. Got it! e) \"Adam put in an extra shot of expresso.\" Did he really mispronounce espresso? I have this idea: let's place the movie's setting in the early 1990's, and let's make it more realistic by having characters say 'expresso' instead of espresso, and, oh! Let's give them goatees. That way, it's easier to explain the references to the Soviets, and we don't have to make that many changes to this cheap script that's been lying around since 1985... Besides, back then, people didn't know the difference between spiders and insects. f) \"The queen is always implanted in the first host.\" Yes, did you not know that? Spiders can communicate through telepathy, so there's no misunderstanding about who bites first. 'Everyone, I'm gonna bite this guy Jimmy here, so that'll be the queen, you hear?' g) Oh, yes, spiders have a queen. She's like the boss. But all spiders lay eggs, apparently. At least there's no gender discrimination. h) The spiders look like they have been photoshopped from the 70s. They look utterly ridiculous. i) I guess the filmmakers realized this a little late, so they changed the script: \"They look like huge spiders, but that is just the form that they are inhabiting. Twenty years ago, we discovered a spacecraft...\" OK, so they are really aliens dressing up as spiders. j) Don't even get me started on the 3d. I suspect it's short for 3 digit budget. I suppose I could go on, but I ended up fastforwarding through much of the film. But it's not all bad. The length is the film's one redeeming quality, clocking in at one hour and thirty. It's an hour and a half you'll want back, though.",
         "OK. Cheesy? -Check Goofy? -Check. I enjoy low-budget monster flicks. One very serious question. How, in an industry filled to overflowing with passable actresses who can at the very least simulate believable expressions and the occasional emotional response does Ms. Campbell get cast? Her vacant expressionless face combined with a spectacular lack of inflection, timing and anything resembling acting is worse than a second-day community college acting student. This movie didn't have much of a chance but the damage inflicted would have been less if they would have picked a random name in the LA phonebook. Maybe, just maybe, she was distracted and unable to \"find her motivation\" ... no, forget that. She's just awful.",
         "As a person who always had a love for monster movies, and spiders in particular, then it was a thrill to stumble across this movie. Initially I had feared that it would have been much worse than it actually turned out to be, as the genre of monster movies tend to turn out to be campy, goofy and usually have horrible effects that are just downright painful to watch. This 2013 \"Spiders\" movie, however, did come to prove my initial fears wrong. Especially because the spiders in the movie were actually quite nicely animated and looked realistic enough. Well, as realistic as you can go when dealing with a 6 foot arachnid. The creature designs were nice and held lots of good details, and it was greatly helped along the way by the good CGI. One thing did bother me though, and it was the sounds they opted to put on the spiders. Growling, screeching and hissing, come on now, seriously? It just gave the spiders a cartoon-like quality that didn't really help them along in any way as for being menacing or monstrous. About the storyline, well it is fairly straight forward textbook scripting here; a top secret non-American experiment that took place it outer space crashes down on Earth - in New York, of course - and with it came the mutated arachnids that grow at an accelerated pace, becoming a threat to all of New York in record time. And it is up to a small handful of people to put a stop to this outer worldly threat before it is too late. Bam. Bam. Bam. Straight out of the Hollywood 'how-to-make-a-monster-movie' manuscript. Campy story? Check. Unlikely heroes? Check. Grotesque monsters created by the hands of science? Check. Super predictable? Check. Everything you need here for a basic monster movie is present. As for the people in the movie, well then it was fairly ordinary performances here, with mostly no outstanding performances, aside from possibly Patrick Muldoon. People did good enough jobs with their roles and characters, but there was just an general sensation of lack of enthusiasm lurking behind some performances. Despite not adding anything new or jaw-dropping to the genre, then \"Spiders\" does provide good entertainment, because it is a fast-paced movie that lets you see the spiders a lot and in good detail. \"Spiders\" is a no-brainer; the type of movie that just lets you disconnect your brain and just ride along for the fun and entertainment. If you enjoy monster movies, then \"Spiders\" is well worth a watch.",
         "Okay, if you like trash, this might be the movie for you. The 3D is AWFULLY converted and makes your eyes bleed without any visible depth... The acting is horrible. Christa Campbell cannot move her face because of all the botox, and Patrick Muldoon has seen better days and there is a sense of desperation radiating from him during the whole movie. And no, it does not have to do with his role. The story is on SyFy Channel level, the FX are slightly better than usual in a production like this one... If you have to see every monster movie on the market, than give it a try, but you have been warned. Don't expect \"Eight Legged Freaks\" from outer space as the movie takes itself so seriously, that there is not the slightest sense of humor in this production. At least not wanted one. The second star is only for the decent special effects... What a waste of money...",
         "I'm a sucker for spider movies. Sadly, like poker films, there are so few good ones. So little, in fact, I believe there might be just 1-2 really good to great ones in either genre. This is not one of them. I guess I am drawn to spider movies because the little arachnids frighten the sh|t out of me. The real ones, that is. So when a movie, like 2013's (bland of a title) Spiders makes them all completely unrealistic, I barely flinch. Mercifully, the first half of this spider-invasion film is more up my alley in terms of threatening little eight legged freaks. But, as all wannabe Syfy-movie-of-the-week flicks go, the little terrors must grow into human sized (or bigger) beasts. That's all you really need to know in this routine sci-fi, When-Animals-Attack movie. You go through the motions: the beast(s) crash land on earth, no one knows what's happening, one person dies, then more, hero with a history with the heroine investigate, government intervenes, etc, etc. Age-old tale. While it wasn't a complete and utter waste, it's neither recommended at all. Stick with 2002's Eight Legged Freaks or 1977's Kingdom of the Spiders – both of which happen to take place in my lovely state of Arizona. Huh. No wonder I frighten so easily from these baddies. * * * Final thoughts: It's much more distracting when you don't pause a movie to find out who the lead of the film you are watching and just keep wondering where he's from. In this case, I finally did remember, and was confirmed later on, our hero, Jason, played by Patrick Muldoon, was on Melrose Place. Yep, a lot of my viewing time here was spent on trying to place him than the movie at hand.",
         "Most of the budget went on the effects, I think, and trust me, they aren't all that good. I'm really trying to think of something positive to say about this movie, but I'm struggling. I've seen a lot worse than this. A lot worse! But this ends up being a nothing movie. Why? Because you care NOTHING about the characters. They are beyond wooden. Styrofoam would be more apt. A collection of cliché-ridden stereotypes that would make an 80's blockbuster movie go red with embarrassment. Patrick Muldoon plays the stat hero, out to save his family from the deadly arachnid menace. Except, half the time, he delivers his lines so badly, I wondered if he really knew what was going on. Christa Campbell. Good God! That woman had just the worst role ever to play. Screaming, hysterical woman! There aren't many scenes where she isn't just blubbing at the camera and whining incessantly. Trouble is, none of it was convincing. Somebody check her into both over- and under actors anonymous! Bill Hope. Clearly he had none, which is why he took on this part. Bungling military officer. Hasn't he played that somewhere before? Oh no, wait, that was a real film. None of the characters are particularly likable, which means you don't care what happens them. If you don't care about the characters even a little bit, then you are in trouble. Then there are the effects. I suppose they're not too bad. Again, I've seen far worse. But whoever decide to give the spiders fang-filled, comedy maws, needs a swift kick in the nutsack. They are beyond ridiculous, trust me. You can't take them seriously. The science behind the spiders is ropey, to say the least, as it is throughout the movie in general. I don't expect too much in the way of realism in such movies, but a nod towards actual reality from time to time would be nice. Along with the crazy monster mouths and the dodgy science, the spiders all seem to growl and whine and make all kinds of odd noises that make them comical, to say the least. Whilst I'm on the subject of noises... The score is at times extremely aggravating. Sometimes you get heroic, stirring music, but often you have to make do with jarring, discordant sounds that someone believed enhanced the film. News flash! It doesn't! It's just grating. At times, this jangling blends perfectly into the background sounds of the scene, leaving you wondering whether the noise is part of the score, or an environmental effect. Not good. I'm not sure whether they wanted to make a comedy movie here, or a serious monster movie. It seems a little of both, but unfortunately, not enough of either to make the film work on any real level. I guess I should have expected the worst, given the rating here on IMDb, but I'm all for giving films a chance. Sadly, this one fell short of the mark. My advice. Watch Eight-Legged Freaks. It actually knows what sort of movie it wants to be and manages it perfectly well. Spiders, by contrast, is a bit of a mess. Not really worth the effort.",
         "good god can this acting get any worst and these spiders, really with the teeth? the mom is the most annoying whiny actress i have ever seen. good god i'm contemplating punching the screen every time she is on with her whining and the horrible acting done by the dad. seriously dude how is the mom supposed to run with you grabbing her arm? i would assume that the military would be smarter in their weapon usage. if the M4 doesn't work maybe bust out some larger caliber bullets? and they killed the hottest actress in the movie... that's really going to make people watch this to the end. NO BOOBS :(. seriously mom woman get your sh** straight, stop the whining man up for your child.",
         "An interesting idea with a mixture of Eight Legged Freaks, Tarantula and Mimic. Sadly really badly done. The spiders were not bad apart from the fact spiders don't have teeth and growl but one has to suspend belief a bit with these kinds of movie so that's no big deal. No the worst part of this tripe is the acting. Or lack of it. It actually contains several 'actor's who once appeared in decent films with Gorman from Aliens and the pilot in Starship Troopers. But acting had a day off for this and we were reduced to some of the worst non acting in a film ever. Not just the leads but those who had bit parts and even extra's. People were standing around waiting for their cue with a look of total disinterest on their faces. Leads delivering lines like they were reading them from cue cards that had ran in the rain. Watch the cop waving people out of the subway who looks bored stiff and waves even when there is nobody to wave. The soldiers look less realistic than ones you could find in boxes back in the 70s. Those plastic ones had more acting ability. But the worst acting goes to the lady who played the wife and the woman who was the doctor doing the autopsy. If you are getting paid for these kind of useless films the least you can do is look mildly interested for the audience. Yes it's a low budget effort and most of the cash spent on the spiders but acting ability is important if you plan to charge people a tenner when you flog this as a DVD. The ending which was swiped from Mimic was pretty dull and the most terrifying thing about Spiders is the very real threat of a Spiders 2.",
         "Star Wars; Avatar; Life of Pi; these films and more have spoiled viewers with their gorgeous visuals and superb special effects to such an extent, that when a B-grade film like Spiders is released, the criticism bestowed upon the visuals is often incredibly painful. Where once there were snakes on a plane, the premise of this feature begins with spiders on a space station. After a chunk of rock slams into the station and comes to a stop in the middle of a New York subway, a group of spiders, which quickly start to exponentially grow, hitch a ride, only to eventually discover how nice humans taste. From the moment the subway comes into the story, the feature begins to immediately go somewhat downhill, the initial conversations being about as lively as a grave. The acting is never exactly fantastic, but then neither is the dialogue the talent are made to read, however there are occasions where you will be delightfully surprised. To have a man who works at a train station become the lead protagonist seems like an odd choice in an action horror film, and it is further strange that the military, led by William Hope (Aliens, XXX, the Detonator) who quickly become involved, are virtually powerless to stop the over-large creepy crawlies; assault rifles; miniguns; rocket launchers; none of it measures up to machinery, that on occasion seems to make short work of these abominations. The reasons for attempting to keep the spiders alive, the way the city empties so quickly, among a number of other occurrences, does not always make a wealth of sense, and the lack of any real violence does not help matters either. Many horror films paved with blood I find to be overrated, but in this film, a dash of arterial red here and there might have made all the difference to accentuate the threat to human life. What is most entertaining about this film however, believe it or not, are the effects. The way the spiders interact with the environment, whether they are knocking items out of the way or moving across surfaces, these little details make all the difference. None of it mind you, has the potential of larger budgeted films, but with this in mind, the developers do a brilliant job with what they have. I recommend borrowing the film if you can, and if you choose to buy, make sure it's under ten dollars. The film can be cheesy, and on occasion dull, but the action scenes, especially towards the end, are worth sitting through.",
         "Please.......don't waste your time on this abomination of motion picture. Terrible CGI, but that's not what makes this muck unwatchable, it's the terrible, gutless and almost amateur acting by everyone in this movie....and I include the extras in that. In one scene people panic run from the subway, and they aren't even running LOL. So again, please make the world a better place and avoid this pile of poop. Kind regards.. .....Mickey.:) Oh and Arachnaphobia was like a masterpiece compared to this.",
         "Cheesy, the plot is full of holes, but all in all a good fun movie, especially in 3d. The effects are really good for a b-type movie, At times the spiders are downright creepy. The acting was good on the main characters, with supporting actors being hit and miss. The portrayal of The \"Secret government\" cleanup operation was brutal and scary.I watched with kids (no bad parts) and we all thought it was a good movie. Certainly better than previous reviewers have indicated. 3d version only: The 3d encoding on this movie was much better than most low budget 3d movies, there was some ghosting in certain backgrounds, and in certain dark scenes shading seemed to be different from left eye to right eye, but they were brief glitches over almost before you noticed them. All in all a good movie all around.",
         "SPIDERS opens with bits and pieces of an old Soviet space station falls to Earth and crashes down into the New York city subway like a meteor shower. When one of the staff members from the New York City Transit Police is found dead, one of the supervisors, Jason (Patrick Muldoon) hurries down to the subway to find out the truth. He subsequently discovers from the autopsy report, that his staff member's death is caused by a bug bite. And that bug turns out to be one of the genetically engineered spiders, which are supposed to be part of a top-secret Russian experiment. Now, the U.S. military force, lead by Colonel Jenkins (William Hope), wants to harvest them for weaponry. But in order to shield the truth from the public, Colonel Jenkins have the whole affected area immediately evacuated and declares that there are some sort of a new virus spreading around. Meanwhile, the spiders in the subway begin to mutate and multiply all over the place. Jason, who already have a rough day dealing with a unusual situation at the subway as well as going through a divorce with his estranged wife Rachel (Christa Campbell), is forced to step up when his precious daughter Emily (Sydney Sweeney) is in danger. Judging by the synopsis above, SPIDERS looks like an entertaining B-grade sci-fi/monster genre that mixes with TARANTULA (1955) and MIMIC (1997). I mean, it supposes to be fun watching a bunch of mutated spiders and a giant spider (as shown in the poster of this movie) attacking people in New York City. However, this movie ends up more like a snoozefest. Apparently genre veteran Tibor Takacs does the impossible for botching such potential premise with his flat-footed direction. I appreciate the fact that Takacs sets the first half of the movie in a deliberate pace so he can find sufficient time to tell a story and explore his main characters. However, the story is awfully pedestrian while the acting are all badly acted. Patrick Muldoon gives an unenthusiastic and wooden performance as Jason. Christa Campbell fares even worse as Rachel, who often act with blank expressions Even by the time the second half starts to feature plenty of action involving spiders, they remain terribly uninspired. The so-called suspense and tension are almost non-existent, while Joseph Conlan's score is seriously misguided. As for the special effect, those mutated spiders are quite reasonable to look at, especially given its limited budget. But too bad the spiders are given zero personalities. Avoid this like a plague.",
         "0.01/10 I'm a big fan of the first Spiders film, it was cheesy, fun and very entertaining and when I heard about this remake, I was like \"Spiders got a remake, I wasn't expecting that,\" so I watch this movie, I thought it'll be fun, but man this movie p***ed me off, this movie is hand downs the worst remake ever made, this movie has no characters, none of the characters have personality, or anything that I found interesting about these characters. The whole movie was boring all the way, it was making me fall asleep. The spiders in this movie, don't look like spiders, they look like over-sized ticks, the CGI was really awful in this movie, speaking of CGI, this movie is filled with very bad CGI, like for example there's a scene when some people jump through a window, and they use CGI for the broken glass pieces. This movie is taken way too seriously, it tries way too hard, but then it fails. The dialouge is awful, the effects are awful, and the direction for this movie was horrendous, they take PG-13 rating way too seriously, so yeah this movie is an earth sized piece of s***t, don't see this movie, go see Spiders (2000), stay far away from this remake.",
         "Those damned Russians! First, they were responsible for the ongoing Cold War that would scared me silly throughout most of my youth. In my teenage years, it was White Russians that were my downfall at any local establishment with a liquor license. And now, it is a Soviet space station that has crashed in New York City that is resulting in giant venomous spiders. Damn you Russians. Damn you, Damn you, Damn you! Of course, the third of those examples never really did happen. Or at least not on anything outside of a Fox News Report (apparently it was Obama's fault too). But it is the idea behind the new monster film, Spiders from director Tibor Takács, who back in 1987 surprised us with a little Canadian film called The Gate. Spiders stars Patrick Muldoon (Melrose Place, Starship Troopers) as Jason, the father figure and potential hero of our film that has to fight both the military presence on the streets of New York and the rampaging and irate arachnids as he attempts to free his daughter from a quarantined zone within the city. So he will run, jump, dodge and evade the obstacles in his way leading us to a conclusion that is hardly in doubt for a movie of this genre. Converted into 3D, Spiders is a step up from usual Syfy movie-of-the-week madness. But that bar has been set so low that patting anyone on the back is hardly necessary. The spiders look campy and hardly creepy. And the whole idea is really just an excuse to make a $50,000 looking Them! A few special effects could be considered 'passable', but in general, everything looks computer generated and I have seen a man in a Godzilla suit destroying Tokyo look more realistic. Muldoon seems destined to remain in CGI-monster direct-to-VOD films for the foreseeable future and has worked with the director once before fighting a different type of spider with Ice Spiders in 2007. He looks tired yet invested in Spiders and is hardly the reason why the film fails. That fault can go to the lack of any character development, lack of good special effects, lack of plot or purpose that dogs this film from start to finish.",
         "How these people qualified as actors no one knows. The acting was awful. This girl kept doing this annoying scream and don't get me started on the ending. Oh yesss we defeated a spider let's link arms and walk down the street. That sums up the ending for you. The dudes friends died you might as well played happy by Pharrel Williams.....he had no emotion hellllo your a human not a robot. Please do not watch it and save your self from a painful death. I know they must have worked hard on this film but come on you have all that money and you create..... that. I was really disappointed.... A great night with my family was spoiled when we could have been watching the 300 amazing films we already have. How this film ever got onto DVD I never know. If you chose to ignore me... Fine but enjoy your slow painful death. Me and my dad where ready to jump out the window. In fact it's sooo funny because it's sooo stupid. Do not watch it if you know what's good for you.",
         "After a Soviet space station crashes into a New York City subway tunnel, a species of venomous spiders is discovered, and soon they mutate to gigantic proportions and wreak havoc on the city. Where does this film get placed in spider film history? One thinks it will end up a footnote or perhaps forgotten altogether (and the world would not suffer a loss from that). Many great spider films exist, including \"Arachnophobia\"... heck, even \"Big-Butt Spider\" probably deserves some sort of recognition. This one, though? Even by cheesy science fiction standards, it is little more than a distraction. Hardly worth even attempting line here.",
         "\"Just when I thought I'd seen every possible way to screw up the Monday commute.\" While getting ready for his day at the subway Jason (Muldoon) and his crew are shocked when the whole building shakes and one of the trains is stopped. After investigating the damage he finds something strange and not at all what he expected. I was expecting a Scy/Fy channel type movie going in. I will admit that the quality was way better then I was expecting but the acting was about the same. There really isn't much to say about this. The effects were better then I expected. The movie is essentially what you would expect. Giant spiders attacking the city while parents try to save their kid from them. Not terrible but not as fun as I was hoping for. Overall, not as bad as I expected. I give it a C+.",
         "Atrocious acting. As one reviewer said, Botox rules OK and none of the actors move their faces. The script is laughable and the acting so wooden its hard to tell some of the cast from the props. The special effects are laughable. Why would a spider make a roaring noise? Further, all the spiders appear to be bullet proofed, but the \"soldiers\" continue to fire at them even though the bullets are are clearly not having any effect and don't even mention the helicopter pumping round after round into the queen spider, which also eats a couple of cast. Amazing since spiders don't have that ability. Something also strange is that the queen also appears to only have 2 eyes and halfway through the movie most of all the other spiders disappear. Apparently they also got fed up of the movie. In fairness, the sort of movie you'd watch because you think this can't get worse, but it does. Won't spoil the ending but just say its indescribable. Work out how the \"hero\" manages to survive. Defies all logic."
      ],
      "genres": [
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Millennium Films"],
      "summaries": [
         "When a meteor shower hits an old Soviet space station in the orbit of Earth, parts and debris crash into the New York subway tunnel near the Noble Street Station. The traffic controller Jason sends his colleague Jimmy to inspect the damage but soon he is found dead. The doctor finds a bite on his leg and eggs inside his body, and Jason takes one of them to ask his wife Rachel to test in the laboratory where she works. When he goes with the subway security team to the location where Jimmy was found, they discover a nest of strong and carnivorous spiders. Meanwhile Col. Jenkins and the Russian scientist Dr. Darnoff discuss the special breed of spiders genetically developed in the space with zero gravity that would build a powerful nest that would be used in military purpose. Further, they need the queen's egg that Jason gave to his wife. Then and he lies to the population telling that there is a deadly virus in the neighborhood where Jimmy was found and they hunt Jason and his family. When they recover the egg, Col. Jenkins put it in the nest to raise the queen and decides to execute everyone that is aware of the spiders. Will he succeed in his plan?",
         "After a Soviet space station crashes into a New York City subway tunnel, a species of venomous spiders is discovered, and soon they mutate to gigantic proportions and wreak havoc on the city."
      ],
      "budget": 7000000
   },
   "movielensId": 132352,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-02-08",
      "dvdReleaseDate": null,
      "directors": ["Tibor Takács"],
      "runtime": 89,
      "movieId": 132352,
      "title": "Spiders",
      "mpaa": "PG-13",
      "actors": [
         "Patrick Muldoon",
         "Christa Campbell",
         "Shelly Varod",
         "Jon Mack",
         "Misha Dibono",
         "Pete Lee-Wilson",
         "Owen Davis"
      ],
      "imdbMovieId": "1659216",
      "originalTitle": "Spiders",
      "genres": [
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": ["oOZ2OtNDscA"],
      "plotSummary": "After a Soviet space station crashes into a New York City subway tunnel, a species of venomous spiders is discovered, and soon they mutate to gigantic proportions and wreak havoc on the city.  Starring Patrick Muldoon, Christa Campbell, directed by Tibor Takacs. Originally called \"Spiders 3D\" but now simply \"Spiders\"",
      "tmdbMovieId": 164331,
      "avgRating": 1.77273,
      "releaseYear": "2013",
      "numRatings": 11,
      "posterPath": "/ijvaFP1kX7LiymeJAJxJ74FGoJ2.jpg"
   }
}