{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "killing",
            "id": 627
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "violence",
            "id": 14819
         }
      ],
      "imdb_id": "tt3742284",
      "video": false,
      "title": "NH10",
      "recommendations": [
         82698,
         398535,
         353898,
         52696,
         320295,
         191726,
         332835,
         118051,
         323517,
         374173,
         296690,
         192558,
         336211,
         252841,
         325138,
         79464,
         24827,
         251626,
         139521,
         339274
      ],
      "backdrop_path": "/4A6QmdOzfFMe2HSIi2BZMHMJOXy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Meera",
               "gender": 1,
               "credit_id": "5502f901c3a3685b9e0042e7",
               "name": "Anushka Sharma",
               "profile_path": "/vFOAxcCmbGVw1Txo10LXgOT6fbI.jpg",
               "id": 81928,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Arjun",
               "gender": 0,
               "credit_id": "5502f8dd9251414ea60026c3",
               "name": "Neil Bhoopalam",
               "profile_path": "/64wKcMmzwtxEbrIM9SNfBdnxtxw.jpg",
               "id": 557212,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ammaji",
               "gender": 1,
               "credit_id": "5502f8f9c3a3685ba6004af4",
               "name": "Deepti Naval",
               "profile_path": "/nUMAIUxjrnxHEOgAudLbst2IIqZ.jpg",
               "id": 150220,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Satbir",
               "gender": 0,
               "credit_id": "5502f8ef925141282f003c20",
               "name": "Darshan Kumaar",
               "profile_path": "/rwpM2L3RuG6jYn93FANH7AzMxo4.jpg",
               "id": 1439075,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Fauji Mama",
               "gender": 0,
               "credit_id": "5502f8e69251413da100427a",
               "name": "Ravi Jhankal",
               "profile_path": "/DCdZEeqyCqL0m4V8hu3XLECm6t.jpg",
               "id": 944430,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5502f8bcc3a3685b96004a06",
               "name": "Navdeep Singh",
               "profile_path": null,
               "id": 231004,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5502f8cc925141282f003c18",
               "name": "Sudip Sharma",
               "profile_path": null,
               "id": 1439074,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a1501d7c3a368074200729d",
               "name": "Jabeen Merchant",
               "profile_path": null,
               "id": 1927833,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.691344,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 330431,
      "vote_count": 31,
      "budget": 0,
      "overview": "A woman, stacked against all odds, manages to not just stick it out but indeed give it back.",
      "similar": [
         74997,
         73861,
         1696,
         979,
         156022,
         281957,
         445954,
         398175,
         3134,
         588,
         37645,
         681,
         769,
         281,
         395834,
         8456,
         10781,
         400,
         341006,
         994
      ],
      "original_title": "NH10",
      "runtime": 115,
      "poster_path": "/1PPUgbQE9UVrgPyMif8urLSIKWb.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [
         {
            "logo_path": "/dEpilNgoW7tElN3xacXckHxGXbo.png",
            "name": "Eros International",
            "id": 3653,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Phantom Films",
            "id": 7435,
            "origin_country": ""
         }
      ],
      "release_date": "2015-03-12",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "No turning back.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Navdeep Singh"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Sudip Sharma"],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt3742284/",
      "coverLink": null,
      "actors": [
         "Anushka Sharma Kohli",
         "Ravi Beniwal",
         "Siddharth Bharadwaj"
      ],
      "reviews": [
         "First things first, I was a little doubtful of this movie when I was purchasing the tickets because of all the negative reviews I had been hearing on the radio, on TV, and from friends, etc. Turns out, these were the best 100 bucks (yes, 100 bucks; perks of living in Greater Noida) I have spent in a while. The movie was brilliant! A high society couple hailing from a metropolitan of North India head out with nothing but a great weekend on their mind. Little do they know that this adventure road trip of theirs would be met by an incident, pertaining to one of the many social evils that still prevail in the rural parts of India, which would turn their simple journey on National Highway 10 (often abbreviated as NH 10) into a life-altering experience. I was seriously blown away by the acting and direction, which defy most typical Bollywood movie template where the protagonist fights off three dozen gravity-defying goons of the villain but its a neck to neck battle with the antagonist himself, while his lady love (or rather a sidekick with almost no role to play in the movie) dances around needlessly and both survive in the end with a happily-ever-after ending. Obviously, it is seriously not meant for people who love Chennai Express-type movies. If you still decide to give it a shot, expecting even a pinch of romance, believe me you will be disheartened and disappointed with it, just like the couple sitting behind me who walked out of the theater in under 15 minutes. I liked it because it had a beginning, a mid, and an end. And all the three were properly executed, and did not completely defy logics OR physics, as is the case with most action Bollywood movies nowadays. Anushka was outstanding as the main lead, and other characters were pretty believable too. Nothing felt out of the place. And since its kind of a thriller, I really enjoyed the natural and expected behavior from the actors and I must say that in those regards, this movie even pips some Hollywood same-genre movies in which people are shown doing dumb things and act as if they are devoid of any and all common sense when in a life-threatening situation. I must say I was intrigued as well as immersed in the movie, especially in the beginning and in the end. The cast as well as the director were successful in keeping me from getting bored throughout the movie. And so, I hereby declare it a movie which is a bang for your (the no-nonsense and serious movie-goers') buck, and deserves my 9 rating stars. Just a heads up, the movie is rated A, probably because of the one cuss word which is muted out towards the ending. Or maybe its because of violence, which most reviewers here are dubbing as \"not- for-the-faint-hearted\" *shrugs*. But meh.... No nudity or obscene shots, it is okay to watch it with your family, in my opinion.",
         "First, let me say I am NOT Indian, but I have watched Bollywood movies for over 10 years--a lot of them. Next, let me say that last year I saw 92 (yes, 92) movies in the cinema--that's not counting movies on DVD or on TV. Now\u0085NH10 is the BEST movie I have seen of all the movies I saw last year and so far this year. I think the comments about it being copied from Eden Lake (which I've not seen) or other movies in this genre might be true to some extent, but that's not fair. Shakespeare copied a lot of his plots from Boccaccio's Decameron. So what? So there have been a lot of other movies about a gang terrorizing a couple? So what? It's how you do it that counts. It's like a football play (American!)--you can have 100 teams run the same play, but one team does it best, and they win. NH10 wins. Yes, you knew something bad was going to happen\u0085but when? How? To whom? And the false leads at the beginning of the film kept me in suspense. Of COURSE Arjun was an idiot-- that's the formula of these types of movies. If everyone were alert and smart, you wouldn't have a good horror movie! But I have to say I almost yelled at the screen, \"No, you idiot, don't leave your gun in the car!\" It's all in the execution. Anushka is one of my favorites, I have to admit. She always plays the strong woman, and Meera was certainly a strong woman. To be the center of the movie and on screen for almost every minute is quite an achievement, and she did it beautifully. It took a lot of skill to keep the suspense up throughout the movie, but it succeeded. There was really no way to tell until the last few minutes how it would all end--it could have gone several different directions. Also I have to applaud the director--and Anushka the producer--for leaving the studio and going out into real world. The Italians discovered this c. 1960, and Indian films would be much better if more of them did it. I know there are difficulties in filming in a crowded city, but there are ways\u0085",
         "Lighting up her cigarette with the matchstick lying deserted from its owner, Anushka, with the slightest hold on to the edge of her sanity and an enigmatic facial expression, picks up the inanimate steel built strut from the ground and with the shrill, clanging sound of the steel being dragged along the concrete road, she lays down the groundwork for her revenge. Navdeep Singh has not only made the most out of a road trip gone wild but has also filled in each of the scenes a continual thrill, of psyche driving in a meandering path of moral uncertainty and of the exceptional screenplay with Darshan Kumaar as the village ruffian and Sharma as the shackle breaker. Keeping itself as the very point of interest throughout its complete time span of a near-2 hour crime drama, the movie becomes more and more worthy of your extol as you seek deeper through the story. While staying perfectly true to realism, NH10, with excellent direction, a finely crafted story and brilliant performances, shines as Singh's undiluted masterpiece. 9/10.",
         "Driven by amazing performance of Anushka Sharma, a cameo by Deepti Naval and well directed by Navdeep Singh, NH10 is an exciting two hour journey, touching upon the rural Haryana, honor killings, patriarchal mindset and women empowerment. Ignoring the poor and senseless build up of the story, where most of the Bollywood movies are weak at, once into the jungle, movie is full of twist and turns. Anushka Sharma, evidently, has put her heart into the movie. With intense dramatic acting, she has taken the movie on to her shoulders completely. Neil Bhoopalam is, unfortunately, forgotten after some time in the movie as it revolves around Anushka Sharma and her struggle with the predators. However, he does well in his bit. Darshan Kumaar does a noticeable job with enough screen presence and is quite good, given his second movie. Deepti Naval lives up to her reputation. The length of the movie is well managed as you cannot keep it exciting with a typical Bollywood length of 2.5 hours.The climax makes a very strong statement with hunters becoming the hunted. However, the movie draws attention to the solid thick line between the India of malls, multiplexes, flyovers, working women and the India of dirt roads, khap panchayats, honor killings and patriarchy.",
         "NH 10- 2015 Director: Navdeep Singh Director Navdeep Singh is back with another gritty thriller. Starring Anushka Sharma and Neil Bhoopalam, NH10 is a thriller based on real-life incidents that exposes us to the harsh reality of life. NH 10 is definitely not meant for typical bollywood audience. It is something different. Something combined with fear, love and how a young woman cope with such troublesome situation. When I downloaded the songs I was not expecting the movie to be SO terrifically awesome because the songs were not very catchy but after watching the movie I was speechless. Year 2014 turned the tables and there were many directors who actually played the role of being feminist and made a lot brilliant movies highlighting women and their issues in our society. In Urban areas of countries like India Pakistan Bangladesh etc Honor killing is considered as a pride but unfortunately it is called HEIGHT OF BEING IGNORANT. Performance-Wise: Anushka Sharma, who also produced the film, delivers a huge, dramatic performance. She displays helplessness with sincerity, but breathers fire when it comes to destroying the villains. This is undoubtedly most power packed performance. Neil Bhoopalam is fairly good in the limited role he appears in. Darshan Kumaar is effortlessly wicked, enacting the chief villain with command. On the whole, 'NH10' is Tough Enough!",
         "NH 10 shows how the sudden urbanization of some previously rural parts of India has led to a cultural conflict between the two. A patriarchal society where women are mere objects with no voice and rights finds it difficult to change and accept women's demand for liberation. Obsession for the male heir has turned females into a scarce species. The impact of the problem has worsened to such an extent that a policeman father who is worried about how he would get his sons married refuses to help the protagonist due to the fear of being socially ostracized. People are killed in the name of honor killings, in a brutal, merciless and animal-like manner with no honor for the dead ones. Read the remaining review on http://rekhadhyani.com/2015/03/14/nh- 10-movie-review/",
         "'NH10' is brutal, frightening & yet powerful. Director Navdeep Singh gives a film, that's often scary & grotesque, but beneath all that, lies a story of courage & fighting back. It may not appeal to all due to its dark theme, but for those who relish on well-done violent thrillers, are sure to have a ball! 'NH10' Synopsis: A young couple's road trip goes awry after an encounter with a group of violent criminals. Chaos & Brutality follows... 'NH10' isn't for the faint-hearted. The sheer brutality depicted on-screen is off-putting & very disturbing. Also, this is a dark film, with absolutely nothing, but darkness all over it. But, the violence & the theme is so justified here, that it works as its trump card. 'NH10' works because the approach to this frightening tale, is given the correct treatment & execution. Sudip Sharma's Screenplay is arresting. You're hooked onto the screen almost throughout, thanks to its tight writing. However, the first 30-minutes, when the story builds up, are dull. Those moments are the only shortcomings of this otherwise well-made film. But, the second-hour & the finale, in particular, are excellent. Navdeep Singh's Direction is realistic & effective. He's handled the film really well. Cinematography is stark. Editing is perfect, as the film wraps up within a 110-minutes. Action-Sequences are gruesome, but well-executed. Background Score is first-class. Performance-Wise: Anushka Sharma, who's also produced the film, delivers a terrific, dramatic performance as the horrified yet courageous protagonist. She displays helplessness with sincerity, but breathers fire when it comes to destroying the villains. This is undoubtedly her finest work to date. Neil Bhoopalam is fairly good in the limited role he appears in. Darshan Kumaar is effortlessly wicked, enacting the chief villain with command. Deepti Naval is absolutely fantastic in a scary cameo. On the whole, 'NH10' is Tough Enough!",
         "Revealing the bitter reality, a film like NH10 can be reviewed by two set of distinctive mindsets. One by the people who have actually lived in those areas personally, feeling the horror and nature's beauty together and the others who have never been to the region but are simply judging the film as a project depicting a harsh realistic truth in a somewhat filmy manner. But keeping the discussion for the later part of the review, as a film, no doubt this is another impressive venture from the director Navdeep Singh, who once again comes up with a script that beautifully incorporates the western inspirations as seen in his MANORAMA 6 FEET UNDER (2007) borrowing much of its inputs from the classic CHINATOWN (1974). Returning to the screen after a long gap of 8 years, this time Navdeep and his writers choose another English film titled EDEN LAKE (2008), add to it the current in-news theme of \"Honour Killings\" and then end it all like a typical Hindi film reminding you of the fiery heroines from the 80s taking their revenge in PRATIGHAAT, PHOOL BANEY ANGAAREY or KHOON BHARI MAANG. NH10 opens nicely with a much focused vision that keeps you guessing about what's going to happen next in its first half. The unpredictable excitement continues till the roadside scuffle happens with a sudden twist that also seems to be a bit foolish and deliberate one too keeping in mind the particular district. The noteworthy lonely locales, brilliant camera-work, natural lighting, minimal-well composed background score and all superlative performances build-up the momentum in a superb manner and you feel like coming on to the edge of your seats repeatedly before the intermission. However a short song inserted just before the interval looks like out of place and then the film as usual goes back to the same predictable as well as monotonous plot of revenge in its second half. Yes, the brutal execution of its finale terrorizes the viewer well representing the woman-power strongly in all the bold sequences. Yet the lack of novel twists and turns in the second hour hamper its overall impact severely and one doesn't feel like watching anything out of the box in real terms as it ends. Having said that, the director's (expected) sharp, intelligent insertions are right there in NH10 throughout its 2 hours of duration. For instance, just watch out the scenes where the husband brings a cigarette pack for his wife on their fun-trip, Anushka rubbing a derogatory word written on the door of a Dhaba toilet, the group of hooligans talking in Haryanvi hinting towards a rape, Anushka lighting up the cigarette just before going for the killings, the kid asking for the missing light in the watch, Deepti Naval cleaning the almirah of her dead daughter and the Daughter-in-law not giving her the ear-machine fearing the consequences. The engaging script and sharp editing progresses well keeping your interest alive before it all goes back to the routine towards the end. And the performances actually add a lot to NH10's overall impact which ideally should have been a song-less venture without using even that single well-written and soulfully sung track in the mid. So it was indeed a relief to notice the much publicized song \"Chhil Gaye Naina\" and many more listed in the end credits not getting featured in the movie as per its dark and bloody theme. Being there on the screen from the first frame to the last, Anushka gives an intense, spirited performance as the victim girl but the act still falls short of anything path-breaking due to the usual, melodramatic and clichéd second half diluting the end result to a big extent. Neil Bhoopalam is fine as the helpless husband and so is Deepti Naval as the mother fighting with her own inner-self. But its Darshan Kumaar who truly excels playing the extremely violent character post his silent, emotional avatar in MARY KOM, along with the actor playing Mamaji. Coming back to the point stated in the beginning, you can easily review NH10 from all cinematic angles if you have never been to the region and don't actually know what happens there in reality and how. But for the ones, who actually know the sad, questionable state of affairs, the whole fight sequence at the road side dhaba turns out to be too filmy or fake since this is not how anyone intervenes in such matters in these specific highways, even if you have a revolver. In fact showing a revolver can even worsen the things, since its nothing more than a toy for that particular region to be honest. Interestingly the fact gets literally proved in the film too wherein the (city) hero has got the revolver but the (village) goons have simply got iron rods in their car to make an attack. For many friends this may sound strange but that's what the shameful reality is, where no heroism of any sort works as falsely shown in the film. So for me, if the scuffle was there through some other natural angle in the dhaba sequence, it would have been much more impressive and realistic. But the present one certainly seems to be a deliberately written scene just to make up a storyline around a socially relevant plot of 'Honour Killings'. Also, when Neil had already called the DGP informing about the serious issue then it was simply fool of him to go after the hooligans trying to teach them a lesson all alone with a girl in that unknown scary jungle. Hence for many it might be a much relevant film talking about 'women empowerment'. But for me it was another of those technically appreciable as well as inspired (well-performed) attempts with a routine second half that fails to deliver the required punch.",
         "\"NH10\" stands for a section of Highway in India where a couple witness a case of honor killing; and their run for life from the ignorant family members of a rural village sets the next two hours of the film which capsules a deadly night the couple gets to endure. In just a small capsule of time the film captures, it tries to powerfully show how honor killings still occur in the villages of India and even police watches it silently. Though the film looks dark and has unlovable moments to watch it with your family, it has a rawness and clarity seldom seen in Indian Movies. Anuska Sharma's performance is the best part of the film who just brilliantly charts the character from a normal urban working lady wanting no intrusion to a furious lady running for life. By the end, you'll feel a harrowing experience of survival when the secured life goes out of your hand and you're on a run. At this point, the film leaves you stunned and speechless. Rating: 3 stars out of 4",
         "Movie like these are not made more often which so openly criticize about what's wrong with our Indian society. This movie will bring out all the anger that you might have kept suppressed all these years regarding the wrong doings of the society. NH10 is a Dark,Thriller,violent filled movie. A must watch for everyone specially for the MPs and all the government officials of India.If you can go and watch PK this movie deserves more appreciation.An eye opening movie which will make you either angry or will keep you stunned.And it always keeps you at the edge of your seat and will make you think the position of the women in a male dominant state. Still wondering why this movie didn't got banned in India .",
         "NH 10 REVIEW: An Unreal Film on Real Issue (Honor Killing) NH10 got very good reviews from our media and critics. But I don't agree much to the other critics review. The movie should be either which should look like a fiction, fantasy like we see movie like Dabangg where a single guy beating many, jumping from buildings etc etc or the movie should look real. This movie is on a real issue, but does not look real at all. Screenplay is kiddish. I remember This is the end movie, things appear when, where and how you want them. 1.) Who the hell will go after goons with his wife, especially when you know they are 5-6 in numbers. 2.) Hero leaves his wife alone in car and goes to fight with goons. 3.) Anushka goes to police station , run here and there, but just can't get a phone from someone to call his family/friends in Delhi or the DSP (their well known). But she prefers to go to the house of the Sarpanch and expect he will help. Looks like she does not know anything about India and does not read newspapers or watch TV news at all. 4.) Anushka, who is clearly unaware of the village streets but chases the hard seasoned goons in a SUV where goons are aware of every corner of streets but they run for saving their life. Even they know that her only strength is SUV, she is not physically strong, then why did not they try to trap the vehicle in a narrow street!? or Even just stand on the door of a house. It has some curb to stop vehicle. Even standing in a corner can save you from SUV and force that person to come out from the vehicle. 5.) There is musical program in village but after so much chasing and drama there is not a single person in village!? 6.) Take a revolver from a mentally challenged guy, when you need it. Nobody is looking on that side and many loop holes.... Basically the movie is planned like you throw things where you need, may be if they need to show an alligator in the last scenes, i am sure the alligator would have come out from a street drain (Naali). I am sure many people will like it because it is on a real issue, but screenplay, direction, plot.....ahhhhhh!!!!",
         "Another movie added to Bollywood rip-off club, why another disaster in such a low budget?? I Watched hell lot of better revenge thrillers in English/Korea/cantonese/French etc.. so I didn't find it to be interesting, rather I felt bore from start to finish except a few minutes in the middle. Climax is a big let down, wth was that? To all praisers, I would recommend to watch original version, Eden lake and decide yourself. The story of NH10 revolves around the life of a modern married couple who go on a weekend on the outskirts of the city, guess you got the rest of it, obviously predictable. So funny to see some guys suggesting it's not for faint-hearts, lol..... I give it 2/10. This is B-grade movie.",
         "NH10 got very good reviews from our media and critics. Because the decided to pay those guys instead of getting a good script writer. Screenplay is kiddish. People don't waste your time and money on this movie, its a complete waste of time and money. The boring story of NH10 revolves around the life of a modern married couple who go on a weekend on the outskirts of the city, then they saw some goons kidnapping a couple and Arjun went to talk some sense to those guys and one of them slapped him so he decided to went to their hideout with his wife to teach 8-10 guys a lesson *brilliant idea bro*. Guess you got the rest of it just like i did and then i left the cinema. Eden lake rip-off. A big let down. 1/10 is more than enough for this piece of ****.",
         "when I enter into the theater I had lots of expectation from navdeep singh. his previous film manorama six feet under was all time favorite movie of mine in bollywood. after reading some very positive reviews from critics the expectation from this movie was very high. but mountain of expectation was vanished in first half when i found this movie with predictable plot and full of clichés. after first half i found that the episode of crime petrol was interesting than nh10. so basically this movie was based on honer killing in haryana. some scenes was very interesting like policeman rejects to help anushka which saw ground reality in haryana. this film absolutely lacks story so after sometime this movie lost its charm. however, this film get some marks on acting and background score. instead of NH10 i recommend go for badalapur which have good storyline and fabulous acting of nawazuddin siddiqui.",
         "Thrillers are like mathematics question, either you get maximum marks or you get zero, there is no scope of pass mark. Screenplay is very kiddies. When they want to add gun in plot, they shown that the male protagonist is very close to Delhi DIG, so he gets easily a gun license but when it comes to their rescue, even after informing the DIG, Police didn't even tried to find out, which is very easy if one has close of a DIG, state doesn't matter. A DIG have enough power to influence any other state Police. If DIG called back and the person couldn't pick the phone, it was enough to make him suspicious, he can easily find out the location and send the help. A person, who is clearly unaware of the village streets but chases the hard seasoned goons in a SUV where goons are aware of every corner of streets but they run for saving their life, Even they know that her only strength is SUV, she is not physically strong, then why did not they try to trap the vehicle in a narrow street!? This type of scene, only a person can conceive who have never visited a village. Fact, running a SUV freely in every corner of a village street is not possible and goons could have hide anywhere and trapped the person because reversing s SUV in streets is almost impossible. Even standing in a corner can save you from SUV and force that person to come out from the vehicle. There is musical program in village but after so much chasing and drama there is not a single person in village!? This musical program was stuffed for showing the village deserted. In introduction scene it's very clear that goons are ruthless but protagonist tried to chase them without any planning and that also just for threaten them with the help of gun!? Why did the person going for honor killing take along a mental retarded person, just for stuffing some thrill!? It is height of naiveness in screenplay. They show in a shot that it is full moon but took this fact for granted in lighting. Every frame is almost bright light. Performance wise Anushka Sharma is just for shouting and limping. Rest are just OK. One love track is melodious.",
         "Well, this is a good try to venture into a new territory , which is covered by some of the Hollywood counterparts. Anushka's performance was good. Darshan Kumaar was amazing. Unbelievable that he played the husband of Mary Kom. In NH10, his character is in complete contrast to the his earlier role. However, he has done a fantastic job. Reminds me of the time I saw Manoj Bajpai as Bhiku Mhatre, and then the contrast irritating salesman- ish role he played in Kaun. Now to the movie. There is really no story as such. Most of the movie Anushka is running with the guys behind her in the dead of the night. We see light right at the end of the movie. That's about it. They tried to create some tense moments, some were successful, some were nothing great. I am not sure why this movie got high ratings. I guess it must be because of the performances of Anushka and Darshan. Overall, if you are curious, just wait till you download ...uh hmm.. sorry, I mean till you rent the DVD.",
         "I was desperately waiting for NH10 as I have been an ardent fan of Navdeep Singh's earlier work in Manorama Six-Feet Under ( probably one of my favourite films) and I would say I was not disappointed with the violent and gruesome thriller that will keep you on the edge of your seat. A young married couple's vacation goes haywire when they intervene in a local gangland's affair on the national highway. The best part of NH10 is it remains true to its theme as shown in the trailer. Welcome to the world of badlands which shows the sad reality, the struggle of a visitor asking for help, the obscure status of women in the village and selfish police officers who barely do their duty. The film is bloody, blunt and gruesome which is very much required in the plot. Hats off to Navdeep Singh for creating the tension with what-will- happen-next era. The length of the film is 115 mins and would not let you blink-your-eyes for a second. Singh also does well in directing the film with raw and rustic background of North India along with nice background score which gels well with the film. On the flip side, couple of scenes were overly-stretched. In a wild desert and dark night, how come Anushka Sharma was able to find Neil back after they were forced to part ways in the beginning of their chase and probably the climax though beautifully shot, similar to the Hollywood thriller Eden Lake, could have been more better executed. Nevertheless, the taut script and editing adds crispiness to the pace. Anushka Sharma steals the show with her fiery dialogues and solid performance. She gets into the character with ease. Watch for her when she patiently waits for gangleader struggling to getup on his feet. Darshaan Kumar will surprise you as the gang leader. Deepti Naval, as usual, is great in a cameo. Overall, Nh10 is one of the most provocative and terrifying edge-of-seat thrillers of the year. Excellent 4/5 www.facebook.com/FilmyChowk",
         "Bollywood, or the Hindi Film Industry (majorly), since the last few years is undergoing yet another shift of trend from the conventional male-centric form of films to more female-oriented films, such as – \"English Vinglish\", \"No One Killed Jessica\", \"The Dirty Picture\", \"Kahaani\", \"Highway\", \"Queen\", and several more. The pulsating words from the acceptance speech of Academy Award winner Cate Blanchett, seem to be making crystal sense now – \"\u0085those of us in the industry who are still foolishly clinging to the idea that female films with women at the center are niche experiences. They are not. Audiences want to see them and, in fact, they earn money. The world is round, people.\" \"NH10\" – a crime-drama venture of Phantom Films and Anushka Sharma – walks the path of the aforementioned. It is a hard-hitting, rustic, grim and violent tale of honour-killings and associated male- chauvinism and caste-jingoism which turns quite horrifying and disturbing at instances. The film does end up defining the 'problem' and the 'solution' – 'of' and 'in' such issues by – acute intolerance, where revenge is the driving force. However, being a production of comparatively fresher crew, costs the film several loose points. Director Navdeep Singh (\"Manorman Six- Feet Under\") executes some intense sequences but overall is only moderately influential due to lack of engaging pace and 'stereotypical predictability' where even the Screenplay, Cinematography and Editing prove to be futile. Sound Design (Subhas Sahu, \"Kaminey\") adds occasional thrills, yet is inefficient and at moments becomes confusing. The Music Composition by a myriad of composers adds modest-individualistic flavor, however, \"Maati Ka Palang\" by Samira Koppikar is distinctively supportive. Supporting Cast provides some respite with Neil Bhoopalam, Darshan Kumaar, Ravi Jhankal and Deepti Naval. The film is a master attempt of delivering realism in its rawness, however, it falls short. Nevertheless, this debut-production of Anushka Sharma would be liked for her acting and approach, especially by her fans. Rating – 6.5/10",
         "I finally saw this movie after deciding to see it for a long time but somehow kept on hold. The plot starts interesting and then from a certain point i thought it was too guessable or if it was totally unnecessary at least from my point of view...What i mean here is ...the couple goes on a escapade to celebrate Anushka's Bday and the male character gets into some unnecessary mood that really spoils the purpose of an escapade...but then except for that which is quite guessable and basically that's the when the movie starts actually....Beyond that what happens can really make you scary as the reviewer who has posted it before says as this can happen to you or me too if we get caught up or if we mess up with certain people from certain section in society !!!! Coming to Anushkas acting, she was just mindblowing....never been her fan or anything but after watching this movie...I definitely became her fan !!!!!",
         "NH10 is a dark and depressing film.It is a movie about a road trip of a couple which goes awry.The couple gets trapped between a group of criminals.After that a brutal and bloody game starts which is scary and violent. The movie showcases the hidden realities of our society.The movie explores the state and condition of females in male dominant society.It also touches the issue of Honour killing which is a burning and serious topic.It also focuses on the issue of caste discrimination The script is very sharp and flows very smoothly.There are no any unnecessary scenes which restrict the flow of the movie.The movie takes very little time to build and after that it becomes so engaging that you are forced to glue yourself on the seat.The first half is good.The post-interval portion is very good but the last 15 minutes are awesome. This movie is basically a female oriented film.So this movie totally belongs to Anushka.The character demand of the lead role of the movie is very high and Anushka plays is brilliantly.She expresses her fear,angst,pain,sorrow and depression very smoothly.In some scenes she has become a little over the top and unconvincing.Still she must be applauded for playing such a different character.Darshan kumaar is awesome.His body language,his expression,his accent,everything is so good and convincing.He has given a tough competition to Anushka.Neel has a small role and had nothing much to do.Deepti naval is excellent even in very small role.Rest of the cast is also good. The direction of the movie is the biggest plus point.Navdeep is an excellent story teller and it clearly shows.He should be applauded for making such a different movie which is like a breath of fresh breeze for bollywood audience.The editing is also very good as the movie is short and slick.The music is below average.'Chil Gaye naina' is the only track which is good.The locations are good and matches perfectly with the dark theme of the movie.The only problem i found in this movie is the lack of character development. It is a powerful tale which reveals the dark truths of our society.It is a strong and intense thriller which is scary too.If you are a lover of a good cinema then it is a must watch for you.The movie showcases the growing face of Indian cinema.It is an intense and gripping thriller which is not a commercial potboiler but is rich in content.After Badlapur,again the bollywood has made a thriller which can compete with any film in term of its content.This movie demands guts from the viewers to digest its violent and bloody content.A nice cinematic experience....... 7.3 out of 10 would be perfect for this movie.",
         "After a first few minutes, it felt like a typical modern romantic movie but it quickly changes into an intense, action-filled and quite realistic thriller. Based on the concept of honor killings in rural areas of Haryana. Here the people are willing to kill their own kin if they dare to cross the caste lines to protect the \"honor\" of their caste. The village, the language spoken by the locals, the surrounding vegetation looks very authentic. One of the police officers succinctly points out the differences between the rural mindset and the urban mindset which are physically separated by just a few miles. The end is somewhat less credible. But the movie is a great experience. More similar to a Hollywood movie than a typical Bollywood flick. I loved it. All the characters seem quite authentic. Hats off to the director!",
         "I have been meaning to see NH 10 for some time now, finally managed to catch it on a flight today. In a word, this is a terrifying film. Terrifying because it is real. Terrifying because this could happen to you, to me, to anyone of us. Riveting because it was well enacted. Ideally one should see this in a theatre or at least on a large screen TV rather than on a tiny flight screen with abysmal graphics. This is because most of the film is shot in the dark and you do need a good screen to get the best effect. On the other hand, the incidents portrayed are so real and it happened at night so this is how it is in the dark. I have always admired Anushka Sharma as an actress right from Rab Ne Bana Di Jodi and in Band Bajaa Baraat and in Ladies V/s Ricky Bahl. She was superb in NH 10. I thought the husband was Rajkumar Rao but turns out it was Neil Bhoopalam who also essayed his role brilliantly. As did all the other characters. Very realistic, and terrifyingly true. I do not want to disclose the plot in my reviews, suffice it to say that this is a horrific portrayal of reality in certain parts of the country, and well worth watching.",
         "15 years back RGV made a film called \"Jungle\". While you may or may not be a fan of his movies, one special highlight of this one was the tension between the goons and Urmila Matondkar/Fardeen Khan. When your plot has a lot of hide-seek-chase-repeat sequences it has to keep the audiences on their toes. NH10 perhaps misses that edginess. If X-axis was direction & Y-axis was story/screenplay, NH10 would make a sine curve. A strong subject & a bold intent like NH10 misses out on a barbaric antagonist who'd make the women throw their 'chappal' on the screen. Where Anushka Sharma keeps the momentum going, you might not HATE Darshan Kumaar (at the most you'll dislike him) or the other thugs. Despite the lack of knife-edge discourses & non-exciting storytelling, it would be safe to say Anushka's Clean Slate Films has survived an \" almost miscarriage-d baby production \". That being said, it is a definite & a good move by the actress. Overall with the flaws / misses, NH10 is yet, a definite one-time watch! ‪#‎nh10‬ ‪#‎bollywood‬",
         "A nightmarish vacation packed with gruesome action and pulsating thrills. Its a horror-thriller which showcases the inequality of women in our society and the ill treatment dished out to them for deviating from the norms of \"society\". A slow paced action after an explosive opening. Gripping plot with good support cast. Dialogues and language are only for adults. A good watch not the usual merry go round off beat comedies thrown at your face. It's in tune with Hollywood thrillers although it is not well paced. However a good watch, Anuskha seemingly does well in her city girl avatar however, doesn't have that wild streak in her. Grab a bite and join the fun, start the engines and dive on NH10. Highlighting the our social-evils the movie succeeds in reforming the minds of our youth.",
         "After watching ‪#‎NH10‬ , Frankly Speaking I personally felt that it can give very tough competition to any Hollywood Flick n it's very \"HARD\" to handle by typical Indian Men. NH10 capture the Growing India ( Read :Barte Bachha) in a realistic way (Read : Nakedly ) and utter the Ugly Truth that after the last mall of The Town our so called Constitution n Democracy Of India also ends. Thanks to AnuragKashyap‬ n AnushkaSharma‬ to deliver this Gem (without any \"Nacha\" , \"Gana\" ) n to teach Future Indian Women how to Act or Fight back. Finally salute to the lady, who is really in \"Form\" wink emoticon and give her Best ever performance till now.Back to back \"Double Ton\" Anushka (Read : PK , NH10), now waiting to see a Tripple from your bat( Best Wishes )"
      ],
      "genres": [
         "Adventure",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Clean Slate Productions",
         "Eros International",
         "Phantom Films"
      ],
      "summaries": [
         "Meera and Arjun are professionals living in Gurgaon. When Meera walks out of a party late one night, she gets attacked by a group of unknown men. Although she escapes through the skin of her teeth, it leaves her traumatized. Arjun, partly blaming himself for not being there that night, tries to make up for it by treating Meera to a luxurious desert holiday. As they stop on a Highway Dhaba for dinner, they witness a young girl being picked up by a bunch of hoodlums. Arjun chooses to step in, unmindful of the danger ahead.",
         "Meera and Arjun are happily married and presently working in Gurgaon. Emergency work forces Meera to break off from a party they both are in and she drives to work alone, when she is mugged. This gives her all reasons to obtain a licensed gun to protect herself from these harrowing experiences. This is when Arjun tries to ease things off by planning to celebrate Meera's birthday in a private villa in NH10, hours' drive away. Along their way, they encounter a young couple who are supposedly eloping, but are caught on the act. Here is where the learned urbane meets the rural; where the verdict of the sarpanch supersedes the law books governing the country.",
         "On their way to a weekend retreat, a married couple find their dream vacation turn into a nightmare when they cross paths with a dangerous gang."
      ],
      "budget": 0
   },
   "movielensId": 132358,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2015-03-12",
      "dvdReleaseDate": null,
      "directors": ["Navdeep Singh"],
      "runtime": 115,
      "movieId": 132358,
      "title": "NH10",
      "mpaa": "",
      "actors": [
         "Anushka Sharma",
         "Neil Bhoopalam",
         "Deepti Naval",
         "Darshan Kumaar",
         "Ravi Jhankal"
      ],
      "imdbMovieId": "3742284",
      "originalTitle": "NH10",
      "genres": [
         "Adventure",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["A9icNqWlylw"],
      "plotSummary": "A woman, stacked against all odds, manages to not just stick it out but indeed give it back.",
      "tmdbMovieId": 330431,
      "avgRating": 3.45714,
      "releaseYear": "2015",
      "numRatings": 35,
      "posterPath": "/1PPUgbQE9UVrgPyMif8urLSIKWb.jpg"
   }
}