{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "star",
            "id": 3412
         },
         {
            "name": "cuddle rabbit",
            "id": 6463
         },
         {
            "name": "space",
            "id": 9882
         },
         {
            "name": "little girl",
            "id": 12663
         },
         {
            "name": "blue sky",
            "id": 182600
         }
      ],
      "imdb_id": "tt0416908",
      "video": false,
      "title": "Laura's Star",
      "recommendations": [
         47353,
         25741,
         41066,
         52264
      ],
      "backdrop_path": "/eGowiLrh6Dy080aP2NBFvj6gwkW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Laura (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b247",
               "name": "Céline Vogt",
               "profile_path": null,
               "id": 73995,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tommy (voice)",
               "gender": 2,
               "credit_id": "52fe45159251416c7504b24b",
               "name": "Sandro Iannotta",
               "profile_path": null,
               "id": 73996,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Max (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b24f",
               "name": "Maximilian Artajo",
               "profile_path": null,
               "id": 68190,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mama (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b253",
               "name": "Brit Gülland",
               "profile_path": null,
               "id": 73997,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Papa (voice)",
               "gender": 2,
               "credit_id": "52fe45159251416c7504b257",
               "name": "Heinrich Schafmeister",
               "profile_path": "/xytLnIYUodtW3i4Enj2X7V0wnnI.jpg",
               "id": 3742,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mechanische Katze / Bär (voice)",
               "gender": 2,
               "credit_id": "52fe45159251416c7504b25b",
               "name": "Mirco Nontschew",
               "profile_path": "/gu15WmoFhaynE8YThYubt6S4f8V.jpg",
               "id": 59333,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mini Hase (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b25f",
               "name": "Martin Reinl",
               "profile_path": null,
               "id": 73998,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Sonne (voice)",
               "gender": 1,
               "credit_id": "52fe45159251416c7504b2bd",
               "name": "Eva Mattes",
               "profile_path": "/9qUzPuHrQ2DV64CycNJMUFq4YvB.jpg",
               "id": 10627,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Mond (voice)",
               "gender": 2,
               "credit_id": "52fe45159251416c7504b2c1",
               "name": "Peter Fitz",
               "profile_path": "/rbEFnWlS2ZuUfwTcpxCTWkAAPF4.jpg",
               "id": 17546,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Hausmeister (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2c5",
               "name": "Mogens von Gadow",
               "profile_path": "/m8vEWy02ezuIvi9uvdzTbyWqbVO.jpg",
               "id": 1118191,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Putzfrau (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2c9",
               "name": "Hildegard Krekel",
               "profile_path": "/s5ZcXlVQrYvZyPHLFED6wlMfhQv.jpg",
               "id": 146941,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Harry (voice)",
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2cd",
               "name": "Adrian Wilms",
               "profile_path": null,
               "id": 1125168,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b265",
               "name": "Piet De Rycker",
               "profile_path": null,
               "id": 57323,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b26b",
               "name": "Thilo Rothkirch",
               "profile_path": null,
               "id": 57324,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b277",
               "name": "Rolf Giesen",
               "profile_path": null,
               "id": 24079,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b27d",
               "name": "Thilo Rothkirch",
               "profile_path": null,
               "id": 57324,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b283",
               "name": "Maya Gräfin Rothkirch",
               "profile_path": null,
               "id": 74002,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b289",
               "name": "Thilo Rothkirch",
               "profile_path": null,
               "id": 57324,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b28f",
               "name": "Nick Glennie-Smith",
               "profile_path": "/sCNYdoHmQdkeu5LPTy22xtRVkFI.jpg",
               "id": 57263,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b295",
               "name": "Henning Lohner",
               "profile_path": "/AoXLOV8gZGPvrzTsP96xP3MUakD.jpg",
               "id": 40613,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b29b",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2a1",
               "name": "Alexander Lindner",
               "profile_path": null,
               "id": 74003,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2a7",
               "name": "Piet De Rycker",
               "profile_path": null,
               "id": 57323,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2ad",
               "name": "Alexander Lindner",
               "profile_path": null,
               "id": 74003,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45159251416c7504b2b3",
               "name": "Michael Mädel",
               "profile_path": null,
               "id": 1125166,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45159251416c7504b2b9",
               "name": "Manuel Arenas",
               "profile_path": null,
               "id": 1125167,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.660187,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 12697,
      "vote_count": 22,
      "budget": 0,
      "overview": "Laura sees a shooting star falling to earth and finds it in a park, down on the floor and with a broken point. The star is a living being, and Laura takes her home to reattach its point with a band-aid. The little star has special powers and can make people fly, or bring inanimate objects to life. But the more she stays on Earth, the weaker she becomes and her colors fade away and her powers start to fail. Laura must find a way to send the little star back into outer space.",
      "similar": [
         157336,
         286217,
         2103,
         62,
         568,
         95,
         348,
         395992,
         126889,
         81188,
         228161,
         11360,
         68179,
         274870,
         871,
         1903,
         19995,
         118340,
         667,
         686
      ],
      "original_title": "Lauras Stern",
      "runtime": 75,
      "poster_path": "/Y6tmk0nvjqNwPCpUqVB3p86ZQo.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rothkirch Cartoon Film",
            "id": 8177,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Comet Film",
            "id": 8178,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MotionWorks",
            "id": 4968,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Animationsfabrik",
            "id": 11918,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2004-09-19",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/6I8Y3V19RSOm8vu2auUcqhkj05q.jpg",
         "name": "Lauras Stern",
         "id": 272416,
         "poster_path": "/uhbV1HbshSatTqDFGFHF8qwnYul.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "€",
      "directors": [
         "Piet De Rycker",
         "Thilo Rothkirch"
      ],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Klaus Baumgart",
         "Piet De Rycker"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0416908/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTIzMTk1NjUxMV5BMl5BanBnXkFtZTcwNzIyNjQzMQ@@._V1_UY268_CR26,0,182,268_AL_.jpg",
      "actors": [
         "Céline Vogt",
         "Sandro Iannotta",
         "Maximilian Artajo"
      ],
      "reviews": [
         "Laura's Star is an extremely amiable children's movie full of imagination and charm. Something tells me Hayao Miyazaki may have been an influence on De Rycker and Rothkirch, since Laura's Stern (or Laura's Star) carries with it shades of Spirited Away, Kiki's Delivery Service and, to a slightly lesser degree, My Neighbour Totoro. I could be wrong of course, but it's easy to draw this comparison simply judging from the aesthetics and the likable narrative of this film and, if anything, it's meant as a compliment. Still, there's a hint of triumphalism here in that I'm glad to see one of my favourite film-makers having a bearing on other directors and animators, as well they should. In any case, I have absolutely no hesitation recommending Laura's Star to anyone with young children - or for that matter people like myself who just happen to have a weakness for all things cutesy and good-natured.",
         "Laura's Star is a beautiful story about seven year old Laura who has moved from the country to the town with her family, Mum, Dad and little brother. She's lonely and needs a friend. One night whilst out gazing out into the night, she sees something fall from the sky. She follows the light and finds that it was a star which, having been broken in the fall, needs someone to care for it. I won't spoil the story for those who haven't read the book! The animation is beautiful, and there's just enough detail added to make a full length movie without taking away from the original story. Watch Laura's Star through the eyes of an infant and it's MAGICAL!",
         "Laura's Star is a magical story based on the hugely popular books of Klaus Baumgart and it is about a 7 year old girl who has moved from the country to the city with her younger brother and parents. She is unhappy about having to leave her friends and her garden (she lives on a top floor apartment in a German city now) and is a loner who doesn't want to make new friends. One night Laura sees a little star falling out of the sky and it lands in a park not far from Laura's bedroom window, she rushes out to find a broken star and she takes it upon herself to make it better. The star is, of course, a magic star and whatever it touches it brings to life albeit in the form of her 2 soft toys but the star cannot survive if it stays on earth. This is one of those movies that does just enough to keep the mind of a 7 year old focused for 80 minutes but rather lets the adult down however girls will love it no doubt.",
         "\"Lauras Stern\" is a German movie from 2004, so this one is already over a decade old and back then it managed to win a German Film Award in the children's film category. This is very accurate and deserving though as it was up against one other film only and that was from the unbearably bad Wilde Kerle franchise. This one here is clearly superior luckily. It is an animated movie by the team who also worked on the Little Polar Bear duology. And even if the voice acting cast here does not contain as many familiar names as for the arctic movie, German film buffs will still recognize some of the actors, such as Krekel, Fitz, Mattes and Schafmeister for me. The animation looks really retro as if this film could have been much older than 21st century and that's not a negative aspect at all as it adds to its charm. So yeah, overall I enjoyed the watch. Here we have the story of a girl who has to move to a new house and isn't happy about that at all. Her brother has similar problems that worsen even when his beloved stuffed animals is taken away from him for a brief moment. Anyway, things take a turn for the better when the girls manages to make friends (and foes) and finds a magical little star that has fallen from the sky and it has the ability to bring all kinds of stuffed animals to life, which is something that especially the brother enjoys. All in all I think the first half hour is pretty good, but then it gets a bit worse in the second half hour until the journey through the stars is pretty good again at the very end, especially visually. Like I wrote in the title, the film's innocence is one of its biggest strength, even if the subject maybe only makes it interesting for really young audiences. Of course those still young at heart will enjoy it too I believe and yes this includes myself. It's a bit of a shame the second half of the movie was a bit on the forgettable side as the film surely offered potential for being even better. It is a relatively short film and I guess this is a good thing overall here. It runs for under 75 minutes without credits, slightly over 75 with credits. the Wonderwall song at the very end is nice too and fits perfectly. I recommend checking it out and I can see why it is one of Germany's most known animated films still today, even if admittedly there aren't that many compared to the United States or so. Go see it.",
         "My daughter and her class watch this film at school during wet breaks and she was desperate to have it at home and watch it all the way through. As a parent always on the look out for an alternative to Disney for my kids and a lover of all things German, I am delighted with this film. The characters of Laura and Tommy have depth and Laura is just naughty enough to be adventurous!I love that she is not at all princessy and is into space and flying. There is lots of great stuff to get kids thinking in this film and some issues of moving home, being kind and sticking together are tackled in a non patronising way. Highly recommended.",
         "When I was 17 or 18, I remember watching the television series on the now-defunct Discovery Kids channel and not realising they were based on the books that I never knew existed until earlier this year since I realised that the TV series had a similar animation style to the book illustrations. When I heard of this film, I thought it would be based on the TV series but it wasn't due to its animation that differs from that in the series. I recently bought this in a 4-DVD pack along with 'The Powerpuff Girls Movie,' 'The Magic Sword: Quest for Camelot' and a DVD of Dr Seuss cartoons. The animation itself was rounded, fluid, detailed and smooth while the backgrounds had an acrylic painting/pastel drawing look to them. I was blown away by the musical score because it was magical and suited the film's theme very well. While the song 'Stay' was pretty mediocre and hard to hear in places, I loved the closing song 'Touch The Sky.' The British voice acting was full of clarity but it differed from the voices in the TV series and Laura's voice was a tad grating to begin with, although she became an endearing character as the film progressed. The dubbing was sometimes off but this is forgivable since this film was originally made in German. I found the opening sequence phenomenal but when it finished I was confused because I couldn't tell if Laura and her family had just moved in or if they were going to move house. The scenes with Laura flying with the star were breathtaking and the scenes that took place during the night were some of the most detailed I've seen compared to the darker scenes being less detailed in 'Kung Fu Panda.' Laura's and Tommy's toys coming to life were reminiscent of the 'Toy Story' franchise in spite of them coming alive in their presence as opposed to Andy's toys coming to life in his absence. All in all this is a stunning children's film if its animation differs from that in the TV series, probably due to them being made in different studios. 8/10.",
         "No in-jokes. No adult themes. Not even a guest celebrity voice-over. Just a simple animated tale about a little girl finding a damaged star in the park at night near her new house, and her subsequent adventures as she adopts it and hides it from nosy grown-ups. Later as it loses it's glow she has to make a decision... be selfish and keep her newfound celestial body and watch it slowly die, or release it back into the sky where it belongs so it can shine forth once again. I think you can see where this is going... Still, there is plenty here to admire, including the attractive synchronicity of traditional and computer animation so that it resembles a Hayao Miyazaki film (but there the resemblance ends) as well as the inherent charm in the central premise, which is expanded on well from a children's short story. If you're wondering why sometimes the words don't match the lips, this is because it was initially a German film with re-recorded dialogue for the English speaking market. This doesn't spoil the enjoyment factor though, and it makes for a fine 80 minute diversion for the kids (and a few patient adults). 6/10"
      ],
      "genres": [
         "Animation",
         "Family"
      ],
      "productionCompanies": [
         "Rothkirch Cartoon Film",
         "MotionWorks",
         "Comet Film Produktion GmbH"
      ],
      "summaries": [
         "Laura is seven year old country girl, who's just moved along with her family to a city. On her first night in their top floor apartment, she sees a shooting star, actually falling to earth, she finds it in a park and discovers it's a living being. Taking it back home, she and her toddler brother Tommy discover it can do miracles like making people fly and bringing inanimate objects to life. But over time both notice that the longer it stays on earth, the weaker it becomes, can they along with next door neighbor Max find a way to send it back into outer space, before tragedy occurs?",
         "An adolescent girl and her toddler brother, find a star that has actually fallen to earth, that turns out to be living being...complete with cosmic powers"
      ],
      "budget": 3400000
   },
   "movielensId": 132416,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "2004-09-19",
      "dvdReleaseDate": null,
      "directors": [
         "Piet De Rycker",
         "Thilo Rothkirch"
      ],
      "runtime": 75,
      "movieId": 132416,
      "title": "Laura's Star",
      "mpaa": "",
      "actors": [
         "Céline Vogt",
         "Sandro Iannotta",
         "Maximilian Artajo",
         "Brit Gülland",
         "Heinrich Schafmeister",
         "Mirco Nontschew",
         "Martin Reinl",
         "Eva Mattes",
         "Peter Fitz",
         "Mogens von Gadow",
         "Hildegard Krekel",
         "Adrian Wilms"
      ],
      "imdbMovieId": "0416908",
      "originalTitle": "Lauras Stern",
      "genres": [
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Laura sees a shooting star falling to earth and finds it in a park, down on the floor and with a broken point. The star is a living being, and Laura takes her home to reattach its point with a band-aid. The little star has special powers and can make people fly, or bring inanimate objects to life. But the more she stays on Earth, the weaker she becomes and her colors fade away and her powers start to fail. Laura must find a way to send the little star back into outer space.",
      "tmdbMovieId": 12697,
      "avgRating": 1.5,
      "releaseYear": "2004",
      "numRatings": 1,
      "posterPath": "/Y6tmk0nvjqNwPCpUqVB3p86ZQo.jpg"
   }
}