{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "radiation",
            "id": 1618
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "quarantine",
            "id": 6898
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "conspiracy",
            "id": 10410
         },
         {
            "name": "disaster",
            "id": 10617
         },
         {
            "name": "car chase",
            "id": 15483
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "nuclear waste",
            "id": 195331
         }
      ],
      "imdb_id": "tt0080513",
      "video": false,
      "title": "The Chain Reaction",
      "recommendations": [
         5735,
         93771,
         58419,
         59574,
         111208,
         99220,
         85593,
         88377,
         71324,
         137528,
         27807,
         67221,
         89403
      ],
      "backdrop_path": "/9cnAdRmx34maLAX0VrI6nte4Hw0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Larry",
               "gender": 2,
               "credit_id": "52fe462cc3a368484e082c89",
               "name": "Steve Bisley",
               "profile_path": "/3dcKgXUKcIJ8ta85frdU7XbHxLi.jpg",
               "id": 45211,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Carmel",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082c8d",
               "name": "Arna-Maria Winchester",
               "profile_path": null,
               "id": 110488,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Heinrich",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082c95",
               "name": "Ross Thompson",
               "profile_path": null,
               "id": 234613,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Eagle",
               "gender": 2,
               "credit_id": "52fe462cc3a368484e082c91",
               "name": "Hugh Keays-Byrne",
               "profile_path": "/lhYUcPimMMy7Ltp58NkB3RuJzSv.jpg",
               "id": 26060,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Gray",
               "gender": 2,
               "credit_id": "52fe462cc3a368484e082c99",
               "name": "Ralph Cotterill",
               "profile_path": "/8u3BnT9ANGdZ2ppp591BIjXl0Q.jpg",
               "id": 97331,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Jr. Const. Pigott",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082ca1",
               "name": "Richard Moir",
               "profile_path": "/latEXAXstAslwurq7zA6oQHhYGQ.jpg",
               "id": 51672,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Survey driver",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082cb9",
               "name": "Tim Burns",
               "profile_path": "/gH1IL9VzeFlcdY1CelAgnorp0YP.jpg",
               "id": 1125220,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Gloria",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082c9d",
               "name": "Lorna Lesley",
               "profile_path": null,
               "id": 222624,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Oates",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082ca5",
               "name": "Patrick Ward",
               "profile_path": null,
               "id": 110487,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Police Sgt. McSweeney",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082ca9",
               "name": "Laurie Moran",
               "profile_path": null,
               "id": 119132,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Doctor",
               "gender": 2,
               "credit_id": "52fe462cc3a368484e082cad",
               "name": "Michael Long",
               "profile_path": null,
               "id": 117365,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Ralph",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082cb1",
               "name": "Bill McCluskey",
               "profile_path": null,
               "id": 105839,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Molly",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082cb5",
               "name": "Margo Lloyd",
               "profile_path": null,
               "id": 1146116,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Byron Langley",
               "gender": 0,
               "credit_id": "52fe462cc3a368484e082cbd",
               "name": "Arthur Sherman",
               "profile_path": null,
               "id": 1001978,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Bearded mechanic (uncredited)",
               "gender": 2,
               "credit_id": "59a16362925141774f0285e1",
               "name": "Mel Gibson",
               "profile_path": "/4IsmIFUgoJgUZjen8Ldxnw5YQvG.jpg",
               "id": 2461,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe462cc3a368484e082c85",
               "name": "Ian Barry",
               "profile_path": null,
               "id": 152510,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe462cc3a368484e082cc3",
               "name": "Ian Barry",
               "profile_path": null,
               "id": 152510,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5ab80baa925141395e0212f6",
               "name": "Tim Wellburn",
               "profile_path": null,
               "id": 71194,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ab80bb30e0a261fee02355a",
               "name": "Andrew Thomas Wilson",
               "profile_path": null,
               "id": 1359521,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5ab80bd0925141396402060a",
               "name": "Russell Boyd",
               "profile_path": null,
               "id": 31027,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5ab80be89251413967020646",
               "name": "David Elfick",
               "profile_path": null,
               "id": 57956,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.450062,
      "production_countries": [],
      "id": 60591,
      "vote_count": 7,
      "budget": 0,
      "overview": "Contaminated by a nuclear-plant spill, an Australian worker hides with a woman and tries to warn the public.",
      "similar": [
         10017,
         8810,
         4638,
         948,
         298312,
         13820,
         22825,
         6312,
         2142,
         429733,
         988,
         3134,
         294652,
         4771,
         11564,
         7191,
         1991,
         2502,
         96,
         185
      ],
      "original_title": "The Chain Reaction",
      "runtime": 92,
      "poster_path": "/sstLy91wB3nMqgXaPCAC3faad4m.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1980-09-25",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "One terrifying mistake and there was no return!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": ["Ian Barry"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Ian Barry"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080513/",
      "coverLink": null,
      "actors": [
         "Steve Bisley",
         "Arna-Maria Winchester",
         "Ross Thompson"
      ],
      "reviews": [
         "'The Chain Reaction' was made by many of the same actors and crew who made the first - and best - 'Mad Max' movie. Although the IMDb credits don't share too many names, the style, photography and direction are so uncannily similar, that George Miller must've been more involved with 'The Chain Reaction' than just as co-producer. The two films are practically twins. Even the car-chase scenes are alike, which is good. The plot could easily serve as a prequel to Mad Max; an accident at an Austrailian nuke disposal site out in the boonies results in catastrophic radiation leakage which will poison the area's water table. The evil corporation that owns the disposal site is trying to hush up the accident by sealing off the area, but some eco-activists have been in contact with one of the scientists at the site, and they find out about it. The scientist took a huge dose of plutonium during the accident and only has 3 days to live, but hotheaded motorhead dude Larry (played by Steve Bisley - 'The Goose' in 'Mad Max') and his wife get tangled up in the unfolding crisis... Many of the local inhabitants appearing in 'The Chain Reaction' also played similar characters in 'Mad Max'. They don't necessarily play the exact same parts, but it is not a stretch to imagine that after the nuclear catastrophe has devastated their environment, they all evolved into the desperate characters of 'Mad Max'. It appears (to me anyway) that 'The Chain Reaction' was filmed first, since one of the characters seems to say \"It's 1977, mate...\", but I'm not quite sure about this. The haircuts and clothes are definitely mid-70's, (flared jeans etc) while Mad Max has a later, more punkish late-70's look.",
         "I saw this movie at the Roxy Cinema,Parramatta, Sydney Australia in 1980. I thought the action stunts and story were good. Steve Bisley who played Goose in \"Mad Max\" in one of his early lead roles. Watch out for Mel Gibson in an unbilled role as a mechanic at the beginning of the film.",
         "Interesting eco thriller made in Australia in 1979 that was pipped at the post by THE CHINA SYNDROME almost in release at the same time. Produced by versatile industry go getter David Elfick (NEWSFRONT, STARSTRUCK, UNDERCOVER and Exec Prod on RABBIT PROOF FENCE) The CHAIN REACTION went over very well as a drive in movie for the thinking Mad Max crowd. It even has several of MAX's stars. With great stunt and car chase work and a genuinely believable story set slightly in the future CR will be a fun DVD release if out-takes and interviews are included. It looked terrific on a cinema movie screen and I guess will become an intelligent action staple if you have a big plasma TV at home. Elfick never makes the same movie twice and a scan through his CV on this site will let you access an astonishing range of Ausralian feature films. One is even called AROUND THE WORLD IN 80 WAYS..about fooling blind Dad that he is on a holiday when really he never leaves the street...one The Farrelly Bros should update and remake.",
         "This was a pleasant surprise I caught on cable one day. Opening a year after Mad Max and with 2 actors Steve Bisley and Hugh Keays-Byrne also from Mad Max this little action/thriller is very entertaining. Aussies really know how to put together some great car chases - lots of V8 engine noises and cameras by the wheel, this movie has at least 2 that beat the crap out of several hundred car chases in American movies. The story might be a little far-fetched but nothing that's intolerable. I gave this one an 8/10, without the car chases a 7.",
         "\"The Chain Reaction\" immediately looked like a genuine winner for me, as I have a natural born fondness for disaster themed movies and – especially since seeing the awesome documentary \"Not Quite Hollywood: The Wild, Untold Story of Ozploitation!\" – outrageous Australian cult cinema. This movie combines the two with a story revolving on nuclear contamination (and of course the complimentary corporate cover-up) filmed and released during the late 70's/early 80's when Aussie's horror and cult culture was in the middle of it development. \"The Chain Reaction\" has several direct links with what's inarguably Australia's greatest cult milestone ever made; the still incredibly amazing \"Mad Max\". The couple of car chases are obviously borrowed, in the hope to become as successful, and the cast and crew features several familiar names. Lead star Steve Bisley played Max Rockatansky's partner Goose and there's also an important role for Hugh Keays-Byrne, who played the notorious villain Toecutter. Apparently even Mel Gibson himself very briefly appears in the film, as an anonymous bearded mechanic, but he must have been very well disguised as I didn't even notice him. Last but not least, George Miller is credited as associate producer but undoubtedly also helped writer/director Ian Berry a lot with his fist long-feature film. Unfortunately, however, \"The Chain Reaction\" isn't as awesome as I hoped or as it easily could have been. The film provides enough thrills and entertainment for as long as the emphasis remains on action, but as soon as it's necessary for the scenario to create more depth and slowly begin to work towards a gratifying conclusion, the whole set-up tumbles down and becomes lamentable. The opening sequences are hugely compelling and eerie, albeit not too plausible. When an earthquake strikes in the Australian outback, Waldo Nuclear power plant engineer Heinrich Schmidt is lethally exposed to radioactive material but nevertheless insists to warn the public about a leakage. His superiors want to prevent this from happening of course, those bastards, but Heinrich escapes and with his last strengths manages to reach a small town before collapsing. Robust macho car mechanic Larry Stillson and his beautiful nurse wife Carmel take the exhausted and amnesiac Heinrich into their cabin and thus become involved in the deadly Waldo cover-up conspiracy. The opening sequences at the nuclear plant, Heinrich's escape and Larry's first encounter with the Waldo goons – resulting in a high adrenalin car chase that even causes tires to screech on a dirt road – are vastly exhilarating. The whole story around the slowly recovering Heinrich Schmidt, on the other hand, is largely unnecessary and rather awkward. We already know that Schmidt narrowly survived nuclear radiation and that the local water supply is contaminated, so his flashbacks and slow memory recovery are redundant. Also, unlike as in the epitome film \"The China Syndrome\", \"The Chain Reaction\" does not seem very interested in the political aspects of nuclear cover-up conspiracies. The Waldo Plant über-tycoon is more interested in personally eliminating Larry and C° than in saving his own reputation. That's the Aussie villain mentality for you! Overall, this is a decent and fun flick as long as you don't pay too much attention to content and logic. Subtitles on the DVD would have been nice as well, as the Aussie outback accents are often difficult to understand.",
         "A nuclear plant employee is accidentally showered in radioactive waste and his company wants to hush up the fact the water supply has been contaminated. He escapes and quickly falls under the care of race car driver Larry (Steve Bisley) and his wife Carmel (Arna-Maria Winchester) at their vacation home. Since they are corporate guys, the baddies will stop at nothing to silence the escapee and anyone who helps him. It is THE CHINA SYNDROME with car chases! This one is pretty decent but suffers from a sluggish pace at times and making a straight-forward plot convoluted. There are some nice character touches (the deaf hit-man; Hugh Keays-Byrne's eccentric anti-nuke guy). MAD MAX's George Miller was originally supposed to direct, but didn't. He did do the work on the car chases (uncredited), which are really good but the film could have used more of them. Ian Barry directed and has a good eye and stages some nice shocks. Wish it was more even though. Some guy named Mel Gibson has a two-second cameo.",
         "Selfless, compassionate German scientist Heinrich (a deeply sympathetic Ross Thompson), an employee for the nefarious multi-international nuclear power company WALDO, gets fatally contaminated by a radiation leak at one of WALDO's storage facilities in Central Australia. Heinrich escapes from WALDO's pernicious clutches and goes on the lam so he can warn the outside world about the potentially catastrophic repercussions of the toxic spill. Heinrich, slowly dying and suffering from amnesia, seeks shelter and protection from cocky race car driver Larry (the ruggedly likable Steve Bisley) and his caring nurse wife Carol (a wonderfully radiant performance by the leggy, strikingly gorgeous blonde knockout Anna-Maria Winchester). A bunch of WALDO agents, determined to cover up the disaster, relentlessly track Heinrich and the couple down. Basically \"The China Syndrome\" crossed with a tense, pacy, scarily plausible and tautly streamlined high octane car chase/conspiracy thriller, this extremely exciting and skillfully executed little dilly promptly hurdles along under Ian Barry's firm, strongly focused direction (Barry also wrote the terse, topical, tightly wound script). Russell Boyd's smoothly prowling, polished, often kinetic cinematography, Andrew Thomas Wilson's tinny, noodling, spooky'n'shivery synthesizer score, the shocking brutality of WALDO's corporate goons, the snappy, lightning swift tempo, the cold, gloomy, chilling tone, stunning shots of guys in gleaming white decontamination suits grimly going about their business, the despairing hopelessness of the pitiable Heinrich's wretched plight, and the harsh corporate ruthlessness that the evil, amoral WALDO embodies stoke the film's wired, ambient paranoia to a stirringly high temperature, therefor making for a most excellent and suspenseful nail-biter. Several folks involved with \"Mad Max\" pop up here: George Miller was an associate producer, Hugh \"The Toecutter\" Keys-Byrne plays a sadistic WALDO thug, and both Roger Ward and an unshaven Mel Gibson cameo as yahoo mechanics. The heart-pounding, pulse-quickening, blow-the-wheels-off-that-sucker spectacular climactic car chase will make your teeth rattle. A frightfully credible depiction of a disturbingly possible scientific reality.",
         "In Western Australia project WALDO leaks nuclear waste and exposes Heinrich (Ross Thompson) to a lethal amount of radiation. With only days of life left, Heinrich manages to escape to the country side wanting to warn the people about contaminated ground water while the government wants to cover it up. Heinrich believes it is 1957 and meets up with a vacationing couple. Mel Gibson has a non-credited role as a bearded mechanic, making this a rare collectible for Mel Gibson fans, should they be so inclined. The film itself was not great, a bit disjointed, and manages to be boring during the action scenes. Guide: sex and nudity (Steve Bisley, Arna-Maria Winchester)",
         "I saw this at the drive in when it was released, but cant find it these days on DVD, I have fond memories of this film, but am afraid it was another Houseboat Horror!!!! Am I wrong? The worst part is I cant remember Steve Bisley in this film, sorry Steve! Then again, it may have something to do with the girl I was at the drive in with on this particular night! What really astounded me at the time was the fact that we (Australians), were starting to make films finally that were not about colonial times, or period drama, but films that were truly able to be considered international, in that they really could have been made anywhere, this was an incredible break through."
      ],
      "genres": [
         "Action",
         "Drama",
         "Sci-Fi"
      ],
      "productionCompanies": ["Palm Beach Pictures"],
      "summaries": ["An earthquake in rural Australia causes a dangerous leak at WALDO, a nuclear waste storage facility. Heinrich Schmidt, an engineer badly hurt in the accident, knows that the leak will poison the groundwater for hundreds of miles around, and wants to warn the public. His boss, however, is only interested in protecting himself, and believes the accident should be covered up, even at the expense of thousands of lives. Heinrich escapes from the facility, but is too badly injured to get very far. Lost in the woods and suffering from amnesia, he is rescued by Larry, an auto mechanic on vacation with his wife, Carmel. As Heinrich tries to piece together his memories of what happened, his boss' thugs are quickly closing in on the trio."],
      "budget": 450000
   },
   "movielensId": 132596,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-09-25",
      "dvdReleaseDate": null,
      "directors": ["Ian Barry"],
      "runtime": 92,
      "movieId": 132596,
      "title": "The Chain Reaction",
      "mpaa": null,
      "actors": [
         "Mel Gibson",
         "Steve Bisley",
         "Hugh Keays-Byrne",
         "Ralph Cotterill",
         "Richard Moir",
         "Tim Burns",
         "Arna-Maria Winchester",
         "Ross Thompson",
         "Lorna Lesley",
         "Patrick Ward",
         "Laurie Moran",
         "Michael Long",
         "Bill McCluskey",
         "Margo Lloyd",
         "Arthur Sherman"
      ],
      "imdbMovieId": "0080513",
      "originalTitle": "The Chain Reaction",
      "genres": [
         "Action",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "uK8GhuA_WHE",
         "6CrrwJfSD-A"
      ],
      "plotSummary": "Contaminated by a nuclear-plant spill, an Australian worker hides with a woman and tries to warn the public.",
      "tmdbMovieId": 60591,
      "avgRating": 2,
      "releaseYear": "1980",
      "numRatings": 1,
      "posterPath": "/sstLy91wB3nMqgXaPCAC3faad4m.jpg"
   }
}