{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "nba",
            "id": 169055
         },
         {
            "name": "indiana pacers",
            "id": 201110
         },
         {
            "name": "new york knicks",
            "id": 201111
         }
      ],
      "imdb_id": "tt1501757",
      "video": false,
      "title": "Winning Time: Reggie Miller vs. The New York Knicks",
      "recommendations": [
         54694,
         54684,
         54747,
         54734,
         143675,
         54680,
         54735,
         54739,
         54743,
         54740,
         54742,
         54672,
         54685,
         54737,
         54688,
         54741,
         54692,
         13020,
         11359
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe47019251416c910671b3",
               "name": "Reggie Miller",
               "profile_path": null,
               "id": 122447,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 0,
               "credit_id": "53615d9ac3a368397e0002ec",
               "name": "Cheryl Miller",
               "profile_path": null,
               "id": 1212796,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "53615da8c3a36839760002c2",
               "name": "Spike Lee",
               "profile_path": "/2LmTDMa6ewhkyP4LDBWFdDYDfUv.jpg",
               "id": 5281,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615dc4c3a36839760002ca",
               "name": "Patrick Ewing",
               "profile_path": "/aaXM8PuixEHNTLmvBQJLH8vV1SV.jpg",
               "id": 1231141,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615dcfc3a368394e0002e0",
               "name": "Donnie Walsh",
               "profile_path": null,
               "id": 1315460,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "53615ddbc3a368396e0002da",
               "name": "Marv Albert",
               "profile_path": "/dAdLWTRwEZNK98xwYgTFpBdv2yL.jpg",
               "id": 179512,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615e36c3a3683956000295",
               "name": "Greg Anthony",
               "profile_path": null,
               "id": 1315423,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615e43c3a36839470002fa",
               "name": "Bill Benner",
               "profile_path": null,
               "id": 1315461,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615e66c3a3683947000300",
               "name": "Ira Berkow",
               "profile_path": null,
               "id": 1315462,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615e71c3a3683947000305",
               "name": "Mark Boyle",
               "profile_path": null,
               "id": 1315463,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53615eeac3a368395600029e",
               "name": "Larry Brown",
               "profile_path": "/44aFqUjqFctA8coQAS82tadmBg9.jpg",
               "id": 1315465,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53616280c3a368395d000340",
               "name": "Mel Daniels",
               "profile_path": null,
               "id": 1315477,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5361628bc3a3683947000354",
               "name": "Antonio Davis",
               "profile_path": null,
               "id": 1315478,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5361629ec3a3683947000359",
               "name": "Mike Francesa",
               "profile_path": null,
               "id": 1315479,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536162afc3a368397600033d",
               "name": "Ernie Grunfeld",
               "profile_path": "/5daG6i0jaF7ngjO5SuvbzkgN2yP.jpg",
               "id": 1315480,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536162fdc3a368394e00035d",
               "name": "Mark Jackson",
               "profile_path": "/b4fPRXezXaOyFTjeYnYWaDetgn1.jpg",
               "id": 1221738,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53616596c3a368394e000386",
               "name": "Anthony Mason",
               "profile_path": "/add4Gvhb2734kTb9x36NkfTkyUr.jpg",
               "id": 1315458,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536165a5c3a36839470003a7",
               "name": "Ahmad Rashad",
               "profile_path": null,
               "id": 1197748,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536165b0c3a368397e00038b",
               "name": "Pat Riley",
               "profile_path": null,
               "id": 1157396,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536165c0c3a368397e00038f",
               "name": "Byron Scott",
               "profile_path": null,
               "id": 1315488,
               "order": 19
            },
            {
               "cast_id": 22,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536165dac3a368394e00038b",
               "name": "Rik Smits",
               "profile_path": null,
               "id": 1315489,
               "order": 20
            },
            {
               "cast_id": 23,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536165e6c3a368395d000388",
               "name": "Charles Smith",
               "profile_path": "/HrGbdQEx5U4MsE6k0Uf7eJpkgf.jpg",
               "id": 1315490,
               "order": 21
            },
            {
               "cast_id": 24,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536165f4c3a368396500034d",
               "name": "Jeff Van Gundy",
               "profile_path": "/b7njiZRVampTFvmrKig9cYeZ0qr.jpg",
               "id": 1315491,
               "order": 22
            },
            {
               "cast_id": 25,
               "character": "Himself",
               "gender": 0,
               "credit_id": "53616601c3a36839470003ad",
               "name": "Peter Vecsey",
               "profile_path": null,
               "id": 1315492,
               "order": 23
            },
            {
               "cast_id": 26,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5361660cc3a368397e000397",
               "name": "Herb Williams",
               "profile_path": null,
               "id": 1315459,
               "order": 24
            },
            {
               "cast_id": 27,
               "character": "Himself",
               "gender": 0,
               "credit_id": "536167ddc3a368397e0003ab",
               "name": "John Starks",
               "profile_path": "/cXZcEUTnAfC3c8OF8bnAsFf2P3A.jpg",
               "id": 1214271,
               "order": 25
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe47019251416c910671b9",
            "name": "Dan Klores",
            "profile_path": "/x0WSfPdmEeY5Ssz60TenrmcTjgx.jpg",
            "id": 95143,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.664241,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39185,
      "vote_count": 11,
      "budget": 0,
      "overview": "Reggie Miller single-handedly crushed the hearts of Knick fans multiple times. But it was the 1995 Eastern Conference Semifinals that solidified Miller as Public Enemy #1 in New York City. With moments to go in Game 1, and facing a seemingly insurmountable deficit of 105-99, Miller scored eight points in 8.9 seconds to give his Indiana Pacers an astonishing victory. This career-defining performance, combined with his give-and-take with Knicks fan Spike Lee, made Miller and the Knicks a highlight of the 1995 NBA playoffs. Peabody Award-winning director Dan Klores will explore how Miller proudly built his legend as \"The Garden's Greatest Villain\".",
      "similar": [
         2300,
         10637,
         9655,
         8923,
         22881,
         9291,
         13416,
         323677,
         86130,
         4942,
         10474,
         1578,
         5925,
         12163,
         1367,
         1374,
         9614,
         107,
         612,
         45317
      ],
      "original_title": "Winning Time: Reggie Miller vs. The New York Knicks",
      "runtime": 68,
      "poster_path": "/bkoVQECftQMCKjGfQCSyoASZpOW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2010-03-14",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "Was it winning he loved or beating New York?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dan Klores"],
      "runtime": 68,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1501757/",
      "coverLink": null,
      "actors": [
         "Reggie Miller",
         "Cheryl Miller",
         "Spike Lee"
      ],
      "reviews": [
         "A sentimental look back on the storied rivalry between two perennial NBA bridesmaids, with a special focus on Reggie Miller, John Starks and Spike Lee. Fans of either team, or of the league as a whole, in the mid 1990s should enjoy the trip down memory lane in what was an annual rivalry so dramatic it belongs on film. In-depth interviews with every starter, plus team and media personalities, add fantastic new depth to the story and the backgrounds of its major players, giving the entire three-year arc a variety of competing perspectives and motivations. Hoosiers will find plenty to loathe in Lee's thinly-veiled accusations of racism in the stands, while New Yorkers will seethe at the words and actions of Miller, arrogant in the midst of breaking so many hearts. Detailed, unflinching and unbiased, it's an excellent document of an electrifying time for both fanbases.",
         "In the mid-1990's several things happened to me. Firstly I came to the mainland from Northern Ireland, which in turn caused the next two things. The main one was that I started to play basketball, which changed my body shape and introduced me to a sport I continue to love almost two decades later. The second thing was that I went on a plane for the first time and left the UK for the first time when I went to San Antonio with a friend of mine – a trip he wanted and I went on with the proviso that we spend some time in New York on the way. So I already had fallen in love with the city when my \"lots of heart\" playing style made me fall for the Knicks – an affair that is yet to really pay off it must be said as Ewing's heartbreak became Houston and Sprewell's heartbreak and so on. Anyway, the point of that preamble is to say that the reason I may have enjoyed this film so much is because it affectionately looks back at a period that I remember fondly. The sport was fresh to me, the NBA was fresh to me and the Knicks and Pacers were full of the passion and heart that I tried to play with. This film captures the moment really really well and it was a welcome relief in the 30 for 30 films given that I had previously watched the heavier Alan Iverson film. Sporting rivalries are always intense but, whether professional or amateur, you always shake hands at the end and this film takes the same approach, being good humoured along with everyone who contributes to it. As a Knick fan the footage still hurts; whether it be Ewing's missed layup or Miller's many near-impossible 3-pointers, it did make me wince to remember, but it was all done in such a way that it gave me \"happy\" memories – kind of. The contributors all do really well to get the tone right and bring the passion and the feeling but not have any animosity whatsoever – this is important and it does make the film so enjoyable. The editing is really good as the footage mingles with the contributions while also playing the contributions off one another really well (often to comedic effect). As a fan as well it is good to see these players again, particularly since some of them are in that large group of \"great\" players from the 90's who never got rings thanks to the dominance of Jordan. Winning Time is a fun documentary. I'm not sure how it would play to someone with no interest in the sport or no memory of the events though – probably not well for those reasons, but for a fan it really works. It sums up events really well and does so with a passion and yet a certain amount of affection. A really enjoyable documentary that works as sports programming (for the highlights), documentary (for the history), light entertainment (for the comedy) and as a horror (I'm a Knicks fan – 'nuff said).",
         "30 for 30: Winning Time: Reggie Miller vs. The New York Knicks (2010) **** (out of 4) After a several month hiatus, ESPN's wonderful new documentary series kicked off again with this one looking at the two-year period from 1994 to 95 when Reggie Miller and the New York Knicks became the most talked about subject in the league. Taking place the year after Jordan retired, the film mainly follows the two infamous playoff series, which started with Miller and Spike Lee getting into it and then the following year Reggie topped that by scoring eight points in just over eight seconds. One thing I hate about today's media is the fact that most reporters have to pretend that seeing a good fight makes them want to cry and turn their heads. I grew up when the stuff in this film took place and we also had the Knicks going against the Heat in violent brawls and of course the one and only Dennis Rodman. I remember Reggie and Lee and I remember how incredibly fun it was to see all of this trash-talking and fighting. This documentary does a marvelous job at showing how much fun this stuff was and I think it also shows why the current NBA can be such a bore because we no longer have hated rivals but instead stars going out to dinner together before the game. Pat Riley, the Knicks' coach, tells how his players weren't allowed to talk or shake the hands of the other team before the game. All of the main players are here being interviewed and that includes both Miller and Lee who tell their sides of the rival. It was great fun hearing these two men all these years later because you can still see that great smile this brings to both of them. Seeing the New York backlash against Lee was priceless as was his trip to the next game in Indiana. The supporting players are all here being interviewed as well as several media and TV guys. Director Klores does a wonderful job at keeping everything playful and as much as these teams hated each other, at the same time you can tell that all of them have wonderful memories of it and love talking about it.",
         "Like every middle aged New Yorker, I remember the game like it was yesterday. We didn't hate the Pacers. We didn't hate Reggie. But when he was on, he made us so damn angry- angry at everything, downright ornery. It hit a passion point that we didn't as sports fans know existed. The documentary managed to turn about 8 seconds of game time into a well told hour-ish story. The story of how two sports teams represented the feelings of their entire city for multiple post season series igniting such passion, did what a good documentary should do- evoke emotion. I mentioned the game to my family last week and everyone got so angry- instantly! Each version was slightly different but it was all about two words- Reggie Miller. Maybe it was 8 points maybe 12, maybe 9 seconds maybe less, but it was so personal to each person and clearly an open wound- 20 years later!!! I told them to watch this documentary.",
         "Speaking as a New yorker, and a Knicks fan of the 2nd generation, I don't remember the '69 or '73 Knicks reign... My father does. I've only heard stories. What I remember is the bitter sweet (mostly bitter) 1993-94 NY Knicks. Their amazing season, and (bitter)trip to the finals. It shook my goddam world as a kid... just before my teens. I've seen some of this directors other Doc's before, and they were fairly decent. Not exactly Ken Burns. But when I saw that he made this film, I was shocked. I couldn't believe it... And I certainly didn't think it was going to be as entertaining as it was. To say the least, this film gave me chills. Flashbacks. Cringing memories... like embarrassing moments of childhood... yet such excitement. But, most of all, what this film did was it brought me back in time. Which is, in a sense, what most good documentaries are all about. 10 stars from a die hard Knick and NBA fan. Hopefully the future of these 2 teams will be brighter.",
         "Michael Jordan was my sports hero growing up as a kid watching NBA basketball, but it was great fun reliving the heated rivalry between Reggie Miller and his hate-hate relationship with the New York Knicks while da man was \"on hiatus\" during the 94-95 seasons where the Eastern Conference finals determined who would be going to the championship against the formidable Houston Rockets and Hakim Olijuwon. In \"30 X 30:Winning Time-Reggie Miller vs the New York Knicks\", this documentary highlights the enormity of the feud between the Indiana Pacers star and the Madison Square Garden crowd and NY team. With in-depth interviews by a cast of those whose lives were a part of this particular time in the NBA, affected by Miller and his dagger three pointers, you get a chance to hear from those who, for better or worse, still feel the wounds of both winning and losing to your arch rival in the atmosphere of the big game when everything was on the line. We see how both teams suffered from losing the heartbreaking game that would send one home and the other to the promised land of the NBA finals. Candid interviews from Miller, his basketball star sister, Knicks stars John Starks and Patrick Ewing(..the famous \"missed shot\" where Ewing seems to have an easy lay up is still painful to witness again), newspaper reporters, broadcasters, coaches, and Pacers guard Mark Jackson(..who was a jaded former Knick seeking revenge against his former team)all add insight to the mind set of the rivalry. Through press clippings, old interviews, and replayed footage from the spirited games that were richly contested by both teams, this documentary reawakens that time and place effectively. Spike Lee, whose relationship with Miller, the two jawing back and forth at Madison Square Garden, contributes to the documentary, and highlighted specifically is the game where RM hit two three pointers and two free throws in a matter of seconds, stealing the first in the Pacers-Knicks series at MSG. There's a plethora of basketball talent on display here with interviews from both those who played for the Pacers and Knicks, so we are given privileged information from all who participated.",
         "While I enjoy the films from ESPN's \"30 for 30\" series, I am not the best person to review this particular film, as basketball is one of my least favorite sports. I am not putting the game down--I just have never been much of a basketball fan. Keep this in mind as you read my review--a big b-ball fan might LOVE this episode. \"Reggie Miller vs. The New York Nicks\" is about the rivalry between the Knicks and Miller in the post-season. However, this title seemed a bit overblown. After all, it wasn't like Miller didn't have other teammates and that they spoiled the Knicks playoff bid year after year (it only happened once). So, to me it seemed like a giant no story. Aside from Miller being a trash-talker (don't get me started about that), it just didn't seem that important, as NEITHER team went to the finals! What am I missing?! Why make this film? I just didn't get it. The production values were very nice--I just didn't see a strong enough story to merit the film. By the way, near the end of the film I could have sworn that Patrick Ewing took 37 steps while driving down the lane in game 7 for that final shot. See it and count 'em yourself."
      ],
      "genres": [
         "Documentary",
         "Biography",
         "History",
         "Sport"
      ],
      "productionCompanies": ["ESPN Films"],
      "summaries": ["A film that explores the rivalry between the Indiana Pacers and New York as seen through the eyes and actions of Reggie Miller star player of the Indiana Pacers."],
      "budget": 0
   },
   "movielensId": 132555,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2010-03-14",
      "dvdReleaseDate": null,
      "directors": ["Dan Klores"],
      "runtime": 68,
      "movieId": 132555,
      "title": "Winning Time: Reggie Miller vs. The New York Knicks",
      "mpaa": "",
      "actors": [
         "Reggie Miller",
         "Cheryl Miller",
         "Spike Lee",
         "Patrick Ewing",
         "Donnie Walsh",
         "Marv Albert",
         "Greg Anthony",
         "Bill Benner",
         "Ira Berkow",
         "Mark Boyle",
         "Larry Brown",
         "Mel Daniels",
         "Antonio Davis",
         "Mike Francesa",
         "Ernie Grunfeld",
         "Mark Jackson",
         "Anthony Mason",
         "Ahmad Rashad",
         "Pat Riley",
         "Byron Scott",
         "Rik Smits",
         "Charles Smith",
         "Jeff Van Gundy",
         "Peter Vecsey",
         "Herb Williams",
         "John Starks"
      ],
      "imdbMovieId": "1501757",
      "originalTitle": "Winning Time: Reggie Miller vs. The New York Knicks",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["P-CTRf-w9ZQ"],
      "plotSummary": "Reggie Miller single-handedly crushed the hearts of Knick fans multiple times. But it was the 1995 Eastern Conference Semifinals that solidified Miller as Public Enemy #1 in New York City. With moments to go in Game 1, and facing a seemingly insurmountable deficit of 105-99, Miller scored eight points in 8.9 seconds to give his Indiana Pacers an astonishing victory. This career-defining performance, combined with his give-and-take with Knicks fan Spike Lee, made Miller and the Knicks a highlight of the 1995 NBA playoffs. Peabody Award-winning director Dan Klores will explore how Miller proudly built his legend as \"The Garden's Greatest Villain\".",
      "tmdbMovieId": 39185,
      "avgRating": 3.89623,
      "releaseYear": "2010",
      "numRatings": 53,
      "posterPath": "/bkoVQECftQMCKjGfQCSyoASZpOW.jpg"
   }
}