{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "horror",
            "id": 8087
         },
         {
            "name": "t-horror",
            "id": 10720
         },
         {
            "name": "pregnant",
            "id": 10721
         }
      ],
      "imdb_id": "tt0950500",
      "video": false,
      "title": "The Unseeable",
      "recommendations": [
         114320,
         153741,
         52376,
         62436,
         127247,
         72042,
         152025,
         247674,
         196798,
         19222,
         299822,
         33794,
         74860,
         32161,
         21795,
         21766,
         19237,
         9639,
         64792,
         14833
      ],
      "backdrop_path": "/mTzOR0CMidk0H73tclCuY7Bd0U1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Runjuan",
               "gender": 0,
               "credit_id": "52fe4513c3a368484e047277",
               "name": "Suporntip Chuangrangsri",
               "profile_path": null,
               "id": 96011,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nualjin",
               "gender": 1,
               "credit_id": "52fe4513c3a368484e04727b",
               "name": "Siraphan Wattanajinda",
               "profile_path": "/vpd7m9xsF7fuHiRAT40C4vMYMUw.jpg",
               "id": 96012,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Somchit",
               "gender": 0,
               "credit_id": "52fe4513c3a368484e04727f",
               "name": "Tassawan Seneewongse",
               "profile_path": "/qPl3JJ5fMXqaHLfdiBbv68ql1R8.jpg",
               "id": 96013,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Choy",
               "gender": 0,
               "credit_id": "52fe4513c3a368484e047283",
               "name": "Sombatsara Teerasaroch",
               "profile_path": null,
               "id": 96014,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4513c3a368484e047289",
            "name": "Wisit Sasanatieng",
            "profile_path": "/62HuEYrP5NuLYsXYKIRycpfE2WT.jpg",
            "id": 28233,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.508774,
      "production_countries": [{
         "iso_3166_1": "TH",
         "name": "Thailand"
      }],
      "id": 26687,
      "vote_count": 12,
      "budget": 2000000,
      "overview": "Set in 1934 Siam, the story involves a young pregnant woman named Nualjin who's searching for her missing husband. She comes to stay in the spooky rural mansion of a widow, Runjuan.",
      "similar": [
         682,
         826,
         1690,
         1907,
         2667,
         76494,
         110415,
         80278,
         282035,
         7555,
         1370,
         505177,
         49530,
         8838,
         421044,
         44363,
         13564,
         9801,
         19994,
         24402
      ],
      "original_title": "เปนชู้กับผี",
      "runtime": 100,
      "poster_path": "/9b0lAQBJF6ZD45huWibvcEglUSs.jpg",
      "spoken_languages": [{
         "name": "ภาษาไทย",
         "iso_639_1": "th"
      }],
      "production_companies": [],
      "release_date": "2006-11-02",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.penchookubpee.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Thailand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wisit Sasanatieng"],
      "runtime": 94,
      "synopsis": "The story tells of a pregnant village girl, Nualjan, who left her hometown in search of her lost husband. En route to the big city (Bangkok), where her husband had set off to on a business trip, Nualjan stops at a large estate. The house is owned by a mysterious and rich widow named Ranjuan, who lives in a separate house in the same compound. Madam Ranjuan secludes herself in her boudoir all day, welcoming a mysterious lover into her chamber every night. Nualjan quickly discovers that the house and its members hide some fairly serious mysteries. After spending several fearful nights at the estate, she decides that she needs to continue on in her search for her husband. Unfortunately, fate has other plans for her, as she goes into labor. With a newborn infant, she is in no condition to wander the streets of Bangkok searching for her husband. Despite her reservations about the spooky old house she has found herself in, she settles in temporarily as she adjusts to the demands of new motherhood. She soon realizes that most of the staff and family at the estate are at the very least bizarre and most probably linked to the spirit world to some degree. Her only friend in the dark, brooding house, is a fellow servant woman called Choy, who tells Nualjan frightening stories about the history of the house and its in inhabitants. If the houses owner, Madam Ranjuan, is not strange enough, her Grandmother Erb is a crazy old woman who lives in a shack behind the garden and clutches a scary-looking baby doll. In her daily strolls around the grounds, Nualjan often finds a ghostly little girl who wants her to come and play. Additionally, there is the unknown lover who frequents Madam Ranjuan's bedroom who Nualjan never recalls seeing coming or going from the estate grounds. Nualjan soon begins to understand that the mysteries surrounding the strange house not only center around its unusual household members. She comes to realize that her coming to the estate may have been more than a coincidence. Her fate may also be inexplicably linked to the mysteries of this strange mansion in the woods.",
      "writers": ["Kongkiat Khomsiri"],
      "originalLanguage": "Thai",
      "imdbLink": "http://www.imdb.com/title/tt0950500/",
      "coverLink": null,
      "actors": [
         "Suporntip Chuangrangsri",
         "Tassawan Seneewongse",
         "Siraphan Wattanajinda"
      ],
      "reviews": [
         "It's no secret that I'm a fan of writer-director Wisit Sasanatieng's movies - Tears of the Black Tiger, and Citizen Dog. What's excellent and probably the hallmarks of the director currently are the stunning visuals, wonderful colors, and story lines which are highly imaginative. With Tears, it was an amalgam of cultures for a distinctive and eclectic mix of what's Thai, and the Wild Wild West. In Citizen Dog, the fusion of fantastical elements, song, and comedy endears it and at the same time, warms your heart. But when this project was announced, I admit I was a bit apprehensive. I have not fancied many Asian horror movies of late, because of the usual formulaic stories and the employment of cheap shock tactics which bore. At times, scenes become unintentionally comedic, coupled with bad makeup and cheesy special effects, which mar whatever potential the movies could have achieved. The horror genre is no doubt a money spinner, and many times, quality is compromised when everyone jumps on the same bandwagon, knowing audiences will still lap them up despite the inferior product. The Unseeable, however, managed to evade the negative connotations as put forth. I guess my trust in Sasanatieng's vision remained unwavering. The story, when finally pieced together, remained coherent, even though at some points, it felt that the pacing could be picked up a little. Never rushed, it took a very measured method to introduce characters, their backgrounds, and the explanation of, well, what goes bump in the night. The story tells of a pregnant village girl, Nualjan, who left her hometown in search of her lost husband. En route to Bangkok, she gets put up at a boarding house, with few inhabitants, and owned by a mysterious rich widow Ranjuan who lives in a separate house in the same compound. Making few friends, and slowly becoming the disdain of the housekeeper, Nualjan encounters inexplainable incidents and strange folks, helped in no way by stories about the spookiness of the premises. The usual motley crew of horror movie characters - an old scrawny lady, a young child, and plenty of shadowy figures. The narrative structure did seem to stick to the usual formula though, with the final twist ending (twist endings themselves are becoming so common, it's difficult for filmmakers to imagine something more breakthrough). At times, you will also feel that despite the red herrings, your gut feel about how things will turn out, will probably correct. While the revelation explained and tied up loose ends, it did however demonstrate that it doesn't seem to want to end. Gone are the usual bright pastel color palette that we associate Sasanatieng's movies with, and in place for The Unseeable, are strained colors with a general greenish tinge, in line with the mood and atmosphere created for horror. I felt the filmmakers achieved their objective of creating a horror movie which doesn't capitalize on CGI and special effects, that if not done right, relegates it automatically together with those of dubious quality. Relying on tight angles and excellent sound editing, I admit that yes, watching The Unseeable did give me the chills, especially during its revelatory scenes. I believed the movie's title in Thai was a little spoiler in itself, so please don't try to translate it until after you've seen the movie. My faith in Wisit Sasanatieng continues, and I for one am eagerly anticipating his take on the martial arts genre with Armful, currently in production.",
         "Pregnant Nualjan is on the road, walking, and in discomfort. She comes upon Madame Ranjuan's house, which seems to be an inn within a walled, gated compound. Ms. Somjit works as maid for for Ranjuan. Choy lives on the compound as well. Nualjan is looking for her violinist husband Chob, who has gone missing. Choy is quite the chatterbox. Somjit is imperious with Nualjan and Choy. Somjit deigns to allow Nualjan to stay until she finds (hopefully soon) a new place to stay. Choy and Nualjan are relegated to the guest quarters, and told forcefully to stay away from the main building, where Madame Ranjuan lives. There's a shack on the compound where Grandma Erb lives; she's reputed (by Choy) to be crazy, reclusive, and next to silent. To add to the fun, there's a crumbling shrine on site on which Ms. Somjit regularly drops offerings of food. Someone apparently takes the offerings. Plus there is some man who digs in a garden area, but only at night. Lastly, there have been sightings of a long-haired woman using the swing on the 'rain tree' at night. Supposedly she committed suicide by hanging at that spot. Creepy setup, check. Nualjan explores a bit timidly. Ms. Somjit reads her the riot act for that, but then gives her a small tour, and some history. Somjit asks Nualjan whether she believes in ghosts, and gets a negative. Somjit, on the other hands, is very much a believer. Choy is not impressed; apparently Somjit tells everyone the same stories. That night, though, Nualjan wakes up to see a small girl, who challenges her to follow. This results in trouble again from Somjit. The baby arrives. Various odd things happen. Madame wants to see Nualjan and the newborn. Then she wants to see them both everyday. Nualjan sees the little girl again, and follows her into yet another building on the compound. Choy follows. They visit Grandma Erb, but do not wake her up. The next morning she leaves her child with Madame Ranjuan, who promises to have Ms. Somjit return the child the afternoon of the same day. Nualjan has some bad dreams. Ms. Somjit warns her against poking around in the antiques room again. Perhaps it was not a dream? She takes a walk, finds Chob playing his violin. He tells her that he has been at the compound for some time, as Madame Ranjuan's lover. She wakes up later, in the evening, wondering where her baby is. So, what's left here? Why is the Madame interested in the baby? Did Nualjan actually see her husband or something else? What is Grandma Erb up to? What of the hanged woman and the little girl with anklets? Do the loops get closed? Spoilers below. Nualjan confronts Ranjuan, and a number of issues get exposed. Chob was Ranjuan's husband, but was going to leave her since she was barren and Nualjuan had conceived. Choy is the 'vampire' who ate the umbilical cord and the offerings at the shrine. Chob is the man who is digging, but only at night, for his own corpse that Ranjuan buried after killing him. The girl ghost does not run this time, but does not explain either. Toward the end, Nualjan is surrounded by ghosts. She falls into the antiques room, where Somjit is eating rats. Somjit had died from a fall down stairs after seeing that Madame had killed Chob. Doors open and close. Behind each lie more ghosts of the compound. After that, even darker realizations come to the fore regarding the girl with the anklets, Erb, and Nualjan. ------Scores------ Cinematography: 5/10 Woof: buy a better camera system for the next movie. I experienced this film on streaming Netflix. The visuals are poor quality throughout: soft focus, low contrast, dim in broad daylight, grainy. On the other hand, the film is low on camera shakes and jerks, and reasonable on framing. Sound: 10/10 Much better than the visuals. Acting: 8/10 No particular problems. Screenplay: 10/10 Good story, well executed.",
         "Unseeable is to me structured like the more recent batch of Japanese psycho-horror dramas. Which isn't a bad thing. As err.. Dick Steel stated the colors aren't super bright and crisp which seems to be the new thing to do, but tinged with with an earthiness which really works and casts a rather sombre 'phantom-like' mood the proceedings. I must admit i was rather surprised with the outcome and revelations in the end are just 'boom, boom boom.': one after another, it's the trying to keep your head above water in a fast moving current. I won't give away anything, because to mention too much about the plot makes the rest pretty transparent. But I do suggest people check this one out if they like their horror with a bit of drama. It's not as fractured as \"A Tale Of Two Sisters\" but I'd say it's just as great a story."
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [],
      "summaries": [
         "Nualjan's life took a happy turn when violin player Chob arrived in her village Cholburi. It was love at first sight and she got pregnant. Then Chob told her he will leave for business to Bangkok for a few days. He will be back soon he promised, but Chob never came back. Now, months later, Nualjan can't wait any longer and decides to search for him. On her way to Bangkok, she arrives at a mysterious pension. Supervisor miss Somjit refuses to let the very pregnant Nualjan stay at first however. She finally relents, but demands that she stays away from the main house, where the owner madame Ranjuan resides. Nualjan soon finds out there's something going on on the premises. Why does she see moving shadows? Who is the man cutting wood in the middle of the night, who is the old woman living in a garden shed? Only Choy, another guest, seems interested in her and is willing to tell about the disturbing peculiarities of the estate. But not everything.",
         "When a pregnant country girl leaves home to search for her missing husband, she finds refuge at a mysterious estate whose inhabitants hold more secrets than she may wish to know."
      ],
      "budget": 0
   },
   "movielensId": 132565,
   "movielens": {
      "languages": ["ภาษาไทย"],
      "releaseDate": "2006-11-02",
      "dvdReleaseDate": null,
      "directors": ["Wisit Sasanatieng"],
      "runtime": 100,
      "movieId": 132565,
      "title": "The Unseeable",
      "mpaa": "",
      "actors": [
         "Suporntip Chuangrangsri",
         "Siraphan Wattanajinda",
         "Tassawan Seneewongse",
         "Sombatsara Teerasaroch"
      ],
      "imdbMovieId": "0950500",
      "originalTitle": "เปนชู้กับผี",
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Set in 1934 Siam, the story involves a young pregnant woman named Nualjin who's searching for her missing husband. She comes to stay in the spooky rural mansion of a widow, Runjuan.",
      "tmdbMovieId": 26687,
      "avgRating": 2.9,
      "releaseYear": "2006",
      "numRatings": 5,
      "posterPath": "/9b0lAQBJF6ZD45huWibvcEglUSs.jpg"
   }
}