{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "child molester",
            "id": 18486
         }
      ],
      "imdb_id": "tt2171902",
      "video": false,
      "title": "Happy Valley",
      "recommendations": [
         141635,
         84350,
         177298,
         349441,
         22241,
         104732,
         268297,
         358927,
         188532,
         83373,
         138217,
         302818,
         362216,
         339258,
         173192,
         168771,
         328930,
         343725,
         15730,
         344039
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4dfc9251416c91122bc1",
               "name": "Amir Bar-Lev",
               "profile_path": "/a1AelFlrowoHrDYWindzYdXO8zJ.jpg",
               "id": 91452,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55dba6c3c3a3680a460002d2",
               "name": "Dan Swietlik",
               "profile_path": null,
               "id": 19018,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57e81263c3a3683521012d34",
               "name": "H. Scott Salinas",
               "profile_path": null,
               "id": 62705,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 1.917632,
      "production_countries": [],
      "id": 250745,
      "vote_count": 22,
      "budget": 0,
      "overview": "The children of \"Happy Valley\" were victimized for years, by a key member of the legendary Penn State college football program. But were Jerry Sandusky’s crimes an open secret? With rare access, director Amir Bar-Lev delves beneath the headlines to tell a modern American parable of guilt, redemption, and identity.",
      "similar": [
         315598,
         315527,
         315602,
         315582,
         315583,
         4942,
         9655,
         9291,
         22881,
         10637,
         293767,
         13416,
         321741,
         9276,
         9563,
         10066,
         9767,
         13680,
         10393,
         14709
      ],
      "original_title": "Happy Valley",
      "runtime": 98,
      "poster_path": "/mgUyQNgZaDoPCOHVE65UrZLl266.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2014-11-14",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Amir Bar-Lev"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Amir Bar-Lev"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2171902/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTk0OTkxMjkxOF5BMl5BanBnXkFtZTgwMzg1NjUxMzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [],
      "reviews": [
         "he titular \"Happy Valley\" that director Amir Bar-Lev's fascinating documentary about the Penn State sexual abuse scandal focuses on sits right in my back yard. Growing up the son of a rabid college football fan (go Temple!), I spent dozens of freezing cold Saturday afternoons watching my father's pitiful Temple Owls get their asses handed to them. Several of those beatings came at the hands of Joe Paterno's Penn State Nittany Lions (that's pronounced \"Nit-knee\"). My father hated Joe Paterno. \"He's an a**hole,\" he would tell my 10 year old self. My grandfather, a Temple alumni and highly regarded high school football coach, actually knew Joe Paterno personally. He was much more diplomatic. \"He thinks he's God,\" is how he put it, if I recall correctly. And so, my opinions on Joe Paterno, Penn State and their fans have been likely influenced since the day I was born, making me an easy mark for Bar-Lev's slyly biased documentary. For those unfamiliar with the horrific events that surround Happy Valley, it goes like this: in 2011, Penn State football assistant coach Jerry Sandusky was accused and convicted of 45 counts of sexual abuse to minors that occurred between 1994-2009. Sandusky met his victims through a non-profit charity for wayward youths he funded called \"The Second Mile,\" earning their trust through various predatory means (free games, meals, attention they weren't getting at home). As if that weren't horrible enough, it was eventually revealed that someone had caught Sandusky raping a boy in the showers, alerted head coach Joe Paterno who in turn alerted his superiors. And then nothing. No police. No disciplinary actions. No justice. And that's what Happy Valley takes aim at. We can all agree that Jerry Sandusky is a monster, but what of the revered man who played a part in just letting the monster roam free, enabling him to damage more lives than he already had? Shouldn't he have to answer for his part in all of this? The answer, if you're a Penn State football fan, is a resounding, \"NO!\" Bar-Lev populates his documentary with folks who are varying degrees of pro-Paterno. From his own immediate family who will defend their father's legacy and character to their own graves right down to the flustered Penn State football fan sitting in front of his bedroom wall scrapbook of Penn State pendants, posters and plaques complaining about everyone getting bent out of shape about this whole thing and not focusing on what really matters: football. Rather than force a reaction from his subjects, a la Michael Moore, Bar-Lev takes a page right out of The Daily Show with Jon Stewart's book and simply lets them talk and talk and talk until they hang themselves with their own words, not even realizing it in most cases. It's a funny trick, for sure, but after the 5th time you see it unfold you kind of get the point. These people are blinded by their fandom, biased by their own admiration for Joe Paterno. From the fans who traveled to take a photo with the since removed bronze Joe Paterno statue to the fans who rallied and then rioted when Paterno was fired from his head coach position in the aftermath of the FBI report that detailed his involvement in Sandusky's web of nightmares, these people will not stray from St. Joe's side. But who is Joe Paterno and why does he have this effect on people? Happy Valley does its due diligence to give a little bit of history on Paterno and his good deeds throughout the years. That juxtaposed with video of the frail, fragile coach during his last few months make a case that he was a good man, flawed, but rooted in good intentions. Of course, we all know the old adage about good intentions and where the road they're paved in lead to. I believe they lead to the Orange Bowl, according to this gentleman with the Penn State logo painted on his naked torso. In the end, Happy Valley is a fascinating look at this culture of fandom that even my own football-obsessed father can't reconcile. To be so blinded by winning at all costs that you'd sacrifice the innocence of a child\u0085 it's tragic and infuriating. And that's the feeling you'll get while watching this film. I only wish that it wasn't as one-sided, albeit ever so subtly, so that the other side's case wasn't presented in the condescending tone it is. Of course, how are you supposed to defend someone embroiled in a conspiracy of this nature without looking like a complete asshole? These are the kinds of problems us Temple fans never have to worry about.",
         "I liked this documentary very much. Watching people involved in the unchecked crimes of Jerry Sandusky give their side of the story was much more revealing than reading quotes. Matt Sandusky, Jerry's adopted son, impressed me as thoughtful and sincere. He did his best to be fair to Sandusky, saying that ninety percent of the time he spent with the man was everything a kid would want--association with fame, access to football games, etc.--but the other ten percent \"would destroy you.\" I was shocked when Matt, at the end of the film, said that not one single person from the Sandusky family contacted him after he went public about how Jerry molested him. What kind of people are Dottie and her relatives? If they didn't believe him, you would think someone might want to talk with him and ask him to take back his \"lies.\" But no. That didn't happen. The one thing missing from \"Happy Valley\" was any mention of the well-known fact that Paterno decided that some of his players who broke into a residence and beat people should not be put into the legal system. Paterno clearly believed that he and his players were above the law. He decided the law-breaking players would clean up the stadium after some games. It's also known that then-President Spanier and other higher-ups in the Athletics Dept. all agreed that Paterno was in charge of things like this. This piece of history is a big deal. It should have been in the documentary. The behavior of some of the residents of Happy Valley was detestable. There's an extended scene in which these idiots don't hesitate to grab a sign from an older man making his negative view of Paterno known at the statue of the coach. A woman who wants a selfie with the statue pushes the man aside with her body. Others get in his face with red-neck-type logic. It's scary to see how conformist the community could be---all worshiping a football program. This film had to be made, and it was made well.",
         "The crimes of Jerry Sandusky and the facts regarding the cover-up are well known. What this documentary, perhaps unwittingly, uncovers is how football enthusiasm at Penn State had long ago metastasized from from a sport to a full blown cult. The disturbing and unhealthy blind obedience to all that is \"football\" is on full display. The son of Joe Paterno, who covered for the pedophile, Joe Jr., says with no sense of irony whatsoever, \"If I don't see it, it didn't happen. Some would call that denial, but it works for me\". And then he laughs. He is not referring to Sandusky's crimes but rather to criticism of the cover-up. But it clearly speaks volumes to the mentality that created the safe haven for a serial child rapist and would do it all again given the same set of circumstances. A student fan compares Joe Paterno, again with no awareness of inappropriateness, to Jesus. Jesus would never have turned a blind eye to the suffering of a child. I thought that the conviction of Sandusky the reprimand of Penn State by the NCAA would confer a sense of justice and finality to what can only be described as complete moral failure by every individual at every stage of this more than 20 year crime spree and cover-up. After watching this documentary, however, I am disturbingly convinced that something about Penn State football is still rotten at the DNA level, and that ANYTHING could happen again and it would come as no surprise. The disturbing resolution is not the fault of this very good documentary. It is the fault of the morally bankrupt individuals who still run the town. UPDATE: 6/2/17, Ex-president Spanier, 68, sentenced to 4 to 12 months, with the first two to be spent in jail and the rest under house arrest, athletic director Curley, 63, received a sentence of 7 to 23 months, with three in jail, former vice president Gary Schultz, 67, sentenced to 6 to 23 months, with two months behind bars. None of them will spend more than a few months in actual jail. It was reported to these men by Joe Paterno that Mike McQueary saw Sandusky raping a boy in the showers in the Penn State locker room late at night. They did NOTHING!!! Another 10 years would go by before Sanudsky was finally stopped and brought to justice. Who knows how many more children were abused and raped because these good men allowed a monster to his undeserved freedom. Why has it taken 16 years to bring these enablers to justice?",
         "\"St. Joe\": What Penn State, College Station, and the world called Joe Paterno before the Jerry Sandusky indictment. No one ever called my town, Columbus, \"Happy Valley,\" but when Ohio State defeats Michigan, it's a happy valley indeed. That euphoria over a football program as successful as Penn State under head coach Joe Paterno with its spell cast so widely is the engine that drives a community to miss the signs of crime such as assistant coach Jerry Sandusky's abuse of young boys. Amir Bar-Lev's documentary, Happy Valley, covers the historical bases of Sandusky's conviction on multiple counts and Paterno's eventual firing (and death a few months later) for not doing more to bring justice for the abused boys. Even Sandusky's adopted son, Matt, who is the most talking head in the doc, waits until boys have testified against Sandusky to confess he lied—he was abused. That confession is at the heart of this slowly competent documentary, for it encapsulates the ambivalence of a community so mesmerized by football and its cast of characters that it takes a while to acknowledge some of the actors have feet of clay. Sandusky is easy—he was seen in the showers with boys—but Paterno, the beatified coach (the statue on campus is now gone, as if he were Hussein or Stalin), challenges their understanding of a morality that extends beyond just legally telling a superior about an incident, as Paterno did. Bar-Lev's is as even-handed as could be: the media is held up to harsh light with its aggressive, predatory pursuit of the sensational; the NCAA is never fair enough; and the University, from president on down, can't get it just right. And so it goes—this well done doc, despite the sometimes vacant talking heads, shows few participants not caught up in the hoopla. It sure makes me think Ohio State's Jim Tressel dust up was just a skirmish in an enduring battle for the hearts and souls of students and the communities where they live.",
         "For those wanting to purchase this you need to know that this is nothing more than what has been shown in the media already. As for the composition of media coverage of the entire Sandusky/Penn State events this film is well put together. As for much that wasn't in the media already there isn't much there. If you watched any news or ESPN during the exposure of this little of this film is new. It looks like something that ESPN would put together as a story. I wish I would have know about the content before I paid to watch it on pay per view. It does bring a very nice light on a well respected coach and person, Joe Paterno. Save your money on pay per view and watch it later on regular television.",
         "Just to get this out of the way: first, I am a huge fan of Amir Bar-Lev, a very intelligent and respectable filmmaker who has made two of the most interesting documentary films of the last decade. Both 'My Kid' and 'Tillman' were accomplished, gripping, and worthy of all the praise they received. So it is with sincere regret that I have to rate this project as one of complete and utter boredom. So much so, in fact, that I actually fell asleep halfway through (no exaggeration -- it was that dull). Unfortunately, Amir wades into the thick of the muck all too eagerly, with the attitude of a Hollywood wunderkind who is about to show all the inherent vice in the heart of America; what results is more of a exposition of Film Industry superiority reigning over ordinary, hard-scrapple Middle America. The subject matter, however, is secondary to the desperation in trying to get this movie into theaters by any means possible, including exploitation. Each one of the interviews is conducted, one after another with wide-eyed, sincere, painfully naive gerbil-like players in the giant fishbowl of absurd media, where the central question, who knew what? is debated over and over again to the point where we really can't keep track of any of them and begin to wonder why it all matters. Okay, so the basic premise is that there is a coach who is buggering youngsters and his boss is aware that something is going on (by an unsubstantiated third party) and so the whole city has come to a screeching halt in order to take sides on the issue. We've heard the same boring details hundreds of times already, as the media loves to continue to belabor this type of story anyway, and so there isn't much more hidden motive to uncover. Simply stated, the film doesn't show us anything beyond the obvious: the coach of a famous football team likes to play around with young men. Is this a revelation? Doesn't anyone seem to notice that football is a homoerotic sport to begin with? As far as the outcome of the case, we see thousands of Penn State students marching in defense of their beloved Joe Paterno, as if it's a giant demonstration in response to the bombing of a Middle Eastern elementary school -- which of course, none of them ever would care about. Sad to say, the only thing that seems to get these kids off their respective asses is the idea that they might not have a winning football season. That lets me believe that Bar-Lev might have had an actual point to making the film. But it is all watered-down with a mind-numbing dose of Americana: as the debate rages, just what does the admission mean for Penn State and the future of football in general? And who cares? It's really a sorry statement that a good filmmaker like Bar-Lev has to stoop so low as to pick up National Enquirer-like subjects to get his films financed. But I guess that's what's happened to documentaries -- since no one bothers to watch anything intelligent, we have to resort to exploitation to get a movie into a theater. Overall, it is a sad reflection on the state of documentaries as a whole.",
         "Disclaimer: I have always had an appreciation for the Penn State football program. My mother was a Penn State fan (not an alumnus though), and she would always say that Joe Paterno represented class, while almost in the same breath denounce the legendary coach of my favorite college team, Barry Switzer as being anything but. Even though I am a loyal Sooners fan (though not an alumnus of OU, simply having been born in Oklahoma), I could appreciate what JoePa and Penn State stood for. I couldn't help but think of that as I watched this documentary. In his lifetime Joe Paterno went from being a mere man into being a mythical one. It was one legend right after another, and I don't believe it matters who you are, if left unchecked, a person can buy into their own hype. I believe that happened with Joe Paterno, and it has left an impression on a program, a university, and a community struggling to make sense of it all. The whole truth may never fully be known. From watching this I got the sense that Joe Paterno genuinely wanted to do the right thing. Having however the myth of \"St. Joe\", I believe he hindered himself from doing more because he couldn't believe a monster had gotten so close to him, and he couldn't live with what that would do to his perception. His son seemed to confirm as much as he stated both his parents were very well read, but naive about many other things surrounding them. Joe was too wrapped up in his own myth. This documentary goes to great lengths to show how others have bought into the myth as well, and their support is as blind for him as it is deep. On the one hand they'll acknowledge what was done to the kids Jerry Sandusky was supposed to be helping was terrible. Just as quickly though they will try to absolve Paterno of any wrongdoing, saying he reported what he knew. In other words, the bare minimum. For a man that had built a reputation of going above and beyond the bare minimum, this seems to me, unacceptable. Yet they don't see it. However, the lasting impression I got from watching this, and honestly I believe this was the point of the documentary, was that there is no prototypical child abuser, and that it is possible to dupe many into thinking one thing about you when something else may be the reality. That's a sobering thought for anyone. The line that sums up this documentary for me though is quote \"You should never build statues for guys who are still alive.\" True character is revealed when nobody else is looking. We may think we know someone, even if only by reputation. That reputation however may be little more than a house of cards ready to fall. In the end, regardless of what Joe Paterno knew or didn't know, what he reported or didn't report, the carefully crafted myth has come crashing down.",
         "Great job demonizing the greatest man in Happy Valley history. The man who drove hundreds of young men to greatness in their lives both in and out of football. And the man who inspired and led an entire, extended community. All for his tangential part in a horrific, ongoing, ubiquitous evil that is one small corner of the larger, national NAMBLA abuse of young boys by gay men and the progressive establishment that not only enables them but promotes them. Doubt me? Where is the condemnation of the judge who ripped a nine-year-old boy, Matt, from his biological family and presented him to the pedophile Sandusky? Despite the mother's plea not to, including the allegation that Sandusky played mind games with the boy and that he did inappropriate things to him? Why didn't that judge \"do more\"? Why didn't that judge investigate the mother's accusations? And why, despite the accusations, did the judge award this boy to this man? Why no inquiry, no documentary about the judge? Why no mention of the judge's culpability in this evil during this documentary? Why no inquiry into the role of NAMBLA and the progressives who promote it? No investigation into those who cowed a judge into ordering the Boy Scouts to put gay men into the pup tents of prepubescent boys? And when THOSE lawsuits ensue, will anyone investigate the role of that judge who precipitated the predation, or the progressives who remonstrated for it? Of course not. They'll blame the Boy Scouts for what was forced on them by the progressive establishment. They'll blame the institution that transformed millions of boys into responsible, moral young men for over a century. They'll not rest until they win that scalp for their belt. Mark my words. Always the institution that was forced by the progressives to accede to the NAMBLA agenda. The Catholic Church to allow gay priests. The Boy Scouts to allow gay Scout leaders. Society--including Penn State--to give the benefit of the doubt to the gay man in their midst. Can you imagine if Joe Paterno had come running, yelling \"Pedophile! Pedophile!\" when first given the ambiguous accusation that \"something\" \"might have happened\" in the shower between Sandusky and a young boy? Paterno would have been brought down by the same progressives in the media and culture who claim he didn't \"do enough\" (especially ESPN and the NCAA and the others in the progressive establishment), as a homophobic bigot without any proof. A Neanderthal who hates gays. Better to keep it \"in house\" and let the administration vet the charges. But the progressives want The Moral Man's scalp. And they don't rest until they get it. And in doing so, ignore the real culprits.",
         "The film does not consider the sources of info. A major player in the film is Matt Sandusky. He is portrayed as almost a hero in the film, without mention of his multiple convictions for assaulting his wife, her protection from abuse orders, his mentions of lying to police for years, as well as none of his brothers and sisters, who shared his room in Sandusky's house. The narrative of the film was decided before it was filmed, and that's not what a documentary should be. The Penn State fan was literally a fanatic, and didn't seem to represent the student population well. This is more of a conceived story than a factual documentary.",
         "Jerry Sandusky's unspeakable acts sent shockwaves in the Penn State campus. Jerry Sandusky is no longer part of society, and that is a very good thing, because his disgusting acts preyed upon young children is as horrific as it gets. Amir Bar-Lev's documentary \"Happy Valley\" focuses on how the Sandusky crimes impacted the Penn State campus and its \"happy valley\" society. Sandusky was a former Penn State football assistant coach who opened up a camp for disadvantaged children. Penn State society thought the world of Jerry, which included his boss the infamous Joe Paterno. Then when Sandusky's child molestation charges came into the limelight- a whirlwind of controversy, divisiveness, and shame soon followed to the campus and its city. Paterno was in the middle of the controversy as he was a central figure blamed for not reporting when he was aware of Sandusky's acts. By no means \"Happy Valley\" is an easy watch, but an important watch no doubt on how one man's despicable acts could have profound impact on first the victims, but also on an entire society; Bar-Lev excels in bringing that to the forefront. \"Happy Valley\" will in no means make you happy, but it is recommended for its societal focus at how one man's crime impacts an entire community & university. **** Good",
         "A well done documentary about how people react when the people and things they believe in turn out to be an illusion. Being from the 'liberal west coast', I've never understood how football could possibly reach the level of reverence it enjoys elsewhere. But here it is in all its glory... supported by hoards who seem more concerned with sportsball than anything else in their lives -- including justice for abused kids. Well okay, maybe they care for the kids as long as the football games don't stop and no one attacks their coach. For without football, we are nothing. In all fairness, the documentary did include representatives from the non-reverent point of view. But it's witnessing the reactions of people who have so much invested in a sport that has achieved cult status, as well as the mechanics of group think, that make this an interesting doc. A good study in the sort of self-righteous mentality that starts wars. But who am I judge? I'm a west coast liberal. I'd rather do almost anything else than watch football.",
         "I remember all the national headlines from a few years ago concerning Penn State coach Jerry Sandusky's arrest on child sex abuse charges, and of course whether or not legendary beloved head coach Joe Paterno did enough to stop it- and how much he knew or didn't know about the whole thing. This documentary observes the year after Sandusky's arrest in the surrounding community known as \"Happy Valley\". This is a community that for decades had been a place of pride on Paterno's winning streak, his commitment to the school/team, and his record number of players who actually graduated with degrees. The film contains dozens of interviews with those who knew both coaches, some who were actually molested by Sandusky (including his own adopted son), as well as folks in the community debating about Paterno's actions/inactions involving the abuse. It's just heart-wrenching at times. The scene involving Paterno's statue, as tourists attempt to get photos next to it while this guy holds a sign up (making some not-so-good remarks about the coach) I think is one of the most powerful scenes I've ever seen filmed for a documentary. There was also a lot of debate about whether the NCAA 's punishment of the school was fair. I have some issues with that myself- like should the students have been penalized for it? The school was forbidden from playing in games for FOUR years! WTF?? That's pretty much these athletes' entire college career-?? Well, anyway, this film is one of the best docs I've seen in some time. Definitely worth checking out sometime for sports and non-sports fans alike..."
      ],
      "genres": [
         "Documentary",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "A&E IndieFilms",
         "Asylum Entertainment",
         "Passion Pictures"
      ],
      "summaries": [
         "The town of State College, the home of Penn State University, has long been known as Happy Valley, and its iconic figure for more than 40 years was Joe Paterno, the head coach of the school's storied football team. His program was lauded for not only its success on the field but also its students' achievements in the classroom. And Paterno took on mythic national stature as \"Saint Joe.\" But then, in November 2011, everything came crashing down. Longtime Assistant Coach Jerry Sandusky was charged with 40 counts of child sex abuse, setting off a firestorm of accusations about who failed to protect the children of Happy Valley. Was Sandusky's abuse an \"open secret\" in the town? Did Coach Paterno and the Penn State administration value their football program more than the lives of Sandusky's victims? Filmed over the course of the year after Sandusky's arrest as key players in the scandal agreed to share their stories, Happy Valley deconstructs the story we think we know to uncover a much more complicated and tragic tale.",
         "The town of State College, the home of Penn State University, lies at the heart of an area long known as Happy Valley. Its iconic figure for more than 40 years was Joe Paterno, the head coach of the school's storied football team, who took on mythic national stature as 'Saint Joe.' But then, in November 2011, everything came crashing down. Former Assistant Coach Jerry Sandusky was charged with 40 counts of child sex abuse. Filmed over the course of the year after Sandusky's arrest, HAPPY VALLEY chronicles the ensuing firestorm of accusations about who failed to protect Happy Valley's children. Director Amir Bar-Lev creates a parable of guilt, responsibility, and identity for a small town caught in the glare of the national spotlight.",
         "A documentary that observes the year after Pennsylvania State University assistant football coach Jerry Sandusky's arrest on child sex abuse charges."
      ],
      "budget": 0
   },
   "movielensId": 132590,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-11-14",
      "dvdReleaseDate": null,
      "directors": ["Amir Bar-Lev"],
      "runtime": 98,
      "movieId": 132590,
      "title": "Happy Valley",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "2171902",
      "originalTitle": "Happy Valley",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["hkQGUtDpcoM"],
      "plotSummary": "The children of \"Happy Valley\" were victimized for years, by a key member of the legendary Penn State college football program. But were Jerry Sandusky’s crimes an open secret? With rare access, director Amir Bar-Lev delves beneath the headlines to tell a modern American parable of guilt, redemption, and identity.",
      "tmdbMovieId": 250745,
      "avgRating": 3.39583,
      "releaseYear": "2014",
      "numRatings": 24,
      "posterPath": "/mgUyQNgZaDoPCOHVE65UrZLl266.jpg"
   }
}