{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "photographer",
            "id": 1003
         },
         {
            "name": "shotgun",
            "id": 1366
         },
         {
            "name": "religion and supernatural",
            "id": 3684
         },
         {
            "name": "mirror",
            "id": 46951
         },
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "amityville horror",
            "id": 194834
         }
      ],
      "imdb_id": "tt0106262",
      "video": false,
      "title": "Amityville: A New Generation",
      "recommendations": [
         41848,
         55377,
         52263,
         41671,
         27214,
         38499,
         38500,
         44909,
         35978,
         110588,
         28344,
         312131,
         25753,
         153998,
         16235,
         27345,
         25395,
         84942,
         223732,
         30654
      ],
      "backdrop_path": "/nWnuGsopr2TwCt9Pxo5tXYnkqCI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Keyes Terry",
               "gender": 2,
               "credit_id": "52fe45209251416c91028567",
               "name": "Ross Partridge",
               "profile_path": "/hxGq9iyJXouZh4WXXISKF3CBVNg.jpg",
               "id": 45396,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Orderly",
               "gender": 2,
               "credit_id": "52fe45209251416c91028571",
               "name": "Robert Harvey",
               "profile_path": "/ibmdNCe2BlCwxxDLEeXtmqeHSmC.jpg",
               "id": 62100,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Llanie",
               "gender": 1,
               "credit_id": "52fe45209251416c91028575",
               "name": "Lala Sloatman",
               "profile_path": "/2cz5bD1xlUiKkMIF5k2CgVEvAwN.jpg",
               "id": 22072,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Dick Cutler",
               "gender": 2,
               "credit_id": "52fe45209251416c91028579",
               "name": "David Naughton",
               "profile_path": "/ehDE47qkUux5a18Mi7zqReBj79b.jpg",
               "id": 14463,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pauli",
               "gender": 2,
               "credit_id": "52fe45209251416c91028581",
               "name": "Richard Roundtree",
               "profile_path": "/3OyAx3Vrv1mQLOvl7YHaIaFwDuW.jpg",
               "id": 6487,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Janet Cutler",
               "gender": 1,
               "credit_id": "52fe45209251416c9102857d",
               "name": "Barbara Howard",
               "profile_path": null,
               "id": 58814,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Detective Clark",
               "gender": 2,
               "credit_id": "52fe45209251416c91028585",
               "name": "Terry O'Quinn",
               "profile_path": "/o6zGsvhx8klAofq8No6f3jByR42.jpg",
               "id": 12646,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Nurse Turner",
               "gender": 1,
               "credit_id": "52fe45209251416c91028591",
               "name": "Lin Shaye",
               "profile_path": "/erD3UM1YDkRS46D3XkhTSNXtRyg.jpg",
               "id": 7401,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe45209251416c9102858d",
               "name": "Robert Rusler",
               "profile_path": "/4LHRIK6ffdUax43WcSqdIZTMh2b.jpg",
               "id": 52306,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Morgue Attendant",
               "gender": 2,
               "credit_id": "52fe45209251416c91028595",
               "name": "Tom Wright",
               "profile_path": "/AlBgY9VySrLBhVsOJXtUXuflOGG.jpg",
               "id": 55270,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Suki",
               "gender": 1,
               "credit_id": "52fe45209251416c910285ad",
               "name": "Julia Nickson",
               "profile_path": "/zQzqbbfixENqr2NLp92EOtL7POQ.jpg",
               "id": 16578,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Cafe Owner",
               "gender": 0,
               "credit_id": "52fe45209251416c910285b1",
               "name": "Karl Johnson",
               "profile_path": null,
               "id": 551911,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45209251416c9102856d",
               "name": "John Murlowski",
               "profile_path": null,
               "id": 110834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45209251416c910285a3",
               "name": "Christopher DeFaria",
               "profile_path": "/lnR60TTNnX3sLqzK2ZRG6J4rmYz.jpg",
               "id": 66897,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45209251416c910285a9",
               "name": "Antonio Toro",
               "profile_path": null,
               "id": 110839,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.015232,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33519,
      "vote_count": 20,
      "budget": 1500000,
      "overview": "When young photographer Keyes (Ross Partridge) snaps a picture of a mysterious homeless man the subject insists he take a dark yet strangely beautiful antique mirror. Back at Keyes' home, the demonic forces of the infamous Long Island horror-house find new life through the mirror's frightening reflections. As unsuspecting victims gaze into the shimmering glass, they witness the",
      "similar": [
         11675,
         948,
         60304,
         24150,
         2288,
         979,
         280,
         9378,
         27346,
         273477,
         10185,
         26973,
         73861,
         11033,
         243940,
         13515,
         9913,
         15069,
         223485,
         1052
      ],
      "original_title": "Amityville: A New Generation",
      "runtime": 90,
      "poster_path": "/Ks0GNi0ZSL2So5V9cRlNAm0K1f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "A. Ninety-Three Productions",
         "id": 36394,
         "origin_country": ""
      }],
      "release_date": "1993-09-29",
      "vote_average": 2.8,
      "belongs_to_collection": {
         "backdrop_path": "/kPfuozrsE7pmFFolkR0xFicZDJT.jpg",
         "name": "The Amityville Collection",
         "id": 397842,
         "poster_path": "/stPXPasI1lvxJRJJuDCKBr6X836.jpg"
      },
      "tagline": "Terror Has a Reflection All its Own.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Murlowski"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Christopher DeFaria",
         "Antonio Toro"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106262/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzc4NTg1NTY4NF5BMl5BanBnXkFtZTcwMjAzMjEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ross Partridge, Julia Nickson, Lala Sloatman | See full cast and crew »"],
      "reviews": [
         "'A New Generation' is the third Amityville entry to base its plot around writer John G. Jones's premise of an item taken from the Long Island house that causes spectral misery and death for its new owners. First a lamp, then a clock, and now a mirror. However, this is also the first Amityville since 'The Possession' to directly tie in to the real- life events that started the whole series. This time around, Keyes Terry (Robert Partridge), an artist, is given a macabre-looking mirror by a homeless man one day. Soon enough, people around him start to die, eventually leading to his discovery that the mirror once hung in the Amityville house - indeed on the very night a man named Franklin Bronner (Sonny Montelli in 'Amityville II') murdered his entire family. Unfortunately for Terry, his discovery of the mirror isn't entirely coincidental, and he soon learns the truth about his past a truth he's kept buried since childhood. This 7th installment in the often worn-out franchise is something of a disappointment for me. Things were starting to pick up with the silly and uneven, yet entertaining 'It's About Time', and given how much this film tries to draw upon its roots - not the first episode, but the source material itself - it should have been better than it was. However, three trips to the same well with yet another evil artifact from the Amityville house with yet another explanation for the malign paranormal visitations is wearing on me, to say the least. One of the biggest weaknesses of the Amityville franchise is the steadfast determination by each set of producers to completely ignore every other episode in the series. On the one hand, it's perfectly reasonable that they don't want to be tied to someone else's continuity, but at the very least, they could maybe acknowledge story lines that have already been done and just possibly *not repeat them over and over again*. There's also something rather plodding about the way in which the story unfolds, doubtless due to the inevitability this repetition-fest brings. Since you already know what's going to happen, the carefully-paced build-up is simply slow and tedious. Or maybe it's just tedious anyway. Director John Murlowski probably could have done more to heighten the tense atmosphere associated with the mirror rather than simply having it flash red and emit chattering 'evil' voices, which lacks any kind of subtlety. There were times when characters seemed fairly unfazed by its otherworldly qualities. If they don't take it too seriously, why should we? Which is a shame, because 'A New Generation' has a more-than-capable cast. I was going to hold off on watching this until I saw the name 'Julia Nickson' in the credits. She captivated my attention just as she always does, and if anything, I was annoyed her part wasn't more extensive. Terry O'Quinn was equally charismatic and again, underused. Partridge himself in the lead role clearly fits the early 90s over-coiffed lumberjack-shirted square-jawed hero type, and while I'm not sure he really gave it the gravitas needed, it's not as if anyone here is performing Ibsen. The sets are also worthy of note, from the dramatic artwork filling Suki's room, to the claustrophobic corridors featured in flashback/supernatural sequences. Getting the look of these right is especially important given how certain sequences are repeated throughout the film to simulated fragmented memories. Clearly, Murlowski is more of a visual director rather than either an actor's director or one of horror. Unfortunately, it is meant to be a horror film, after all. 'A New Generation' sees the same race being run for the third time in 4 years. Add to this the lack of direction where it was really needed and the whole effort fails to stand as tall as it should. However, it should be acknowledged for its strong ties with the source material and some good actors in not necessarily their finest hours. Honestly, the ideal person for this is someone who hasn't seen any of the sequels past 'The Possession', for whom the story won't be such a massive deja-vu trip.",
         "The short synopsis of \"Amityville:A New Generation\" goes like that:a young photographer Terry Keyes receives a mirror as a gift and sees in its reflection a link to murders committed in Amityville decades before.And slowly the artists loft he shares with friends Suki,Dick and Pauli is turned into a living chamber of horrors,as they too fall prey to the dark seductive powers of the mirror.\"Amityville:A New Generation\" is an average horror flick at its best.There is a little bit of suspense and the characters are surprisingly likable,but the plot is slow-moving and the finale is laughable.I'm not an enthusiast of \"Amityville\" series,however this seventh installment is actually passable,if you are in the right mood.6 out of 10.",
         "This movie was not nearly as entertaining as the first couple of Amityvilles. I think it actually had a budget that broke the triple digits. The flashback scene to the nut house was genuinely scary. That's about it. The \"dancing demons\" were pretty hokey. The idea of highlighting an art show with a poor shmuck coming in and shooting his friends with a Supersoaker was less than Grade-A. That is why most people hate artists.",
         "\"Amityville: A New Generation\" wasn't all that bad, but really could've been better. **SPOILERS** Struggling artist Keyes Terry, (Ross Partridge) wife Llanie, (Lala Sloatman) and friend Suki, (Julia Nickson-Soul) try to make it with an art show, and manage to take a mystical mirror home. The rest of their friends, Dick, (David Naughton) and Janet Cutler, (Barbara Howard) think it's a useless purchase until a series of accidents plague them and their friends. As the strange occurrences begin to mount, Keyes begins to suspect that the mirror might be responsible. Doing a little digging into it's past, he discovers a startling secret that puts him and his loved ones in grave danger. The Good News: There's a couple of pretty decent things about this one. First of all, the different gags done with the mirror itself are pretty good. The way that it is able to show a special image and is able to trick the participant in the mirror to kill themselves to look exactly that way is a nice trick to see. The kills are pretty cleverly done and do manage to get some shock out of them. The opening kill with the glass looks creepy, and is the best overall kill. The loft killing is the most suspenseful, as the fallen portraits, creepy in their own right, are brought in with a maze that is brought in to play is a nice addition. The final half hour is it's best part, with some nice action scenes and a little bit of suspense thrown in as well. There's the main reason for watching the film, and it makes it seem a little better than when it really wasn't. The Bad News: There's still a couple of major things wrong with this one. The fact that there's hardly any action at all in the film is a big factor. The only thing that happens is the kills, which are pretty much it. The rest is useless running around without much of anything done, and it's hardly anything interesting that happens during that time. It just makes for a boring experience. The second is that it really has nothing at all to do with the story of the first film and has no real connection at all. That only a small number of references are made and that nothing even takes place in the fabled house makes it weird how the connection is made. These are the main problems, as the major bore-ness hammers it home more than anything. The Final Verdict: Really only guilty of being a rather boring film with no real action at all, and it does have enough other moments to really give fans of the series a couple of rather interesting scenes. Take a shot on it, there's worse films out there than this one. Rated R: Graphic Language, Violence and Brief Nudity",
         "Okay, maybe I'm a little bit too harsh on this movie, since I worked on it and got stiffed on the Credits for SFX... But, I hadn't seen it in about eight years, and when I recently managed to track down a Laser Disc version of Amityville: a New Generation,(yes, the older, really BIG Laser Discs, that you have to stop and flip over to side B, just when a movie gets really interesting...) I was disappointed by how \"dated\" and bland it seemed to be. It kinda' reminded me of a time when I sat down with some friends to watch my video collection of \"Rowan & Martin's Laugh-In\" and I had to keep explaining the jokes to everyone... Oh, well, at least the nudity never gets old, (kinda' like that girl in the bikini on Laugh-In...)",
         "There isn't enough space to explain the many ways this movie is a disappointing mess. Silly special effects and an incomprehensible plot are the least of this movie's problems. The film looks like it was conceived in the mid-eighties and just stewed until it could finally be made in the early nineties. The mullet-headed \"hero,\" (complete with fashionable \"Miami Vice\" three-days shadow beard), the ham-fisted slams at Ronald Reagan, it would be funny if it didn't take itself so seriously. As it is, the movie is just pathetic. I actually feel sorry for the poor actresses who wasted their fine nude scenes in this awful movie.",
         "Amityville: A New Generation references events in Amityville II: The Possession in that a man went on a shooting rampage one night at the infamous Long Island haunted house. A young artist inherits an antique mirror from the house and soon he and his friends are under attack by the dark forces lurking beyond the looking glass. The gore effects are relatively tame even in the unrated print and the action is sluggishly paced as we wait for the Omen-style deaths to play out. Not bad by the standards of the franchise. David 'An American Werewolf in London' Naughton and Terry 'The Stepfather' O'Quinn star. Followed by Amityville: Dollhouse.",
         "This is an okay movie, but it doesn't generate much excitement or suspense because there's not much done with the mirror and the characters are not especially interesting. This picture is less about the mirror than it is about this kid's history concerning his deceased, murderous father. The only truly interesting characters are the detective, played by The Stepfather's Terry O'Quinn, and Llanie. And just like in the previous film, \"It's About Time\", there's no Amityville house either (except in flashbacks). If this really is a new generation, then I would have preferred the old one. **1/2 out of ****",
         "Here we go again, another mediocre entry to the Amityville franchise that seems to get less interesting the further along it goes. I don't know, but I do miss the ominous house itself which featured prominently in the first three films. Sure it has connections and even the image of it appears in the haunted antique mirror which came from infamous Long Island house, but it's just not the same. The straight-to-video fare \"A New Generation\" is the seventh film, where the terror scraps suburbia for an urban apartment building filled with budding artists who one-by- one fall to the evil entity. An antique mirror is given to a photographer by a homeless man. Soon after accepting the gift, the man starts having haunting visions of a killing spree which might just have some relevance to him. But he's not the only one who's been affected by the demonic force within the mirror, but those living in his studio building begin to find themselves possessed/or infatuated by these dark forces. The plot tries to tie in a little more to the history of the Long House island, especially with the main character's (an affable Ross Partridge) connection to what's actually happening. So most of the time is spent with Partridge's character trying to uncover the truth and dealing with flashbacks. Didn't make it any more interesting though. Predictable and interchangeable. The imitating special effects do have its moments, but there's a real lack of atmosphere and thrills. Sure it's slickly directed, but feels vapid and flat. There's a good supporting cast featuring Terry O'Quinn, Richard Roundtree. Julia Nickson-Soul and a very twitchy David Naughton that do enliven things. Hardly terrible, but rather uninspired.",
         "At the rate these movies are rummaging through the artifacts from the Amityville house it won't be long before they get down to the floorboards, but for now it's a mirror that's causing problems for more cardboard characters in this sixth instalment. A homeless man hands the mirror over to artist Ross Partridge and his huge hair, which leads to strange visions, and unpleasant revelations about his past, and some truly ropey performances. This is a mundane horror film that plods along at a dull pace, leaving us waiting for an atmospheric build-up that never comes as the movie instead offers a variety of supposedly spooky events that lead clumsily to a silly finale. Bland and lifeless, a long way from the genuinely unsettling original."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["A. Ninety-Three Productions"],
      "summaries": [
         "Photographer Keyes is given an old mirror from an homeless person he photographs on the street, takes it home and gives it a friend. He doesn't know yet that people see horrible things happen to themselves in the mirror and later these things come true. Are these really suicides or is there a demonic force behind the mirror?",
         "An old mirror from the haunted Long Island house finds its way into a photographer's family where the evil soon manifests itself to cause more terror and mayhem."
      ],
      "budget": 1500000
   },
   "movielensId": 1325,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-09-29",
      "dvdReleaseDate": "2005-10-11",
      "directors": ["John Murlowski"],
      "runtime": 90,
      "movieId": 1325,
      "title": "Amityville: A New Generation",
      "mpaa": "",
      "actors": [
         "Ross Partridge",
         "Robert Harvey",
         "Lala Sloatman",
         "David Naughton",
         "Richard Roundtree",
         "Barbara Howard",
         "Terry O'Quinn",
         "Lin Shaye",
         "Robert Rusler",
         "Tom Wright",
         "Julia Nickson",
         "Karl Johnson"
      ],
      "imdbMovieId": "0106262",
      "originalTitle": "Amityville: A New Generation",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["7Ra20PuJ6Fc"],
      "plotSummary": "When young photographer Keyes (Ross Partridge) snaps a picture of a mysterious homeless man the subject insists he take a dark yet strangely beautiful antique mirror. Back at Keyes' home, the demonic forces of the infamous Long Island horror-house find new life through the mirror's frightening reflections. As unsuspecting victims gaze into the shimmering glass, they witness the",
      "tmdbMovieId": 33519,
      "avgRating": 1.70608,
      "releaseYear": "1993",
      "numRatings": 296,
      "posterPath": "/k38YBT6yg22NziWVOT7p1ULLzQ9.jpg"
   }
}