{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0085335",
      "video": false,
      "title": "Scarecrow",
      "recommendations": [
         270393,
         213321,
         79216,
         127608,
         84821,
         321015,
         6029,
         109774,
         83524,
         129229,
         107705,
         43685,
         72199,
         42651,
         56477,
         399778,
         41043,
         260584,
         37176,
         23898
      ],
      "backdrop_path": "/zfVtkaMGFlbktzWM4nPGjHSSg74.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lena Bessoltseva",
               "gender": 1,
               "credit_id": "52fe46b1c3a368484e09e9a3",
               "name": "Kristina Orbakayte",
               "profile_path": "/fCxqMfcHNwFr739OyufYHbR18Ac.jpg",
               "id": 126968,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nicolay Bessoltsev, Lena's grandfather",
               "gender": 2,
               "credit_id": "52fe46b1c3a368484e09e9a7",
               "name": "Yuriy Nikulin",
               "profile_path": "/xoAb5MoIkrypREgycXPCcvAty0k.jpg",
               "id": 86680,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Маргарита Ивановна",
               "gender": 0,
               "credit_id": "52fe46b1c3a368484e09e9ab",
               "name": "Yelena Sanayeva",
               "profile_path": "/5E1ZnHXnmTO6iMQ67yFEL6D6Kgr.jpg",
               "id": 47424,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "парикмахер",
               "gender": 1,
               "credit_id": "52fe46b1c3a368484e09e9af",
               "name": "Svetlana Kryuchkova",
               "profile_path": "/3KhH7RHAPWSZK2FTd0QJSJbaOWX.jpg",
               "id": 240540,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "дирижер оркестра",
               "gender": 2,
               "credit_id": "52fe46b1c3a368484e09e9b9",
               "name": "Rolan Bykov",
               "profile_path": "/krecG0WKucOwiyBReWG8ZPQdeG6.jpg",
               "id": 1191198,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b1c3a368484e09e9b5",
               "name": "Владимир Железников",
               "profile_path": null,
               "id": 1189203,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b1c3a368484e09e9bf",
               "name": "Rolan Bykov",
               "profile_path": "/krecG0WKucOwiyBReWG8ZPQdeG6.jpg",
               "id": 1191198,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b1c3a368484e09e9c5",
               "name": "Rolan Bykov",
               "profile_path": "/krecG0WKucOwiyBReWG8ZPQdeG6.jpg",
               "id": 1191198,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.971615,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 63573,
      "vote_count": 10,
      "budget": 0,
      "overview": "A twelve years old girl Lena who has come to live with her grandfather in a small Russian town is being bullied by her classmates. She took the rap of being a class traitor because she was in love with the boy who had betrayed his classmates when they were bunking off and going to cinema instead of a literature lesson. The class is penalized for that, not being allowed to go to Moscow for fall holidays with the rest of the school. Lena is being ostracized, \"boycotted\" however not telling the truth, waiting that the boy himself would confess to be guilty.",
      "similar": [],
      "original_title": "Чучело",
      "runtime": 127,
      "poster_path": "/bFTaX5RGOY0K4yC2o3bNENnCEv2.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
         "name": "Mosfilm",
         "id": 5120,
         "origin_country": ""
      }],
      "release_date": "1984-09-14",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rolan Bykov"],
      "runtime": 127,
      "synopsis": "A twelve years old girl Lena who has come to live with her grandfather in a small Russian town is being bullied by her classmates. She took the rap of being a class traitor because she was in love with the boy who had betrayed his classmates when they were bunking off and going to cinema instead of a literature lesson. The class is penalized for that, not being allowed to go to Moscow for fall holidays with the rest of the school. Lena is being ostracised, \"boycotted\" however not telling the truth, waiting that the boy himself would confess to be guilty. Their classmates call her \"a scarecrow\" (\"\" in Russian, the same as title of the movie) and \"the traitor\". They mock her as well as her grandfather who collects local paintings and wears a coat with patches. The boy still proves to be a coward, not telling the truth, and what's more, beginning to torture her as well as the others. The pressure escalates and Lena who has told her grandfather about whole case finally decides to solve the problem once and for all.",
      "writers": [
         "Rolan Bykov",
         "Vladimir Zheleznikov"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0085335/",
      "coverLink": null,
      "actors": [
         "Christina Orbakaite",
         "Yuriy Nikulin",
         "Elena Sanaeva"
      ],
      "reviews": [
         "Fantastic Russian 'coming of age' film. A young girl is teased by her classmates (giving her the nickname 'Chuchelo', or 'Scarecrow') and she deals with it on her intelligence and wit. While this may sound grim (it is set in '80's Russia, after all), it is at times funny, weird and massively enjoyable. Very superior to many more popular American teenage films, is much more realistic and the script and acting sharper. A highly underrated gem - just try and find it!",
         "This film really surprised me and to be fair I think it has been overlooked in any lists of top Russian films of all time. There seems to be no English subtitles on the net and it's a shame this film is unavailable to a larger audience. The setting is perfectly captured, provincial Soviet Russia, I loved the music and the camera work is excellent but I suppose for a lot of people this won't come across, it will look like some dated, weird film to a non-Russian/Soviet audience. But if you look past these elements you will be drawn into a tense study of group psychology. At times I felt I was watching a version of \"Lord of the Flies\", we see children and their behaviour, how it is warped and shaped by the group around them and the frustrations they have with their own home lives. The main child actor in the film is mesmeric and you can't help but being tore up inside watching the world through her eyes, seeing the cruelness of others. The film deals with one of the key points in childhood; learning that people around you can be cowardly and cruel, that the group mentality is harsh for those caught outside of it. I really felt emotionally stirred by this film and this doesn't always happen. It was on a level with 'One flew over the cuckoo's nest\" for awakening one's moral outrage! So to sum up, the films is well put together, full of meaningful thematic content but by no means some abstract artsy affair - it is an accessible and engaging drama for any person who has experienced childhood.",
         "This movie i thought was about a lot of things. Relationships between kids, students and teachers and kids and parents. It's about a very sweet and kind-hearted girl who is new at school in a small Russian 80's town. The kids tease her but not too badly, it isn't until she makes a mistake of taking someone's blame unto herself that her whole class turns against her. Fascinating developed characters add a lot to this film. All the kids are just really different and fun to watch interacting. Also this film is realistic, there's really not a lot of theatrical acting or cinematography in it. This movie feels honest, and you can actually feel something for the characters because the performances and the script are very good. The way the film is shot is very poetic and not boring, IMO. Good music/soundtrack too. From creepy ambient and instrumentals, to rock-n-roll tunes, and modern Russian songs. The music is used geniously in this film, it means something to the kids, we see them singing and listening to music a lot and some of the important scenes we see them doing something to songs. The theme song, a soviet sounding march (which we see the director of this film conducting) is a beautiful song too. One of my favorite Russian films. You can find so many themes in it and every character is deep. Sadly, i don't think there is a version with English subtitles.",
         ":::spoilers:::: Being the new kid is never an easy task. Lena seems confident going to school and laughs with the kids who make fun of her grandfather. Dima, a boy in her class whom she likes immediately, is the only one who treats her kindly. Lena's Grandfather is a generous old man who gives his prized painting collection over to the school to use as an art gallery. Besides the grandfather most of the adults seem to be pretty dumb. The teacher named Margarita comes into the class very enthusiastic as a teacher of grade school should be, but was a bit of an airhead (her wedding was during this time which may serve as a reason, but is doubtful). She seems completely oblivious to what's going on in her class. And how they are treating Lena. At the end of the film when Lena shows Margarita her shaved head, she seems momentarily perplexed, then moves on. The second adult we are introduced to is one of the student's mother, who is a hairdresser. She apparently has no control over her daughter. We see this in the scene where her daughter is telling her off, as she is angry she did Lena's hair. Her mother does in fact seem clueless, even after she sees how they treat Lena and how they pick on her she really does nothing. Really what these two specific examples are telling us, is how Bykov wants adults to be viewed here, they are shown as the subordinate. This film is in the kids world, where it revolves around them and their eventful lives, the roles of the adult/child have switched. This support the relationship between Dima and Lena, which seem to be much more mature. The way they talk to each other and act natural that way. Then after Dima's betrayal of Lena, she forgives him, something that may be considered unusual for a kid so young to act with such wisdom. The whole adult/child role reversal is the key to Bykov's film and what makes it so unique and intriguing."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Mosfilm"],
      "summaries": ["Unpopular girl being bullied in her class."],
      "budget": 0
   },
   "movielensId": 132664,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1984-09-14",
      "dvdReleaseDate": null,
      "directors": ["Rolan Bykov"],
      "runtime": 127,
      "movieId": 132664,
      "title": "Scarecrow",
      "mpaa": "",
      "actors": [
         "Kristina Orbakayte",
         "Yuriy Nikulin",
         "Yelena Sanayeva",
         "Svetlana Kryuchkova",
         "Rolan Bykov"
      ],
      "imdbMovieId": "0085335",
      "originalTitle": "Чучело",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A twelve years old girl Lena who has come to live with her grandfather in a small Russian town is being bullied by her classmates. She took the rap of being a class traitor because she was in love with the boy who had betrayed his classmates when they were bunking off and going to cinema instead of a literature lesson. The class is penalized for that, not being allowed to go to Moscow for fall holidays with the rest of the school. Lena is being ostracized, \"boycotted\" however not telling the truth, waiting that the boy himself would confess to be guilty.",
      "tmdbMovieId": 63573,
      "avgRating": 3.21429,
      "releaseYear": "1984",
      "numRatings": 14,
      "posterPath": "/bFTaX5RGOY0K4yC2o3bNENnCEv2.jpg"
   }
}