{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "talk show",
            "id": 3741
         },
         {
            "name": "dark comedy",
            "id": 10123
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "mental disorders",
            "id": 197708
         },
         {
            "name": "winning lottery",
            "id": 208263
         }
      ],
      "imdb_id": "tt2788716",
      "video": false,
      "title": "Welcome to Me",
      "recommendations": [
         209271,
         244772,
         259956,
         254023,
         242083,
         45174,
         306197,
         243526,
         259958,
         276908,
         157360,
         251736,
         9867,
         283536,
         1918,
         14799,
         47607,
         60994,
         40876,
         244260
      ],
      "backdrop_path": "/k2G0BVfNWN0x4JsMfSvanfbfsq4.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Reno",
         "id": "571cdb24c3a36864e0005895",
         "content": "> For some, expressing themselves means lot than being a rich.\r\n\r\nThis is actually a good film that misled by its low rating. But the end should have been really better, other than that the rest of the film was enjoyable. Another small scale movie and another excellent performance by Kristen Wiig. The story of a single woman with the borderline personality disorder. After winning the $80 million through the lottery draw, she decides to own a television show to talk about her personal life. She begins to lose her close ones as the result of her out talk about them, but can she fix it and how is the remaining.\r\n\r\nThis is a unique story, not like that you see it often in the movies. Apart from Wiig, the rest of the supporting cast was not bad, but very sad to see such a good looking wonderful actress like Linda Cardellin in a small role. If you hate slow pace, this movie might be an average to you, but others who won't mind will find it better. What I surprised to know is that most of the film critics thumb upped for it than the film goers. But I still suggest it, mainly for the film fanatics, just give it a try and so you might like it than what you've heard about it.\r\n\r\n7/10",
         "url": "https://www.themoviedb.org/review/571cdb24c3a36864e0005895"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alice Klieg",
               "gender": 1,
               "credit_id": "53f7a7610e0a267f77008328",
               "name": "Kristen Wiig",
               "profile_path": "/iqRX3PDxA33zFhSfKTo5BE593G4.jpg",
               "id": 41091,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rich Ruskin",
               "gender": 2,
               "credit_id": "53f7a7750e0a267f8d00854e",
               "name": "James Marsden",
               "profile_path": "/htBil0Vayd09haeUVoKEPxuantT.jpg",
               "id": 11006,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Gina Selway",
               "gender": 1,
               "credit_id": "53f7a77e0e0a267f7a0084b6",
               "name": "Linda Cardellini",
               "profile_path": "/iwmPwZARlFIKOqwEVuYIgPOc4WX.jpg",
               "id": 1817,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Gabe Ruskin",
               "gender": 2,
               "credit_id": "53f7a7870e0a267f800084ba",
               "name": "Wes Bentley",
               "profile_path": "/fbHHalL9CS52zvJp015G31vwX23.jpg",
               "id": 8210,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Deb Moseley",
               "gender": 1,
               "credit_id": "53f7a7900e0a267f800084be",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Ted Thurber",
               "gender": 2,
               "credit_id": "53f7a7980e0a2642ec000c63",
               "name": "Alan Tudyk",
               "profile_path": "/6QuMtbD8kmhpwWhFKfNzEvHRLOu.jpg",
               "id": 21088,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Dr. Daryl Moffet",
               "gender": 2,
               "credit_id": "53f7a79f0e0a267f8d008558",
               "name": "Tim Robbins",
               "profile_path": "/7pirFsBQe93TSfzu404Hgcj1YWj.jpg",
               "id": 504,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Dawn Hurley",
               "gender": 1,
               "credit_id": "53f7a7a70e0a2642ec000c68",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 9
            },
            {
               "cast_id": 10,
               "character": "Rainer Ybarra",
               "gender": 2,
               "credit_id": "53f7a7b10e0a267f800084c0",
               "name": "Thomas Mann",
               "profile_path": "/9URrxF1AKqL8SxxOeAVHKBAlWEx.jpg",
               "id": 1142720,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Connie",
               "gender": 1,
               "credit_id": "5543be21925141586f0022ad",
               "name": "Rose Abdoo",
               "profile_path": "/cy01RB8iduwwuqwcyfMm7r2kqFR.jpg",
               "id": 31507,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Teenage Alice",
               "gender": 0,
               "credit_id": "5543be34925141586f0022b8",
               "name": "Shanna Strong",
               "profile_path": null,
               "id": 1461683,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Grace Dao",
               "gender": 1,
               "credit_id": "55653e3bc3a3687ad9000b92",
               "name": "Kulap Vilaysack",
               "profile_path": "/jj4P21QJgXgk4VWYoN1ESNh1snm.jpg",
               "id": 210566,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Barb Vaughn",
               "gender": 1,
               "credit_id": "55653edb9251413540000bd9",
               "name": "Loretta Devine",
               "profile_path": "/zLQFwQTFtHkb8sbFdkPNamFI7jv.jpg",
               "id": 18284,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Miriam Klieg",
               "gender": 0,
               "credit_id": "55653f0b925141353d000b57",
               "name": "Joyce Hiller Piven",
               "profile_path": null,
               "id": 1470962,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Bud Klieg",
               "gender": 2,
               "credit_id": "55653f23925141354f000b8c",
               "name": "Jack Wallace",
               "profile_path": "/83wIH9unPcgk1lIIqYcojhVyOOP.jpg",
               "id": 24435,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Derek",
               "gender": 0,
               "credit_id": "55653f659251413549000b92",
               "name": "Mitch Silpa",
               "profile_path": "/1TECsY8WPkRsSaeNhWzWC2A5COU.jpg",
               "id": 1219590,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53f7a7430e0a267f7a0084b0",
               "name": "Shira Piven",
               "profile_path": null,
               "id": 1186229,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5543bc31c3a3680cdb00247a",
               "name": "Eliot Laurence",
               "profile_path": null,
               "id": 1461681,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5543bc69c3a3680ce8002378",
               "name": "Eric Alan Edwards",
               "profile_path": null,
               "id": 6389,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5543bc9dc3a3680ce3002285",
               "name": "Kevin Tent",
               "profile_path": null,
               "id": 32796,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5543bd0fc3a3680cd5002494",
               "name": "Josh Salzberg",
               "profile_path": null,
               "id": 1095369,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59f48fbcc3a3681f63012b1e",
               "name": "Will Ferrell",
               "profile_path": "/dGxt3uGPlUJKIfHYiLasnEgR90e.jpg",
               "id": 23659,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.398073,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 284537,
      "vote_count": 172,
      "budget": 0,
      "overview": "A year in the life of Alice Klieg, a woman with Borderline Personality Disorder who wins Mega-millions, quits her meds and buys her own talk show.",
      "similar": [
         27586,
         10735,
         858,
         14,
         112160,
         141,
         634,
         359940,
         437557,
         242224,
         258480,
         43923,
         340485,
         250124,
         297762,
         376660,
         129139,
         8967,
         9762,
         4011
      ],
      "original_title": "Welcome to Me",
      "runtime": 105,
      "poster_path": "/1voaGFPqqGUFuzOcjEneRSPiIdV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bron Studios",
            "id": 13240,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gary Sanchez Productions",
            "id": 4740,
            "origin_country": ""
         }
      ],
      "release_date": "2014-09-05",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Alice is going to be on TV whether you like it or not",
      "adult": false,
      "homepage": "http://www.welcometomemovie.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shira Piven"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Eliot Laurence"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2788716/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTA0NTAyNTYwNDheQTJeQWpwZ15BbWU4MDY2ODcyNTQx._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kristen Wiig",
         "James Marsden",
         "Linda Cardellini"
      ],
      "reviews": [
         "Kristen Wiig had already won me over with Bridesmaids and this is just further proof that she has the comedic chops to carry an entire movie. It revolves around her character Alice Klieg, who was taking meds for her Borderline Personality Disorder before she won the lottery and subsequently ditched her psychiatrist and used the money to make her own talk show. She's a die-hard fan of Oprah so her show is basically Oprah except there are no guests or anything. It's all about her. Hence, the title of the show (and movie) \"Welcome to Me\". The comedy in this movie is extremely deadpan. If you're not a fan of that style, then you will not like this movie. It's like the awkward humor of Bridesmaids mixed with the underlying seriousness of Love & Other Drugs, and the usual quirky Wiig mannerisms that make her such a likable and charming lead. There are sad moments in the movie, there are laugh-out-loud funny moments as well, most if not all of which come from Wiig and her drab interactions with other people. Alice is completely in her own world - she acts almost sociopathic towards other humans. She's very crass and has no filters with what she says making for some extremely uncomfortable and hilarious situations. But it's obvious that she has good intentions and a good heart, which makes her great as a sympathetic lead. The supporting cast are all great. I can't single out every one but I will say that this is James Marsden's best role in a while. He plays a network executive who picks up the talk show, and he has some good material to work with this time. It shows the more dramatic side of his acting chops instead of being a cardboard cutout romantic lead like he was in crap like The Best of Me and Walk of Shame. The whole cast is brilliant really, with the obvious highlight being Kristen Wiig absolutely embodying this character to a tee. It's the performance of her career so far without a doubt. The only real complaint I have is that the tone of the movie isn't very consistent. It's not even due to the subject matter, because Love & Other Drugs and 50/50 also dealt with both disease and comedy and found a perfect balance between them. Welcome to Me just feels clunky at times, pacing wise, and it makes for a few dull spots here and there. Again, if you're not a fan of deadpan, dry, sarcastic humor then this movie is not for you. However it is a wonderful dramedy that makes you think, laugh, and maybe even appreciate life just a little more.",
         "I cried the whole movie. Happy happy enlightening tears. I felt like I was watching my sister on screen. It felt like one big old metaphor being in the audience, as I feel kind of like an audience member of my own family. My sister who has BDP is the strongest person I know. This disorder is a rough one and those who have it are true warriors, however as a result of my sister's disorder, I have been neglected by my family my whole life. It took me a really long time to fully realize this, but now that I do I am finally starting to find self worth. This movie not only captures what it's like to have BDP, but whats it's like to close to someone with BDP. Seeing Alice's relationship with Gina hit me really hard. Gina is so strong and I hope I can be like her once I find more confidence in myself. Seeing her stand up for herself is something I hope I can one day do. The fact that someone out there decided to add some humor to such a hidden, stigmatized, mental illness, really truly brings light to the my broken heart. I am so so so so so so thankful for this movie. Bravo.",
         "I am writing this review because I honestly think that its current rating does not do this movie justice. People seem to be disliking this movie because its not the Kristen Wiig movie or humor they expected. Or, because they have some opinion or experience on borderline personality disorder. Valid reasons, sure, but just take this movie as is, without any preconceived notions about what it should be. Its hilarious, and weird, and honestly the funniest movie I've seen in a long time. And, it has this perfectly charming mix of having a pretty unbelievable timeline but at the same time, being scarily relatable in a lot of ways. Highly recommend.",
         "This movie is pure genius. It provides insight into the depths of the human psyche and the narcissism that results from a broken trust with the world at large. Rarely does a story capture the capacity of truth to create an audience in a refreshing and unique manner. I think this movie is highly under-rated. \"Welcome to Me\" offers an opportunity for evolution through shocking and outrageous honesty. And, it does so in a manner tinged with humor and love. Kristin Wiig, along with the rest of this perfect cast, could not have done a better job. It was written, acted, and produced flawlessly. It is hard to be new and daring in today's world, and they accomplished it! One of the best films I've ever seen.",
         "Fools and their money are soon parted from one another. Nowhere does this saying hold true more than with lottery winners. Alice Klieg, diagnosed with borderline personality disorder, emerges from a solitary and sedentary life as the new winner of $86 million from the state lottery. She begins to buy airtime at a local television station that is desperate for cash. Alice's new talk show \"Welcome to Me\" is a perfect reflection of her impulsive, socially awkward, indecisive, random, obsessive, moody and sensitive self. It features some of her favorite recopies (meatloaf cake), traumatic events from her past (the \"carousel of life\"), and – of course – swans (she loves swans). Her insistence upon absolute control and predilection to get out of control, make for some interesting and eccentric shows that are alternately extremely boring and explosive. The dry and dark humor of the film fits the acting abilities of Kristen Wiig perfectly. The film is funny as well as raw. I wish there was more depth to the plot, however, for it relies too much on the wacky shows. Seen at the 2014 Toronto International Film Festival.",
         "This film is extremely well done. Full of nuances, over-the-top exaggerations, truth, and humor. I loved it. Many people with BPD - or perhaps even the majority - are not at all psychotic (detached from reality) like Alice often was, but psychotic characters make for much more interesting and entertaining stories, particularly on film. So keep that in mind; this is a dramatized/exaggerated version of BPD for many people. Some underlying dynamics and truths about BPD were spot-on, however, and Kristin Wiig was awesome as always.The entire cast was awesome. Joan Cusack nailed it as did everyone else. I would highly recommend this film if you have BPD, someone you know does, or if you are a psychologist or interested in mental health. And although Alice is identified as having BPD, as we know often mental health issues do not fall neatly into one category. The mental and emotional health issues this film is built upon are relatable to almost everyone in some aspect.",
         "If you only know that \"Welcome to Me\" stars Kristen Wiig and is produced by Will Ferrell, the only conclusion would be that it's a slapstick comedy. But this movie is nothing like that. Wiig plays a woman suffering from borderline personality disorder who gets her own TV show. And on this show, she talks about whatever's on her mind. I've seen Wiig in a couple of dramas recently and I've liked all of them. \"Welcome to Me\" is more of a comedy-drama, with the comedy resulting from Wiig's character's awkwardness. One of Wiig's scenes was particularly bold, but the fact that she was willing to do it shows what a good actress she is. I hope that Wiig continues with these kinds of movies, although I do also like her straightforward comedies). In fact, I wish that there were more of these movies. It's a really good one. It won't be for everyone, but I recommend it. Also starring James Marsden (JFK in \"The Butler\"), Linda Cardellini (Cassie in \"Brokeback Mountain\"), Wes Bentley (Ricky in \"American Beauty\"), Jennifer Jason Leigh, Alan Tudyk (the Duke of Weselton in \"Frozen\"), Tim Robbins and Joan Cusack.",
         "I think the film \"Welcome to Me\" is not for everyone and I am not surprised that the reviews are rather divergent. It's certainly a strange movie and one that might or might not appeal to you-- probably depending on how much you are willing to watch a film that often makes you embarrassed and has a very, very dark sensibility. When the film begins, Alice (Kristen Wiig) has just won the lottery. However, she is mentally ill and foolishly decides that now she's rich, she doens't need her medication any more. So, she stops taking it and soon is blowing through her many millions of dollars. What does she blow it on??? I self-financed TV show all about her! It has very little in the way of conventional structure and the show is crazy...and, oddly, people think it's good. I assume they think it's meant to be a comedy...but the crazy antics and total self- absorption they see IS Alice. The film is a very interesting character study of a woman with a Borderline Personality--especially of one whose hold on reality is very tenuous and whose narcissism is extreme, even for a Borderline. I was impressed by this character as well as her psychiatrist (Tim Robbins) as it looks as if whoever wrote the film knew about mental health issues and/or consulted with mental health professionals. Usually in films psychiatrists and psychologists are more caricatures--goofy one-dimensional idiots. Robbins' character is realistic, however-- with appropriate borders and methods. As for Wiig, she was entrancing in this strange role. I am not 100% in love with this film--it is, at times, tough to watch and its overall message is certainly strange and mixed. Also, I hesitate to recommend it to everyone because Miss Wiig does a nude scene in which she's VERY nude....so be forewarned. An interesting film to watch if you feel like you've seen it all.",
         "This is the story of Alice Kleig (Kristen Wiig). She wakes up every day at 12: 15, her TV has been on for ten years, she knows by heart a great number of Oprah Winfrey shows. Alice was diagnosed bipolar at 16. Well as she explains it, in those days it was called manic-depressive, then bipolar and now borderline personality disorder. Alice win 86 millions of dollars at the lottery. So she pays for her own TV show, where she'll be the host and will talk about herself. This film could be considered as a critic of our selfie and real TV era where anyone plays his/her life as a show. It could be seen as a critic of how people consummate themselves in their image, and lose their soul with this profusion of extimity, like American Indian who thought that pictures stole their soul. But instead of being a parody, and a critic Welcome to Me stays focused on Alice. And Welcome to Me becomes an idea of what would be the equivalent of Outsider art for television. Alice is helped in creating what she wants by her greedy producer, and her knowledge of television, so the show looks like a performance, and this kind of humour reminds of Andy Kaufman's. It is brilliant. The soundtrack use is very interesting. I was very interested in the way a weird song like Happy Talk by Daniel Johnston is used as a standard. Is he credited? Or is it some kind of standard I didn't know of? The fact that the author uses his music, or the music he used shows that she's interested of the creativity of madness. (In fact Daniel Johnston created a show called Welcome to my World, so he probably inspired Shira Piven or Eliot Laurence the writer (impossible to say). What Alice exposes here, are her defense mechanisms against falling apart, all of the creation of her soul to hold on to herself: her things ordered by colours (once I was very bored and colour coordinated my books), her highly proteinated diet, her traumas\u0085 and she's capable of putting all that in a form that makes it watchable (a student in communication compares her work to Cindy Sherman's). Like the filmmaker who turned Daniel Johnston's music into a jazz standard, Alice's world is standardized for television, and makes madness watchable. (This is so rare in cinema, that it makes this film very important). Madness is sort of censured by general medias; it scares people, so it's very rare to have it portrayed in an interesting and creative way. It's most of the time reduced (especially since the DSMs became psychiatric bibles, cutting the classical mental categories into symptoms and little pieces) to neurological troubles, and simplify the human being as if we were only a mass of facts. But Alice because of the considerable sum she won can beat the censorship, explain herself, and tell her life like no one ever heard it. The film doesn't try to explain her madness or to cure it, but it shows her humanity and her fight to be defined by something else than a diagnostic that changes with medical fashions",
         "Welcome to Me is a distinctly odd movie about a woman with a boderline personality disorder diagnosis and millions of dollars in lottery winnings who decides to have a vanity TV show all about her. It's an interesting idea, and it kept my attention, but I feel it wasn't quite the movie it might have been. First off I'd like to talk about borderlines, because I've known a couple. Googling around I've found a few articles describing this movie as either a good or bad portrayal of BPD. Since BPD simply means you exhibit a large number of traits from a list (impulsivity, self-harm, etc.), Alice is acceptable as a borderline. And since being borderline can exist with other conditions, like depression or narcissism, you can't really complain about less typical borderline behavior. That being said, Alice doesn't seem like borderlines I've known, and lacks some commonly known BPD qualities. For example, borderlines are often very good at feigning normalcy. I once saw a BPD friend, ranting and raving after sneaking out of a psyche ward and trying to kill herself, instantly become calm and rational when the cops came to check on her. Many psychiatrists don't like working with borderlines because they can feel tricked when that patient convinces their doctor that they're fine now right before a suicide attempt. Alice, on the other hand, is just purely odd. And her oddness seems to come entirely from her mental illness. It is as though Kristen Wiig was so concerned with getting the symptoms right that she never thought about who Alice would be without her mental illness. But in truth, people with mental illnesses have traits that have nothing to do with being mentally ill (although some psychiatrists do try to fit everything about their patients into their diagnosis). Because of this, Alice is an interesting character but not a really compelling one. Meanwhile, the intriguing premise never quite gels. Is the movie a satire of celebrity and our fascination with trashy talk shows? Is it an attempt to portray mental illness? Is it an attempt to get laughs out of mental illness? I never really felt this movie had a vision, or a point of view. Like the main character, the story feels like it's a bunch of ideas stuck together rather than a cohesive drama. While the movie feels a little undercooked, I did enjoy it. Wiig may seem more like a mildly autistic narcissist than a borderline, and the story may feel unsubstantial, but it is amusing to watch Alice create her entirely peculiar show and get into weird dietary fixations. The movie may not make a coherent whole, but the pieces are pretty good in themselves.",
         "First off I'll just tick the spoiler alert box as I think the biggest surprise is exactly at the end when Alice makes courage and faces the demons that haunted her for so many years. I won't reveal more but it made me shed a tear when I saw her overcoming that difficult condition. The message that Alice spreads throughout the movie is that of hope of anyone being capable of achieving something if they really believe it, however what follows next is the exposure of the modern era flaw of sharing everything, which I guess is part of the social network deal that most of us took in order to share every part of our private life with the world. Alice mistake is getting attached to any men that offers her a bit of attention but her main problem is that she suffers from a serious disease. At one time she comically tries to treat BPD by eating string cheese. Kristen Wiig creates a brand new character that has a lot of hand movements and manages to stay unrecognizable from any of her previous roles with the most entertaining scenes coming from the dialog with her doctor played by none other than Tim Robbins. I thoroughly enjoyed this movie and I'll place it in my top 3 this year for the original subject it brings forward, for the fantastic story that ends on a great note and for the fantastic interactions between these great actors. Welcome to me!",
         "I was expecting a roll-on-the-floor comedy. After all, it's Kristin Wiig, and Will Ferrell as a producer. It starts off funny enough. A woman obsessed with Oprah Winfrey feels screwed over in her past, but wins the lottery and wants to have her own talk show. But it turns into an analysis of a \"mental issue\" and the diagnosis that goes along with that. I think everyone has issues - but when you give these issues names then you marginalize & categorize people that further push people into little boxes. By the end, I was moved to tears. This movie is so worth watching. But it's not the SNL-type skit you might be expecting.",
         "Welcome to Me is much more than a dark comedy. It is the evilish innocuous lovechild of whack of center films like Eagle and Shark (2007), Gentleman Broncos (2008), and Lars and The Real Girl (2007) if they coupled with satires like Network (1976), and Bob Roberts (1992), and it does so with dark whimsy, subtle charm, and is laugh-out loud funny. The resulting film is a superb satire on the all out illusion of the American dream. Firstly, it derides the notion that money and fame are the goal of living while lauding it, a tough balancing act, and, secondly, that, in a country where 70% self-medicate for some form of depression, anxiety, or just can't cope with life, that mental illness is what happens to others. It combines the two, and lets the lunatic take over the asylum. We might well ask whether the crazy is the message or the medium... Kristen Wiig is Alice. And let's start by saying in this Wonderland it's a great name for the character; and, a name that's almost become a cliché name for all woman in crisis, as Bob has for all blue-collar guys. Alice is a heady mixture of cutely crazy. We tried to list it all, but kind of only got as far as obsessive-compulsive, bipolar, narcissism, and manic-depressive, all veiled behind an obsession with voyeurism by her, and of her, through the TV. And that is the first point: she is non-categorizable - she is not just do-lalley, she is not even complex, she is Alice - wanting the world to love her, and wanting the world to cure her, to cure her past, and to see how important her pain is. When her own therapist, a snappy turn by Tim Robbins, effectively gives up, Alice gets beyond lucky and gets her chance to have her own TV show through an amoral (or just pragmatic?) James Marsden. What results is a truly roller-coaster ride into Alice's bizarro gonzo world, where her unedited world is literally broadcast. This is the best satire we've seen is a while. Like Nightcrawler (2014), it pokes the bear of TV for all its worth, and looks at America as a modern freak show, where empty calories and instant gratification have replaced any meaningful content. It is also really a film about the death of TV for the YouTube generation - who under 30 watches more TV than internet now? This is post-hipster, post-modern, life out loud funny, that leaves you with a bad taste - it is smart, both kind and cruel, and a brilliant take on Modern America. Above all, it is original and deserves to be praised for being a film that belongs more to indie films of the 1970s than now - it is a surprisingly lingering, has just enough sympathy while still skewering its subjects, and for us, is a gob-smacking watch.",
         "Welcome to Me stars Kristen Wiig as Alice, a woman who suffers from Borderline Personality Disorder (BPD). When she won a lottery that grants her a sizable amount of money, she produces, acts, and stars in a TV series entitled: Welcome to Me. First and foremost, this is the most endearing thing Kristen Wiig has done, outside her usual comedy movies. The way she portrays Alice is so heartbreaking and detailed, sometimes funny, but also feels authentic. The supporting cast did a good job too, especially Linda Cardellini. However, this movie is definitely not for everyone. As the title and the premise suggests, this movie is going to be all about Alice and her world. Alice's actions are questionable and maybe some audience can't digest that properly. If you're interested in movies about psychology issues, then this is definitely a movie for you. Otherwise if you want to feel good, you might want to pick up something else, as the constant melancholy and confusion this movie brought will disillusion you, forcing you into saying \"What the hell was that?\" when the credits roll.",
         "Honestly, I usually have theories but this time I have no idea why this show received any rating under 80%. Some theorized people had specific expectations with a Will Farrell production. Some theorized 'it wasn't Bridesmaid enough'. Some theorized 'people will prejudge any show with a female lead as chick flick and trash it'. Maybe they're all correct. Perhaps because I went in with openness and moderate expectation, I see this deadpan, no-laugh-track comedy classic as Farrell candid ROTF funny, better deeper funnier than Bridesmaid - and 300% not a chick flick. I watched Bridesmaid but still Kristen didn't immediately register. I gave it a go based on a few well-written IMDb reviews alone. As the show starts I was delighted to learn that heavy weights like Tim Robbins, Jennifer Jason Leigh, Joan Cusack are on board. Later I was pleasantly surprised by familiar faces like Linda Cardellini, James Marsden, Wes Bentley. All contributed wonderfully to this well-conceived well- executed story about 'what a psychologically-unstable woman do with her lottery winning'. The premise is rich, the result is delicious. Kristen Wigg's actor chop, range, and fearlessness, is superb, admirable and definitely entertaining. Various related subject matters are explored: post-Facebook post-YouTube me-me-me vanity culture, reality show production standards and ethics, borderline behavior, value of true friendship, things most people could related to... The lead character has no filter, is an \"emotional exhibitionist\", has OCD protein fetish, brittle, yet manipulative, mean, vengeful, sexually aggressive, deeply self-pitying yet oblivious to human suffering right next to her, hence a natural at shock value generation. The reaction in the TV production control room is just priceless. YouTube goers would find a particular cake eating scene sarcastic funny. Still the narrative tone is never cruel or judgmental, an amazing feat in itself. Other characters' distinct reactions to her 'charisma' and big plan to exhibit herself is also both hilarious and insightful. Side note: The show didn't go out to explain borderline behavior but oddly afterward I'm slightly more enlightened about the triggers of occasional borderline outbursts of people I had interacted with. It also shows that borderline condition describes more a gradient spectrum rather than entire persons (and therefore more prevalent than commonly thought) Visually and aurally the show is captivating and fun. The pink plastic princess reality TV circus, her self-penned theme song, her romantic overtures, Tim Robbin the tennis tan therapist, Jason Leigh the crazy hair grouchy producer with strong ethics, Cusack the versatile voice actor, backstage dogs and swans, OCD recipes and cheesy re-enactments, are all bonuses... Rarely a comedy makes one laugh so much, yet feel a little more at the same time. I've added the director Shira Piven to my Director to Watch \"movie quality filter\" list. Welcome To Me is a comedy gem among under-rated comedy gems. 9/10. Plus 1 star for balancing. Highly recommended.",
         "If you have someone in your life who suffers from narcissistic personality disorder or borderline personality disorder, Welcome to Me is both painful and therapeutic (maybe) but completely recognizable. Dark comedy, well, yes, but also stark reality, almost too stark and too real. If you know and love an Alice you will laugh, cry, get angry and relive a lot of painful moments. I think the writer and director got it right, exactly right, down to the awful moments and piercing pain endured by friends and family and co-workers. If you do not have a friend or family member suffering from a personality disorder, then Welcome to Me may seem an exaggeration or a perplexity. Wiig, Robbins and the whole cast are brilliant, but Wiig in particular turns in a genius performance. The nuanced facial expressions are perfectly haunting. This is a harsh tale honestly told, a story that leaves viewers with the same unresolved feelings as the NPD or BPD person does.",
         "I went into the film with mixed feelings having read some of the comments on social media which all didn't like the film. I was positively surprised that this film exceeded my expectations -- a lot. It deals with very serious issues but it never crosses the line making fun out of mental illness. I've worked with people having mental illnesses and I'm also doing research on it. This film manages to dramatise these issues in a pretty accurate way but at the same time keeping the tone just right so that it won't offend. I understand that people might be offended though given the quite edgy content. There are not many other films which succeed on this matter and only Greenberg and Away for the Weekend spring to mind. The latter one deals with it in the classical dramatic downward spiral, though also in a very moving way. However taking on this topic as a dark comedy is far more difficult and the film does a great job. It leaves you on the edge of the seat because the jeopardy is there from the outset but I'm glad it didn't go down the route of a classical downward drama but had a real feel-good moment at the end without assuming that this from of \"therapy\" has cured the protagonist but that she's battling on with her illness.",
         "\"Welcome to Me\" is pretty much an excursion into Borderline Personality Disorder. \"Me\" is written in the tragicomedy genre or literary form that has been with us for thousands of years. You don't know whether to cry or laugh, and probably doing both simultaneously. A comment on one star rated reviews. I venture to guess that some, already emotionally hooked in self-aggrandizement talk shows, were affronted by the SNL style put-down portrayal of the talk show formula of selling oneself and/or stuff. Perhaps another percentage just didn't get the tragicomedy portrayal of those with a BPD emotional attachment to that tele formula format. The only change I would have made in the script to improve accuracy would be to replace Oprah with Ellen Degeneres because her show more accurately reflects guests and host in the \"selling-themselves, self-promotion brand of narcissism\". And, The Ellen Show also excels in the other two \"We\" BPD categories of compensation consumption (buying to feel good) and embarrassing or putting others down to raise self-esteem. Acting by all, especially Wiig's performance, was spot on as was directing and cinematography.",
         "It's the perfect part for Kristen Wiig. It's a dark comedy that seems to work for her style. She did a terrific job at bringing humor to a real serious issue at the same time being sensitive toward the seriousness of it, which I've seen her do before in stuff like the Skeleton Twins. A mentally ill lottery winner spends her winnings to become the next Oprah on a talk show that expresses her own self absorption. The movie is driven by Wiig with a well rounded, well known cast supporting her, that includes Linda Cardellini( who I really like)James Marsden and Joan Cusack. It's a great Dramedy to watch.",
         "First things first: Kristen Wiig's performance is nothing short of masterful. The story pace was neither too fast nor slow, and the supporting actors were superbly cast. Although ostensibly about a woman's struggle with childhood trauma and subsequent mental/emotional illness, all in all it is really about the true trials of friendship and alienation in familial relationships, as evidenced by the fact that Alice's father has NO dialogue with her AT ALL. I loved seeing Joan Cusack in a supporting role reminiscent of her stellar performance in \"Broadcast News\", esp. when she utters the words 'nervous breakdown' during the first production meeting scene. This film is worth watching even if only for Wiig's performance -- she's truly amazing in this sadly over-looked independent production. Kudos to all involved in the making of \"Welcome to Me\".",
         "I know I'm in the minority, but I was never a big fan of Kristen Wiig's characters on SNL. I enjoyed their quirky uniqueness, but her humor never made me laugh out loud or anything, especially the \"hot girl who farts.\" I just didn't get it. But this movie has me wanting more Kristen Wiig. She was dead-on as the offbeat Alice, who is the epitome of borderline personality disorder. I found this movie on Netflix and gave it a chance when I saw it was a dark comedy about a crazy person who does crazy things. The dialogue was hilarious, as were the reactions of the rest of the characters, particularly the behind-the-scenes crew who produced Alice's \"Welcome to Me.\" I adore the witty randomness of the dialogue. My favorite line of the movie was when Alice told a story from her past, \"He told me, 'That's just how we do things in Gaithersburg, Maryland.'\" This premise could've easily been over-the-top and irreverent, but it's brought down to a realistic level by excellent acting, and also by characters who are as real as Alice was, to me. (If you've never known anyone who's borderline to this extent, consider yourself fortunate - it's far more entertaining to watch a fictional story about it than to experience it in real life.) For example, Wes Bentley's Gabe, who's a little off-the-beam himself, admitting that he falls too deeply in love, and subsequently, gets involved with her. The Alices of the world always have their groupies. Again, the behind-the-scenes crew, including Joan Cusack, James Marsden, and Jennifer Jason Leigh, all react exactly the way most of us would to Alice's behavior. I adored their performances. This is one of those movies that I will watch again when I really need something to pick me up and make me laugh, even though it's not a \"feel good\" story. I didn't find Alice annoying, but lovable. However, I know well enough to run in the opposite direction when encountering one like her in person. Crazy lady wins the lottery and pays to produce a vanity show about herself. Love, love, loved it.",
         "I'm adding a review as I think this film is sorely underrated. I've also seen others stating that the screenplay was confusing or lacked direction. I liked that the screenplay didn't insult the audience by preaching to us or telling us what to think. Instead, the story shows us everything we need to know about Alice and we're left to draw our own conclusions without the film adding its own judgement. As a BPD sufferer, Alice fears abandonment, is an emotional open-wound, sexually and financially impulsive without ever thinking through the consequences of her actions and incapable of empathy for other people or even seeing them as people. She over-shares, she tramples their boundaries and she struggles with her own identity. This is a clever, well balanced movie in that I laughed all the way through while still feeling bad for just how sad her situation was and at no point did I feel the movie was being unkind or mocking. The characters were well drawn and sympathetic, the performances (in particular Wiig) were excellent. The ending is also very cleverly handled, being ambiguously self serving and redemptive. I loved it.",
         "This film tells the story of a woman with psychiatric illness, who wins $86 million from the lottery. She pays a production company millions of dollars to create her own TV talk show about the story of her life. \"Welcome to Me\" is a pleasant surprise. The woman in question, Alice, is quirky but fun. She initially is awkward add a TV host, but as she gains experience, she becomes quite good at it. Her show is actually quite fun, even though I know it is wrong to like it because that is an exploitation of an unwell person. The ending is really quite touching, because she makes amends with her part and everyone around her. And the film also tells the belief that lottery winners often go back to the square one, but in here her journey to square one of a fulfilling journey.",
         "As a therapist that treats borderline personality disorder, I was very disappointed in this film. The portrayal I found to be inaccurate and insulting. BPD is now well understood to have clear causes and very good treatment (Dialectical Behavior Therapy). The film did nothing to help shed light on this often mysterious disorder. Tim Robbins gave yet another embarrassing portrayal of a therapist who was incompetent, uninformed, and unethical. Many people with BPD are extremely intelligent, creative, funny, and interesting. Kristin Wiig's character was none of these things. The only character who was funny was Joan Cusak. If you or someone you know is suffering from BPD, find a therapist trained in DBT or go to NEABPD.org",
         "The director & writer should be ashamed of this film. All it does is spread MORE misinformation, misrepresent a horribly excruciating problem, and on top of that, exploits those with it. This is not even close to an accurate depiction of BPD, and this film will only do one thing- further stigmatize this horrible affliction, making people even more hateful & cruel, which is already a bad enough problem right now. Their complete misunderstanding of the disorder is nauseating. Don't see this movie. Don't see any movie about a character with BPD, because it has always been done ridiculously poorly & has stigmatized those with it further. To a huge degree. If you want to actually learn a bit about it, go to Wikipedia, and you will find a very accurate detailing of the disorder, without bias, prejudice or ignorance."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Bron Studios",
         "Gary Sanchez Productions"
      ],
      "summaries": [
         "Alice suffers from borderline personality disorder, but she has what she needs in life. She has an apartment, she has a best friend, and she has tapes of every Oprah Winfrey show. And now, after winning the lottery, she also has 83 million dollars. What she doesn't have is an outlet for the whole world to know who she really is. The TV station cut her off when she tried turning her lottery announcement into a frank discussion of her sexual experiences, but with her money in hand, she's off to LA to convince two struggling TV producer brothers to produce her own TV show. Whatever it costs, she's going to do it. From swan entrances to dog neutering, she is going to introduce the world to Alice. But is the world ready for Alice?",
         "When Alice Klieg wins the Mega-Millions lottery, she immediately quits her psychiatric meds and buys her own talk show."
      ],
      "budget": 0
   },
   "movielensId": 132800,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-09-05",
      "dvdReleaseDate": null,
      "directors": ["Shira Piven"],
      "runtime": 105,
      "movieId": 132800,
      "title": "Welcome to Me",
      "mpaa": "R",
      "actors": [
         "Kristen Wiig",
         "James Marsden",
         "Linda Cardellini",
         "Wes Bentley",
         "Jennifer Jason Leigh",
         "Alan Tudyk",
         "Tim Robbins",
         "Joan Cusack",
         "Thomas Mann",
         "Rose Abdoo",
         "Shanna Strong",
         "Kulap Vilaysack",
         "Loretta Devine",
         "Joyce Hiller Piven",
         "Jack Wallace",
         "Mitch Silpa"
      ],
      "imdbMovieId": "2788716",
      "originalTitle": "Welcome to Me",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["r0KEe-hMsLg"],
      "plotSummary": "A year in the life of Alice Klieg, a woman with Borderline Personality Disorder who wins Mega-millions, quits her meds and buys her own talk show.",
      "tmdbMovieId": 284537,
      "avgRating": 3.13889,
      "releaseYear": "2014",
      "numRatings": 162,
      "posterPath": "/1voaGFPqqGUFuzOcjEneRSPiIdV.jpg"
   }
}