{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "caravan",
            "id": 5867
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "captive",
            "id": 15381
         },
         {
            "name": "hitchhiking",
            "id": 163726
         },
         {
            "name": "female serial killer",
            "id": 227428
         }
      ],
      "imdb_id": "tt0098072",
      "video": false,
      "title": "Hitcher in the Dark",
      "recommendations": [30879],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mark Glazer",
               "gender": 0,
               "credit_id": "52fe458bc3a368484e061691",
               "name": "Joe Balogh",
               "profile_path": null,
               "id": 100394,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Daniela Foster",
               "gender": 1,
               "credit_id": "52fe458bc3a368484e061695",
               "name": "Josie Bissett",
               "profile_path": "/fBbzCjeRodLSwNP2tjf4oM5SZ3p.jpg",
               "id": 100395,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe458bc3a368484e061699",
               "name": "Jason Saucier",
               "profile_path": null,
               "id": 100396,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "signor Glazer",
               "gender": 0,
               "credit_id": "52fe458bc3a368484e06169d",
               "name": "Robin Fox",
               "profile_path": null,
               "id": 100397,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "poliziotto",
               "gender": 2,
               "credit_id": "554e2b42c3a3685e5000738d",
               "name": "Gary Wade Morton",
               "profile_path": null,
               "id": 85343,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Secretary Miss Baker",
               "gender": 0,
               "credit_id": "5a02453d92514111cb0031d9",
               "name": "Fay W. Edwards",
               "profile_path": null,
               "id": 1919565,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Policeman",
               "gender": 0,
               "credit_id": "5a02456dc3a36861aa002b54",
               "name": "Tom Schultheis",
               "profile_path": null,
               "id": 1919566,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Thief",
               "gender": 0,
               "credit_id": "5a0245a6c3a368636c00327c",
               "name": "Todd Livingston",
               "profile_path": null,
               "id": 1353279,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe458bc3a368484e061681",
               "name": "Umberto Lenzi",
               "profile_path": "/jAjNPuw5E8gRtunpsOsKXKndArE.jpg",
               "id": 22467,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe458bc3a368484e061687",
               "name": "Olga Pehar",
               "profile_path": null,
               "id": 100393,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe458bc3a368484e06168d",
               "name": "Joe D'Amato",
               "profile_path": "/mYyejhm6tqa290duWvLgX7L48No.jpg",
               "id": 31775,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "554e2b88c3a3682594004650",
               "name": "Umberto Lenzi",
               "profile_path": "/jAjNPuw5E8gRtunpsOsKXKndArE.jpg",
               "id": 22467,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "554e2bc89251413fcf0046a2",
               "name": "Rosanna Landi",
               "profile_path": null,
               "id": 1465421,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "554e2c1bc3a3682431005114",
               "name": "Carlo Maria Cordio",
               "profile_path": null,
               "id": 42054,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a024508c3a368637f002d1b",
               "name": "Jerry Phillips",
               "profile_path": null,
               "id": 893856,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a02451892514111f9003029",
               "name": "Olga Pehar",
               "profile_path": null,
               "id": 100393,
               "department": "Directing",
               "job": "Continuity"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.986979,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28318,
      "vote_count": 3,
      "budget": 0,
      "overview": "Sick young man drives around in his daddy's camper, looking for lone stray females to kidnap, torture, rape, and murder.",
      "similar": [
         357096,
         4771,
         984,
         123109,
         15069,
         8090,
         74997,
         979,
         281,
         948,
         395990,
         281957,
         445954,
         25376,
         3134,
         45569,
         310137,
         10651,
         11423,
         10781
      ],
      "original_title": "Paura nel buio",
      "runtime": 95,
      "poster_path": "/jWI9GOQHemeIRh4TRuqZAMom4TW.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Filmirage",
         "id": 6082,
         "origin_country": ""
      }],
      "release_date": "1989-01-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Umberto Lenzi"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Umberto Lenzi",
         "Olga Pehar"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098072/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNzAyMjA2MzI5N15BMl5BanBnXkFtZTcwODY4MzEzMQ@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Joe Balogh",
         "Josie Bissett",
         "Jason Saucier"
      ],
      "reviews": [
         "This film has to be viewed with this in mind first: it is ridiculous and not meant to be scary. I like \"Hitcher in the Dark\" a lot. It's no award winner, but what do you want? It's a low budget, late-80's slasher/thriller with a good dose of comedy and sleaze thrown in for good measure. I doubt Lenzi was even trying to make it scary. The 'killer' is a preppy looking RV driver cruising the Virginia Beach coast on his daddy's dime. He picks up a girl and makes her life hell for a few days, and ends up paying for it in the end. Thrown in between is a cheesy plot, an angry boyfriend, lots of 80's beach people getting drunk and listening to horrible music, and some pretty nice looking chicks. For the time it came out, it was a little ahead of it's time, too. Pretty much all the new thrillers are 'real life' terror rides like \"Hitcher in the Dark.\" For what it is, \"Hitcher in the Dark\" is a lot cooler than any teen horror movie of today. And it's funny as hell!!! 5 out of 10, kids.",
         "This movie has some things going for it. It features some really beautiful scenery of the American South. It features some really beautiful scenery of a young, lovely Josie Bisset. And it is not quite Umberto Lenzi's worst movie ever. It has a lot of problems though. First, the dialogue is terrible. (Maybe these ridiculous conversations would sound better if they were badly dubbed and delivered with Italian accents). Second, the acting is wretched. The aforementioned Bisset is even worse than she was on \"Melrose Place\". The only time her acting is halfway tolerable is the scene where she is being photographed naked and sexually assaulted, and that is only because she has been mercifully drugged unconscious. The killer is played by a Christopher Atkins look-alike who is not only just as bad as Bisset but woefully miscast to boot. A five-foot-tall, effeminate pretty boy wearing Vaurnet sun-glasses and driving around in a RV camper is just NOT scary. The amazing thing though is director Umberto Lenzi who started out as a great director with classic Italian giallo like \"Paranoia\" in the late 60's, but seemed to get worse with each film. His infamous cannibal and zombie movies in the early 80's were awful but at least they elicited some reaction. This movie and its Florida-lensed follow-up \"Nightmare Beach\" don't even do that. At the rate he was going here, if Lenzi's still working at all he's probably making amateur porn videos and forgetting to take off the lens cap. I can certainly understand why Lenzi started using a cinematic pseudonym about this time, but why did he choose the name \"Humbert Humphrey\" recalling classic literature's most infamous pedophile?(Would that make Josie Bisset \"Lolita\")? What a strange, strange guy.",
         "*SPOILER ALERT* *SPOILER ALERT* A psycho and his Winnebago. So a nut travels up and down the Virginia Beach coastline looking for hitchhikers. Seems lonely boy has a fixation on his mother. Don't they all? He wants to mold the hitchhikers into his hot, saintly mother's image. Lurid mind games follow. This movie could have been good. The problem is the acting. Since most of the movie is spent having the psycho converse with his prey, it is imperative that the psycho be believable and, if at all possible, scary. He is none of that. In fact, he's awful. One of the worst acting performances ever. Since the camera is on him through most of the flick, he starts to wear you down with his lazy psycho routine. The hitchhiker he picks up, (Josie Bissett), was good. All of the other actors stunk. The music was also horrible. Late 80's synthesizer cheese. On the plus side, the movie did have an authentic, grimy feel to it. The filmmakers knew the right deranged words to put in the psycho's mouth. He just couldn't deliver them convincingly. There are some good exploitation scenes in his camper. Here's the psycho party mix: A girl, chloroform and an instant camera. It makes for a happy psycho. I did enjoy the completely unnecessary wet T-shirt contest as well. \"Hitcher in the Dark\" may just be sordid enough to warrant a viewing. I can't say that I loved every second of it but it does have its seedy moments.",
         "Deranged mama's boy Joe Balogh prowls the Virginia Beach area in his Winnebago,picking up women whom he thinks might take the place of his dead mother,then killing them when they come up short.He kidnaps a slim blonde(Josie Bissette),because of her resemblance to his dead mother.\"Hitcher in the Dark\" is a cheesy and predictable Umberto Lenzi's thriller that manages to be slightly entertaining.There are some total lapses in logic and there is absolutely no suspense.The climax is incredibly awful and the script is weak.The movie is poorly done in typical Lenzi fashion with lots of false suspense and a total lack of believability in both the performances.However if you are a rabid fan of Italian horror films you can give it a look.4 out of 10.",
         "Italian director Umberto Lenzi will hopefully always be remembered for gruesome and bloodthirsty splatter films like `Cannibal Ferox' and `Nightmare City' much more than this worthless movie. Hitcher in the Dark is lame and redundant attempt to explore the mind of a disturbed psycho-killer. The 22-year-old Mark Glazer picks up young hitchhiking girls in his camper. Too bad for these girls, Mark suffers from a really bad case of the Oedipus-syndrome and goes over to torturing the girls if they don't want to take mum's place. The plot of `Hitcher in the Dark' (wrong name, by the way, the entire movie is shot in broad daylight!) isn't exactly original and elaborates on the success of `The Hitcher', with a slight Norman Bates twist. There's no tension, the characters are absolutely non-believable and there even isn't enough horror to keep you alert. Hitcher does contain a few bloody make-up sequences, but nowhere near as shocking as some of Lenzi's previous films. I don't know if Josie Bisett likes to be remembered about her starring in this film, but it did mean her debut in the world of cinema. Bisett plays the main muse of the young weirdo. Although I don't like the film at all, I prefer it over watching all the `Melrose Place' episodes, so it can't be that horrible. And at least Bisett shows a little naked flesh here\u0085",
         "This is a completely artless and tasteless contribution to the psycho-slasher genre, existing only as another cynical Eurosleaze rip-off of a far superior American original, The Hitcher (something done only slightly better by Festa-Campanile's Hitch-Hike). Lenzi made some serviceable paint-by-numbers giallos and cannibal epics, but never had an original idea in his head. Without the exotic background -- it seems that colourless Virgina Beach was chosen merely as an excuse to insert some topless footage of college girls -- there's nothing left but bare-bones plot, pseudo-psychology and some nasty, intrusive violence. And campers aren't exactly the most exciting vehicles on the road, are they? The young cast play it so sensitively that one feels embarrassed for them. What is most irksome is that the DVD is being sold as part of \"The Giallo Collection\" on the strength of Lenzi's name. This ain't no giallo, and it's frustrating to think how many truly superior films by Sergio Martino and his colleagues are desperately in need of re-release.",
         "Tedious tale of a serial killer who picks up hitch-hikers, Daniela (Josie Bisset) is his current pray and Kevin (Jason Saucer) is her boyfriend trying to rescue her.It is written by Umberto Lenzi. The guy who made Cannibal Ferox & Eaten Alive should just stick to people who eat people movie, as this film plays out like a poor man's Toolbox Murders. Heh what am i saying?? Toolbox Murders was a poor man's Toolbox Murders. But I digress, the point is you'd probably do better just waiting for the upcoming remake of The Toolbox Murders by Tobe Hooper. My Grade: D Dvd Extras: Umberto Lenzi interview; theatrical trailer; trailers for Black Demons, and My Dear Killer Eye Candy: Daniela (Josie Bisset) goes nude & a completely random wet T-shirt contest",
         "I'm a big fan of Umberto Lenzi; he is the king of Italian 'Polizi' flicks and also made a handful of brilliant Giallo's, not to mention some decent stuff in other genres; but the man obviously didn't know when to quit as almost everything he made post-Cannibal ferox (Nightmare Beach excluded) is terrible, and Hitcher in the Dark is no exception...though it has to be said that it's better than the likes of Ghosthouse, Black Demons and House of Witchcraft. As the title suggests, the film is based around the common thriller of theme of hitchhikers, and the plot reminded me a lot of the solid seventies exploitation flick 'Hitch Hike to Hell'...mostly because they're essentially the same film (although the fact that this came out just a couple years after The Hitcher should be noted). We follow Mark: a disturbed young man who drives around in a camper van picking up young girls and killing them. It's not long before he comes across Daniela; a pretty young girl who Mark decides not to torture and kill immediately because of her resemblance to his mother... Yes, if Alfred Hitchcock taught us anything, it's that there's no such thing as a young psychopath who isn't obsessed with his mother, and clearly Umberto Lenzi subscribes to that view as well...which isn't much of a surprise. The fact that the film greatly lacks suspense doesn't do it much of a favour at all. The way that the plot is portrayed actually isn't that bad; but we're never made to care for the characters and it's always obvious where it's going (or at least it is to anyone who has seen more than a couple of films like this one) and the film never really manages to shock or surprise; two key elements of a thriller! The characters are all incredibly clichéd and positively wafer thin, which helps to make the film less interesting. Content with torturing his audience, Lenzi ensures that the film does not feature a great deal of blood or gore either, which often made me wonder why I was watching. Still, I can't completely condemn this film. Hitcher in the Dark is better than I was lead to believe it would be before seeing it; and at least I didn't fall asleep before the finish.",
         "One of Umberto Lenzi's finest films. This underrated movie goes deep inside the mind of a deranged serial killer/rapist. Excellent acting From Josie Bissett. I highly recommend this film. If you may happen to know where i can get this movie please Email me. Excellent Directing. Needs a little better Setting.",
         "Misogynistic psycho wackjob Mark (a creepily manic and intense performance by handsome beefcake hunk Joe Balogh) wears mirror shades, suffers from a severe mommy complex, drives a fancy expensive Winnebago, and has a nasty penchant for picking up stray foxy young female hitchhikers whom he likes to rape, debase and brutally murder. Mark chooses the feisty Daniela (gorgeous blonde hottie Josie Bissett, who went on to slightly more respectable work as a regular on the trashy nighttime soap opera \"Melrose Place\") as his next victim and abducts her. Daniela's obsessive boyfriend Kevin (woodenly played by Jason Saucier) gives chase. Limply directed by spaghetti splatter specialist Umberto (\"Nightmare City\") Lenzi (who also wrote the flat, clichéd, talky cookie cutter script), with slack pacing, nil suspense, mostly mild and goreless violence, atrocious acting, and a humdrum plot which offers no fresh twists or novel surprises, this strictly from hunger Eurodreck rip-off of \"The Hitcher\" qualifies as a real stinker. However, both Jerry Phillip's polished cinematography and Carlo Maria Cordio's throbbing rock score are up to par, while the copious gratuitous nudity rates as the single most watchable and enjoyable thing in this whole godforsaken turkey (said nudity includes several scenes of Bissett in the buff and an especially tasty wet t-shirt contest). And hardcore Bissett bashers such as yours truly should get a kick out of the extensive degradation Josie suffers throughout the flick: she's drugged, gagged and handcuffed by our star loony, has her hair cut short and dyed black, gets photographed by nutso while nude and unconscious, and is even forced to watch the freak carve the word \"pig\" in Kevin's chest. Taking that last nugget into consideration, I guess this picture ain't so bad after all.",
         "Hitcher in the Dark (1989) * 1/2 (out of 4) Incredibly silly psychological thriller from the same man who brought us Eaten Alive, Cannibal Ferox, Nightmare City and countless giallos. This time out he tells the story of a young man (Joe Balogh) who is so in love with his mother that he drives around in his RV kidnapping women who look like her so that he can sexually assault them, kill them and then feed them to alligators. All of this changes when he kidnaps one girl (Josie Bissett) who he plans on settling down with, although she doesn't share the same feelings. This Italian/American production is a cross between Bill Lustig's Maniac and Alfred Hitchcock's Psycho and Vertigo but needless to say it doesn't come close to any of those films. This movie is without question one of the dumbest and most boring thrillers I've ever seen and trust me when I say I've seen a lot. The biggest problem is Lenzi's direction, which is just downright horrible as he never brings any life to the film nor does he ever dig into this killer's mind even though that's what he's trying to do. There's no doubt Lenzi could create a good film earlier in his career but everything I've seen from after 1983 is pure junk and this film is included. There's some female nudity along the way but this too grows very tiresome. The only thing that keeps this sucker from getting a BOMB rating is the incredibly horrid dialogue, which Ed Wood would probably laugh at. The dialogue in this film is so bad that I couldn't help but laugh at loud during several scenes because it really seems like a two-year-old wrote it. Be sure to pay close attention to one scene where the girl's boyfriend, searching for her, sneaks into a RV, which belongs to a black man. This scene must be Lenzi paying tribute to the blaxploitation pictures of the 70s because of how bad and out of touch with reality it is.",
         "Although this is a road movie ,Lenzi's screenplay (Lenzi takes an American name in the cast and credits of the version I saw)is roughly a photocopy of William Wyler's impressive \"the collector\" (1965) with snatches of \"Psycho\" (the mother) and \"Vertigo\" (how to turn a woman into another one)thrown in.A collector who would travel all across the country ,picking up girls and (well read the plot)...The dialog is most of the time funnier than it is scary,and acting is particularly poor.Some scenes such as the \"beauty\" contest are mostly filler.At times ,it seems that Lenzi is begging to be taken seriously : there is a \"poetic\" scene when the \"hero\" helps a bird to fly away.But most of the time it is Punch and Judy level with vodka,handcuffs and pills galore.One can save ,at a pinch,the scene in the drive- in where people are having fun watching a farce while horrible things happen not far from them."
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Filmirage"],
      "summaries": [
         "Mark, a disturbed young man, harbors sexual desires for his deceased mother. Driving around the back roads of Va. Beach, Mark seeks out lone females to carry out his twisted sexual fantasies. Enter Daniela, who bares a striking resemblance to mom, who happens to make the mistake of accepting a ride from Mark.",
         "Sick young man drives around in his daddy's camper, looking for lone stray females to kidnap, torture, rape, and murder."
      ],
      "budget": 0
   },
   "movielensId": 133045,
   "movielens": {
      "languages": [
         "Italiano",
         "English"
      ],
      "releaseDate": "1989-01-01",
      "dvdReleaseDate": null,
      "directors": ["Umberto Lenzi"],
      "runtime": 95,
      "movieId": 133045,
      "title": "Hitcher in the Dark",
      "mpaa": null,
      "actors": [
         "Joe Balogh",
         "Josie Bissett",
         "Jason Saucier",
         "Robin Fox",
         "Gary Wade Morton",
         "Fay W. Edwards",
         "Tom Schultheis",
         "Todd Livingston"
      ],
      "imdbMovieId": "0098072",
      "originalTitle": "Paura nel buio",
      "genres": [
         "Crime",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sick young man drives around in his daddy's camper, looking for lone stray females to kidnap, torture, rape, and murder.",
      "tmdbMovieId": 28318,
      "avgRating": 2,
      "releaseYear": "1989",
      "numRatings": 1,
      "posterPath": "/jWI9GOQHemeIRh4TRuqZAMom4TW.jpg"
   }
}