{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0426955",
      "video": false,
      "title": "Barbie as The Princess & the Pauper",
      "recommendations": [
         15015,
         15016,
         15167,
         13002,
         13284,
         13004,
         13283,
         15906,
         13285,
         13459,
         16962,
         21705,
         18198,
         16418,
         34134,
         23566,
         44874,
         73456,
         196254,
         129533
      ],
      "backdrop_path": "/hAEQCcfA05wP2SplosJn1dkienN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Princess Anneliese / Erika (voice)",
               "gender": 1,
               "credit_id": "52fe46409251416c750723bf",
               "name": "Kelly Sheridan",
               "profile_path": "/tDXbnXNhZjRsZu43WpvPVtjUMJd.jpg",
               "id": 74358,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Minister (voice)",
               "gender": 0,
               "credit_id": "52fe46409251416c750723c9",
               "name": "Roger Monk",
               "profile_path": null,
               "id": 126316,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Herve (voice)",
               "gender": 2,
               "credit_id": "55e51bc292514137a0000e36",
               "name": "Garry Chalk",
               "profile_path": "/1estlif6pDM9uV7sgOsTU3WQeYw.jpg",
               "id": 26089,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Palace Maid (voice)",
               "gender": 1,
               "credit_id": "52fe46409251416c750723d1",
               "name": "Janyse Jaud",
               "profile_path": "/e1BhQGIDcUP8rwyQ7jUd4WrSMog.jpg",
               "id": 86788,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Madame Carp (voice)",
               "gender": 0,
               "credit_id": "52fe46409251416c750723d5",
               "name": "Pam Hyatt",
               "profile_path": "/xCvwy3qZwt9oh1nVgneahlCuRQh.jpg",
               "id": 65799,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Princess Anneliese (singing voice)",
               "gender": 1,
               "credit_id": "55e51c1a925141379a000e83",
               "name": "Melissa Lyons",
               "profile_path": null,
               "id": 85429,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Erika (singing voice)",
               "gender": 0,
               "credit_id": "55e51c1ac3a3681402000caf",
               "name": "Julie Stevens",
               "profile_path": null,
               "id": 1231670,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "King Dominick (voice)",
               "gender": 2,
               "credit_id": "55e51c1a9251413797000d91",
               "name": "Mark Hildreth",
               "profile_path": "/uUyiAzxmbEu0u8x5qhFmXhuJiPJ.jpg",
               "id": 59311,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "King Dominick (singing voice)",
               "gender": 0,
               "credit_id": "55e51c1bc3a3681405000e3c",
               "name": "Mark Luna",
               "profile_path": null,
               "id": 1502975,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Julian (voice) (as Allesandro Juliani)",
               "gender": 2,
               "credit_id": "55e51c1b925141379a000e85",
               "name": "Alessandro Juliani",
               "profile_path": "/f8pVEpYsRU30EsMoWcBsTkUN9e0.jpg",
               "id": 59312,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Preminger (voice)",
               "gender": 2,
               "credit_id": "55e51c1bc3a3681408000f4b",
               "name": "Martin Short",
               "profile_path": "/oZQorXBjTxrdkTJFpoDwOcQ91ji.jpg",
               "id": 519,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Serafina / Bertie (voice)",
               "gender": 1,
               "credit_id": "55e51c1b92514137a6000dd2",
               "name": "Kathleen Barr",
               "profile_path": "/5eHupAvT4hsj15MABJCKjGMKKZ5.jpg",
               "id": 45923,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Wolfie / Guard #3 (voice)",
               "gender": 2,
               "credit_id": "55e51c1cc3a36813f2000e4d",
               "name": "Ian James Corlett",
               "profile_path": "/fjgPxkw9wexgeNujdI3k6qi2wL4.jpg",
               "id": 45924,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Queen Genevieve (voice)",
               "gender": 0,
               "credit_id": "563dee1bc3a3681b5e028dbd",
               "name": "Ellen Kennedy",
               "profile_path": null,
               "id": 126224,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46409251416c750723c5",
            "name": "William Lau",
            "profile_path": null,
            "id": 80948,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 9.091826,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 15165,
      "vote_count": 290,
      "budget": 0,
      "overview": "In her first animated musical featuring seven original songs, Barbie comes to life in this modern re-telling of a classic tale of mistaken identity and the power of friendship. Based on the story by Mark Twain,",
      "similar": [
         812,
         10530,
         872,
         11224,
         38757,
         224141,
         14128,
         16119,
         8587,
         9479,
         11631,
         114,
         10882,
         9444,
         15121,
         9325,
         10545,
         703,
         134,
         252
      ],
      "original_title": "Barbie as The Princess & the Pauper",
      "runtime": 85,
      "poster_path": "/xHYsUwUe4MaNc6mbNBGTkqZSnPk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2004-09-28",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Lau"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Cliff Ruby",
         "Elana Lesser"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0426955/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTUyMzQ1NTg4NF5BMl5BanBnXkFtZTcwMDQwNDYyMQ@@._V1_UY268_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Kelly Sheridan",
         "Melissa Lyons",
         "Julie Stevens"
      ],
      "reviews": [
         "This movie is close to perfect for a little girl who is the frilly/froo-froo/princess type, as mine is. It has \"lovely Barbies in beautiful dresses\" (her wording), kitties, and songs with catchy tunes. I'm not kidding... she and I both go around singing \"...I'm just like yooooou, you're just like meeeeeeeee...\" all day! Now and then you can catch her older brothers doing the same, but they will deny it to the death. Definitely a quality girl's movie. Excellent song writing and voicework. Plus, the visuals are top notch. Colorful animation with incredible facial expressions make this watchable, even for the adults in the room. The doggish-cat (another cute line in a song), named \"Wolfie\" is a cute character. I have given up explaining that it IS a cat and not a weird looking dog. My daughter wants one for Christmas now...",
         "Actually, I thought Barbie as the Princess and the Pauper was surprisingly good. Usually I'd kick up a big fuss before watching Barbie, of all things, in anything at all. But as an avid fan of musicals and music in general, I felt compelled to watch it after one advertisement as I thought the music was indeed refreshingly catchy. The plot line was pretty sweet and... I just enjoyed it tremendously... even though I have to agree that the commercials were irritating. I particularly like the song \"I Am A Girl Like You\" and would seriously recommend fans of musicals and/or music in general to watch it as a form of relaxing distraction. PS. I'd also like to comment on cyclone259's comments about adults finding Barbie as the Princess and the Pauper to their tastes. Everyone has his/her own opinions and you would do well not to judge them based on them. In fact, it's actually quite insulting.",
         "How's this for a commentary on the music in this movie: I sometimes specifically ask my wife if she has it in the car to listen to, pushing out Duran Duran or other music from the golden age of the early 80's. I am skeptical of musicals by nature, so when I heard that the Barbie people had produced a musical, I could only imagine how shallow the music was going to be, seeing that it would be directed towards our 7-year-old daughter's age group. I of course had no choice but to hear it several times after we bought the movie and our daughter and 3-year-old son wanted to listen to the CD in the car. I was surprised beyond anything I could imagine to find that there is some serious quality among the songs that are done here. As for the movie's animation, it may be my imagination that the production skimped a bit in that area to pay for the songwriting. And of course the Barbie series' animation was already nothing to get excited about in this day of Pixar, Dreamworks, and Blue Sky producing top-notch computer-generated material. But the music itself is really a find, and I would recommend it to anyone.",
         "Cyclone, you are SO WRONG..I am a 35 year old mother of three, and I adore this movie! I bought it for my 3 year old daughter, and both she and my 11 year old daughter watch it every day. Even my 14 year old son got a kick out of it, although he'd NEVER admit as much! I find myself listening to the music CD, and the songs pop in my head at work every day. And you know what? That doesn't mean I have no life..it means I can have FUN! Readers, if you are contemplating renting or buying this movie, I say give it a shot! You'll be pleasantly surprised..it's very cute, entertaining and fun! Might I suggest that readers skip over Cyclone's comment, and let this movie stand for what it is..a fun, DECENT movie the whole family can enjoy!",
         "I, personally, thought the movie was very well done. The songs are very catchy. I have a special needs child who has a very hard time having anything catch her eye for longer than an a half hour and this movie was one that did. She sat enraptured. The fact that the movie came with a CD of the songs helped even more. She loved that she could listen to the songs on her own time. She now plays with her Barbie's, listening to the CD and having them \"sing\" along to the CD. Just by her enjoyment alone my in-laws and I have already decided her 3 major gifts by myself, my father, and my in-laws will be both singing Analese, singing Erika, and the singing Serafina cat. It's a rare find when you can find anything that will hold a child attention longer than a second. This movie definitely does that.",
         "The thought of watching a Barbie video didn't thrill me but I knew my daughter would be interested so I bought this. To my surprise, it was wonderful! The music is extremely well done, both lyrically and melodically. The lyrics are very clever and poignant. It's also performed by the London Symphony Orchestra. Unlike most Disney movies and other children's shows, there is no violence at all. There's also no bad language. That alone is very refreshing. Martin Short does the voice of Preminger and he's simply fantastic. He also gets to showcase his wonderful singing voice and unique voice talents. It's hard to imagine anyone not liking this movie.",
         "I think that this movie was great, my favorite out of all Barbie movies. The songs were inspirational and i own the Princess Anneliese and Erika dolls and I'm 14. I think whoever thinks this movie is a waste of time and loses their interests then they don't have a good sense of whats good and whats not. My favorite song was the one where Princess Anneliese and Erika sing a duet. The \"I'm just like you\". And Premiger hes hailarious even though hes the bad seed in the movie when sees Wolfie and he screams like a girl and those shoes they almost look like girl heels! LOL! I think this is a great movie for any age and I strongly disagree with the woman who submitted that it wasn't awe-inspiring or whatever. i think the movie was great and she must have been blind. Personally i thought it was a laugh from a 14 year olds point of view. Erika was my favorite character one of course shes a brunette like me. two shes more outgoing and i love her voice. I like that blonde idiot that worked for Premiger he was so goofy i loved him!",
         "My four-year-old daughter has been watching this over and over, and has drawn crowns on her shoulders to match Princess Annalise's crown-shaped birthmark. The animation looks like cut-scenes from a video game, rather than the quality you'd expect from an animated movie. But it perfectly hits the expectations of its target audience: it's pretty, engaging, colorful and clean. The characters are one-dimensional stereotypes, but the title characters (both 'played' by Barbie) are actually quite likable. Princess Annalise is a geek (a pretty geek, but still a geek), has the hots for her impoverished tutor rather than her intended kingly husband, and ends up saving the kingdom with her geological talents and business acumen (really!). The Pauper, Erika, is cheeky, goofy, and independent. She might have a king falling in love with her, but she's got her own dreams that don't necessarily coincide with his, and she's going to be true to herself first. The songs are nothing startling. They're pleasant, joyful, sometimes a little bit silly, and sung well. There are simple, clear girl-power messages throughout this film. I'd much rather my daughter be indoctrinated by this than by stories where the beautiful, vapid princess marries the handsome prince and nothing else actually happens.",
         "Me and my 3 year old daughter love the Barbie movies, and this one is just as good as the others. It's Barbie's first musical, and the music, I think, is every bit as catchy as Beauty and the Beast. I love, love, love too that Barbie isn't \"rescued\" by the Prince. She saves the kingdom with her intelligence - not her status or appearance! It's funny. My Dad was over here, and I was trying to explain the plot to him. It's complicated, but doesn't seem so when you're watching it from start to finish. I think that's a sign of a good movie - it's not mindless drivel. You have to pay attention, and follow the story. Also - the DVD comes with sing-alongs. My 3 year old especially loves those. She knows all the words to these songs.",
         "Some of the sweetest words I've heard lately were, \"Daddy, come watch Barbie with me.\" After she feel asleep in my arms, I finished the movie... re-wound it and watched some scenes again. I later rented the movie again for myself... uh, err, I mean for her of coarse... okay, I have no pride. I thought the lyrics and music were world level excellent. The delicate, innocent emotions captured by the animators were heart melting and Martin Short's voice work was hilarious. I think if this was a more innocent time, \"Arnie Roth\" (composer) would be listed among the greats. Hmmmm, Rogers and Hammerstein? - maybe more still to come from this great talent. A definite top 500 best movies of all time.",
         "(Well, I gave this a 10 only because that's what my 5 year old daughter would give it.) My daughter and I were at the video department and I asked her to pick out a video and I'd buy it for her. To my horror, she picked Barbie. I was dreading this because she's the type of person that can watch a movie over, and over and over again; and I sit with her and watch it again, and again (and I pretend to enjoy it). :o) Well, to my surprise, it wasn't that bad at all. I actually enjoyed it. Spoiler======================================================== The princess is intelligent and strong; she doesn't wait for the prince to rescue her. The pauper is not so easily swept away by the prince. She follows her dream to be a singer and then she decides when she wants to marry. ================================================================ Over all, I was very pleasantly surprised. The music was very entertaining as well.",
         "I've bought every Barbie-related video for my 6 and 3 year-old daughters, and they enjoy them. From an adult's perspective I think they're children's movies. Although not on par with movies from such mega-sized production companies as Pixar, Dreamworks, and Disney, they are still quite well done. The movie is replete with fine songwriting; however, those desiring a spiritual experience with each movie's score may find themselves disappointed. In the end my daughters love it, which is a rather good sign (that we'll be watching it nine times a day for the next six months ;-). Of course, with the tie-ins from the endless supply of Barbie commercials with the tag-line \"HEAR BARBIE SING FOR THE FIRST TIME\", the dolls that little girls can play with to reenact the movie (one of my daughters' favorite pastimes), costumes for little girls to wear to reenact the movie themselves (affording my daughters even more enjoyment, as well as their mother an I :-), the CD that comes with the DVD (which music is destined to not leave the van's player for a year or so ;-), I'm sure the sales will be good. As well they should, allowing Mattel and Mainframe a return on their investment and profit. It may come as a shock or offense to some to learn that this is the reason these companies are in business. Indeed, all the items listed above were created to pragmatically serve the bottom line of someone's financial ledger, but my children love them and take great enjoyment in them. NOTE: 'Staged' blooper reels are cute and fun (and, it may come as a shock to some to learn that children like things akin to 'cute and fun'). If you're an adult and thought this was NOT top-notch entertainment for your own age bracket, then you should: a) get over it, considering that the movie was not created for you AND b) seriously think about re-examining your stuck-up and sardonic personality (which might just lead to a more fulfilling social life). Naturally, that last remark betrays much the same qualities in my own fallen nature, but I couldn't help it. Frankly, I enjoy these movies for my children. They are fun, well produced, and actually present morals, personality characteristics, and scenarios that I can stand behind. Although I am not a Disney, Pixar, etc. hater (yes, I have little princesses of my own ;-), I must say that too often do I have to counter teach lessons proffered by their movies. i do recommend the Barbie movies.",
         "I have been amazed that Mattel and Mainframe Entertainment have been able to to keep up the level of quality in these videos. With so many low quality videos coming out of the \"big\" animation studios, my wife and I are always expecting that we might be let down each time a new Barbie video comes out; however, each one has met or exceeded our expectations! The music in this musical is well done and fun to sing along with. The voice actors are amazing, and I have enjoyed the famous actors they have chosen for each video. Someone in their marketing department deserves a raise! I don't know if we'll get the next one, \"Fairytopia\", but the first four videos have been well worth our investment. We appreciate that the music in the videos has been very high class--no rap or rock music--well done!",
         "cte79061: I am a adult and I loved the Barbie: The Princess and the Pauper movie. It has a good story line and good intrigue and the music was great. cyclone 259: (If you're an adult and thought this was top-notch entertainment for your own age bracket, then you either: a) you need to get out a WHOLE lot more OR b) seriously think about re-examining your personal and/or social life.)End cyclone259 cte79061: Who are you to judge me because I choose to like this movie? So, you judge me and tell me I need to get out more or I need to re examine my social life. It seems to me you need re think your judgmental attitude and knock yourself off the pedestal you put yourself on. Only God has that right to judge me. I even like the Barbie as Rapunzel and Barbie of Swan Lake. I'll like what I want it's my God given right.",
         "Barbie Rapunzel. Barbie Mariposa. Barbie and the Twelve Dancing Princesses. While all of these are classic, mindblowing, unbelievably incredible films, there is one that exceeds them all. You probably guessed it: Barbie as the Princess and the Pauper. William Lau directed this masterfully created spin-off of Mark Twain's the Prince and the Pauper. While the names Kelly Sheridan, Melissa Lyons, Martin Short, and Alessandro Juliani alone might be enough to get you to see this fantastic movie, there's so much more to this movie that makes it well worth the watch. Personally, I've always been drawn to musicals, but only if the music is well written and performed. There are eight songs total (plus an additional 'I'm on My Way' by Sara Niemietz that plays during the closing credits), and each one has a unique objective and purpose. Of the eight songs, almost all of them are duets, filled with melodic harmonies which make the music all the more first-rate. Different people prefer different movie genres. Fortunately for you, as well as everybody else considering watching this amazing film, this movie appeals to every age and group of people. For the romance lovers out there, this film has a heart-wrenching forced marriage between a princess who is in love with a commoner and the dashing King Dominick who wishes to find a spouse who shares his love of music. People who prefer classical entertainment will find this twist of the Prince and the Pauper an extremely well done and worthwhile movie. To those who are more interested in comedy, there are countless moments that are sure to leave you holding your stomach in laughter. And although this movie has adventurous scenes, it never gets too intense to the point where watchers are unable to relax and enjoy the movie. Every movie has a weakness, but the only flaw I was able to find in this film was that the songs got stuck in my head and I find myself singing them to myself constantly, which, truthfully, isn't a bad thing. One other thing that people might complain about is the talking animals. However, give these hilarious creatures a chance, and you'll soon find out that they are an indispensable part of the movie. Essential to the plot and providing lots of comedy, the animals are one of the key reasons this movie is so good. If you're feeling doubtful about how good this movie is, the only way to truly find out and experience the true fascination of this film is to watch it, and that is what I urge you to do as soon as you can. You will not regret watching this one of a kind Barbie movie and it won't be long before you're singing along to the songs 24/7.",
         "This was the best barbie movie ever made!I was about 8 years old when I watched this movie first time, from then it was my most favorite movie till today (today I was of 20 years!), and I don't think any barbie movie can take it's place. The songs, characters, their voices are very very outstanding I love them all very much! Barbie as magic of Pegasus and Barbie in rock in' royals are on the second in my favorites list. Barbie as princess and pauper is written in my heart as Anneliese and Erika sing \"Written in your heart\", this is the fact I give it 10/10. I love that movie very much! The villain, Preminger is very very funny and my most favorite villain from all the barbie movies! The animation was very peaceful also the musics, I love all the songs very much! Anneliese, Erika, Julian, Dominic and Preminger are my most favorite characters I love them all!",
         "This movie is honestly the best Barbie movie out there. This is largely due to the brilliance that is Preminger. He has some of the funniest lines in the film and he seems to be the only one who has any idea how to run a kingdom and how basic economics works. The fact that the kingdom relies upon a sole gold mine doesn't make much sense, but since it is a movie for young children this fact can be overlooked and can provide entertainment for older viewers. Annelise's 'saving' of the kingdom with the discovery of amethyst in the mine is also quite illogical, but yet again, can be overlooked. Other than Preminger, Dominick seems to be the only sane person in the whole kingdom - his comment that 'something's not right' (don't quote me on that) is all too poignant. In all seriousness, the songs in this movie are surprisingly catchy - with Barbie even re-using them in later films - and the story is very nice for younger children. This is probably Barbie at its best.",
         "This movie was the first Barbie movie that i completely love! As they say in the commercials, this is the first movie Barbie sings and i loved all of the songs and dances. They are just so well written. Since none of my friends liked the movie and since i loved it so well, i had to kind of keep it a secret until the day that i forced all of my friends to watch it and guess what! They loved it also! They all kept singing the songs randomly everywere and they didn't care if people were stairing at them because the songs make you feel so good about yourself. I completely think everyone should watch this movie, its amazing!",
         "I've read many of the other reviews for this movie and usually I read the negative first. First of all this movie is aimed at little girls. Girls probably from 3-10 who love all the beautiful magic this film brings to life. The story is similar to the Prince and the Pauper and it isn't historically accurate. This is after all a simple movie for children and doesn't need a lot of violence, action, or too much depth. The colors are rich and the animation (all computer animated) is beautiful. The details and the softness of the characters make the movie much easier to watch than some of today's - Saturday morning cartoons. I am a sucker for all fairy -tales and like to watch them all - even as an adult so I can sit and enjoy these types of movies with my daughter. This movie defiantly isn't for everyone- but if you are into the girlie scene and love fairy tales and won't go overboard if there is changes made - then this is your ticket! And it's perfect for the little princess who would love to see her toys come to life on screen.",
         "Hi everybody! I live in city of Novi Sad in Serbia. I purchased the DVD 6 months ago for my small doter. Just recently I started to watch it with her regularly, and I am amazed! So nice, so perfect, what a singing, Barbies together are extraordinary singers, nice melodies, and Preminger on the other side is genius character presenter himself. I read here that he was nominated, no wonder, excellent!! What to say except I will see this movie many more times. I am interested to buy a complete screenplay so that I can understand what are all the words (since English is not my native language and I am missing some words). Does anyone know where one can buy it?... All the best to you all! Again, this screenplay is something this planet needed!!! Great, simple but sublime! I salute you all, Regards, Dragan",
         "Being sceptical of Barbie computer animation, I hesitantly agreed to watch this film with my 6 year old daughter. I was wonderfully surprised. The music, the animation, and the story were fluid, artistic, and actually captivating. I found myself WANTING to see what was going to happen next. It wasn't as predictable as I initially thought, and I found myself singing along by the end! Well done to the producers of the film along with everyone else involved. I would highly recommend this film to anyone with children (my 8 year old son even watched it without a moan) and to anyone who is just a hopeless romantic. Very enjoyable viewing. I have since seen the movie several times...sometimes with no children accompanying me.",
         "I bought the DVD as soon as it came out. I've watched it with my grand-daughter about a dozen times. I still can't get some of the songs out of my head. I sing along. I buy all the Barbie movies and this has to be the best. I'd actually like to see a stage production of this. If it's done by young people, even better. Let's remember, the target audience is young girls.......I'd like to know of just one girl that has the movie, but didn't watch it more than once. And they know the words to all the songs. (okay, so do I). What on earth could they have done to make it better?",
         "OK, OK, so it's not the most sophisticated film in the world, but it has a surprisingly good plot and great sing-along music. Good for when you're feeling low, this movie will cheer you up. Best bits are definitely the 'out-takes' in the credits. They must be seen to be believed. My one grumble however, is that the Shellys could have put in a bigger appearance; they didn't even have speaking parts - they should talk to their agents! Kelly Sheridan is fabulous as always although the best character must be the super-camp villain! His evil laugh just cracks me up. Then there is the 'doggish-cat' who always barks instead of meowing, which is a little strange, but very cute. I have seen this film far too many times and know practically all the words to the songs (sad but true!), but it never gets dull. All in all, another great movie from Barbie and a worthwhile first musical. I really need to see the other Barbie films though, they are being made too fast for me to catch up. But of the ones I've seen, this is the best. Suitable for all ages!",
         "This is a wonderful film. I bought the video tape for my 3-year-old daughter, but ended up seeing it more than her :) I wonder if someone can help me with the lyrics of all the songs, specially the one that says: and you're always free to begin again, and the one that says: I love you for you, when you love me for me. They are very motivating, and I'd love to learn them and then teach them to my children. My email address is h.fayed@MT.com.kw. What I also like about it is that it is computer animated cartoon, not like the regular cartoons we usually see. The music is of an excellent standard. Involving both human characters and animals truly enriches our children imagination. my kids loved the characters and the two cats, and of course... the horse. I'd like to add that the scenes looked as if a professional camera-man took all the shoots. the 'camera' was moving from all the corners. The movie is wonderfully great."
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Family",
         "Musical"
      ],
      "productionCompanies": [
         "Mainframe Entertainment",
         "Mattel"
      ],
      "summaries": ["In her first animated musical featuring seven original songs, Barbie comes to life in this modern re-telling of a classic tale of mistaken identity and the power of friendship. Based on the story by Mark Twain, Barbie as The Princess and The Pauper features Barbie in an exciting dual role as a princess and a poor village girl - two girls who look amazingly alike. The girls' paths are fated to cross when Princess Anneliese is captured and Erika, her look-alike, must try to save her. Can Erika pretend to be the Princess and foil her captor, the evil Preminger? And what of the handsome King Dominick, who falls in love with Erika, mistaking her for Princess Anneliese? In this magical musical performance, two beautiful, adventurous girls dare to follow their dreams and discover that destiny is written in a very special place: your heart."],
      "budget": 0
   },
   "movielensId": 133123,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2004-09-28",
      "dvdReleaseDate": null,
      "directors": ["William Lau"],
      "runtime": 85,
      "movieId": 133123,
      "title": "Barbie as The Princess & the Pauper",
      "mpaa": "G",
      "actors": [
         "Kelly Sheridan",
         "Roger Monk",
         "Garry Chalk",
         "Janyse Jaud",
         "Pam Hyatt",
         "Melissa Lyons",
         "Julie Stevens",
         "Mark Hildreth",
         "Mark Luna",
         "Alessandro Juliani",
         "Martin Short",
         "Kathleen Barr",
         "Ian James Corlett",
         "Ellen Kennedy"
      ],
      "imdbMovieId": "0426955",
      "originalTitle": "Barbie as The Princess & the Pauper",
      "genres": [
         "Animation",
         "Family",
         "Comedy"
      ],
      "youtubeTrailerIds": ["UBqSe6lgCto"],
      "plotSummary": "In her first animated musical featuring seven original songs, Barbie comes to life in this modern re-telling of a classic tale of mistaken identity and the power of friendship. Based on the story by Mark Twain,",
      "tmdbMovieId": 15165,
      "avgRating": 3.31,
      "releaseYear": "2004",
      "numRatings": 50,
      "posterPath": "/xHYsUwUe4MaNc6mbNBGTkqZSnPk.jpg"
   }
}