{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "europe",
            "id": 1295
         },
         {
            "name": "iceland",
            "id": 5746
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "disaster movie",
            "id": 189411
         },
         {
            "name": "volcanic ash",
            "id": 220844
         },
         {
            "name": "cold snap",
            "id": 220845
         }
      ],
      "imdb_id": "tt2538128",
      "video": false,
      "title": "100 Degrees Below Zero",
      "recommendations": [
         58765,
         125479,
         176589,
         222299,
         54606,
         58806,
         80177,
         58782,
         90231,
         74539,
         44811,
         79078,
         297544,
         61403,
         251733,
         130165,
         30385,
         137752,
         147879,
         211914
      ],
      "backdrop_path": "/mDsdSZZfxnd9RpEt0JNz6hVtLD2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ralph Dillard",
               "gender": 2,
               "credit_id": "52fe4c7e9251416c7511c255",
               "name": "John Rhys-Davies",
               "profile_path": "/dvT1NPY8CXIVQh0O1h6rpfYOgKz.jpg",
               "id": 655,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Steve",
               "gender": 2,
               "credit_id": "52fe4c7e9251416c7511c259",
               "name": "Jeff Fahey",
               "profile_path": "/6l44xDPdJE4dQAEDN9eShnJOSo8.jpg",
               "id": 20495,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Ryan",
               "gender": 0,
               "credit_id": "52fe4c7e9251416c7511c26f",
               "name": "Marc McKevitt Ewins",
               "profile_path": null,
               "id": 1171171,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lacey",
               "gender": 0,
               "credit_id": "52fe4c7e9251416c7511c273",
               "name": "Judit Fekete",
               "profile_path": null,
               "id": 1171173,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jackson",
               "gender": 0,
               "credit_id": "52fe4c7e9251416c7511c277",
               "name": "Andray Johnson",
               "profile_path": null,
               "id": 165282,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Taryn",
               "gender": 1,
               "credit_id": "52fe4c7e9251416c7511c27b",
               "name": "Sara Malakul Lane",
               "profile_path": "/xd8q3FU36xf6N7aHXZ39T3XTidx.jpg",
               "id": 134488,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jana Foster",
               "gender": 1,
               "credit_id": "58824a9e925141302b0107c4",
               "name": "Jane Doole",
               "profile_path": null,
               "id": 1742634,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Dr Goldschein",
               "gender": 2,
               "credit_id": "58824ab8925141302b0107e0",
               "name": "Iván Kamarás",
               "profile_path": "/cvfG57ICJjm7RM9Xco4kxxgcvvr.jpg",
               "id": 145812,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lieutenant Perkins",
               "gender": 0,
               "credit_id": "58824ad89251413034010987",
               "name": "Luke Healy",
               "profile_path": null,
               "id": 226581,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Dr. Oppemheim",
               "gender": 0,
               "credit_id": "58824c5ac3a368146700ffbc",
               "name": "Jordan James Smith",
               "profile_path": null,
               "id": 1023428,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Claude",
               "gender": 2,
               "credit_id": "58824c929251413031010105",
               "name": "Tamás Lengyel",
               "profile_path": "/lcTbDhcttrHwPW3BPOrmTsVn0yF.jpg",
               "id": 1177074,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Ana",
               "gender": 0,
               "credit_id": "58824dc8c3a3681470010f2b",
               "name": "Fru Roszil",
               "profile_path": null,
               "id": 1742651,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4c7e9251416c7511c25f",
               "name": "R.D. Braunstein",
               "profile_path": null,
               "id": 1141883,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c7e9251416c7511c265",
               "name": "H. Perry Horton",
               "profile_path": null,
               "id": 558864,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4c7e9251416c7511c26b",
               "name": "Richard Schenkman",
               "profile_path": "/puAjxwQ1XKIVyMOX5yN9Lw1uyc7.jpg",
               "id": 76462,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.379844,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 182228,
      "vote_count": 30,
      "budget": 500000,
      "overview": "After freak climate and weather events destroy the world around them, a group of rogue scientists attempt to reverse the deadly new ice age.",
      "similar": [
         1701,
         1368,
         7191,
         708,
         135397,
         107846,
         296524,
         13291,
         12088,
         5919,
         903,
         336882,
         10471,
         29259,
         503,
         483,
         9086,
         551,
         10447,
         7229
      ],
      "original_title": "100 Degrees Below Zero",
      "runtime": 88,
      "poster_path": "/98xEqfsOHvTyKqh7Hb4a5USmEPz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ic2bTizdzRLDVzAvN7MXdUg3WQV.png",
            "name": "The Asylum",
            "id": 1311,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "The Global Asylum",
            "id": 1371,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Next Station Productions",
            "id": 9030,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Institution",
            "id": 14290,
            "origin_country": ""
         }
      ],
      "release_date": "2013-03-29",
      "vote_average": 3.9,
      "belongs_to_collection": null,
      "tagline": "Cold as Hell",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["R.D. Braunstein"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "H. Perry Horton",
         "Richard Schenkman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2538128/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTkyODc2MTMzNF5BMl5BanBnXkFtZTcwNTUzNjE1OQ@@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Jeff Fahey",
         "Sara Malakul Lane",
         "Marc Ewins"
      ],
      "reviews": [
         "Bad acting, bad effects, bad script, bad all the way around. But I loved it. I couldn't stop laughing. The father is flying across the Atlantic in a little twin-engine plane and Air Traffic Control asks him to descend from 30,000 feet. What? There's a huge snowstorm that has shut down the airport in London and the father and new wife manage to rent a car. The steering wheel is on the wrong side for the UK. They're driving in a huge snowstorm with the temp well below freezing and rainwater is hitting their windshield along with the fake snow. An 8.4 earthquake hits Paris but many of the buildings, including the Eiffel Tower and Arc de Triomphe are still standing. Here's a drinking game for the movie: take a drink every time the brother or sister fall down. I think I counted 30+ times. This is my new favorite \"Worst Movie Ever.\" Invite your friends over to watch this really campy movie.",
         "If the point of this production was to make one of the worst movies possible, then it was a success. I've seen better directed pornography, which incidentally, also had better acting. Nothing about this movie makes sense. If it weren't for the measurements of Sara, I probably wouldn't have been able to watch it until the end. Definitely not work the cost of electricity to turn on the DVD player. This piece of amazing should have gone straight to the garbage. It's not even good enough to go to television, as cable companies would have to pay advertisers to use their commercials during this movie. If this was made by a first year film student, it still wouldn't excuse the quality, or lack thereof, of this thing.",
         "I don't usually post reviews - BUT WOW. This has got to be one of the worst things I've ever seen. I've watched through all kinds of garbage, sci-fi originals, terrible found footage horror movies and pretty much everything in between. I can't even begin to summarize the worst parts of this pile of crap. This is a truly terrible experience. The \"acting\", the script (I'm seriously wondering if there was one), The \"special effects\" pretty much every aspect of this thing is laughable. In the end I was left with the following questions: How does something of this quality makes it out of the home studio? How long does it take to make something like this, a couple weeks? There are some decent (At least I thought they were before) actors in this, what was the incentive, a trip to Europe? In the end though, really why bother?",
         "This film is about a man trying to rescue his children from a terrible storm. The storm is used as a prop for the family drama and some parts of it seem randomly thrown in and is inconsistent in its application. Hopefully it had a really low budget. Don't waste your time. This was an accidental online purchase for us. The movie has horrible acting. Sara Malakul Lane and Marc McKevitt Ewins are unbelievable... so bad that their falls are almost humorous. Bad directing probably contributed to the poverty of the film. There is a random girl in film who's reason for being there is flimsy at best. There is an accident near the end that is bizarre and adds nothing. Special effects are reminiscent of special effects from the 70s.",
         "The description of this movie reminded me of the movie \"The Day After Tomorrow,\" so I watched it on Netflix. I'm sorry that I did. This could possibly be one of the worst movies I've ever watched. The acting was utterly terrible. I liked the theme of the movie but the plot was extremely disappointing. The only good thing was that it was suspenseful - whether or not the parents and kids will make it to the Eiffel Tower. It would've been slightly more okay with a better group of actors, a director who knows what camera angles are good, and a better script. It had potential but fell flat on its face.",
         "This is by far the worst excuse for a movie I have ever seen. Even the bad movies on the Sci-Fi channel that usually involve fill in the blank giant creatures eating people are better. I could make a better movie with my cell phone in my basement with my neighbors as the actors. Jeff Fahey was interesting in \"Lost\" but could have phoned this performance in and he was the only one in the movie with a modicum of acting ability. I can't believe I paid $6.99 to watch this mess on pay- per-view. Not one redeeming quality in the whole movie. My husband and I watched in disbelief as it just went from bad to worse. The special effects were not special at all. They were just ridiculous. The girl actor kept falling down and wasn't very good at it. She should not give up her day job of modeling. The other actors were amateurish. Overall, just terrible.",
         "I wasn't expecting much from 100 Degrees Below Zero in the first place. And coming from somebody who's sat through a lot of The Asylum's movies and hated most of them with a few exceptions, I knew what to expect. Why do I keep watching The Asylum's movies if they are so bad?(a question I've come across countless times by those defending any of their movies) Because there is something compulsively watchable and (when they're not insulting your intelligence) entertaining about them. As said I knew what to expect from 100 Degrees Below Zero, but even that didn't stop me from thinking it was terrible. The scenery is quite nice, but because everything looks as though it was constructed in a haste and with no love I found that I couldn't enjoy it. The camera work indicates either inexperience or somebody who doesn't care at all about how the movie looks, while the special effects for the storm look like a very rushed last-minute job. Audibly, the movie is little better if at all, the sound mixing is murky, while the music is generic and sluggish in tempo, adding absolutely nothing to the atmosphere. Clunky is a good way of describing the dialogue though it's also too kind describing it too. It is also silly and awkward, structurally so thin you wonder sometimes whether there is even a script. There is nothing original in the story, I would forgive that if there was anything interesting in the telling of it but the complete lack of fun or thrills as well as the dull pacing indicate otherwise. The way the characters fall is also hilarious, unfortunately for 100 Degrees Below Zero I don't think that was intended. The characters are cardboard and you don't care for a single one of them. There are even some that are introduced but seem to be there for absolutely no reason. The acting is really poor too, Sara Makaul Lane is a slight bright spot but she is a long way from great and her character and dialogue shares much of the blame. Marc McKevitt Ewins is very wooden and bland in the lead role, and if you're going to use talented actors like Jeff Fahey and John Rhys-Davies at least give them something interesting to work with because they came across as wasted here. Overall, terrible, regardless of whether you're familiar with The Asylum or whether you know what to expect or not. 1/10 Bethany Cox",
         "When I saw the name,Asyum,I knew what to expect. To begin with,any film,this company releases,will never be shown in cinema's in Canada, United State,United Kingdom,any euro country,Australia,or New Zealand. This film,was so stupid,that I had trouble watching it. Except for a few of the Paris settings, this film was not worth viewing. The acting was stupid,the photography was bad, do not buy this film. Rest assure,actors,such as Denzel Washington, Morgan Freeman,and Matt Damon,would never appear in a Asyum,film. The salary,these actors,would be paid,would probably,bankrupt,Asyum film company. Any film,this company releases,is cheap.",
         "Yes, it's another typical Asylum film, but we saw plenty of films from the 60s, 70s, and 80s that were much worse. At least it proceeds with some sort of plot and story-line. It's silly, but coherent. You can hear all the dialogue, which is sort of unusual for recent films. There ARE a few things you have to overlook. For one, the bargain basement FX. It's also sort of weird to have virtually no extras, even in the normally crowded streets of Paris. The best way to watch this is to play the drinking game: every time someone falls down, you take a shot. You'll also enjoy hearing every Brit speaking with some unusual accent. Definitely not worth the scorn it receives. See it if only to hear the geese story.",
         "If you are like me and have the attention span of a doughnut, then this should suit you well.. Also, If you like see busty cleavage-ridden babes, acting in a disaster movie, then.. this should suit you well :) It has a cast of well known names, yes hammy acting at times, but it's a good one to stick on in the background. Oh, and, did I mention the women :O Jeff Fahey, is yet again, some kind of ex special forces 'copter pilot, and, that is the funniest thing here. He doesn't seem to be tough enough for it, and, only knows how to twiddle the 'gearstick' on his 'copter', which is why, i'm assuming, he has a beautiful woman in tow! A nice movie to while the time ago, but definitely NOT the worst movie. There are far badder movies out there, this one, at least deserves a 5 or 6 for trying.",
         "All I can do know is laugh. The acting was terrible. They should have been lovers instead of siblings! For all the time they hugged and jumped on each other (1/2 the movie) every time one fell, geese; I was waiting for the kiss. They also made the male son character so WHIMPY!! Like COME ON MAN, GROW SOME BALLS! So subtract the acting, & The theme of the movie was not so bad. But the plot was extremely disappointing. \"The only good thing was that it was suspenseful - whether or not the parents and kids will make it to the Eiffel Towel.\" It had potential but fell flat on its face.",
         "This film rates right up there with the rest of the trash films made. The acting was atrocious, the script was terrible, the special effects (oops! There were none). The director must have been out to lunch while this thing was being made. I especially liked the comment the two kids made during a laughable looking earthquake while they were in Paris where the sister told the brother that the Parisians must have an emergency plan in place for Americans caught in this quake. The only thing I can say about that is probably some Americans really believe that countries have such a plan specifically for Americans. Do yourself a favor and save both your time and money on this one.",
         "Bad directing obviously. I don't mind the bad graphics, but there's lack of respect to other actors in the film. Plus how they claim they need special help because they're Americans? And how they got rid off the helicopter guy who was opening the gate, they just killed him off with a falling ice spear cause he's such a burden. It's laughable. And then while on bicycles the guy is talking about the french girl and that she knew where the tunnel was so they couldn't have left her behind, but I wonder what happened to the old couple who were in the back of the 4x4, did they just let them go? Who cares about the old stinky couple, they can take care of themselves, ya? So ridiculous, don't have them in the movie in the first place if you're not going to show them any respect. Movie only shows the ugly, selfish and corrupt side of humanity nothing more, nothing but trash.",
         "I actually created an account so I could review this movie and give it one star (and quite frankly, I wish I could give it zero.) Full disclosure, I am a little bitter because I didn't check the reviews first, and actually paid (PAID!) for this movie on demand. Woe is me. Within the first thirty seconds, I wondered if somehow I'd hit the wrong button and clicked on some high school students' class project (although had I done so, I suspect the quality would have been better.) I really can't add to the other reviews, but suffice it to say that everyone is right - the acting is worse than amateur, the editing is pathetic, and I could make better special effects in my back yard. Please don't make the mistake I did. Save your money. Anything you would spend it on would be better than this movie.",
         "The acting was horrible. The special effects sucked. The only good thing about the movie was that Taryn kept getting her coat taken away. Just amazing for how it was -100 degrees and Taryn and Jeff could go the whole movie with basically no coats. In one of the last scenes when they were high on the tower and there were supposedly no people out due to the cold, you could see cars and motorcycles on the road below. Then to finish it off the helicopter crashes going and flips over on its side. No one comes out for several minutes but when the rescuers get there and pry off a panel all five get out with out a scratch on them.",
         "Worst movie ever... how can someone die when crashing at about 20-30 mph? well on this movie not one but 2 people did, then the girl keeps saying on the phone to her mom \"everything is gone\" when it is actually not (you can see all the buildings in the background standing and in perfect shape). Terrible acting and effects, nonsense dialogs, small pieces of ice killing people? seriously?, For an evacuated city there are too many cars and people going by at normal speeds, totally absurd! everything is stupid, not worth wasting time watching this.The guy from \"Lost\" must have been desperate in order to accept this shameful script. Not even a real ending, what is wrong with this director, this is a rip off I want my time back!",
         "After checking the IMDb reviews I decided to watch this, the reviews were so terrible they made me laugh and I figured the film would do the same. I was not wrong, this is the most entertaining piece of crap I have ever watched, nothing makes sense, and the acting is like watching 5 year olds in a school play. The script is ridiculous, people flip between panic with the world literally crumbling around them, to joking and sauntering along like nothing is happening. They are also superhuman, they can survive incredible temperatures in t-shirts, although they do rub their arms every so often and mention how cold it is. Direction is insane, sometimes it seemed like the cameraman was just holding the camera walking backwards shaking it about, it's incredible. The sound production is all over the place, actually I don't think there is any sound production. I would definitely recommend watching this with low expectations and a bottle of wine. I'm giving this 6 stars because I really did enjoy watching in disbelief at how bad it was. But don't get me wrong, this is a terrible film.",
         "This was the worst movie in 2014 , and i think nothing will bring it up. Some of the cuts are made really bad, it's like almost a scene is missing, it's really bad. The conversation between two characters could easily bring you to sleep. It's like they've try to make a movie in their spare time. To bad for the idea,i would love to see a movie about survival at -100 Celsius,with the talent and tech we have in 2014. In conclusion , great movie idea , bad movie script,act and everything else.DO NOT WATCH ,REMEMBER MY WARNING.",
         "DO THEY THINK WE ARE TOTAL IDIOTS???? This is the only thing that comes to my mind. Not only the script is embarrassing and the special effects are practically non-existing... Soon into the film you realize they are in Budapest, not in Paris as they keep saying: you can clearly see not only the 2 major churches (Buda's and Pest's), but even THE PARLIAMENT ALONG THE DANUBE!!!! Not to say of the Hungarian car plates everywhere, even on the small pathetic red FIAT car they get IN THE UK. That one, though, magically has a different plate once they have passed the Euro Tunnel... Shall I write about the girl in short sleeves all through the film, with temperatures supposing to drop well below zero? Or about the \"fur shop\" selling horribly fake furs? It wasn't even funny.",
         "No redeeming value at all. Horrible effects, Soundtrack is probably the same from all Asylum films reused. Some fair actors with poor scripts ... Two things I enjoyed... 1 - The Snow on windshield that looked like Soap flakes in water.... 2 - The Generals story of why he owed Steve (Hero Father)... Canadian Geese brought down plane in war and Steve carried him to the base... LOL ... This film would be great to watch for crazy scenes.. the disappearing Embassy worker that came back to get them..... Driving across grass entering Euro Tunnel.... Massive snow falling but no snow on ground... Cast trapping girl guy can not lift the wooden case loaded with boxes, doesn't remove boxes....... Helicopter Autorotation, blades not moving..... Paris evacuated yet cars can be seen in background even at end on Eiffel tower... While at top of tower, green grass seen in background.... Oh yea the prop-plane at beginning flying at 30,000 feet....... And on and on....",
         "It's so bad it's actually a great film. The plot is a mirror of Day After Tomorrow, just with worse acting and no film continuity. Some great one liners and heartfelt (not) emotion. There was obviously no pre-filming research done by the production team: in the UK we drive on the left, have our steering wheels on the right, and the Channel Tunnel isn't a road link; only rail. They did get the logo right though. Product placement? What was great about this film is the awfulness. It's hysterically funny without being a made as a comedy. It's a disaster movie in every sense of the word. Fantastic. I only didn't give it 10 stars because the sets didn't wobble. That would have been worth the final two stars. John Rhys-Davis gave a star performance as a British Officer whilst wearing an American officer's uniform. Just about sums up this film really...",
         "I spent most of this film, supposedly set in sub zero temperatures, wanting to do up the jackets of every actor in it (assuming they were wearing one at all) - yes it really was THAT bad. In order for us to be entertained there has to be some degree of believability about the film. Third rate special effects (just not acceptable nowadays) do not make for a disaster movie, more a disastrous film. It didn't help that acting of the wife, or maybe her script, were dire. She had less maturity than her teenage daughter. My husband laughed out loud at the effects when ... well I don't want to give the plot away... just in case curiosity gets the better of you. I have seen some films in my time which had awful ratings and enjoyed them...but not this time.",
         "I wasn't expecting much from The Asylum's 100 DEGREES BELOW ZERO, a Z-grade movie rip-off of the Hollywood blockbuster THE DAY AFTER TOMORROW. After all, I hated the original, finding it boring in the extreme, so what could this film do better? The answer is that it's much more entertaining purely because it's so bad. So bad it's good, in fact... The storyline involves a macho pilot (the dependable Jeff Fahey) searching for his offspring, who are lost in Paris during a deadly weather event which threatens a new ice age in Europe. What it all boils down to is a bunch of stock disaster scenarios, some truly horrible CGI effects, and more overacting from the cast than you can shake a stick at. Still, it's far from the worst you'll see (try AGE OF ICE for that). Fahey works hard in his man-on-a-mission role, and underwear model Sara Malakul Lane runs around in a skimpy t-shirt despite the freezing temperatures, allowing the cameraman to ogle her at every opportunity. John Rhys-Davies pops up as a gruff military type, although he has a heart in this one at least. 100 DEGREES BELOW ZERO is perfect for fans of bad-but-funny movies and it's one of those ones that demands being watched with a glass of alcohol in hand. My favourite scene is when the kids in Paris hook up with their pop on the phone and tell him \"there's nothing left\" after an earthquake. This is accompanied with their faces screwed up into expressions of unbelievable horror. And yet, in the background, all the buildings are intact and you can see pedestrians and traffic going by normally. A great goof in a film full of them.",
         "So yeah this made for TV \"B\" movie follows an American (played by 'Lost' alumni -Jeff Fahey) and his wife, who become stuck in England when disaster strikes and spend most of the movie trying to cross the channel (tunnel) to get to their two (loser) teenage children who are equally trapped in Paris -and quite frankly a little too \"touchy-feely\" for brother and sister. Anyways, the premise is that a massive volcanic eruption has ripped through Europe, bringing with it enormous ash clouds that block out the sun, thus plunging the continent into a new ice age. I am a total sucker for the \"B\" grade disaster movies but this was pushing it with just how much a viewing public will put up with. Bad, bad acting and dialogue (especially on the part of the teenage kids) and super cheesy special effects. I will say that it was at least unique in that it took place in Paris with the premise of evacuating humanity to Australia. 05.13",
         "If you like to laugh at cheesy disaster movies, and you have to ability to suspend disbelief, then this film is for you. If you think this is going to be a good film like day after tomorrow, think again! And all the people out there complaining about the film's setting being wrong, or whatever, don't listen to them, they obviously thought this movie was some big-budget film or something! Ha! It's good that they are not a big film, because they totally ripped off my favourite music from the new Doctor Who that they play whenever he is in a tense situation. So I sat back, enjoyed the cheese, the bad acting and the even worse stunts, (SPOILER-laugh at the helicopter rescue scene and the actors obviously jumping into the helicopter rather than sliding and falling in!) and the music, which was probably the best part of the movie!"
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Asylum, The",
         "Institution, The",
         "Next Station Productions"
      ],
      "summaries": ["When a chain of volcanic eruptions rips through Europe, the enormous ash cloud blocks out the sun, plunging the continent into a new ice age. An American couple must find their kids and get them out of Paris before it freezes over."],
      "budget": 0
   },
   "movielensId": 133289,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2013-03-29",
      "dvdReleaseDate": null,
      "directors": ["R.D. Braunstein"],
      "runtime": 88,
      "movieId": 133289,
      "title": "100 Degrees Below Zero",
      "mpaa": "NR",
      "actors": [
         "John Rhys-Davies",
         "Jeff Fahey",
         "Marc McKevitt Ewins",
         "Judit Fekete",
         "Andray Johnson",
         "Sara Malakul Lane",
         "Jane Doole",
         "Iván Kamarás",
         "Luke Healy",
         "Jordan James Smith",
         "Tamás Lengyel",
         "Fru Roszil"
      ],
      "imdbMovieId": "2538128",
      "originalTitle": "100 Degrees Below Zero",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["EXvij4An2OM"],
      "plotSummary": "After freak climate and weather events destroy the world around them, a group of rogue scientists attempt to reverse the deadly new ice age.",
      "tmdbMovieId": 182228,
      "avgRating": 2.375,
      "releaseYear": "2013",
      "numRatings": 4,
      "posterPath": "/98xEqfsOHvTyKqh7Hb4a5USmEPz.jpg"
   }
}