{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "exploitation",
            "id": 2804
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "incest",
            "id": 33841
         },
         {
            "name": "voyeurism",
            "id": 178649
         }
      ],
      "imdb_id": "tt0064590",
      "video": false,
      "title": "Linda and Abilene",
      "recommendations": [],
      "backdrop_path": "/xrrahuTKPUIqXu3QeCnUeElsnBC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Abilene",
               "gender": 0,
               "credit_id": "52fe4be89251416c910e9619",
               "name": "Sharon Matt",
               "profile_path": null,
               "id": 1141828,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Tod",
               "gender": 0,
               "credit_id": "52fe4be89251416c910e961d",
               "name": "Kip Marsh",
               "profile_path": null,
               "id": 1141830,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Linda",
               "gender": 1,
               "credit_id": "58300edac3a3685b96009614",
               "name": "Bambi Allen",
               "profile_path": "/r7t7mXyj0e5pyBZ246RjjAKICGh.jpg",
               "id": 103787,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rawhide",
               "gender": 0,
               "credit_id": "58300ee9c3a3685b9a00a86f",
               "name": "Larry Martinelli",
               "profile_path": null,
               "id": 1112210,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Bartender",
               "gender": 0,
               "credit_id": "5a25809e0e0a264cca0dab10",
               "name": "William Varris",
               "profile_path": null,
               "id": 1934997,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Preacher",
               "gender": 0,
               "credit_id": "5a2580aac3a3680b880e0146",
               "name": "Herbert Townsend",
               "profile_path": null,
               "id": 1934998,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Cowboy",
               "gender": 0,
               "credit_id": "5a2580b6c3a3680b9d0d29c2",
               "name": "Bob Dorn",
               "profile_path": null,
               "id": 1934999,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4be89251416c910e9615",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58e55dc592514127e8033d4e",
               "name": "Allison Louise Downe",
               "profile_path": null,
               "id": 99920,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58e55dcdc3a3687326030890",
               "name": "Thomas J. Dowd",
               "profile_path": null,
               "id": 1443781,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "58e55dde92514127f603243d",
               "name": "Herschell Gordon Lewis",
               "profile_path": "/ytxTXGOyeksGML0s99XSnLp5FZk.jpg",
               "id": 99916,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58e55df1c3a36872ee033c3f",
               "name": "Bethel Buckalew",
               "profile_path": null,
               "id": 253245,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5a2580cec3a3680b8d0dc3ca",
               "name": "Larry Wellington",
               "profile_path": null,
               "id": 1500798,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a2580f592514103330d9c43",
               "name": "Alex Ameri",
               "profile_path": null,
               "id": 1420932,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a25810992514103300d7615",
               "name": "Helene Robbins",
               "profile_path": null,
               "id": 1935003,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 0.718747,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 158443,
      "vote_count": 6,
      "budget": 0,
      "overview": "In the 19th century, siblings Abilene and Tod, orphaned on their western farm, become attracted to each other, sexually. The confused Tod fleas to a nearby town where he meets Linda, a local bar girl, and begins a sexual relationship with her, while a rough cowboy, named Rawhide, sexually assaults Abilene leading Tod wanting revenge despite Linda's wariness and growing compassion for Abilene.",
      "similar": [
         74997,
         281957,
         979,
         3134,
         9093,
         281,
         395834,
         263472,
         445954,
         226,
         45233,
         133805,
         527,
         34462,
         1024,
         994,
         9769,
         238636,
         357096,
         2149
      ],
      "original_title": "Linda and Abilene",
      "runtime": 94,
      "poster_path": "/pndBaKepu12vaQ8uG6rNvx9fvRI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "United Pictures Organization",
         "id": 19532,
         "origin_country": ""
      }],
      "release_date": "1969-09-01",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "No woman could escape having her body used in the raw and Wild West of 1869!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 91,
      "synopsis": "California, 1869. Abilene Carter and her older brother Todd, are suddenly orphaned on their western farm. After their parents funeral, they begin to work to take care of the family farm on their own. Abilene has a particularly hard time with the loss, visiting her parents lonely grave sites every day. On one summer day, when Abilene decides to go skinny dipping in a pretty sparse creek in a wooded area, Todd wonders along and finds himself mesmerized by the sight of his nude sister bathing. Over the next few days, an unusual cat and mouse game of incest begins as brother and sister flirt with each other and grow closer. In sexual frustration, Abilene shows off her nudable body to Todd, and both of them turn to auto-eroticism as the outlet for their passions. One night, Abilene, frightened by thunder from a storm, cries out. Todd rushes into her bedroom to see if anything is wrong and caresses his trembling sister. The caresses become more passionate and it leads to sex. As the days go by, both Todd and Abilene begin to neglect their farm chores to pursue their passions for each other. Todd eventually realizes that what they are doing is wrong and he rides into a nearby town to console himself with liquor. In a nearby saloon, Todd confides his story to Linda, the floozy bar girl. (Note: Linda was first glimpsed during the opening credits being ravished by by the town ruffian Rawhide.) Rawhide overhears Todd's story and rides out to the farm. He breaks into the homestead where he rapes the defenseless Abilene. While at the same time back in town, Todd his having sex with Linda in her room. Todd returns home to the farm the next day and finds that Abilene has been raped. Todd rides back into town to find and kill Rawhide. Meanwhile, Linda goes to the farm to look for Todd and she finds a bruised and traumatized Abilene there instead and attempts to comfort her. Soon, both Linda and Abilene find a mutual sex attraction between the two of them and they both make love with each other. Todd arrives in town and challenges Rawhide to a gun duel, which evolves into a gunfight in which both men kill each other in the street outside the saloon. The final scene shows Abilene and Linda attending Todd's funeral who is buried next to his and Abilene's parents. Now all by themselves, Linda and Abilene, a committed couple, ride away in the family wagon for home to maintain the farm all by themselves.",
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0064590/",
      "coverLink": null,
      "actors": [
         "Sharon Matt",
         "Kip Marsh",
         "Bambi Allen"
      ],
      "reviews": [
         "Linda and Abilene (1969) * 1/2 (out of 4) After the death of their parents, brother and sister Todd (Kip Marsh) and Abilene (Sharon Matt) begin to have sexual feelings for one another. After about 39-minutes running time they two find themselves in bed, on the farm, in the creek and various other places as their sexual desires are finally fulfilled. The only problem is that Todd goes to town one day leaving his sister behind and when she's raped the big brother goes for revenge. Herschell Gordon Lewis directed this softcore Western and it's a pretty forgettable affair outside the subject matter, a rather hot lesbian scene and a bit of history it has. This film was shot on the Spahn Ranch right around the same time as all the Manson stuff so people might be interested in seeing what the ranch looked like back then. These locations actually give the film an authentic Western look, which is certainly one of the better things in the picture. As the title gives away, Abilene eventually finds more sex through a relationship with Linda and this sequence here is certainly the highlight of the picture. Performances are pretty much what you'd expect from a film like this but Matt is cute enough to help carry the film up to a point. It is rather funny to see her struggle trying to get out of all those old-fashioned dresses. There are a couple times where it appears she's having trouble getting them off! What really keeps this movie from being better is its incredibly slow pacing, which just keeps the film dragging on and on. At 93-minutes the film really could have been cut down by a good fifteen-minutes and especially since so much time is just leading up to the brother and sister finally getting it on.",
         "In the 19th century, siblings Abilene and Tod, orphaned on their western farm, become attracted to each other, sexually. The confused Tod fleas to a nearby town where he meets Linda, a local bar girl, and begins a sexual relationship with her, while a rough cowboy, named Rawhide, sexually assaults Abilene. This odd little movie was filmed at the Spahn Movie Ranch and stars the Manson family associate, Bill Vance. This makes it memorable, as does the directing of H. G. Lewis. Now, had anyone else shot it, this would be completely disposable, smutty fluff. But Lewis fans will want to see what other projects the \"godfather of gore\" was involved in. As for Spahn Ranch, that is a whole other story entirely.",
         "The 19th century. Todd (the passable and likable Kip Marsh) and Abilene (a decent portrayal by the lovely Sharon Matt) are two orphans growing up together on a farm who become sexually attracted to each other. Feeling guilty about his forbidden desires for Abilene, Todd runs away from home and falls for local barroom tramp Linda (a charming turn by buxom and fetching brunette Bambi Allen). After rough'n'scruffy cowboy Rawhide (a perfectly despicable Larry Martinelli) rapes Abilene, Todd vows to get revenge. Despite the abundant tasty female nudity -- Matt in particular has a very nice slim body -- and such spot-on sleazy subject matter as incest, rape, voyeurism, and lesbianism, this film nonetheless proves to be a real chore to sit through due to the flat direction by legendary goremeister Herschell Gordon Lewis, sluggish pacing, a meandering narrative, and a 93 minute time running that that feels extremely drawn out and padded. Moreover, the sex scenes are rather tame and tepid, with Todd even keeping his pants on (!) while doing the deed with Abilene for the first time. On the plus side, the production values are acceptable, the location shooting at the notorious Spahn Ranch adds a sense of gritty authenticity, and the surprise bummer ending packs a startling punch. The static, but attractive cinematography by Lewis makes neat use of vibrant color. Larry Wellington's score boasts a few hilariously inappropriate jazz music cues. An okay diversion.",
         "This flick was supposed to be lost until early 2013 when it was discovered together with two other sexploitations made by Herschell Gordon Lewis. He used a synonym to direct and produce those flicks but finally they are out for the geeks of the genre, they are even out on Blu Ray. Were as Ecstasies Of Women from the same year was entertaining this was rather a slow moving flick. And the acting was rather laughable and stiff. The story itself is about a brother Todd (Kip Marsch) and his sister Abilene (Sharon Matt) living orphaned on a farm. When Abilene goes for a walk and come across some water she undresses and enjoys the water but her brother is peeping tom and start to get feelings for her. Abilene is aware of him looking and is also getting feelings for him and one evening when she's naked she screams and Todd enters. From there on they have love. But after a while Todd wants to get to know other women, and so he's off to a bar were Linda (Bambi Allen) seduces him and they have sex after a while. Funny to see how hard it was for Bambi to get undressed. The next day Linda goes to the farm to have sex with Todd but she comes across Abilene just being raped. You could see it coming miles away, a lesbian sex scene. I was searching for Lewis lost flicks and especially this one for only one reason. It was shot at the Spahn Ranch, just in the period that Charles Manson was hiring the ranch to commit his Tate-Labianca murders on August 9th and 10th, 1969. In 1970 the ranch was destroyed by a fire. A rather tame sexploitation and really boring acting especially in the beginning. And it also contains a lot of flew shots and bad sound (the hsoot out at the end)There's nudity to spot of course here and there but i found Ecstasies better. But this is notorious due the Spahn ranch fact. And have a close look at the close-up of Bambi's breasts, it's clear to see that they were fake. Gore 0/5 Nudity 2,5/5 Effects 0/5 Story 1/5 Comedy 0/5"
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": ["United Pictures Organization"],
      "summaries": ["In the 19th century, siblings Abilene and Tod, orphaned on their western farm, become attracted to each other, sexually. The confused Tod fleas to a nearby town where he meets Linda, a local bar girl, and begins a sexual relationship with her, while a rough cowboy, named Rawhide, sexually assaults Abilene leading Tod wanting revenge despite Linda's wariness and growing compassion for Abilene."],
      "budget": 0
   },
   "movielensId": 133327,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1969-09-01",
      "dvdReleaseDate": null,
      "directors": ["Herschell Gordon Lewis"],
      "runtime": 94,
      "movieId": 133327,
      "title": "Linda and Abilene",
      "mpaa": "",
      "actors": [
         "Sharon Matt",
         "Kip Marsh",
         "Bambi Allen",
         "Larry Martinelli",
         "William Varris",
         "Herbert Townsend",
         "Bob Dorn"
      ],
      "imdbMovieId": "0064590",
      "originalTitle": "Linda and Abilene",
      "genres": [
         "Drama",
         "Western"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In the 19th century, siblings Abilene and Tod, orphaned on their western farm, become attracted to each other, sexually. The confused Tod fleas to a nearby town where he meets Linda, a local bar girl, and begins a sexual relationship with her, while a rough cowboy, named Rawhide, sexually assaults Abilene leading Tod wanting revenge despite Linda's wariness and growing compassion for Abilene.",
      "tmdbMovieId": 158443,
      "avgRating": 2,
      "releaseYear": "1969",
      "numRatings": 3,
      "posterPath": "/pndBaKepu12vaQ8uG6rNvx9fvRI.jpg"
   }
}