{
   "tmdb": {
      "original_language": "de",
      "keywords": [{
         "name": "biography",
         "id": 5565
      }],
      "imdb_id": "tt0113151",
      "video": false,
      "title": "A Trick of the Light",
      "recommendations": [
         237957,
         134220,
         203226,
         202768,
         194602,
         147306,
         76388,
         88302,
         269969,
         49479,
         104317,
         148118,
         147312,
         104343,
         227289,
         148050,
         147159,
         148068,
         42206,
         42238
      ],
      "backdrop_path": "/ema19OETJv5qKgQbyvblBR1Am7n.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Acrobat",
               "gender": 0,
               "credit_id": "52fe47bac3a36847f814500d",
               "name": "Daniele Drobny",
               "profile_path": null,
               "id": 16710,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe47bac3a36847f8145011",
               "name": "Florian Gallenberger",
               "profile_path": null,
               "id": 46680,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe47bac3a36847f8145015",
               "name": "Jürgen Jürges",
               "profile_path": null,
               "id": 5639,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Max Skladanowsky",
               "gender": 2,
               "credit_id": "52fe47bac3a36847f8145019",
               "name": "Udo Kier",
               "profile_path": "/sTNpaKOBNi7WUJw7jPDrsbGAL4O.jpg",
               "id": 1646,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Emil Skladanowsky",
               "gender": 2,
               "credit_id": "575bad5292514101fe0004f4",
               "name": "Otto Kuhnle",
               "profile_path": "/42IsNcsmjPWQ383rOygyvXxplJt.jpg",
               "id": 1633689,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47bac3a36847f8145003",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47bac3a36847f8145009",
               "name": "Sebastian Andrae",
               "profile_path": null,
               "id": 48342,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5983374dc3a368333d010098",
               "name": "Henrick Heckmann",
               "profile_path": null,
               "id": 1863147,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "598337539251413d0e010b42",
               "name": "Veit Helmer",
               "profile_path": null,
               "id": 52542,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5983375b9251414212010b7a",
               "name": "German Kral",
               "profile_path": null,
               "id": 1027729,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "598337639251413d0e010b5a",
               "name": "Barbara Rohm",
               "profile_path": null,
               "id": 1863148,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5983376cc3a368344901059f",
               "name": "Alina Teodorescu",
               "profile_path": null,
               "id": 1338453,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "598337749251414330010988",
               "name": "Wim Wenders",
               "profile_path": "/ruRe7v4OaDE0zG6PLbwHDomhVLq.jpg",
               "id": 2303,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.497777,
      "production_countries": [{
         "iso_3166_1": "DE",
         "name": "Germany"
      }],
      "id": 50106,
      "vote_count": 5,
      "budget": 0,
      "overview": "A rare gem of cinematic storytelling that weaves docudrama, fictional reenactment, and experimental photography into a powerful, reflective work on the early days of German cinema. The film tells the story of the Skladanowsky Brothers, the German-born duo responsible for inventing the \"bioskop\", an early version of the film projector.",
      "similar": [
         45317,
         323677,
         319888,
         11202,
         1578,
         10637,
         227306,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         396371,
         369192,
         43959
      ],
      "original_title": "Die Gebrüder Skladanowsky",
      "runtime": 79,
      "poster_path": "/z42JhYJLlNa1DHHpxatDvDO4y1d.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Wim Wenders Stiftung",
            "id": 36229,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bayerischer Rundfunk (BR)",
            "id": 7333,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bundesministerium des Inneren (BMI)",
            "id": 68956,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hochschule für Fernsehen und Film München (HFF)",
            "id": 19677,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Veit Helmer Filmproduktion",
            "id": 38018,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Wim Wenders Productions",
            "id": 27992,
            "origin_country": ""
         }
      ],
      "release_date": "1995-11-28",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Wim Wenders"],
      "runtime": 79,
      "synopsis": null,
      "writers": [
         "Sebastian Andrae",
         "Henrick Heckmann"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0113151/",
      "coverLink": null,
      "actors": [
         "Stefan Barber",
         "Wiebke Bayer",
         "Nadine Büttner"
      ],
      "reviews": [
         "This biopic of the Skladanowsky brothers, who were some of the first to invent cinema, began as a project for Wim Wenders's students and evolved into a feature-length film released during the centennial of the cinema's invention. Also for 1995, Wenders was one of the filmmakers who paid homage to the Lumière brothers by making their own 50-or-so-seconds-long films for \"Lumière et compagnie\". The Skladanowsky brothers' Bioskop film projector premièred on 1 November 1895--nearly two months before the Lumière brothers' first program. It should also be noted, however, (and it's not in this film) that a few other inventors have earlier claims than do even the Skladanowsky brothers. To count projected drawn animation or the projection of films to non-paying audiences would add a few more names. Regardless, they were among the firsts, and this film, \"A Trick of Light\", is a fun little tribute to their invention. Wenders interweaves various forms of narration and film technique to tell the story. First, there are fictional scenes (and not entirely historically accurate) of the brothers and one of their daughters working on the Bioskop and their films, which they eventually show to a paying audience. This part is photographed with a silent era hand-cranked camera and two characters provide voice-over narration at different times. Second, there is a documentary interview with 95-year-old Lucie Skladanowsky, daughter of the late Max Skladanowsky. Fictional elements are further interweaved with the interview, including via trick photography. The little girl from the previous fictional episode, for example, enters the interview undetected, as does the spy who was trying to steal the Skladanowsky's invention. All of this makes for an uneven picture. That Wenders and his students made the film over three or so years probably didn't help the film's consistency, either. Nevertheless, it's an entertaining and sometimes interesting (although not too enlightening due to taking liberties with historical facts and the mixing of fiction with nonfiction) look at one largely forgotten group of cinema's inventors and their system of projection. Reenactments of the films are even shown. Yet, one wonders if they had shown what's left of the Skladanowsky brothers original films, or if Wenders hadn't taken as many liberties with history overall, or if the interview were not interrupted by fiction, \"A Trick of Light\" may have been better. Still, not many have given this part of film history any attention, so this was a unique project and worth watching.",
         "Wenders amuses himself, and in the way reflects about some general principles of cinema as an art. Several times he has made interesting films that are themselves cinematic objects and reflections on the nature of the cinematic object. His primary concern is the images. Whenever he deepens the complexity of his narratives, he is aiming at highlighting images. Those are the cases of the very recent Palermo Shooting and the remarkable American Friend: images which illustrate a story about images. When he takes out that intelligent narrative, directly sensitive to the medium, we are left with meditations purely based on images. Sometimes they work, sometimes they drag. Here it half-works, because the project, intentionally, lacks a bigger form other than that of the interview the old Skladanowsky gives. All the black and white bits are built as episodes and inside those episodes we find other episodes (the original Skladanowsky films). Apparently this started as an academic project, so that would explain the lack of a bigger form, as well as the inaptness of some short bits. That does not explain the almost unbearable ending. But something interested me here. Wenders picks on something left behind almost at the beginning of cinema. Images as abstract motion pictures, detached of narrative. That's something i think is worth some time exploring, and obviously so did Wenders. So, among all the old remakes of the pioneering films, i was interested in the dance bit. Curiously enough, it is the bit which gets more attention even in the child story of the black and white flashbacks. It is the film that has to be remade. The clothing of the dancers help the effect. It's remarkable, how it works in the eye. I've been spending time watching experiences like that. Besides that, there's little else to see here. And i found totally misused the contrast between black and white footage and the color bits of the interview, which had an uncomfortable video look which put me off. The b&w was already grainy and looked old, they didn't need to look for such a contrast to make the point. My opinion: 3/5 http://www.7eyes.wordpress.com",
         "\"Die Gebrüder Skladanowsky\" or \"A Trick of the Light\" is a German(-language) film from 1995, so this one had its 20th anniversary last year. The director is Wim Wenders and he is also one of the many writers who worked on this project. The focus here is on the Skladanowsky brothers. Most people with a big interest in the early days of filmmaking, the very early days of movies that ran for under a minute, were silent and in black-and-white and were made at the end of the 19th century over 120 years ago, may have come across Méliès and Lumière, maybe even Segundo de Chomón. But hardly anybody remembers the Skladanowsky brothers Max and Emil. It is very telling that for one of them not even the date of death is known. They certainly weren't as prolific as the ones I already mentioned and their technological approach also wasn't that refined, but they were there with the rest of really early filmmakers and that counts. If you want to see their most known work, check out \"Wintergartenprogramm\". It combines their most known very short films in one still fairly short film. But back to this Wim Wenders work here. I must say it is a really creative outcome overall and there were moments when I was tempted to give it an even higher rating. The re-enacted old scenes (with Udo Kier and Otto Kuhnle playing the title characters and Rolf Zacher narrating) were as interesting as the interview scenes with one of the brothers' daughter who gives first-hand information about the Skladanowskys. She was also over 90 already when this was made. The film is pretty short, the credits roll in at the 1-hour mark already, but another 15 minutes follow. Overall, this film is another really creative achievement by Wim Wenders that most filmmakers can only dream of making. It is a solid tribute to a time long gone and a pair of filmmakers long forgotten and if it brings back some attention to them, then making this movie was worth it alone for that reason. I also think it is pretty easily accessible. I myself have no interest in physical technology when it comes to filmmaking, but Wenders kept it all very basic in terms of that. Now you have read enough and it is time to watch the film if you haven't already. You really don't want to miss out here."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Bayerischer Rundfunk (BR)",
         "Bundesministerium des Inneren (BMI)",
         "Hochschule für Fernsehen und Film München (HFF)"
      ],
      "summaries": ["A rare gem of cinematic storytelling that weaves docudrama, fictional reenactment, and experimental photography into a powerful, reflective work on the early days of German cinema. The film tells the story of the Skladanowsky Brothers, the German-born duo responsible for inventing the \"bioskop\", an early version of the film projector."],
      "budget": 0
   },
   "movielensId": 133351,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1995-11-28",
      "dvdReleaseDate": null,
      "directors": ["Wim Wenders"],
      "runtime": 79,
      "movieId": 133351,
      "title": "A Trick of the Light",
      "mpaa": null,
      "actors": [
         "Daniele Drobny",
         "Florian Gallenberger",
         "Jürgen Jürges",
         "Udo Kier",
         "Otto Kuhnle"
      ],
      "imdbMovieId": "0113151",
      "originalTitle": "Die Gebrüder Skladanowsky",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A rare gem of cinematic storytelling that weaves docudrama, fictional reenactment, and experimental photography into a powerful, reflective work on the early days of German cinema. The film tells the story of the Skladanowsky Brothers, the German-born duo responsible for inventing the \"bioskop\", an early version of the film projector.",
      "tmdbMovieId": 50106,
      "avgRating": 2,
      "releaseYear": "1995",
      "numRatings": 1,
      "posterPath": "/z42JhYJLlNa1DHHpxatDvDO4y1d.jpg"
   }
}