{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "bachelor",
            "id": 1338
         },
         {
            "name": "flat",
            "id": 1439
         },
         {
            "name": "gadget",
            "id": 1683
         },
         {
            "name": "flower",
            "id": 2382
         },
         {
            "name": "pet shop",
            "id": 2589
         },
         {
            "name": "wine",
            "id": 6563
         },
         {
            "name": "secret love",
            "id": 7879
         },
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "gardener",
            "id": 33608
         },
         {
            "name": "garden shears",
            "id": 157398
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "tortoise",
            "id": 188460
         },
         {
            "name": "innuendo",
            "id": 204950
         },
         {
            "name": "dinner date",
            "id": 208467
         },
         {
            "name": "anagram",
            "id": 222081
         }
      ],
      "imdb_id": "tt3205394",
      "video": false,
      "title": "Roald Dahl's Esio Trot",
      "recommendations": [
         314034,
         313654,
         74641,
         35901,
         221488,
         52032,
         109936,
         40578,
         169310,
         57866,
         375154,
         56578,
         277846,
         262340,
         140090,
         65596
      ],
      "backdrop_path": "/iucckhzSCUCyQjg4hp1hiY0G9ma.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "549dce0192514131290069be",
               "name": "James Corden",
               "profile_path": "/xGB0gfZ48M27gQjjL7inJIh1Pqj.jpg",
               "id": 55466,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mr. Hoppy",
               "gender": 2,
               "credit_id": "549dce12c3a3680b27005608",
               "name": "Dustin Hoffman",
               "profile_path": "/3pZx8NB30KIw31rBAT62TUDQFEb.jpg",
               "id": 4483,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mrs. Silver",
               "gender": 1,
               "credit_id": "549dce259251413132006458",
               "name": "Judi Dench",
               "profile_path": "/2is9RvJ3BQAku2EtCmyk5EZoxzT.jpg",
               "id": 5309,
               "order": 2
            },
            {
               "cast_id": 24,
               "character": "Mr Mavrokoukoudopolous",
               "gender": 0,
               "credit_id": "589b9490c3a3687e5100058a",
               "name": "Salo Gardner",
               "profile_path": "/dEDmkjjpqaNcadl2vVwO6osg8Yv.jpg",
               "id": 1271074,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Puppy Boy Mother",
               "gender": 0,
               "credit_id": "549dce409251413123006469",
               "name": "Lara Rossi",
               "profile_path": "/qpTMRQ2Dphny1MM5XbcYRZzozRH.jpg",
               "id": 1404497,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Keen Petshop Keeper",
               "gender": 2,
               "credit_id": "549dce58c3a3682f230067b2",
               "name": "Jimmy Akingbola",
               "profile_path": "/mFD6PHCf9UK6vi2r7Pt0IXyI8gV.jpg",
               "id": 175690,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Philip's Mother",
               "gender": 1,
               "credit_id": "549dce9e92514131290069d1",
               "name": "Katie Lyons",
               "profile_path": "/bjBlcNH0VWf9MKkY5zaqXrXY63n.jpg",
               "id": 77266,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Roberta",
               "gender": 1,
               "credit_id": "549dcead925141312f006c79",
               "name": "Pixie Davies",
               "profile_path": "/h7a55vLzl1FUBtguBdF6V7QFy7G.jpg",
               "id": 1181403,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mr. Pringle",
               "gender": 2,
               "credit_id": "549dcec0925141312f006c7d",
               "name": "Richard Cordery",
               "profile_path": "/oVjjWKIgbsMUoc0Q0tuXI9U72LO.jpg",
               "id": 156356,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mrs. Wu",
               "gender": 0,
               "credit_id": "549dcee3c3a3682f1b006552",
               "name": "Pik-Sen Lim",
               "profile_path": "/9OtroXdMaTZxo89h1BOS1MavdTk.jpg",
               "id": 1228239,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Woman Passenger",
               "gender": 0,
               "credit_id": "549dcef6c3a3685542003147",
               "name": "Polly Kemp",
               "profile_path": "/wdU5MYqzoZN4XooWUcTW70zRzrq.jpg",
               "id": 210169,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Rollerblading Couple",
               "gender": 2,
               "credit_id": "549dcf2dc3a3682f1600654e",
               "name": "Alexander Bracq",
               "profile_path": "/eauqxswgkefFEr6aDdK8LNLQ5Ez.jpg",
               "id": 234621,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Phillip",
               "gender": 0,
               "credit_id": "549dcf41c3a3682f1b006564",
               "name": "Joseph West",
               "profile_path": null,
               "id": 1278524,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Man in Park",
               "gender": 0,
               "credit_id": "549dcf53c3a368764f002437",
               "name": "James Thomas Scott",
               "profile_path": null,
               "id": 1404500,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Mrs. Court",
               "gender": 0,
               "credit_id": "549dcf83925141312300648a",
               "name": "Anna Cannings",
               "profile_path": null,
               "id": 1404504,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Mrs Desmond",
               "gender": 1,
               "credit_id": "589b934992514167650004d2",
               "name": "Lisa Hammond",
               "profile_path": "/ejNsOc3MXwlcL40Tm4Jut7S3s0B.jpg",
               "id": 1753731,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Little Girl",
               "gender": 0,
               "credit_id": "549dcf62c3a3682f230067d5",
               "name": "Emily Ralph",
               "profile_path": null,
               "id": 1404501,
               "order": 16
            },
            {
               "cast_id": 11,
               "character": "Shop Keeper",
               "gender": 2,
               "credit_id": "549dced2c3a3682f1b00654e",
               "name": "Geoffrey McGivern",
               "profile_path": "/mf897koc8DDwLsbM4qMX9FMBcYn.jpg",
               "id": 62970,
               "order": 17
            },
            {
               "cast_id": 15,
               "character": "Boy In Pet Shop",
               "gender": 0,
               "credit_id": "549dcf1bc3a368554200314e",
               "name": "Aaran Mitra",
               "profile_path": "/7Xvv0dmZrsVnF9DD8Zfm6JcA746.jpg",
               "id": 1404499,
               "order": 18
            },
            {
               "cast_id": 20,
               "character": "Puppy Boy",
               "gender": 0,
               "credit_id": "549dcf74c3a3680b27005635",
               "name": "Leo Umeh",
               "profile_path": "/3DsU8lZB4r94WGSu77GaM5xrsI0.jpg",
               "id": 1404503,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "549dcdbb9251414d27001d32",
               "name": "Dearbhla Walsh",
               "profile_path": null,
               "id": 1227885,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "549dcdcfc3a3682f1b00652e",
               "name": "Richard Curtis",
               "profile_path": "/uLjkovqtUtM4SckCFtrevZKKJNM.jpg",
               "id": 7018,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "549dcdeb925141313200644b",
               "name": "Paul Mayhew-Archer",
               "profile_path": null,
               "id": 1228706,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55ce03adc3a3681bf0001cd3",
               "name": "Roald Dahl",
               "profile_path": "/me3PtcT5mw88y3e3AYG3exuOO99.jpg",
               "id": 1299,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.902476,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 313867,
      "vote_count": 48,
      "budget": 0,
      "overview": "Mr. Hoppy is a shy old man who lives alone in an apartment building. For many years, he has been secretly in love with Mrs. Silver, a woman who lives below him.  Mr. Hoppy frequently leans over his balcony and exchanges polite conversation with Mrs. Silver, but he is too shy to disclose how he feels.  Mr. Hoppy longs to express his feelings to Mrs. Silver, but he can never bring his lips to form the words.  Mrs. Silver has a small pet tortoise, Alfie, whom she loves very much.  One morning, Mrs. Silver mentions to Mr. Hoppy that even though she has had Alfie for many years, her pet has only grown a tiny bit and has gained only 3 ounces in weight.  She confesses that she wishes she knew of some way to make her little Alfie grown into a larger, more dignified tortoise.  Mr. Hoppy suddenly thinks of a way to give Mrs. Silver her wish and win her affection.",
      "similar": [
         118,
         112160,
         634,
         245,
         10735,
         2288,
         1581,
         10555,
         858,
         13,
         51828,
         296096,
         118289,
         216015,
         437557,
         122906,
         433,
         43923,
         20,
         455
      ],
      "original_title": "Roald Dahl's Esio Trot",
      "runtime": 87,
      "poster_path": "/jubNEvsL40rY1xPO3uOIFLbXXS3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Endor Productions",
            "id": 12575,
            "origin_country": ""
         },
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         }
      ],
      "release_date": "2015-01-02",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "A retired bachelor has a thing for his neighbor who only shows affection to her pet tortoise.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Dearbhla Walsh"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Richard Curtis",
         "Paul Mayhew-Archer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3205394/",
      "coverLink": null,
      "actors": [
         "James Corden",
         "Salo Gardner",
         "Dustin Hoffman"
      ],
      "reviews": [
         "Mr Hoppy, a shy, ageing American plant lover, lives in the flat above Mrs Silver, a rather ebullient retired midwife who buys a tortoise for company. Mr Hoppy falls in love with her but, crippled with shyness, develops a plan to win her heart by substituting ever-larger tortoises to satisfy her worries about the original's slow rate of growth. This rather daft and whimsical story by Roald Dahl is adapted into a rather daft and whimsical TV film by Richard Curtis and Paul Mayhew-Archer. There isn't too much here by way of laughing out loud (Judi Dench has one short but hysterical piece of dialogue towards the end), but there is a lot of smiling and a fair amount of chuckling. And there are two delightful and touching performances from Dustin Hoffman and Judi Dench as the tortoise-linked couple, both of whom deliver performances of far greater integrity and subtlety than the slightness of the material would suggest.",
         "There is no doubt that Roald Dahl is a true genius, nevertheless there have been cases where movies have not lived up to their original works. There is no doubt that Judi Drench and Dustin Hoffman are huge names and absolutely amazing (to say the least) actors, however there have been plenty of movies with superb actors and great names which turned out less so. This is NOT one of those. The BBC did a great job to put a marvellous story into this magnificent movie, for the young and the old alike. Dustin Hoffman does such a sublime job playing Mr. Hoppy that I find it hard to imagine him as anybody else. Quiet, shy, kind Mr. Hoppy made his way into my heart from his first minute (more like seconds actually) on the screen. Judi Drench appears as the love interest of Mr. Hoppy, Mrs. Silver, whom despite not being the brightest bulb in the box was a lovely character. All in all both have given wonderful performances. The writers were, in my opinion, the ones who managed to bring real magic to the movie. Looking for more detail, they turned out to be Richard Curtis, Paul Mayhew-Archer, 'old' names to the admirers of comedy from the BBC. Their tasteful humour is no news to me and they managed to put their light, yet deep, touch to this script. They have managed to insert some of the loveliest jokes, and produced a masterpiece that would bring tears to people's eyes for ages. There is not enough praise I could ever possibly bring to this movie and for it to be enough. I could go on for ages, praise every joke and every scene.",
         "This is a simple sweet tale.Nothing to dislike. The story is cute and inoffensive. The film has been written to pad out the story and it has done so in a sympathetic and appropriate fashion. The thing that makes it so delightful is how Hoffman and Dench make the characters adorable and relatable regardless of the fact that they are unlikely. If you don't like charm, wit and a bit of suspending disbelief, move along. I intend to use this to vet people in the future. If they don't like this movie I won't be going for coffee with them. Relax, turn off your cynicism and wallow in the treacle and charm until your all marshmallow inside. :)",
         "A charming story from one of our great authors of both child and adult fiction. The story of one mans infatuation with his neighbour and the lengths he will go to to win her love. With the always excellent Dustin Hoffman and Judi dench. Even the sometimes annoying James cordon puts in a stellar performance as the on screen narrator. An enjoyable feel good movie that wanes a little,retains all the character of a Dahl novel or short story. This film will enchant you and frustrate you feeling melancholic. Suitable for all ages,a must for all Dahl fans and fans of the actors.",
         "This absolute wonderful story of love between two 'older' people will have you spellbound from start to finish. Dustin Hoffman nails perfectly the shy, retiring Mr Hoppy who until his neighbour moves in has only one love his Babylonian balcony garden. Whilst Mrs Silver played by Judi Dench, becomes the new object of his affections the day she moves in to the flat below his, is ideally cast. Mr. Hoppy although he is to shy to tell her how he feels gets the chance to make her dreams come true when he learns she wishes her pet tortoise Alfie, would grow from his very small 13 ounces. To do this he comes up with an ingenious and very daring but funny plan. However their is a complication in the form the very boorish Mr. Pringle who lives in the flat next to Mr. Hoppy he also has his eye on Mrs Silver. If you enjoyed your romances gentle but bitter-sweet with a happy end you will love this. The entire story of their budding romance is humorously narrated by James Corden the man with the first floor flat.",
         "The thing about reviews are that they are merely one persons opinion, the opinion of the person giving the review. This is why so many 'professional' reviewers find that once they give their opinion and if it is a bad review suddenly the movie reviewer finds it is braking box office records, like Frozen, I wonder what they feel. In the case of esio trot I have noted that it appears to be either loved or hated reviewers which reminds me of the old adage.'Beauty is in the eye of the beholder' and in my case esio trot was beautiful. Now on to my review. What an absolutely delightful little tale, even more greatly enhanced by the superb actors, Judi Dench and Dustin Hoffman. Roald Dahl truly surpassed himself with his story Esio trot. SPOILER BEGINS This is a love story about two ageing people Mrs Silver (Judi Dench) and Mr Hoppy (Dustin Hoffman) Mr Hoppy fell in love with Mrs Silver from the first moment he set eyes on her but he was so shy and did not know how he could win her heart. They live in an apartment building where Mr Hoppy can see and speak to Mrs Silver from the balcony above hers. Mrs Silver buys a tortoise (esiotrot) for company who she called Alfie but becomes depressed because Alfie is not growing. Mr Hoppy comes up with a cunning plan which he hopes will win the heart of Mrs Silver. He buys 100 tortoises of varying sizes which he manages to swap over periodically over time with the original Alfie. Each time he swaps one he swaps it with one slightly bigger. Mrs Silver is delighted with the speedy growth of 'her' Alfie and of course does not realise that the tortoises are being changed by Mr Hoppy. Eventually Mr Hoppy asks Mrs Silver to Marry him which does not go as he hoped. I will leave it there and urge you to watch this superb and gentle story to discover how it ends. SPOILER ENDS Judi and Dustin were absolutely superb, as were the supporting actors. The script was also second to none as was the direction. I have no hesitation in giving Esio Trot a 10 rating.",
         "One of the most disappointing experiences of the festive season. The writers have forgotten what it's like to read a Roald Dahl story to children - the comfortable, innocent experience that is an oasis of childhood. This movie, a pimped-up atrocity with formulaic love triangle had nothing to do with the cleverness, innocence, and brilliantly-judged length of Roald Dahl's original story. He knew there is only so much you can do with a great idea - push it too far and it becomes ordinary (at best). Quips that the writers obviously thought were clever, including both literal and backwards 'choice language', just took the experience further and further away from Dahl's genius for innocence. Additions such as a love rival, alienating narration scenes trying to lean on a father's relationship with their daughter to somehow infuse the film with warmth; even a neighbour's child asking \"Are you going to offer me sweets and kidnap me?\"... All have a hand in bursting the perfect bubble that Dahl originally created. Edit - sorry, forgot to mention that the three stars are for Dustin Hoffman. A class act, even in this.",
         "I only know the really obvious works of Roald Dahl, i.e. James and the Giant Peach, Willy Wonka, Fantastic Mr Fox, The BFG, The Witches and Matilda, so when I saw this TV made film was coming to television at Christmas time, and the two cast members in it, I was most looking forward to it, written by Richard Curtis. Basically lonely ageing bachelor Mr. Hoppy (Dustin Hoffman) lives in a London flat, he has two loves in his life, the garden on his balcony, and the widow who lives in the flat below him, Mrs. Silver (Dame Judi Dench), the only time he usually sees her up close or talks to her is going in the elevator, but over the years he has always been too shy to express his feelings for her. Mr. Hoppy tries to tell her sometimes from his balcony, but she is too fond of her new tortoise Archie to respond, and his opposite neighbour Mr. Pringle (About Time's Richard Cordery) is just a massive bore, too focused on talking about himself. But Mr. Hoppy sees an opportunity to make Mrs. Silver happy and show how much he cares, in conversation she tells how she wishes her tortoise would grow bigger, he convinces her that he knows a Bedoiun chant that if she speaks it will make her tortoise grow bigger within a month, she says if that happens she will be eternally grateful to him. Next day Mr. Hoppy hatches a secret plan, he buys dozens of tortoises, he hears Mrs. Silver read the chant he gives her, Esio Trot (\"tortoise\" spelt backwards), with the help of a special fishing rod he creates he swaps Archie for one ever so slightly bigger tortoise, while Mrs. Silver is away, when returns she is overjoyed to see that this chant is working. As the gradual \"growing\" of the tortoise continues, Mr. Hoppy and Mrs. Silver talk much more often from their balconies, Mr. Pringle is the one who helps them get together for dinner, but the neighbours do not have much opportunity to talk while he is being boorish, and worse comes when it looks like Mr. Pringle is trying to win her affections, Mr. Hoppy is almost about to give up his plan, but she continues to be happy with her \"growing\" tortoise, so he continues. It comes to the point when, after a month of the secret swapping, the tortoise in its box has become so big it can no longer fit through the doors of its house, Mrs. Silver is so happy that she invites Mr. Hoppy to come to her flat to celebrate, Mr. Hoppy excited rushes downstairs, and unknowingly leaves his door open for the real tortoise Archie to escape, just as Mr. Hoppy proposes marriage to Mrs. Silver, Mr. Pringle knocks and shows Archie was wandering around, Mr. Hoppy's plan is rumbled. Thinking he no longer can win the heart of Mrs. Silver, Mr. Hoppy returns all the tortoises to the pet shop and sits alone and crushed in his flat, finding two tortoises left behind hiding he gives them to the children of his neighbour, the Narrator (James Corden), telling the whole story to him, he understands and feels for Mr. Hoppy, maybe there will be no happy ending in this story. However, Mrs. Silver knocks on Mr. Hoppy's door, firstly to tell him that she has no interest in Mr. Pringle, he is such a bore, and secondly to tell him that, in fact, she has had feelings for him for the many years that have lived opposite each other, and she answers his earlier proposal question with a \"yes\", a few weeks later they are married and live happily ever after. Also starring Big School's Jimmy Akingbola as Keen Pet Shop Keeper, Psychoville's Lisa Hammond as Mrs. Desmond and Derek's Salo Gardner as Mr. Mavrokoukoudopolous. Hoffman is fantastic being the polite and longing neighbour, Dench is sweet as the woman who loves her tortoise and maybe has affection for her neighbour also, the two are perfectly cast, the way this film is made perfectly encapsulates the feel of Roald Dahl stories that have gone before, the characters are great, the story is simple, funny and sweet, it is just a must see family treat, a fabulous romantic comedy. Very good!",
         "I caught this on television a late Saturday night, deciding to stay up longer than originally planned due to the star power of this movie. Sadly, it was a decision I quickly regretted. The film often feels like a stage play, which in itself may not necessarily be a bad thing, but when it is inter-cut with the sequences of James Cordon narrating whilst commuting from work, it feels cheap rather than as a stylistic choice. When on the matter of James Cordon's supposedly witty narration; narration itself is a tricky thing to pull off, but for the tone of this film, it could possibly have worked if not for the choice to actually show James Cordon telling the story while walking down the street or sitting on the bus. While James Cordon is undoubtedly quite charming, and including him as a character, rather then just a narrator, does have somewhat of a pay off, it still feels like they are trying to stretch out a rather thin script by doing so. It would also help if his material was actually funny, yet instead it all falls flat, making the sidesteps to his character narrating the story feel painfully unnecessary as they fail at both being funny and cute. As for the actual story within Cordon's meta-narration, there is undeniably some charm and cuteness to be found, though not enough. Judi Dench and Dustin Hofmann both give strong performances, though their character are one-sided. All this would have been fine if the jokes had hit better, which they sadly don't as I only one or two times found myself chuckling. It is a shame really as the movie is cute enough to sustain a simple, predictable story and one-sided characters, yet with the humour being way off, the film falls very flat and for the most part is a bore.",
         "Dustin Hoffman plays the silver haired shy American ex-pat Mr Hoppy who lives in an apartment building tending to his garden on his balcony. Judi Dench is the flame haired Mrs Silver, the new neighbour who has moved into the apartment building. She may not be the brightest bulb in the chandelier and she has a pet tortoise who is growing just too slowly for her liking. Mr Hoppy is lovestruck at first sight but he needs to pluck up the courage just to exchange a few words with the more outgoing Mrs Silver. Mr Hoppy hatches an elaborate plan to fool Mrs Silver that her tortoise is growing fast which does not seem too romantic at first. Richard Curtis and Paul Mayhew-Archer adapted the book from Roald Dahl which is more whimsical and romantic than being a dark fairy tale for children which Dahl is better known for. The film has narration from James Corden who frames the story of the two elderly romantics bouncing sparks off each other. The minor characters are painted broadly. Hoffman gives a very subtle performance as Mr Hoppy, far from those intense characters he played when he was younger, full of various ticks, mannerisms and vocal abilities. He is simply just more relaxed. A softer version of the Method. It is left to Dench to be more vivid, footloose and flirtatious with various costumes that she wears as she bumps into Mr Hoppy in the lift. Mrs Silver has passions of her own that she wants to unleash. However the film does feel a little stage bound, the apartment setting looks too studio bound. The makers try to overcome this with Corden walking down the street or being on the bus but it just felt a little insular although enjoyable enough.",
         "It's heartwarming. Kinda different with the book but you can still feel the Roal Dahl \"vibe\" here :) I will watch again with my parents and nieces. I don't understand with the low rating here, for me the movie doing a great job on \"telling\" the story. Especially for a TV made movie. I have no doubt to pay for this if it was playing on theater! :) 8/10",
         "Roald Dahl's 'Esio Trot' is a simple but charming tale about a shy, middle aged man called Mr Hoppy who harbours a crush on his downstairs neighbour, the kind-hearted and glamorous Mrs Silver. When Mrs Silver casually mentions that she wishes her beloved tortoise Alfie would grow a bit faster/larger, Mr Hoppy devises a cunning plan to try to win the woman of his dreams\u0085 The difficulty with adapting 'Esio Trot' into a full length feature is that the story is very short and must be 'fleshed out' in order to fill 90 minutes or more. Hence, this adaptation introduces new characters that were not in the original book, including the narrator and his family (the book has no narrator as such), the eccentric pet shop owner (Mr Hoppy does visit a number of pet shops in the book but the owners are not described), and various bit parts that have been added such as Mrs Silver's friends at the dance marathon. Most notably there is the addition of the obnoxious Mr Pringle, the next door neighbour and Mr Hoppy's rival for Mrs Silver's affections; in the original story, Mr Hoppy has no rival other than Alfie but the addition of one does increase the dramatic tension. And with additional characters come additional scenes, some of which do help explain what the book does not cover e.g. how Mr Hoppy can afford to buy all the tortoises, or expands upon what the book only touches on such as Mrs Silver's feelings for Mr Hoppy (in the book she does indicate after Mr Hoppy's proposal that she's always felt the same way about him but this is confirmed in the film when it is revealed that Mrs Silver has been actively trying to attract Mr Hoppy all along). Finally, purists of the book may disagree with the filmmakers decision to change the ending. In the book, Mrs Silver - who accepts Mr Hoppy's proposal straight away - never finds out about the switch and continues to believe for the rest of her life that the larger tortoise is Alfie, while the original Alfie was returned to the pet shop where he was bought by a family (and double in size after many years). In the film version, Mrs Silver discovers the switch (and gets Alfie back) and does not immediately accept Mr Hoppy's proposal. Moreover, Mr Hoppy is led to believe that Mrs Silver has begun a relationship with Mr Pringle. But perhaps the filmmakers felt that it was too dishonest for Mr Hoppy to forge a relationship with Mrs Silver after having lied to her and – effectively – stolen her tortoise! But personally it didn't really bother me and meant that the story could have a more dramatic ending with Mrs Silver finally realising the lengths that Mr Hoppy would go to for her. All in all, an enjoyable adaptation, beautifully acted by Dustin Hoffman and Judi Dench and while mainly aimed at children, there is still plenty for adults to enjoy.",
         "This is a very curious movie. Kind of a children's film for adults. Based on a story by the wonderful Roald Dahl and co-written by the excellent filmmaker Richard Curtis, it's almost cartoonish in its approach. I felt Judi Dench and Dustin Hoffman are well cast as a vivacious retired midwife, Mrs Silver, and a very shy, lonely American retiree, Mr Hoppy, who live one above the other in an apartment block. Dustin's character wants to win the heart of Judi, so he sets out to grant her wish that her tortoise, Alfie, will grow bigger. He does this by secretly winching Alfie out of her garden, and replacing him with a slightly bigger tortoise, and then replacing that tortoise, and so on until 'Alfie' - which is who Judi's character believes he still is - is the desired weight. The whole story is narrated straight to camera by the wonderful James Corden, playing their neighbour with a lot of wit and a little cynicism. The movie would be good for someone stuck in hospital or sick in bed at home, because it's very undemanding. Other reviewers say the Dustin character is deceptive, but actually Judi's character isn't perfect, either -- she can't accept Alfie just as he is, and she also can't see that her neighbour adores her. And Dustin doesn't kill off the tortoises he replaces: he keeps them all in his increasingly crowded apartment. The message of this film is that if you love someone, you should tell them directly, and not waste time, because trying to win their heart in indirect ways can create all sorts of chaos, and ultimately you can miss out. Also that it's never too late to fall in love, which is kind of nice.",
         "Oh dear.The BBC's most hyped Christmas programme turns out to be an absolute disaster.What were they thinking of? Big name actors in a sweet little story by a big name writer - what's not to like? Well,it could and should have been a two - hander. But we have extra characters and a most inappropriate narration by an extremely irritating \"hot\" actor who flounders with some truly appalling dialogue(Not Mr Dahl's). Mr Hoffman appears throughout in a trance - like state as if handling tortoises is absolutely the last thing he would want to do given the choice between that and pulling out his own fingernails. Miss J.Dench is cruelly miscast as the not overly - bright retiree upon whom Mr Hoffman's eye has fallen. Sorry,but she does not convince as either naïve or vacuous.There is too much intelligence and knowingness - she's a retired midwife for heaven'sake,not a novice at a Nunnery. The 3 stars I have awarded this travesty are purely for the sublime Mr Louis Armstrong and \"Give me a kiss to build a dream on\" where the lyrics say more truth in 4 minutes that \"Esio Trot\" does in 90.",
         "While the whole plot could seem rather weak, this movie is a perfect example of a modern storytelling done with mastery. The pace of the movie is voluntarily slow, the actors are excellent, the breaking of the fourth wall is used with wit by a character who at first seems to be there only to tell us the story, and there are some surprising events that are typical of an action movie.",
         "Well all I can say is wonderful family story we all watched at Christmas just lovely adore Judie Dench but the highlight for me was her outfits have one dress like hers can't find any more would just love to have some more especially the white with big pink flowers so different suits my new shabby chic phase anyone know where to find them but back to review the grandkids loved it because of the tortoise s as we have 6 and they are great pets and like them get into trouble if not watched the little garden of Mr Hoppy was a delight and just shows you can make a little go a long way feel good film with real people and a very happy ending can't ask for more ,",
         "There is definitely an age difference between the principle actors, but I think the age difference wasn't too distracting, because, once you get past a certain age, it seems old age is just old age. I take exception to another reviewer stating his opinion as though it were gospel, that Dustin Hoffman didn't want to make this movie. That is utterly ridiculous. If he hadn't wanted to make it, I'm sure he wouldn't have. Why would he? I think he did a great job, just what the script called for, and I find it highly insulting for anyone to claim that his performance was less than excellent. It seems a little slow at times, but don't give up on it. I felt it was definitely worth it to stay until the end. It left me feeling that my time watching it was not wasted, and I felt a peaceful kind of happy.",
         "this film was tedious, typical and overall SO lame!!! Mr hoppy is SO boring and monotonous!! watch this film if you want to be put to sleep... Mr pringle is the only mildly humorous character but is eventually the one who out Mr hoppy's devious plan. Mr hoppy is a boring old man who lets loneliness and boredom get the better of him, his plan is creepy and weird and very devious which he claims to be out of love for her but clearly not. he fails to show his love for her in any way and then asks her to marry him!! really dude... and im pretty sure than you cant have 100 tortoises in one tiny flat...",
         "A cutesy BBC TV movie of Roald's Dahl's children book, starring two titanic thespians, Mr. Hoffman and Dame Ms. Dench, it is a life-affirming romance of old age, brandishes the never-too-late-to- fall-in-love trope but outranks it with a more high-minded love-her-even-she-doesn't-love-me magnanimity, but in the end, it relents from its love-lorn tenor with a mutually love-at-first-sight happenstance. Mr. Henry Hopper (Hoffman), moons over his neighbor one story below Mrs. Lavinia Silver (Dench), who has a pet tortoise named Alfie, but worries about its stalled growth. To win her heart, a habitually halting Mr. Hopper fabricates an incantation which he named \"Esio Trot\" (of Bedouin extraction) and declares that through the magic (thrice a day before meals, specifically, Ms. Silver's meals), Alfie will grow twice as big within one month, which Lavinia accepts with alacrity, she certainly is not the brightest gal in the building (but the heart wants what the heart wants). So Mr. Hopper expends his savings and time in purchasing legions of tortoises with various sizes, so that he can secretively exchange them according to their weight with their predecessor, to conjure up the weight-growing process which predictably will lead to a backfire when bills finally being spilled through a third-wheel played by Cordery with utter chutzpah. There is hearty charm and warmth in the tall-tale, and some actions too (a septuagenarian Hoffman hanging on a make-shift ladder outside his apartment), chiefly, this adaptation pivots on a good-natured show-down between Hoffman's introvert ineptness and Dench's effusive sprightliness, to paper over the story's implausibility and its rather slipshod production design (too garish in its fairy-tale-like artificiality), and James Corden, to significantly lower the average age of the cast, assumes the job as an eloquent fourth-wall-breaking raconteur, as well as a slightly mindless father. Steeped in Louis Armstrong's repertoire, ESIO TROT (literally \"tortoise\", spelt backwards, which is the linchpin of the incantation, though its logic linked to this tardy breed is a head-scratcher), is coyly nostalgic in its mawkishness being a twilight love story based on a whopper cannot even get a free pass in one's dotage, but it is so rare a movie dedicated itself to that neglected sphere of elder people's love life, garnished by two winsome performances from its eminent dab-hands, it is a delicate amuse-gueule, as often as not, can muzzle those lenient-hearted from bad-mouthing its saccharine overtone. referential point: Dustin Hoffman's QUARTET (2012), 6.0/10",
         "I loved this movie right from the get go. It's a fun, funny, sweet story about life and love and all those interesting bumps in between. You can relate to the characters on some level because I am sure everyone knows someone like either of the leads. It's subtle humor works well with the plot and it just makes you feel that life is worth the living. Very good life lessons as well; we are never too old to learn and grow. I have watched this movie 3 times now and it never fails to satisfy. I most definitely recommend this movie for the whole family. Two well known and well loved actors play the lead roles and they are flawless in their performances.. An all around pleasure to watch.",
         "Dustin Hoffman obviously did not want to make this movie! He was so detached, bored, and plane boring: Mr. Hopper was his worst act. And him being crazy for the very lovely, but way-too-old Judy Dench was so unbelievable, it hurt. This movie was made after a children's book, but who was to know? Well, after watching it,I told my mother to NOT see this film. The balcony scenes were crass and studio made, the plants made of plastic. Christ, this movie was so bad, how could all this talent be wasted in such a poor production? Certainly this was not even a good movie for children. Luckily got the DVD from a library, so saved a lot of money. In Europe the movie is called \"Mr. Hopper's Secret\" by the way.",
         "I always thought that Roald Dahl's stories were creepy, but this story is the most horrific of all: suggesting that animals are things that can be exchanged without consequences is just disgusting. This is not charming, this is exactly what is wrong with the human race and why animals have to suffer from them. A \"hero\" who does this, does not deserve to succeed and therefore this story does not work for me at all.",
         "Mr Hoppy is a lonely, aging bachelor. He is infatuated with Mrs Silver, his widowed downstairs neighbour, but is too shy to reveal his feelings to her. However, when she gets a tortoise as a pet, he hatches a cunning plan to gain her favour. Sweet but dull. Despite the ages of the main characters, a movie that feels like it is aimed at kids more than anyone else. Overly schmaltzy, with a fairly predictable plot and some hijinks aimed squarely at kids. Not all bad - Dustin Hoffman and Judi Dench are good in the lead roles and the chemistry between the two of the them is spot-on. Some funny moments too.",
         "Esio Trot is a wonderful book, and makes me want to shout out in glee every time I read it, Roald Dahl's Esio Trot the TV Movie is a homage to the book. Starring Dustin Hoffman and Judi Dench as Mr Hoppy and Mrs Silver, Esio Trot is a charming film and makes your heart lighten with joy as one tortoise brings Mr Hoppy and Mrs Silver closer together. James Corden plays a brilliant role in narrating the hectic story, and does it very well. Using his daughter (In the film) to narrate alongside him. This works very well and is a key aspect of the film. This film is suitable for a human being- any person. It is guaranteed to make you happy."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Endor Productions"
      ],
      "summaries": [
         "Lonely, ageing bachelor Mr Hoppy lives in a London flat and has two loves in his life - his balcony garden and Mrs Silver, the widow in the flat below. Sadly Mrs Silver is too fond of her tortoise Alfie to respond. Noting that Mrs Silver is perturbed that Alfie never seems to grow Mr Hoppy hatches a plan to show her how much he cares. This involves buying dozens of tortoises of increasing sizes to gradually substitute for Alfire, leading Mrs Silver to believe that a Bedouin chant - Esio Trot - is making her pet grow. However he is rumbled when one of the tortoises escapes. And, with another, brash resident vying for Mrs Silver's affections, will Mr Hoppy find happiness with the woman he loves?",
         "Mr Hoppy is a lonely, aging bachelor. He is infatuated with Mrs Silver, his widowed downstairs neighbour, but is too shy to reveal his feelings to her. However, when she gets a tortoise as a pet, he hatches a cunning plan to gain her favour.",
         "A retired bachelor has a thing for his neighbour who only shows affection to her pet tortoise."
      ],
      "budget": 0
   },
   "movielensId": 133653,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-01-02",
      "dvdReleaseDate": null,
      "directors": ["Dearbhla Walsh"],
      "runtime": 87,
      "movieId": 133653,
      "title": "Roald Dahl's Esio Trot",
      "mpaa": null,
      "actors": [
         "James Corden",
         "Dustin Hoffman",
         "Judi Dench",
         "Salo Gardner",
         "Lara Rossi",
         "Jimmy Akingbola",
         "Katie Lyons",
         "Pixie Davies",
         "Richard Cordery",
         "Pik-Sen Lim",
         "Polly Kemp",
         "Alexander Bracq",
         "Joseph West",
         "James Thomas Scott",
         "Anna Cannings",
         "Lisa Hammond",
         "Emily Ralph",
         "Geoffrey McGivern",
         "Aaran Mitra",
         "Leo Umeh"
      ],
      "imdbMovieId": "3205394",
      "originalTitle": "Roald Dahl's Esio Trot",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["165NXvc4JIw"],
      "plotSummary": "Mr. Hoppy is a shy old man who lives alone in an apartment building. For many years, he has been secretly in love with Mrs. Silver, a woman who lives below him.  Mr. Hoppy frequently leans over his balcony and exchanges polite conversation with Mrs. Silver, but he is too shy to disclose how he feels.  Mr. Hoppy longs to express his feelings to Mrs. Silver, but he can never bring his lips to form the words.  Mrs. Silver has a small pet tortoise, Alfie, whom she loves very much.  One morning, Mrs. Silver mentions to Mr. Hoppy that even though she has had Alfie for many years, her pet has only grown a tiny bit and has gained only 3 ounces in weight.  She confesses that she wishes she knew of some way to make her little Alfie grown into a larger, more dignified tortoise.  Mr. Hoppy suddenly thinks of a way to give Mrs. Silver her wish and win her affection.",
      "tmdbMovieId": 313867,
      "avgRating": 3.47619,
      "releaseYear": "2015",
      "numRatings": 21,
      "posterPath": "/jubNEvsL40rY1xPO3uOIFLbXXS3.jpg"
   }
}