{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "video game",
            "id": 282
         },
         {
            "name": "arcade",
            "id": 10547
         }
      ],
      "imdb_id": "tt2395228",
      "video": false,
      "title": "The King of Arcades",
      "recommendations": [
         91921,
         129175,
         67857,
         124073,
         39458,
         82259,
         173056,
         47689,
         15725,
         45664,
         41999,
         54502,
         13993,
         16149,
         41972,
         253150,
         15554,
         42464,
         30180,
         22871
      ],
      "backdrop_path": "/ymfAJGW4Oq0KXqmLd8meSi8yE1h.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5411182fc3a3680201000458",
               "name": "Ralph H. Baer",
               "profile_path": null,
               "id": 1162782,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5411183cc3a36802040004a5",
               "name": "Tim Balderamos",
               "profile_path": null,
               "id": 1362895,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "54111847c3a368020700045e",
               "name": "Greg Bond",
               "profile_path": null,
               "id": 76115,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "54111856c3a368021200043b",
               "name": "Jerry Buckner",
               "profile_path": null,
               "id": 1362896,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4d2dc3a36847f8252e37",
               "name": "Sean Tiedeman",
               "profile_path": null,
               "id": 35466,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54176f77c3a368199c0000cb",
               "name": "Sean Tiedeman",
               "profile_path": null,
               "id": 35466,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.975943,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 173165,
      "vote_count": 9,
      "budget": 175000,
      "overview": "Starting as a passion project, this movie launched the team on an unexpected journey; from discovering the historic past in Ralph Baer's personal workshop, to capturing the present as the Smithsonian Museum recognizes gaming as art.  Along the way, the crew encountered an interesting cast of characters including game developers, high score players, and arcade enthusiasts.",
      "similar": [
         86130,
         36670,
         10404,
         1124,
         12279,
         1370,
         44214,
         585,
         9472,
         45317,
         114150,
         101299,
         82690,
         62211,
         68735,
         55721,
         257344,
         333339,
         353486,
         8328
      ],
      "original_title": "The King of Arcades",
      "runtime": 100,
      "poster_path": "/2msxsliNYPDyYI2WkxmzTcRFKnx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Tiedebaby Films",
         "id": 33167,
         "origin_country": ""
      }],
      "release_date": "2014-06-17",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "An Arcade Will Fall... A Hero Will Rise!",
      "adult": false,
      "homepage": "http://www.thekingofarcades.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sean Tiedeman"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Sean Tiedeman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2395228/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTE2OTk0OTQ5NV5BMl5BanBnXkFtZTgwMDkwNDk4OTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Ralph H. Baer",
         "Tim Balderamos",
         "Greg Bond"
      ],
      "reviews": [
         "Here is a well done look into the real world of arcade game COLLECTING! The movie Wreck It Ralph gave us the classic games in a unique perspective...and now we can see those same games explored in the REAL world by people who both love and rescue these arcade games that are slowly slipping away from us! See how they get rebuilt by one of the pioneers of restoration and how he tries to make a go with a commercial arcade! Peppered with interviews of some of the first designers of these machines who talk the original days they were manufactured and how many of them have withstood the test of time! Richie Knucklez love for these machines is shown as he struggles with today's problems of storefront rent, lack of parts to fix them, and balancing family life with his passion!",
         "I have to be honest with you and tell you that this is my first movie review I have ever done. The King of Arcades is such a great film I had to write a review about it! I love this documentary for what it is about (Arcades), its shows the passion, heart and dedication of the people who made the Arcade what it is today, you may take it for granted when you walk into an arcade and put a quarter into a machine, but this film shows you a different point of view and makes you realize that its more then just a game, its a way of life, family and love. Richie Knucklez true passion for arcades is unbelievable, not only is he the King of Arcades but also is the Doctor of Arcades, he takes what was old and make them new. Thank you Dr. Knucklez for bringing new life into these old arcades and showing everyone young and old especially my kids what an Arcade is.",
         "The King of the Arcades is a truly wonderful trip down memory lane! It brought back a lot of happy memories from my childhood and the times I was allowed to spend in arcades, playing my favourite games. It is amazing to see that there are still dedicated and passionate people out there that fight for the maintenance and memory of the origins of modern gaming culture. The documentary manages to portray Richie Knucklez as a man who follows his dream, and who, despite some bumps in the road, never stops to believe in what makes him happy - and what makes a lot of his fellow gamers happy in the process. Richie is not only passionate, he is a skillful craftsman who puts all of his time and effort into restoring his old arcade machines and bringing back the arcade experience to modern society. His passion and dedication is reflected in his fantastic work. The film painted a very vivid, and very emotional picture of what arcade games not only mean to Richie and his gamer friends all across the world, but also to the history of pop culture. An amazing documentary that will help keep the memory of arcade games alive, hopefully for many years to come. Thanks also for the nicely done DVD release - really wish to see an arcade style limited edition :)",
         "WOW. Such a great movie. I was involved in the film, so I have an idea of how hard the cast and crew worked to make this documentary possible. Sean brings it all together to make the documentary not only informative but personal as well. Whether you are a video game novice, or an expert you will enjoy this film. Experts will appreciate the nostalgia and the novices will learn a thing or two about the evolution of video games. If you're not interested in video games, that's okay too. Another theme of the film is following your dreams. Everyone has a dream and the King of Arcades (Richie Knucklez) isn't afraid to go out there and make it happen. Richie is on the never ending quest to keep Classic Arcade Games relevant in a world full of Wiis, Xboxes and Playstations. One thing is for sure. It ain't easy.",
         "Great film on American Arcade culture. Very nice editing, and composition of the film. Contains a lot of historical information with clips from past broadcasts. The main focus is the story of Richie and how he follows his dream of opening up a modern arcade and the problems with having such a goal. Very fun and it will bring nostalgia to arcade fans."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "K Studios",
         "Tiedebaby Films"
      ],
      "summaries": ["Follow the rise and fall of the King of Arcades as one man pursues his dream against all odds."],
      "budget": 175000
   },
   "movielensId": 133673,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-06-17",
      "dvdReleaseDate": null,
      "directors": ["Sean Tiedeman"],
      "runtime": 100,
      "movieId": 133673,
      "title": "The King of Arcades",
      "mpaa": "",
      "actors": [
         "Ralph H. Baer",
         "Tim Balderamos",
         "Greg Bond",
         "Jerry Buckner"
      ],
      "imdbMovieId": "2395228",
      "originalTitle": "The King of Arcades",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["FOB2lB38MsM"],
      "plotSummary": "Starting as a passion project, this movie launched the team on an unexpected journey; from discovering the historic past in Ralph Baer's personal workshop, to capturing the present as the Smithsonian Museum recognizes gaming as art.  Along the way, the crew encountered an interesting cast of characters including game developers, high score players, and arcade enthusiasts.",
      "tmdbMovieId": 173165,
      "avgRating": 3.16667,
      "releaseYear": "2014",
      "numRatings": 3,
      "posterPath": "/2msxsliNYPDyYI2WkxmzTcRFKnx.jpg"
   }
}