{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "mistress",
            "id": 11869
         },
         {
            "name": "whodunit",
            "id": 12570
         },
         {
            "name": "psychological",
            "id": 157902
         }
      ],
      "imdb_id": "tt0067956",
      "video": false,
      "title": "The Designated Victim",
      "recommendations": [
         157402,
         105240,
         74087,
         99449,
         76764,
         28402,
         105119,
         85551,
         105151,
         105109,
         41749,
         42676,
         54006,
         22815,
         105398,
         60029,
         69579,
         93142,
         73941,
         29530
      ],
      "backdrop_path": "/iJpu2pppvnSCd25lT3i1a11W9OO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stefano Argenti",
               "gender": 2,
               "credit_id": "52fe4a16c3a36847f81b8741",
               "name": "Tomás Milián",
               "profile_path": "/5ZUu4Zy9kWtYuVES74pbrXqd0FB.jpg",
               "id": 21708,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Count Matteo Tiepolo",
               "gender": 2,
               "credit_id": "52fe4a16c3a36847f81b8745",
               "name": "Pierre Clémenti",
               "profile_path": "/knoMVwKuw2dGAgs1s3l460J9iXc.jpg",
               "id": 17577,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Fabienne Béranger",
               "gender": 1,
               "credit_id": "52fe4a16c3a36847f81b8749",
               "name": "Katia Christine",
               "profile_path": "/oP6EB0ZVXgLFeAN5MQQRX3myyA9.jpg",
               "id": 139129,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Commissario Finzi",
               "gender": 0,
               "credit_id": "52fe4a16c3a36847f81b874d",
               "name": "Luigi Casellato",
               "profile_path": null,
               "id": 41094,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Luisa Argenti",
               "gender": 0,
               "credit_id": "52fe4a16c3a36847f81b8751",
               "name": "Marisa Bartoli",
               "profile_path": null,
               "id": 1040863,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Balsamo",
               "gender": 2,
               "credit_id": "52fe4a16c3a36847f81b8755",
               "name": "Ottavio Alessi",
               "profile_path": null,
               "id": 554171,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Christina Müller",
               "gender": 1,
               "credit_id": "52fe4a16c3a36847f81b8759",
               "name": "Alessandra Cardini",
               "profile_path": "/xIQRiJjZHFaSNYpiLjiWkhorDZT.jpg",
               "id": 72774,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Del Bosco",
               "gender": 0,
               "credit_id": "52fe4a16c3a36847f81b875d",
               "name": "Enzo Tarascio",
               "profile_path": "/ade7ECDsOe7kH33xDsjI5h7IuQ3.jpg",
               "id": 55757,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4a16c3a36847f81b873d",
            "name": "Maurizio Lucidi",
            "profile_path": null,
            "id": 100054,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.978061,
      "production_countries": [],
      "id": 103067,
      "vote_count": 4,
      "budget": 0,
      "overview": "A wealthy, decadent count convinces a disillusioned playboy that they shall murder one another's relatives, to get away with the perfect crime. The count murders the playboy's unpleasant wife. Now the playboy finds he cannot keep his end of the bargain, while the police finger him for the murder.",
      "similar": [
         28355,
         392044,
         7007,
         20126,
         19959,
         2252,
         1586,
         1949,
         2832,
         186,
         11615,
         431,
         101,
         275,
         180,
         681,
         949,
         956,
         14869,
         59967
      ],
      "original_title": "La vittima designata",
      "runtime": 105,
      "poster_path": "/qSnyzLHqqgQBi3V32oQRKYQTzkB.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1971-04-22",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Maurizio Lucidi"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Fulvio Gicca Palli",
         "Augusto Caminito"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0067956/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BM2UzY2JjYzItMTcyZC00OTUzLTgxYzQtMTExYzQ0OGJmNWY1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Tomas Milian",
         "Pierre Clémenti",
         "Katia Christine"
      ],
      "reviews": [
         "User ratings sometimes (I'd dare to say 'often') don't reflect the real quality of a movie... This is the case, in my opinion. \"La vittima designata\" is a remake of Hitchcock's \"Strangers on a train\" (that has a user rating of 8.3) and, call me blasphemous if you want, it is almost better. Here we have a rich, baroque photography, great atmosphere, and wonderful acting performances: Milian and Clementi interact perfectly adding to the whole story a soft sense of ambiguity that enriches it and could have lead to paths unknown to Hitchcock's movie. Venice and the palace of the nobleman Matteo Tiepolo stand perfectly as a metaphor of moral decadence and if you have seen 'La morte a Venezia' by Luchino Visconti (filmed that same year, 1971) you know what I'm talking about. Great soundtrack, too: the Gothic lullaby \"My Shadow In The Dark\" with its fatalistic refrain \"to die, to sleep, maybe to dream\" is sung by Milian himself. I don't think this is an easy title to find these days, but if you can, start the quest. To me this is one of the best Italian movies of the seventies. 8/10",
         "This Italian re-working of Alfred Hitchcock's Strangers on a Train has Tomas Milian star as an immoral advertising executive who is frustrated with his wife's refusal to sell their business. Angry that he won't be cashing in any time soon, he goes on a trip to Venice where he has a chance meeting with a foppish aristocrat who looks like a cross between Russell Brand and Laurence Llewellyn-Bowen. The two of them make a pact where Brand-Llewellyn-Bowen will kill Milian's wife in return for the latter murdering the former's brother. In its early stages The Designated Victim looks quite promising. The scenes in off-season Venice where Milian meets the Count and his mysterious lady friend are quite unusual and atmospheric. Unfortunately, the odd lady friend vanishes from the scene leaving Milian and the fop to lead the picture. You will sort of know roughly where the story is going if you are even vaguely familiar with the Hitchcock original. But it's not predictability that's the problem here; it's more the fact that there is a serious lack of suspense and thrills. The film drags for the most part and the dynamic between the two central characters isn't as interesting as it should be. I couldn't really wholeheartedly recommend this one. When you consider the other Italian thrillers on offer in the 70's, this one pales quite a bit by comparison.",
         "Reading down the list of titles that DVD company Shameless have brought out,the first title which really got my attention was a complete re-edit of lost footage for a Viana set,near forgotten Giallo. Finding out that this movie is meant to be a Giallo-riff on Patricia Highsmith's novel/Alfred Hitchcock's film Strangers On A Train,I decided to get the very first ticket for this exciting sounding Strangers On A Gondola! The plot: Feeling that he is stuck in an unworkable marriage,Stafano Argenti attempts to convince his wife Lusia that this is the perfect time for them to sell off the shares to their business which they both co- own.Unlucky for Stafano,Luisa stone walls his idea and refuses to get involved in the conversation. Angry at his wife messing him around,Stafano secretly forges his wife's signature so that he can start the separating of their lives without her having any knowledge about it.Feeling that he needs some time to relax,Stafano decides to spend some time with his mistress :Fabienne Beranger.Hanging around the casinos and Celtic market stalls in Venice,Stafano finds himself weirdly constantly running into the same man. Eventually striking up a convocation with the strange man,Stafano finds out that the man is an aristocrat called Count Matteo Tiepolo,who is being constantly tormented by his brother.Finding a strange bond in Tiepolo's suffering at the hands of his brother,and Stafano's own troubles of being stuck in a loveless marriage,Stafano starts to spend a lot of time around Tiepolo and begins to become a firm friend of his. Deciding that he has developed a strong enough friendship with him, Tiepolo tells Stafano that he has come up with a plan which will cure his marriage troubles,and also put an end to the torment from Tiepolo' brother.Confident enough that Stafano will approve, Tiepolo tells him that his plan is for him to murder Stafano's wife,and for Stafano to murder his brother. View on the film: Presenting this fantastic movie fully uncut for the first ever time,the team at Shameless have gone into painstaking detail to get every previously cut moment from the film,which despite being a noticeable drop in quality to the rest of the movie due to how neglected the reels of film have been,the extra footage does really help to add a bit more flesh to the relationship between Stafano and Tiepolo. Since having last seen Tomas Milian play a ruthless slime ball in Umberto Lenzi's brilliant 1974 Italian Crime film Almost Human,I was astonished by the restrain and delicately which Milian displays for his masterful performance as Stafano.Although Stafano is shown to be pretty keen on getting away from his wife,Milian gives the character a strong conflicted conscious,which takes him away from being someone who makes snap decisions,to instead being a character whose completely uncomfortable about either going forward or back with his relationships. Fully embodying Patricia Highsmith characters such as Tom Ripley,Pierre Clementi gives a perfect shaman-like performance as Tiepolo,who Clementi shows goes from being a sweet and innocent looking guy,to someone hiding a horde a demons underneath his eyes. For the screenplay of the film, (written by\u0085deep breath!:Maurizo Lucidi,Augusto Caminito,Leslie Daniels,Fulvio Gicca Pali,Antonio Troiso and Aldo Lado-who along with also being an assistant director here,would later do his own Venice based Giallo:Who Saw Her Die?) the writers smartly make sure that the progression in Stafano and Tiepolo's relationship never feels like an abrupt change,but instead a natural progression for the characters,as Stafano is shown to be feeling a mix of interest and extreme uncomfortableness over his friends plan,whilst Tiepolo is shown fearing that Stafano might no longer want to be his friend,due to him having \"crossed a line\" Soaking up the beautiful,dream-like misty Venice atmosphere,co- writer/director Maurizio Lucidi uses a number of elegantly done,side- ways shot tracking shoots to show the gradually strange direction that the two mens friendship is heading towards.Smartly building up the tension and atmosphere of this transfixing Giallo piece by piece,Lucido puts the clues for the ending of the movie quietly at the beginning, so that they can slowly start to unravel as Stafano begins to decide on if he should accept Tiepolo's offer.",
         "This little known film is available on a DVD brought out by 'Shameless', who add a note to explain that the film was subjected to so many cuts upon its release that we can appreciate it only now that they've restored the missing bits. These 'missing bits' make a difference; but the question remains is this the original, complete film we now see? There are, for example, a few moments from the deleted scenes (part of the DVD bonus) which 'flesh out' the count's character which I think the film needed. My guess is that too many 'cooks' (writers, producers, directors, editors) were involved and there never was a satisfactorily resolved 'original version'. It's interesting how the film veers away from Highsmith's novel and Hitchcock's film. Count Matteo (Pierre Clementi), like his counterparts in Highsmith and Hitchcock, comes from a privileged background, free from the demands of having to earn his living and a place in society. The unhappy husband Stefano was a two cent designer his wife lifted from total social insignificance--now that he's rich (thanks to her) he thinks like a businessman; his wife prefers him as he was and doesn't love him any more, she says. The counts confides that his brother harasses him to the point of making his life unlivable. We never encounter this 'brother' in the film, nor any one else from the count's family (not even a photo. of any family). He indicates to Stefano how by 'trading murders' they can eliminate each man's obstacle to fulfillment. The count tells Stefano that Stefano is his real brother now. He tracks Stefano's every move , seems to know him inside out, and plots with the inescapable logic of a mastermind the events that culminate in the two projected murders. (Here again he differs from the Highmith/Hitchcock character.) Another thing Stefano's wife can't bear about her husband now: he's so irresolute everything ends up some mishmash compromise (like his pretending(?) he was going to put a portion of the money he stole from his wife into her account). At one point the count takes Stefano by the scruff of the neck, makes him look at himself in the glass and says: 'What I'm proposing is what you really want to do.' As if the count is the ideal Stefanno the real one hasn't the courage to be. Guess who's the 'brother' Stefano kills? The film misses becoming truly haunting and profound because some of the filmmaking team didn't understand the potential of their material and treated it like a run of the mill Giallo. The acting and dialogue are above average (in Italian!, the English version sounds like a translation). Given a more sensitive restoration, this could be a minor masterpiece with themes of universal resonance (e.g. don't we all know a 'Stefano': the 'wanabe' who only exasperates us with his pathetic half measures?). All the same, this DVD version should interest those of us who like psychological thrillers.",
         "Not a tennis player this time but a business man who has a matrimonial conflict with his wife and also a mistress. Noble friend Mateo Tiepolo offers him the \"perfect crime\" - i.e. he will murder Milian's wife and Milian is supposed to kill his evil brother. After doing his job Mateo expects the compensation. This more stylish version with a good score can be recommended to Milian fans. Considering that I didn't even like the original very much I'll give this one 5 / 10.",
         "The influence for this film is clear; it's basically an Italian twist on the Hitchcock classic Strangers on a Train. Being a big fan of that film, I was of course intrigued to see how this was going to turn out. I wont say I was too disappointed overall, but it's nowhere near as good as the original and certainly could have been a lot better. The main problem with it is that director Maurizio Lucidi has aimed too high; it's clear he wanted this to be a high quality thriller rather than a slice of Italian exploitation - and personally I'd rather it have been the latter. The basics of the plot will be familiar to most fans of thrillers, and in this film we focus on Stefano Argenti, an advertising executive who is at odds with his wife over the sale of a joint business. He wants rid of it so he can live a life of luxury with his mistress; but his wife wont agree the sale. Stefano meets Count Mateo Tiepolo, who it transpires, is at odds with his violent brother. Mateo suggests a plan in which each man murder the other's vice; though Stefano is reluctant. But then Mateo kills Stefano's wife, and demands that the favour is returned. The lead roles are taken by Tomas Milian and Pierre Clémenti, and both perform well and share an intriguing (almost homo-erotic) bond on screen together. The plot itself is rather slowly paced and it has to be said there's not a great deal of excitement; I was never on the edge of my seat waiting to see what's going to happen, and that's unfortunate since the film is supposed to be a thriller. It's all very well orchestrated, however, and the film has themes that go deeper than merely what we're seeing on screen. Director Maurizio Lucidi obviously wanted to keep the film clean, and therefore we don't see any murders actually happen, which is a bit of a disappointment. The locations are all very beautiful and well shot, and this brilliantly offsets the dark themes of the film. The soundtrack is rather interesting also and not merely the norm for Giallo. The film deviates from Hitchcock's original with the ending, which features a clever twist; though I have to say I prefer how the original turned out. Overall, I would definitely say that this film is worth a look; however, I'd have preferred some more of the classic Giallo style.",
         "This Venice-based remake of Strangers On A Train (thanks, back of the DVD cover!) involves Tomas Milian as a snidey, conniving advertising executive who is banging his top model and trying to sell all the shares his wife has in some company in order to get rid of her and marry his model wife. Strangely, his wife isn't too happy with this set up and is quite happy to continually torture Milian. Milian therefore still goes ahead with the business deal, still bangs his mistress, and has now started to arrange to have Power of Attorney over his wife by trying to forge her signature. Things don't look too good until several 'chance' meeting with a certain Count Matteo move things in a more positive direction. You see, Count Matteo is yet another one of these bored, turned on, rich types with barely any soul who have explored most of life's extremes and are pushing for more top sensations. He says to Milian, he says, if I kill your annoying wife, whom I have never met, then you can kill my abusive brother who abuses me and is a moron. Milian's all like 'Err...that's...yeah..' Milian ain't interested in that and wants to bump his wife for the cash but then it soon becomes apparent that Matteo was being serious (the biggest clue being his wife getting murdered). Now the police are leaning on Milian as his many faults are revealed and he still has to hold up his side of the bargain for Matteo, who has various methods in place to make sure that happens. Although a very slow moving, eventless giallo with no blood and only some opening credits boobs, this film is still worth a watch as it must be the only film that totally displays the full spectrum of Tomas Milian's considerable acting chops. He starts off like a snidey moron but then the look on his face when Matteo describes his murderous idea is priceless. Plus we also get his descent into desperation as it becomes apparent to him and the audience that things have not been weighed in his favour. Still, not the most eventful film, but full of atmosphere and as it is mostly set in Venice everything is very good to look at. Probably worthwhile to Milian fans and that."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Produzioni Cinematografiche Europee (P.C.E.)"],
      "summaries": ["A wealthy, decadent count convinces a disillusioned playboy that they shall murder one another's relatives, to get away with the perfect crime. The count murders the playboy's unpleasant wife. Now the playboy finds he cannot keep his end of the bargain, while the police finger him for the murder."],
      "budget": 0
   },
   "movielensId": 133792,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1971-04-22",
      "dvdReleaseDate": null,
      "directors": ["Maurizio Lucidi"],
      "runtime": 105,
      "movieId": 133792,
      "title": "The Designated Victim",
      "mpaa": null,
      "actors": [
         "Tomás Milián",
         "Pierre Clémenti",
         "Katia Christine",
         "Luigi Casellato",
         "Marisa Bartoli",
         "Ottavio Alessi",
         "Alessandra Cardini",
         "Enzo Tarascio"
      ],
      "imdbMovieId": "0067956",
      "originalTitle": "La vittima designata",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["S3w6ssiV-xY"],
      "plotSummary": "A wealthy, decadent count convinces a disillusioned playboy that they shall murder one another's relatives, to get away with the perfect crime. The count murders the playboy's unpleasant wife. Now the playboy finds he cannot keep his end of the bargain, while the police finger him for the murder.",
      "tmdbMovieId": 103067,
      "avgRating": 2.33333,
      "releaseYear": "1971",
      "numRatings": 3,
      "posterPath": "/qSnyzLHqqgQBi3V32oQRKYQTzkB.jpg"
   }
}