{
   "tmdb": {
      "original_language": "ru",
      "keywords": [],
      "imdb_id": "tt0874952",
      "video": false,
      "title": "My Love",
      "recommendations": [
         118794,
         50769,
         191398,
         146211,
         214157,
         184882,
         233880,
         51887,
         36072,
         129327,
         145337,
         146362,
         203087,
         72208,
         49176,
         190085,
         207247,
         129409,
         37836,
         129067
      ],
      "backdrop_path": "/s6NeOMWGkBs13YQ3EV1NWrX2Moj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Anton",
               "gender": 0,
               "credit_id": "5a6163aac3a368536900d434",
               "name": "Aleksandr Palamishev",
               "profile_path": null,
               "id": 1963025,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Pasha",
               "gender": 0,
               "credit_id": "5a6163b5c3a368535a00c055",
               "name": "Aleksandra Zhivova",
               "profile_path": null,
               "id": 1963026,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Serafima Konstantinovna",
               "gender": 0,
               "credit_id": "5a6163c3c3a368535a00c067",
               "name": "Evgeniya Kryukova",
               "profile_path": null,
               "id": 1272388,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a36c3a36847f81c1583",
               "name": "Aleksandr Petrov",
               "profile_path": "/tyNio2z5IiU7tfTuWet7lw857e7.jpg",
               "id": 126421,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a61639b0e0a26103100df6a",
               "name": "Ivan Shmelyov",
               "profile_path": null,
               "id": 1963024,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.301953,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 104522,
      "vote_count": 12,
      "budget": 0,
      "overview": "In nineteenth-century Russia, a teenage boy in search of love is drawn to two very different women.",
      "similar": [],
      "original_title": "Моя любовь",
      "runtime": 26,
      "poster_path": "/yieIStUQ6ZPkM5ig3EHVq5ssuey.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dago Productions",
         "id": 95341,
         "origin_country": ""
      }],
      "release_date": "2006-08-27",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Russia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Aleksandr Petrov"],
      "runtime": 26,
      "synopsis": "In nineteenth-century Russia, a teenage boy in search of love is drawn to two very different women.",
      "writers": ["Ivan Shmelyov"],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0874952/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNmFjZDE2MjMtNzdiMS00MTMzLWJiZmUtZDBlNWIwMzdkZmRhXkEyXkFqcGdeQXVyMjExNjgyMTc@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Aleksandr Palamishev",
         "Aleksandra Zhivova",
         "Evgeniya Kryukova"
      ],
      "reviews": [
         "Admittedly I was only able to see it on YouTube, so not the best format. However, I was still very impressed at it's beauty. The icons painted on the wall in the Russian church shown during a service were one of my favorite parts. It's about a young boy in czarist Russia and his pure idealization and fantasizing about love. He is drawn to a sophisticated older woman but also feels something for his family's maid. As with most foreign films, the subtitles can not do it justice. You miss a lot of the actual dialogue. The jokes, the rhyming language, the use of informal/formal forms of address that we don't have in English. Without knowing the culture there is a lot more than falls through. It also helps to have read Russian novels & short stories - you'd know that there's always tragedy and loss involved somehow. So if you don't speak Russian or know the culture, just understand that there's a lot of context and subtext that you're missing and allow for that - but I think you'll still enjoy it for the pure visual beauty of the piece alone.",
         "You know that you've become an animation buff when the mere mention of Aleksandr Petrov makes your heartbeat quicken in anticipation. Along with fellow genius Yuriy Norshteyn, he has become one of my favourite Russian animators, and such impressive short films as 'Korova (1989)' and 'The Old Man and the Sea (1999)' rank among my favourites. 'My Love (2006),' Petrov's latest film, was his fourth to be nominated for Best Animated Short at the Oscars, and, though it lost to Suzie Templeton's 'Peter & the Wolf (2006),' it certainly is one of the year's finest releases in any medium. Generally well-received by critics, 'My Love' has nonetheless stirred a few incidents of controversy, including comments from Chris Robinson \u0096 head of the Ottawa International Animation Festival \u0096 who apparently took offence to Petrov's pursuit of realism. Likewise, other leading animators, including Norshteyn himself, remarked that perhaps the film was too focused on technology rather than storytelling. The plot is based on \"A Love Story,\" a 1927 novel by Ivan Shmelyov, and concerns a 16-year-old boy, Antosha, who is searching for his first true love. As he falls in and out of his romantic fantasies, Antosha must decide between two young woman who have captured his fancy \u0096 a pretty, innocent but uneducated parlourmaid named Pasha, and an experienced upper-class lady named Serafima. He is equally smitten with both lovers, but his inability to choose between them will prove tragic. Pasha is genuinely affectionate towards Antosha, but class restrictions prevent them from coming together without a certain hesitation; on the other hand, Antosha worships Serafima as a \"goddess,\" considering her representative of his lover ideal. When experience reveals a fatal blemish in his idealistic illusions, the young boy rejects the older woman, but not before his indecision has cost him the girl that he truly loved. 'My Love' often treads a fine line of comprehensibility \u0096 I'm not even certain that my description so far is completely accurate \u0096 but it's really the visuals that you should be watching out for. Petrov's style of paint-on-glass animation is instantly recognisable, and has all the beauty of a moving Impressionistic painting, the oils and colours shifting smoothly like the quiet waves of an ocean. Though, in order to achieve a sense of \"romantic realism,\" Petrov has produced about 20% of the film using a kind of rotoscoping, he just as frequently descends into fantastic flights of the imagination. Antosha's inner romantic turmoil is represented through beautiful and sometimes terrifying daydreams \u0096 rowboats on a pond, ships amid a lightning storm, bodies burning in the pits of Hell \u0096 and Petrov's constantly-shifting style of animation is perfect for evoking the timelessness of our dreams and memories.",
         "Words are just not enough to express how marvelous this short is. Each one of the animations directed by Aleksandr Petrov is a flawless and exquisite work of art. He always manage to turn even the most (apparently) mundane story into something incredibly beautiful and poetical, and this short film about the contrast between passion and true love isn't exception. I simply loved every single second from \"My Love\": After seeing some bland, commercial and ugly animated films and television shows, this was a strong reminder of why I love so much this underrated genre, which is sadly commonly dismissed as something that only kids could enjoy, despite the existence of extraordinary films like this one. Personally, I would recommend this short to anyone. 10/10 (And I would rate it with eleven stars if I could)",
         "\"Moya lyubov\" or \"My Love\", paint-on-glass-animated 2006 short film (26 minutes) directed by Aleksandr Petrov is based on \"A Love Story\" or \"Istoriya Lyubovnaya\" (1927) by Ivan Shmelyov. It takes place in the 19th century Russia and tells about the first love of the sixteen-year-old boy Anton who is torn apart by his feelings for a pure and gentle girl, the maid-servant for his wealthy family, Pasha and a mysterious enigmatic next door neighbor Serafima. Shemelyv's story was inspired by one of the most captivating love stories ever told, his famous namesake Ivan Turgenev's \"Pervaya lyubov\" (1860; First Love), a novella that depicts the love of a sixteen-year-old boy Vladimir for his neighbor, 20 years old princess Zinaida, unattainable, devious but alluring and unforgettable. By the words of Petrov, the film \"is about waking of first love, naive and childish, both resolute, and silly, with all tortures of a romantic soul. Not that I have gone through such feelings myself, but I deeply felt all of them.\" At the International Leipzig Festival for Documentary and Animated Film, \"Moya Lyubov\" was called an \"exquisite impressionist vision with a very poetic narrative and profound psychology\". I believe that Petrov's film was the best of five nominees in the category Short Animated Films and deserved all awards possible. As much as I enjoyed the 2008 Oscar winner, the slow-motion updated to modern Russia version of Sergey Prokofiev's \"Peter and Wolf\", Petrov's film is simply in league of its own. Work on the film took place in Yaroslavl, Russia over a period of three years painting on glass sheets, using mostly his own fingers, resulted in 18720 paintings. The film's style is similar to that used in Petrov's other films (\"Korova\", \"Rusalka\", Oscar winning \"Starik i More\") and can be characterized as a type of Romantic realism. People and landscapes are painted on glass and animated in a very realistic yet delicate and dream-like fashion. In \"Moya lyubov\" Petrov includes Anton's inner thoughts while the boy reads Turgenev's \"Pervaya Lyubov\" and identifies with its narrator, Vladimir, the boy of the same age and the nightmarish scene when the ill boy imagines himself being buried beneath freshly-fallen deep snow on a dark night. Every frame of the incredibly beautiful work is literally breathtaking. I can't compare him to any working animator. His films bring to mind the paintings of such poetic Russian Artists as Mikhail Nesterov, Vasiliy Polenov, Victor Borisov-Musatov, and even frescoes and icons of Andrei Rublyov that under magic fingers of the master became living and breathing.",
         "Just watched this Russian film that's nominated for an Academy Award for Best Animated Short of 2007. Moya lyubov (My Love) seems to be an oil painting come to life that tells the story of a young man's infatuation with two women: one that's dark-haired who seems so far away from him to have any contact with and one who's blond in pigtails who is very close in proximity and seems to have a very good interest in him. Since I saw this on YouTube as linked from Cartoon Brew in the native country's language with no subtitles, I couldn't completely understand what was going on but many of the painting-like movements presented such a visual dream-like state to the proceedings that I was mesmerized just the same. Very worthy of the Oscar nomination so I wouldn't mind if it won but I saw two others of the nominated that were interesting in their own way so here's to them all.",
         "impressionist art. delicate theme. Alexandr Petrov science to explore each nuance in admirable manner. and his unique animation. it is more than a movie. maybe an experience. a beautiful, useful, almost magic one. because more than a film about love, dreams, expectations and grow -up, it is the film about a special age. and the delicacy to explore it does it real great show. it is a film about subtle nuances of an experience and the chance to discover an live the magic of life. a superb movie for the grace of image, for the science to reflect the magic of a delicate episode of life. the story of the young Anton is universal. the talent of director is to transform it in personal experience for each spectator in a splendid manner.",
         "Aleksandr Petrov has been nominated for three Oscars for Best Animated Short Film and also won the Award for THE OLD MAN AND THE SEA. While only winning 1 of the 4 times he was up for the award, he easily could have won every time, as his artwork is so unique and transcendent--making the films less as cartoons and more like gorgeous works of art. Sadly, there's almost no information about this important artist on IMDb--and this probably reflects the gap between the East and West. Like all of his films, it is long (for a short) and tells a very complex story in vivid colors and textures. If you've never seen one of Petrov's films before, you'll find yourself transfixed. As for me, it's the fourth one I've seen and so some of the newness has worn off--but it's still amazing and I'll be pulling for him at the award ceremony next month. UPDATE---This is the day before the Oscars are announced for 2008 and I just got back from a special screening by our local film society of all five films nominated in the category of Best Animated Short Film. \"Moya lyubov\" was even prettier on the big screen and of the five nominees it was definitely the most artistic, though I enjoyed watching \"Même les pigeons vont au paradis\" more. Petrov's film is great and is a pretty good bet for the Oscar. However, it's biggest weaknesses are the plot (which is very unconventional) and the fact that Petrov is a perennial nominee. I think it's definitely between these two films and if I were voting, I'd give the nod to \"Même les pigeons vont au paradis\" though either one is quite deserving. My advice is regardless of the outcome, see them both. ONE FINAL UPDATE--2/24/08--The Oscar was just announced and the winner in this category was PETER & THE WOLF. It just goes to show what I know!!",
         "This is an animated short by Aleksandr Petrov using the technique of paint-on-glass, where the image is painted directly on sheets of glass. There will be spoilers ahead: This is an adaptation of a work by Ivan Shmelyov, A Love Story. It's the story of a 16 year old boy, the son of a wealthy family, studying for his exams and wrestling with puppy love, which has hit him twice at once, first with Pasha, the family's maid and then the mysterious woman living nearby. Though his interest in the maid is largely returned, his interest in the other older woman has a more uneven pattern to it. Both loves are ultimately doomed and not just because he's 16. Sons of wealth marrying the family maid was all but unheard of at that time and place, for one thing. As for his other interest, she has a past and a reputation, along with a complicated present. The plot is interesting, but unless you can find something with subtitles or speak Russian, the plot is hard to follow. Subtitled copies can be found, but the animation itself is so breathtaking that one can appreciate this for the visuals alone. I've been fortunate enough to see this with English subtitles. There's angst, tragedy, laughter and joy throughout and it's very well crafted. This can be seen online and is most highly recommended.",
         "it is a great travel. across a feeling. across the images of a lost Russia. it is an admirable work. for the details, for the dialogue and for the magnificent art to reflect states out of words. it is a masterpiece and this is not a real surprise from Aleksandr Petrov. the special thing is the emotions after the end of film. as a ball of tenderness and seductive secret and childish - clear feeling. from a long time ago, for me, the films of Petrov are a sort of gifts of the Christmas Eve. but my love is more. maybe because I am East European. or for Slavic origins. it is a form of rehabilitation of a Golden Age using the perfect tools. and the result is more, real more than you expect.",
         "This is a Russian animated short film that runs for slightly under half an hour and was made by Aleksandr Petrov almost 10 years ago, so far his last work of a director. Petrov has been pretty successful with the Academy. He made 6 animated films. 4 of them got an Academy Award nomination and one of these got the win, all in the animated short film category. However, this one here did not win and I am not really mad about it. The animation style I am not the biggest fan of, although it's okay and not the biggest weakness of the film. The biggest weakness may be that it just throws crucial story points out there and does not properly elaborate on these, such as the artificial eye or the man that the young woman is supposed to marry. Or even the general idea of a teenage boy with 2 love interests, which is a good one, but I felt they did not really make the most of this premise. I am not sure if that is Petrov's fault or the fault of Ivan Shmelyov. The latter, by the way is credited as being responsible for the screenplay, which is not true. He wrote the piece that this is based on, but was long dead when Petrov made this one here. Maybe it helps to understand this short film if you have read Shmelyov's work, but this should not be a requirement. All in all, not recommended."
      ],
      "genres": [
         "Animation",
         "Short",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Dago Productions",
         "Dentsu"
      ],
      "summaries": ["In nineteenth-century Russia, a teenage boy in search of love is drawn to two very different women."],
      "budget": 0
   },
   "movielensId": 134095,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "2006-08-27",
      "dvdReleaseDate": null,
      "directors": ["Aleksandr Petrov"],
      "runtime": 26,
      "movieId": 134095,
      "title": "My Love",
      "mpaa": null,
      "actors": [
         "Aleksandr Palamishev",
         "Aleksandra Zhivova",
         "Evgeniya Kryukova"
      ],
      "imdbMovieId": "0874952",
      "originalTitle": "Моя любовь",
      "genres": [
         "Animation",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In nineteenth-century Russia, a teenage boy in search of love is drawn to two very different women.",
      "tmdbMovieId": 104522,
      "avgRating": 3.80357,
      "releaseYear": "2006",
      "numRatings": 28,
      "posterPath": "/fbtVvZi95LEUsB7cWQBS40OnoDG.jpg"
   }
}