{
   "tmdb": {
      "original_language": "ru",
      "keywords": [
         {
            "name": "faith",
            "id": 6150
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "fate",
            "id": 10855
         }
      ],
      "imdb_id": "tt0065671",
      "video": false,
      "title": "Uncle Vanya",
      "recommendations": [],
      "backdrop_path": "/brDCH5IFiJ3LqyuPCIOfL0cAdap.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "",
               "gender": 2,
               "credit_id": "5890521192514103e80039a6",
               "name": "Innokentiy Smoktunovskiy",
               "profile_path": "/v2SZCr0QLYU9kYrkEIZqXFVaiRf.jpg",
               "id": 1119000,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "589051eec3a3687020003851",
               "name": "Sergey Bondarchuk",
               "profile_path": "/4uUlgQPFR5i6HsNHQrXz4kQXaMs.jpg",
               "id": 38131,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "589051f5c3a3687010003898",
               "name": "Irina Kupchenko",
               "profile_path": "/58Lp1GKURXxQF61mWBCwKSOxn4A.jpg",
               "id": 99287,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "5890520392514103ec0039cb",
               "name": "Irina Miroshnichenko",
               "profile_path": "/xf6lBELiXtSVWFnTc3ZuIzZIsuN.jpg",
               "id": 239719,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "5890521f92514103f000399e",
               "name": "Vladimir Zeldin",
               "profile_path": "/ngNATlca0fRHf25YbqVaaPZ2L6x.jpg",
               "id": 47436,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "589051e3c3a3687017003c59",
               "name": "Irina Anisimova-Wulf",
               "profile_path": null,
               "id": 1747886,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "5890520a92514103ec0039d4",
               "name": "Nikolai Pastukhov",
               "profile_path": "/dnZ14an2yUpyuxAtG93H65fc1tA.jpg",
               "id": 586221,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "589051fdc3a368700d00394c",
               "name": "Yekaterina Mazurova",
               "profile_path": null,
               "id": 929561,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "5890521892514103e80039ab",
               "name": "Vladimir Udalov",
               "profile_path": null,
               "id": 1747887,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "59035e9c92514177f40004be",
               "name": "Kapitolina Ilyenko",
               "profile_path": null,
               "id": 1121912,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b1b9251416c750f8663",
               "name": "Andrei Konchalovsky",
               "profile_path": "/6RzqNCx3ZaFCrVN7cfpB0trhdEQ.jpg",
               "id": 58728,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54dd3b32c3a368455800046c",
               "name": "Georgi Rerberg",
               "profile_path": "/mYz3e5E32fdZaxYL4MIdTHtM8tS.jpg",
               "id": 55518,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5903600192514178040005b5",
               "name": "Andrei Konchalovsky",
               "profile_path": "/6RzqNCx3ZaFCrVN7cfpB0trhdEQ.jpg",
               "id": 58728,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59035eccc3a3683bb800045b",
               "name": "Evgeniy Guslinskiy",
               "profile_path": null,
               "id": 1584738,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59035f3d92514177ee0004ea",
               "name": "Nikolay Dvigubskiy",
               "profile_path": null,
               "id": 1398680,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59035f5bc3a3683bfe0004fd",
               "name": "Alfred Schnittke",
               "profile_path": null,
               "id": 1092911,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59035fcbc3a3683bb80004f1",
               "name": "Grigori Korenblyum",
               "profile_path": null,
               "id": 1806052,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "59a5c2b29251412f580112a9",
               "name": "Anton Chekhov",
               "profile_path": null,
               "id": 109469,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.612506,
      "production_countries": [{
         "iso_3166_1": "RU",
         "name": "Russia"
      }],
      "id": 143887,
      "vote_count": 3,
      "budget": 0,
      "overview": "Andrei Konchalovsky’s Uncle Vanya surely has the greatest claim as the best screen adaptation of a Chekhov play. Featuring brooding and articulate performances, especially from Sergei Bondarchuk as Doctor Astrov and gorgeous cinematography that shifts from sepia to autumnal colours, the film has an elegaic and bittersweet atmosphere. The setting is a crumbling country estate which supports the chic urban lifestyle of the elderly Professor Serebryakov who visits with his young and glamorous new wife, Elena.",
      "similar": [
         24420,
         1024,
         1259,
         1643,
         17612,
         1903,
         38050,
         50546,
         46705,
         13,
         38,
         86331,
         19913,
         272693,
         627,
         979,
         276,
         332872,
         9962,
         290762
      ],
      "original_title": "Дядя Ваня",
      "runtime": 104,
      "poster_path": "/d0ygVPvDRsh0o0WCF3ZU7Ye8ZIc.jpg",
      "spoken_languages": [{
         "name": "Pусский",
         "iso_639_1": "ru"
      }],
      "production_companies": [{
         "logo_path": "/jmvVH9ULXPQ9MvBfeGc0sJj9xLt.png",
         "name": "Mosfilm",
         "id": 5120,
         "origin_country": ""
      }],
      "release_date": "1970-12-29",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Soviet Union",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Andrey Konchalovskiy"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Anton Chekhov",
         "Andrey Konchalovskiy"
      ],
      "originalLanguage": "Russian",
      "imdbLink": "http://www.imdb.com/title/tt0065671/",
      "coverLink": null,
      "actors": [
         "Irina Anisimova-Wulf",
         "Sergey Bondarchuk",
         "Irina Kupchenko"
      ],
      "reviews": [
         "Andrei Konhcalovsky sets a beautiful and nostalgic mood for this classic Russian text. An ode to the decadence and laziness of the dying Russian gentry, the film is appropriately staged in a large run-down house in the country. There is a palpable feeling of decay not only in the dialogue and the characters, but also in the peeling paint, the washed out colors that the camera picks up, the dim lighting, and the dirty clothes that the characters wear. The actors are quite loyal to the subtlety that Chekhov demands for his characters emotions. They avoid melodrama, but at the same time do not leave the audience feeling oblique and distanced as is often the case with adaptations of Chekhov. This film is a must see for any admirer of Chekhov, and is also a pivotal film in the history of modern Russian/Soviet cinema. Apart from that it should be required viewing for any one interested in the sincere portrayal of very difficult emotions in cinema. Although formalistically different, it ranks with the best work of Andrei Tarkovsky or Ingmar Bergman.",
         "I remember seeing this film in 1973 at the Royal Theater in L.A. I traveled for two hours on a bus to see it, and two hours to return home, and I never regretted the time spent. Bondarchuk as Astrov was brilliant, and the diluted Mosfilm color--which emphasized browns, reds, and golds--was perfect. I think this movie captures autumn better than any motion picture. Unlike the English language versions of the play, this one also emphasizes how the environment affects the characters. I dearly wish it would get released on either video or DVD. It's easily the best version of Chekhov's play---maybe the best film version of any of his plays.",
         "An inspired transposition of the play by Chekov, it is difficult to imagine it being ever excelled; everything seems right, natural, credible, allowing one to concentrate on the inner drama of the characters. A masterpiece of discreet eloquence which ought to be better known.",
         "the director makes it impossible not to be melancholic..one scene sonya says that forest and the climate together change the way that people behave.. how could she know that sorrow never changes? and justice is not for all in any climate? i want you to pay attention what happens after the woman comes and leaves.. not only the faces but the camera gives the feeling. i strongly recommend you to watch 2 times if you haven't done yet..",
         "I think this film completely misses the point of Chekhov's play. The melancholy arises entirely from unpleasant dripping, dirty surroundings and is maybe extended by the fact that the characters are all in deep depression and act somewhat hysterical. It doesn't work and think towards its heart-wrenchingly melancholy conclusion, but is simply gloomy the whole way through. It makes a good art-house film, but with the legendary actors and script it had to work with, it could have been so much more. The actors seem bored stiff. Even actor-legend Smoktunovsky seems to miss the point and falls back on playing anger and hysteria. There is never any moment to contrast the the gloomy mood, there isn't enough tension between hope and despair, its just monotonous. This isn't a bad film, and I'm sure the cinematography is very professional and important, but Uncle Vanya isn't about colors and dripping roofs and dirty surroundings, its about the people. And for some reason, Konchalovsky ignored all the fantastic language and acting potential he had to work with and focused instead on giving the film a depressing autumn color scheme.",
         "It's only now after having seen Innokentiy Smoktunovskiy in a couple of roles already that I'm coming to understand why he earned such an extraordinary reputation as an actor. He really seems like an entirely differently person when he appears in another role. And his performance as the titular Uncle Vanya here is exemplary -- very human while despairing and desperate. He somehow makes it feel like a quiet performance, despite Ivan's rage. This is decidedly not just a production of Shakespeare's play, but an adaptation. But much of its success lies in the fact that it harnesses the better elements both of the cinematic and theatrical media. The set and costumes are incredibly evocative, and communicate much through their often weather-beaten and long-lived-in appearance. And fortunately the filmmakers avoid the temptation to broaden the adaptation outside the house -- so we experience the claustrophobic tension and dramatic unity that a stage production would carry with it. Above all, there is no fear of silence here -- and the appropriate silences between Chekhov's words are far from wasted time, but fill themselves with the tension or anguish of the characters and often with innumerable little visual touches on the part of the director or actors. There's a palpable stillness here that mirrors the static and futile nature that Ivan feels characterizes his life, and that makes it very effective. This is decidedly a version of Uncle Vanya -- which means it knows that a definitive film isn't possible. But it's one that does a lot of honor to Chekhov's work, and it well worth it for a set of excellent performances.",
         "for the admirers of Chekhov, the film has a great sin - it is far to be the most inspired adaptation of the play. for the fans of Konchalovsky is simple - the entire art of the director to use as instrument of his vision the universe of Anton Pavlovich is present. in fact, the verdict of both groups is correct. this Dyadya Vanya is one of the most representative works of its director. but it preserves the spirit of play with graceful force. with simple nuance - the objects and the characters are pieces of the same artistic speech. the details are covers of words. the feelings of characters are exposed by image more by dialogues. the atmosphere becomes, scene by scene, more important than the story itself. and that impose, for each actor, to use new solutions to define his character among shadows, things, suggested cold emotions . and each of them does an admirable job. film of atmosphere, exercise to define the Russian soul, it remains an artistic gem.",
         "a splendid movie. not exactly as inspired adaptation or great cast. but for the role of vehicle in middle of a lost world. each nuance of Chekov play has perfect illustration. each detail becomes line of a viewer state of emotion. it is a precise work. and if the performance of Bondarchuk or Smoktunovsky can not be a surprise, the levels of acting discovers not only a story but the roots of a Russian manner to see the others. it is an impeccable Chekov and little more. the sepia images, the angle of camera, the decor, all are perfect pieces for a large puzzle. one of remarkable films who are the public as part of them. the air, the words, the atmosphere, the furniture. all as crumbs from a hided form of resistance against the reality."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Mosfilm"],
      "summaries": ["A retired professor has returned to his estate to live with his beautiful young wife, Yelena. The estate originally belonged to his first wife, now deceased; her mother and brother still live there and manage the farm. For many years the brother (Uncle Vanya) has sent the farm's proceeds to the professor, while receiving only a small salary himself. Sonya, the professor's daughter, who is about the same age as his new wife, also lives on the estate. The professor is pompous, vain, and irritable. He calls the doctor (Astrov) to treat his gout, only to send him away without seeing him. Astrov is an experienced physician who performs his job conscientiously, but has lost all idealism and spends much of his time drinking. The presence of Yelena introduces a bit of sexual tension into the household. Astrov and Uncle Vanya both fall in love with Yelena; she spurns them both. Meanwhile, Sonya is in love with Astrov, who fails even to notice her. Finally, when the professor announces he wants to sell the estate, Vanya, whose admiration for the man died with his sister, tries to kill him."],
      "budget": 0
   },
   "movielensId": 134075,
   "movielens": {
      "languages": ["Pусский"],
      "releaseDate": "1970-12-29",
      "dvdReleaseDate": null,
      "directors": ["Andrei Konchalovsky"],
      "runtime": 104,
      "movieId": 134075,
      "title": "Uncle Vanya",
      "mpaa": null,
      "actors": [
         "Innokentiy Smoktunovskiy",
         "Sergey Bondarchuk",
         "Irina Kupchenko",
         "Irina Miroshnichenko",
         "Vladimir Zeldin",
         "Irina Anisimova-Wulf",
         "Nikolai Pastukhov",
         "Yekaterina Mazurova",
         "Vladimir Udalov",
         "Kapitolina Ilyenko"
      ],
      "imdbMovieId": "0065671",
      "originalTitle": "Дядя Ваня",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Andrei Konchalovsky’s Uncle Vanya surely has the greatest claim as the best screen adaptation of a Chekhov play. Featuring brooding and articulate performances, especially from Sergei Bondarchuk as Doctor Astrov and gorgeous cinematography that shifts from sepia to autumnal colours, the film has an elegaic and bittersweet atmosphere. The setting is a crumbling country estate which supports the chic urban lifestyle of the elderly Professor Serebryakov who visits with his young and glamorous new wife, Elena.",
      "tmdbMovieId": 143887,
      "avgRating": 3.25,
      "releaseYear": "1970",
      "numRatings": 2,
      "posterPath": "/d0ygVPvDRsh0o0WCF3ZU7Ye8ZIc.jpg"
   }
}