{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "james bond spoof",
            "id": 15267
         }
      ],
      "imdb_id": "tt0079362",
      "video": false,
      "title": "Jaguar Lives!",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jonathan Cross / Jaguar",
               "gender": 2,
               "credit_id": "52fe494e9251416c910a9113",
               "name": "Joe Lewis",
               "profile_path": null,
               "id": 932373,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Adam Caine",
               "gender": 2,
               "credit_id": "52fe494e9251416c910a9117",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "General Villanova",
               "gender": 2,
               "credit_id": "52fe494e9251416c910a911b",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Anna Thompson",
               "gender": 1,
               "credit_id": "52fe494e9251416c910a911f",
               "name": "Barbara Bach",
               "profile_path": "/EYYNEUN0CmLDto4cDEesM7pS4V.jpg",
               "id": 10458,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Zina Vanacore",
               "gender": 1,
               "credit_id": "52fe494e9251416c910a9123",
               "name": "Capucine",
               "profile_path": "/pGzEiXMc77pxXwhiH4j0vdb20IO.jpg",
               "id": 14262,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ben Ashir",
               "gender": 2,
               "credit_id": "52fe494e9251416c910a9127",
               "name": "Joseph Wiseman",
               "profile_path": "/dh5BTlenUZIMHT7WwT0nGxvrPhx.jpg",
               "id": 9872,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Sensei",
               "gender": 2,
               "credit_id": "52fe494e9251416c910a912b",
               "name": "Woody Strode",
               "profile_path": "/hL6mQBnCxBxhUeG5rjx9SfO7AXM.jpg",
               "id": 4963,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Ralph Richards",
               "gender": 2,
               "credit_id": "52fe494e9251416c910a912f",
               "name": "John Huston",
               "profile_path": "/1YV2m0943zGmgQaHHgtFuQhOEKl.jpg",
               "id": 6593,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Ahmed",
               "gender": 0,
               "credit_id": "5464fd3ec3a36804b40022c6",
               "name": "Gabriel Melgar",
               "profile_path": null,
               "id": 1385262,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bret Barrett",
               "gender": 2,
               "credit_id": "5464fd530e0a26294f0024d7",
               "name": "Anthony De Longis",
               "profile_path": "/iYPnSvLkDxo9jbNFBch0IdbZkav.jpg",
               "id": 52903,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Terry",
               "gender": 0,
               "credit_id": "5464fd62c3a36804ac00246d",
               "name": "Sally Faulkner",
               "profile_path": null,
               "id": 107242,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Consuela",
               "gender": 0,
               "credit_id": "5464fd8ec3a36804c5002503",
               "name": "Gail Grainger",
               "profile_path": null,
               "id": 1230383,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe494e9251416c910a9109",
               "name": "Ernest Pintoff",
               "profile_path": null,
               "id": 127333,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe494e9251416c910a910f",
               "name": "Yabo Yablonsky",
               "profile_path": null,
               "id": 140166,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.97887,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 85602,
      "vote_count": 4,
      "budget": 0,
      "overview": "The world's newest kung fu legend, Joe Lewis, takes on evil gangsters and saves the world.",
      "similar": [
         11841,
         140300,
         55292,
         9053,
         233361,
         9461,
         44865,
         20811,
         11770,
         146,
         605,
         604,
         9502,
         24,
         682,
         7549,
         862,
         818,
         2024,
         27582
      ],
      "original_title": "Jaguar Lives!",
      "runtime": 90,
      "poster_path": "/14vOpIC3U0baPt8jy75wSbdFm02.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Films Internacionales (FISA)",
            "id": 78973,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jaguar Productions",
            "id": 15606,
            "origin_country": ""
         }
      ],
      "release_date": "1979-08-09",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ernest Pintoff"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Yabo Yablonsky"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079362/",
      "coverLink": null,
      "actors": [
         "Joe Lewis",
         "Christopher Lee",
         "Donald Pleasence"
      ],
      "reviews": [
         "This flick has one of the most incredible casts ever assembled for a B-movie! You've got Christopher Lee, Donald Pleasence (fresh from \"Halloween\"), Barbara Bach (former Bond Girl), Woody Strode (those who've seen \"Spartacus\" aren't likely to have forgotten him), Capucine (Inspector Clouseau's wife in \"Pink Panther\"), even the legendary director John Huston (not his first useless supporting role; remember \"Tentacles\"?). Unfortunately, none of those performers get a chance to stand out and do anything memorable, the story is confusing (although the main villain's \"hidden\" identity is easy to guess) and karate expert Lewis, who stars, knows all the right moves but has little acting charisma. (*1/2)",
         "During a mission a secret agent called Jaguar loses his partner in a explosion. So after the disaster he goes back to his sensei to continue his training. But after a while he is called back on a mission involving that of a international drug dealer that might have had a hand in his friend / partner's death. This leads Jaguar on a whirlwind trip across the glob, where he encounters many foes before he confronts his main man. I wasn't expecting too much, but I was pleasantly surprised in what I got from this b-grade romp. It's your typical textbook James Bond adventure with the agent travelling around the world to many exotic locations, gathering information on a villain he's tracking down. But our secret agent here Jonathan Cross - Code name Jaguar; has a speciality in martial arts, which he demonstrates on those who get in his way. While, the big scale production and story shares some familiarity to a Bond film, also the stars play a high influence to that factor. You got Christopher Lee, Donald Pleasence, Joseph Wiseman and Barbara Bach making up the cast with some nifty performances. Ironically, they themselves have starred in a Bond film. It's just too bad that they have very little to do here with their meagre roles. Other notables making up the well-known cast include Woody Strode, Capucine, John Huston, Anthony De Longis and an enticing Sally Faulkner in some sexy lingerie. Man, just looking at the names - it should have been a blinder. Kickboxing expert Joe Lewis as Jaguar delivers the goods in the moves, but his overall acting performance is rather wooden. In the end the cast like this is simply wasted. \"Jaguar Lives\" at times is an exciting escapism story that's filled with some cartoon like characters and a sizzling verve of precise and intense action scenes. The rollicking martial art scenes seem to feed off the story rather then being just senseless mayhem. Well, that might be a plus, but sometimes there was just too much talk where there could have been some vigorous activity. But when the action did kick in, the tempo was staged with supreme skill and impressive set pieces - just like the fitting climax battle. The jam-packed story which the film follows real closely is an convoluted mess with many illogical steps, but it's basically working itself up to the final confrontation. And when it came to providing us the main villain's identity, it shouldn't be much of a surprise to anyone. I found it to get incredibly better and more intriguing the further along it went. The script is terribly blunt and quite forced, although there's an ample amount of wit found throughout (even though it doesn't always come off). Since the agent travels high and low that means there's quite a change of scenery with some astonishing locations and the sublime photography is professionally set-up with many creative and brisk manoeuvring shots. The fruitful score is an energy charged belter that gives out that groovy 70s twang in neat short pockets. At best a cheesy time-waster that's filled with a mish-mash of ideas and comic book heroics within it's martial arts background.",
         "Legendary heavyweight kickboxing champion Joe Lewis kicks off his mysteriously brief movie career with this globe trotting martial arts actioner in which he assumes the eponymous role of The Jaguar, a sort of James Bond type agent sans the gadgets (other than his lethal fists and feet) The first thing that becomes immediately apparent whilst watching, is that a large amount of money was put into this judging by the multiple foreign locations and some of the incredible cast that has been assembled here. Such cinematic luminaries as John Huston, Christopher Lee, Donald Pleasance and Woody Strode all put in appearances! (albeit briefly) Also along for the ride is the familiar and welcome face of Anthony De Longis as Jaguar's friend and fellow agent. All well and good so far then.....however it has to be said that for what is ostensibly an action movie, there is in fact far too little action on offer here. The majority of the films running time is taken with our hero jet setting from one beautiful location to another searching for clues as to the identity of an international drug dealer who in a somewhat lame and predictable twist at the end is revealed to be.....well I won't say it here. Still, despite the above criticism the action sequences when they do arrive, turn out to be very exciting indeed. The final climatic fight especially, set atop the scenic splendour of an old castle, between Jaguar and his nemesis is very exciting and well handled. It's rather sad that other than a tiny handful of other films, Lewis never further pursued his movie career. From the evidence here, although obviously not trained as an actor he nonetheless possessed a rather powerful on screen presence in much the same manner as the likes of the late great Charles Bronson. Overall then, the film is certainly worth a watch for fans of martial arts, not least of all to see a genuine kickboxing legend in action, although it has to be said that it could have been so much better with less of the excessive talking and a bit more of the said action.",
         "Unexplainible Plot , with some extremly wooden acting and one of the most severe examples of continuity where the Jaguar fights the baddie at the end and in one scene change it changes from a pitch black night to brilliant sunshine . It would also seem that the film has some of the worst sound editing I have ever seen .",
         "\"Jaguar Lives\" is very slow and plodding entertainment, despite a tip-top cast being associated. The action (well that's when it gets around to it) is too little and unexciting martial arts... because we have to wait through long dry spells of talk. The climax battle is the only thing worth waiting around for. Not helping is that the twists in the story are plain easy to pick up on and it doesn't make too much sense. Wow, just look at the names! The main reason I decided to give it a look. The likes of Christopher Lee, Donald Pleasence and Barbara Bach are simply wasted, and Joe Lewis is just too deadpan in the lead role. Fun this is not. No wonder why it's not too well known, as it's largely dismissible.",
         "I actually couldn't care less about lame Kung-Fu movies; however I am strangely fascinated by insignificant B-movies that assemble impressive ensemble casts even though everything else about it absolutely sucks. \"Jaguar Lives!\" is a terrific example of this, if there ever was one. This is without a doubt one of the dumbest, most redundant, most intolerable and dullest flicks ever made, but would you look at that cast! The titular hero is a total nobody – and remained a total nobody even though this dud was supposed to launch his acting career – but would you just take a look at the names surrounding him! It's like an unofficial James Bond reunion where only the coolest people received an invitation: Christopher Lee, Donald Pleasance, the stunningly beautiful Barbara Bach, Joseph Wiseman and – just for fun's sake – Woody Strode and John Huston. The issue, however, is that all these great people only appear for a mere couple of minutes and I bet all my money that none of them had a clue what this movie was about. The whole thing is just a dire excuse to showcase Joe Lewis' admittedly smooth Kung-Fu moves (watch him kick two naughty villains off their bikes at once in impressive slow-motion) and to travel around the most dreamy exotic locations in the world to tell an inexistent story about an international drug network. Moreover, the identity of the criminal mastermind is so goddamn obvious straight from the beginning that the attempts to hide his face or cover up the sound of his voice are downright hilarious. Donald Pleasance clearly had a fun day depicting a cartoonesque South American dictator, but the rest of them are just performing on automatic pilot and appear to be clinically dead. The explosions and car crashes look incredibly amateurish and Ernest Pintoff's direction is as uninspired as can be. Somehow this turkey received a beautiful and luxurious DVD-release even though it hardly deserves such a treatment. There are far better contemporary cult flicks out there that sadly remain stuck in obscurity. But hey, if you want to have a good laugh or wish to pointlessly kill off a couple of your brain cells, you can't go wrong with \"Jaguar Lives!\"",
         "Lay the blame for this one where it belongs: with the filmmakers. In his first at-bat as a movie star, Joe Lewis shows glimpses of some genuine acting ability. Unfortunately, director Pintoff (whose resume, I see here, reads like a season by season who's who of forgettable television shows) wasn't up to the task. JAGUAR LIVES! looks and feels more like a travelogue than anything else, with establishing shots of internationally famous landmarks and reel after reeling reel of home-movie style sequences that add up to nothing at all in the end. Allow me to belabor this point: Lewis, the first full contact heavyweight karate champion of the world, apparently took his acting lessons as seriously as he does his martial arts- and it shows (again, briefly, in glimpses). I remember liking his next film, FORCE: FIVE, better than this one, but I've been unable to find a copy of it (this one I found at Netflix). Lewis fared no better than in JAGUAR LIVES! in DEATH CAGE- but, even there, he demonstrated some acting ability. That his career wasn't handled better by those entrusted with it is nothing less than a crying shame.",
         "To sum up the plot of Jaguar Lives! in a couple of sentences \u0096 Jaguar is a secret agent with a mission that takes him around the world to locate and bust-up up a large-scale heroin ring. If along the way he's able to find out who killed his former partner, so much the better. Joe Lewis (1979 World Karate Champion) is Jaguar. While his acting may be a bit stiff, his moves certainly aren't. The man knows how to throw a kick. He's joined by one of the most amazing casts for a nothing movie like this that I've ever seen \u0096 Christopher Lee, Donald Pleasence, Barbara Bach, Woody Strode, Joseph Wiserman, John Huston, and Capucine all lend their varied talents to the film. None has very much to do or much screen time, but Pleasence makes the most of his role as a South American dictator. Unfortunately, none of these actors is able to save Jaguar Lives! from mediocrity. The plot is pretty much a muddled mess, relying on set-pieces featuring fights to move the plot along. The big reveal of the head bad guy at the end of the movie shouldn't surprise anyone who's been paying the slightest bit of attention. And Lewis just doesn't have what it takes to hold the movie together. So, while I'm impressed with the supporting cast and the money spent shooting in exotic locations around the world, Jaguar Lives! just isn't all that good. With all that being said, I'm a bit shocked to see that Joe Lewis didn't many more movies. Sure, his acting may have been lacking, but people with similar acting ability but with only half of Lewis' martial arts ability were churning out movies in the 80s.",
         "I had first recorded this off late-night Italian TV but, thankfully, had not yet checked the movie out before it turned up in English: a vague James Bond rip-off in which the protagonist (one Joe Lewis) happens to be a martial arts expert – for the record, the two styles had already clashed, far more successfully, in Bruce Lee's last-completed and best vehicle i.e. ENTER THE DRAGON (1973). Even if the producers of this one were wily enough to recruit a roster of co-stars – no fewer than 5 of whom had appeared in previous Bond extravaganzas (Barbara Bach, John Huston, Christopher Lee, Donald Pleasence and Joseph Wiseman)! – the result is, while not boring, hardly thrilling, in spite their being practically no let-up to the action!! Incidentally, much is made of the mysterious identity of the chief villain (at least, they had the good sense to not cast an established actor in the role – who would have invariably blown the hero out of the water in that department!) when the pre-credits sequence gives this away all-too-plainly!! Lewis' \"sensei\" is Woody Strode and, among his adversaries, is Capucine (who, having failed to dispatch the \"Jaguar\" herself, later calls on Lee and insists to be informed when this is finally accomplished!); the latter, however, displays an admirable code of ethics when he lets Lewis go after he has repeatedly defeated his goons inside a Japanese cemetery! Wiseman plays blind and Huston (amusingly, his character is named Ralph Richards!) wheelchair-bound, so that only Pleasence has fun as the self-appointed but – inevitably – cowardly dictator of a banana republic. As I said, the action highlights (personally choreographed by the leading man) are not exactly ground-breaking and too often merely silly – at one point, he takes on a gang of motorcycle thugs, not to mention the various minions at a factory, whom he overcomes not via his usual karate moves but by throwing every kind of accessory which comes his way at any approaching assailant!; then again, it must be pointed out that director Pintoff had started out in animation. The film, at the very least looks good – helped in no small measure by the globe-trotting nature of the plot – but, atypically, Lewis proves oddly resistant to female company (save for ex-colleague Sally Faulkner, who has improbably forsaken espionage for a nun's habit!). The concluding moments show the protagonist once again having his training sessions interrupted by the arrival of agent Bach\u0085but, unsurprisingly, no sequel ever surfaced (or was likely ever commissioned, though the star would in fact return to the big screen for FORCE: FIVE {1981}, directed by ENTER THE DRAGON's own Robert Clouse!)."
      ],
      "genres": ["Action"],
      "productionCompanies": [
         "Jaguar Productions (V)",
         "Films Internacionales (FISA)"
      ],
      "summaries": ["A world's new kung-fu hero (Joe Lewis) is out to stop drug dealers, gangs and help save the world from an evil con (Christopher Lee)."],
      "budget": 0
   },
   "movielensId": 134282,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-08-09",
      "dvdReleaseDate": null,
      "directors": ["Ernest Pintoff"],
      "runtime": 90,
      "movieId": 134282,
      "title": "Jaguar Lives!",
      "mpaa": "",
      "actors": [
         "Joe Lewis",
         "Christopher Lee",
         "Donald Pleasence",
         "Barbara Bach",
         "Capucine",
         "Joseph Wiseman",
         "Woody Strode",
         "John Huston",
         "Gabriel Melgar",
         "Anthony De Longis",
         "Sally Faulkner",
         "Gail Grainger"
      ],
      "imdbMovieId": "0079362",
      "originalTitle": "Jaguar Lives!",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["7HwsoqPzkVU"],
      "plotSummary": "The world's newest kung fu legend, Joe Lewis, takes on evil gangsters and saves the world.",
      "tmdbMovieId": 85602,
      "avgRating": 1.5,
      "releaseYear": "1979",
      "numRatings": 1,
      "posterPath": "/14vOpIC3U0baPt8jy75wSbdFm02.jpg"
   }
}