{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "conspiracy theory",
         "id": 11208
      }],
      "imdb_id": "tt0093120",
      "video": false,
      "title": "Ground Zero",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Harvey Denton",
               "gender": 2,
               "credit_id": "52fe4a82c3a368484e15769f",
               "name": "Colin Friels",
               "profile_path": "/tXKCpTwCs4TZYdQ6p5Kch7sRkkS.jpg",
               "id": 27753,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Trebilcock",
               "gender": 2,
               "credit_id": "52fe4a82c3a368484e1576a3",
               "name": "Jack Thompson",
               "profile_path": "/l2NNfs9bd6qxqzIOahcz2hErrq8.jpg",
               "id": 12536,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Prosper Gaffney",
               "gender": 2,
               "credit_id": "52fe4a82c3a368484e1576a7",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Pat Denton",
               "gender": 0,
               "credit_id": "52fe4a82c3a368484e1576ab",
               "name": "Natalie Bate",
               "profile_path": null,
               "id": 187031,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Charlie",
               "gender": 0,
               "credit_id": "52fe4a82c3a368484e1576af",
               "name": "Burnham Burnham",
               "profile_path": null,
               "id": 1076594,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Commission president",
               "gender": 0,
               "credit_id": "52fe4a82c3a368484e1576b3",
               "name": "Simon Chilvers",
               "profile_path": null,
               "id": 207826,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Hooking",
               "gender": 0,
               "credit_id": "52fe4a82c3a368484e1576b7",
               "name": "Neil Fitzpatrick",
               "profile_path": null,
               "id": 160224,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Walemari",
               "gender": 2,
               "credit_id": "59a47067c3a3680ac7002b2b",
               "name": "Bob Maza",
               "profile_path": null,
               "id": 538691,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Ballantyne, Australian veteran",
               "gender": 2,
               "credit_id": "59a4707292514139a7002b5d",
               "name": "Peter Cummins",
               "profile_path": null,
               "id": 76186,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Vice-Adm. Windsor",
               "gender": 0,
               "credit_id": "59a4709b92514139a7002b88",
               "name": "Brian James",
               "profile_path": "/oOOIR3lJHbOHVdXd630aZupL9mu.jpg",
               "id": 1195489,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Vice-Adm. Windsor",
               "gender": 0,
               "credit_id": "59a470b4c3a3680a5b00250b",
               "name": "Brian James",
               "profile_path": null,
               "id": 1241850,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Meteorologist",
               "gender": 0,
               "credit_id": "59a470ccc3a3680ab50027e7",
               "name": "Bob Hornery",
               "profile_path": "/mH1PEPL51cq5hhP9ITL2M4PhNNQ.jpg",
               "id": 187134,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Commisioner #1",
               "gender": 1,
               "credit_id": "59a470df925141395500295d",
               "name": "Beverley Dunn",
               "profile_path": null,
               "id": 62745,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Commisioner #2",
               "gender": 2,
               "credit_id": "59a470ea9251413949002aea",
               "name": "Alan Hopgood",
               "profile_path": null,
               "id": 44842,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Freddy Tjapalijarri",
               "gender": 0,
               "credit_id": "59a470f89251413955002971",
               "name": "Steve Dodd",
               "profile_path": "/30pDtMIblGP1yDsFUaT5p0FJL1L.jpg",
               "id": 212562,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Aboriginal elder",
               "gender": 0,
               "credit_id": "59a47101c3a3680b12002c91",
               "name": "Alfred Austen",
               "profile_path": null,
               "id": 1878488,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a82c3a368484e157695",
               "name": "Michael Pattinson",
               "profile_path": null,
               "id": 141989,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a82c3a368484e15769b",
               "name": "Bruce Myles",
               "profile_path": null,
               "id": 187055,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59a4704d9251413950002a9d",
               "name": "Mac Gudgeon",
               "profile_path": null,
               "id": 1185064,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59a470569251413949002a40",
               "name": "Michael Pattinson",
               "profile_path": null,
               "id": 141989,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "59e05b9192514125050b0769",
               "name": "Steve Dobson",
               "profile_path": null,
               "id": 1569083,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "59e05b9a92514124c50b5d3c",
               "name": "David Pulbrook",
               "profile_path": null,
               "id": 985172,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59e05ba1c3a368624d0b0434",
               "name": "Tom Bähler",
               "profile_path": null,
               "id": 21513,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "59e05bb2925141251f0b7c4c",
               "name": "Chris Neal",
               "profile_path": null,
               "id": 1244649,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59e05bc5c3a368623e0b1983",
               "name": "Michael Pattinson",
               "profile_path": null,
               "id": 141989,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59e05bcdc3a36861ec0b4970",
               "name": "Bruce Myles",
               "profile_path": null,
               "id": 187055,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59e05bdd92514125140b8892",
               "name": "Brian Thomson",
               "profile_path": null,
               "id": 1606135,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59e05be3c3a368624d0b0458",
               "name": "Robert Dein",
               "profile_path": null,
               "id": 1606137,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.404844,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 122767,
      "vote_count": 2,
      "budget": 0,
      "overview": "A second generation cameraman in Australia finds evidence that his father had filmed a nuclear test that allowed aboriginies to be exposed to and killed by radiation. He begins a search for a secret that if true, his government has already killed people to keep quiet.",
      "similar": [
         9798,
         9772,
         11324,
         591,
         2503,
         72559,
         274855,
         177677,
         13448,
         75656,
         137094,
         290250,
         406990,
         314365,
         225574,
         117251,
         4771,
         4638,
         1576,
         13183
      ],
      "original_title": "Ground Zero",
      "runtime": 109,
      "poster_path": "/4oyT5TGDknmGJ00BxFMtuoWIW9k.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hoyts Distribution",
            "id": 14094,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "BDB",
            "id": 94300,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Burrowes Film Group",
            "id": 2847,
            "origin_country": ""
         }
      ],
      "release_date": "1987-10-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": [
         "Bruce Myles",
         "Michael Pattinson"
      ],
      "runtime": 109,
      "synopsis": null,
      "writers": [
         "Mac Gudgeon",
         "Jan Sardi"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093120/",
      "coverLink": null,
      "actors": [
         "Colin Friels",
         "Jack Thompson",
         "Donald Pleasence"
      ],
      "reviews": [
         "Superior film which is based on a real-life incident. My husband and I kept catching the end of this film on cable, arrested by the spooky music and harsh photography, and were dying to see the entire movie since just seeing the end made no sense to us. When we finally did see the entire film, we both agreed it was one of the best that we'd ever seen and we've watched it many times since. The film is set in Australia, which immediately takes it out of our American context and into an unknown place. A plane is found, still highly radioactive, buried in the desert; no one knows why but it's been there for over 30 years. There's a skeleton inside, also unknown. There is a human rights trial that runs through the entire film, which attempts to place the blame for nuclear testing within the Aboriginal lands on the Australian government, who are denying it. There are also a lot of Australian agents trying to find something that the hero's father hid long ago just before he \"drowned\"; something that would clearly show that the Australian government knew and in fact approved of the testing. Colin Friels is marvelous as the protagonist/hero; he is acted upon, but he is ultimately aware of this and begins to turn the tables. Donald Pleasance is wonderful as a handicapped war veteran who Colin goes to for help in his quest to find out what happened to his father. Donald lives in a kind of geodesic dome structure in the middle of the Australian desert, which he's decorated inside and out with his own apocalyptic paintings. Due to Donald's hints, Colin finally realizes who is behind his father's murder and he sets out across the vast Australian desert to an Aboriginal holy place. What he finds there is both an ending, as well as a possible beginning to another part of the story. It is not, however, the end or solution to this ingenious movie, and I would not reveal that for the world. It's too good to spoil here. You must rent, buy or borrow this film and watch it yourself to see exactly how the movie ends, and you won't be disappointed. It is an incredible masterpiece, and I recommend it to everyone.",
         "While Ground Zero moved rather slowly at some points, the overall tone of the feature brought out a natural suspense that was both unique and different. While we Americans get caught up in the nuclear history of our own country, this film brought about a new perspective, albeit a darker and more sinister one. Colin Friels had an exceptional performance in this movie, which few Americans seem to care about watching considering the low returns. The ending was also rather surprising, just when you felt the story had ended and everything was for naught. This is one of those forgotten eighties films that I'll be sure to remember.",
         "I'm surprised to find that this film has been seen (and appreciated) in America. It wasn't all that successful in Australia, most people felt (like me) that it was a great plot idea let down by the writing (I also found Colin Friels' performance a little flat - and I thought the film went a bit heavy on the anti-American angle). However, these reviewers don't seem to quite know the background to the film. Britain's first atom bomb was tested on Monte Bello island in the Indian Ocean in 1956, but the next series of tests were carried out at Maralinga in the South Australian desert, at the invitation of the Australian government. There was nothing secret about this, the government actually used the tests to promote itself as looking after Australia's security. Sounds very familiar! At the time the movie was made (1987), there was a big issue over the radiation levels that Australian troops had been exposed to during the tests, and the effects on their long-term health (much the same as for US troops during the Nevada tests.) There were also questions raised about how much effort had gone into evacuating the local Aborigines from the area both before and after the tests. This is the issue that forms the background to the movie, but it is really about drawing parallels between Australian subservience to Britain in the 50's and to the USA in the 80's, and just how much this is really in Australia's interest. The debate back then was over the US satellite facilities at Pine Gap, today it is over support for the war in Iraq. The movie should have been topical and relevant, then and now, but it isn't because it is done with such a heavy hand. The scene where Colin Friels and Donald Pleasance are suddenly ambushed by US troops in the middle of the Outback is just stupid. The scene where he is making the hot dog commercial is supposed to be about the domination of American culture, but it doesn't work either. The line where he is talking to the rat in his kitchen when he gets home, probably looked good on paper, but should have been cut from the movie. The final scene should be brilliant, but isn't. When Colin Friels says, 'Hey, wait a minute...' he shouldn't say anything! His face should say it all. My opinion - this film isn't great, but it could have been, which is why I found it so disappointing. Close, but no banana - damn, another Americanism!",
         "Directors Bruce Myles and Michael Pattinson have created a gem in Ground Zero. It stars Colin Friels who has been in other classic flicks, The Nostradamus Kid 1993 and Dark City 1998. Also starring is Jack Thompson who has also been in other classic flicks, Yolngu Boy 2001, Breaker Morant 1980, The Chant of Jimmie Blacksmith 1978, Mad Dog Morgan 1976, Wake in Fright 1971 and another classic nuclear bomb theme flick, Broken Arrow 1986 plus the television series Spyforce 1971-73. Also starring is Donald Pleasence who has been in other classic flicks, Phenomena 1985, Halloween 2 1981, Escape from New York 1981, Halloween 1978, The Eagle has Landed 1976, Wake in Fright with Jack Thompson and THX 1138 1971. I enjoyed the Australian outback scenes and the city set designs. If you enjoyed this as much as I did then check out other classic nuclear bomb theme flicks, Miracle Mile 1988, Threads 1984, The Peacekeeper 1987, Panic in Year Zero 1962, Failsafe 1964, The Day After 1983, Chain of Command 2000, Black Rain 1988, Dr Strangelove 1963 and Atomic Cafe 1982.",
         "An intelligent thriller is a rare thing these days, at least on the evidence of this well-intentioned but pedestrian story of nuclear paranoia and bureaucratic conspiracy, in which an innocent Australian cameraman uncovers a few radioactive skeletons in the closet of his country's atomic testing program. The Aussie government apparently has been hiding the details about native Aborigine victims of radiation fallout, but because the secret is out at the beginning of the movie there's no surprise and very little suspense: each new development in the already linear plot is introduced in sequence, with handy cues of ominous music to help viewers connect the dots. The script relies too much on convenient expository bulletins (television news broadcasts; telephone answering machine messages; home movies and so forth), and identifies too strongly with its hero, who like any unassuming TV cameraman is transformed into James Bond when under stress. A strong cast and attractive wide screen photography can't hide the wasted opportunity to expose an ugly true story and turn it into compelling fiction.",
         "Ground Zero is the Australian addition to that sub-genre of conspiracy thrillers that do not so much use some real-life national issue as the background for action as construct an action narrative to draw attention to that issue. The main issue here is the legacy of the British nuclear testing in the desert of Maralinga in the 1950s and 60s, the damage to the population and the environment left by the explosions. It allows the filmmakers to dramatise the work of the Royal Commission investigating the effects of the fallout and have the Aussies at least here give the British hard time about it (the actual settlement was only reached years later). The British also get to represent Them, the shadowy establishment chasing Friels's lone everyman who is trying to find out the truth about what his father caught on film in Maralinga. Not only haunted by the mystery of his father, Friels is also forced to be an absent father to his own son and comes across as a very Australian take on the lone conspiracy hero: for all his masculine bravado and apparent individualism he is essentially adrift and ultimately helpless to do anything except run from the overwhelming forces stacked against him. This highlights the film's second big issue, Australia's anxiety about its sovereignty, having seemingly passed from the nuclear test site of the British Empire into the southern military base and cultural satellite of the United States. Perhaps it is even the filmmakers' own anxiety about trying to make a successful Australian film fit for international consumption. \"Only accents and uniforms change\", Pleasance's half-crazed veteran not very subtly hammers home the film's cynical moral. It is Pleasance's performance, typically balanced just right between gripping and campy, and the mythical power of the locale, Australia's ever-present and definition-defying inland, that elevate the film into a kind of mystic and mythical quest for some unspeakable hidden knowledge about the unthinkable horror of the nuclear fire. While the setting is not used with such visual intensity as in, say, Razorback, it gives a haunting aura of grandeur to what is, in a more rational analysis, just a modest but well-executed paranoia thriller narrative (which includes even that staple of both left- and right-wing conspiracy narratives, the menacing black helicopter). It fulfilled both of its briefs by bringing its national issue into attention and capturing its audience even here, a world away from Maralinga, the former very much thanks to the latter. At least the film's final images remain burned into my memory twenty years after the first viewing."
      ],
      "genres": [
         "Action",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "BDB",
         "Burrowes Film Group",
         "Hoyts Distribution"
      ],
      "summaries": [
         "A second generation cameraman in Australia finds evidence that his father had filmed a nuclear test that allowed aboriginies to be exposed to and killed by radiation. He begins a search for a secret that if true, his government has already killed people to keep quiet.",
         "Harvey Denton is just a good payed marketing cinematographer as one day some film material of his dead father is stolen from his flat. A.S.I.O., the australian security agency, begins to overshadow him. Denton realizes that there has to be a connection between his father's film material and the just begun inquiry about British nuclear tests back in the fifties in Australia. Is it true that the aborigines and military personal were intentionally exposed to nuclear radiation? All Denton knows is that his father filmed those tests with governmental commission and died while swimming in the ocean. At least that is the official ground..."
      ],
      "budget": 7000000
   },
   "movielensId": 134268,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-10-01",
      "dvdReleaseDate": null,
      "directors": [
         "Michael Pattinson",
         "Bruce Myles"
      ],
      "runtime": 109,
      "movieId": 134268,
      "title": "Ground Zero",
      "mpaa": null,
      "actors": [
         "Colin Friels",
         "Jack Thompson",
         "Donald Pleasence",
         "Natalie Bate",
         "Burnham Burnham",
         "Simon Chilvers",
         "Neil Fitzpatrick",
         "Bob Maza",
         "Peter Cummins",
         "Brian James",
         "Brian James",
         "Bob Hornery",
         "Beverley Dunn",
         "Alan Hopgood",
         "Steve Dodd",
         "Alfred Austen"
      ],
      "imdbMovieId": "0093120",
      "originalTitle": "Ground Zero",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["HwJgiCwVM3g"],
      "plotSummary": "A second generation cameraman in Australia finds evidence that his father had filmed a nuclear test that allowed aboriginies to be exposed to and killed by radiation. He begins a search for a secret that if true, his government has already killed people to keep quiet.",
      "tmdbMovieId": 122767,
      "avgRating": 3.16667,
      "releaseYear": "1987",
      "numRatings": 3,
      "posterPath": "/4oyT5TGDknmGJ00BxFMtuoWIW9k.jpg"
   }
}