{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "diamond",
            "id": 1384
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "amazon",
            "id": 5968
         },
         {
            "name": "treasure hunt",
            "id": 6956
         }
      ],
      "imdb_id": "tt0090200",
      "video": false,
      "title": "The Treasure of the Amazon",
      "recommendations": [],
      "backdrop_path": "/Akj1YgW3FHkVByyglF3RTNq2H1S.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gringo",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba053",
               "name": "Stuart Whitman",
               "profile_path": "/bAtT3otGuwA8hG07lQSqTt7N1jq.jpg",
               "id": 38761,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Priest",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba057",
               "name": "John Ireland",
               "profile_path": "/87deUnSyOPNaoiQiBHjScqhu8CZ.jpg",
               "id": 14502,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Klaus von Blantz",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba05b",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Clark",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba05f",
               "name": "Bradford Dillman",
               "profile_path": "/zmoOkQTh6c7VwQlEl86r73pYFFw.jpg",
               "id": 18647,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Morimba",
               "gender": 1,
               "credit_id": "52fe48fe9251416c750ba063",
               "name": "Sonia Infante",
               "profile_path": "/6XH1GW58rsoivYg7qYk32ChOww7.jpg",
               "id": 585988,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Tacho / Paco",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba067",
               "name": "Emilio Fernández",
               "profile_path": "/hCVwwh6e5gCZQumxkS9HlZhMT1h.jpg",
               "id": 8259,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Pablo / Zapata",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba06b",
               "name": "Pedro Armendáriz Jr.",
               "profile_path": "/vqg8f4FeCKUD7jTVM2gLpElNZuh.jpg",
               "id": 7372,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jairo / Jaime",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba06f",
               "name": "Jorge Luke",
               "profile_path": "/cfnm8L6RXcjCLPLjuY063d9t7Ep.jpg",
               "id": 47886,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Barbara",
               "gender": 0,
               "credit_id": "52fe48fe9251416c750ba073",
               "name": "Ann Sidney",
               "profile_path": null,
               "id": 994263,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Dick",
               "gender": 0,
               "credit_id": "52fe48fe9251416c750ba077",
               "name": "Clark Jarrett",
               "profile_path": null,
               "id": 98532,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Riverboat Captain",
               "gender": 2,
               "credit_id": "52fe48fe9251416c750ba07b",
               "name": "Hugo Stiglitz",
               "profile_path": "/8G3HcfAPMkki1YqiaGthLeveTsr.jpg",
               "id": 38764,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48fe9251416c750ba04f",
               "name": "René Cardona Jr.",
               "profile_path": "/7pJ1DjrQGeRbwZMzFD2wluJ7Nxj.jpg",
               "id": 38756,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56f434ecc3a3682fcf003630",
               "name": "René Cardona Jr.",
               "profile_path": "/7pJ1DjrQGeRbwZMzFD2wluJ7Nxj.jpg",
               "id": 38756,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56f434f99251411a8b003192",
               "name": "Jacques Wilson",
               "profile_path": null,
               "id": 1595406,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56f43507c3a3682fd5003551",
               "name": "René Cardona Jr.",
               "profile_path": "/7pJ1DjrQGeRbwZMzFD2wluJ7Nxj.jpg",
               "id": 38756,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56f4351a9251411a9700348e",
               "name": "Daniel López",
               "profile_path": null,
               "id": 1095152,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56f43527c3a3682fd80035e6",
               "name": "Earl Watson",
               "profile_path": null,
               "id": 957930,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56f43538c3a3682fd80035e9",
               "name": "Mort Garson",
               "profile_path": null,
               "id": 1595410,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58c887a5c3a3682d1a0009c2",
               "name": "Elvira Oropeza",
               "profile_path": null,
               "id": 1649404,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.740144,
      "production_countries": [
         {
            "iso_3166_1": "MX",
            "name": "Mexico"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 92469,
      "vote_count": 4,
      "budget": 0,
      "overview": "A ragtag group of adventurers, including a former Nazi, is led by a half-maddened grizzled treasure hunter who wants a second chance to find the mythical treasure of the Amazon, after his first mission went terrible wrong.",
      "similar": [
         85,
         89,
         637,
         87,
         1771,
         1996,
         2059,
         6637,
         217,
         228150,
         14574,
         9326,
         17578,
         424,
         9838,
         16869,
         5925,
         2253,
         1995,
         339259
      ],
      "original_title": "El tesoro del Amazonas",
      "runtime": 104,
      "poster_path": "/zJVFNLNrnYb1E9PXafD1s7CI2w6.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Real Internacional",
            "id": 74622,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Star World Productions",
            "id": 74623,
            "origin_country": ""
         }
      ],
      "release_date": "1985-05-30",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["René Cardona Jr."],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "René Cardona Jr.",
         "René Cardona Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090200/",
      "coverLink": null,
      "actors": [
         "Stuart Whitman",
         "Donald Pleasence",
         "Bradford Dillman"
      ],
      "reviews": [
         "This Mexican gorefest is probably the funniest and most entertaining adventure movie ever made. In the 1950s, different people are looking for the treasure of the Amazon. For example a dubious woman, an elder man who knows the jungle (Whitman) and an old Nazi from Germany (great as ever: Pleasence). Not only are they trying to outwit each other, but they also have to fight blood thirsty crabs, crocodiles and other animals, and not to forget a vicious tribe of Indios who like to behead their victims as soon as they capture them. Rene Cardona jr. surely didn't have that a big budget for this film, but he certainly does the best with it. Concerning gory effects, that is. In the most outrageous scene, a hapless adventurer gets his eyeballs ripped out by the vicious crabs, a scene which has to be inspired by Lucio Fulci's notorious spider-scene in \"L'Aldilà - The Beyond\". This film is very trashy, but it's better entertainment than any other adventure film I know (the \"Indiana Jones\"-trilogy included), and it boosts a great role for horror veteran Donald Pleasence (as a really unpleasant guy) and enough nasty bloodshed to please every gorehound who wants to see something else for once. That's what I call good, mindless fun!",
         "Not an easy puppy to come across, but this \"Treasure of the Amazon\" surely is warmly recommended viewing for every fan of trash, pulp or the glorious exploitation cinema. I was lucky enough to catch it on a national TV channel, during a cult-themed night. This is a Mexican take on the extremely popular jungle adventures of the early 80's, complete with sleaze, gratuitous violence and a once-famous Hollywood cast. We witness how three separate groups of Westerners sift out the dangerous Amazon jungle looking for gold. All three groups encounter wild animals and a savage tribe of head-hunters but eventually it's the typical human greed that is the biggest threat. \"Treasure\u0085\" is action-packed (not one dull moment) and extremely rich on gore sequences. Highlight of this is a semi-disgusting scene in which a gold-digger is torn apart by ravenous crabs! This particular scene is bit by bit copied from Lucio Fulci's \"The Beyond\", by the way. Director Cardona Jr. simply replaced the tarantulas with crabs. Much footage comes straight from other (more budgeted) films or nature channel documentaries but that only increases the terrific cult value of this production. The cast performances go from lovely OTT acting (former miss world Ann Sidney) to completely-not-interested acting (John Ireland as the priest). Donald Pleasance is utterly cool as the uncanny Nazi wandering through the jungle to refund the resurrection of his Third Reich. Stuart Whitman shines for the first time again since \"The Mark\" as the tough jungle rat Gringo.",
         "A pretty decent adventure film from 1985 offers us several small groups of characters, each going into the wilds of the Amazon seeking different kinds of treasure. The movie is downright imaginative in the unpredictable kinds of trouble they encounter seeking out gold, diamonds or oil. The good thing about the movie is how it depends on characterization although the visuals are great too. It's much better than most of the clueless action movies of 2007. For one thing the camera holds steady instead of shaking all over creation trying to fake suspense. Most of the 2007 era cheap tricks --- such as the vim vim vim vim sound tracks weren't invented yet. Expect a disparate bunch of characters, mostly bad, a couple of girls with legs, and more fearful jungle creatures than you ever guessed existed. After the movie, buzz down to Manaus, Brazil and spend a few days seeing things first hand.",
         "Let me first say that i love trashy,low budget,gawdy movies and this ladies is gentlemen is a trash masterpiece! First the set up,various characters from a old hard ass,to a young scientist/explorer to several Brazilian bandios(and we cannot forget the German/nazi!!)set off on a quest to seek there fortune in the jungles of brazil. The movie starts off with the drunken hero sleeping on a boat, a ragged native tries to steal from the hero..who jumps up ,cuts off the natives finger,and yells\" no one steals from me you sonofab@#ch\" and rolls back over and goes to sleep again(and this is the hero!!!). A minute later the hero is sleeping a fellow adventurer walks over and starts urinating off the side of the boat and tells the hero \"you might want to move i don't want any to splash on you\"!! The hero \"gringo\" by the way proceeds to shoot almost every living creature he crosses path with..people,alligators,panthers...if it moves blast it! With lines like \"we ain't F@#@$%G stopping for no alligators\" this one is laugh out loud wild!! And then there was the German. This without question had to be the most unintentionally funny character ever seen on screen. The German was on a quest the find the gold/diamonds so he could restore the the dream of \"the fuhrer\" aided only by an attractive female native guide who was topless the entire movie(she also a warrior who can kick ass in a crunch).The German is so bad that every time anyone else sees him, they yell \"it's the German\" and run away! He and his native guide made the movie! I actually wanted them to come out on top! With lost young scientist who cry, a dumb as dirt southern bell with worlds worst accent, big massive female amazon warriors who get together for naked wrestling match orgies, and headhunters so eager to to collect heads that they literally run out of the trees and cut off every head they see..this one is a keeper...please somebody release this on DVD!!",
         "There are those who would compare The Treasure of the Amazon to Raiders of the Lost Ark (1981). They would be wrong. OK, This could have been an excellent movie, but it is not. The cast is great and at times actually demonstrates it, but the plot is so thin and ridiculous that it is extremely difficult to get into it at all. Stuart Whitman stars as your typical aging adventurer who leads a group of misfits into the Amazon to find lost WW2 treasure. Most of the group is killed in various horrible and ridiculous ways. The only way I would recommend this film is if you are interested in seeing some top notch actors doing their best to make something of nothing. The cast includes Whitman, star of such wonderful films as Rio Conchos and The Comancheros as the bull headed leader. Bradford Dillman, who starred opposite Robert Redford in The Way We Were, makes an appearance. Donald Pleasence, star of many classic films such as The Great Escape and The Eagle Has Landed, plays an evil Nazi. Rounding out the cast are John Ireland(Gunfight at the OK Corral 1957),Pedro Armendariez Jr.(License To kill 1989)and none other than Harold(Odd Job)Sakata.",
         "This Mexican adventure is a real treat for fans of cult movies.It has plenty of gore and violence including decapitations,throat cuttings etc.The scene where one guy has his eyes gouged out by some bloodthirsty crabs is the goriest bit and it reminds me the spiders sequence from Lucio Fulci's masterful \"The Beyond\"(1981).The cast is decent-a horror veteran Donald Pleasance(\"Halloween\",\"Paganini Horror\")shines as a Nazi adventurer.So if you are a fan of gory adventure movies like \"Mountain of the Cannibal God\" or \"Cut and Run\" give this one a look.\"The Treasure of the Amazon\" is not easy to find though!",
         "This is the best Indiana Jones knockoff I have ever seen. What it lacks in originality it makes up for in stupidity. Catchy and original names for characters like Gringo and Paco. Cheesy and lame effects make for fun. The props are about as pathetic as you can get. It stars a real hard ass (Gringo) who doesn't take crap from anyone or anything. I was also pleased by the work of Donald Pleasance. Donald plays really crappy villains well, if you can check him out in the movie Puma Man, he plays the ultimate in villainy, Kobras. Anyway, some of my favorite scenes are the ones with graphic violence that is so cheesy, Kraft invested in its use on Macaroni. For example, when Gringo cuts off an indian's finger, the severed finger looks like a carrot with ketchup on it. Good laughs if you watch while drinking lots of beer.",
         "I came upon this 80's gem via Rifftrax, who give it a lol treatment. Where to start with how wonderfully dreadful this thing is? Stuart Whitman in a performance that varies from somnambulent to hammy, sometimes in seconds-ridiculous overmiked animal and water sounds that drown out the dialogue, static jungle sets that are comically unrealistic, laughably bad dialogue, gratuitous violence and gore clumsily ennacted, cartoonish clothing (the guy with the gay cutoffs and wife beater in the deep jungle),the \"hot\"native gal in an obvious gigantic wig to cover her nipples, predictable plot line, and on and on......Really, it's so bad it's freaking awesome!",
         "The treasure part of this movie is stupid, because diamonds don't emerge naturally from ground level. There is some gold finding, too - that separate escapade is done by a Nazi and a topless native woman (who is actually Latino instead of Amazonian). But I have to admit that that woman looked good. The Nazi (Pleasance) is okay, and I found myself on his side while searching for treasure in order to build a better world - (what the hell) - Though opponents to that have their way. There is a need to mention that there is a goof who is searching for oil; and he is, by far, one of the worst actors in history. The goof's girlfriend isn't too bad looking though; but miss goody two-shoes eventually shows her devious side. The main characters are the diamond getters: performed by Whitman and his two nagging companions, who travel through the jungle yelling and pointing guns at each other. Fortunately they are given the greater majority of film time, making the story passable: with the scenery and Whitman making the highlights.",
         "It is sad when decent actors are involved in cheap rubbish like this that squander their talents. Most notable are Stuart Whitman, who is a very competent actor but when placed in a cheap jungle thriller, albeit lacking any thrill, one wonders why they stooped so low. This is absolutely one of the worst films I have seen, it is amateurish, directed by some hack René Cardona Jr., who did numerous other junk that probably isn't worth seeing either. Evident are a lack of story, character study or anything that resembles \"action\", instead, one dumb scene is added to the next. The editing is incongruent, many scenes looked as if they were filmed in the same \"jungle location\" or a mediocre studio. Loud music and dumb 'moments' signal the start of the supposed action, such as a man falling into a river and showing stock footage of crocs going into the water, not very exciting. There was a stupid Fulci scene in where a man is \"torn\" to pieces by small crabs in one of the most absurd scenes ever. The acting is atrocious from the minor leads, who can't even speak English very well, and it ruins their credulity. Donald Pleasence, who is also normally very good, was terrible here. There is nothing to motivate the audience, this is entirely dull and a complete waste.",
         "Various interests converge on a rumoured treasure trove deep within the bowels of the Amazon, where \"diamonds - the size of your eyes!\" (according to Gringo - Whitman) are protected by natives and the local conquistador. Gringo is a long-time expatriate to the antipodeans, who narrowly escaped the jungles on his last encounter, losing several prospecting companions in the process. Here he strategically teams with a brace of bozo bandits (Armendariz and Luke) to locate and extricate the bounty. But anthropological crew (Dillman, Sidney & Jarrett) and Ruger packing, former Nazi (Pleasance) are already ahead of the game. As diamond fever spreads, the locals emerge to claim their taxes. Sort of a Latin style \"It's a Mad, Mad, Mad, Mad World\" in some ways, with the added distinction of a graphic 'crab attack' scene (spectacularly gruesome in typical Cardona style), firmly securing its R-rating. Upbeat, memorable score; camp, catchy dialogue; and the sets and scenery, colourful and attractive, it's a sensory experience that captures the attention. A diverse cast of veterans seem to be acutely aware of the camp value, and their performances are just at the right pitch for some light humour. Shrunken heads, animal attacks, tongue hanging, snake eating and a splash of nudity for taste, \"Treasure of the Amazon\" is a veritable smörgåsbord of the most fertile in cinema exploits. Director Cardona made numerous attempts to cross into mainstream with his co-ventures, and this \"Tales of the Golden Monkey\" style treasure hunt, would be closest to success. Well paced momentum ensures there's no drag, and with a violent double-cross around every narrative corner, it's sure to entertain those with an appreciation for potent cinematic jungle juice.",
         "Three different groups set out through the jungles of the Amazon with a singular goal - to find treasure. They must overcome wild animals, cannibals, headhunters, and, ultimately, themselves if they are to reach their goal and make it out alive. Treasure of the Amazon has some really good things going for it. First, it features some of the most over-the-top moments I've seen recently. The headhunter attack scenes are a hoot. The low budget special effects add a nice touch. Second, almost every member of the cast delivers a solid performance. Stewart Whitman, Pedro Armendariz, Donald Pleasence, and Sonia Infante are all worth watching. Third, the jungle setting is fabulous. Nice touches with the scenes of animals intercut with the film. The lush jungle is beautiful and frightening at the same time. And fourth, the ending is perfect. But there are things about the movie I didn't care for that keep me from rating it any higher. First, I said that almost every member of the cast was solid. The biggest and most glaring exception is former Miss World Ann Sidney. Her fake Southern accent got old very quickly. Second, John Ireland is so underused I forgot he was even in the movie. I've always enjoyed his work and would like to have seen more of him. Third, and most importantly, the movie gives off a vibe to me that's hard to explain, but kept me from fully enjoying the movie. Much of the film came across to me like an episode of the television show Fantasy Island. Take away the gory bits and I half expected to see Mr. Roarke walking out of the woods in his white suit. It doesn't help matters that I remember seeing half of the cast on the show at various times.",
         "A diverse array of folks that include rugged guide Gringo (Stuart Whitman in top rough'n'tumble form), slippery former Nazi Klaus von Blantz (a deliciously slimy Donald Pleasence), and foxy lady Barbara (the gorgeous Ann Sidney) brave such perils as piranha, alligators, bees, vicious crabs, and the inevitable tribe of savage cannibals while searching the jungle for a fortune in both gold and diamonds. Director Rene Cardona Jr., who also co-wrote the suitably lurid and eventful script with Jacques Wilson, covers all the essential entertainingly low-grade bases in a satisfying and straightforward manner: The brisk pace never falters for a moment, some tasty gratuitous female nudity, plentiful action, a colorful array of shady characters, breathtaking tropical scenery, a tough no-nonsense tone, graphic gore (the sequence with one guy having his eyes torn out by the crabs rates as the definite nasty splatter highlight), and a nicely cynical attitude about man's unpleasant capacity for greed, lust, and treachery. The excellent cast of familiar B-movie veterans keeps this movie humming: Bradford Dillman as hearty and sarcastic airplane pilot Clark, beautiful busty brunette Sonia Infante as the feisty Marimba, John Ireland as a wise priest, Jorge Luke as antsy loser Jairo, Emilio Fernandez as the mean and intimidating Tacho, and Hugo Stiglitz as a riverboat captain. Daniel Lopez's crisp cinematography vividly captures the beauty and danger of the jungle. Mort Garson's robust full-bore score hits the stirring spot. A total sleazy blast.",
         "If you want a summary of the movie, read the other reviews; they do an excellent job discussing the fun, the gore, the cheesy-ness and the plot points. I enjoyed their posts. I'm here to talk about the Rifftrax version of this movie; if you love this type/genre of movies (i.e. 'bad' movies) then the Rifftrax versions add an order or two of magnitude of additional laughs. And they don't disappoint here. On it's own the movie is worth watching for the fun, the Rifftrax crew makes it priceless. However, virtually any movie with Donald Pleasance is going to be a laugh fest, the only problem here is that he doesn't get to shout 'Michael Myers is here!' at any point. So, if you like bad movies, this will make you afraid to go into fictitious countries ever again. However, I'd go download the Rifftrax version if you really want to enjoy."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Star World Productions",
         "Real Internacional"
      ],
      "summaries": ["A ragtag group of adventurers, including a former Nazi, is led by a half-maddened grizzled treasure hunter who wants a second chance to find the mythical treasure of the Amazon, after his first mission went terrible wrong."],
      "budget": 0
   },
   "movielensId": 134278,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1985-05-30",
      "dvdReleaseDate": null,
      "directors": ["René Cardona Jr."],
      "runtime": 104,
      "movieId": 134278,
      "title": "The Treasure of the Amazon",
      "mpaa": null,
      "actors": [
         "Stuart Whitman",
         "John Ireland",
         "Donald Pleasence",
         "Bradford Dillman",
         "Sonia Infante",
         "Emilio Fernández",
         "Pedro Armendáriz Jr.",
         "Jorge Luke",
         "Ann Sidney",
         "Clark Jarrett",
         "Hugo Stiglitz"
      ],
      "imdbMovieId": "0090200",
      "originalTitle": "El tesoro del Amazonas",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A ragtag group of adventurers, including a former Nazi, is led by a half-maddened grizzled treasure hunter who wants a second chance to find the mythical treasure of the Amazon, after his first mission went terrible wrong.",
      "tmdbMovieId": 92469,
      "avgRating": 1.75,
      "releaseYear": "1985",
      "numRatings": 2,
      "posterPath": "/zJVFNLNrnYb1E9PXafD1s7CI2w6.jpg"
   }
}