{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0457875",
      "video": false,
      "title": "Ek Ajnabee",
      "recommendations": [
         117409,
         78827,
         281011,
         297213,
         161442,
         81782,
         15979,
         23848,
         303406,
         20971,
         20296,
         49496,
         46383,
         19623,
         35064,
         56666,
         146003,
         41511,
         56969,
         21665
      ],
      "backdrop_path": "/jZyFbXrNznvqIL0018kPWoe8dH2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Col. Suryaveer \"Surya\" Singh",
               "gender": 2,
               "credit_id": "52fe49e59251416c910bc5d9",
               "name": "Amitabh Bachchan",
               "profile_path": "/9daoHX8vQrrk2oLQQdrvRV0UlE6.jpg",
               "id": 35780,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Shekhar Verma",
               "gender": 2,
               "credit_id": "52fe49e59251416c910bc5dd",
               "name": "Arjun Rampal",
               "profile_path": "/zLsX3bCA0WDcctq76A97Ccp2Zoj.jpg",
               "id": 52263,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nikasha R. Rathore",
               "gender": 0,
               "credit_id": "52fe49e59251416c910bc5e1",
               "name": "Perizaad Zorabian",
               "profile_path": "/jFknFtYxhZbKxG49ILLzM4YccjK.jpg",
               "id": 642779,
               "order": 2
            }
         ],
         "crew": []
      },
      "genres": [],
      "popularity": 0.734975,
      "production_countries": [],
      "id": 87995,
      "vote_count": 7,
      "budget": 0,
      "overview": "Suryaveer Singh (Amitabh Bachchan) is a bitter man and ex-Army officer, hired by his friend Shekhar (Arjun Rampal) to protect a little girl, Anamika (Rucha Vaidya).",
      "similar": [],
      "original_title": "Ek Ajnabee",
      "runtime": 143,
      "poster_path": "/a7hyP9zh5KBqGYrMkrHGi4CXons.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [],
      "release_date": "2005-12-09",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "A Man Apart",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Apoorva Lakhia"],
      "runtime": 142,
      "synopsis": null,
      "writers": [
         "Apoorva Lakhia",
         "Manoj Tyagi"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0457875/",
      "coverLink": null,
      "actors": [
         "Amitabh Bachchan",
         "Arjun Rampal",
         "Perizaad Zorabian"
      ],
      "reviews": [
         "After seeing lot of comedy crapers over the past few weeks, this one was a surprise. I had not watched even the trailer of the movie. The movie was very good till interval and was decent after the interval. Amitabh has given another good performance, I must say he looked great throughout the movie. The child actress was another high point of the movie, she will linger on to your memory even after leaving the theater. The movie is completely set in Bankok and main theme involves around kidnapping business in the city. It is not a flawless movie, Amitabh alone is worth the money spent. Don't miss it.",
         "The biggest plus point of this film has to be Bachchan saab. This film is a complete re-hash on Man On Fire, there are some scenes which are a direct lift from the original. This is one thing that really annoys me about \"Indian Cinema\", when over the last year we have seen some original and refreshing films along comes another plagiarised script adapted for the Indian audience. Directors must realise that the audience too has an intelligence, and must avoid insulting it. However, if we look beyond this the film is very stylishly shot in Bangkok and the pace is fast enough to keep one engaged and sometimes even absorbed. Another thing is the hip-hop style imitation in music \"don't be talking to no, stranger means danger?!\" I couldn't help but cringe, sincere attempts to this have been successful for example in junior B's Bluffmaster. If you haven't seen Man on Fire please do watch this primarily for Amitabhs performance, otherwise watch the original.",
         "Black - Waqt - Sarkar - Viruddh Big B has given another dashing performance in this \"Ek Ajnabee\" I thought plot was wafer thin. But then some twists in the 2nd half made it really interesting. Big B is awesome. Arjun Rampal fits in his negative role. Perizaad Zoraban is perfect as kids mother. But I must say Two Show Steallers were Big B and the Kid. She was super. Adorable acting by her. Sanjay's Song is wasted. Good that no songs as script really does not allow you this. Thailand locales are good. Shot Nicely. I give 7 out of 10. More for power packed performances. Big B in action role after a long gap. Last was \"Kaante\" so I say go watch it if you have not yet.",
         "This movie is a scene to scene copy of Denzel Washington's \"Man on Fire\". They took the whole movie, added songs to it and a little twist in the end. Other than that, each scene is a ditto copy of the original movie. The irony is that Amitabh Bachchan, who plays Denzel's role in this movie, said in a promo that \"Please watch this movie on big screen and stop piracy\"! What a joke! The film itself is a violation of many copyright laws! On top of that, the script writer(script translator), claims that he wrote this script two years ago but Amitabh didn't like it, so he added a new twist in the end and then Amitabh agreed to do the movie. Watch the original movie \"Man on Fire\". One of the best performances by Denzel Washington and Dakota Fanning.",
         "The script is a copy of Man on Fire. The movie is a scene-to-scene, dialog-to-dialog translation. Still, I enjoyed it, but the fact that the movie was so shamelessly copied over from a big Hollywood movie without even a touch of hint of acknowledging that left a really bitter taste in my mouth. The only positive message I want to convey to the entire crew involved in the movie is this: Look, you had a great looking movie in the end, with slick action shots, fantastic characterization, really stylish look and feel for the movie. So that means you are good. But hey, just spend some extra time, effort and money to write a script yourself - and you will have a winner on your hand next time! I rate it 8 out of 10 simply it is a good movie to watch. Ethically speaking, this movie should be given a 0 out of 10.",
         "Being British, this is my first venture into the world of Indian Cinema, having only seen Hollywood films - I was very impressed. Amitabh Bachchan, was excellent as the tall, detached and imposing Suryaveer Singh, and plays his role with supreme talent. The rest of the cast are also very good, Arjun Rampal brings a young hip character to the screen in his portrayal of Singh's colleague Shekhar. The action scenes are extremely well choreographed, and serve his character well. All in all this film is a great movie in its own right, with an awesome feel and an excellent cast. I give this film 10 out of 10, and I will be certainly purchasing another of Bachchan's films. I really liked this film, and I think for me it shows what Indian Cinema has to offer.",
         "Ek Ajnabee, is a Straight derivation of \"Man on Fire\" staring Denzel Washington & directed by Tony Scott (The Fan). Moreover, 80% of the movie is scene to scene copy of the Hollywood original. At the End, the movie is badly screwed as thats the only part which is altered. The only 2 Good points about the movie is : 1. The New-Age Snap-Shot Editing & Sleek-Stylish Camera works which of course is a patent mark of Tony Scott. But we relish this the style adapted in Indian cinema. The last such good Photography-Editing work we saw was in Kaante. 2. Amitabh Bachchan. He is amazing and has a massive screen presence. This film shall be liked only by the Hardcore fans of Amitabh. The Action scenes, guns, explosives, etc. are just splendid. Bangkok is Shot & Photographed absolutely brilliantly. The various Locations were selected perfectly. But I would say that there were many loose ends even in \"Man on Fire\" which the director could have corrected in Ek Ajnabee. But he did'nt whereas, he only altered the End which was highly ridiculous & senseless. Since the film is based on a story in Bangkok, the film makers of course needed their masses to understand. So what happens.... all the bad guys who are Thai, can speak Hindi !!!! to justify further, the film makers make all the Thai Characters half Indian & half Thai Origin !!! & they can speak Hindi. Wow !! C'mon now, we are on a trend of listening English....Black & Salam Namaste did work ! did'nt they ? Secondly, you find that there were more conspirators involved in the Girl's kidnapping than the actual Kidnappers !!! So there are Bad Guys who actually kidnapped the girl & there are guys who took part in that conspiracy.... 1. Girl's own father 2. Girl's family Lawyer 2. Chief Inspector of Police &&&&&&&& One more who gets revealed in the most ludicrous Suspense of this year. One Surprise.... Perizad Zorabian is amazing in this film. She did a real good act. Finally, This film is worth only seeing Amitabh Bachchan & the Trendy Photography - Fast Pace Editing with a psychedelic Background music score, reason to create a good impact on the audiences. My rating 5/10",
         "First of all it is a plagiarized movie \u0096 from Denzel Washington's \"Man on Fire'. But let us put that aside since many Hindi movies are photocopies. (Some are 'inspired' but the bulk are total rehashes with not an iota of conscience.) So having put that to rest let us see if the movie stands on its own feet. Swish-swish editing - seems like an editor gone mad. Scenes from the future coming before, scenes from the past repeated ad nauseum - same takes get featured again and again, totally irrelevant to the story. Obviously the director is clueless about what it takes to tell a story in a celluloid medium. Mumbai Se Aaya Mera Dost was bad - Ek Ajnabee is pathetic. With a cast of hams - Arjun Rampal(leading the pack), Perizaad Zorabian, Vikram Chatwal, Kelly Dorje and a whole host of insignificant actors. But never mind \u0096 what about the Big B?? You can flog him all you want; flaunt his talents but sir we are disappointed since you involve yourself with such low-grade productions.",
         "Ek Ajanbee is a great movie! I mean, c'mon! High production value, awesome scenery, and very clever camera work. I was impressed, and even though I had already seen Man on Fire , and was aware this was a remake of it, Ek Ajnabee held its own plenty. I know that a lot of people on these boards are saying that it is a \"rip-off\", \"this is Bollywood at its worst\", and other mindless comments, they fail to realize a few key points. As far as I'm concerned, everyone knows that USA's Hollywood is king of the hill due to the sheer amount of money that is available. But India's movie industry may not have the same worldwide recognition as we do, but that doesn't mean their movies are crap. Think about how much foreign talent comes to the USA (Ridley Scott, Colin Farrel, etc) - this virtually annihilates the talent pool in their home countries, and they come here to act and direct under the banner of Hollywood. SO the USA just has it that good. A lot of Indian flicks (lol, I just thought about it - \"Indie flicks\". LOL!!) borrow heavily from established USA movies, that's obvious. But they aren't ripping off Hollywood, they're using tried and true formulas that sell tickets over here! Ek Ajnabee is not a virtual copy of Man on Fire, although it is awfully similar. But it has its own plot twists and new characters that make it unique. I liked the movie for several reasons - the \"Creasy\" character (who's name I can't type or pronounce) has awesome screen presence, the Paul Stanley (his buddy) looking guy made an awesome villain at the end, and it managed to be a fierce and powerful thriller without any profanities. Okay, so I did think that Ek Ajnabee was a bit TOO stylized (too many complicated camera edits, over-the-top dialogue, people calmly walking in slow motion away from cars as they explode, the hokey special forces flashback scene and, oh yeah - the bad guys just happen to drive a 1970 Pontiac GTO that wouldn't be very hard to spot in Asia!!), but then again most movies that we are familiar with are too, i.e. the US version of Man On Fire, Catwoman, Armageddon, or any other bug dumb action movie... I wasn't sure what to think when the movie turned into a music video halfway through, and the coda scene \"15 years later\", the lead character looks EXACTLY the same and is still wearing the same sunglasses!!! Still, I was pleased with Ek Ajnabee - and I'll watch it again.",
         "All was fine while watching this movie until the small girl jumps into swimming pool, and then encouraged by Bachan to swim and after that, gunfire fear talk... I was like, hold on... have i watched this movie before? and figured out after a short thinking that yes, but it was the movie named \"Man On Fire\" last time I watched it... I love Amitabs acting and all... but I was really disappointed in the writer, I think more could be done to make the copy look a bit different than original. Some one said rightly \"Nakal ke liyey bi akal ki zaroorat hoti hai\" (you need wisdom even to cheat), and of course, if the writer had some sense, he would come up with an original idea in the first place... I have only one request to the movie makers... Please don't waste money on stealing the scripts and filming them, you can rather dub the movie in Hindi and put some songs at end and it will work just as fine... I hope Mr. Amitab knows the fact that the movie was based on the cheated story line...",
         "Absolute dire rubbish. Notwithstanding the 'Man on Fire' comparisons (or any John Woo similarities), cause that's nothing new to Bollywood, it was directed by a hack & maybe put together by people with skills, but severely lacking any talent. Derivative, uninspired, clichéd, predictable, unconnected & ultimately rather boring. The fight scenes were choreographed by a puppet, filmed by a brick & edited by a epileptic. Slow-mo, blurry, freeze-frame, action-less action. Rubbish. And how pathetic that you could actually see one bad dudes stuck on moustache as clear as day. In glorious widescreen, it looked like someone had glued half a hair net on his head. ...but absolutely worst of all was the incredibly annoying & persistent soundtrack. Every single moment of screen time that wasn't a specific scene with dialogue was filled with the crappiest most dated Indian versions of late 90s Eurobeat. It was non-friggin-stop. It never let up. The soundtrack must be at least 2hrs 10mins of music alone. People slag off many Hollywood films for being too MTV-like. Well this was like MTV editing on PCP. The one lame \"song\" that came on after the intermission was made up of 1/2 second edits that has seriously taken the cake for how not to use scissors in an editing room. Inept at the nth degree. The only decent thing was the little girl. She could at least act & hopefully she will have escaped any emotional damage that might have occurred after she watched the final product... The most singular worst Bollywood film i've ever attended.",
         "On it's own it's a nice movie to watch. I don't understand some people whom seems to bother about every aspect of a movie. remember just judge the result on excitement,thrills and it's well balanced storyline without making any comparisons. I saw both movies and i like both of them. Both had great actor cast with also good acting, though this one had an other plot twist. Arjun acts natural and convincing, Big B did a good job, it's cinematographicaly beautiful and the song 'ek ajnabee' is a nice addition. One thing fascinates me in Indian movies regarding kids: why do Indian filmmakers always cast kids who are suffering from heavy weights? Is it nowadays still believable to promote fat kids as symbol for prosperity?",
         "well actually before i started watching this movie,i surfed IMDb for user reviews. 6.9 is pretty good i guess and moreover it is a Big-B movie.So why would i miss it? The premise is good enough..kidnappings.and we have our Big-B or Surya as he is called by the sweet Anamika(the girl in-focus) coming in to action.The first half was very sweet and i enjoyed each and every moment of it,because the interactions between Surya and Anamika were really nicely done. After the shock incident towards the end of the first-half,i was ready for really great action from our Big-B.Even though Surya carries off his 'revenge' in style,his pace is something which could have been improved.I meant the slow-speed at which he uncovers clues and finds out what is actually happening around him.And moreover,when Big-B is ready to blast the villains with a machine gun(oo mama),the camera man tries something different and in the end spoils the fun of watching Big-B pumping bullets...give me a break please!!!Everything is at the same slow pace in the second half till the climax.People are in for a triple-shock...that was the good part of the 2nd half.Otherwise it's a boring affair to watch the last half of Ek Ajnabee... Anamika was really sweet.Though i feel the Anamika in the last scene was an idiotic choice(this Anamika is'nt sweet or cute at all). Arjun Rampal was apt in his role and flexed his muscles when needed. If the second half had been a bit more crisp(excluding the climax) this movie would have certainly gone places. NOTE:I heard this movie is a rip-off,but that never matters.As Big-B's presence more than makes up for the faults in the movie.Watchable once,certainly.",
         "Too bad, Indians are real good at stealing. From persons of the cadre of Amitabh, I would expect the movie to be good but not something that is a complete retake scene-to-scene of an English movie. The producers/directors etc. should be made to pay all of the profits to the makers of the original film (Man On Fire) and blacklisted by the Censor Board and all Film Regulatory Boards. Bangkok doesn't compare at all to the settings of Mexico where the number of kidnappings of females of all ages is still at the highest. Also, no one can match the performance of Dakota Fanning in the original movie. My advice to anyone who is thinking of watching this movie. Don't! Watch 'Man On Fire' instead.",
         "The first part of the crime thriller from India - and also a MAN ON FIRE copycat - is absolutely outstanding for the first part, poignant, in the best Bollywood style, but everything collapses in the second part, this time in the worst Bollywood part, I mean a scheme, a style in the pure and worst Hollywood style, with SPOILERS SPOILERS SPOILERS SPOILERS a f...happy ending which makes this feature a pure crap in the overall summary. Such a shame because, I repeat, the first part was awesome. The lead looks like a sort of Indi Al Pacino.",
         "I deplore India's theft of recent scripts and whirlwind remakes of those same movies. Man on Fire-2004/followed by Ek Ajnabee-2005, is an obvious example. I haven't see all of Man on Fire. I saw the end. I found it well acted but depressing. I am of the Melina Mercouri school of Tragedy . When she saw Medea,she envisioned it ended with \"and they all went to the beach.\" Having said that, I obviously did not run out and rent a copy of Man on Fire so as to see the parts I had missed. Denzel Washington is an accomplished actor so I expected nothing less than a stellar performance throughout. I just didn't see the beach. Today, I turned on the Zee channel, and Ek Ajnabee was playing,again, half way through the movie. The performance by Big B was immediately sensitive and riveting. I googled. Bollywood being what it is,I had 1 1/2 hours left to enjoy. It certainly shows what Indian actors,given decent scripts, can produce.Knowing that it was a rip-off, while a disappointment, since I believe Indians are capable of writing equivalent or better scripts. I have your word that the events ,plot,and even the dialog are the same in both movies. Only the ending differs. Therefore,for my money, I will probably be shelling out whatever Nehaflix is charging this month. Well I have since had a chance to watch the entire movie and I must say I was impressed. It held my attention, and it was Indianized ,if you know what I mean. Seriously,when Anamika is asking for help with her homework and the servants try to reply in front of the Colonel,it's hilarious. Is there a comparable scene in Man on Fire? Could there be? If you don't you know what I'm talking about,the little girl asks \"what is the capitol of the USA?\" They answer \"London,\" and Bacchan stares but says nothing. Then she asks, \"who is the prime minister of India?\" Smiles, head nodding,aha!, \"ShahRukh Khan!\" The look on Bacchan's face was well worth the cost of the DVD-$7 at Nehaflix. Loved it!!! Denzel never had that scene. Denzel is big-not that big. Indianized. I'm on my 3rd viewing today. Yup-still love it. An I hate action movies.Happy Diwali- bang. I know it's not very cerebral,but the acting is believable, the characters are well drawn, I loved the little girl and her mother. Yes,the song was an extra I would have cut. But I still give it a 7. I enjoyed the mayhem. Immensely. \"And they all went to the beach.\" Jai Ho!",
         "It's (Amitabh Bachchan)'s coming back to Action movies after quite an absence, and while he's 63 years old. But (Ek Ajnabee) got only one advantage : seeing Bachchan in the middle of its anything ! Actually the matter of copying the American movies into Hindi ones is old and natural. It could be partly why they named it Bollywood !. They're making 900 movies per year so if they suffered of lack, it's ordinary to remake, but the non-ordinary matter is not to confess about it. They even copied Superman !??. Anyway, as for (Bachchan), he did it many times before : 80 % of his (Satte Pe Satta – 1982) was from (Seven Brides For Seven Brothers – 1954), 50 % of (Bade Miyan Chote Miyan – 1998) was from (Bad Boys – 1995), and now 90 % of (Ek Ajnabee – 2005) is from (Man On Fire – 2004). Quite a percentage this time ! But the man made 22 movie only between 2005 and 2007 (and these are supposed to be his lackluster years !), so he is a living legend and a cinematic machine, however while movies like (Ek Ajnabee) or (Stranger on Fire !) assured how the big B has to be a consumer goods that must be out there just to be remembered, it assured also how the fans of him mustn't wait much of their living legend! It represents the trade's law of the industry \"just make movies\", yet with the hastiness of one industry \"just steal movies\", to an extent of being impudence as you witness for bitter instance at the credits of this movie (Manoj Tyagi) as the writer of it, AND its director (Apoorva Lakhia) as the co-writer !?? This is silly, and it would have been less silly if they tried to present anything new or different more than shooting in Bangkok, adding the twist, or the mistreated wonderful song. Especially in a movie took everything from its unspoken-about original : the characters, the events, the dialogue, even the famous style of direction ! It really gets on your nerve when the makers of it give the chosen child (Rucha) 3 months before shooting to learn how to swim, in the time that they didn't use any time to make any creative changes in the stolen script or even a whole new one of their own ! It's a 142 min video clip with the entire positive and negative meanings of the word. Although I knew all along that I was watching a fast shadow of a movie, and that (Bachchan) is commercially saying : I'm here and capable. But I recognized in slight moments how I found myself anxious like he was (waiting for the child with the balloons), angry as he was (facing the father with the truth). It's the genius unity between the charismatic star and the viewer, which confirmed not only my axiomatic love for (Bachchan) as one of the great cinematic icons, or my history of watching him through memorable flicks since I was a kid, but also that he still has it, and to tell you the truth he misuses it too. Yes, it's fun to watch him through that flashy atmosphere, and as that angry, not smiling, old avenger. But he was old enough to be the girl's grandfather. Moreover a script didn't provide him with scenes demand strong acting. So despite how he managed the mission well it wasn't a well mission in the first place! If you want to talk about (Ek Ajnabee) independently away from its original, so : How (Bachchan) got the photo of the criminal who he killed at the barber shop ?, if the cartoonish evil kidnapper (the one with the particular haircut) owns the girl from the start why he didn't negotiate earlier ?, and basically if the girl was alive all along then the diabolical revenge of (Bachchan) was completely absurd ?, and how he became forgiven at the end for all of these murders ? (It's only a cooperating officer who managed to hide all of these GOOD crimes, so Abracadabra and Booph !), and seriously if (Arjun Rampal) had a big hand in it, how he left (Bachchan) slaughtering all of his men like that ?, or how he was helping him out with it ? \"They all mean nothing to me\" as (Rampal) justifying poorly and idiotically at the end (??). There were some unbearable points : the numbers, despite their fewness. The very last scene (after 15 years !!!). (Abhishek Bachchan) as the new bodyguard (soooooo ridiculous even by doing nothing, totally the opposite of his dad), most probably it was mutual favor, as his father appeared in one of his recent movies at the time as a guest star also. And most of all the try of reproducing Tony Scott ! Like having the same poetry about the same situations but read by one other than the real poet, one who's adolescent and obtuse. Generally for an Action evening it's a fair show, technically well, and most of all it got the Amith magic. But I missed the dramatic originality, the old Bollywood intensive desire to entertain even by the heavy melodramatic marked way (at least it was their personality), any possible depth, any memorable sequences, or performance more than seeing my star in video clip has all the positive and negative meanings of the word, however here.. The negative exceeded. To tell you the truth, every star is consumer goods one way or another. And (Amitabh) through (Ek Ajnabee) is a perfect example for that.",
         "The Indian version of Man On Fire. I loved Man On Fire - but I don't love this film. Ek Ajnabee is disappointing, the performances, music, script, and directing were all poor. The stunts were a good point of the movie, if not the only point. Amitabh Bachchan did a good performance, to an extent. His chemistry with the little girl, Rucha Vaidya was well done, and they obviously had a connection. The little girl impressed me, though there were times her voice irritates you, as it is high and very squeaky. Nevertheless she does a nice job, for her age. Perizaad Zorabian, Arjun Rampal, and Kelly Dorjee make forgettable appearances. The music is one of the best things about the film, but there aren't many songs. And thank god there were no song and dance sequences, they would have looked atrocious. Ek Ajnabee is a film you will regret seeing.",
         "The first thing that comes to your mind after watching 'Ek Ajnabee' is that what on earth is Amitabh Bachchan doing in this film? This is the film where the actor is bigger than the film itself, whereas, it should ideally be the other way round. Courageously, Bachchan carries the whole film on his shoulders; too bad the film wasn't worth his magnanimous sincerity he lent to his character. The film is an adaptation (more appropriately, scene to scene copy) of Denzel Washington starrer 'Man on Fire'. The director Apoorva Lakhia (director Mumbai Se Aaya Mera Dost) also did not forget to add the clichéd Bollywood elements in form of one- two wanton songs, complicated and a senseless climax, though thankfully, there is no model turned actress playing the love-interest in the film. The characters are almost like cardboard characters, mere caricatures, are weak, unrealistic seem to accidentally erupt from nowhere and fail to infuse any empathy from the audience. The child artist Rucha Vaidya did justice to her character and Perizaad Zorabian also sustained the part chosen for her. Arjun Rampal in leather, tattoos and long hair simply had to look good. He was nothing more than a sidekick in the film and if it was any consolation to him, his role in the scheme of things as the climax unfolds, given some grace. But, again, the pointlessness of the sub-plot only makes it more of the same. Though the director managed to give the film a glossy Hollywood look, the style and look element is taken too far. The scenes fail to weave any effective screenplay together. There are too many special effects that only hamper the story telling in the film. This film does remind of a young Sanjay Gupta whose films had style, sheen but no substance. Collectively actors like Abhishek Bachchan, Lara Dutta and Sanjay Dutt in guest appearances will also not be able to give extra battery life to this film. High points of the film are fast pace, background music, realistic action sequences and Amitabh Bachchan. The Story: Suryaveer Singh (Amitabh Bachchan) was a Colonel in the army. His friend Shekhar (Arjun Rampal) invites Suryaveer to Bangkok where he owns a security firm. In order to get his life back into order, Shekhar gives Suryaveer a job as a bodyguard. Suryaveer accepts only to find out that it is to protect an 8-year old girl Anamika (Rucha Vaidya), daughter of rich parents played by Perizaad Zorabian and Vikram Chatwal. Suryaveer Singh is cold to Anamika and refuses to accept her friendship as the ghosts of his past life traumatize him. But slowly and steadily he forms a bond with her as she gives his life a new meaning. ? ? But his life takes a shocking turn once again when Anamika is kidnapped and Suryaveer wows to avenge her death. The struggle to do so also unleashes another horrifying secret. Watch 'Ek Ajnabee' to find out!",
         "Sorry friends, no offense... but this is not \"inspired by\" Tony Scott's \"Man on Fire\"... it is basically a plot point by plot point ripoff, er... excuse me... \"remake\" of that film with Amitabh starring as Denzel, but dressed oddly like Tom Cruise from \"Collateral\". From the opening title card, I groaned in the theater knowing it was going to be a loooooong afternoon. Let's see... the dialogues were spoken in Hindi, and the story was set in Thailand... that's no excuse to make the SAME freaking movie. Yeah, the relationship between Big B and the little girl was cute... but I'd seen it before when it was Denzel and Dakota Fanning. Denzel was also a guilt-laden boozer, and he also happened to help the young girl with her swimming problems. Even the \"revenge\" scenarios were copied down to the T. Only the \"twist\" at the end starring the unnecessary Arjun Rampal character (and co-starring his painted-on tattoos) was original... and even that fell short. The cameos at the end seemed to only exist to give the audience a token clap. That way we could all point point at the screen and yell \"Hey look... that's blah blah blah\". Right. Yawn. Watch the original film, my friends. Tony Scott actually did do it well enough the first time. Yo Desi film-makers: Are you really THAT starved for ideas? Every time I see these copycat flicks with no acknowledgement of source material I cannot get it out of my head that what I'm seeing is painfully unoriginal and immoral film-making... almost like the cinematic equivalent of lip synching. I wasn't a Milli Vanilli fan either.",
         "They copied everything from the movie, including casting a saucy little girl to try and imitate Dakota Fanning's acting. If I were Dakota or Denzel, I would be insulted. I mean, honestly, the only thing that was original were the forgettable songs in this film. After plagiarising Bollywood once more, they tried to make this film their own by making the character of Arjun Rampal (the Christopher Walken role from the original film) bad, aging Dakota Fanning's character (who is played by Lara Dutta 15 years later), and bringing on a new bodyguard (played by Abhishek Bachchan). The only saving grace the director will ever have is if he makes a sequel to Ek Ajnabee, which would star the two new characters they introduced in the end. And hopefully, this will be done fast before Hollywood decides to make its own sequel and then we will have no choice but to accuse Bollywood yet again of another rip off! Oh! and please don't make it a ripoff of The Bodyguard in your quest to make Lara and Abhi fall in love! For anybody reading this, don't waste your time. Rent Man on Fire instead.",
         "Apoorva Lakhia after the fiasco Mumbai Se Aaya Mera Dost(2003) returned with Ek Ajnabee this time with Amitabh Bachchan(though Abhishek and Lara have guest roles). The film released on the same day as Kalyug and Neal N Nikki and did average business. It's a remake of Denzil Washington's Man On Fire(2004) and almost a complete rip-off. Though some portions are changed to suit the Indianised version. The film starts off well, the bonding between Rucha Yadav and Amitabh is well handled, The problems of AB is well handled like his alcoholism due to an incident in the past, the kidnapping scene too is well handled The second half gets into an action mode where AB tortures people and chases the wrong doers, treated in a Hollywood fashion at times it doesn't create the desired effect. The twists and turns do startle you at times, the end which is changed from the Hollywood version and has a twist which is not too convincing. Another flaw is overdose of style which overpowers the content. Direction by Apoorva is decent especially in the first half Music by VS is good, the songs suit the film Amitabh Bachchan excels in his role only he could perform Baby Rucha is fantastic after Main Aisa Hi Hoon, Perizaad is great, Vikram Chatwal is alright,Arjun Rampal gets sidelined and his role could be better but he seems confident in his role and helds his own. Dayashankar Pandey is okay, Kelly Dorjee and Raj Jhutsi are okay",
         "Ek Ajnabee directed by Apoorva Lakhia and a remake to the Hollywood movie,Man on Fire is an average movie. But what makes this average movie turn to be awesome is the performance of Amitabh Bachchan! Amitabh Bachchan,after a long time,returns back to screen as the young angry man.It is a pleasure to see him in roles like this! Story:- Bangkok based Ravi Rathore(Vikram Chatwal) lives a wealthy lifestyle and runs a business which he took over when he married Nikasha(Perizaad Zorabiam). They now have a school-going daughter, Anamika(Ruchi Vaidya), and a failing business. In order to make up for his business losses, Ravi hires some men to kidnap Anamika, hold her for ransom, demand two million American dollars, and then release her. Ravi hires an elderly, alcoholic bodyguard named Suryaveer Singh(Amitabh Bachchan), who dislikes crowds and children. He does warm up to the bubbly Anamika and both share a bond - which is broken when Anamika is kidnapped from her piano school, Surya is severely wounded, but does manage to shoot three abductors. He recovers in hospital, and is quite upset that he has failed in his job. Meanwhile Ravi is quite relieved that the kidnapping has gone according to plan, he does notify the police, and they set up a trap to apprehend the kidnappers. But then something goes terribly wrong, the police end up shooting and killing the men, who in turn kill Anamika. Surya, who is on his way home to India, cancels his trip, returns and starts asking questions, not knowing that he is going to unearth a web of deceit, lies and deception, which may only end when he uncovers the entire truth or die's trying. The direction is average. The story is copied from Man on Fire.So nothing to talk about it. The music is average. The cinematography is good. The action sequences are very good. The dialogs especially the ones delivered by Amitabh Bachchan are excellent! Performances:- Amitabh Bachchan steals the show!He is superb.Arjun Rampal is excellent.Vikram Chatwal and Perizaad Zorabian are okay.Ruchi Vaidya is good.Sanjay Dutt,Abhishek Bachchan and Lara Dutta in brief roles are okay. I am giving Ek Ajnabee a six on ten.The six marks are only for Amitabh Bachchan's superb performances!",
         "This is a total rip-off of Man on Fire, it takes every scene and makes it....crappy! It seems Bollywood has officially ran out of ideas and is trying to make remakes of Hollywood movies, how can one be a director or screen writer if they are copying a Hollywood movie! The role of Arjun Rampal was unnecessary, he doesn't help this film at all and Amitabh Bachan tries to imitate Washington but in my eyes he fails....Not something you expect from Mr. Bachan.... The only thing that brings this film up is the action sequences..which are okay and Bachans white suit...very stylish and the song 'Mama told me'...Thats about it.."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["G.S. Entertainment"],
      "summaries": [
         "Suryaveer Singh (Amitabh Bachchan) is a bitter man, hired to protect a little girl, Anamika (Rucha Vaidya). However, Anamika gets kidnapped and her father is not able to pay the sum in order to release his daughter. So Suryaveer uses all his skills to save the life of the child, only to find out about the conspiracy that is behind the little girl's kidnapping.",
         "Bangkok based Ravi Rathore lives a wealthy lifestyle and runs a business which he took over when he married Nikasha. They now have a school-going daughter, Anamika, and a failing business. In order to make up for his business losses, Ravi hires some men to kidnap Anamika, hold her for ransom, demand two million American dollars, and then release her. Ravi hires an elderly, alcoholic bodyguard named Suryaveer Singh, who dislikes crowds and children. He does warm up to the bubbly Anamika and both share a bond - which is broken when Anamika is kidnapped from her piano school, Surya is severely wounded, but does manage to shoot three abductors. He recovers in hospital, and is quite upset that he has failed in his job. Meanwhile Ravi is quite relieved that the kidnapping has gone according to plan, he does notify the police, and they set up a trap to apprehend the kidnappers. But then something goes terribly wrong, the police end up shooting and killing the men, who in turn kill Anamika. Surya, who is on his way home to India, cancels his trip, returns and starts asking questions, not knowing that he is going to unearth a web of deceit, lies and deception, which may only end when he uncovers the entire truth or die's trying.",
         "Movie is a remake of the Hollywood movie Man on Fire (2004). Quite an effort to reproduce the movie with quite a different climax."
      ],
      "budget": 0
   },
   "movielensId": 134340,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2005-12-09",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 143,
      "movieId": 134340,
      "title": "Ek Ajnabee",
      "mpaa": null,
      "actors": [
         "Amitabh Bachchan",
         "Arjun Rampal",
         "Perizaad Zorabian"
      ],
      "imdbMovieId": "0457875",
      "originalTitle": "Ek Ajnabee",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Suryaveer Singh (Amitabh Bachchan) is a bitter man and ex-Army officer, hired by his friend Shekhar (Arjun Rampal) to protect a little girl, Anamika (Rucha Vaidya).",
      "tmdbMovieId": 87995,
      "avgRating": 3.35714,
      "releaseYear": "2005",
      "numRatings": 7,
      "posterPath": "/a7hyP9zh5KBqGYrMkrHGi4CXons.jpg"
   }
}