{
   "tmdb": {
      "original_language": "hi",
      "keywords": [],
      "imdb_id": "tt0110546",
      "video": false,
      "title": "Mohra",
      "recommendations": [
         161236,
         115124,
         71308,
         206376,
         72051,
         21906,
         46403,
         165573,
         33124,
         30321,
         45533,
         60397,
         166231,
         161226,
         117345,
         27964,
         83902,
         30537,
         52860,
         155973
      ],
      "backdrop_path": "/cM3DNMfQH425nLec7PmOBN8XpaB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mr. Jindal",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daee3",
               "name": "Naseeruddin Shah",
               "profile_path": "/7jCtyEHl8fvETUyxmzi04AeVZPk.jpg",
               "id": 6497,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Amar Saxena",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daee7",
               "name": "Akshay Kumar",
               "profile_path": "/4ZxH4Doh9mRv4GOhV0g76skvG0d.jpg",
               "id": 35070,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Vishal Agnihotri",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daeeb",
               "name": "Sunil Shetty",
               "profile_path": "/so2Xw9lVoyTo9HZr7NNpwyWm0M.jpg",
               "id": 85730,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Roma Singh",
               "gender": 1,
               "credit_id": "52fe4aa9c3a36847f81daeef",
               "name": "Raveena Tandon",
               "profile_path": "/kp43FoFUVwak2BNVHElt7cpfkud.jpg",
               "id": 123180,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Jibran",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daef7",
               "name": "Raza Murad",
               "profile_path": "/801Jj8tojATXM9Yhp6yOiqUqHPV.jpg",
               "id": 565160,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tyson",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daeff",
               "name": "Gulshan Grover",
               "profile_path": "/bGcwuGr8TXRbxoXX4Uzhx0E8G8D.jpg",
               "id": 42208,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kashinath Sahu",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daefb",
               "name": "Paresh Rawal",
               "profile_path": "/xFVHMvDC8s4Ab2sLXrdVxMxZ33b.jpg",
               "id": 85033,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Jailer (Roma's dad)",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daf03",
               "name": "Kulbhushan Kharbanda",
               "profile_path": "/1ECYLNlTHjgFzfGxbrzVSFZGDbN.jpg",
               "id": 53377,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Kamdev Kulkarni",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daf07",
               "name": "Sadashiv Amrapurkar",
               "profile_path": "/n0QGJBy2qDByMjBMYN8Zg2sZEWy.jpg",
               "id": 105444,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Pooja (special appearance)",
               "gender": 0,
               "credit_id": "52fe4aa9c3a36847f81daf0f",
               "name": "Priya Tendulkar",
               "profile_path": "/ab2mYMN1sD5jzPTLYX5V2zGRJYR.jpg",
               "id": 1041409,
               "order": 9
            },
            {
               "cast_id": 6,
               "character": "Priya Agnihotri",
               "gender": 0,
               "credit_id": "52fe4aa9c3a36847f81daef3",
               "name": "Poonam Jhawer",
               "profile_path": null,
               "id": 1045403,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Karan Saxena",
               "gender": 2,
               "credit_id": "52fe4aa9c3a36847f81daf0b",
               "name": "Avtar Gill",
               "profile_path": "/roz3UqgIYaIFQJfISO9onZUovY4.jpg",
               "id": 140683,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Jackson",
               "gender": 0,
               "credit_id": "5936e90cc3a3684bc1000d5d",
               "name": "Vishwajeet Pradhan",
               "profile_path": "/rTqr6t4T7CO5JlshhCVLgYRmwg0.jpg",
               "id": 562226,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Rizwaan (Jibraan's Brother)",
               "gender": 2,
               "credit_id": "5936e957c3a3684c28000d0a",
               "name": "Razak Khan",
               "profile_path": "/9paeCWimm9fTjv2VpBkdobX10er.jpg",
               "id": 86054,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Kranti Kumar",
               "gender": 2,
               "credit_id": "5936e96f9251417267000c79",
               "name": "Harish Patel",
               "profile_path": "/yEuGcdTN4Uzz4dKcSYOd2eg4hQ.jpg",
               "id": 53362,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Irfan",
               "gender": 2,
               "credit_id": "5936e98d925141729c000bf4",
               "name": "Tej Sapru",
               "profile_path": "/mdW1TxH1QzGG1swVwcq9TyTmP3z.jpg",
               "id": 1035920,
               "order": 15
            },
            {
               "cast_id": 15,
               "character": "Tony",
               "gender": 0,
               "credit_id": "5936e92fc3a3684be0000d1d",
               "name": "Vinay Sapru",
               "profile_path": null,
               "id": 1143467,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aa9c3a36847f81daedf",
               "name": "Rajiv Rai",
               "profile_path": "/uq6a5IUbweTrNiABcGqS2zLXxOb.jpg",
               "id": 583607,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5936ea04c3a3684c28000da0",
               "name": "Viju Shah",
               "profile_path": "/8TuBslh9hOqpabBsDEHi1h3M5KS.jpg",
               "id": 1106748,
               "department": "Sound",
               "job": "Music Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.616029,
      "production_countries": [],
      "id": 109028,
      "vote_count": 11,
      "budget": 0,
      "overview": "Journalist Roma Singh is the daughter of a jailer. While taking a tour of the jail, she is molested by some of the inmates, and an inmate, Vishal Agnihotri comes to her assistance. She finds out that Vishal is in for four homicides, and decides to investigate further. She finds out, with the help of the owner of her publications, Jindal that Vishal was compelled to take the law in his own hands when the courts failed to punish the assailants of his sister and sweetheart. Soon, Vishal is released from prison, and begins to work for Jindal. It is then that he realizes that he has just walked from a walled prison, to an open prison, as the truth behind his release slowly but surely starts to dawn on him.",
      "similar": [],
      "original_title": "Mohra",
      "runtime": 177,
      "poster_path": "/iNfTHUs0W0wsLxZdGjBcGHC15KT.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [],
      "release_date": "1994-07-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rajiv Rai"],
      "runtime": 177,
      "synopsis": null,
      "writers": [
         "Shabbir Boxwala",
         "Rajiv Rai"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0110546/",
      "coverLink": null,
      "actors": [
         "Akshay Kumar",
         "Raveena Tandon",
         "Naseeruddin Shah"
      ],
      "reviews": [
         "This movie is considered to be one of the greatest Hindi action movies so far. I actually have watched it several times, it has many twists and a lot of action and believe me, you will be at the edge of your seat all through the movie. The story is about Vishal Agnihotri (Sunil Shetty) who is sentenced to life imprisonment for killing four college students who raped and killed his wife and were responsible for the death of his sister-in-law. Roma Sing (Raveena Tandon) is a journalist who meets Vishal in jail where he comes to her rescue. Roma learns of Vishal's predicament and decides to help him by taking his case to Mr. Jindal (Naseeruddin Shah), a blind media tycoon. Mr. Jindal through his connections and media forces a special jury to review Vishal's case which later pardons Vishal. Vishal is indebted to Mr. Jindal and undertakes a risky mission which is killing all the drug dealers around who were responsible for the death of Mr. Jindal's wife. Vishal finds inspector Amar Saxena (Akshay Kumar), Roma's boyfriend, at the crossroads of his every mission. Ironically, Amar is also on the same mission as Vishal, but less successful as Amar has to work within the framework of law. At one point Mr. Jindal, Inspector Amr, Roma and Vishal find each other at crossroads realizing that each is being used as mere pawns by someone. But who is the manipulator and who is the conspirator? Watch Mohra to see how the game of life is played? The story, the songs, the soundtrack and the acting, especially Naseeruddin Shah and Sunil Shetty, are all great. Recommended for every Hindi movie fans. 8.5 out of 10.",
         "This movie I think is one of the greatest successes of Rajiv Rai. The plot is full of twists and turns and the name of the movie pretty much lets you know a few surprises are expected. The acting is good and the blockbuster song \"Tu cheez badi hai mast mast\" is just amazing. Rajiv Rai has done his best to keep the audience guessing and believe me you will be on the edge of your seats. It's a great movie that I would recommend to any Hindi movie lover.",
         "Mohra is a very well structured commercial film.It keeps the viewer entertained right from the very beginning. Directed by Rajiv Rai under the banner of Trimurti films,has Naseeruddin Shah(Jindal),Aksay Kumar(Amar Saxena),Sunil Shetty(Vishal), Raveena Tandon(Roma),Gulshan Grover(Tyson) and Raza Murad(Jibran)as the leading stars. Naseeruddin Shah (Jindal) is into media business and Raveena Tandon(Roma) works for him.Sunil Shetty(Vishal)is in jail as he murdered people responsible for death of his wife and sister in law.Naseeruddin Shah (Jindal) and Raveena Tandon(Roma) help him get out of jail,as he was forced to take law it his own hands,since he did not get justice. After his release Naseeruddin Shah (Jindal) directs Sunil Shetty(Vishal) to eliminate drug dealers Gulshan Grover(Tyson) and Raza Murad(Jibran) for the betterment of society.Aksay Kumar(Amar Saxena),plays the cop who suspects Sunil Shetty(Vishal) for the killings of gang members belonging to Gulshan Grover(Tyson) and Raza Murad(Jibran).Slowly Sunil Shetty(Vishal) realizes he is being used as a pawn or as a mere instrument,and it is from here the story becomes more interesting. Overall a very entertaining and a well scripted movie,with some great music by Viju Shah.A must watch!",
         "One of the most entertaining action thrillers in the history of bollywood. Watch it for some great bollywood masala stuff. Both Akshey and Sunil are fabulous in their roles. I don't think so any one would have done the role of Jindal better than Naseeruddin Shah. Some foot tapping music and gripping background score. The story never loses its grip, something different in bollywood. Rightly declared a great blockbuster, has a long lasting impression on you. Paresh Rawal, Raveena tandon are good in their roles. Razaa Muraad and Gulshan Grover fit in their shoes perfectly. The action scenes are quite great. Watch it again and again and again and again and again.I myself have watched it around 25 times.",
         "The 1990s was filled with action thrillers; most of these films were either average or poor in terms of content. However, there were a few which were memorable. Mohra(1994) is one of the few memorable action thrillers which clicked well at the box office; it was also decently received. The director, Rajiv Rai, was known for his action films. He directed typical action films like Yudh(1985), Tridev(1989) which were box office hits. After an average Vishwatma(1992), he returned with this film, Mohra(1994). Mohra(1994)showcases an important message at the beginning of the film. It is important to \"love life and hate drugs\". This movie is based around drug related crimes. It has Vishal Agnihotri, a man who ends up being a murderer after his loved ones become unfortunate victims of some criminals. He ends up rotting in prison but a beautiful journalist, Roma Singh, befriends him and gets him released with the help of Jindal, her boss. Roma falls in love with an honest and diligent inspector, Amar Saxena. Amar is hot on the trail of several drug related criminals. He nabs criminals but many end up getting killed. Amar finds Vishal near the crime scenes but cannot arrest him due to the lack of evidence linking him to the murders. Is Vishal murdering the drug related criminals? Is Amar wrong about Vishal? Why was Jindal so eager to get Vishal out of prison? To find out, watch Mohra. Rajiv Rai handles the film well. He has put special attention to the action sequences. He has utilized his action heroes, Akshay and Sunil, really well. For once, the heroine has more to do than just sing and dance. He has handled the twist well because when it happens in the film, it is like a complete shocker. The small doses of humour are funny. The climax is good for its time but the very end is terribly overdone. There was no need to stretch it any further and getting Sunil's character badly wounded was unnecessary. There were a few flaws. For example, How is it possible for our two action heroes to stay in the closed trunk of a car? They were hidden but it is not possible to hide in there for long to surprise attack the enemies. However, such illogical scenes are few and far between. Therefore, the impact of the film is not too reduced. Sunil Shetty has a meaty role here and he does a decent job. He was no great actor but he was always superb at stunts. He is not good with shouting scenes and he does ham occasionally. However, he is earnest and he does well for the most part. Akshay Kumar was not a big star back then. He did not have content driven films like Baby(2015) and Special 26(2013) back then. If he had something, it was his martial arts and the reflex action of martial arts which caused him to dance well. He makes great use of these skills. On top of this, he does not ham too much. He was still a little raw those days but he does well. Raveena Tandon is good. She is good looking and she acts well by doing her scenes sincerely instead of being a mere prop. Naseeruddin Shah is great, he had not done a role like this before. He was a great art film actor but he showed that he could do well in commercial films as well. Sadashiv Amrapukar is funny, he brings in some good moments. Poonam Jhawar has a very small role and she does a decent job. Paresh Rawal is good, his role is more on the comic side and he entertains. The rest provide good support. Viju Shah's music is good. Tip Tip Barsa Paani is a sensuous track; it is well shot. Tu Cheez Badi Hai Mast was the superhit song from the film and it is great. Subah Se Lekar Sham Tak is melodious. The female version of Tu Cheez is good but it was not needed in the film. Na Kajre Ki Dhar is a good song. It is beautifully shot. Action is well directed. The stunts seem pretty real with very few overdone shots. The stunts are entertaining; these are the most entertaining bits of the movie. It is a pleasure watching Akshay use his martial art style action moves and Sunil use his round punches. On the whole, Mohra is an action thriller which succeeds from many aspects. It has good action, good songs, nice performances, and good direction. This clearly explains the reason why this film did very well at the box office.",
         "each and every actor in this movie give their best but or me as i concern Sunil Shetty was the best as every person wants to become like him as an actor in that movie Akshey Kumar is also good raveena tandon looks charming Naseerudin Shah as always been one of the most versatile actor Paresh Rawal was hilarious Rajiv Rai gives his best action movie and this movie always be remembered and at the same time the songs were excellent NA KAJRE KI DHAR was the best for me i will recommend this movie to every those people who fond of action movies i will definitely give 9 out of 10 because this movie u can repeat so many times and i sure u never get bored",
         "Journalist Roma who one day decides to take a tour around her father's jail, was being molested by some of the inmates in there. Another inmate called Vishaul comes to her rescue. In this way she befriends Vishaul and decided to delay deeper into his story. She soon found out that he was given a death sentence by the court because of four homicides. Then she along with her boss Mr. Jindal decides to install some justice into the case because they taught that there were no other way out for Vishaul than breaking the law. Soon Vishaul is released from jail and he decides to work for Jindal and follows a path which will only lead him to the grave yard.",
         "I found this movie decent.Script is good,Soundtrack is good,Acting is good,Decent story,Direction is decent.It opens when a tough guy is send to jail.Roma goes to that place.Then a man attacks her.Vishal saves her.Vishal says that his wife's sister to a college party.She got raped in taht party.And died.Then one night those guys come back.His wife Priya goes to the kitchen kills herself in front of those guys(In the movie they taught she was murdered).Vishal kills them and lands in jail.Roma wants to do justice.She comes across Amar and it begins.The climax is bad.Vishal dies.Akshays is the star of the movie his performance is amazing.His dialog delivery,Facial expressions etc are amazing.Raveena was great.Sunils performance is wonderfully knit.Nasserudin was great in his role.Fighting scenes are awesome.Lady which played Rita was annoying and very unrealistic and did not looked pretty.All the others acted good.The characters have gray shades(Negative ones) the others light shades.\"Na Kajre\"\"Tip tip barsa pani\" and \"Tu Cheez badi hai mast mast\"are absolutely melodious tracks.Anyway Decent.Watch it once Rating-6/10",
         "....is the main reason I saw the movie, and recently too.....nostalgic for that super-hit song which I haven't heard in a while. The movie overrall was \"eh\". I don't know Hindi, but I can tell the acting wasn't all there based on other Hindi movies I have watched. The songs were amazing albeit having nothing to do with the movie itself. The plot was decent but could have been strengthened with better acting especially from the big Bollywood names that were in this movie. Anyway, classic because of the songs, not much the movie itself.",
         "So, having seen Rajiv Rai's Tridev, which I enjoyed, and heard a lot of positive feedback about this film, I thought I'd give it a try. Mohra is nothing more than an ordinary 90s masala flick, which is cheesy, overblown and quite lacking in substance. The action itself, which of course has to be its main strength, is for the most part extremely exaggerated and typically unrealistic. The story and writing are poor, presenting the age-old formula of the good vs. the evil, where the evil is more of a monster and the law is dumb and totally corrupted. The film, however, is not without its moments, and it has some very nice songs, including the popular \"Tu Cheez Badi Hai Mast\". The acting is very average, with Akshay Kumar and Sunil Shetty doing their usual routine of the times, Raveena Tandon looking absolutely gorgeous and charming, and only Naseeruddhin Shah rising above the script with a fun, tongue-in-cheek performance and never taking it all too seriously. The ending was most dramatic and predictable, and overall this is a movie with little good to offer. Had I seen it as a child, it might have held some nostalgic value for me, and children may still enjoy it today as it really is a kind of a fairy-tale, but otherwise, it just doesn't hold up well today at all.",
         "awesome movie by rajiv mehra. great direction in whole film industry. i can't believe it taking such a long star cast could make such a good movie.The film is especially remembered for its music which became chartbusters in that year. The popularity of the song \"Tu Cheez Badi Hai Mast Mast\", which was picturised on Raveena Tandon led to her being nicknamed \"The mast mast girl\".(English: Pawn) is a 1994 Indian action thriller film directed by Rajiv Rai starring Sunil Shetty, Naseeruddin Shah, Akshay Kumar and Raveena Tandon in the lead roles while Paresh Rawal, Gulshan Grover, Raza Murad and Sadashiv Amrapurkar and Kulbhushan Kharbanda played supporting roles. The film was released on 1 July 1994. The film went on to become the second highest grossing Indian film of 1994 and earned a Blockbuster status.[1][2] The film got 9 Filmfare nominations in 1995. It was the first time where the trio of Akshay Kumar, Sunil Shetty and Paresh Rawal worked together.action from drama comedy songs everything in this picture. there is no shortage in this picture.it is a complete entertainment package.maybe now got to see a picture like this again.as my opinion i give to 10out of 10.",
         "I love this movie for only one reason Raveena Tandon I watched it a year ago and I was not that interested until Akshay Kumar turned up and before you know it that song appeared Tu Cheez Bari Hai Mast Mast. I don't know many other Rajiv Rai movies but I hope he hasn't quit the industry I'd love to see another flick with him as director. I think Raveena Tandon can dance well also I have seen her in more serious roles but I wish she would do something like this again and get back with her on screen partner Akshay in real life they made a great couple. I would give this movie 7 OUT OF 10",
         "Rajiv Rai after the super success of TRIDEV and dismissal VISHWATMA which did average business returned with another full on action film mixed with a thriller MOHRA The film starts off well, Suneil's intro is well done but the romance angle between Akshay and Raveena is ordinary The game plan of Naseer is well planned and handled and the film keeps you on the edge though the excess of stunts and music does take away the impact The revelation in the second half is brilliant but Suneil's escape is far fetched The finale is predictable though good Direction by Rajiv Rai is decent Music is good, TU CHEES is best Amongst actors Akshay Kumar sleepwalks in his cop role like he did those days with his bad dialogue delivery Suneil Shetty is better but he makes you cringe when he goes high pitched yet a good performance Their action combat is excellent though Naseer steals the show in one of his best performances Raveena is okay though she does annoy at times Paresh is funny Raza Murad annoys, Gulshan Grover is okay the rest are okay",
         "Rajiv Rai is best known to be directing action thrillers with story lines that makes perfect sense. Out of all the mindless action thrillers even today, Rajiv Rai is who i consider the best directors among all. Though i wish he could make more and replace Rohit Shetty. Anyways from the guy that made Tridev (1989) and Vishwatma (1992) he made one of his other best creation, Mohra (1994) Mohra is an action thriller that deals with the issues of police and drug enforcement and what better explanation than with Rajiv Rai's Mohra. The story starts with Vishal Agnihotri (Sunil Shetty) saving Roma Singh (Raveena Tandon) in a prison after a bunch of prisoners attempted to rape her. Roma then sympathizes Vishal and helps him get released after serving a sentence of murdering 4 college boys after they brutally raped his sister-in-law and murdering his wife. After he was released, he meets the man who helped him get released, Jindal (Naseeruddin Shah). Jindal enforces Vishal to be his right- hand man in order to eliminate drug tycoons Tyson (Gulshan Grover) and Jibran (Raza Murad) and their colonies. However, Vishal's mission is cross-pathed with Roma's fiancée, Inspector Amar Saxena (Akshay Kumar) and his sidekick Kashinath Sahu (Paresh Rawal) hot on his trail. Apart from their trail of nabbing Vishal, Amar is hot headed to find the murderer of his father Karan Saxena (Avtar Gill, in an appearance) and Kashinath is secretly an informer to Jibran. With many twists and turns, the story is by-far amazing thanks to Rai. The action sequences and dialogue deliveries were terrific, and it's not one of those movies where they put random action sequences and songs just to take a break, they are put correctly and used very well. Performances. I feel this is one of Naseeruddin Shah's best performances and got a role that would change his life because his dialogues and expression were awesome as the blind-turn-villainous Jindal. Raveena Tandon did terrific too considering this is her best film she did. Akshay Kumar as Amar gets a bit boring considering he's an inspector who punches and kicks for a living, though he did good with his action sequences. Paresh Rawal provides excellent comedy. However, this film completely belongs to Sunil Shetty as Vishal. His expressions, dialogues, and his action sequences were on the top and dominated the film. Many of you guys say he hammed a lot in the film. I personally disagree because he did better than all the cast. The rest were good. The music of the film was awesome with \"Tu Cheez Badi\" and \"Na Kajre\" were the best songs in my opinion. The rest are worth listening too. Overall, Mohra is one action thriller film with a terrific story to explain. I recommend this film for Rajiv's best directing and all of the performances in the film",
         "Vishal (Sunil Shetty), a murder convict, is released on compassionate grounds before his sentence is up. Once out of prison, he's enlisted by media tycoon Jindal (Nasseruddin Shah) to eliminate drug traffickers who are destroying the very fabric of the society. The big bosses of the drug mafia are assassinated one after the other in rapid succession. Amar (Akshay Kumar), an honest and committed policeman in charge of the case is convinced that Vishal is responsible for bumping them off. Will Amar succeed in nailing Vishal? Will Vishal's mission succeed? Is everything as simple as it appears on the surface? Mohra was a movie with a pretty good plot, given that it was made in the 90s, when the quality of Hindi movies was terrible. Viewed today, the treatment would appear too unrealistic and the characters caricature like. There is a wholly superfluous romantic angle which is frankly inconsequential in a thriller. But given the quality of Hindi movies made in the 1990s and the formulaic treatment typical in that era, Mohra was an excellent movie. The songs in the movie were incredibly popular in the 90s and it must be said that they have aged well. The 'tu cheez badi hai' song was one of the biggest chart busters of that era. Akshay Kumar's costume in that song was a rage in the mid 90s. As for the acting, the leads (Akshay Kumar, Sunil Shetty and Raveena Tandon) were just about adequate. Its the supporting cast that really stands out in this movie. Nasseruddin Shah, Paresh Rawal and Sadashiv Amrapurkar were magnificent despite their limited role and the limited scope that the script afforded them- I have given 2 stars only for their performance (especially Paresh Rawal). At this distance in time, Mohra is best viewed as a product of its time. If you haven't watched too many Hindi movies from the 90s, keep your expectation low- you won't be disappointed."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Trimurti Films Pvt. Ltd."],
      "summaries": [
         "Journalist Roma Singh is the daughter of a jailer. While taking a tour of the jail, she is molested by some of the inmates, and an inmate, Vishal Agnihotri comes to her assistance. She finds out that Vishal is in for four homicides, and decides to investigate further. She finds out, with the help of the owner of her publications, Jindal that Vishal was compelled to take the law in his own hands when the courts failed to punish the assailants of his sister and sweetheart. Soon, Vishal is released from prison, and begins to work for Jindal. It is then that he realizes that he has just walked from a walled prison, to an open prison, as the truth behind his release slowly but surely starts to dawn on him.",
         "Tony gets addicted to drugs and this result in his fiancée, Rita being raped by four young guys. When this news reaches Rita's brother-in-law Vishaul, he took the help of the law but fails, frustrated at this act he decides to take the law into his own hands and is given death penalty, while in custody, he rescues a journalist, Roma who were taking a tour around the jail, befriends her and with the help of her boss Jinhal she finally gets Vishaul released. Here is where he became a cold-blooded murderer accepting contracts to kill from Jinhal, thinking that he is evading crime from the city but what he does not know is that he is merely a pawn in the hands of Jinhal.",
         "Roma Singh is employed as a journalist at Samadhan and is the only daughter of a jailer. While taking a tour around her dad's jail she is molested by some inmates and a kind hearted inmate Vishaul Agnihotri comes to her rescue. She realizes that Vishaul is kind hearted and that the actual place for him is not jail and with this she decides to question him as to how he reaches the dungeon. As per her realization she does find out that Vishaul was compelled to take the law into his own hands as the law abiders fail to punish the four young guys who murder his girlfriend and her sister. Thus with the help of her publication Mr. Jindal she gets him free from the law. To return Mr. Jindal's favor Vishaul begins to work for him by killing smugglers and gangsters. But will this path of Vishaul help him remain out of prison or will it take him to the same prison Roma freed him from?",
         "Vishal Agnihotri is imprisoned for four homicides but is soon released from jail as a result of an appeal made in a court of law by a journalist named Roma Singh and her boss, Mr. Jindal. To pay back Jindal's favor Vishaul is forced to work for Jindal in seeking revenge from Jindal's perpetrators. Soon Vishaul comes to know that he is only a pawn in Jindal's game plan and he himself is not what he claims to be."
      ],
      "budget": 0
   },
   "movielensId": 134336,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "1994-07-01",
      "dvdReleaseDate": null,
      "directors": ["Rajiv Rai"],
      "runtime": 177,
      "movieId": 134336,
      "title": "Mohra",
      "mpaa": null,
      "actors": [
         "Naseeruddin Shah",
         "Akshay Kumar",
         "Sunil Shetty",
         "Raveena Tandon",
         "Raza Murad",
         "Gulshan Grover",
         "Paresh Rawal",
         "Kulbhushan Kharbanda",
         "Sadashiv Amrapurkar",
         "Priya Tendulkar",
         "Poonam Jhawer",
         "Avtar Gill",
         "Vishwajeet Pradhan",
         "Razak Khan",
         "Harish Patel",
         "Tej Sapru",
         "Vinay Sapru"
      ],
      "imdbMovieId": "0110546",
      "originalTitle": "Mohra",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Journalist Roma Singh is the daughter of a jailer. While taking a tour of the jail, she is molested by some of the inmates, and an inmate, Vishal Agnihotri comes to her assistance. She finds out that Vishal is in for four homicides, and decides to investigate further. She finds out, with the help of the owner of her publications, Jindal that Vishal was compelled to take the law in his own hands when the courts failed to punish the assailants of his sister and sweetheart. Soon, Vishal is released from prison, and begins to work for Jindal. It is then that he realizes that he has just walked from a walled prison, to an open prison, as the truth behind his release slowly but surely starts to dawn on him.",
      "tmdbMovieId": 109028,
      "avgRating": 2.57143,
      "releaseYear": "1994",
      "numRatings": 7,
      "posterPath": "/iNfTHUs0W0wsLxZdGjBcGHC15KT.jpg"
   }
}