{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "abandoned house",
            "id": 8303
         },
         {
            "name": "woods",
            "id": 9720
         },
         {
            "name": "guilt",
            "id": 33720
         },
         {
            "name": "wooden leg",
            "id": 157898
         },
         {
            "name": "farm house",
            "id": 161196
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0039757",
      "video": false,
      "title": "The Red House",
      "recommendations": [
         28392,
         29470,
         27036,
         29835,
         20298,
         34650,
         27543,
         20028,
         36332,
         20362,
         41018,
         26530,
         25498,
         25689,
         20675,
         32887,
         1840,
         18871,
         27635,
         36949
      ],
      "backdrop_path": "/8TsEVWaOFrcK3uXSAppyhOBuy8Z.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Steve",
         "id": "57f2f93e9251410c2e003f56",
         "content": "The Red House is one of the first rural noirs. \r\n\r\nSome casual noir fans may be surprised that so many noir stories take place outside the rain-soaked dark alleys of the city.  \"Rural noir\" has been happening since the beginning of the noir movement with Albert Dekker crawling out of a abandoned mansion in the swamp in Among the Living.  It continued on with some truly great films like the atmospheric greats Moonrise and On Dangerous Ground (that one at least starts in the mean streets of the city).\r\n\r\nAnd as Gary notes at NoirWorthWatching, Rural noir is as big as it ever was.\r\n\r\nThe Red House is perhaps the most well known of the bunch due to it being in the public domain.  And --like Too Late for Tears -- was available in nearly every bargain film noir DVD collections released.  Every collection had the same copy.  It looks like the movie was fished out of Edward G. Robinson's sunken car after the movie wrapped.  (As I mention below, that's not necessarily a bad thing.)\r\n\r\nThis year, along with many other noir, it was re-released on DVD in great shape.\r\n\r\nUnfortunately, this isn't the best Rural noir or Edward G. Robinson film noir.  But it is worth a look again thanks to the films strangeness.\r\n\r\nFirst, the teenagers in the film.  All the actors seem to be the right age except for the second billed Lon McCallister.  His crow's feet and receding hair line made me think he should probably consider the advantages of a reverse mortgage when he starts blabbing on about buying a little house with Julie London.  His scenes with his single mother reach David-Lynch levels of creepiness.  Like when he kisses his mother full on the lips before insisting she have fun on her honeymoon.  Writers try to explain his age by saying that farm boys went to high school years longer due to having to take so much time off to take care of the family farms.\r\n\r\nLondon was one of the inspirations for Jessica Rabbit (along with Rita Hayworth's Gilda and Veronica Lake's peek-a-boo hair).  You'll quickly figure out what parts when London strips down for a swim with Lon.  She literally steals every scene she's in.  London would quickly change tracks in her career focusing on her lounge act, with occasional acting roles.  The rarely-seen The 3rd Voice is one worth seeking out.  Being the body for Jessica Rabbit and the ex-wife of Jack Webb is enough to make her film noir royalty.  I'm old enough to remember her as Dixie on Emergency! and I could never understand why men where jumping through hoops over the older cigarette-aged nurse on the show.  Trivia: London got the Emergency! gig so producer Webb wouldn't have to pay her any more alimony.\r\n\r\nAllene Roberts plays the adopted daughter of Robinson and Judith Anderson.  She has one of those breathy teenage girl voices that EVERY girl had in movies around this time.  It's annoying.  But she does a very good job as a troubled coming-of-age girl.\r\n\r\nFor anyone that thinks the 40s were a more innocent time should check out The Red House.  All the girls are sexualized, with Roberts walking around in tight sweaters an bullet bras -- and she's the good girl.  Not to mention 20-something Rory Calhoun picking up high-school aged London.  (Calhoun is unfortunately known today as an odd Simpsons reference)\r\n\r\nAs for the adults, Robinson and Judith Anderson first appear to be husband and wife.  In fact they are brother and sister -- his sister giving up her life for her brother.  Their daughter turns out not to be their daughter.  Without giving away too much, it's clever how the film makers make us assume their relationships when really it's much darker.\r\n\r\nRobinson's best film noir roles were all right around this time.  The Stranger, Scarlet Street, Woman in the Window, Key Largo and Double Indemnity all were released within 5 years of this one.  All are superior to this.  I will say he does his bug-eyed crazy acting that reminds me of his gangster films like Little Caesar.\r\n\r\nAnderson isn't given much to do.  Which is a shame.  She does have a moment when she demands to know if teenage Roberts was touched by her brother.\r\n\r\nMoments like that are creepy but probably not in the way the film makers intended.  The direction (by Delmer Daves -- director of Dark Passage also in '47) is surprisingly flat and the music -- especially the romantic, innocent music over the teenagers scenes-- is so generic that its clear no thought was put into the soundtrack. \r\n\r\n\r\n\r\nThe film reminds me a bit of Blue Velvet-- where everyday life is stripped away to reveal horrible secrets and violence. But it's nowhere near in the same league. Worth a watch though and the ending is satisfying.\r\n\r\none final note:  Advantages of a bad print.  I will say that I enjoyed this movie more watching a bad print of it.  It gave it a more chilling quality.  Cleaned up beautifully on DVD is great, but the film actually loses some of it's mystery.  The same could be said for other movies I watched for years like Key Largo and Foreign Correspondent.  The copies I first saw appeared like the film was recovered from the wreckage of the movies actions, left out in the rain, put through a broadcast filmchain and transferred to video.  www.noiroftheweek.com",
         "url": "https://www.themoviedb.org/review/57f2f93e9251410c2e003f56"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Pete Morgan",
               "gender": 2,
               "credit_id": "52fe44029251416c91001e95",
               "name": "Edward G. Robinson",
               "profile_path": "/af1aBRi4UccaxtmDPWEtlfy1vXE.jpg",
               "id": 13566,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nath Storm",
               "gender": 2,
               "credit_id": "52fe44029251416c91001e99",
               "name": "Lon McCallister",
               "profile_path": "/f2JLL2z1hbbFwtHJkuHYeUirycX.jpg",
               "id": 105795,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ellen Morgan",
               "gender": 1,
               "credit_id": "52fe44029251416c91001e9d",
               "name": "Judith Anderson",
               "profile_path": "/ryTVWN7XI2WejLsFhicfx3yJ6y9.jpg",
               "id": 3362,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Teller",
               "gender": 2,
               "credit_id": "52fe44029251416c91001ea1",
               "name": "Rory Calhoun",
               "profile_path": "/u3cFCfaGNsUMDTV1CbXS64YZecv.jpg",
               "id": 19181,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Meg",
               "gender": 1,
               "credit_id": "52fe44029251416c91001ea5",
               "name": "Allene Roberts",
               "profile_path": "/iquYwr7sBmLwcv8QHG43ykMn8g0.jpg",
               "id": 105796,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tibby",
               "gender": 1,
               "credit_id": "52fe44029251416c91001ea9",
               "name": "Julie London",
               "profile_path": "/iYvk9a08xkC2tgfRnvlBafwyJuT.jpg",
               "id": 50760,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mrs. Storm",
               "gender": 1,
               "credit_id": "52fe44029251416c91001ead",
               "name": "Ona Munson",
               "profile_path": "/44tClPD8yyeHeEooFyVX2zfPxFB.jpg",
               "id": 105797,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Dr. Jonathan Byrne",
               "gender": 2,
               "credit_id": "52fe44029251416c91001eb1",
               "name": "Harry Shannon",
               "profile_path": "/7Js8vAjzKzM5eXcu6THDzWM7j5P.jpg",
               "id": 4077,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "The Sheriff",
               "gender": 2,
               "credit_id": "52fe44029251416c91001eb5",
               "name": "Arthur Space",
               "profile_path": "/wZjrUXjfvoKL369xn5oMDGIg2wK.jpg",
               "id": 34365,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Motorcycle Cop (uncredited)",
               "gender": 2,
               "credit_id": "57a108b9c3a36868770006a3",
               "name": "Pat Flaherty",
               "profile_path": "/g1wNobJloszAtbnHe5E3kNQyCE8.jpg",
               "id": 125842,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Don Brent (uncredited)",
               "gender": 2,
               "credit_id": "57a109d0c3a368479d0011d3",
               "name": "Walter Sande",
               "profile_path": "/f00AxGufQUX1EaO8gKswFUQPyDG.jpg",
               "id": 94293,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44029251416c91001ebb",
               "name": "Delmer Daves",
               "profile_path": "/l5oNQDoPSEhiKvUmRMldt5QE9hC.jpg",
               "id": 76981,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "576b4129c3a36847ad000967",
               "name": "George Agnew Chamberlain",
               "profile_path": null,
               "id": 1338893,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "576b4135c3a36847ad00096e",
               "name": "Delmer Daves",
               "profile_path": "/l5oNQDoPSEhiKvUmRMldt5QE9hC.jpg",
               "id": 76981,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "576b41449251416dc9000a0d",
               "name": "Sol Lesser",
               "profile_path": null,
               "id": 592943,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "576b4151c3a36811540018a5",
               "name": "Miklós Rózsa",
               "profile_path": "/1eAU1ckh7SUNMP9IZeii9qX5xa.jpg",
               "id": 7647,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "576b415e9251416e500009ea",
               "name": "Bert Glennon",
               "profile_path": "/xLzo0JqItVHAm8OqlhyRQxEw5k9.jpg",
               "id": 14960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "576b416b9251416e8100095d",
               "name": "Merrill G. White",
               "profile_path": null,
               "id": 70568,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "576b41769251416dc9000a26",
               "name": "McClure Capps",
               "profile_path": null,
               "id": 1340098,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "576b41859251416dc9000a30",
               "name": "Frank Beetson Jr.",
               "profile_path": null,
               "id": 960057,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "576b4194c3a36811540018d8",
               "name": "Irving Berns",
               "profile_path": null,
               "id": 1640107,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.90958,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30162,
      "vote_count": 20,
      "budget": 0,
      "overview": "Pete and Ellen have reared Meg as their own, ever since she was a baby and her parents took off. Now a teen, Meg convinces her friend Nath to come help with chores on the farm: Pete isn't getting around on his wooden leg like he used to. When Nath insists on using a short cut home through the woods, Pete gets quite agitated and warns him of screams in the night, of terrors associated with the red house. Curious, Meg and Nath ignore his warnings and begin exploring. Meg begins falling in love with Nath, but his girlfriend Tibby has other plans for him. Meanwhile they all get closer to real danger and the dark secret of the red house.",
      "similar": [
         996,
         17609,
         14638,
         910,
         3112,
         20367,
         3766,
         16958,
         17136,
         18671,
         43461,
         678,
         25736,
         25551,
         19119,
         20000,
         22112,
         54392,
         18995,
         37992
      ],
      "original_title": "The Red House",
      "runtime": 100,
      "poster_path": "/svLo3Cibzv2BqSlvoLYUcCIQRmL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sol Lesser Productions",
         "id": 4213,
         "origin_country": ""
      }],
      "release_date": "1947-03-16",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "YOU DARE NOT EVEN GUESS THE STRANGE LOVE STORY OF \"THE RED HOUSE\"",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Delmer Daves"],
      "runtime": 100,
      "synopsis": "Pete Morgan and his sister Ellen are prosperous farmers, but their farm is starting to look rundown due to Pete's advancing age and his handicap from an artificial leg. They are known as \"the mysterious Morgans\" because of their adopted daughter Meg. No one knows who her parents were or how Pete and Ellen came to adopt her when she was a toddler. Now eighteen, Meg suggests that Pete hire a classmate of hers, Nath Storm, to work on the farm after school. Nath's widowed mother operates a general store in town but business is not good. Pete is reluctant to take on a farmhand because he doesn't want outsiders around, but Meg talks him into it. To her delight, Nath is allowed to start at once. During dinner, Pete and Ellen are somewhat taken aback to hear Nath refer to them as \"the mysterious Morgans.\" Ellen explains that they are so self-sufficient on the farm that they rarely go into town. As for Meg, her parents left her in the Morgans' care while they took a trip. They were killed in an accident and as there were no other relatives, Pete and Ellen adopted her. Since it is late, the Morgans urge Nath to spend the night in the hired hand's cabin. When he insists on going home, Pete orders him not to go through Oxhead woods. The woods are dangerous and hard to navigate after dark. Nath protests that going the other way will take much longer. As he is trekking through the woods, someone knocks him into a stream. He returns to the farm sopping wet and accuses Pete of waylaying him. Pete again orders him to stay away from the woods. Meg is in love with Nath but he has a girlfriend, Tibby Renton. Although the two plan to marry, Tibby is attracted to Teller, an older man with a questionable past. He gives Tibby some money and asks her to buy him a savings bond. He doesn't want to be seen in town. They arrange to meet at a later date so she can give him the bond. Pete sometimes calls Meg \"Jeannie\" and mentions an abandoned dwelling in the woods called the Red House. She is uneasy when this happens but the Morgans have always been very good to her. Pete bought new furniture for her bedroom and gives her anything she asks for. Ellen is like a mother to her. Nath's mother closes the store and marries her boyfriend. The couple move away, leaving Nath on his own. Once school is out, he begins working full-time for the Morgans. Pete offers him the use of his car to go see Tibby on Sundays. Meg, Nath, and Tibby try to find the Red House. As they move deeper into the woods, Meg is struck by a feeling that she has been there before. When Tibby complains of being tired, they return to the farm and take a swim in the pond. But then Tibby lets it slip that they were looking for a mysterious house in the woods. Pete is furious and later tells Meg he is going to fire Nath. He says they were happy until Nath came around asking questions. Nath has already asked his mother about what happened to Pete's leg. Mrs. Storm says that Pete fell into a quarry many years earlier and the local physician, Dr. Byrne, amputated the leg on the Morgan's kitchen table. Tibby and Teller secretly meet and she gives him the bond. Although she is slightly afraid of him, that doesn't stop her from responding to his advances. It turns out that Pete has hired Teller to keep people out of the woods. He was the one who pushed Nath into the stream earlier. Pete is angry that Teller doesn't seem to be doing his job and threatens to fire him. Teller assures him that next time he will use stronger measures. Tibby's father owns an orchard. After being discharged by Pete, Nath goes to work for Mr. Renton. He and Tibby discuss their future and he is startled to learn that she wants to move away after their marriage. She wants a lifestyle that he cannot possibly give her. Later, Nath catches Tibby and Teller kissing. He and Teller get into a fight and Teller knocks him out. After that, Nath realizes that it is Meg he has loved all along. Meg decides to explore Oxhead woods on her own. Not wanting Pete to see her leaving the house, she climbs out the window and down a large tree. She follows an old trail and comes to the top of a hill. Below is an abandoned house, with an icehouse next to it. At last she has found the Red House. Before she can explore further, shots ring out. Teller is attempting to scare her off. As Meg runs toward home, she trips and breaks her leg. Nath eventually rescues her. Meg is forced to stay in bed until the cast is removed. Since he is not allowed to visit her, Nath climbs the tree and sneaks into her room. She tells him about finding the Red House. Pete overhears their conversation and comes to Meg's room. They hear him coming and Nath leaves, but Pete knows he has been there. He scares Meg by calling her Jeannie. Later, Pete and Ellen argue. She was once engaged to Dr. Byrne and accuses Pete of ruining her plan to marry. Pete didn't try to stop her but wouldn't let her take Meg with her. In a fury, he throws a lamp at Ellen and injures her arm. Meg hears the commotion and calls out to Ellen. Hiding her injury, Ellen assures Meg that nothing is wrong. Matters come to a head when Meg confides in Ellen that Pete watches her in a way that makes her uncomfortable. Ellen asks if he has ever forced himself on her. He has not, but Ellen decides to burn down the Red House. Only then will Pete be at peace. Meg wants to go with her but cannot walk so far due to her leg. She hides in the hired hand's cabin while Ellen, armed with a jug of gasoline, sets off for the Red House. Teller doesn't recognize Ellen in the darkness and fires off several shots. Ellen is hit and collapses. When Teller realizes what he has done, he runs away. Meg finds Ellen seriously injured and renders what first aid she can. Returning to the house, she begs Pete to help her rescue Ellen. But he says it is too late, once more mentioning Jeannie's name. Meg suddenly remembers that her mothers name was Genevieve and asks Pete if that is really Jeannie. Failing to get Pete's help, she telephones Nath. Ellen is dead by the time they reach her. They carry her home on a makeshift stretcher. Nath telephones the sheriff and goes in search of Teller. But Meg is terrified that Teller will shoot him. She begs Pete for help, saying that Jeannie will forgive him. She and Pete set off for the Red House in the truck. Meanwhile, Teller has gone to Tibby's house and persuaded her to elope with him. They set off in the Rentons' truck but the police are soon in pursuit. Tibby asks Teller what he has done. She realizes she doesn't want to marry him after all. When the police catch up with them, Teller is arrested for the murder of Ellen. Nath is not at the Red House when Pete and Meg arrive. They go inside and Meg realizes she once lived there. Pete locks the door, frightening Meg, but he assures her he is going to protect her this time. He lights a candle and Meg sees her baby bed still standing. Pete tells her the entire story. He and Jeannie were having an affair. When Jeannie broke it off, he went to the Red House to persuade her to change her mind. Meg's father drove up in a surrey. To keep Jeannie quiet, Pete put his hand over her mouth and nose, accidentally smothering her. He also killed Meg's father. Putting the bodies into the surrey, he drove it into the icehouse. The spring had broken through the floor and the surrey sank. In a fit of remorse, Pete tried to commit suicide by jumping into the quarry. Meg hears Nath and the sheriff outside and calls for help. Pete nearly smothers her in the same way he did Jeannie. When Nath and the sheriff burst into the house, Pete runs outside and climbs into his truck. Turning it around, he heads for the icehouse. He drives through the door and the truck sinks. As it goes down, a wheel from the surrey floats to the top. The movie ends with Nath finishing what Ellen started. As the Red House goes up in smoke, Meg and Nath watch.",
      "writers": [
         "George Agnew Chamberlain",
         "Delmer Daves"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039757/",
      "coverLink": null,
      "actors": [
         "Edward G. Robinson",
         "Lon McCallister",
         "Judith Anderson"
      ],
      "reviews": [
         "First, I saw this as a child and recall being absolutely mesmerized and terrified by the creepy music associated with the house. Upon seeing it again some months back, I was immediately brought back to childhood and felt the same strangled dread. Sometimes memories of things from youth don't hold up but in this case, RED HOUSE remains a bizarre and scary movie into adulthood. Robinson's performance is very atypical but effective. He was a far more versatile actor than most people realize. As definitive as his fatcat gangster kingpin roles were in LITTLE CAESAR, KEY LARGO and the like, he was equally believable as victims and suckers, as in movies like SCARLET STREET. It is surprising that the studio was able to slip some very sexual material by the censors into this movie; Robinson is a deeply troubled and surprisingly sympathetic \"deviant\" here and things are handled with relative frankness. This isn't a perfect movie (some motivational problems in particular) and i didn't plan to comment on it, but i strongly disagree with the comments of another reviewer who dismissed Robinson so I wanted to briefly opine with my dissenting opinion. One final note: besides the highly chilling music, this movie features a very haunting ending that will stay with you. This is pretty twisted stuff given the era, and despite some datedness, it's certainly worth a look for those who like their noir Gothic and haunted.",
         "Thrilling Film-Noir written and directed by Delmer Daves. A crippled farmer(Edward G. Robinson)living with his sister(Judith Anderson) and adopted daughter(Allene Roberts)is hard pressed to deal with a young man(Lon McCallister)that comes to help out with chores. The young man is a friend of the daughter, but has romantic feelings for the school \"hottie\" Julie London. Robinson becomes deeper obsessed with keeping everyone away from a mysterious red house hidden in the woods that surround his property. Not only is London very young at this time in her career, but so is Rory Calhoun who hunts the woods and discourages trespassers. This is a passionate and atmospheric mystery that is supported by the haunting music of Miklos Rozsa. I especially enjoyed the scene of McCallister trying to go through the woods in the hard driving rain storm with the creepy music background. If you get the chance to see this on TCM, AMC or PBS...don't pass it up.",
         "Until last night I hadn't seen this movie since being 9 years old in 1947. At that time it scared the hell out of me --- particular the ice house scene, etched forever in memory -- although THE RED HOUSE is not a horror movie. Looking at it again after 60 years it's still a winner. However scary there's almost no violence, but instead it relies on the natural fright of living near a forbidden woods and the haunted RED HOUSE. The evil lies entirely in the mind of the old man (Edward G. Robinson) and the guilt from some long-ago crime. Lon McAlister plays the young man who enters the scene and other youngsters are played by Rory Calhoun and Julie London who later became stars. It's easy to understand how the dark, forbidden woods affected me as a young child; but I doubt it would be so well received by today's kids. For one thing, they don't play outside much, let alone exploring in a dark woods or haunted house. Secondly, the woods was most likely torn down. My own woods --- circa 1947 -- had a stream, a swamp, a genuine haunted house, a pig's skeleton, and a road leading to nowhere. Today it's all gone; replaced by Holy Cross Hospital, part of the Washington Beltway, 40 new houses --- paradise swallowed up by progress. Nothing remains for today's kids. The Red House is now in DVD. It's good; see it!",
         "Watched this film recently and I really loved it! Entertaining throughout and with solid performances from a cast that consists of Edward G. Robinson, Lon McCallister, Judith Anderson, Rory Calhoun and Allene Roberts. The movie is very odd but incredibly atmospheric and at times, a bit spooky. Robinson and Anderson play a brother and sister who have adopted Roberts and have raised her as their own on their farm all the time concealing a dark secret that lays hidden in the red house beyond the woods. Robinson will go to whatever means he has to in order to protect the secret and that includes hiring Calhoun to scare away trespassers with his handy scope rifle. Young McCallister is hired by Robinson to help on the farm and soon proceeds to try and unravel the mystery with the help of Roberts. Excellent direction from Delmer Daves who pumps up the atmopshere with lots of whistling wind, creepy shots of the woods and terrific use of shadows. A mention also must be made regarding the great score by Miklós Rózsa which fits every scene perfectly and creates the right amount of eerieness at the right times. The ending is quite haunting also. A very good film that has become a quick favorite of mine and one I'll definitely be watching again.",
         "I first heard of this film when Scorcesse mentioned it on his documentary, \"A Journey Through American Cinema\"...always wanting to see something new, I found a copy of it at work and took it home....WOW!!! This is one of the greatest low budget thriller/melodramas I have ever seen...definately up there with Jacque Tourner's \"Cat People\" and Edgar Ulmer's \"Detour\"...Daves conjures up a moltov cocktail of sexual frustration, psychological S&M, and pubescent curiosity that seems primed to explode at any minute, and the volatility of it all is what keeps you in suspense. Even if you do figure out the secret of the red house half way through (I did), the performances of everybody involved (especially Edward G Robinson) keeps your eyes glued to the screen from beginning all the way to the bitter and somewhat ironic end....if you ever run across it, please check it out....sadly, the prints that are available are a bit scratchy at best (which is what happens when a film is forgotten), but the film is an experience everybody should see for themselves.....",
         "I had forgotten what a satisfying little thriller this was from watching it a couple of years ago. The story builds suspense in the first half by slowly revealing the mystery of it's title, with scene after scene adding dimension to what will eventually be revealed as Pete Morgan's fifteen year long nightmare. As Morgan, Edward G. Robinson brings some of the subtler aspects of his acting side to the story, at least in the early going when he's a warm and caring guardian to adopted daughter Meg. Later he dissolves into paranoia, until virtually reliving the events of that earlier time when he accidentally killed his lover, the basis for his forced life of seclusion. When you watch the film again, take note of the scene when Robinson's character lights the candle upon first entering the Red House, there's a great transformation shot that makes him fifteen years younger, erasing the creases in his forehead as he remembers the house 'just as it was'. That was just a great creative subtlety that worked amazingly well to establish Morgan's mental state. The film also works for the excellent characterizations of Judith Anderson as Pete's devoted sister Ellen, and Allene Roberts as their adopted daughter Meg. Meg becomes involved in a romantic triangle of sorts when she begins to fall for Nath Storm (Lon McCallister), who in the early story is going steady with the local glamor girl Tibby Renton (Julie London). You know, if you take a look at London's film credits, she sure does show up in the oddest places, like a jungle woman in her very first picture, 1944's \"Nabonga\". Here, director Delmer Daves does his best to zoom in on repeated long glamor poses of both London and rival Roberts in close-ups that resemble screen tests. There's even a couple featuring Rory Calhoun's rugged good looks, even though he turns out to be a villain of the piece; an oddly well selected choice for the role he has. Here's a puzzler - how did Nath know there was rifle in the closet? And still a bigger puzzler - How did Pete Morgan ever get away with it fifteen years ago? That was a point the film never adequately answers, even though it was mentioned that Meg's parents moved South and died in an accident to set up the adoption. Odd that no one from the town ever questioned their just disappearing and leaving a baby behind. But then again, the town seemed prone to rumor and half truths anyway, as established by the dinner scene when Nath was first hired by Morgan. Others on this board have mentioned the intense musical score, and the harrowing night time scenes in the Oxhead Woods, all of which border the film on a horror piece as well as a mystery thriller. This one is well recommended to get your hands on, even better for one of those dark, stormy nights with lightning casting a dim glow while watching. You'll begin to believe Edgar G. Robinson when he states - '...you can never run away from the scream\".",
         "Delmer Daves's The Red House is a gem! But it's not a film for the kids - the film deals with somewhat perverse adult themes in a very psychologically, if not explicitly, realistic manner. The great Edward G. Robinson plays Pete Morgan, a reclusive older gentleman living with his sister (Judith Anderson) and an adopted teenage daughter, Meg (Allene Roberts). Most of the story revolves around Meg's developing romance with Nath (Lon McAllister) - a smart and decent young man who comes to work for Pete. Nath's girlfriend - kind of an erstwhile femme fatale - is played by the lovely Julie London, and it is no surprise to find that as Nath's attention turns to Meg, her attention turns to bad boy \"Teller\" (Rory Calhoun). Underneath all the typically teenage romantic dynamics lies several terrible secrets and possibly, something supernatural. All of this will culminate in revealing the secret of a long-forgotten Red House in the woods behind Pete's house. The acting is excellent. The younger members of the cast are remarkably attractive, an the cinematographer used this to great advantage. Calhoun and London occasionally falter into formulaic acting, but McAllister and Roberts are always exactly where they need to be, and Robinson turns in a typically brilliant performance. Roberts, amazingly, was 18 years old and acting in her first film when she turned in this fantastic, mature performance. Daves paces the film very nicely. There are relatively few wasted seconds, and the build-up to the climax, and even the epilogue, are barely even noticeable as you are swept away by the increasingly convoluted and disturbing story-line. Lighting, a trademark of Daves and noir in general, is used perfectly in this very nicely shot dark contrast-oriented film. The key to the success of this film, however, is the misdirection of audience sympathies - which is all I will say about the script - to avoid a spoiler. NOTE: Be willing to spend a few extra dollars to get a good print of this film. Some of the less expensive versions have very poor sound quality - almost unlistenable. Highly recommended for Robinson fans and non-graphic horror fans. Recommended for noir fans. Not recommended for kids.",
         "Well acted, well written and beautifully photographed, The Red House is overlooked by many today but is a wonderful film to watch. It starts off a little slowly, but the tension builds up quickly and the diverse elements in the plot come together over time. The footage of the woods and countryside alone is worth the time to watch this film, as it looks to have been filmed in the ranches and forests of rural California and the whole setting looks like a picture postcard. All the cast is great, most especially Robinson in a powerful performance, as well as a very young Julie London who plays the beautiful local rich girl. This film is a winner on a lot of levels - watch it!",
         "This film-noir may look like a B-film, but it contains two powerful pieces of work, that of actor Edward G. Robinson and composer Miklos Rozsa. A strange tale, \"The Red House\" benefits from one of Robinson's most flavorful performances, as a man harboring a dark secret past which returns to haunt him. Ably supporting Robinson is the strong Judith Anderson as the sister, the fine Lon McCallister as a callow but earnest youth, and the striking Rory Calhoun in one of his most impressive roles. Directed in a somewhat standard fashion by Delmer Davis, interest is maintained by uniformly strong performances, and an extensive, full orchestral score by Miklos Rozsa. As in countless other films, Rozsa, inspired by Ravel (and the generic Debussy) weaves a wall-to-wall tapestry of psychological tension, further raising this enactment above its ordinary production design. Devotees of Robinson can enjoy their favorite actor in his 53rd film, made at the peak of his powers. His unique film presence boasted a career of 99 films in 57 years, which was preceded by a 15-year stint on the New York stage. Robinson proved that one doesn't have to be unusually handsome to be a star, nor be relegated to minor character parts. Indeed, Robinson played leads in countless classics, with nary a weak performance. Few actors can make that claim. The DVD transfer is not a restored print, and contains several stretches of poor audio and scratchy images. On a series called, \"Hollywood Tough Guys,\" put out by Madacy Entertainment, one can still be grateful that \"The Red House\" is available, as respresentative of both Robinson's and Rozsa's unique contribution to film.",
         "This is my second time around commenting on this movie. All I can say is wow! Whatever parts of this movie that seemed bizarre the first time I saw the move all came together the second time around and made sense. The psychological drama works and the characters do give nuanced performances which I appreciated more the second time around. I adore the rural setting. The Red House is nothing short of an engrossing film with strong performances. Edward G. Robinson, Lon McAllister, Allene Roberts, Julie London, Rory Calhoun, Judith Anderson and Ona Munson are perfectly cast. Edward G. Robinson's and especially Judith Anderson's performances which seemed bizarre to me the first time came alive with depth and subtlety on a second viewing. I agree with the folks who are saying this is a must see film. Watch it twice if your are like me and you need to in order to understand just how good it is! And I cannot stress enough how fine the Miklos Rosa score for The Red House is. This one is a keeper. If they make a restored DVD of this movie, I'll buy it (hint).",
         "I'm not sure why this film was entitled The Red House. Not being shot in color the title will mean absolutely nothing to the viewer, especially the viewer of today who won't be dealing with a recent best selling book to compare it with. The house of whatever color is located by a mill and it contains a terrible secret from the past of Edward G. Robinson. Robinson and his sister have raised young Allene Roberts on their farm since she was an infant and have been like parents to her. They have one standing rule at their place. Under no circumstances is she or anyone else to go to a certain stretch of woods and to enforce that rule Robinson has hired Rory Calhoun to keep trespassers off. Of course you tell teenagers like Roberts, Lon McCallister, and Julie London not to do something or go somewhere and you know very well what's going to happen in movies and in real life. Their curiosity unravels both a terrible secret from the past and it also unravels Robinson himself who we see degenerate from a loving father figure to a terrible figure of fright and horror. Robinson of course is his usual outstanding, but it was refreshing to see Judith Anderson for once not playing a baddie. No Mrs. Danvers here or a blackmailing wet nurse like The Ten Commandments. She's a kind loving sister who gave up her own chance at happiness and a marriage to live with Robinson and raise Roberts. Allene Roberts and Lon McCallister are a pair of nice young people, but they don't stand up against Rory Calhoun and Julie London. Calhoun's part is mysterious and ill defined, but he has plenty of animal magnetism exploding all over the screen and this was his first big break. As for London, I'm still scratching my head why McCallister chooses Roberts when he's got Julie London giving him the come hither glance. The Red House is a fine thriller a bit dated, but still entertaining. By the way it also has a fine Mikos Rosza score as well.",
         "The '40s were, fair reader, the ripest for uncanny, chilling melodramas. Mystery tales with a melodramatic bent, bordering on horror. A whole Gothic cinema emerged. For me, THE RED HOUSE is the very best of all these movies; unlike most of them, it takes up a mystery set in a wood, not in a mansion (well, there is a house, as the title indicates, but the tale is really a wood mystery). Played by who else than daddy Robinson, written and directed by Delmer Daves, scored by Miklós Rózsa, it is so neat, clean, straightforward and intense, that I don't know any other '40s shocker to match it. Robinson brings all his unholy robustness and zest, all his crushing, smashing authority, his unfailing instinct for finding either the purest realism affordable on screen, or a discretely stylized kabuki worthy of his Asiatic features. I certainly count him as one of the best ten actors working in USA. I must have been 15 when I have first seen THE RED HOUSE and, after all these yrs, it still does look like an awesome movie to me, a suspenseful melodrama bordering on horror, with Robinson in an advantageous and convenient role. I believe the writing, the script of THE RED HOUSE is very satisfying, the characters are admirably written. Robinson's character seems written for him, with him in mind. The atmosphere, the score, the tale, Robinson's performance, the characters (all, exquisitely seized, something that suggests a profound knowledge of the human nature, although, of course, only partly put to use when writing a genre movie) make it a classic shocker not unrelated to Coppola's DEMENTIA, and perhaps much better. The characters are few; something in their behaviors almost always suggests that the right note has been stricken, that the fit thing was brought in front, that what is shown is truthful to the human nature and experience. Remember or keep in mind that the very guy who directed THE RED HOUSE also directed DESTINATION TOKYO, DARK PASSAGE, DEMETRIUS AND THE GLADIATORS, 3: 10 TO YUMA, THE BATTLE OF THE VILLA FIORITA, and these are all enjoyable; I believe he was a good director, because he made good movies, many good movies, more than a handful of good movies. And give that Delmer Daves some love!",
         "Edward G. Robinson gives a gripping performance in this psychological thriller of a farmer, whose reason is being eroded away by horrible secrets from the past. This would have to rank in his top five performances. Also memorable was Allene Roberts as his adopted daughter Meg. She was very beautiful with the most expressive eyes. She was also a real talent and it's a pity her career faded quickly into the world of television. Pete Morgan (Edward G. Robinson) is an aging farmer who is being consumed by an event that happened in the woods many years ago. Nath Storm (Lon McCallister) is a local boy, whose mother (Ona Mussen) is finding it hard to make ends meet, so he finds a part time job after school at the Morgan's farm. He tells them there is a lot of gossip about them in the village - about how Meg isn't their daughter, that her parents disappeared long ago and that the village calls them the \"mysterious Morgans\"!!! When he heads home he takes a short cut through the wood - even though Pete has warned him against it. He rushes back thinking he has heard screams and stays the night with the Morgans. The next time he goes into the woods he is knocked into the stream, not by a ghost but by a human. He, Meg and Tibby (Julie London), a girl who craves excitement go and explore. She is attracted to \"bad boy\" Teller (Rory Calhoun) - he is secretly employed by Pete to scare off anyone in the woods using any means he wants to. He does so with disastrous results. When Nath and Meg become obsessed with finding out the mystery of the red house, Pete's mind and reason disintegrate with the weight of the horrendous secret he has been keeping all these years. When Ellen (Judith Anderson in a small but key role) questions Pete about his feelings for Meg's mother, Gina, he goes wild and lashes out. Pete is increasingly seeing Gina in Meg and often calls her by that name. Julie London and Rory Calhoun were also introduced in this film. This was the first time they received a screen credit. This was the most chilling film and I really did not guess the mystery. For lovers of Edward G. Robinson I would really recommend this film. It is an A grade movie in every sense of the word.",
         "A person who's trying to keep a bad secret submerged can't keep it from himself, and with the right set of circumstances that secret will slowly emerge despite all his efforts to keep it covered up, creating increasing guilt and desperation. That's the role more or less brilliantly played by Edward G. Robinson who shares a dreaded secret with his sister played by Judith Anderson, in this twisted story that unravels fairly well, but at 100 minutes seems about ten minutes too long. The film is set in a bucolic countryside that presents a deceptive view of a simple and fulfilling life. The young actors (Lon McCallister, Allene Roberts, Julie London, and Rory Calhoun) hold their own very well. In fact the film has a neat generational component about love and lost opportunities, jealousy, and plenty of repressed sexual desire that everyone (the old and the young) experience, along with the fairly riveting secret of the abandoned \"Red House\", buried in foreboding woods. The cinematography (Bert Glennon) is stunningly beautiful in a lot of scenes.",
         "Slow-building suspense and some good performances make \"The Red House\" a pretty good psychological thriller. An interesting story and a good cast headed by Edward G. Robinson are also helped by eerie musical effects that build up tension as the story proceeds. The movie opens with some deceptively peaceful rustic scenes. Robinson is a farmer who lives with his sister and with Meg, a young woman whom they took in when her parents left her. The farmer hires a local youth (Lon McCallister) to help with chores on the farm. At dinner that evening, there is sudden tension when the conversation turns to the woods behind the farm. The farmer is agitated at the mere thought of anyone crossing through them. As the story proceeds, attention centers on a red house in the woods, which obviously holds some secrets that Robinson is anxious not to have made known. From there, things move slowly but effectively towards a tense climax. The atmosphere is throughout filled with suspense and anxiety, not just regarding the secret of the red house, but also in the relationships among the characters. McCallister's character becomes close to Meg, but he already has a girl - who in turn is flirting with a mysterious man who lives in the woods. The farmer's relations with his sister and his ward are also filled with tension. Some interesting musical effects in Miklos Rozsa's score emphasize the often uncomfortable nature of it all. While rather slow to come together, \"The Red House\" keeps the viewer's attention until the end. It's a good story, and worth watching.",
         "Edward G. Robinson doesn't want his adopted daughter to go near \"The Red House\" in this 1947 film which also stars Judith Anderson, Lon McAllister, Allene Roberts, Julie London and Rory Calhoun. Robinson is Pete, who lives with his sister Ellen (Anderson) on a self-sufficient farm. They have a daughter they both adopted, Meg, who is now a teenager with a crush on Nath (McAllister) so she arranges for him to work for Pete. Nath is interested instead in the gorgeous Tibby (London), a tramp in training who flirts with a randy local (Calhoun). When Nath decides to go home via the woods, Pete becomes very agitated and tries to dissuade him. Meg and Nath decide to find out what's in those woods and start investigating. What they uncover is life-changing. Directed by Delmer Daves, \"The Red House\" is one scary noir with lots of night scenes that take place in the woods and a haunting ending. The story is also an allegory for growing up and going out into the world, which Meg and Nath are determined to do. Nath urges his mother to marry her long-time boyfriend and go north with him because it's time he was independent, and Meg wants to be treated like a young woman - not only by a young man, but by the people she sees as her parents. The more Pete tells her not to go into the woods, the more she rebels. There are several unsettling things in this film - the secret Pete is keeping, for one, as well as very unhealthy obsession with Meg. That is handled subtly for the most part, but is still there. That may seem an ambitious subject for 1947, but it is also an obvious part of the plot of \"In This Our Life,\" as an example. We learn as the film continues that Ellen had a chance at having her own home and happiness with the local doctor, but because Pete would not allow her to take Meg with her, she never married and stayed on the farm. The fact that she wasn't willing to leave Meg alone with Pete is quite telling. As Pete becomes more unbalanced at the thought of anyone trespassing in the woods, we can understand her motives. Another interesting feature of the film is the blatant sexuality of Tibby as opposed to the naiveté of Meg. All the performances are good, but Robinson is a standout. He could be convincing as both a villain and a lovesick fool, a great man or a coward. Here he slowly fleshes out his character from that of a nice, gentle man to one who is becoming unhinged to complete disintegration in a truly frightening performance. Judith Anderson, so menacing in \"Rebecca\" underplays beautifully here and is perfectly convincing as Pete's sister. It's a sign of a great actress when she can be at home in Shakespeare and as a farmer's sister. London is stunning and does well as a gal trying to hedge her bets. Roberts and McAllister are appropriately young and have the necessary naive quality. The best way I can describe \"The Red House\" is to call it unsettling. The undertones and the end of the film are disturbing, and one can see the beginnings of the psychology and dark feelings that surfaced in film after World War II.",
         "Excellent but a sadly unknown and overlooked flick from the 40's. I absolutely love these kind of movies. I think some people call them the b-movies of the classic area but thats not the case at all. This is one of the Noir/Mystery/Crime flicks which overwhelm you and will stick to your mind for a long time. These flicks are both bold and partly untraditional but in my mind this is a absolute classic which I think works just as good today. The cast gives great performances and the script is simply wonderful. Same goes for the music and the visual style. The directing is excellent too and don't get me started on the character. THIS IS ONE OF THOSE MOVIES YOU SIMPLY HAVE TO SEE!!!",
         "There are some \"family\" issues in this film that make one crawl just a bit. It is the story of an obsessed farmer, who was badly injured, early in life. He lives with his sister, who has obviously given up a life to take care of him, and a young woman whose parents aren't around any more. There is something in the woods that connects to the past and people aren't allowed out there. Why? is the issue that keeps us watching. Edward G. Robinson slips in and out of his reverie, remembering the past with great fear--particularly fear of loneliness. He has this young girl trapped. Up to the time the movie starts, she has been an obedient child. People think the whole family is pretty wacko (and they are right), but no one really understands why. A young man comes to work for the farmer and upsets everything. There is also a high school dropout played by Rory Calhoun who patrols the woods and area around \"the red house,\" hired to drive off invaders. It all boils up nicely. I wish I had a better print because the sound on mine was really poor. Robinson is very good. In fact, the whole cast, including the local prom queen, played by Julie London, is quite good. The whole student thing is pretty believable for such a start setting. I recommend this for those who like character studies. It ends in a very satisfying though violent way.",
         "You get to find out. You can probably guess what the secret of the Red House is but it doesn't matter as the film gently carries you through the story with some spookiness, tension and drama thrown in and used to good effect. It's a simple setting and a simple story about the effect of a house on nutcase Edward G (Pete) and the curse of the woods. After student Lon McCallister (Nath) takes his first walk through the woods at night-time, the scary woods become the most important cast member. No way would I be returning. We get a mystery/thriller as teenagers Lon and Allene Roberts (Meg) explore the woods in search of the Red House. There are many secrets and dangers that lurk in this forest setting. Julie London turns up in a role as sexually aware student Tibby before her singing career took off in real life. All the cast do fine although sometimes the dialogue delivery from Lon is slightly off – he has moments where he is a little too rude to Edward G and out of his depth when challenging farmhand Rory Calhoun. He's got guts but I don't think so!",
         "***SPOILERS*** Tough guy Edward G. Robinson as farmer Pete Morgan goes psycho here much like he did as \"Wolf\" Larson in the movie \"The Sea Wolf\" as he tries to keep of what the mysterious and creepy Red House-That's on his property-has hidden in it. All hell breaks loose when he hires his step daughter Meg's, Allene Roberts, boyfriend Nath Storm,Lon McCallister, as a farm hand who get's not only very romantic with Meg, whom control freak Morgan wants to keep all to himself, but insists to check out the area where the red house is located in. It soon becomes apparent that both Morgan and his live in sister Ellen, Judith Anderson, have a skeleton hidden in the closet that they've been hiding from the world for at least 15 years and in Pete Morgan's case is more then willing to kill to keep that secret from seeing the light of day. There's also both the sexy and hot to trot Tibby, Julie London, who's got the hots from the boyishly handsome Nath and the devilishly handsome local sh*t kicker Teller played by an Elvis Presley looking, some seven years before anyone ever knew of him, Rory Calhoun whom Morgan uses to terrorize anyone from finding out the secret about his red house that he keeps hidden deep in the woods. ****SPOILERS**** You can see that Morgan is not all there to begin with but as the secret of the red house and what's hidden in it starts to leak out, due to the efforts of both Meg & Nath, that he completely cracks up.From at first being a kind and gentle soul who wouldn't hurt a fly to a crazed out of control lunatic going so far as murdering his own sister Ellen. It was Ellen who was about to go to the local authorities and have him committed before he did any more damage. The mentally deranged Morgan even attempts to rape, in thinking that she's his former girlfriend, and murder Meg for walking out on him by getting overly friendly with Nath whom he also attempts to murder. With the secret of the red house now known all over the papers and news outlets-radio & TV- and the police about to take him into custody Morgan makes a dash for it in his jalopy of a pick-up truck and ends up drowning himself. That as he burst into the red house's ice house-with the ice melting in the summer heat- where all the evidence of his many crimes-of some 15 years ago-are hidden.",
         "Puts the \"A\" in Atmospheric. Like Heart of Darkness, the terrain is as much the main character as the humans in it. The woods call out like a ghost with the red house the haunted centerpiece. The film is blessedly uncluttered. It sticks to its idea and never varies. I've been smitten by the young Allene Roberts ever since I saw the film for the first time. She's the most beautiful young actress I've ever seen. Her eyes radiate vulnerability and innocence. Edward G Robinson gives a haunting and haunted performance. A must see IMO for film noir fans that want to journey off the beaten path into a wonderful world of rustic creepiness. And I can't get over how much a young Rory Calhoun looks like Christopher Reeve.",
         "An old man (Edward G Robinson) and his sister (Judith Anderson) are concealing a terrible secret from their adopted teen daughter called Meg (Allene Roberts) . The fostered girl is attracted to a young man of the village called Nath Storm (Lon McCallister) . Meg starts falling in love with Nath , but his sweetheart Tibby (Julie London) has other plans for him . She then brings home the suitor and the old man attempts to keep everyone out of mysterious red house located on his ownership . The elderly farmer unsuccessfully attempts to bury the horrid past . Curious , Meg and Nath ignore dangers and begin exploring beyond the following warning : ¨No trespass at your own risk¨ . Meantime , they all get closer to real risk and the horrible truth about the property . At the end , the terrible secret concerning a hidden abandon farmhouse and located deep in the woods bursts out , as leaving a grand ending the resolution of the mystery . This first-rate but slow-paced picture draws its riveting tale and power from the interaction of finely drawn roles as well as drama and emotion . Rare film Noir about troubled relationships , being based on the novel by Agnew Chamberlain and screen-written by the same director and by notorious and black-listed Albert Maltz . It has a good realization , an original script , haunting atmosphere , intriguing events ; for that reason madness and murder prevail . Exciting as well as strange film , possessing a mysterious and fascinating blend of rural serenity , baroque suspense in which especially stands out the magnificent musical score by Miklos Rozsa . This is pure cinema from the first to the last shot, where there's nothing left and each image has its sense and meaning . Very good acting by Edward G. Robinson on the character of an old crippled farmer \"Pete Morgan\", who lives with his sister in a secluded farm in front of an eerie forest . He does an excellent job and proves once again he is one of the best players in the history of cinema . Support cast is frankly well such as Judith Anderson of Rebeca as Ellen Morgan , Rory Calhoun as Teller , Allene Roberts as Meg , Julie London as Tibby , Ona Munson as Mrs. Storm , Pat Flatherty as cop and Harry Shannon . Dark cinematography plenty of lights and shades by Bert Glennon . The failure of the original copyright holder to renew the film's copyright resulted in it falling into public domain, meaning that virtually anyone could duplicate and sell a VHS/DVD copy of the film. Therefore, many of the versions of this film available on the market are either severely and usually badly edited and/or of extremely poor quality, having been duplicated from second- or third-generation or more copies of the film. The motion picture produced in low budget by Sol Lesser was well directed by Delmer Daves . Nice work by Delmer Daves in demonstrating his skill at all areas : as technical , using all kind of resources for illustrating the interesting as well as dramatic story with an engaging screenplay , adding great actors filmmaking and enjoyable narration . Daves was a Western expert , including his characteristic use of landscape , for the reason he lived a long time of his boyhood with the Navajo and Hopi Indian tribes as he realized the notorious trail-blazing ¨Broken arrow¨ the first movie for many years not treat the Indians as cannon-fodder for the cavalry , which made the picture unpopular in some quarters . He went on directing the suspenseful ¨3:10 to Yuma¨, other pro-Indian as ¨The last wagon¨ and about Modoc Indians as ¨Drum beat¨ , the Shakespearian style of ¨Jubal¨ , ¨Return of the Texan¨ and ¨Cowboy¨ which a fairly spectacle about a long cattle drive . From 1959 Delmer Daves becomes embroiled for the remainder of his career with teenage love epics and very popular at the Box-office as ¨A summer place¨, ¨Parrish¨, ¨Susan Slade¨, and ¨Rome adventure¨, among others . And of course , he realized Noir films such as ¨Dark passage¨ and this ¨The red House¨ that is absolutely recommended .",
         "Edward G. Robinson warns Lon McCallister about the woods near the red house and to stay away from it. \"Don't use it on the shortcut getting home at night. It's haunted.\" Lon was hired to help Edward around the farm, as he can't get around as he used to. But it seems that Lon has a mind of his own and won't listen. When he was scared s---less in the dark the first time and had to go back to Mr. Robinson's farm, he set out during the day to find out what's going on and to get his bearings. But, there's also a mystery on their farm. What haunts Edward G. Robinson? His sister Judith Anderson apparently sacrificed her life and wants to stay with him years ago to help him and has been with him ever since. Then there's a young girl, same age as Lon, who stays there, that they've adopted. There's a secret that no one's telling, but Lon is determined not to be spooked. Rory Calhoun, Julie London, and Allene Roberts as the young girl are also in the excellent supporting cast. Also of note is Ona Munson as Lon's mother; she was Belle Watling in Gone with the Wind. Munson was also seen and to better advantage in Five Star Final, but in \"The Red House\" she looks more Belle and would therefore be more recognizable to film buffs. The elements, atmosphere, and creepiness are effective and definitely first-rate. This is one of the best of the unknown films of Edward G. Robinson. The only real critique I may make is that his character's overwroughtness gets to be a bit heavy-handed or overbearing by the end and the revelation is a little too melodramatic, as we see him lost in his mind. But Robinson's range is truly shown as he remembers the past with both a silent hopeful yearning and a sadness of loss. If you miss the mystery of \"The Red House,\" though, it's your loss. Discover it today!",
         "On the bus ride home, handsome \"Union High School\" senior Lon McCallister (as Nath Storm) cozies up to sexy girlfriend Julie London (as Tibby Rinton) while cute Allene Roberts (as Meg Morgan) looks forlorn - obviously, Ms. Roberts would like Mr. McCallister to be her boyfriend. Telling McCallister that her wooden-legged foster father Edward G. Robinson (as Pete Morgan) needs help on the farm, Roberts invites him over to apply for an after-school job. McCallister accepts. After joining Mr. Robinson and his spinster sister Judith Anderson (as Ellen) for dinner, McCallister wants to take a short cut home. Robinson warns him \"Ox Head Woods\" is dangerous, forbidden, and likely haunted by screams. McCallister skeptically decides to take his chances, but is frightened into taking the recommended route home. Despite her increasingly spooky foster father, McCallister grows closer to Roberts. Soon, they are searching the forest for a lost house of secrets\u0085 With its effectively ascending Gothic atmosphere, and a fine cast, \"The Red House\" has everything it takes to be considered a minor classic, at least. Perhaps its appreciation will someday surface. With hints of incest, Robinson is excellent; he never seemed to get the roles or recognition needed to reach the deserved level of esteem awarded contemporaries. It's nice to hear McCallister's age explained; due to helping their parents at work, \"boys graduate a little older than those in the city.\" McCallister holds his own against is legendary co-star, as do the aforementioned players. Also making a good impression is Rory Calhoun (as Teller), a trigger-happy high school dropout hired by Robinson to ward off trespassers. Director Delmer Daves and photographer Bert Glennon take advantage of the eerily breezy locations. Making producer Sol Lesser proud, Miklos Rozsa's soundtrack music is a perfect accompaniment and the editing by Merrill White should also be noted. ******** The Red House (3/16/47) Delmer Daves ~ Edward G. Robinson, Lon McCallister, Judith Anderson, Rory Calhoun",
         "\"The Red House\" came to my attention when I watched Martin Scorsese's \"A Personal Journey Through American Movies\" documentary. The famous director described the film as a B movie gem, and it is quite fascinating. Edward G Robinson gives an excellent performance in the lead role as reclusive farmer Pete Morgan who lives with his strangely devoted spinster sister (Judith Anderson, very good in a sympathetic role)and sweet young adopted daughter, the very wholesome 17 year old Meg (Allene Roberts, who is a direct cross between Teresa Wright and Cathy O'Donnell). When Meg's high school crush Nath (nice but bland Lon McCallister) comes to do some after-school work, the dark secret of the \"The Red House\" is revealed, and Robinson's obsession with Meg, and a mysterious figure from the past, grows deeper. This rises above it's B movie origins largely because of Robinson's performance, and the strange, unsettling motivations of his character. It's sort of Freudian and very creepy. There is an interesting sub-plot with a very young and pouty Julie London and Rory Calhoun having a rough-and-ready romance. Much of the directorial work by Delmer Daves is pretty standard stuff, though he does do a good shadowy night scene. Miklos Rosza's score is effective, but didn't we hear it the year before in \"The Strange Love Of Martha Ivers\"? It sounded very similar to me, and Rosza's scores unfortunately have a tendency to screech after a while. I watched this on a public domain DVD, and the print was pretty bad. It's worth rescuing from the domain, an interesting and worthy little noir feature."
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Thalia Productions Inc.",
         "Sol Lesser Productions"
      ],
      "summaries": [
         "Pete and Ellen have reared Meg as their own, ever since she was a baby and her parents took off. Now a teen, Meg convinces her friend Nath to come help with chores on the farm: Pete isn't getting around on his wooden leg like he used to. When Nath insists on using a short cut home through the woods, Pete gets quite agitated and warns him of screams in the night, of terrors associated with the red house. Curious, Meg and Nath ignore his warnings and begin exploring. Meg begins falling in love with Nath, but his girlfriend Tibby has other plans for him. Meanwhile they all get closer to real danger and the dark secret of the red house.",
         "An old man and his sister are concealing a terrible secret from their adopted teen daughter, concerning a hidden abandon farmhouse, located deep in the woods."
      ],
      "budget": 0
   },
   "movielensId": 134350,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-03-16",
      "dvdReleaseDate": null,
      "directors": ["Delmer Daves"],
      "runtime": 100,
      "movieId": 134350,
      "title": "The Red House",
      "mpaa": "",
      "actors": [
         "Edward G. Robinson",
         "Lon McCallister",
         "Judith Anderson",
         "Rory Calhoun",
         "Allene Roberts",
         "Julie London",
         "Ona Munson",
         "Harry Shannon",
         "Arthur Space",
         "Pat Flaherty",
         "Walter Sande"
      ],
      "imdbMovieId": "0039757",
      "originalTitle": "The Red House",
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["5k_Mg7YC3SE"],
      "plotSummary": "Pete and Ellen have reared Meg as their own, ever since she was a baby and her parents took off. Now a teen, Meg convinces her friend Nath to come help with chores on the farm: Pete isn't getting around on his wooden leg like he used to. When Nath insists on using a short cut home through the woods, Pete gets quite agitated and warns him of screams in the night, of terrors associated with the red house. Curious, Meg and Nath ignore his warnings and begin exploring. Meg begins falling in love with Nath, but his girlfriend Tibby has other plans for him. Meanwhile they all get closer to real danger and the dark secret of the red house.",
      "tmdbMovieId": 30162,
      "avgRating": 3.33333,
      "releaseYear": "1947",
      "numRatings": 3,
      "posterPath": "/svLo3Cibzv2BqSlvoLYUcCIQRmL.jpg"
   }
}