{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "commercial",
            "id": 1004
         },
         {
            "name": "love of animals",
            "id": 2282
         },
         {
            "name": "lone wolf",
            "id": 3568
         },
         {
            "name": "vineyard",
            "id": 5334
         },
         {
            "name": "strange person",
            "id": 198141
         },
         {
            "name": "conquest",
            "id": 208358
         },
         {
            "name": "winery",
            "id": 220204
         }
      ],
      "imdb_id": "tt0080439",
      "video": false,
      "title": "The Taming of the Scoundrel",
      "recommendations": [
         11441,
         68275,
         37765,
         63274,
         62029,
         38271,
         58191,
         35634,
         58083,
         38285,
         38362,
         58706,
         57918,
         333372,
         38262,
         6916,
         58611,
         41979,
         43211,
         129229
      ],
      "backdrop_path": "/1yXbbeo4BiPmySYZGmI4gBs3Qxp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elia Codogno",
               "gender": 2,
               "credit_id": "52fe43dd9251416c7502118d",
               "name": "Adriano Celentano",
               "profile_path": "/nhJbf0mDUkSUxoJykCVNWfcsa78.jpg",
               "id": 67967,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lisa Silvestri",
               "gender": 1,
               "credit_id": "52fe43dd9251416c75021191",
               "name": "Ornella Muti",
               "profile_path": "/a6shpjgLMJdRhMRpLviH6poKxmI.jpg",
               "id": 27163,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mamie",
               "gender": 1,
               "credit_id": "52fe43dd9251416c75021195",
               "name": "Edith Peters",
               "profile_path": "/3R5XEPWJLAL7kINkvoUD3FDVfB7.jpg",
               "id": 67969,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Don Cirillo",
               "gender": 2,
               "credit_id": "54993ecbc3a3682703000910",
               "name": "Pippo Santonastaso",
               "profile_path": "/jWCrxEJkzkmPC791xucwme1V4Ly.jpg",
               "id": 118500,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Campagnolo",
               "gender": 0,
               "credit_id": "54993f229251411f52000984",
               "name": "Jimmy il Fenomeno",
               "profile_path": "/i2sZKvYz3MUMhcfNOqcMoCp3ovm.jpg",
               "id": 118499,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Renata",
               "gender": 0,
               "credit_id": "52fe43dd9251416c75021199",
               "name": "Milly Carlucci",
               "profile_path": "/c15mXgsFArX0NFZLneVG2Wcs3Zw.jpg",
               "id": 67970,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Benzinaio",
               "gender": 0,
               "credit_id": "54993ee2c3a3682700000ac6",
               "name": "Sandro Ghiani",
               "profile_path": "/uP1o6CXdMYRepcUSI9QVRKcmATx.jpg",
               "id": 129635,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Vittorio",
               "gender": 0,
               "credit_id": "54993ef8c3a36826f8000a6a",
               "name": "Nicola De Buono",
               "profile_path": "/uZ63YypsRtMBpSRFUcSR6g35wKu.jpg",
               "id": 120645,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Guidatore del camioncino",
               "gender": 0,
               "credit_id": "54993f4c9251411f4d000a16",
               "name": "Marco Columbro",
               "profile_path": "/lbLgZAUjmTodWV8xKp49ZXXCAzK.jpg",
               "id": 1402877,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Contadino malato",
               "gender": 0,
               "credit_id": "54993f0c9251411f430009cd",
               "name": "Vincenzo De Toma",
               "profile_path": "/yPIQRBbfR2yur2pwS3psuePrnog.jpg",
               "id": 1205204,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Ragioniere",
               "gender": 0,
               "credit_id": "54993f389251411f480008b5",
               "name": "Guido Spadea",
               "profile_path": "/aFPUJ9TYFOdFpRxJ4Kj4ezMLcr0.jpg",
               "id": 1002678,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Nipote di Mamie",
               "gender": 0,
               "credit_id": "54993f5f9251411f45000959",
               "name": "Gianni Coletto",
               "profile_path": null,
               "id": 1402878,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Il sommelier del ristorante",
               "gender": 0,
               "credit_id": "5a143d689251413655009a28",
               "name": "Raffaele di Sipio",
               "profile_path": "/ws3BBrSa9BFOVox9kgEWJTuqFZT.jpg",
               "id": 118504,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "un conoscente di Elia al bar",
               "gender": 0,
               "credit_id": "5a143d7e925141365b009a85",
               "name": "Gianni Franco",
               "profile_path": "/wbMI5l9SG5WVLRQExFD4mdq7pWH.jpg",
               "id": 100954,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "il barista",
               "gender": 0,
               "credit_id": "5a143d9b9251413668009c93",
               "name": "Maurizio Fardo",
               "profile_path": "/1esY45d9no1upzaAg4qPcKzsvPL.jpg",
               "id": 1057236,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "il giornalista",
               "gender": 0,
               "credit_id": "5a143dac925141365800999d",
               "name": "Massimo Mirani",
               "profile_path": "/n83yAFMp5039oiZkY3bWN3kI0ee.jpg",
               "id": 1205234,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c7502119f",
               "name": "Franco Castellano",
               "profile_path": null,
               "id": 67971,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c750211a5",
               "name": "Giuseppe Moccia",
               "profile_path": null,
               "id": 67972,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750211ab",
               "name": "Mario Cecchi Gori",
               "profile_path": "/vXszJw9m6Iifr6pKROKo1yIDjxm.jpg",
               "id": 32309,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c750211b1",
               "name": "Vittorio Cecchi Gori",
               "profile_path": "/84qBljbXDIv8FgKnIKMkoPacShX.jpg",
               "id": 57301,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750211b7",
               "name": "Franco Castellano",
               "profile_path": null,
               "id": 67971,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c750211bd",
               "name": "Giuseppe Moccia",
               "profile_path": null,
               "id": 67972,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43dd9251416c750211c3",
               "name": "Alfio Contini",
               "profile_path": null,
               "id": 29895,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c750211c9",
               "name": "Detto Mariano",
               "profile_path": null,
               "id": 67973,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43dd9251416c750211cf",
               "name": "Antonio Siciliano",
               "profile_path": null,
               "id": 67974,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "57c15e839251413a3b0013e1",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Idea"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 14.743729,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 10986,
      "vote_count": 115,
      "budget": 0,
      "overview": "A rich farmer is well known for being very unkind. He's misanthropic, misogynous and cantankerous. Until he meets by chance a gorgeous girl...",
      "similar": [
         11858,
         7298,
         11063,
         363046
      ],
      "original_title": "Il bisbetico domato",
      "runtime": 104,
      "poster_path": "/khV9UalT4lm8tPRA0qQix344go7.jpg",
      "spoken_languages": [
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Capital Film",
         "id": 41973,
         "origin_country": ""
      }],
      "release_date": "1980-12-20",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Franco Castellano",
         "Giuseppe Moccia"
      ],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Franco Castellano",
         "Giuseppe Moccia"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0080439/",
      "coverLink": null,
      "actors": [
         "Adriano Celentano",
         "Ornella Muti",
         "Edith Peters"
      ],
      "reviews": [
         "I have seen this movie many times, and it never fails to make me laugh. Celentano's genius in acting is shown clearly through his actions in this movie, where he is supposed to be a \"hard-head\" man who never wants to get married and doesn't find women attractive. However, through her many seductions, Ornella Muti finally makes him love her(enough that he marries her at the end). It's really funny to see how Celentano tries to resist her seductive manners every time she tries. I dont know what else to say; its one of those movies that you have to see to really understand how funny it is. Everyone should watch this; it's a good, clean, funny Italian comedy :)",
         "\"Il bisbetico domato\" (\"The taming of the Scoundrel\") contains in the title a reference to Shakespeare's work \"The taming of the shrew\"... That's all, because the film has no other connection with the English author. A rich farmer is well known for being very unkind. He's misanthropic, misogynous and cantankerous. Until he meets by chance a gorgeous girl... The movie is a typical tailored story for Adriano Celentano, one of the biggest Italian music stars -he's hugely popular in German speaking countries and in the Eastern Europe as well. \"Il bisbetico domato\" is not a musical, and it is directed by the couple Castellano & Pipolo (authors of many Celentano flicks). It stars beautiful diva Ornella Muti. The film is fine and funny, although not a cinematic monument. It's just a pretty film, with humor and without big inventions. Certainly we laugh, but above all we watch it because of the main actors -the couple works very well. At the time of its release the picture was, as usual, a smash hit in Italy. I think you can really appreciate these movies, first, if you're a Celentano fan. I also think you should see them in the Italian version only -because the singer/showman has a peculiar voice and a way of telling the lines you'd completely miss with the translation.",
         "I've liked Adriano Celentano as a singer and an actor since I was a young girl. He was enormously popular in the USSR (and justly so). I love his voice, style, and the choice of songs, and I listen to his CDs often. I've seen several of his comedies (Serafino (1969), directed by Pietro Germi, The Con Artists, Ace) and one of my favorite is \"Il Bisbetico domato\", (1980) or \"The Taming of the Scoundrel\". Celentano plays a 40 years old wealthy farmer - misanthropic and misogynous virgin. On the evening he turns 40 and celebrates by himself, eating dinner prepared by his loyal house-maid, someone knocks at his door...and gorgeous Ornella Mutti enters his house and the movie. He insults her with the gusto and tries to resist her charms but she sets to prove that no one can resist love when it comes. ...And it comes even to such unbearable and unpleasant character as Elia. Celentano and Mutti both shine and the comedy is amusing and entertaining even after all these years.",
         "Elia is a confirmed bachelor in the thirties, living with a housemaid in an Italian village. The film starts with men talking about Elia's unbearable character, and these statements are illustrated by him entering and insulting everybody who comes in his way. The housemaid finds women for Elia, but he always succeeds in chasing them away with his awfulness until on a rainy night beautiful Lisa knocks on the door... Although this film is done with little expense, its obviously exaggerated character can be very amusing. Undoubtedly it is a matter of taste; either you love it or you hate it.",
         "well first let me say i like adriano celentano and his movies at all. he plays awesome in his movies,he plays the super macho and he did his job very good,really.i dont know if this movie is available in english,as for myself i saw it when i was on vacation in germany and i loved it.i watched all the other \"celentanos\" and he´s the best,really. if you like 80´s comedies and your able to understand any language in which it was released,you shouldnt stop waiting.A+++",
         "A fun movie to watch, you wont regret it if u like Italian Comedy and the Actor himself (Celentano). In the movie Adriano Celentano (Elia) thinks that women are no good and prefers to live his healthy life alone with his dog and House keeper. Until one day a beautiful young woman comes to his house asking to stay for the night. Elia makes a horrible first impression by being rude towards the stranger. Nevertheless, she seems to like it about him and that what makes her want to stay in his company.",
         "This is a very sexist and unfunny comedy with an illogical plot. Macho farmer Adriano Celentano treats lovely Ornella Muti worse than his farm animals, but she still tries to seduce him - a poor excuse for her two nude scenes. One moment is worth remembering though: That's when Celentano drives with a tractor through an Italian village, having taken in tow a bed with the quite furious Muti in it.",
         "The film is just super. Old, but so cool. There is no vulgarity, as in most films today. And it's considered ridiculous. And then why the generation is now. Here, funny and without vulgar. You can, learn new comedies in such films. I advise you to look.",
         "The main advantage of the film \"The Taming of the Shrew\" is an outstanding actor's play. Adriano Celentano was excellent in the role of lone farmer misogynist Elia. And Ornella Muti irresistibly played the role of Lizzie Silvestri, who wanted to win the heart of a brutal bachelor. Celentano created the incomparable image of a wayward man who does not understand humor. I really enjoyed it. I think Elia's role is one of the best roles of Celentano in his entire career. Ornella Muti brilliantly played the role of a liberated seducer too, but Adriano overacted her. By the way, thanks to the film \"The Taming of the Shrew\", the little-known actress Ornella has gained worldwide fame, she was invited to appear in foreign film projects. Also very funny original humor became a great plus of the movie \"The Taming of the Shrew\". The jokes in the movie are extremely funny. For example: Ornela appears in the evening dress as the queen of the ball. Andriano, with boundless astonishment, rises from his chair, approaches Ornella, bends down and raises a black beetle from the ground. \"You see, what a beautiful - this is a rare species of scaly-winged.\" And he brings this beetle to Ornella's face, she was indignant and walked away. In conclusion, I want to recommend to all fans of excellent comedies to watch the film \"The Taming of the Shrew.\" My score on a ten-point scale is ten with a plus. I advise everyone who has not seen this movie to see it. You will not regret.",
         "OK, maybe a 8 is a bit too high (depends on your standards), but it was much better than I had a right to expect. First, unlike the other reviewers, I care not at all for Adriano Celentano, his music or his popular persona. So, what I like about the role he plays is that he makes fun of himself. At least I hope, for his sake, that he was making fun of himself and not playing himself in any way. The title, in Italian, is the masculine equivalent of \"The Taming of the Shrew\", and the story is more or less turning that play on its head. Maybe a little less, in that both the man and the woman play the object of the humor at various points, but the point being that the unconquerable (man) is, in the end, brought down by love. And Ornella Muti is, at this time, at the top of her game in every way. I couldn't help noticing that mole right in the middle of the bridge of her nose, though. Was it just for this film? The dialogue is great in Italian, and Celentano's deadpan delivery hits it just right, as does Muti's as a rich, spoiled Milanese man eater--I hope it translates OK. I have to say that the ending, with the very unrealistic basketball game, was cartoonish, and somewhat ruined the structured comedy, charming but rude, which preceded it."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Capital Film"],
      "summaries": ["A grouchy farmer, known around his small Italian town as being wonderful to his employees, but actively driving everyone else away, is in for a surprise when a beautiful girl from the city, ends up on his stoop after her car breaks down in the rain."],
      "budget": 0
   },
   "movielensId": 134326,
   "movielens": {
      "languages": [
         "Magyar",
         "Italiano"
      ],
      "releaseDate": "1980-12-20",
      "dvdReleaseDate": null,
      "directors": [
         "Franco Castellano",
         "Giuseppe Moccia"
      ],
      "runtime": 104,
      "movieId": 134326,
      "title": "The Taming of the Scoundrel",
      "mpaa": "",
      "actors": [
         "Adriano Celentano",
         "Ornella Muti",
         "Edith Peters",
         "Pippo Santonastaso",
         "Jimmy il Fenomeno",
         "Milly Carlucci",
         "Sandro Ghiani",
         "Nicola De Buono",
         "Marco Columbro",
         "Vincenzo De Toma",
         "Guido Spadea",
         "Gianni Coletto",
         "Raffaele di Sipio",
         "Gianni Franco",
         "Maurizio Fardo",
         "Massimo Mirani"
      ],
      "imdbMovieId": "0080439",
      "originalTitle": "Il bisbetico domato",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A rich farmer is well known for being very unkind. He's misanthropic, misogynous and cantankerous. Until he meets by chance a gorgeous girl...",
      "tmdbMovieId": 10986,
      "avgRating": 3.90141,
      "releaseYear": "1980",
      "numRatings": 71,
      "posterPath": "/wAJQxkk4JDsUsLzVbPCHiVwsw2O.jpg"
   }
}