{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "narration",
            "id": 2398
         },
         {
            "name": "voodoo",
            "id": 3392
         },
         {
            "name": "necrophilia",
            "id": 5919
         },
         {
            "name": "anthology",
            "id": 9706
         },
         {
            "name": "librarian",
            "id": 207447
         },
         {
            "name": "freak show",
            "id": 207545
         }
      ],
      "imdb_id": "tt0091671",
      "video": false,
      "title": "From a Whisper to a Scream",
      "recommendations": [
         36600,
         28168,
         83913,
         5796,
         40258,
         86685,
         74072,
         30519,
         79975,
         40341,
         30876,
         3581,
         44698,
         65588,
         54132,
         87469,
         404713,
         58864,
         29130,
         85165
      ],
      "backdrop_path": "/bCFRWBuv1jo9CphplaAwxQXWjt4.jpg",
      "revenue": 1400000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Julian White",
               "gender": 2,
               "credit_id": "52fe473b9251416c9106e765",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Stanley Burnside",
               "gender": 2,
               "credit_id": "52fe473b9251416c9106e769",
               "name": "Clu Gulager",
               "profile_path": "/bjmydNfO5v5LocgBGTmCcBSSe6A.jpg",
               "id": 62019,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jesse Hardwick",
               "gender": 2,
               "credit_id": "52fe473b9251416c9106e76d",
               "name": "Terry Kiser",
               "profile_path": "/lGQSeLgWeLjFGz2gOMWYNlPOM2f.jpg",
               "id": 55267,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Snakewoman",
               "gender": 1,
               "credit_id": "52fe473b9251416c9106e771",
               "name": "Rosalind Cash",
               "profile_path": "/lOtmD9UaEb6eJOwyLdT0dwCT3vZ.jpg",
               "id": 43976,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sgt. Gallen",
               "gender": 2,
               "credit_id": "52fe473b9251416c9106e775",
               "name": "Cameron Mitchell",
               "profile_path": "/59qGcBDKN1H4UysLaOEdV1PJter.jpg",
               "id": 44728,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Felder Evans",
               "gender": 2,
               "credit_id": "52fe473b9251416c9106e79d",
               "name": "Harry Caesar",
               "profile_path": "/xsGh3khE9yidJJJZ36K5pOc8lla.jpg",
               "id": 18894,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Beth Chandler",
               "gender": 1,
               "credit_id": "52fe473b9251416c9106e779",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Katherine White",
               "gender": 1,
               "credit_id": "52fe473b9251416c9106e77d",
               "name": "Martine Beswick",
               "profile_path": "/z5tUam9oJPDMkrgnPlVdN7UijUs.jpg",
               "id": 9925,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Steven Arden",
               "gender": 0,
               "credit_id": "52fe473b9251416c9106e781",
               "name": "Ron Brooks",
               "profile_path": null,
               "id": 249760,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Eileen Burnside",
               "gender": 1,
               "credit_id": "52fe473b9251416c9106e785",
               "name": "Miriam Byrd-Nethery",
               "profile_path": null,
               "id": 106740,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Amarrillis Caulfield",
               "gender": 0,
               "credit_id": "52fe473b9251416c9106e789",
               "name": "Didi Lanier",
               "profile_path": null,
               "id": 1124220,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Andrew",
               "gender": 0,
               "credit_id": "52fe473b9251416c9106e78d",
               "name": "Thomas Nowell",
               "profile_path": null,
               "id": 1122282,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Amanda",
               "gender": 0,
               "credit_id": "52fe473b9251416c9106e791",
               "name": "Ashli Bare",
               "profile_path": null,
               "id": 1124221,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Burt",
               "gender": 2,
               "credit_id": "52fe473b9251416c9106e795",
               "name": "Terence Knox",
               "profile_path": "/bGr28HFGaQjqcnzQD2BPPHMU1TM.jpg",
               "id": 102714,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Grace Scott",
               "gender": 0,
               "credit_id": "52fe473b9251416c9106e799",
               "name": "Megan McFarland",
               "profile_path": null,
               "id": 196919,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Tinker",
               "gender": 2,
               "credit_id": "59cee88fc3a3681e1700937d",
               "name": "Angelo Rossitto",
               "profile_path": "/VY3ygib44431zOtUBEwlnCWJeK.jpg",
               "id": 97985,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Warden",
               "gender": 2,
               "credit_id": "59cee884c3a3681ddf008780",
               "name": "Lawrence Tierney",
               "profile_path": "/iFPg06kGUTdgRUkrYir3xt1Dt7c.jpg",
               "id": 6937,
               "order": 16
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe473b9251416c9106e761",
            "name": "Jeff Burr",
            "profile_path": null,
            "id": 31621,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 1.441576,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39895,
      "vote_count": 21,
      "budget": 1100000,
      "overview": "The uncle of an executed murderess relates four stories of his hometown, Oldfield, to a reporter. In the first, an elderly man pursues a romance with a younger woman, even to the grave and beyond. In the second, a wounded man on the run from creditors is rescued by a backwoods hermit who holds the secret to eternal life. In the third, a glass-eating carny pays the ultimate price for looking for love on the outside. And in the fourth, a group of Civil War soldiers are held captive by a household of orphans with strange intentions for them.",
      "similar": [
         16288,
         297160,
         193726,
         84348,
         29074,
         20701,
         354251,
         31578,
         29514,
         436549,
         138100,
         369912,
         399592,
         49352,
         105902,
         390883,
         260602,
         66706,
         307047,
         28637
      ],
      "original_title": "From a Whisper to a Scream",
      "runtime": 99,
      "poster_path": "/gIjs3NqwLDG0YALRgCAHpsfS1dE.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Conquest Productions",
         "id": 6087,
         "origin_country": ""
      }],
      "release_date": "1987-09-25",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Welcome to Oldfield. Stop in for a night of pure terror.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jeff Burr"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "C. Courtney Joyner",
         "Mike Malone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091671/",
      "coverLink": null,
      "actors": [
         "Vincent Price",
         "Clu Gulager",
         "Terry Kiser"
      ],
      "reviews": [
         "The magnificent Vincent Price can be seen in several great Horror omnibuses from the 60s (\"Tales of Terror\", \"Twice Told Tales\"), and while the Horror-deity's screen-time is sadly limited in \"The Offspring\", this 80s feature is yet another highly recommendable omnibus starring Price. The popularity of Horror omnibuses/anthologies (more or less) began with the British 1945 classic \"Dead of Night\" and had its heyday in the 60s with films such as the aforementioned Vincent Price classics or the great Mario Bava's masterpiece \"I Tre Volti Della Paura\" (\"Black Sabbath\"/\"The Three Faces of Fear\", 1963, my choice for the greatest Horror omnibus out there), and 70s. The British Company Amicus even specialized in only doing Horror omnibuses, which resulted in such wonderful flicks as \"The House That Dripped Blood\" (1970) or \"Torture Garden\" (1967). A thing most of these anthologies have in common is that the separate tales they tell usually differ in quality, with one or two (depending on how many tales per film are told) usually standing out from the others. This cannot really be said about \"From a Whisper to a Scream\" as each of the tales is quite creepy and atmospheric and about equally memorable, and the question which is the best lies in the personal taste of the viewer. The film, which is entirely set in the small town of Oldfield, Tennessee, starts with the execution of a female serial killer (cult siren Martine Beswick). When reporter Beth Chandler (Susan Tyrell), who witnessed the execution, pays a visit to the convict's sinister uncle Julian White (Vincent Price), he tells her that the town of Oldfield has always been evil, which he exemplifies by telling her four macabre stories. All four stories are macabre, morbid and delightfully creepy. The first one (starring Clu Gulager) is a weird, quite explicit and very creepy tale deals with delicate psycho-sexual topics. The second chapter, a haunting tale about a lowlife crook who stumbles upon the secret of eternal life, is more elaborate and maybe even creepier than the first one. The third tale is about a traveling circus and voodoo, and as everyone who knows anything about Horror knows, circus folks are amongst the creepiest creatures one will ever stumble upon. Rosalind Cash is fantastic as a diabolical voodoo witch. Another creepiest species present in Horror cinema have always been... creepy children, and the fourth and final tale is another proof that kids can be more terrifying than anything. Set in the final days of the Civil War, the fourth story tells the tale of a bunch of brutal and ruthless soldiers, who happen to find an equal in a town full of orphans.... My main complaint about \"From a Whisper to a Scream\" is the fact that icon Vincent Price, who happens to be my favorite actor of all time, has too little screen-time. He merely serves as a narrator and sadly doesn't appear in any of the stories. Otherwise, the film actually surpassed my expectations. While it isn't the best Horror anthology ever made, the tension and creepiness doesn't stop and each tale macabre and highly entertaining. The film is gory, and its sense of humor is very morbid. Apart from Price, notable cast members include former Bond-girl, cave-babe and 'Sister Hyde' Martine Beswick, as well as Lawrence Tierney. This was only the second film by director Jeff Burr (\"Texas Chainsaw Massacre III\"), and for that one must say he did an amazing job. \"The Offspring\" is a surprisingly good and highly entertaining 80s Horror omnibus, the only disappointment being that Vincent Price has too little screen time. Highly recommended.",
         "When I say that I somehow overlooked THE OFFSPRING (aka FROM A WHISPER TO A SCREAM) when it came out during the late 80's, I'm basically summing up this movie's history. It's unrighteously overlooked and forgotten. It's a very satisfying horror-anthology that is slightly more dark and gory than its counterparts released during that period (CAT'S EYE, CREEPSHOW 2,...). The wraparound story has reporter Bess Chandler travelling to the town of Oldfield. She's there to interview the uncle of executed serial killer Katherine White. The uncle, played by horror-icon Vincent Price, lives in this house full of books which contain the history of Oldfield. Through four stories Julian White reveals to Bess the evil that dwells in Oldfield. The first story had me fearing the worst, because the acting was rather poor. Just when I was about to think this was gonna be a lame story about a guy going nuts and killing some women, there was the act of necrophilia (not shown, though) and the completely unexpected twist in the end. Since this was the least successful story of the four, I was in for a treat. Because every story got better and better. Just for the fun of it I made up a title for every episode (because they actually don't have any in the movie). \"Brother Dearest\": Clu Gulager (best known to horror-fans for his role in THE RETURN OF THE LIVING DEAD) plays Stanley Burnside, a timid man who lives with his ill sister. He falls in love with his boss, but it turns out she's not interested. It seems that Stanley doesn't handle rejection well, as the walls of his sanity begin crumbling down. \"Swamp Renewal\": This part seemed to be made by a total different director, but it was not. The tone and camera-work was different. It revolves around Jesse Hardwicke, first rate trailer trash, who gets chased into the swamps by two gangsters. Mortally wounded he loses consciousness. An old man takes him under his care. This is more a voodoo-like tale with an anti-greed message. The music was memorable and so was the shock-ending. \"Of Glass And Pins\": A very creepy carnival story with the goriest death-scene of them all. Steven Arden is known as the Glass Eater, an act of the carnival's freakshow. Amaryllis, one of the spectators, is desperately in love with him. But all the freaks of this carnival are under the spell of Snake Woman, and she will not tolerate any of her freaks leaving the circus, not even for love's sake. \"Children Of The Civil War\": This is basically the gory freaked out version of CHILDREN OF THE CORN, disguised as a period piece. I really liked the way the story unfolded. The creepy kids gave decent performances and the atmosphere was terrific. The wraparound story itself wasn't anything special, though. But still this is a decent anthology horror movie (despite its rather small budget) with good, solid short stories, all including a nice twist in the end. There's enough blood and (mild) gore to keep every horror-fan amused. When we look at writer/director Jeff Burr's resume, THE OFFSPRING might easily be one of his best genre efforts. It's worth seeking this one out.",
         "Of the many horror films I used to alleviate childhood boredom, this one was indelibly etched into my brain and probably will be forever. A cinematic achievement of unparalleled depravity, this Vincent Price vehicle (filmed in the Autumn of his life) contains incest, rape, child molestation, necrophilia, voodoo, glass-eating, slavery, mutilations, dismemberment, vengeance and allusions to cannibalism. By genre standards, the scripting, filming and performances were, for the most part, excellent and the work contains enough scatology to hold the interest of even the most reluctant horror/exploitation filmgoer. View this work if you would like to see an exaggerated depiction of humanity at it most malignant neatly condensed into four vignettes.",
         "No, this has absolutely nothing to do with the band, even though they share the same name and even the same exact logo. I found this to be something special. Even though I had never heard of it and I just saw it at the video store and saw that Terry Kiser was in it. What we get here is little anthology of nasty tales told from a librarian, about the sinister history of a small Tennessee town. Now, I found the first story (with Clu Galagher) to be just a bit too sick, it's still pretty entertaining and his character plays a loser to such perfection that it's actually funny to watch him. I won't say much in the way of that one, but I will say that involves incest, necrophilia, and some really awful singing of some even worse lyrics. The second one, I believe was my favorite. Terry Kiser plays a white trash moron by the name of Jesse Hardwicke who is on the run from some nasty creditors. When he is shot by one of the previously mentioned creditors, he manages to crawl his way to a boat where he passes out and drifts through the swamps. He's discovered by a hermit-type who brings him back to health and also gives him the gift of eternal life. Jesse, being an ungrateful IDIOT, has ideas to take the old man's voodoo skills and use it as a way to cash in. When the old man refuses to give in, he tries to kill the old man. Big mistake. That's all I'm going to say about that one. But let me say this, this little tale has the most shocking, disturbing, and disgusting ending of any of the rest. In fact, it tops more endings than any other horror flick I can think of for that matter, on that level. Just see it. The third story, I really wasn't too crazy about. It has to do with a circus guy who eats glass. It didn't do much for me. The last in the act is pretty chilling. Set back in the civil war, a few yankees stumble upon a house inhabited by young children whose parents were all killed during the war. What happens here is pretty sick and so shocking that I won't say what happens. As far as anthologies go, this is one of the best I've seen. It edges out \"Creepshow\", \"Creepshow 2\", \"Cat's Eye\", and \"Deadtime Stories\". I'm really hoping that it gets a dvd release.",
         "Opening with the execution of a serial murderess\u0097a scene which proves to be rather uncomfortable viewing thanks to its humourless approach and Jeff Burr's unflinching direction\u0097From A Whisper To A Scream is quick to establish its credentials as a nastier than average horror omnibus: this is not a collection of scary stories tempered by dark humour, but rather a genuine attempt to shock and horrify. And more often than not, it succeeds! Vincent Price plays Julian White, the father of the executed woman, who recounts several macabre tales in an attempt to convince a journalist that his home town of Oldfield is a place of unparallelled evil. The first story stars Clu Gulager as Stanley Burnside, a seemingly meek man who turns to murder after being spurned by an attractive co-worker. And then to make matters worse, he consummates his love with the poor woman's corpse, which results in the birth of a (laughably unrealistic) demonic child nine months later. Gulager gives a great performance, but the story lacks a suitably memorable ending. Tale two is a much more successful effort, and sees trailer-trash lowlife Jesse Hardwick (Terry Kiser) mortally wounded by a pair of gun toting gangsters before escaping into the swamps, where he is miraculously nursed back to health by reclusive old-timer Felder Evans (Harry Caesar). When Jesse realises that Felder possesses the answer to prolonging life, he resorts to violence to discover the old man's secret, with terrible consequences. Well paced, with solid direction, excellent use of music, and a truly chilling ending, this is perhaps the best of the four stories. Next up is a nifty tale of voodoo magic and forbidden love that sees carnival freak Steven (Ron Brooks) paying the ultimate price when he decides to leave the circus to be with his girlfriend, Amaryllis (Didi Lanier). A wonderfully splattery finalé makes this episode unmissable fun for gore-hounds. The final story also features more than a touch of graphic violence, and stars Cameron Mitchell as a despicable Confederate soldier who meets a very nasty end when he stumbles across a town ruled by a gang of cannibalistic children. A thoroughly depraved piece of nastiness, with a brilliant central performance from Mitchell, this chapter features some of horror cinema's most fearsome kids (The Children of the Corn are nothing compared to these little monsters!). Like many horror anthologies, From A Whisper To a Scream is a rather uneven affair overall, offering four episodes of varying quality, all connected by the rather unexceptional wraparound story. However, what makes this movie stand out from the crowd are its sterling cast, the solid direction from Burr (who gave us the unfairly maligned TCM sequel Leatherface), and a willingness to explore themes that many might consider taboo: this extremely warped collection of tales deals with such unsavoury topics as necrophilia, incest, child murder, and cannibalism, all of which go to make it perfect viewing for sickos like me!!! 7.5 out of 10, rounded up to 8 for IMDb.",
         "Following his niece's execution, a librarian recalls several horror stories of the town's past to a skeptical reporter. The Good Stor(ies): Story 1-Madly in love with his boss, a grocery store clerk attempts to court her only to find his advances spurned to the point that he kills her. Attempting to hide the crime, he eventually finds that not only has he gotten away with it but his passion burns beyond the grave. This here wasn't all that bad of an effort. As it revels nicely in the utter dementia of his obsession and what he wants to do to her from the beginning, this one sets the revenge to come later on quite nicely as this generates some solid moments throughout here. The final revelation is a bit predictable and there's a few too many plot-points to go through but it has enough fun that there's plenty to like here. Story 2-When his past catches up to him, a wounded fugitive in the Louisiana bayou comes across a voodoo healer who restores his health. Overcome by greed, he demands to know its secrets which begins to spiral out of his control and gets more than he bargained for. This was undoubtedly the highlight of the series with a lot to like about it. The simple story and the predictable setup give this a truly appropriate anthology feel that gets worked over nicely by the setting here. The bayou atmosphere and use of voodoo provide more to like by giving it a dirty, grimy feel in the sweat-filled shack that they spend the majority of the time at, and along with plenty of fun voodoo-related tortures that give this some wholly chilling moments. Story 4-Attempting to find refuge, a platoon of soldiers in the Civil War stumble upon a deserted town in the countryside inhabited only by orphaned children. Taken captive by the hostile group, they are forced to partake in a series of grisly games that grow excessively more dangerous. This was a fun if overall slightly flawed effort. While it has plenty of stellar atmosphere in the old- school village with the Civil War time-period and the gory kills in the segment are quite graphic, overall the segment feels too familiar and cliché which does render the surprise rather obvious. The fast pace works here, so it does end this on a high note. The Bad Stor(ies): Story 3-Working as a freak in a carnival, a glass-eater falls in love with a regular visitor which upsets the tyrannical queen who runs the show. When he defies her to be with his beloved, he finds the powers of her vengeance far more cruel to bear to keep them apart. This was quite a bland and overall uneventful entry. This one doesn't have much at all going on which tends to make this uneventful due to the romance throughout here, and it doesn't feature much of anything until the ending. This is the saving grace as the gruesome and gory happenings are a real showstopper, but overall not much else happens in this one. Rated R: Graphic Violence, Graphic Language, Full Nudity and violence-against-children.",
         "A fun multi-story horror narrated by Vincent Price (as a librarian!) to cult icon Susan Tyrrell (as an 80s reporter) featuring four shorts about a cursed town. Small parts by horror icons abound, necrophilia, a killer mutant baby thingamajacque, circus freaks, dismemberment, and a group of kids that make the Children of the Corn look like the Little Rascals. How could you not love this?! This feels like a precursor to the Tales from the Crypt series, but it goes for horror more so than humor. The last segment is the creepiest, but all of them are good in their own right. Anyone who digs on anthology horror should find plenty to like in \"The Offspring\"/\"From a Whisper to a Scream.\"",
         "A DVD release of a classic 80's anthology flick, \"The Offspring\" is finally available! It is going under its original title \"From A Whisper to a Scream\", which fits into the VHS horror anthology genre along with Creepshow 2 during the glorious year of 1987. The film's introductory sequence of a woman's execution is both dreamlike and creepy, headed in a perfect cameo by the hard-faced Rod Steiger. Then we're escorted into the next series of stories hosted by the great Vincent Price, who is seemingly portraying the uncle of the woman who was executed. Price begins to remark on the long history of violence that takes place in the town of Oldfield, Tenn, and narrates the following tales while an inquiring reporter listens in. The first story is probably the best if not the most shocking. I think any horror fan would agree that this is the one that put Clu Gulager on the map of unique 80's genre actors. He plays an under-confident geek who's fantasy girl wants nothing to do with him. So he goes off the deep end, and the end result of his twisted madness ranks is as one of the great moments in horror anthology history........not to spoil it too much. Two more delicious tales follow about a unscrupulous thief who messes with the wrong voodoo priest, and glass-eating circus performer who's gift is horribly compromised when he falls for the wrong girl. Each story ends with a bloody, gruesome, and mean-spirited surprise, and the cast plays it out so seriously that the audience knows its not for laughs. Its dreadfully moody atmosphere distinguishes this from other 80's anthology hits such as \"Creepshow 1 and 2\", Tales From the Crypt.....etc. This has excellent performances from Terry Kiser, Rosalind Cash, and Cameron Mitchell. The DVD release, with the exception of the title, is overall pleasing. MGM didn't waste too much time with re-mastering the material which is normal for these obscure favorites, but its the dark grainy texture of this movie that makes it surreal and genuine. It includes the original theatrical trailer which I remember to be creepily effective in its time. If you're lucky enough to own the original VHS version of this flick, then hold on to it tight, but if you've never seen it, and you like 80's horror, the DVD is great find.",
         "Some horror fanatics might know \"From a Whisper to a Scream\" by its other title, \"The Offspring.\" Director Jeff Burr and the screenwriters take the portmanteau formula and inject their own brand of bloodletting and revolting deeds of dementia into it. Their approach takes the art form to a whole other level of graphicness and disgust that couldn't be explored in previous decades. Beneath the small-town exterior of Oldfield, Tennessee lies a history of shocking violence and terrifying phenomena, as recounted by local historian Julian White (Vincent Price). In the '80s, an office worker (Clu Gulager) nurses a deadly crush. In the '50s, a witch doctor (Harry Caesar) holds the secret to unending life. In the '30s, fighting breaks out in a traveling carnival over forbidden love. Finally, in the 1860s, Union soldiers discover a group of orphaned children with a deadly agenda. When you see Vincent Price's name attached to \"From a Whisper to a Scream,\" your mind will drift to the classic films he made in the 1960s and 1970s, which were tame by today's horror standards. I assure you that's not the case here. The four tales presented come stuffed full of the gore and gruesomeness we all expect from 1980s genre movies. \"From a Whisper to a Scream\" is rated R for violence and gore, adult situations, nudity, profanity, alcohol, drugs, smoking, and frightening and intense sequences. Necrophilia is insinuated which spawns a deformed monster baby in one of the most disturbing segments of the film. No nudity is shown in relation to sex. It was still unnecessary and added nothing to the story or plot. \"From a Whisper to a Scream\" fits perfectly somewhere between other portmanteau films made in the 1980s like \"Tales from the Darkside\" and \"Creepshow\" and 1960s classics such as \"Tales from the Crypt\" and \"The Vault of Horror.\" Vincent Price serving as the teller of the sordid stories lends an air of nostalgia which leads the viewer to expect a bit more quality to what might be mistakenly thought of as just another attempt at an anthology collection. However, you'll find yourself glad you made the trip to Oldfield as the ending credits roll.",
         "\"From a Whisper to a Scream\" is an excellent horror/anthology which takes place in the small town of Oldfield,Tennessee.Julian White(as always brilliant Vincent Price)relates four hideous stories to the news reporter Bess Chandler(Susan Tyrrell).In the first one for example,a horror veteran Clu Gulager gives an immensely entertaining performance as a mild-mannered,but suitably creepy old bachelor who takes care of his pathetic sister and who also happens to have necrophiliac intentions toward younger women.The last story is truly disturbing-it has a group of Yankee soldiers during the Civil War who run into a group of psychotic Rebel kids,whose parents were all killed in the war and all hell breaks loose!!Despite the emphasis on gore and some pretty vile subject matter,the film is well-made and interesting.Highly recommended.",
         "Horror omnibuses have been around in one way or another pretty much since the great Mario Bava rejuvenated them in 1963 with the awesome Black Sabbath. They often vary in quality, and many are brought down by weak links; this one, however, doesn't suffer from any weak stories. Obviously, some are better than others; but all in all, I don't hesitate to call this one of the best horror omnibuses that I've seen. From a Whisper to a Scream is most notable for the fact that it is Vincent Price's last ever 'pure' horror movie. It's a shame to see the great master during his swansong to the genre that made him; but on the other hand, this role really shows Price's talent as, despite being only a small part, he really makes the best of it. The plot concerns a small town called Oldfield. After the electrocution of his niece, librarian Julian White (Price) tells a reporter about the horrible incidents that have occurred in the town. The first tale is the weakest of the bunch - but it still has it's moments. Clu Gulager is creepy throughout, and the themes that it handles are quite frightening. Speaking of frightening - check out that tale's climax! Anyway, tale one is just a warm up, really... Tale two is the highlight for yours truly. I love it when an omnibus flick produces a tale worth remembering - and this tale certainly is! It works from more than just visual horror, and when you think about the potency of the ending - this one really hits home. Nice message, too. Not far behind in terms of quality is tale three. This is the typical eighties story of the bunch, and a lot of the reason it works is courtesy of the gruesome special effects. This one also generates intrigue from it's story, however, and cant be seen as merely an excuse to show some blood and guts. The last tale of the quartet is the most psychological of the bunch, and it follows the fortunes of three civil war soldiers that are 'kidnapped' by a bunch of children! This one went on a little bit too long for my liking, but the ideas behind it are good and the way that we see the soldiers being dominated by the evil children is quite surreal. It's obvious that writer-director respects the fact that he's managed to get one of the all-time greatest horror actors in the film by the way that the wraparound story is handled. Usually, this part of the film lets it down because it hasn't been very well thought out - but the one in this film is completely the opposite and actually makes the movie! On the whole, this isn't a must see horror movie, but it's very good and I highly recommend it!",
         "\"From a Whisper to a Scream\" is a very lively and surprisingly entertaining horror anthology that got neglected in the congested horror offer of the eighties. That's quite a shame because this little sickie film has several things going for it, like for example one of the very last performances of the legendary Vincent Price and a versatile range of demented and gruesome tales. This film uses a creative starting point, namely a little Tennessee town that seems to inject pure evil into the lifeblood of its inhabitants. The story begins with the execution of a female serial killer born and raised in Oldfield, Tennessee. Afterwards, an obstinate journalist goes to see Oldfield's old librarian Julian White (who also happens to be the killer's uncle) and he tells her four stories of past horror to illustrate what wicked influence this demonic little town has. I was expecting to see tame and ethically correct terror tales (like the kind \"Creepshow\" features) but, to my surprise, every chapter was imaginative and very violent! The first story contains the most shocking theme (necrophilia!) but it was the least convincing one and merely served as a vicious warming-up feature. Clu Gulager looks truly frightening in this chapter and the tone is effectively depressing. After the first, the fun really kicks in with three very exciting and hard-boiled tales of madness! The second one revolves on a small time crook hunting for the secret of eternal life in the swampy wastelands around Oldfield. This chapter features a gruesome climax and haunting anti-greed message. The third story is my absolute favorite, simply because it handles about fierce carny folks! A traveling carnival passes by Oldfield and one of the acts falls in love with the local beauty Amaryllis. But, it turns out that the carnival and its performers hide some terrible secrets and the fiendish leader won't let any of her \"slaves\" get away. I loved the eccentric characters in this tale, as well as the tense atmosphere. The climax here is exaggeratedly gore and a must-see sequence for fans of cheesy 80's splatter. The last episode is very spooky and enlightens us a little more on the history of this devilish little town. It's set at the end of the Civil War where hillbilly soldiers are captured and molested by .... children who lost their parents. Some really good scenery and atmosphere in this tale, as well as good eerie performances by the child-actors. \"From a Whisper to a Scream\" is an overall original and amusing horror film with quite some sickness and shocking images. Price is still great although it hurts to see this once-vivid horror veteran ageing. There are interesting cameos from Lawrence Tierney as the warden and Martine Breswick as the convicted serial killer. Recommended!!",
         "Originally known as \"From a Whisper to a Scream\" (Which is also the DVD Title), \"The Offspring\" had been filmed in or around 1985 and '86 but did not get released until 1987. This movie marked the debut of director Jeff Burr, who would later go on to direct Stepfather 2, Texas Chainsaw 3, Puppet Master 4-5, and others. I had bought this back in April and I was kinda let down, not by the movie, but the tape itself. I had expected it to actually be in SP Mode, as most I've tapes from the era used that speed. It seems to be recorded in SLP Mode, which I highly despise, because of it's crappy quality and the excessive amount of tracking adjustments that's required with an SLP tape. The tape acts funny during I've's \"Movies America Wants to See Promo\", it acts funny during the \"Lady Beware\" part, to be specific. Anyway, onto the movie. We start off with Serial Killer Katherine White (Played by Former Bond Girl Martine Beswicke) who appears to be in a wedding dress at some sort of wedding. Turns out, it's just a dream, as we flash forward to her execution via lethal injection (Which I oppose btw.) It seems like she was awaiting a word from the Govenor, as the warden (Played by Lawrence Tierney in a cameo), says he has no choice but to carry on the execution. At the execution is a reporter, Beth Chandler (Played by Susan Tyrell from \"Forbidden Zone\".) She later drives to a library in Oldfield, TN, which is owned by the Librarian/Town Historian Julian White (Played by the great Vincent Price.), who just so happens to be Katherine's uncle, who blames the town of Oldfield on his niece's wickedness. So then he tales Beth 4 stories about the history of Oldfield. The first story takes place during the 80s, and is about a strange man named Stanley Burnside (Played by Clu Gulager from \"Return of the Living Dead\" in an unrecognizable role), who lives with his sister Eileen, whom he often gives sponge baths to (incest?), and he has an obsession with a female co-worker, Grace Scott. Later on, Stanley kills Eileen during one of her sponge baths after killing the co-worker. He goes to Grace's casket and performs necrophilia (I'm not saying anything) on her dead body. Towards the end, The Offspring (The monster on the cover, obviously) gets to Stanley and kills him. End of first story. In my opinion, this is probably the most weirdest, yet mediocrely acted story. The next story takes place during the 1950s and is about a man named Jesse Hardwicke (Played by Terry Kiser from \"Weekend at Bernie's\") whose wife comes to him and tells him that she's leaving him and taking all of his money. At the same time, 2 mobsters come after Jesse and leave him for dead. He is later discovered by an old African-American fellow named Felder Evans (Played by Harry Cesar) who knows the key to eternal life. Jesse wants to make money off of it, so he can get his revenge, but Felder has no desire to make any money. Eventually, bad actions lead to bad consequences, if you will. There is later a somehow pointless scene of Jesse in the hospital while 2 doctors are discussing some BS no one really cares about, but aside from that, this happened to be my favorite segment in the movie. The third story takes place during the 1930s and is about a sideshow carny who can swallow glass. He wants to quit because of a girl he loves, but his boss, played awesomely by Rosalind Cash, won't let him. As the carny and his girlfriend run off to a hotel, then the gore begins. This was probably the most goriest one in the movie. The fourth and last story takes place sometime after the Civil War and revolves around a band of soldiers (Lead by Cameron Mitchell) who encounter children of the victims of the war, who worship a strange deity called \"The Magistrate.\" This story plays a lot like \"Children of the Corn\" and to some degree, \"The Children\", \"Beware: Children at Play\", and the Star Trek episode, \"And the Children Shall Lead.\" This could probably be seen as the 2nd most goriest one. There was this one scene that really creeped me out. It was the scene where one of the soldiers loses an eye to the kids and is given to a girl who wants her eye replaced. The movie ends (SPOILERS AHEAD!) with Beth killing Julian for some strange reason (I forgot which) but anyway, in my opinion, people who are into anthologies like \"Creepshow\", \"Tales from the Darkside: The Movie\", \"Cat's Eye\" or even \"Deadtime Stories\" should probably get into this as well. Oh by the way, before I end this review, if anyone happens to have a copy of this movie that looks something like what's shown in the link below, please email me at ryan02732@gmail.com. I've been looking for it for sometime now. http://cdnl3.livevideo.com/image/42/488242/760057_pm.jpg",
         "One of the most richly cherished memories of my gloriously misspent adolescence stems from seeing this right-on horror anthology flick in some scuzzy second-rate shoebox theater with my younger brother. We both quite enjoyed watching it and today it holds a special place in my heart for the simple reason that in our current depressingly restrictive blockbusters only multiplex monopoly this modest indie fright feature would sadly never see the light of a projector; instead it would be directly dumped straight to video and cable TV. And that's everyone's loss, man. A snoopy reporter (an oddly restrained performance by the usually more manic Susan Tyrell) visits the seedy podunk burg of Oldfield, Tennessee and interviews a kindly librarian (the late, great Vincent Price, who makes the most off his small, yet pivotal role), who informs Tyrell about the town's sordid, depraved, blood-spattered history by relating a quartet of spooky stories. First tale, \"Zombie Love Child\" - Clu Gulager gives an excellent, gut-busting turn as a clumsy, cloddish, middle-aged milquetoast dweeb who kills a young woman he's been pining for from afar and makes love to her fresh corpse (gross!). A hideously misshapen, murderous mutant zombie baby is the result of this twisted tryst. Second yarn, \"The Secret of the Bayou\" - A two-bit crook (well played with customary slimy aplomb by Terry Kiser) gets mortally wounded by two hoods he doublecrossed and is brought back from the brink of death by a wise, reclusive ex-slave old black man (a fine, mesmerizing Harry Caeser) who has discovered the secret to immortality. Third opus, \"Of Glass and Geeks\" - A carnival glass eater falls for a winsome young missus and decides to bag out on the freakshow scene, thus incurring the wrath of the carnival's formidable voodoo priestess owner (juicily hammed to villainous perfection by \"The Omega Man\" 's Rosalind Cash). Fouth anecdote, \"Wrath of the Civil War Orphans\" - A ragtag group of brutish, no-count Confederate Civil War soldiers led by a sadistic captain (the ubiquitous Cameron Mitchell in peak scurvy form) seek refuge in a dilapidated mansion inhabited by seemingly harmless, deformed orphan kids. Very capably directed by Jeff Burr, with a pretty warped and imaginative script by C. Courtney Joyner (who later penned the terrific haunted penitentiary pip \"Prison\"), nicely disgusting make-up f/x by Rob Burman (said splatter includes such choice nasty stuff as splashy gunshot wounds, gory stabbings, a torso being shredded from the inside out by sharp shards of glass, and, most gruesome of all, a severely burned-up limbless body), a generally serious tone with appropriately perverse touches of pitch-black humor, and nifty cameos from Hammer horror scream queen Martine Beswicke as a convicted murderess who gets executed at the very start of the film, the ever-imposing Lawrence Tierney as the grim-faced warden who presides over Beswicke's execution, and Angelo Rossitto as an antsy carny midget, \"The Offspring\" rates highly as pleasingly ghastly and ghoulish omnibus horror fun.",
         "Next to the British TALES FROM THE CRYPT and Corman's TALES OF TERROR, THE OFFSPRING is one my favorite horror anthology film. It makes CAT'S EYE and CREEPSHOW 2 look pitiful by comparison. The thing I liked the best about THE OFFSPRING(aside form Vincent Price being in it, of course) was that each story ran as long as it had to. If I recall correctly, there are four stories, and with the tie-in sequences, that makes for a fast-paced viewing. The film focuses on the gruesome incidents involving a semingly cursed town, and the people who had passed through it. Price is perfectly creepy as the town's \"caretaker\" as he unravels one story after another of strange occurrences. The sequence with Clu Gulager is simply disgusting, the cheap effects almost ruining the ending. The story about voodoo is good, as is the Civil war sequence. I like THE OFFSPRING a lot, mostly because it has more balls and imagination that most of the films that pretend to be horror films nowadays. And it is the last starring appearance of the late-great Vincent Price, reason enough to check it out.",
         "This four-part horror anthology was definitely better than I expected - I gave it a 7/10, when before viewing it I was hoping for a 5 at best. Its main strength is its wonderful unpredictability; at least two of the stories (the second and the third) demonstrate very good scripting. The first episode ,an illogical story of paranoia and necrophilia, is the weakest, but then the (twisted) fun begins! A surprisingly successful effort, if perhaps too gruesome and unpleasant to be recommended without some hesitation.",
         "Wonderfully grim and intense horror anthology, one that could definitely stand to be better known. It deserves to be at least as well known as, just for an example, \"Creepshow\". It's tied together with the story of a Katherine White (cult icon Martine Beswicke, wasted in a much too brief role), executed for her years spent as a murderer. Her uncle is local librarian / historian Julian White (horror legend Vincent Price, a delight as always), who is visited by reporter Beth Chandler (the inimitable Susan Tyrrell) who wants to know more. Julian explains, in part by relating four stories (starting with the most recent and working backward), that the town of Oldfield has always been a breeding ground for mania and murder. To start, we get the story of Stanley Burnside (Clu Gulager, as creepy as can be), a meek man with an unhinged fixation on pretty co-worker Grace Scott (Megan McFarland). Even after killing her, he can't let her go, and stops by her casket for a bout of necrophilia. Nine months later, the result of that union comes looking for him. Not bad overall, what adds to the \"ick\" factor here is seeing the scenes with Stanley and his sister Eileen, played by none other than Gulager's own late wife Miriam Byrd-Nethery. That's what really makes this segment worth watching; overall it's kind of predictable. Segment two is truly something special (as is the fourth segment, but I'll get to that soon enough), as it spins a yarn of lowlife loser Jesse Hardwick (the well cast Terry Kiser), shot and left for dead by vindictive gangsters, and rescued by swamp dweller Felder Evans (the great Harry Caesar). Felder's clearly learned how to extend his life for a long, long time, and Jesse's selfish, greedy nature gets the better of him, and his efforts to learn Felder's secret earn him a horrific punishment that's a macabre pleasure to behold. More horror stories could benefit from this kind of twist. On to our third tale. Earnest, lovely young Amarrillis Caulfield (Didi Lanier) is in love with circus freak Steven Arden (Ron Brooks), who has the ability to munch on nuts, broken glass, etc. without any ill effects. He'd like to run off with her, but the all knowing and scary Snakewoman (the fantastic Rosalind Cash) maintains a powerful hold on him, feeling that he (and others in the circus) owe her far too much to ever go against her wishes. Another interesting conclusion here that should be fun for gore lovers, and there is an attraction in seeing Angelo Rossitto in a small role, as well as an amusing eyeball-in-chest gag. The final yarn is a true doozy, living up to that adage of saving the best for last. This is by far the creepiest of the lot, revealing secrets behind the origin of the town. A trio of nasty, degenerate Yankee soldiers (including Cameron Mitchell as Sergeant Gallen) come upon the place and encounter the children living there - children who have got some surprises in store for them. With a strong \"Children of the Corn\" feel, this is haunting the way it portrays a total loss of innocence. The meeting with The Magistrate is one the viewer won't soon forget. Then the wrap around story is itself wrapped up VERY nicely as Chandler is revealed to not be completely playing it straight with White. The final line of dialogue is priceless. This is a whole lot of fun, this movie, well worth watching for genre fans, with director Jeff Burr (who went on to direct such sequels as the second \"Stepfather\", the second \"Pumpkinhead\", and the third \"Texas Chainsaw Massacre\") working capably from an entertaining script that he co-wrote with C. Courtney Joyner and producer Darin Scott. The excellent music by Jim Manzie is worth a mention, as well as the fact that while the script isn't without humour, it never really goes all the way into comedy of any variety, which some fans may well appreciate, sticking to the dark tone all the way through. All the stories are good, but the second and fourth ones make it a must see. Eight out of 10.",
         "~Spoiler~ From a Whisper to a Scream (aka The Offspring) is a late 80's anthology that I am just now getting to see. I have to say, it breaks even with me. Two of the stories were solid horror offerings, and two of the stories don't have much to offer. The opening story I felt was one of the downers. It involves Clu Gulager, necrophilia, and the demon baby that results. While it makes no sense, it is rather creepy and Clu is always good. The best tale is the second one. Terry Kiser falls in with a Voodoo priest and gets his just desserts in the final act. This particular story reeked of EC comics and I loved it. The third story is by far the worst. It's completely pointless and follows a glass-eating carny. Lot's of carny hi-jinks ensues. The final yarn is also a winner. It takes place near the end of the Civil War and Cameron Mitchell plays a very bad man who comes to a very bad end. I love how the wraparound story unfolds. All of the stories are linked by the township of Oldfield, Tennessee. The town is cursed according to historian Vincent Price (in one of his final roles), but we already know that. This is one of Jeff Burr's better horror films and, while not the best anthology out there, it has some good moments. \"Lovecraft and Poe...I'll drink to those two masters of horror.\"",
         "From a Whisper to a Scream (1987) *** (out of 4) After the execution of a serial killer, a reporter goes to a small Tennessee historian (Vincent Price) who tells her four stories dealing with a small town's history. The first story centers on a man (Clu Culager) who takes care of his severely ill sister but it leads to murder. The second story has a white trash man (Terry Kiser) getting shot and running into the woods where he ends up under the care of an elderly black man (Harry Caesar) who knows voodoo. The third story deals with a carnival side show where the glass eater falls in love with someone outside the troupe, which doesn't sit well with the owner. The fourth and final story is set during the Civil War where an evil Union soldier (Cameron MItchell) ends up in a house of horrors led by children. This film is also known as THE OFFSPRING but no matter which title you want to call it the film itself is actually pretty darn good. Director Jeff Burr will always be remembered for the disastrous studio tampering of LEATHERFACE: Texas CHAINSAW MASSACRE III. This film here is certainly a real gem among the type of horror films that were being released during this period. It perfectly captures the anthology films of the 1960s but adds a touch of violence and gore that was so popular during the 80s. While none of the four tales are excellent, each of them are at least entertaining and make for a fun movie. Again, none of the four stories are wonderful and all four are rather predictable but they are fun. The first one has a very weird incest vibe that runs through it but it also offers up some memorable gore as well as a very good performance from Culager. The second story is familiar voodoo material but the two performances are quite good and the final twist is wonderfully sinister. The third story with \"going against the circus\" is again predictable but the ending is just perfect. Once again the gore effects from Rob Burman really pack a nice little punch. Finally, the Civil War sequence gives us a terrific performance from Mitchell and the story itself is the most original and once again it adds some nice twists. Of course, one of the biggest draws are the wrap around events that feature Vincent Price. While he basically just sits and talks, it's great fun seeing the actor in good form. You'll also want to look quickly for Laurence Tierney, Martine Beswicke and Angelo Rossitto who some will remember from Al Adamson's Dracula VS FRANKENSTEIN. Director Burr does a nice job with the low-budget and he certainly makes the film look very professional on such a budget. The film really does a nice job at building up the atmosphere of the anthology and all four films really work well together. FROM A WHISPER TO A SCREAM is certainly a good little gem.",
         "This is a horror anthology containing 4 segments. In between the segments a librarian/historian named Julian White (Price) tells a reporter stories surrounding the town of Oldfield, Tennessee. The reporter is interested in finding more about White's niece who was sentenced to death for several murders. The first story is of a (crazy) man that is taking care of his mentally ill sister and he falls in love with his boss, a younger woman. Things turn deadly and become more bizarre. This one has a weird ending which I was not crazy about but I enjoyed the story until then. The second story is about a man who is running from gangsters - he is shot - and a strange mysterious man heals him of his wound. I liked this story and the ending. The third story is of a witch who owns a carnival. She has powers over all that work for her. One carny, a glass eater, is in love with a woman out side of the carnival. The witch does not like it and will show both of the lovers the extent of her powers. I was not trilled with this story nor it's ending. The final story is of civil war soldiers that did not realize the war had ended... they found out it was over and ended up in Oldfield where a strange group of orphans were living. The orphans have no intentions of letting the soldiers go. This one was fairly good segment. Over all it's not too bad of a movie - but certainly not Vincent Price's best movies although his performance is good as always. 5/10",
         "After witnessing the execution of Martine Beswick, reporter Susan Tyrrell visits museum curator Vincent Price, who tells her four horror stories. Clu Gulager is memorable a nerdy sick-o indulging in incest, murder and necrophilia who gets his just desserts in the form of a mutant killer baby (the result of a late-night funeral home tryst). Tale two (the weakest of the stories) features a wounded gangster (Terry Kiser) rescued by a swamp-dwelling black man (Harry Caesar) who knows the secret to eternal life. Thirdly, at a traveling carnival, a snake woman (Rosalind Cash) uses witchcraft to enslave sideshow freaks and force them to doing her bidding. When a young woman falls in love with one of the freaks the horror begins. The last (and best) of the stories stars Cameron Mitchell as a sadistic Confederate general taken prisoner by a group of psycho children who subject him to a variety of tortures. The linking footage also has it's own twist ending. The cast is great and the production values aren't bad, but the stories are highly variable in quality and overall effectiveness, making this yet another uneven horror anthology. The 1945 British horror/suspense anthology classic DEAD OF NIGHT has yet to be topped.",
         "I feel I should mention that I love horror anthology movies. Actually, to put it more accurately, I love the IDEA of horror anthology movies. That's because the vast majority of horror anthology movies I have seen have left me less that satisfied, and that also goes for \"From A Whisper To A Scream\" (a.k.a. \"The Offspring\"). It's a pretty cheap-looking movie - director Jeff Burr himself once said the budget was actually $350,000 - though if that's true, I will admit that they managed to stretch the budget pretty far, including the fact they got a once in a lifetime cast. But even if they had more money to spend, the movie would have suffered from the fact that the script is pretty lame for the most part. The second story (concerning someone who has figured out the secret for eternal life) is okay, namely because it has an unexpected (and effective) ironic ending. The other three stories have no surprises and each of them seem to go on forever. I would only recommend this movie to die hard fans of horror anthology movies.",
         "Where in the world do I begin with this. This had to be one of the sickest films I have ever seen in my life. And what is worse was the awesome cast they assembled for this piece of trash. 4 of the greatest of all time, VINCENT PRICE, CLU GULAGER, TERRY KISER, CAMERONE MITCHELL. I was thinking' to myself, before I watched it of course, How could this be anything less then awesome. Even directed by Jeff Burr. How wrong I was. I have never been a fan of anthology movies mostly because each story always has to have some kind of bs shocker end that is almost always very unsatisfying and leaves you empty inside. This was no exception, I assure you. And by the way, why was the girl executed in the first place, we never found out. This could have been an effective film, but it was handled very irresponsibly. It seemed to play simply for sick shock value, and had absolutely no point to the stories at all. There could have been some great moral lessons here if it was handled correctly. story 1 - obviously murder, incest, and necrophilia is wrong. What we are presented on screen could have taught us a very valuable lesson, but it ended up just being a ridiculous sickening shock fest. story 2 - the only redeemable story we have here. and maybe if the others were handled this way the movie would have worked better. story 3 - so terrible, depressing, disturbing and distressing, I can't hardly even remember it. I am a big believer in freedom, and no fate only the power of will, when I see some bs that goes against this I have a tendency to freak out and break things. There is always a way to fight back. story 4 - takes the cake. my god in heaven above. As I said before if this wasn't just played for total sickening shock effect, and trust me the last segment is as sick as it gets, it might have been effective. One last note. Don't let this be how you remember these three great masters of horror that have since passed away. PRICE, MITCHELL, GULAGER, you guys are so much better then this junk."
      ],
      "genres": [
         "Action",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Conquest Productions",
         "Manson International",
         "Whisper Scream Limited Partnership"
      ],
      "summaries": [
         "The uncle of an executed murderess relates four stories of his hometown, Oldfield, to a reporter: an elderly man pursues a romance with a younger woman, even to the grave and beyond...a wounded man on the run from creditors is rescued by a backwoods hermit with the secret to eternal life...a glass-eating carny pays the ultimate price for looking for love on the outside...and Civil War soldiers are held captive by a household of orphans with strange intentions for them.",
         "In a small Tennessee town, an historian relates four horror stories to a reporter."
      ],
      "budget": 1100000
   },
   "movielensId": 134503,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1987-09-25",
      "dvdReleaseDate": null,
      "directors": ["Jeff Burr"],
      "runtime": 99,
      "movieId": 134503,
      "title": "From a Whisper to a Scream",
      "mpaa": "",
      "actors": [
         "Vincent Price",
         "Clu Gulager",
         "Terry Kiser",
         "Rosalind Cash",
         "Cameron Mitchell",
         "Harry Caesar",
         "Susan Tyrrell",
         "Martine Beswick",
         "Ron Brooks",
         "Miriam Byrd-Nethery",
         "Didi Lanier",
         "Thomas Nowell",
         "Ashli Bare",
         "Terence Knox",
         "Megan McFarland",
         "Angelo Rossitto",
         "Lawrence Tierney"
      ],
      "imdbMovieId": "0091671",
      "originalTitle": "From a Whisper to a Scream",
      "genres": [
         "Comedy",
         "Horror"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The uncle of an executed murderess relates four stories of his hometown, Oldfield, to a reporter. In the first, an elderly man pursues a romance with a younger woman, even to the grave and beyond. In the second, a wounded man on the run from creditors is rescued by a backwoods hermit who holds the secret to eternal life. In the third, a glass-eating carny pays the ultimate price for looking for love on the outside. And in the fourth, a group of Civil War soldiers are held captive by a household of orphans with strange intentions for them.",
      "tmdbMovieId": 39895,
      "avgRating": 2.875,
      "releaseYear": "1987",
      "numRatings": 4,
      "posterPath": "/gIjs3NqwLDG0YALRgCAHpsfS1dE.jpg"
   }
}