{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "behind the scenes",
            "id": 9817
         }
      ],
      "imdb_id": "tt3966544",
      "video": false,
      "title": "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau",
      "recommendations": [
         253297,
         295099,
         78529,
         250577,
         282041,
         62472,
         26766,
         116569,
         71723,
         30194,
         14279,
         112969,
         52728,
         222724,
         5898,
         18902,
         40220,
         23587,
         16194,
         61418
      ],
      "backdrop_path": "/SW9x5lqk3seT7FCFfD72Cl2ELw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "53b4a2d50e0a2676c7000501",
               "name": "Richard Stanley",
               "profile_path": "/52gdvKA676KJ2gsAH4XHEOghZwH.jpg",
               "id": 42175,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 1,
               "credit_id": "53b4a2f20e0a2676bf0004fa",
               "name": "Fairuza Balk",
               "profile_path": "/cpeniV326TyPyzryxgbAWiXmLkz.jpg",
               "id": 826,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Self",
               "gender": 2,
               "credit_id": "55a813dd92514172ef00027f",
               "name": "Marco Hofschneider",
               "profile_path": "/n1gUzpoikh4Fc8FVA9LEgVpLWM3.jpg",
               "id": 23797,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Herself",
               "gender": 0,
               "credit_id": "56564bf29251410191005790",
               "name": "Kier-La Janisse",
               "profile_path": null,
               "id": 1086886,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 2,
               "credit_id": "56564c8f925141018c005982",
               "name": "Michael Gingold",
               "profile_path": null,
               "id": 99994,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "56564cd3c3a3681982005afe",
               "name": "Graham Humphreys",
               "profile_path": null,
               "id": 1541146,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "56564ce5c3a368196e0060b0",
               "name": "Edward R. Pressman",
               "profile_path": null,
               "id": 32035,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "56564d51c3a3681982005b2e",
               "name": "Robert Shaye",
               "profile_path": "/ylgPcVcvDAZ9IykvDVN4894cEJh.jpg",
               "id": 13663,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "53b4a2a90e0a2676cb0004ea",
               "name": "David Gregory",
               "profile_path": null,
               "id": 1125302,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56564b7d92514109e80005a8",
               "name": "Douglas Buck",
               "profile_path": null,
               "id": 937570,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56564e36c3a368198400599a",
               "name": "Graham Humphreys",
               "profile_path": null,
               "id": 1541146,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "56564b61c3a368198400582d",
               "name": "Jim Kunz",
               "profile_path": null,
               "id": 1447987,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.420365,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 279992,
      "vote_count": 34,
      "budget": 0,
      "overview": "We’ve heard all the insane rumours and scandals attached to the ill-fated 1996 remake of H.G. Wells’ THE ISLAND OF DR. MOREAU. How director Richard Stanley spent four years developing the project only to be fired after four days of shooting and replaced by John Frankenheimer and how headliner Marlon Brando impacted on that decision. Now for the first time the living key players recount what really happened and why it all went so spectacularly wrong. Stanley spills the juicy beans, stars Fairuza Balk and Rob Morrow give revealing interviews, New Line head Robert Shaye, producers Ed Pressman and Tim Zinnemann chime in and numerous crew from both versions add their reminiscences. David Gregory’s epic documentary is also a veritable encyclopaedia of behind the scenes footage, concept art and storyboards, creature designs, makeup tests and candid photos to illustrate the shocking tale of eccentric artist vs. Hollywood machine.",
      "similar": [
         44826,
         4539,
         19913,
         4995,
         1581,
         11615,
         254,
         14,
         11216,
         7446,
         856,
         2294,
         509,
         522,
         319,
         371638,
         74643,
         330127,
         4234,
         244
      ],
      "original_title": "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau",
      "runtime": 100,
      "poster_path": "/75Uz2AM8xR3hYwR8pezwuooyuyC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Severin Films",
         "id": 38474,
         "origin_country": ""
      }],
      "release_date": "2014-08-24",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Gregory"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["David Gregory"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt3966544/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQzOTM5MDk2Ml5BMl5BanBnXkFtZTgwODUwMTk3MjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Richard Stanley",
         "Kier-La Janisse",
         "Michael Gingold"
      ],
      "reviews": [
         "The 1996 adaptation of one of my favourite H.G. Wells story, starring Marlon Brando and Val Kilmer, was not well received to put it politely, and its production even less rosey. Well, 18 years later, a documentary goes behind the scenes to unravel how a young indie filmmaker got his shot at Hollywood big time, and what was a dream project became every filmmaker and studio's worst nightmare. A sort of surreal affair, 'Lost Soul' mixes brand new interviews (the big draw being the notoriously elusive Stanley), archive footage and photos/concept art to tell of how this young British talent tried to fulfill a lifelong dream to adapt and update Wells' tale of science gone awry, and damn is it engrossing. There are no holds barred and spades are called spades as the cast (and many different crew, from ADs to managers to even extras) recall just how much of a hell things were, even in pre-production, as well as the pain that was Brando, replacement director Frankenheimer, and especially Kilmer. Stanley himself, with his deep voice and unusual appearance, a sort of hybrid of Indiana Jones and a voodoo shaman, is fascinating to watch as tells his misadventure with a slight hint of bitterness but also a sort of sage wisdom about it. Of course, director David Gregory is smart enough to not let this turn into just one big slog of talking heads. He regularly breaks it up with an assortment of visual treats, including the magnificently disturbing concept art and storyboards for Stanley's original vision, archive footage of the shoot and the grotesque makeup effects of the beast people, even new material recorded at the now overgrown location. The whole thing is underscored by a sinister soundtrack that adds to the nightmarish feel as you journey on and more and more goes wrong, even on occasion referencing witchcraft and unusual phenomena. In terms of complaints, I don't really have many, save for maybe the lack of remastering of some archive footage, the soundtrack can sometimes go a little over the tip, and the film does taper off towards the end and doesn't dwell on the film's reception and legacy as much as I would've liked. However, it is firmly Stanley's story, and a great watch for fans of film and filmmakers.",
         "Like Hearts of Darkness and Lost in La Mancha, Lost Soul is an excellent documentary in which the cast and crew tell the story of a troubled production. The Island of Dr. Moreau is a serviceable, much-maligned movie about a mad scientist who combines humans and animals to make freakish humanoids. The production was infamously difficult, though the gritty details were widely inaccessible to the public. Told through the recollection of some--but not all--of the various cast and crew involved in this movie, Lost Souls delivers the intricate story of this notorious film. Those curious about the origins of Brando's choice to wear an ice bucket on his head, or the casting and director changes during filming, are in for a treat. This doc will definitely have you grinning ear-to-ear at the nuttiness of it all.",
         "This documentary is an engrossing story about unconventional talent, young ambition and the perils of big-budget film making. I recommend watching The Island of Doctor Moreau (1996) before viewing this film. It will give things context, but it's also an example of a so-bad-it's-fun movie. The majority of the documentary is an exercise in sharing war stories from a film set plagued with problems. The strangest events are recalled and people weigh in on how things went so wrong and how the trouble could have been prevented, or at least lessened. There is a good number of interviewees and they range from producers to actors to crew members. Director Richard Stanley, of course, takes center stage. Although it has flaws, such as failing to mention David Thewlis, this is definitely a good watch for fans of similar documentaries like Hearts of Darkness: A Filmmaker's Apocalypse (1991), Lost in La Mancha (2002) and Jodorowsky's Dune (2013).",
         "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau (2014) is a documentary that tells the secret story behind Richard Stanley's involvement, as the uncredited director and extra, in the cult movie The Island of Dr. Moreau (1996). After his cult successes Hardware (1990) and Dust Devil (1992), director Richard Stanley was given an $8 million dollar budget along with the stars Marlon Brando and Val Kilmer to make his dream project based on the H. G. Wells science fiction novel, The Island of Dr. Moreau (1896). Stanley pre-produced and developed the script for 4 years only to end up getting fired 4 days into the shoot. It's a \"what might have been movie\" in the vein of films like Jodorowsky's Dune (2013) or Lost in La Mancha (2002). The film includes a variety of testimonials from Richard Stanley, the uncredited director, to the executives who really didn't care about the project at all. From the executive point of view, it often seems as though those in control were only looking for excuses to replace the young eccentric Richard Stanley for an older military- esque figure. While John Frankenheimer, Stanley's replacement, whose mission was to discipline the cast and crew into finishing this cursed movie, fit the bill – he did little to save the film. When a creative young director used to work with low budgets is forced to try to direct A starts known for causing problems on set, it's a recipe for disaster, the problems became clear when Val Kilmer, coming straight out of the set of Batman Forever (1995), refused to be directed by a young unknown introvert Richard Stanley. The unhealthy competition on set between Kilmer and Brando buried the project before it even began. The two famously difficult actors became increasingly erratic, weird and demanding as the production continued.One of the reasons for Stanley's dismissal was his inability to \"direct\" the egos, but it seemed no one could. With no compelling reason Richard was laid off in less than a week into the shooting, only to be replaced by the veteran John Frankenheimer who was called in to finish the project as fast as possible. While he was hired for his military discipline, his negative attitude and leniency to Brando's demands only further exacerbated the already troubled shoot. Before production even began Val Kilmer seemed to already be tired of the project. Shortly before the film would move into shooting stage, he demanded a change in casting and to work 40 days less than initially. Brando was actually quite fond of Richard Stanley and it seemed had developed quite a few ideas with the young director in the pre-production stage. Throughout the shooting, it seemed that from one day to the next Brando would approach director Frankenheimer with new and increasingly absurd ideas about the script. While Brando's ideas tread between silly and genius, it was quickly apparent that he had serious contempt for the production. His ideas were far more suited to Richard Stanley's vision for one, but more notably, through his interaction with other cast members it was as if Brando was working subversively to make a mockery of big budget productions. While notoriously difficult, many spoke fondly of Brando. He only truly clashed with Val Kilmer, and was good natured if not self-involved. From all the subjects that appear in the film, the person that brings more inspiration to the film and the views on Stanley's ways is the actress Fairuza Balk, who played the role of Dr. Moreau's daughter. She was not impressed with the director that was brought in to replace Stanley, according to Fairuza the director John Frankenheimer was mean, rude, constantly bad-mouthing the Australian crew. He would insult and scream his orders to the cast and crew with a military-esque tone that made everyone uncomfortable, \"Things did not become \"normal\" with Stanley out of the picture, if anything, they got much weirder.\" – states Fairuza Balk defending that Stanley's inexperience wasn't the problem, the problems came from above, from where the money comes from. As the film develops it becomes increasingly apparent that the New Line Cinema executives weren't particularly interested in making the movie in the first place, but when A list stars like Brando and Kilmer got attached to the project the sole objective was to push a film into a can with the $8 Million dollars they invested. Stanley's vision became secondary and the need of a leader who would discipline the cast and crew on forcing a film to get done turned a project with so much conceptual potential, creative and intellectual investment brought by Stanley into a weak, passionless mess that lacks direction, mood and an aesthetic core. As much as the film is about this unique example of a particular film's fate, it becomes emblematic for the true motives of the Hollywood machine. While I personally have quite a fondness for the much maligned film, The Island of Dr. Moreau, the documentary nonetheless offers important insight into the troubled production. The documentary does lack the points of view of Val Kilmer though, who was universally viewed as one of the main reason for the film's failure. Input from James Woods, who was cast and let go in favor of bigger stars would also have been interesting. The film lacks the passion of Jodorowsky's Dune, in particular the absence of strong emotional threads. In the end, we are left with a big drama and a big failure, but the true sense of what was lost in the process is never quite clear enough. Be sure to check out my interview with David Gregory where we talk about what inspired his documentary film and his own opinions on the final version of the Island of Dr. Moreau, the industry Richard Stanley's last documentary film The Otherworld (2013) and Stanley's love for witchcraft and supernatural themes.",
         "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau (2014) **** (out of 4) If you watch enough movies, eventually you're going to see something that takes you by complete surprise. You can hear about how bad or crazy a movie is but there are certain examples that just stick in your mind because once you've seen the movie in question you realize that you really have seen something that's so bad that you have to sit there for days if not weeks wondering how it went so wrong. That happened to me in 1996 when I walked out of THE ISLAND OF DR. MOREAU. Being a major Marlon Brando fan, it was a thrill getting to see him on the big screen but what was on that screen went down in infamy and here's a documentary explaining the craziness. Director David Gregory is one of the best people out there when it comes to making DVD/Blu-ray shorts so throwing him into the feature world is something great for movie fans. This documentary is so perfectly done that it plays just like a real drama, a tragedy and then finally a hilarious comedy. We start off hearing from Richard Stanley who talks about his original ideas for the film and we see that he clearly has a great vision for the story. Then, we see that there's something off when he begins to talk about calling on witch doctor's to \"help\" the film. From here we learn just about every bit of the production details from how the film was originally meant to be made for $8 million but then Brando came on board, which had the budget go higher so then they needed a star so Val Kilmer was brought on and soon the original director was gone and replaced by maverick John Frankenheimer. LOST SOUL: THE DOOMED JOURNEY OF RICHARD STANLEY'S ISLAND OF DR. MOREAU is without question one of the best documentaries that you're ever going to see when it comes to explaining the behind-the-scenes of a troubled production. However, to be fair, this here wasn't just a troubled production because you're going to learn that the entire thing seemed to be cursed and you can't help but wonder why the entire film wasn't dropped early in the production but then you learn that perhaps someone just wanted to see how crazy it could get. Things turn even worse when you hear that even Brando and Kilmer wanted the production to fail and some of the stories are just downright crazy. There are so many wild and crazy stories told about the production of this movie by the time it's over you can easily see why the actual movie turned out so bad. There are way too many highlights in this film so picking out one or two to put the spotlight on is rather hard. Again, being a die-hard Brando fan, finding out what was going on with the white face paint and the ice bucket on his head were hilarious. Hearing about how the fired Stanley managed to get back onto the set and work as an extra was just astounding. What's the best is the fact that so many people came back and were willing to talk about the troubled production and be honest about it. Of course, Brando and Kilmer weren't available but Fairuza Balk is on hand as his New Line's Robert Shaye and of course Stanley plays a big part here. There's also some of the original producers to discuss the problems and the honesty of everyone involved is what makes the drama of the film work so well. Of course, as the craziness continues and just gets weirder, the film pretty much turns into a comedy because you have to laugh at everything that was going on. Gregory has once again created a wonderful little gem and one hopes that his talents will see for more feature-length documentaries because he's one of the best out there and LOST SOUL is so great that it actually makes me want to go back and what that train-wreck of a film that was THE ISLAND OF DR. MOREAU.",
         "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau (2014) *** Well documented behind-the-scenes account of the train-wreck of the fruition to making of the 1996 remake of THE ISLAND OF DR. MOREAU shows how visionary filmmaker Richard Stanley's brainchild becomes a template in all-that-can-go-wrong-will-go-wrong fiasco of a Hollywood movie with the machinations, egos, failures and ineptitude glommed together as a fable of be careful what you wish for in having a dream project dashed to bits and pretty-much-unrecognizable. While each noteworthy figurehead involved is painted as a villain from crazy Marlon Brando, vainglorious Val Kilmer and bullying filmmaker John Frankenheimer, filmmaker David Gregory also shows how the other flip of the coin - professionalism, partners-in-crime and truth in art - also attempted to counterbalance the toxicity and dark comic failure of an epic flop.",
         "Behind the scenes chronicle of how clash of vision, bad creative decisions, lack of interest and really bad weather plagued the disastrous production of the infamous 1996 remake of \"The Island of Dr. Moreau\". This film is great because it not just talks about the film, but also the career of Richard Stanley and how it went off the rails. Following genre cult classics like \"Hardware\" and \"Dust Devil\", Stanley could have been the biggest thing in horror. However, because of his experience here, he has done relatively little in the last twenty years. I love that they have Tim Sullivan commenting on the \"identity crisis\" of New Line. Sullivan is not credited, so how much he was on set I do not know. But having talked to him myself in the past, he is extremely knowledgeable. From the vantage of a production assistant, he saw a lot of great movies get made before making his own. Fairuza Balk is nice to have here. Her career went downhill after the 1990s, though not necessarily because of this film. It would be nice to see her make a comeback. David Hudson, the Buffalo Man, offers a nice point of view from the natives. And, of course, we find that Val Kilmer is a total diva. Fortunately, his career has taken a complete dive and he is now seen largely as a joke. Unfortunately, if he was wise, he invested his earnings and never has to work again.",
         "Maybe one of the things I'm missing, are sound bits from a few more players (actors), like Ron Pearlman, who also was in the original movie. You were expecting Val Kilmer not to take part in this (although he was asked of course). But those things are not really that important, especially considering how great the movie is built and edited. The mayhem that ensued seems to have been inevitable in some sense, but is still very gripping. There is faults on more than one set of shoulders and maybe the other movie might not have been a better \"Island of Dr. Mureau\" movie than the one we finally got. But it most definitely would have been crazier (yes it's possible) and might have given a very creative guy some power to fulfill his other visions. A man suffice to say that sort of was not ready for that big a project of course. And this duality and all the gray areas (plus all those great anecdotes, hoping there will be a few more on a future disc release without them having to cut anything out of the movie we had the pleasure watching at Frightfest) in the movie, make it great. Fun and light and over before you know it ...",
         "Having been a fan of Jurassic Park and Batman Forever as a kid, The Island of Dr. Moreau (1996) looked, from the TV advertisements, like the next big thing. Look at those creatures! On an island! Starring Val Kilmer and some woman (I assumed) named Marlon Brando! In fact, the film was widely panned and derided when it came out. When I saw it with my younger sister, it was more violent than I expected, a bit of a mess, but I definitely appreciated what it was trying to do. My sister totally disliked it; maybe she had better sense in this case. Lost Soul (a title paying nice homage to the original film, The Island of Lost Souls) is an engaging documentary dedicated to studying how the film went so far off track, and it is more insane than I realized. There's some good brief discussion of the novel and earlier film attempts. Then, to the meat of the picture. I'm not even sure if I would have liked Richard Stanley's original vision; the sketches are exceedingly trippy and the thought of the protagonist getting his genitals bit off during bestiality is so far out there. It's still fascinating to see what went wrong. A lot of it is bizarre- the fact that Stanley went to a witch doctor to make sure he stayed on the film, and the fact that he credited it with working, says it all. You can see the injustice in Stanley finally being fired because it was raining, according to this documentary (I heard it was because of Kilmer), but then, there's definite evidence he had broken down, going by this anecdote that he had climbed a tree and wouldn't come down. It's really striking how many people came onto the project, or stayed on, despite not wanting to be there. The gong show goes on- Kilmer and Brando locking themselves in their trailer and refusing to come out until the other does. One person remarks it would be a huge achievement to finally have a film with a beginning, a middle and an end- they succeeded. I think I would have enjoyed this doc even more if I was in total agreement that The Island of Dr. Moreau sucked- but certainly, the making of it was a trainwreck, too fascinating to look away from.",
         "Director David Gregory has a long history of behind-the-scenes documentary shorts, Lost Soul is more than just a making-of doc that would accompany The Island Of Dr. Moreau disc. Fans of cult director/writer Richard Stanley get a good insight into what makes this fascinating film maker tick. For followers of the novel and film itself Lost Souls also covers the earlier film attempts of H. G. Wells and looks at the books core themes and origin. Gregory offers a captivating documentary with its mix of archival materials and surviving-collaborator testimonies. It wonderfully chronicles how a conflict of vision, creative decisions, lack of interest and awful weather plagued the disastrous production and destroyed friendships with entertaining stories of behind-the- scenes drama including drugs, alcohol and egos. Sadly David Thewlis or Ron Perlman do not participate and it would have been interesting to hear their views. If you enjoyed Jodorowsky's Dune (2013) Lost In La Mancha (2002) basically other \"failed film\" documentaries - this is a must see.",
         "If you're a fan of documentaries about the making of films, have I got a movie for you! I remember going to see the last remake of H.G. Wells' novel, \"The Island of Dr. Moreau\" in the summer of 1996, fairly excited about it- being a fan of the novel and the film adaptation from the 1970's with Burt Lancaster/Michael York, and also excited with Marlon Brando in the title role. This was one of Val Kilmer's first post- \"Batman Forvever\" starring vehicles as well. So I was a bit surprised to see- who, David Thewlis-??- in the lead role of the hero, Val in a supporting role, Brando phoning (literally LOL) in his performance, and OMG- what a god-AWFUL heaping pile of s**t movie!! LOL Now, after seeing this movie, I know why! LOL Director Richard Stanley first made a name for himself having directed the early '90s sci-fi flick, \"Hardware\", and it was a pet project and lifelong dream of his to do a faithful big-screen adaptation of the H.G. Wells novel like me he had been a fan of since he was a kid. As Brando and Kilmer got involved, the project escalated into what would be his first big-budget studio picture, and everything went to hell in a handbasket! I was never sure about all those rumors I heard about Kilmer- but this film confirmed it since he was referred to more than once as a \"prep school bully\". And Brando!- OMG- let's just say he's right up there with his own category of cray-cray! IODM was eventually taken away from Stanley- he was booted off the set, and New Line Studios handed over the reigns to veteran filmmaker, John Frankenheimer, who was always the director I had associated with this movie. He was an \"old school\" director who hadn't had much experience with sci-fi, and didn't really get along with ANY-one in the movie! I read at Wikipedia on Kilmer's last day of shooting he said- \"get that bast**d off my set!\" LOL And you'll see where Mike Myers' inspiration for his character \"Mini Me\" came from- thanks again, Marlon! LMAO Well, for anyone interested in the back-story of this movie, I LOVED LOVED LOVED this doc., and I will say you will too! Now streaming at Netflix....",
         "The appeal of this documentary is hearing how crazy things got during the making of Dr. Moreau. There are some unbelievable stories, many of them pretty humorous, about how out of control people got making this movie. Everyone interview for this documentary agreed that Val Kilmer and Marlon Brando were messing with people, and it sounds like Val did so in a mean spirited way. The stories about Marlon make you wonder more if he was totally deliberate or having some problems with cognition. For anyone interested in the creative process, film making specifically, it's an interesting look at something we usually never get to see. It made me think about how the movie industry invests so much into a film and how a few unprofessional performers can really put a production at risk. Fairuza Balk had the most interesting comments for me, maybe because she was the one person I was familiar with. Thinking back on how wild things got, it's almost surprising the movie wasn't worse than it is.",
         "I heard about this documentary when I was researching for a piece on the original 30s film with Charles Laughton for the WBD crew and forthcoming book. Not particularly relevant but sounded interesting. And indeed it is, funny too and very well put together. Richard Stanley, whose Dust Devil, I enjoyed, came across as a very likeable and charismatic guy with plenty to say about his desire to make the film and the torturous process it turned out to be. I almost want to see the finished film now but the horror stories of Brando and Kilmer are somewhat off putting. Highly recommended for anyone who has seen the finished film or anybody interested in the film process, particularly when the location is in such an inhospitable place and there are so many extras with extravagant costumes/make-up - plus the truly horrendous sounding blokes with over inflated egos.",
         "A behind the scenes chronicle of how clash of vision, bad creative decisions, lack of interest and really bad weather plagued the disastrous production of the infamous The Island of Dr. Moreau (1996). Very well made documentary. Stanley gets the first half hour to describe his part. The more people get on board, the more interesting it gets. Also interesting is that Richard Stanley's name sits in my head, familiar as though he had a great track record as a director. The connection between H.G. Wells and Joseph Conrad merits the description of this as a real life Hollywood 'Heart of Darkness' journey. It should entertain and inform whatever aspect of 'behind the scenes' you like.",
         "LOST SOUL is a documentary exploring the making of an infamous film, namely 1996's THE ISLAND OF DR MOREAU which was begun by cult director Richard Stanley and ended up being completed by Hollywood veteran John Frankenheimer. It feels a little like the behind-the-scenes craziness you see chronicling the relationship of Herzog and Kinski in cinema, for example. Stanley himself is the overriding figure here, extensively interviewed as he talks about his vision for the movie and the chaos that ensued. He's obviously an erudite figure who knows his stuff, which makes the disasters that ensued the more puzzling. I would have preferred more behind-the-scenes footage from the film itself, but the interviews and clips we do see are well assembled. I find it a pity that Ron Perlman and David Thewlis don't feature and aren't made mention of, but the stuff we learn about Brando and Kilmer's behaviour is priceless and Fairuza Balk is a good sport.",
         "A documentary about the making of the abomination known as \"The Island of Dr. Moreau (1996)\". Great stuff about the absolute chaos of production of the movie. From actors with huge egos (Val Kilmer, Marlon Brando) through problematic location and people getting fired, to absolute crazy behavior that is like taken from a mad house movie. If you liked documentaries like \"Lost in La Mancha (2002)\" and \"Hearts of Darkness: A Filmmaker's Apocalypse (1991)\" which tell the story of some crazy movie productions, you're going to love this one. Incidentally, there are quite a few more connections between \"Dr. Moreau\" and \"Apocalypse Now\", which are mentioned in this documentary.",
         "For anyone interested in film making this sounds like it would be a great documentary about how the production process can be an insane, stressful, eventful and horrible experience. The documentary was quite successful in showing what a seemingly horrid experience everyone had making this film once they went into production. The beginning was interesting as we see most of it from Richard Stanley's POV as he writes the film then tries to get it financed. The middle bit starts interesting as they go into production then all the problems start (disastrous weather that stops the shoot, actors that pull out that then get replaced by control-freak actors etc.) Then Stanley loses control of his film and gets fired. Once Stanley is no longer the focus of the documentary it goes a bit off track and becomes quite boring as we get too many clips of Fairuza Balk, extras and unimportant staff such as one of the limo drivers, who all talk way too much about uninteresting things. The doc started to flag at the 45 minute point and after an hour I began to feel a bit bored and drained. Plus in all fairness, compared to production tales from other films that I've read about (e.g. the likes of which you'll find in Lloyd Kaufman's Make Your Own Damn Movie book), this didn't sound that crazy. The biggest issues seemed to be the weather (not very interesting) and Val Kilmer's ego (equally uninteresting). So, sounded like it would be great but turned out to be a bit of a bore."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Severin Films"],
      "summaries": ["A behind the scenes chronicle of how clash of vision, bad creative decisions, lack of interest and really bad weather plagued the disastrous production of the infamous The Island of Dr. Moreau (1996)."],
      "budget": 0
   },
   "movielensId": 134601,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-08-24",
      "dvdReleaseDate": null,
      "directors": ["David Gregory"],
      "runtime": 100,
      "movieId": 134601,
      "title": "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau",
      "mpaa": null,
      "actors": [
         "Richard Stanley",
         "Fairuza Balk",
         "Marco Hofschneider",
         "Kier-La Janisse",
         "Michael Gingold",
         "Graham Humphreys",
         "Edward R. Pressman",
         "Robert Shaye"
      ],
      "imdbMovieId": "3966544",
      "originalTitle": "Lost Soul: The Doomed Journey of Richard Stanley's Island of Dr. Moreau",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["5owpCx-EXlE"],
      "plotSummary": "We’ve heard all the insane rumours and scandals attached to the ill-fated 1996 remake of H.G. Wells’ THE ISLAND OF DR. MOREAU. How director Richard Stanley spent four years developing the project only to be fired after four days of shooting and replaced by John Frankenheimer and how headliner Marlon Brando impacted on that decision. Now for the first time the living key players recount what really happened and why it all went so spectacularly wrong. Stanley spills the juicy beans, stars Fairuza Balk and Rob Morrow give revealing interviews, New Line head Robert Shaye, producers Ed Pressman and Tim Zinnemann chime in and numerous crew from both versions add their reminiscences. David Gregory’s epic documentary is also a veritable encyclopaedia of behind the scenes footage, concept art and storyboards, creature designs, makeup tests and candid photos to illustrate the shocking tale of eccentric artist vs. Hollywood machine.",
      "tmdbMovieId": 279992,
      "avgRating": 3.42308,
      "releaseYear": "2014",
      "numRatings": 39,
      "posterPath": "/75Uz2AM8xR3hYwR8pezwuooyuyC.jpg"
   }
}