{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "new zealand",
            "id": 2658
         },
         {
            "name": "bombay india",
            "id": 4110
         },
         {
            "name": "india",
            "id": 14636
         }
      ],
      "imdb_id": "tt1667838",
      "video": false,
      "title": "I Hate Luv Storys",
      "recommendations": [
         44566,
         37737,
         20364,
         74458,
         237305,
         118051,
         44978,
         84858,
         20294,
         37822,
         84533,
         117784,
         19658,
         185008,
         192097,
         42966,
         14467,
         19663,
         69775,
         14395
      ],
      "backdrop_path": "/cjLc75VoCDvKc8HM1eDuRaOXobs.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jay",
               "gender": 2,
               "credit_id": "52fe45a2c3a36847f80d20c9",
               "name": "Imran Khan",
               "profile_path": "/6h2htOlRbrs4cBX98gz2732tHtS.jpg",
               "id": 85063,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Simran",
               "gender": 1,
               "credit_id": "52fe45a2c3a36847f80d20cd",
               "name": "Sonam Kapoor",
               "profile_path": "/r1izRqcrIugEH54SPcNAL1IUrHx.jpg",
               "id": 85040,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Raaj",
               "gender": 2,
               "credit_id": "52fe45a2c3a36847f80d20dd",
               "name": "Sammir Dattani",
               "profile_path": "/3FxU6Yhf1t2XFBIvUb56iL3FdPl.jpg",
               "id": 124580,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Veer Kapoor",
               "gender": 0,
               "credit_id": "52fe45a2c3a36847f80d20e1",
               "name": "Samir Soni",
               "profile_path": "/77R5FYVhiR7scfLkBO8sWuLXWao.jpg",
               "id": 85473,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Gisselle",
               "gender": 1,
               "credit_id": "5609fe68c3a368681900114d",
               "name": "Bruna Abdullah",
               "profile_path": "/t8TgTZAST3bdbPdHx76XBiv0u2R.jpg",
               "id": 1063125,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Nikhil",
               "gender": 2,
               "credit_id": "59c6eb96c3a36813ed04e0b6",
               "name": "Adam Aseem Tiwari",
               "profile_path": null,
               "id": 124581,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45a2c3a36847f80d20d3",
               "name": "Punit Malhotra",
               "profile_path": null,
               "id": 124579,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a2c3a36847f80d20d9",
               "name": "Punit Malhotra",
               "profile_path": null,
               "id": 124579,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a3c3a36847f80d20eb",
               "name": "Karan Johar",
               "profile_path": "/pFWDjH57HsdkEKM8HT2wlH2Ahcw.jpg",
               "id": 35736,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.591152,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 40777,
      "vote_count": 43,
      "budget": 0,
      "overview": "'I hate luv storys' is the maxim Jay lives by. But as an assistant director to Veer, the most famous romantic filmmaker of Indian Film Industry, Jay has little option but to live with larger than life, glossy, cinematic love on an everyday basis. Things only get worse when he is made to work under the new production designer on the film… Simran, with whom he shares the strangest first encounter! Simran loves luv storys; So much so that even her life has begun to resemble one. With her ideal job and the perfect boyfriend, Raj, she lives a blissful, dreamy life; One that is rudely interrupted by Jay's cynicism. The turmoil's of Jay and Simran's life, is ironically interweaved with the Luv Story that they are working on…",
      "similar": [
         527,
         713,
         87827,
         1903,
         97630,
         42888,
         116,
         244267,
         544,
         289,
         194,
         1278,
         783,
         4538,
         222936,
         334543,
         167073,
         87,
         59962,
         700
      ],
      "original_title": "आई हेट लव स्टोरी",
      "runtime": 129,
      "poster_path": "/jMlSUeYk2aoLbNcvAYiJcE4bQaS.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dharma Productions",
            "id": 19146,
            "origin_country": ""
         },
         {
            "logo_path": "/oCp4hIEjxEOfVfAuyVyKeRsPrlF.png",
            "name": "UTV Motion Pictures",
            "id": 2320,
            "origin_country": ""
         }
      ],
      "release_date": "2010-06-30",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Punit Malhotra"],
      "runtime": 129,
      "synopsis": null,
      "writers": ["Punit Malhotra"],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt1667838/",
      "coverLink": null,
      "actors": [
         "Imran Khan",
         "Sonam Kapoor",
         "Sammir Dattani"
      ],
      "reviews": [
         "Brace yourself for one of the biggest Bollywood chick-flicks in recent history. Although I seriously doubt how many chicks will really like this movie!!! First of all, I'm not sure if this movie was intended to be a parody of all the classic Bollywood love stories or that is just wanted to use the clichés for the entertainment factor. I cannot understand that when the lead pair is good looking young and reasonably talented, why would the director not put more effort into making an original love story? We have been subjected to Hollywood rip offs for so long.....but seriously Mr Director, Bollywood rip offs are in no way better!!! For heavens sake, let the classics remain classics. With the exception of the opening scenes of the film which revive memories of some of the hit love stories of the past (DDLJ, Dil Kehta Hai and Hum Tum), I didn't see the point of making any further reference to past movies. The director has tried to humorously incorporate all the clichés of the great Bollywood love stories and tried to give it a modern twist (as in Om Shanti Om)......but unfortunately, there is nothing new or \"different\" about this movie. It just didn't work. Sonam is as cute as a button. She is surely one of the most beautiful actresses we have in our industry today. Her character however is silly and superficial. Imran is cool and can easily pass of for the playboy types but he seriously needs to learn how to emote. He does well in the scenes where he is supposed to be cool and funny but when the time comes for him to profess his love, he might as well be talking to a wall! I hope he takes some tips from his famous \"maamu\". I wish I could say that I loved the chemistry between the lead pair....but I would be lying through my teeth. And please, what was with Soman's loser BF always color coordinating his clothes with her?? Is that supposed to indicate the depth of love or something?? The trait of a good director is to put his/her point across without being ridiculous in the process! The reason I gave this movie 5 stars (I am being extremely generous here) is because I think both Sonam and Imran look great and have the potential to be good actors, some of the humorous dialogues were original, the music of the film is hummable, Imran's fat friend was funny at times and the cinematography was generally good.",
         "...then don't bother. First, the actors. Sonam Kapoor has the IQ of a paper bag. And that's when I'm drunk enough not to notice. It's so bad it actually shows anytime she's not flashing her perfect whites. First day in acting school: Don't make it look like you're acting. Looks like someone was absent. Imran Khan showed great promise in Jaane tu... Here he's a clichéd wannabe. The jokes are forced and everything else seems artificial. What the fungus, dude? Second, the premise. Confused Boy + Girl. Confused Girl + Boy. And every single love story platitude thrown in the middle. That with the grating self promotional music everywhere. We get it, Mr. Johar, you're a fan. Of yourself. Third, the bulls***. Do you really meet on strategically placed rocks every time you need to have a serious relationship talk? And Raj, are you FRIGGIN' BLIND? Also, why are beautiful women (read:Giselle) so irritating? Is there a law? I'm a little sad that the quality of Indian Cinema has dropped to this level. I wish they'd start putting in a little more intelligence in their movies over simple polish. Would love to sit through a movie that didn't make me want to strangle defenseless rabbits in slow motion. 2 out of 10. 1 for the fat guy with the sexist humour.",
         "Man! This movie was so boring. The best part about it was the trailer. It went downhill from there. For a movie trying to be a spoof on love stories, it bombed by stating how much it hates luv stories ... constantly! It just drags, the film should have been half its size. The main problem is that nothing happens! They keep repeating the same point over and over again. Also there was no real chemistry between the lead pair. There were a few funny dialogues but not enough to save the film. Imran Khan delivers his dialogues really well (except for a couple of scenes where I thought he actually wanted to laugh). Sonam should hang up her acting hat. She wouldn't know how to say a sentence with emotion if it came and bit her in the you know where. Best advice: stay at home. watch it when it comes on TV, so that you can change the channel, when you see Imran doing the same thing for the 237th time.",
         "To begin with I would like to mention all the young and energetic names associated with this movie. First of its reputed banner of Karan Johar, who himself is known as a Master of Love Stories. Secondly, it is directed by a debutant young director, Punit Malhotra, who is the nephew of famous fashion designer Manish Malhotra. And then it has the two most energetic & talented names, Imran Khan & Sonam Kapoor who look adorable as a couple on the screen. So obviously, one is forced to expect something new, fresh and novel in terms of content from a talented ensemble like this. But shockingly, what is served is neither something new nor it has any kind of fresh or innovative treatment given by the director to captivate his audience. Very unexpectedly the film is as predictable as the night coming after the day. In straight words, the only USP of the movie is its fresh paring of the lead actors and thats it. Before the intermission, the proceedings are cute and the sequences are fine but you simply keep watching them only because you are expecting something new to unfold on the screen any moment. But nothing happens of that sort and post interval the film moves on to the same ages old path of realizing the mistakes and returning to the lady love as usual. However the director does throw few funny one liner dialogues and some comic sequences to give you the much required relief at regular intervals. But that's really not enough for the hungry viewers who were expecting a lot from this big movie. Talking about the storyline, you can easily guess it by only looking at its various posters for a while. The plot of hatred (within a young couple working together) getting converted into love is known to the Indian Viewers as Rice in their daily meals. Interestingly, both Imran Khan and Sonam Kapoor have only few releases to their credits till now and they are also known for their extremely choosy nature and rejection of scripts after their recent flops. But I simply couldn't understand that out of all the scripts being offered to them, why did they choose this particular one, which was only a rehashed version of many other HIT Love stories of the past and had nothing of its own as original. May be the director also convinced his producers on the basis of some new kind of treatment he had in mind for the over-used plot. But unfortunately, the fresh treatment is not visible on the screen in any frame and he completely misses the big opportunity given to him by the makers. Coming to the other aspects of the film, it no doubt excels in its technical departments namely in its Styling, Cinematography, Production Values and the Soundtrack. But sadly, everything else takes a back seat if you have nothing to offer as far as the main content of the movie goes. Imran Khan looks fine in both aspects of his character but again why did he agree to do a role quite similar to the one he had already done in \"Jaane Tu Ya Jaane Na\". Sonam looks amazing on the screen and has a fresh magnetic power in her beauty. She performs well in her role of a Set Designer, but with not a single HIT in her career till now, she got to be extra cautious to choose her future projects after IHLS. Samir Soni, who plays a Bollywood director in the movie (resembling Sanjay Leela Bhansal's persona) is OK. Samir Dattani underplays it well playing Sonam's boyfriend. Aamir Ali as the HERO is impressive but Pooja Ghai as the HEROINE doesn't get enough lines or scenes. Ketaki Dave & Anju Mahendru too have nothing much to do in the screenplay. But out of the entire supporting cast, Bruna Abdullah and Kavin Dave (of \"Sprite Commercial\" fame) truly stand out. In reality, the most enjoyable scenes of the movie are the ones featuring Kavin Dave as Imran's friend. Musically, IHLS holds the merit with few good numbers composed by Vishal-Shekhar, out of which the Title Track is surely the best. The Background score also proves its presence in the movie smartly. Another engaging aspect of IHLS is that throughout its entire screenplay, the characters keep pointing towards some big names in a taunting way. The movie starts with the actual film clipping of the Three Khans and there are continuous references to Sanjay Leela Bhansali and his movies such as \"Saawariya\" & \"Devdas\". May be the writers were following the real life story of Sonam Kapoor and Ranbir Kapoor, who did actually worked as assistant directors to Sanjay Leela Bhansali, at the start of their careers. A particular scene also talks about Aamir Khan and his \"Lagaan\", along with a dialogue pointing towards his forthcoming home production \"Peepli Live\". And there are paintings and dance sequences used in the movie, similar to Karan Johar's \"Kabhi Khushi Kabhie Gham\". But here the strange paradox is that even after sarcastically talking about all the big names and Hit movies in his film, the director Puneet Malhotra, himself comes out with a product which is quite mediocre in execution and content in comparison to all. In other words, a debutant director like him should have essentially worked on his own project first to prove his caliber, before making mockery of some reputed names of the Industry. To sum up, if you can appreciate love stories made with the same seen before familiar moves and if you really rate the star-cast more important than the movie itself, then you may like IHLS. But for me it's a project which had some great potential only before its release. Sharing a common theme with the 2009 release \"I Hate Valentine's Day\", it comprises of only one visual treat and that's Sonam Kapoor alone.",
         "The title plays up on how unbelievable love stories can get, and despite its ripping apart the classical romantic films by Dharma Productions and Yash Raj films in the opening, and throughout the film, ultimately this one proves to be quite hypocritical in a sense that it too cannot come to grips with its battle against cliché, and falls prey to the tried, tested and tired formula of a romantic comedy. As the saying goes, if you can't beat them, join them. However it has its youthful, eye candy cast added to its advantage as it plods through its rather meandering and cumbersome plot, involving J (Imran Khan), a production assistant who has worked on countless of romantic films by hotshot director Veer Kapoor (Samir Soni), and Simran (Sonam Kapoor), who is employed under the same production umbrella. To J, work means a constant rolling of the eyes because he just doesn't subscribe to nor see the appeal of formulaic romantic movies, even if his employer is the best in the business. And for Simran it's just the reverse, feeling privileged to be part of movie magic, as she expounds her own blissfully perfect relationship with fiancé Raj (Sammir Dattani). So begins the clash of the believer and the non-believer, made worst when J is ordered to be working under Simran who is the new art director for Veer's upcoming love saga, Pyar Pyar Pyar, which I have to admit that writer-director Punit Malhotra managed to weave in a film in production within a film, that drew nice touches of parallels between J and Simran's developing love affair, until the final act which somehow had to conform to hammed up clichés. On one hand, I thought it was quite brilliant to get the audience engaged through two levels, one which is the reality the characters live in, and the other the ultra-hyped film reality which exists in Pyar Pyar Pyar, with extremely over the top performances and delivery used to elicit plenty of laughter, especially from fans of Bollywood romances. We'd expect the usual clash of the opposites, where J the non-committal playboy unwittingly turns on his charm on the on-the-way-to-blissful-marriage Simran, who by the time the interval rolled by, is at odds with wanting to settle down with the man she thought will provide that level of stability through routine, or someone who's more of the livewire even if you started out hating the guts of the person? The story seems to play on the theme of close proximity having that big a role to play in demolishing stability, and like all nicely crafted clichés which you can see coming from a mile away, J and Simran inevitably fall in love, which takes one of them by surprise, leading to plot development reserved for after the interval. If not for the young film starlets as the leads, it'll be quite hard to imagine how love can make them do silly things, with plenty of assumptions drawn up that the characters inevitably fall for. Nothing new gets added to the flavour of the story, and while it doesn't stand out, it also doesn't fall flat on its face as well, making this a simple, breezy romantic tale to sit through. Imran Khan pulls through his J quite effortlessly, since I suppose the easy-going, good natured guy is almost always easier to play as opposed to Sonam Kapoor's emotional Simran, who has ample opportunity to show her acting chops in what's only her third major role in her film career, compared to contemporary peers such as Ranbir Kapoor, or even Deepika Padukone. Perhaps the only thread of interest here to sustain your attention will be the numerous film references from dialogues to sets and even downright spoofs, or if you're the incurable romantic, then yes, this film will be right up your alley.",
         "'I hate luv story' seems like to make an attempt to make a cool film but it fails certainly. It has the same old story with no exceptions. A boring story can sometimes be compensated by good performances but it is not the case with IHLS. I was waiting for the film but it disappointed me. Some scenes specially seems like to be shot in a hurry. Scenes where Imran proposes Sonal were executed badly. Dialogue delivery was below average. Direction was average. I think Imran took it more casually as he can do better for sure. Sonal's acting was OK. With all these negative points, there were a few good comic dialogs and some good songs. That is it. Overall an average flick. I can say I hate I hate love stories.",
         "i hate luv storys is an amazing film in its own right...it is a special film not because its something new or untold of..but because of its treatment of the age old clichés.. to start with..imran khan hasn't looked this good in a film since a longgg time...sonam kapoor as always is a beholder's delight...and the rest of the crew looks good too....the new director impresses..so does the music by vishal-shekhar... this is a quintessential love story which would make you nostalgic and at the end of it you would wish if only there was more... a nice simple romantic film...which is thoroughly enjoyable..its pleasant to watch amidst all the humdrum.... for me this film roxxx...a simple movie like this now n then doesn't hurt...in fact i love to burn the midnight oil for films like these.. a perfect 10/10",
         "I was obliged to see this movie by my class-mates who kept importuning me for not accompanying them for the films. I normally try to evade them as their main interest is the masala Hindi flicks, devoid of credible acting, teemed with amateurish clichés and ostentatious drama and completed with a happy ending. This film highlights the tumultuous love 'saga' (as they mentioned) of Simran and Jay. Their relationship is equated into Jay's and then Simran's rejection with the other. By the time love pervades, the movie becomes drab and over-long. The main concern of this train-wreck is the impertinent appendages made by the script-writer to generate laughter, which includes the character of the director to go bananas whenever he converses with Jay and only because he is a director and has to emote. Bottom-line -He ain't that funny! Another irrelevant inclusion is the screen-time provided to Aamir Ali, who can decimate robots, a cryonically frozen primeval being, a senile turtle and a meditating ascetic in terms of facial contortions and expressions. In the first interaction with Jay, he comes across as an egotistical and cocky actor who personifies self-importance. He is constantly lulling after chicks and asks Jay whether there were any hot ones on the set. In the next shot, he is play-acting a scene where he is supposed to be comforting his lover, who's evidently on the death-bed. His countenance is so inexpressive and inflexible, I wonder why such an acclaimed director ( as the director in the movie proclaims) would cast such a weak lead. At least the lady who plays the actress seems more actressy. Then, towards the end, he talks to Imran about his butt and to wear tight jeans to attract ladies. I could palpably see why the director wanted to include that scene. Dostana made people laugh (I was bored though) and gay references are a fad now. So, in the end when Jay cheekily tells him that he has a great butt in front of girls, he feels abashed and the girls distance themselves from him. But the scenes are so desperately seeking better comic-timing and cheesy giggles that it all falls flat. Please, promote anyone but Aamir Ali, because he seems to be the posterity of the Grand Old Oak trees. Another bad apple was Sameer Soni as the whimsical director who made one commercial hit after another. He seems to be raising colonies of red forest ants in his pants as he keeps shouting at all times. But in the end, he somehow manages to influence Imran Khan (everyone who seems bad acts good towards the end to raise the actor's spirit and make him fall in love). But I think I have seen such characters before. A sour mango was Sonam, who in the process of looking beautiful, has exfoliated all the layers of acting and emotions. Now, she seems to be a mordant beauty-queen who simple has to faces- a happy one and a bitter one. She is supposed to be addicted to love stories and feels that she is living in a dreamily lovable world where everything is right but realizes that its not and falls for the right wrong guy in the end. But, like most other actresses in modern Bollywood, she seems to have foregone the depth that she could have added to her performance. She looks tangy in one scene, then sweet in the other, then tangy, then again sweet and so on. Its like watching a cycle ride a uniformly bumpy path where the bumps are equally distanced from one another. Imran too hasn't proved much in the film except that he is now completely a commercial actor (i.e, one that inexorably has to look buffed and beefy, sprouting a body-builder physique and having shallow acting skills or at least pretending to have one). He horribly emoted in the sad scenes, not even trying hard to show his love. HE tells Sonam \"I don't know how but I have fallen in love with you\" or something like that but in the end is left heart-broken. Well, even Rosie O'Donnell would have refused the offer because he recites those lines devoid of any realization. Another thing I noticed was the increasing emulation of Aamir Khan in the film that he tries to do, but falters miserably. He raises his eye-brows unnecessarily and talks more like the former. A few words of advice: \"Do not become Harman Baweja\". Then there is the protuberant friend of Jay who plays the same way he does in the countless commercials that he appears in. Another caricature becomes does he alas.... Another thing that bugged me infinitely was the abnormally high usage of voice-over used childishly in the movie. Have nothing to take the story forward - use voice-overs. I advice the director to watch \"Adaptation\" where the voice-over has been adeptly incorporated. The songs seemed uninspired and flaccid, the screenplay riddled with idiosyncrasies and the acting gives a looming feeling of boredom. Jaane Tu was implausible and a bit stupid, but had a few watchable moments but this has none. A commercial clap-trap like this deserves a 2 out of 10.",
         "I don't know why everybody is criticising this movie. This is all in all a typical bollywood romantic comedy. Story is very simple as all other bollywood romantic movies but this the speciality of this movie too. In it director is making a satire on romantic bollywood movies for same story line, plot etc. but in a different way. Cinematography of the movie is fantastic, music is good & catchy, some songs are really very good. Sonam Kapoor is looking very beautiful in the movie & sets are very good looking. Everybody acted well in it. You can really understand this movie if u r in relationship with someone. Even if u r not, u can enjoy it for its fun & entertaining part.............",
         "Its a good time pass movie.. First half is full of comedy but second half starts with Indian Drama... Kavin Dave has acted very well... Sonam Kapoor is OK but in some scenes she looks pretty. There is a lot of comedy in the movie and it is worth watching. I am giving 8/10 because this movie made me laugh.... Don't go after the name... its an Indian movie so it was sure that it would have a happy ending where hero and heroine will fall in love... \"No One Hates Luv Storys\"... They may be jealous :P Here is a review from Rediff: it's Imran and Sonam's collective persona and their free-flowing chemistry that makes all the difference. Although the pair deserve better than an amateurishly written romance to scoop out their terrific potential as a combination. I Hate Luv Storys is, at best, a promising even if imperfect indication of things to come in the direction.",
         "I hated I hate love stories. it was one of the most pathetic romantic comedies ever with a very old storyline and way to much parody-full content and the clichés. seriously this film is not worth your precious time. the characters are not at all sketched out. neither is the director able to portray them. this was the only film which i left. even all the people were saying how horrible and slow and wannabe the film is. well it is a very bad attempt to bring cynicism on screen and the repetition of i hate love stories is annoying Karan Johar should think of better people to write his films and don't torture the audience. u might just still want to see this movie because of its cheesy trailer but seriously go at your own risk Verdict:Don't watch this",
         "Movie sucks big time. The main lead with two caterpillars for eyebrows and effete features, can't act..period. Sonam Kapoor, is paper thin and her acting..thinner than a cellophane. The problem here is two actors whose credentials are questionable and in an industry where nepotism runs wild, are put in a movie to cater to the so called \"bobbysoxers\". But I don't deem the aforementioned sect think,talk or behave the way it is depicted in this movie. Anil Kapoor, is probably the only actor ever to achieve fame in Bollywood and Hollywood. He is even nominated for an EMMY, for his acting in TV Sit-Com. I would say this guy is the \"Al Pacino\" of the Indian Cinema. As they say,the talent skips a generation is true for Sonam Kapoor. The lovers are neither innocent nor the love sublime. The best part of the movie was the theater with the clearly marked...Exit Sign.",
         "I understand the reason as to why there have been negative comments for this movie. However, I could also imagine that all those people who have watched this movie were not expecting much from it and hoped for the best. I first watched the trailer for this movie almost a month ago, and i could not wait for it to be released. The movie certainly didn't disappoint me at all, and i loved it. I can write a lot about how good the movie is and that, but truth is if you enjoy watching romantic comedies, this movie is for you! And if you're one of the people who enjoy the bollywood songs, there are really great songs in this movie too :)",
         "It was a much awaited film and I personally know lot of people who were waiting for its release. The movie had it all to make it a hit - Karan's direction, Imran as hero, Sonam as heroine, few good songs, the media hype before release and some great previews by likes of Taran Adarsh... but, it simply falls flat on its face due to poor execution of an ordinary story. There is lack of depth in the movie across key areas as acting, dialogue delivery, screenplay and direction. I am really confused whether Karan was trying to make a formula film (and failed) or, a different film (and, still failed). I Hate Luv Storys is not even worth spending on its DVD, leave alone spending money on ticket for a show at theatre. The lucky ones who have waited to read a review and plan accordingly should simply wait till a channel like Colours or Sony premiere it on TV as the movie is worth only that.",
         "It's been several months since we've seen anything frothy and fun from Dharma Productions and Karan Johar. Karan attempted achieving cinematic maturity with his \"Kabhi Alvida Na Kehna\" and \"My Name is Khan\", but, frankly, his earlier \"K\" movies were a lot more fun: \"Kuch Kuch Hota Hai\" and \"Kabhie Khushi Kabhi Gham\", mainly because they had Shah Rukh and Kajol in unadulterated romantic mode. Over the past couple of years, Karan Johar has shrewdly mentored new, younger talent, and produced a number of maiden efforts for debutant directors: the charmingly silly \"Dostana\", the pitch-perfect \"Wake Up Sid!\" (\"Wake Up Sid!\" and \"Luck By Chance\" are the BEST debuts in recent Hindi film history), and the slick \"Kurban\". Similarly, \"I Hate Luv Storys\" boasts a freshly minted director, Punit Malhotra, nephew of Manish Malhotra, the designer who has kept Hindi film heroines in sequins and chiffons for over a decade. The new film put me off with its gimmicky misspelled title, but I enjoyed watching Sonam Kapoor in \"Delhi-6\" and Imran Khan in \"Jaane Tu\u0085ya Jaane Na\", so I trooped off to catch it on opening day in North America. For a film whose protagonist claims to be anti-romantic clichés as defined in Hindi masala films, it certainly takes a lot of artistic license with reality of the kind that you and I experience most of the time. Simran, the leading lady, is a movie art director who works for the most successful director of formulaic Hindi blockbuster love stories, while mono-lettered J (for Jayant Dhingra– but that's not hip)—the self-styled \"cool dude\" hero—is an Assistant Director, with aspirations of directing \"real\" cinema real soon but marking time with this job. In a twist I've never seen in my film work, the director of the film within the film dispatches his A.D. to work as props buyer for the art director. Hmmm: usually, it's folks with the demonstrated skills and most appropriate experience or sensibilities that are assigned such jobs. Very rarely—if ever—does one come across such inter-departmental transfers. But I'm quibbling: if this didn't happen, just how would Simran and J get to spend much time with each other, given that they are chalk and cheese and their initial meetings are anything but felicitous? His best attempts at irony are construed by her as abrasiveness: how cute is that! Simran and J spend the rest of the movie making sporadic stabs at playing Art Director and A.D/Props Buyer, whenever they are not surreptitiously sneaking longing looks at each other, which is pretty much ALL the time. Of course, Simran is the ultimate \"girly\" girl and has a perfect fiancé (a drip, actually—throughout the movie he wears shirts that match his girlfriend's clothes) named Raj. If you miss the reference to the 90s hit \"Dilwale Dulhaniya Le Jayenge\", don't worry. Punit Malhotra and his writers will clobber you over the head with the filmi references till you beg for mercy or whimper \"Bachao!\". The film within the film appears to be a pastiche of all the films from the Yashraj and Dharma Productions oeuvre in recent memory. Lines, songs, and entire scenes are lifted, parodied, and cannibalized to emphasize how unoriginal and creatively lazy Hindi films are capable of being, and are, most of the time. There is some deliciously nonsensical business like the prima donna director demanding exactly four drops (no more, no less) of rain falling on his leading lady's dewy cheek. Too-cool-for-school A.D. J rolls his eyes and—to the director's delight—squirts exactly four drops out of a squeeze bottle. The goofy swaggering oversexed hero of the film within the film has all the stereotypical traits of movie leading men, but surprisingly ends up giving J a sound bit of advice. What's lovely is that both of them are tipsy, and we're never sure if the guy has unexpected depth or it was merely the alcohol talking. The shifts between poking derisive fun at Hindi formula films and then ferociously tugging at the heart strings using those same filmi tropes aren't smooth. So one never knows if we're meant to scorn Hindi films for their cliché-ridden story lines, or sympathetically swoon with our young lovers once close proximity and raging hormones do their job. I got the feeling we weren't meant to question the jarring shifts in tone, but just go along for the ride: this is still a Hindi film, yaar, despite its hip pretensions to being otherwise. Sonam Kapoor has an endearing coltish elegance, is long and lithe, wears clothes well, and the camera never tires of caressing her. Likewise, Imran Khan is leading man-lean and has melting cocker spaniel eyes. In the face of such adorability, it would be totally Scrooge-like to find fault with the movie. The film is slick with the lush production values we've come to expect and demand of Yashraj/Dharma Productions fare. The music is decent, and the locations (New Zealand for the songs this time around) are gorgeous. So, ardent lovers of Hindi masala films, you won't be denied your fix!",
         "Simran is the protagonist; I'm cringing already. I did not care for Sanom Kapoor in Aisha, which she dominated to the point of drowning an otherwise sturdy film. Simran has a Punjabi father and a Gujarati mother. She works in Mumbai as a movie art director. She is in love with Raj Dholakia, her fiancé, whom her mother favours. Veer Kapoor, Simran's boss, assigns Jay Dhingra to work in the same department as Simran; friction arises. She's a sentimentalist, he loathes romance. So, how will the love triangle proceed? The project they will be working is on location in New Zealand. Do we ever get there? Jay is a dog, and tries to break up Simran and Raj. That goes on for too long. Jay should have been fired several times over for insubordination. Jay makes Simran laugh, Raj does not. After working together for a while, she invites Jay to have dinner at a restaurant with her and her parents. He turns on the charm, as always. Jay and Simran spend even more time together. Raj tells Simran he's going to Delhi; he hopes his old Simran is present when he comes back. Simran thinks she's fallen in love with Jay, but he's still a dog. She is rather hurt when she catches him with another woman. She tells him her feelings, and he tells her sentimental love is nonsense. She agrees and gets rather depressed. He finds that he misses her smile. She breaks up with Raj. She leaves early for the new project. Jay has a lot of regrets with musical accompaniment. He tries his old stomping grounds to pick up someone, but fails for lack of will. Eventually he goes to the project in New Zealand, and starts seeing Simran again. Oh, this goes on forever. Raj shows up on set as well, just to make things interesting. Jay goes direct to Simran, but she tells him she just cannot go through loving him again. He tries indirect via Giselle, for the jealousy angle. Liked the 'blah, blah, blah' scenes with Raj, Simran, and Giselle. Raj and Simran get married. Raj and her parents are happy, but Simran is not. Ah, too bad. So, how will this resolve? With multiple clichés, of course. ------Scores-------- Cinematography: 10/10 Varies from competent plus to extremely beautiful. Sound: 10/10 No problems. Incidental music is a bit florid, but lovely to the ear. Acting: 3/10 Imran Khan, minus four. Sanom Kapoor, minus three. The movie sinks or swims with these two, given the proportion of screen time spent on them. They are irritating, while not entertaining. Otherwise, dull but competent performances. Screenplay: 4/10 This would have been a nice 20 minute short. The film is low in content, long on making Jay look like an idiot. He completed that task in the first three or four minutes on screen. Continuing to beat the dead horse is not helpful. Raj is made out to be a placeholder punching bag, so the level of romantic tension is always underwater. Musical Numbers: 6/10 First one (I Hate Luv Storys) was OK. Second, Jay making fun of sentimental Indian films, not nearly as good. Third (Simran and Jay spending time together) fine singing, but I missed the dancing. Fourth (Simran and Jay dancing in public) singing good, but short. Fifth (in movie dance and song) was rather nice.....'Lost and Lonely' was beautiful, as was the number where Jay is daydreaming during a shoot beneath the mountains in NZ.",
         "The beginning of the movie is not so bad. Imram Khan character, Jay, does his job of making you believe he dislike love stories and relationship all together. Simran (Sonam Kapoor), her character is the one who into the whole love story thing, her childhood friend is her Mr. Perfect, her parents like him, especially her mom who want her get married. When their character meet for the first time for the movie their working on, first they dislike each other, then Simran fells in love with Jay after she has a fight with her boyfriend and start hanging out with Jay. Jay tell her he doesn't feel the same way, but when Simran stops being friend with Jay, then Jay realize he in love with her. After that the movie becomes very predictable. One of the things that bothered me about this movie was Simran's parents, in the beginning of the movie they're portrayed as important characters, but as the movie gone on they fade into background not contrite much to the plot.",
         "I'll be totally honest here. This film's not at all worth it. It's a clichéd story where the hero doesn't believe in \"love\" and ends up falling in love. Obviously \"aal izz well\" in the end. Same scenes, attempts at showing that this movie's different but ends up being the same, repetitive thing, the direction is fine but predictable. Score is average. Acting is too average. Throughout the movie I was smsing the three people I'd come with to watch the movie, telling them what was going to happen the next minute and how everything would be resolved, and not surprisingly, I turned out to always be right! The typical bollywood-coincidences are irritating. The pretext of \"fate\" to justify all events is just... ENOUGH. Grow up, Bollywood. Love stories are not all that they're shown to be. In India, if you run away one day before marriage, your family kills you. They don't accept you. It's so outrageous. Ends up being the same thing it is. The movie itself brilliantly sums up what my final verdict is... I Hate Love Stories.",
         "The story was clichéd and repetitive, but the only thing that made the difference was Punit's outstanding script and the execution (direction) of it. Whenever the director is also the writer, the film seems to work more, 3 idiots, LAGE RAHO MUNNA BHAI, JAB WE MET, LOVE AAJ KAL, DDLJ, or KUCH KUCH HOTA HAI. Apart from these things, the writer-director PUNIT MALHOTRA shows that he really knows bollywood, and the characterizations of both the main leads were fantastic. The dialogues were witty and sometime touching. However, the story line was fully predictable, but sometimes it doesn't matter whether how new the story is, what matters is if the film touches the right spot, and it does. The film goes right into your heart and stays there for a long time. Points. ACTING 9/10. DIALOGUE 9.5/10. SCREENPLAY 9/10. STORY 5/10. MUSIC 10/10. LYRICS 8/10. Overall, watch this film if you like films that are touching. The film will definitely make space in your heart and will stay with you even after a long time. If you have any thing planned for today, postpone it and go for this one. You will come out with a smile for sure!",
         "The title was attractive.. So was the treatment and the hype.. Both, who love and who hate love stories were excited.. But, we adore love stories, aren't we? So how can anybody possibly hate love stories.. That was supposed to be the main theme of the movie.. But.. things went wrong right from the beginning.. Full of clichés and predictable storyline the whole setup of the movie failed.. Imran a typical Casanova works as an assistant to a director who is famous for making blockbuster love stories.. Incomes Sonam who is an art director for the same movie in which Imran is working.. Imran hates his job and love stories but Sonam lives in fairy world where love stories are made in heaven and she has already got a perfect match for her who is just like a typical love story hero.. As usual they are totally anti towards each other and gradually grow liking and Sonam already being engaged falls for him and he rejects... Then as the time passes Imran finds himself as a changed man and he doesn't enjoys his life as he used to be.. His friends convince him that he has fallen in love but he isn't ready to accept the fact but like all the old stories he gets to know that he is in love with Sonam and after all the tedious drama they meet and live happily ever after! Now, I don't need to say anything on the storyline provided you already have made your opinion after reading the above para.. Then comes the acting.. Imran Khan is as always very consistent.. No actor can act as badly as he does.. Neither he accepts this fact and nor he tries to improve upon.. His dialogue delivery is worse than Bruna Abdullah(yeah, she too is present in this film)and like always he is expression less throughout the movie and dances like a douchebag! Sonam is strictly OK..! Kavin Dave as Imran's friend is the show stealer and takes the lime light in not few but in many scenes.. Samir Dattani is decent.. Aamir Ali is good as an individual but his pairing with Pooja Ghai is irritating.. Samir Soni is OK in some parts and good in some.. The only saving grace if the movie is the music.. Vishal-Shekhar are in top form.. Styling by Manish Malhotra is top notch.. Cinematography is enjoyable too.. The worst part is the direction.. Debutante Punit Malhotra should be backed for trying a different theme but he should be thrashed for failing miserably.. To conclude, I would suggest the movie only to those who have a strong affinity for usual love stories.. Yeah the movie had its few hilarious moments but thats not what you expect from a movie made under Dharma Productions banner..! My Rating: 4/10 Thanks and Regards",
         "Debutant Writer-Director Punit Malhotra's 'I Hate Luv Storys' is a pointless & predictable film, that is clichéd from the word go. Imran Khan stars as a guy who doesn't believe in LOVE. Entry, Sonam Kapoor who's a 'DDLJ' kinda a girl, who gives her heart to the anti-love youngster. Thus follows a series of events, of complications, jealousy and un-wanted emotional melodrama. 'I Hate Luv Storys' is not a bad film, but in fact, a boring film. If the first-hour has it's moments, the second-hour plays a complete spoilsport. The culmination, is the weakest link. It doesn't evoke the emotion, as planned by the screenplay. Punit Malhotra's direction is decent, but his screenplay is a yawn. Ayananka Bose's Photography is striking, capturing the exotic locales of New Zealand with flourish. Editing is average. Vishal-Shekhar's Music is super. In the acting department, Imran Khan suits the part. Sonam Kapoor looks nice, but her performance, is flawed. Sameer Dattani is wasted in an insignificant role. Samir Soni does well as a show-off filmmaker. Aamir Ali gets it right. Bruna Abdullah looks alluring in a brief role. Kavin Dave is first-rate. On the whole, this flick didn't work for me. Watch it if you must!",
         "I have liked KJO's movies in the past..despite all the mush and drama they have always had humor, a certain maturity and even sarcasm. Somehow made it watchable. I sincerely believe that one needs intelligence to even cleverly copy or properly insult someone else s work. This lame and boring movie has no intelligence to do either ; it makes fun of love stories - even going to the extent of saying love stories are clichéd and then repeats the cliché in every possible manner, emulating love stories we have seen a dozen times before. Not just the broad outlines but even the sub-plots are picked from somewhere. Samir Dattani gives a white flower to Sonam every time they meet ( uhhh..subodh from DCH anyone?! ).The background score of KJO's past movies in almost every 3rd scene made me start hating him!! Imran khan should stick to cool and cynical ( he can't emote to save his life) and stop aping his uncle. The female character is the role of a dumb , confused bimbo to the hilt. Why oh why can't directors create humorous , witty female characters who can actually give back sharp comments instead of just raising eyebrows and laughing silly. She consistently maintains her dumb routine even when a nobody subordinate makes fun of her fiancée. Really, despite the fact that all her movies come through her dad's undying efforts sonam kapoor can do better. I am not even going to comment on the other characters , I feel really sorry for them actually.I don't know who the target audience was for the director because the story was juvenile even for teenagers. I am still thinking if there was anything good in the movie - oh yes I didn't really watch the entire movie. !!",
         "Although KJ seemed to have tried very hard to deliver another memorable love story, 'I Hate Luv Storys' fell short of expectations. First half of the story was entertaining and medium funny with occasionally original humor. But just when you were thinking may be, just may be this movie would be any different from the score of other mushy films, the story falls into clichéd and often boring routine and becomes completely predictable. Director could not deliver a good mix of practicality with romance as you would expect. The best part of the movie was the music score. the title song especially was very good. Acting of the cast was OK. Heroin was gorgeous, and even hero was beautiful!The film has KJ's usual colorful and rich sets and all the masala of a bollywood film. If you are the kind who enjoys any bollywood movie for its drama and flair go ahead and watch, you are sure to have at least some fun. Other than the this movie is no gain.",
         "Predictable, Predictable and in the end more Predictable. Another predictable bollywood love story. Boy who does not believe in love. Girl who believes only in love. One more stupid guy who believes in ditching by the leading lady even after several hints. A friend just for funny dialogs. A boss who keeps scolding the boy all the time but he understands his love, he can read it in his eyes. In fact, almost whole crew know his secret love. all trying to help him. waaaaaaaa.... Give us something new ..... some different story ... some different twists... some different characters.... something original... something DIFFERENT.",
         "caught this film last night in NY..Well here comes another boring Hindi film that's filled with clichés and irritating performances.karan johar serves this recycled mills and boon story filled with ridiculous plot holes which ultimately makes it a poor script coupled with hamming performances by the lead actors makes this film a painful watch.imran should immediately get admitted in an acting school and learn nuances of acting.he is a pain to watch.sonam is OK and just goes through the motions.bad and amateurish direction make other love stories look like a classic.avoid it.. my friends cursed me for taking them for this disaster :("
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Dharma Productions",
         "UTV Motion Pictures"
      ],
      "summaries": [
         "Born from a Gujarati mother and a Punjabi father, Mumbai-based Bollywood Art Director, Simran, is in love with her childhood sweetheart, Raj Dholakia, who is also her mother's choice. Then her employer, Veer Kapoor, assigns a slacker-Casanova, Jay Dhingra, to work as her subordinate. Jay turns on his charm - albeit in vain - and almost gets fired. Both eventually patch-up and get engrossed in the making of a movie 'Pyar Pyar Pyar'. During the filming, Simran admits that she has fallen in love with him, and even breaks up with Raj, but Jay rejects her. Heartbroken, she returns to Raj - who welcomes her back, and they are all set to wed. It is then Jay realizes that he may be in love, and wants to meet and apologize to her.",
         "Jay doesn't believe in love Stories, and Simran, is a girl who's in love with the idea of Love itself."
      ],
      "budget": 100000000
   },
   "movielensId": 134781,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2010-06-30",
      "dvdReleaseDate": null,
      "directors": ["Punit Malhotra"],
      "runtime": 129,
      "movieId": 134781,
      "title": "I Hate Luv Storys",
      "mpaa": "",
      "actors": [
         "Imran Khan",
         "Sonam Kapoor",
         "Sammir Dattani",
         "Samir Soni",
         "Bruna Abdullah",
         "Adam Aseem Tiwari"
      ],
      "imdbMovieId": "1667838",
      "originalTitle": "आई हेट लव स्टोरी",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "'I hate luv storys' is the maxim Jay lives by. But as an assistant director to Veer, the most famous romantic filmmaker of Indian Film Industry, Jay has little option but to live with larger than life, glossy, cinematic love on an everyday basis. Things only get worse when he is made to work under the new production designer on the film… Simran, with whom he shares the strangest first encounter! Simran loves luv storys; So much so that even her life has begun to resemble one. With her ideal job and the perfect boyfriend, Raj, she lives a blissful, dreamy life; One that is rudely interrupted by Jay's cynicism. The turmoil's of Jay and Simran's life, is ironically interweaved with the Luv Story that they are working on…",
      "tmdbMovieId": 40777,
      "avgRating": 3.125,
      "releaseYear": "2010",
      "numRatings": 12,
      "posterPath": "/jMlSUeYk2aoLbNcvAYiJcE4bQaS.jpg"
   }
}