{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bride",
            "id": 3582
         },
         {
            "name": "job",
            "id": 8438
         },
         {
            "name": "fashion model",
            "id": 167200
         }
      ],
      "imdb_id": "tt0027395",
      "video": false,
      "title": "The Bride Walks Out",
      "recommendations": [112885],
      "backdrop_path": "/fYc2u92lhY5NWxtG5iTUtHFzxlk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Carolyn Martin",
               "gender": 1,
               "credit_id": "52fe4b1cc3a36847f81f2ee7",
               "name": "Barbara Stanwyck",
               "profile_path": "/yY2CrbaTyKpmmuUeSu57Wsf2aHk.jpg",
               "id": 14974,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Michael Martin",
               "gender": 2,
               "credit_id": "52fe4b1cc3a36847f81f2eeb",
               "name": "Gene Raymond",
               "profile_path": "/7SPUqMrrbCbp71ICO2z71tCArYc.jpg",
               "id": 117419,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Hugh McKenzie",
               "gender": 2,
               "credit_id": "52fe4b1cc3a36847f81f2eef",
               "name": "Robert Young",
               "profile_path": "/yD74ANflpVXQPci4cihAg63BfK7.jpg",
               "id": 14868,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Paul Dodson",
               "gender": 0,
               "credit_id": "52fe4b1cc3a36847f81f2ef3",
               "name": "Ned Sparks",
               "profile_path": "/dfqHwK048tyYrD1LimABtpFx3Ak.jpg",
               "id": 30004,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mattie Dodson",
               "gender": 1,
               "credit_id": "52fe4b1cc3a36847f81f2ef7",
               "name": "Helen Broderick",
               "profile_path": "/rNw6qgrfiEYnQS9XFSZzA3SOdjH.jpg",
               "id": 30185,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Smokie",
               "gender": 2,
               "credit_id": "556caa7892514137ec00001a",
               "name": "Willie Best",
               "profile_path": "/oy9djmDFfzAaeUiNPOfB8JcxE5c.jpg",
               "id": 34185,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mr. McKenzie",
               "gender": 2,
               "credit_id": "556caa86c3a368571a001cba",
               "name": "Robert Warwick",
               "profile_path": "/oECcbKS8LLYxiLpizvKvcSHefte.jpg",
               "id": 33007,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Mr. Donovan",
               "gender": 2,
               "credit_id": "556caa989251414262001a59",
               "name": "Billy Gilbert",
               "profile_path": "/7Kbya2ek3mGShtJBWKouRLi8F2G.jpg",
               "id": 5464,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Field Chief of Alliance Engineering Corp.",
               "gender": 2,
               "credit_id": "556caaa7c3a36859310018b5",
               "name": "Wade Boteler",
               "profile_path": "/A2B8WDQWBZCV1mXerlJvVX0J2hG.jpg",
               "id": 120818,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Mamie - Carolyn's Maid (as Hattie McDaniels)",
               "gender": 1,
               "credit_id": "556caab6c3a3685748001e18",
               "name": "Hattie McDaniel",
               "profile_path": "/y3QtJ1qZD7Ms0IAzRbgOunMp97h.jpg",
               "id": 11498,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b1cc3a36847f81f2efd",
               "name": "Leigh Jason",
               "profile_path": null,
               "id": 1225777,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "556caa48c3a36859310018ae",
               "name": "P.J. Wolfson",
               "profile_path": null,
               "id": 95862,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "556caa52c3a368591c001bc9",
               "name": "Philip G. Epstein",
               "profile_path": null,
               "id": 2666,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "556caa5dc3a36858fd001a9b",
               "name": "Howard Emmett Rogers",
               "profile_path": null,
               "id": 128810,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "573aa620c3a36806b40020ef",
               "name": "Edward Small",
               "profile_path": null,
               "id": 10914,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "573aa6279251415571002132",
               "name": "J. Roy Hunt",
               "profile_path": null,
               "id": 97048,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "573aa648c3a36806b40020f6",
               "name": "Arthur Roberts",
               "profile_path": null,
               "id": 120177,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "573aa64f92514173d7001c27",
               "name": "Van Nest Polglase",
               "profile_path": "/11wRR3ofmyXu33rjhlrwg74zpnJ.jpg",
               "id": 11036,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "573aa657c3a36854fe001b0f",
               "name": "Bernard Newman",
               "profile_path": null,
               "id": 958731,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "573aa661c3a36854fe001b12",
               "name": "Dewey Starkey",
               "profile_path": null,
               "id": 1312997,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.343014,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 112618,
      "vote_count": 5,
      "budget": 0,
      "overview": "Barbara Stanwyck takes top-billing as Carolyn Martin, a fashion model who hastily marries her boyfriend, engineer Michael Martin (Gene Raymond). But part of the marriage arrangement requires that Carolyn quit her $50-per-week modeling job to be a full-time housewife; the couple will instead live on Michael’s $35-per-week job.",
      "similar": [
         712,
         2959,
         400617,
         50124,
         11003,
         24,
         10521,
         11931,
         787,
         8273,
         9522,
         9029,
         1597,
         3933,
         51828,
         37247,
         252838,
         291870,
         9398,
         6557
      ],
      "original_title": "The Bride Walks Out",
      "runtime": 75,
      "poster_path": "/6q4JIbYcGFm5iSjyJINW7WhphR5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/n53F7K9scQWFXYbrCablqLKqJdp.png",
         "name": "RKO Radio Pictures",
         "id": 6,
         "origin_country": "US"
      }],
      "release_date": "1936-07-10",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Leigh Jason"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "P.J. Wolfson",
         "Philip G. Epstein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0027395/",
      "coverLink": null,
      "actors": [
         "Barbara Stanwyck",
         "Gene Raymond",
         "Robert Young"
      ],
      "reviews": [
         "This is kind of a movie version of an I Love Lucy episode - It's the trials & tribulations of a couple, accompanied by their sidekicks, the other married couple. The girls stick together, the guys stick together. Then Robert Young walks in to \"help\", but things get all mixed up. Clever script. Helen Broderick plays the same sarcastic, older but wiser friend that sticks by the young bride when things get tough that she played so many times (Father takes a bride, Smartest Girl in Town, Top Hat) Robert Young is the dashing interloper that really does want to help out, but just makes things worse. Ned Sparks is a riot, always muttering things under his breath, the poor suffering husband with a cigar hanging out the corner of his mouth. This movie makes light of some of those old fashioned sexist ideas,(domestic violence, man/wife roles) so may offend some, but then it was made for a different time. Seems to be a remake of \"Ten Cents a Dance\" from 1931, which also starred B. Stanwyck. I have tried to find the video for sale, have not had luck as of yet.",
         "You would think that with Barbara Stanwyck, Gene Raymond and Robert Young that this would be a top-notch production--after all, at the time, all were top star--especially Stanwyck. However, despite the cast's best efforts, this was a very, very flawed movie--thanks to terrible writing. The problem is that the characters are generally unlikable and often behave in ways that just don't make any sense. And, considering that I love films from this era in Hollywood, it says a lot when I am this critical of \"The Bride Walks Out\". The film begins with Raymond and Stanwyck thinking about marriage. Considering that there is no chemistry at all between them and they spend all their time arguing, when they go off to get married you can't help but wonder why! They seem to have nothing in common plus Raymond seems to live in complete denial about reality. While he goes through jobs right and left and is paid only $35 a week (not much by 1936 standards), he insists that when they marry that she MUST stay home and not work! As for Stanwyck, once she gets married (in the least romantic wedding scene ever filmed), she, too, learns to live in complete denial about reality. Though his paycheck is tiny, they live way outside their means and Stanwyck never mentions that they can't pay their bills--she pretends she's not only paid them off regularly but is putting money in the bank! Why?! Eventually, to bail them out of their financial mess, a rich guy (Young) pays off their debts and gives them money to live in a manner to which they simply should not be accustomed. Why would Young do this? It's obvious he's in love but she never reciprocated and it all makes him seem like a super-sap! Eventually when Raymond discovers Young's generosity, he stomps out--and they file for divorce! Huh?! Since this is a post-Code film, you know that somehow by the end Raymond and Stanwyck will get back together. But considering they both seem like idiots and demonstrate no love towards each other, you wonder why the heck the audience should care--I know I didn't. In addition to the three leads, Ned Sparks and Helen Broderick are their for comic relief. However, for the most part, these two very snappy actors are given amazingly insipid lines and rarely are they particularly comical--when, with decent writing, they should be fun. Oh, and in addition, there are a couple places in the film where the audience is told that a real man beats his wife every now and then! The first time occurs at the marriage license bureau when a cop tells Raymond and Stanwyck to stop arguing and that if he (Raymond) wants to beat her, it's okay with him as long as he waits to do it at home! Later, Stanwyck even suggests that if Raymond was a real man he get mad and slap her! Wow... Overall, this film consists of impossible to believe and irrational characters from start to finish. They often come off as immature, selfish and very annoying. The film looks nice since it's a big studio production and some stars who were quite capable...and makes practically nothing with this! A big wasted opportunity.",
         "This is a very dated story about two people in love, Barbara Stanwyck and Gene Raymond, and their marital problems. Stanwyck plays a model who came from a poor home, and she doesn't want to give up her $50 a week job and live on only Raymond's $35/week salary. He talks her into it anyway, though she screams all the way down the aisle. Soon she finds herself in money trouble and gets involved with a playboy, Robert Young. To ease her financial problems, she works on the sly. The performances are delightful, but it's a slim story and then there's the business of this guy not wanting his wife to work. I normally don't have a problem watching films in the context of their times, but in this case, the husband seemed unreasonable to me. Ned Sparks and Helen Broderick are hilarious. Stanwyck is always fresh and sincere. Gene Raymond is attractive, but I've always failed to see why he was so important to MGM that Mayer forced Jeannette Macdonald to marry him. The film didn't really hold my interest, but Stanwyck is always worth seeing.",
         "Pure romantic comedy that doesn't hit every mark, but is well worth it. If you loved Palm Beach Story, you'll at least like this. Story of fashion-model married to $35/week surveyor, failing to make ends meet. He won't let her work, but she does anyway. She's tempted by rich playboy Robert Young. He's egged on by wife-hating Ned Sparks. Sparks, who delivers every line around a cigar stub, and Billy Gilbert, the repo man, steal every scene they are in. Husband's refusal to see wife's point of view makes him look stupid, which was not the intent. Guess how it turns out? True lovers of this period have to learn to overlook this kind of sexism, I'm afraid.",
         "... in a production that is an OK time passer but is based on entirely archaic ideas on the subject of marriage. If I'm going to watch a film from 1936, I guess I should be prepared to deal with the values of 1936, but this is just too much. Mike Martin (Gene Raymond) is an engineer who basically nags model and long-time girlfriend Carolyn (Barbara Stanwyck) into marrying him. The arguments begin at their quickie civil marriage ceremony and continue as Mike's estimate that $35 a week is enough for them to get by on is incorrect. Plus no wife of his is going to work! It's a Martin tradition. Before this film is over I felt like if it was a Martin tradition to walk a tightrope strung between high rises on your 30th birthday Mike would be up there doing it. He's not exactly a deep thinker. Meanwhile, Carolyn is stuck making Mike's maxims work. Mike gets to live the dream of supporting a wife that doesn't work, but his dream is really a mirage. Carolyn is the one that actually deals with overdue bills and the bill collectors coming to the door threatening repossession. After their furniture is repossessed and is only returned because wealthy friend Hugh McKenzie (Robert Young) pays the amount due - all happening before Mike gets home and thus without his knowledge - Carolyn decides to go to work so their budget will stretch and hide the fact from Mike. When Mike beats Carolyn home one day and discovers the truth, it is actually the knuckle-dragging groom that walks out. All through the film there is the involvement of wealthy Hugh, who loves Carolyn but wants her to be happy whatever she decides. Let me tell you, Robert Young does not play a drunk well at all. In fact he's quite annoying as drunken partying Hugh. But when he plays a sober Hugh he's a stark and pleasant contrast to the Neanderthal Mike. Now this is a 1936 production code era romance, so you know it's going to work itself out in some conventional way already, so I'll just let you watch and find out how that happens. I give this five stars because Barbara Stanwyck makes almost any film watchable, plus there are the hilarious antics of Ned Sparks and Helen Broderick as Paul and Mattie Dodson, friends of the couple who don't seem to like each other at all and can't even remember what town in which they were married. When Carolyn asks them why they get married in the first place they say \"because it was raining\", whatever that means. I would consider this film a take it or leave it proposition.",
         "Although this film was made before the television era, in some ways it resembles an extended episode of a TV sitcom. The main characters are Michael and Carolyn Martin, a young newlywed couple from New York. The plot centres upon the disharmony caused in their marriage by their financial difficulties. Michael is an engineer earning $35 per week. In the Depression era of the thirties this would probably have been regarded by most Americans as a good living wage, but it is not enough to keep Carolyn in the middle-class style to which she has become accustomed. Before her marriage she worked as a model earning $50 per week, but Michael has old-fashioned views about married women working (old-fashioned by today's standards if not those of the thirties) and refuses to let her go out to work. Carolyn, however, is unable to limit her spending (she impulsively buys a dress costing over $40) and soon the couple are in financial difficulties and their furniture is repossessed. An added complication is that Carolyn has a wealthy admirer in the shape of Hugh, the foppish son of a department-store owner. (At least, he is a fop some of the time. His character seems to veer between a drunken playboy and a perfect gentlemen). The film resembles a sitcom in that the humour arises out of the situations in which the characters find themselves rather than from any particularly witty dialogue. As another reviewer has pointed out, the main comic relief is provided by Billy Gilbert as the repo man and Ned Sparks as Michael's colleague Paul, but as Gilbert's party piece seems to be pretending to sneeze (in which he is joined in a duet by Barbara Stanwyck) and Sparks's speciality is talking out of the side of his mouth while holding a cigar firmly clamped between his jaws, I can only think that audiences of the thirties were more easily pleased than those of today would be. The main problem with this film for a modern audience, however, is its outdated social attitudes. The jocular references to wife-beating, for example, do not seem tasteful or funny today. Although the film is fairly sympathetic to Carolyn's desire to work, a woman's job is seen not in terms of a fulfilling career but in terms of a way of providing pocket-money to keep herself in luxuries. There is also a racist joke when Carolyn's maid (about the only role open to black actresses in the thirties) remarks that black men are too idle to support themselves and prefer to live off their wives. The film as a whole seems very dated today. \"Halliwell's Film Guide\" describes it as \"thin\" but \"pleasing\". The first adjective may be apt; the second certainly is not. 4/10",
         "Comparing this film to THE PALM BEACH STORY is an exercise in ignorance. It's OK, but lacking in wit and spark. If anything, it's yet another example of how films of this era shot down women who had hopes of making something of their lives. For that, it is perhaps worth seeing. If you're looking for a sparkling, witty comedy, move on. Fans of Stanwyck will find her at her best, as always...but Gene Reynolds, as always, brings things to a crashing halt. Helen Broderick is at her wise-cracking best, but it's not really good enough to save what is basically a formulaic, Depression-era comedy...one with an all-too-familiar ending. Ho-hum, and all that.",
         "Copyright 9 July 1936 by RKO Radio Pictures, Inc. New York opening at the Radio City Music Hall: 9 July 1936 (ran one week). Australian release (as a \"B\" feature): 7 October 1936. 75 minutes. SYNOPSIS: Working-class couple separate when wife has a yen for clothes and luxuries that husband cannot afford. COMMENT: The film has its moments, thanks to an agreeable cast, fighting their way through a script that is not nearly as amusing or scintillating as it obviously thinks it is, plus some very attractive photography (e.g. the scene in the lightless apartment) - though Miss Stanwyck is not lit all that flatteringly. Willie Best is prominently featured in the credits, though his part has been removed and is now limited to a two-shot of him entering the marriage bureau and a long shot of him in the background of same! Unfortunately, the cast is also saddled with Ned Sparks, whose monotonous cigar-faced delivery of quite ordinary lines makes them seem even slower and less funny. This character just doesn't belong in what was doubtless conceived as a light comedy of manners. Gene Raymond is more animated than usual and Robert Young is very effective as a pestiferous playboy.",
         "Fashion model Barbara Stanwyck is making $50 a week. Aspiring but as-yet-unsuccessful engineer Gene Raymond is only making $25 but wants her to marry him and quit her job and stay at home. Like a dummy, she lets herself be talked into it. Presumably in 1936 some viewers would have been sympathetic to Raymond's insistence that \"No wife of mine is going to work.\" That's not the problem with this movie. The problem is that Raymond's character is pushy and arrogant and we just don't see any sparks between him and Stanwyck that would make us believe that she could find him tolerable, much less irresistible. Anyway, Stanwyck stays home and keeps house, eventually getting behind on the bills to the point where she secretly goes out and starts modeling again. The bills are getting paid now and she can even afford to hire Hattie McDaniel to come in and cook.... But what will happen if Raymond finds out that she's working? Oh my. Solid supporting actors do their best to cheer things up but they don't have much to work with. Ned Sparks and Helen Broderick play the wisecrack-spouting old married couple who hang out with Stanwyck and Raymond. Robert Young is a rich drunken playboy who hangs around trying to help. Unfortunately, the strong cast and decent production values just can't keep this picture moving...it's one of those that seems longer than its 81 minutes.",
         "New York model Barbara Stanwyck (as Carolyn) marries up-and-coming engineer Gene Raymond (as Michael Martin) and reluctantly gives up her career. The couple agrees to the \"traditional\" marriage, with the woman talking care of the house while the man works. When they are unable to make ends meet, Ms. Stanwyck offers to go back to work, but Mr. Raymond refuses. To complicate matters, Stanwyck arouses the interests of alcoholic department store owner Robert Young (as Hugh McKenzie)... Should Stanwyck try a relationship with the perpetually tipsy Mr. Young or stick with husband Raymond - only time will tell\u0085 Raymond gets deadpan comic support from Ned Sparks (as Paul Dodson) while Stanwyck converses with his wife Helen Broderick (as Mattie) and \"mammy\"-type maid Hattie McDaniel (as Mamie), who is scripted to foolishly mangle a quote from Abraham Lincoln. Billy Gilbert does his bit as an \"Acme\" furniture man and Charles Lane holds court, but nothing really lifts this comedy. *** The Bride Walks Out (7/10/36) Leigh Jason ~ Barbara Stanwyck, Gene Raymond, Robert Young, Ned Sparks",
         "If you can get passed the far-outdated trappings (newlyweds in separate beds, and a wife who is forced to give up her well-paying job to live on her husband's measly salary), there are some laughs to be had in this charming romantic comedy from RKO. Screenwriters P.J. Wolfson and Philip G. Epstein, working from a story by Howard Emmett Rogers, manage to throw in some funny, sneaky little laugh lines, and the supporting characters add a great deal of bounce, including sidekick Ned Sparks (who talks like a Myna Bird) and Hattie McDaniel(s) as a sassy cook. The bride (Barbara Stanwyck, who never disappoints) does indeed walk out--into the arms of a millionaire!--and the way the plot is resolved is amusing and clever. **1/2 from ****",
         "One of Barbara Stanwyck's lesser efforts, The Bride Walks Out gets in a few jabs about chauvinistic pride but with little velocity behind its screwball intent it never reaches home plate. Mike and Carolyn get hitched and he immediately puts his foot down about her working outside the home. As the bills mount she takes a job on the side to stem the tide of debt collectors but he finds out and the couple split. Miserable without each other they shakily attempt to reconcile. Save for the abrasive Gene Raymond as Mike, Bride fields a decent enough acting squad with Babs, Robert Young as a well heeled interloper and a broad comic support line of Ned Sparks, Helen Broderick, Hattie Mc Daniel and Billy Gilbert. But lightweight director Leigh Jason fails to get cast or tempo out of its lethargy and the Bride Walks Out deserves one itself.",
         "Bride Walks Out, The (1936) ** (out of 4) Disappointing film from RKO has Barbara Stanwyck playing fashion model Carolyn who is courted by a blue collar working man (Gene Raymond). The two are married and he forces her to quit her job as he thinks they can survive on his $35-a-week paycheck but soon she goes to work behind his back and is courted by a rich man (Robert Young) who is in love with her. THE BRIDE WALKS OUT starts off pretty flat and just continues to go downhill from there. Despite the good cast there's really no life in this comedy-drama for a number of reasons but the biggest has to be the lack of chemistry between Stanwyck and Raymond. Not for a second did they feel like a real married couple and throughout the movie I had a hard time believing these two people would ever actually be together. Another problem is the screenplay, which for some reason makes the husband out to be the dumbest man I've seen from any Hollywood film of the 1930s. I watch dozens, if not hundreds, of films from this era and for the life of me I was struggling to come up with a dumber male character. The film has a very sexist attitude about it, which goes against many of the roles Stanwyck played throughout the decade but there are several bits of dialogue where it's said that for a man to be \"manly\" that he should hit a woman. Add on more sexist stuff including the fact that he doesn't believe women should work and that he's constantly doing and saying one dumb thing after another, the viewer really can't help but hate the guy and want to see Stanwyck get away from him. The one good thing in the film is the chemistry between Stanwyck and Young but you'll be disappointed in how the screenplay plays this off in the end but what's an even bigger head-scratcher is that it's never really explained why Young becomes such a vital part in her life. Ned Sparks tries to add some comic relief and fails and film buffs will also enjoy seeing Hattie McDaniel and Billy Gilbert in small roles. You can also quickly see Willie Best at a court sequence but he's not given a single line of dialogue. This attractive cast might make fans tune in when the film is shown on TCM but you're bound to be disappointed.",
         "I doubt you'll ever see The Bride Walks Out remade today with the message this film sends for today's woman. In fact the title isn't even factually correct because it's the husband Gene Raymond who walks out. Even at Depression Era values asking a married couple to live on $35.00 a week is a bit much. Barbara Stanwyck and Gene Raymond live on that because Raymond being an old fashioned guy and a bit of fathead insists that the woman be barefoot, in the kitchen and if possible pregnant. God help them if a kid does come along. And with all this somehow they still employ Hattie McDaniel as a maid. Quite frankly if rich department store playboy owner Robert Young were after me, if I were Barbara I'd drop Raymond in a New York minute. She wants to work and today there would be no question but that she would. Ned Sparks and Helen Broderick provide good support and a few laughs as the married couple who are best friends to the leads. Old fashioned to say the least and not in a good way.",
         "While there's a lot of wit in this screenplay about the ups and downs of a marriage almost doomed from the start, there's really little story, and that makes this disappointing in the lists of 1930's screwball comedy. Barbara Stanwyck is a working girl who marries long-time beau Gene Raymond and at his request stops working. He thinks she's making ends meet, but in reality, she's receiving a ton of \"overdue\" bills and threats from the otherwise friendly Billy Gilbert to remove the rented furniture which finally occurs on New Year's Eve and brings the couple's problems to a head thanks to the interference of a drunken millionaire (Robert Young) who really has no purpose here than to provide some romantic misunderstandings in their marriage. There's a lot of witty dialog between Raymond and Stanwyck's bickering next-door-neighbors, the cranky Ned Sparks and the sarcastic Helen Broderick. They provide most of the film's humor, and the funny thing about their long-married characters who pretend to hate each other is that you know that they'd never be able to live without each other. A very funny drunken scene occurs when Young arrives at Stanwyck's furniture-less apartment and proceeds to get himself, Stanwyck, Broderick and the still present Gilbert totally tanked with Gilbert sneezing the entire time and Broderick insisting \"That's one gazuntight you owe me\" every time he tries to sneeze but can't. So while there's a lot to like in this sitcom like entry in the golden age of screwball comedy, there's really a lack of story and structure, even though everybody is on the top of their game. Toss in the always amusing Hattie McDaniel to throw in her two cents as a happy-go-lucky cook, and you've got a recipe for cake which unfortunately didn't rise because it was missing the flour."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["RKO Radio Pictures"],
      "summaries": [
         "Carolyn and Michael fall in love and decide to marry. However, Michael insists that Carolyn quit her job. She immediately realizes that he cannot make financial ends meet on their salary alone, so she gets another job & tries keeping it a secret, from him.",
         "Extremely proud, Michael Martin made fashion model Carolyn quit her job, after their marriage. Carolyn quickly, quietly and secretly did get another job, when she realizes Michael cannot successfully make their financial ends meet, alone."
      ],
      "budget": 289000
   },
   "movielensId": 134740,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-07-10",
      "dvdReleaseDate": null,
      "directors": ["Leigh Jason"],
      "runtime": 75,
      "movieId": 134740,
      "title": "The Bride Walks Out",
      "mpaa": "",
      "actors": [
         "Barbara Stanwyck",
         "Gene Raymond",
         "Robert Young",
         "Ned Sparks",
         "Helen Broderick",
         "Willie Best",
         "Robert Warwick",
         "Billy Gilbert",
         "Wade Boteler",
         "Hattie McDaniel"
      ],
      "imdbMovieId": "0027395",
      "originalTitle": "The Bride Walks Out",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Barbara Stanwyck takes top-billing as Carolyn Martin, a fashion model who hastily marries her boyfriend, engineer Michael Martin (Gene Raymond). But part of the marriage arrangement requires that Carolyn quit her $50-per-week modeling job to be a full-time housewife; the couple will instead live on Michael’s $35-per-week job.",
      "tmdbMovieId": 112618,
      "avgRating": 0,
      "releaseYear": "1936",
      "numRatings": 0,
      "posterPath": "/6q4JIbYcGFm5iSjyJINW7WhphR5.jpg"
   }
}