{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boxer",
            "id": 2792
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0040963",
      "video": false,
      "title": "Whiplash",
      "recommendations": [
         25722,
         28662,
         28666,
         25498,
         25689,
         27034,
         25735
      ],
      "backdrop_path": "/uDSpcy3eFpf6wRBPgeBxT8vfklI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Michael Gordon, aka Mike Angelo",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d689",
               "name": "Dane Clark",
               "profile_path": "/pbVGIAhYjCdvM0eMFfhaWgflKuP.jpg",
               "id": 89524,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Laurie Durant",
               "gender": 1,
               "credit_id": "52fe48f19251416c9109d68d",
               "name": "Alexis Smith",
               "profile_path": "/ngXgviVg4Ysz1soyTYEUrBqC7Ki.jpg",
               "id": 65284,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Rex Durant",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d691",
               "name": "Zachary Scott",
               "profile_path": "/q9Lm9im3Z2gaHZ1hmDmI3TIEN3u.jpg",
               "id": 31551,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Chris Sherwood",
               "gender": 1,
               "credit_id": "52fe48f19251416c9109d695",
               "name": "Eve Arden",
               "profile_path": "/48QTc9iIS3nuJOE8FiAV6qPFPuj.jpg",
               "id": 860,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Dr. Arnold Vincent",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d699",
               "name": "Jeffrey Lynn",
               "profile_path": "/yzQoizit3ro4qoz5fZW0KI4USUz.jpg",
               "id": 90517,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d69d",
               "name": "S.Z. Sakall",
               "profile_path": "/jBp6orDZiX5ay9tyaHQOpcFJAqd.jpg",
               "id": 94110,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Terrance O'Leary",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d6a1",
               "name": "Alan Hale",
               "profile_path": "/7ZTTJ08iSQYBaDvfgfhmGpqCrtx.jpg",
               "id": 8729,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Costello",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d6a5",
               "name": "Douglas Kennedy",
               "profile_path": "/8fCM2tVhpziKRRZ2xY9WGdbBSOB.jpg",
               "id": 95734,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Tex Sanders (as Ransom Sherman)",
               "gender": 0,
               "credit_id": "52fe48f19251416c9109d6a9",
               "name": "Ransom M. Sherman",
               "profile_path": null,
               "id": 585141,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Duke Carney (as Fred Steele)",
               "gender": 0,
               "credit_id": "52fe48f19251416c9109d6ad",
               "name": "Freddie Steele",
               "profile_path": "/nDwu3IppGvKEMx6eZccUX9J4q9x.jpg",
               "id": 85898,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Trask",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d6b1",
               "name": "Robert Lowell",
               "profile_path": "/9Ws1zCGfvfT39CyXfwCCx0JawbS.jpg",
               "id": 139175,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Markus",
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d6b5",
               "name": "Don McGuire",
               "profile_path": "/uCDwCsJDGvpOFFmU9da4ksSMZUn.jpg",
               "id": 58093,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Pianist at Sam's Cafe",
               "gender": 0,
               "credit_id": "54615b2b0e0a2672b3000c80",
               "name": "Jimmie Dodd",
               "profile_path": "/uvtSqV4xNSBBB7qlsvb8sxIopA6.jpg",
               "id": 95968,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Prospective Tenant",
               "gender": 2,
               "credit_id": "54615b7d0e0a2672a3000c53",
               "name": "I. Stanford Jolley",
               "profile_path": "/f52QrybfGyAgm9pH9BnY95MBd7C.jpg",
               "id": 120739,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Kid Magee",
               "gender": 2,
               "credit_id": "54615ba10e0a2672b3000c8f",
               "name": "John Harmon",
               "profile_path": "/mv1UuH2TpPGo4kQm8JEoHjMhgRG.jpg",
               "id": 117771,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Thug Guarding Dr. Vincent",
               "gender": 0,
               "credit_id": "54615bc0c3a3686f3c000bd2",
               "name": "Clifton Young",
               "profile_path": "/3qCgUXh07suIR8ogdeT9S0HcxHI.jpg",
               "id": 95735,
               "order": 16
            },
            {
               "cast_id": 27,
               "character": "Patron at Pelican Club",
               "gender": 1,
               "credit_id": "54615bd4c3a3686f31000c4b",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 17
            },
            {
               "cast_id": 28,
               "character": "Landlady",
               "gender": 1,
               "credit_id": "566820fdc3a36836b400275b",
               "name": "Maudie Prickett",
               "profile_path": null,
               "id": 151503,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d655",
               "name": "Lewis Seiler",
               "profile_path": null,
               "id": 84641,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d65b",
               "name": "Maurice Geraghty",
               "profile_path": null,
               "id": 103925,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe48f19251416c9109d661",
               "name": "Harriet Frank Jr.",
               "profile_path": "/o4qN7ppwS5afvFNef3My9QRNoZC.jpg",
               "id": 46621,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f19251416c9109d667",
               "name": "Gordon Kahn",
               "profile_path": null,
               "id": 117852,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f19251416c9109d66d",
               "name": "Kenneth Earl",
               "profile_path": null,
               "id": 935862,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d673",
               "name": "William Jacobs",
               "profile_path": null,
               "id": 95944,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d679",
               "name": "Franz Waxman",
               "profile_path": null,
               "id": 8619,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d67f",
               "name": "J. Peverell Marley",
               "profile_path": null,
               "id": 98501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe48f19251416c9109d685",
               "name": "Frank Magee",
               "profile_path": null,
               "id": 111418,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.255011,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84365,
      "vote_count": 3,
      "budget": 0,
      "overview": "An artist (Dane Clark) follows a woman (Alexis Smith) from California to New York, where he boxes for her mobster husband (Zachary Scott).",
      "similar": [
         1367,
         1374,
         1246,
         1366,
         70,
         1371,
         1375,
         17487,
         921,
         1578,
         14638,
         17218,
         996,
         680,
         289,
         522,
         599,
         45317,
         426,
         1092
      ],
      "original_title": "Whiplash",
      "runtime": 91,
      "poster_path": "/wsBU9QFvEwuCtqYHMghByjZe8il.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1948-12-24",
      "vote_average": 2.2,
      "belongs_to_collection": null,
      "tagline": "Sure I know you're a two timer!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lewis Seiler"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Maurice Geraghty",
         "Harriet Frank Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0040963/",
      "coverLink": null,
      "actors": [
         "Dane Clark",
         "Alexis Smith",
         "Zachary Scott"
      ],
      "reviews": [
         "Although the main character planed by Dane Clark is the odd combination of artist/boxer, the movie is fairly involving and exciting. As he gets swept up by bad girl Alexis Smith -- and with bad guy Zachary Scott (one of the best in the business)luring him to destruction -- his story has some unpredictable ups and downs. A great cast in a fast-paced tale.",
         "\"Whiplash\" was a routine offering from Warner Brothers in the late forties but routine in those days also meant efficient, entertaining and well worth seeing. It is only when you see films like this one which are sixty years old and in black and white to realise that the equivalent does not exist in cinema any more. Television has taken over this sort of story but still cannot do it as well or cover effectively scenes in boxing arenas or large scale venues in their stories. The Warner Brothers rep company was also a very good one: Davis, Crawford and co were, of course, the front runners at this time, but this cast shows how professional and talented the second string actors were in those days. Dane Clark was never a star but here he gives a highly efficient and convincing performance, carrying the film with ease and confidence. Alexis Smith (cruelly underestimated and underused until her later years) is excellent as the unhappy heroine, married to sadistic Zachary Scott but in love with Clark. She had a much wider range than most people gave her credit for (She was to win a \"Tony\" on Broadway for her performance in Sondheim's \"Follies\") and was always a welcome actress in anything she did. Scott plays one of his usual villains but always played them with style and panache. The divine Eve Arden has a few good scenes but is wasted - and Jeffrey Lynn, usually a somewhat pallid and passive actor, is here very good as Smith's drunken brother who finally resolves the story by his actions. Not a marvellous film, of course, but thoroughly watchable and carefully made.",
         "Shake together John Garfield's roles as a violinist in Humoresque and a prizefighter in Body and Soul (hits of the previous couple of years), and out comes Dane Clark's character in Whiplash. He's a beach bum who daubs canvases in a coastal town near San Francisco. But when reclusive vacationer Alexis Smith buys one of his seascapes, she ignites a torch in him that won't sputter out. When she abruptly departs, he travels east and sets up a studio in New York while he tracks her down. It proves a bad career move. He finds Smith singing in a nightclub, only to discover that she's married to Zachary Scott, its owner and a former middleweight champ now confined to a wheelchair. Scott, sadistic and embittered, lives the fight game vicariously \u0096 through the cohort of ex-boxers who keep his wife in place and through new talent he exploits then drops. In Clark, he sees a contender. Wanting to keep close to Smith (who keeps warning him off), Clark signs up for work on another kind of canvas.... In addition to the always welcome Alexis Smith, the movie boasts good supporting work from Eve Arden, a gal pal with a crush on Clark, and from Jeffrey Lynn, as Smith's alcoholic brother, a doctor working in Scott's gym. Scott himself brings nothing new to the kind of part he found himself typecast in: the effete, insinuating villain. That leaves Clark, who was plainly being groomed as the second-string Garfield but who never left much of an impression on the movies. The direction, by the undistinguished Lewis Seiler, can only be graded adequate; he keeps things moving along but never tries for anything different or offbeat or striking. In this he's matched by a lackluster script (it was the late \u009140s; couldn't the dialogue have been a little more etched?). Nonetheless, Whiplash endures as a routine B-movie, with noirish coloration, that reflects the themes and plot-lines of post-war melodrama.",
         "The thing that surprised me the most about Whiplash is that Warner Brothers actually teamed Alexis Smith and Dane Clark for a film. Smith had a lot of trouble in her career because she was so tell and trouble finding leading men to appear opposite her. And Dane Clark was short, James Cagney and Alan Ladd type short. If you look real carefully he's built up in height somewhat in the scenes where Warner Brothers showed both of them in full figure and those are rare in this film. Clark was Warner Brothers back up for John Garfield and Garfield had left Warner Brothers at this point. Clark was obviously getting the scripts that Garfield had left or maybe had turned down. In Whiplash Clark is a struggling artist who lives in southern California and a traveling Alexis Smith likes his work and they begin a hot and heavy affair. Then she abruptly walks out and Clark is all at sea. He goes east to find her and he does and finds she's married to a wheelchair bound Zachary Scott. Scott was once a promising fighter and if he can't be champion he wants to manage one. When Clark knocks out a middleweight contender, Scott is willing to forget the affair with Smith if he'll fight for him. And Clark proves pretty adept in the ring. Whiplash is the kind of film that would have been far better had the all pervasive Code not been in place. What we're beating around the bush not talking about is impotence. Scott is incapable and he's a nasty creature and Alexis just isn't getting any. The ending is straight out of one of those Thirties type boxing films and I won't elaborate. Let's just say what happened no way should have happened. The players are fine and special mention should go to Eve Arden for simply being Eve Arden and Jeffrey Lynn for playing Smith's alcoholic doctor brother who steps up to the plate at the climax. But Whiplash would have been a better film with a more realistic script and the Code not dictating a lot of pussyfooting around some frank issues.",
         "Good, tough noir with an excellent cast. Watching the film it becomes obvious that it was planned for Joan Crawford so closely does Alexis Smith's character follow the Crawford 40's blueprint. Dane Clark's tortured painter turned boxer was surely likewise designed with John Garfield in mind as it adheres to his screen persona as well. For whatever reason those A-listers either passed or were unavailable and the film moved over to the B unit and this cast. As good as the leads are they were considered up and comers at the time and definitely represented the second string at Warners. Back to the film it is sharply shot with effective use of the shadowy black and white photography. Zachary Scott adds another hissable villain to his vast array, Eve Arden pops up from time to time, once in an outfit that looks like she took the cloth off her kitchen table and fashioned it into an ensemble, to add her special brand of spice to the proceedings and many of Warners stock company, Alan Hale, S.Z. Sakall etc. fill out the cast. While the direction is adequate someone who was more of a stylist, for example Michael Curtiz, could have sharpened some slack edges and made the film really cook. Still as is its certainly worth investing the ninety minutes that it runs.",
         "Florid boxing melodrama from director Lewis Seiler concerns a muscular, moody portrait artist in love with a reluctant band singer from New York City; she's married to a wheelchair-bound boxing manager, and it seems the only way the painter can win her over is by climbing into the ring himself (under the auspices of his new name, \"Mike Angelo\"!). Outrageous script was worked on by four writers (Harriet Frank Jr. and Maurice Geraghty adapted Kenneth Earl's story, which was then reworked by Gordon Kahn). Some of the lines are real howlers, though socialite Eve Arden's cynical asides are right on the money. Good for a few laughs, though several of the supporting players are uneasily cast, none more so than Zachary Scott as the invalid villain (he does everything but twist up his mustache at the corners). Dane Clark fumes and snarls in the lead, spitting out his lines like a rabid dog; one can't imagine him making a living as a boxer--he'd be more persuasive taking bets in a pool-hall. ** from ****",
         "***SPOILERS*** Dean Clark as armature painter and professional boxer Michael Gordon aka Mike Angelo does a pretty good imitation of the actor that he very obviously styled himself after, and was in a number of films together with, the great John Garfield in the 1948 film noir boxing movie \"Whiplash\". The movie \"Whiplash\" is very much like Garfield's \"Body & Soul\" that was released just a year earlier in 1947. Mike gets himself involved with Laurie Durant, Alexis Smith, after she buys one of his paintings that his friend bar owner Sam, S.Z Skall, sold her for $75.00 without his permission. Mike in fact felt that Lourie was suckered into buying his painting but soon discovered from Laurie that he in fact had talent as a painter, which he felt he didn't, which in turn had him fall heads over heels in love with her. It was later when Laurie disappeared from sight that Mike tracked her down all the way from California to New York City and found out that she's a nightclub singer and married to big time mobster and former middleweight boxing contender Rex Durant, Zachary Scott. Durant had lost the use of his legs in a car smash up now wants Mike who proved to him in what a hard puncher he is, by Mike knocking out the fighter he manages Duke Carney played by ex-professional boxer Freddie Steel, to win the middleweight boxing title that his accident preventing Durant from winning in the ring. At first reluctant to enter the ring Mike dubbed as Mike Angelo \"The Battling Artist\" by the local sports writers works his way to the top by knocking out a string of worthy opponents to get a title shot at middleweight crown held by the present middleweight champion Duke Carney! The very person who Mike knocked cold at the start of the movie! During all this Mike finds out that not only is Laurie married to mobster Rex Durant but that Durant had something over her in the circumstances that lead to him losing his legs. It was Laurie's doctor brother Arnold Vincent, Jeffery Lynn, who at Laurie's insistence operated on Rex and ended up blotching the operation! ***SPOILERS*** Exciting and power packed fight sequence, at the start and end of the movie, with Mike who was suffering from a serious brain concussion slugging it out with Carney in the ring with a drunk and barley conscious Dr. Arnold Vincent trying to prevent or stop the fight before Mike, with a solid punch to the head by Carney, ends up dead from a brain hemorrhage! It's at the very end of the film that both Rex Durant and his #1 henchman the brutal Mr. Costello, Douglas Kennedy, get exactly what's coming to them not from Mike but from Dr.Arnold Vincent whom they left for dead when he tried to save Mike's life. In what has to be the most shocking scene in the movie Rex Durant ends up together with his wheelchair smashed to pieces when he loses control of it after the person pushing it, Mr. Costello, gets shot from behind by a dying Arnold Vincent! That wheelchair scene was far better then the one that's always talked about from the film \"Kiss of Death\" that made actor Richard Whitmark literally a star overnight!",
         "Too bad this promising noir with a solid cast and a Warner Bros. pedigree doesn't turn out better. Certainly Dane Clark gives his central role as a painter turned boxer (!) his sweaty best. At the same time, the statuesque Alexis Smith looks like a Greek goddess even if her emoting is on the wispy side, while Eve Arden contributes her usual witty asides. The problem, as I see it, is with a muddled script and lackluster direction (Seiler). There are echoes in this storyline of Humoresque's (1946) tough guy Garfield turned concert violinist. But that film had a coherent screenplay, whereas this one has something to do with love- struck painter Clark getting involved with gangsters (Scott) who turn him into an expert boxer, with a wild card doctor (Lynn) thrown in. Okay, I'm not the brightest bulb on the block, but I had real trouble making sense of all this and I don't think it was my fault. The various threads are hard to untangle. Then too, the narrative fails to make much use of the colorful Zachary Scott, who can make any scene compelling when given the chance. Here, I would say he walks through his role, but given his wheelchair, that's not quite appropriate. In fact, the best scene may be the car striking the wheelchair, which may be the most sudden and realistic collision I've seen. Otherwise, director Seiler unfortunately adds nothing, neither mood nor style. Anyway, the total adds up to a disappointment given the promising cast amidst noir's golden studio era.",
         "Boring boxing melodrama. I don't want to call it a film noir because it doesn't have any film noir style, in my opinion. Dane Clark plays a moody painter who falls in love with a woman (Alexis Smith) who buys one of his paintings. She skips out on him so he follows her to New York, where he discovers she is married to evil cripple Zachary Scott. Then things get weird as Clark decides to become a boxer for Scott. His motivation for this was cloudy, to say the least. He decides to box under the name Mike Angelo (get it -- Michaelangelo -- because he's a painter, you see). From here, a movie with wobbly knees is knocked down for the count. The cast is unimpressive but not terrible. Clark is pretty unlikable in a role tailor-made for John Garfield. Smith is forgettable. Eve Arden is great when she's around, which isn't much. Pretty standard stuff. No surprises."
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Sport"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": ["A struggling artist becomes a New York City prizefighter in an attempt to win the affection of the ring promoter's night club singing sister."],
      "budget": 0
   },
   "movielensId": 134771,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1948-12-24",
      "dvdReleaseDate": null,
      "directors": ["Lewis Seiler"],
      "runtime": 91,
      "movieId": 134771,
      "title": "Whiplash",
      "mpaa": "",
      "actors": [
         "Dane Clark",
         "Alexis Smith",
         "Zachary Scott",
         "Eve Arden",
         "Jeffrey Lynn",
         "S.Z. Sakall",
         "Alan Hale",
         "Douglas Kennedy",
         "Ransom M. Sherman",
         "Freddie Steele",
         "Robert Lowell",
         "Don McGuire",
         "Jimmie Dodd",
         "I. Stanford Jolley",
         "John Harmon",
         "Clifton Young",
         "Bess Flowers",
         "Maudie Prickett"
      ],
      "imdbMovieId": "0040963",
      "originalTitle": "Whiplash",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["jPciNxIc23I"],
      "plotSummary": "An artist (Dane Clark) follows a woman (Alexis Smith) from California to New York, where he boxes for her mobster husband (Zachary Scott).",
      "tmdbMovieId": 84365,
      "avgRating": 1,
      "releaseYear": "1948",
      "numRatings": 1,
      "posterPath": "/wsBU9QFvEwuCtqYHMghByjZe8il.jpg"
   }
}