{
   "tmdb": {
      "original_language": "hi",
      "keywords": [
         {
            "name": "bollywood",
            "id": 10540
         },
         {
            "name": "fall in love",
            "id": 155651
         }
      ],
      "imdb_id": "tt2176013",
      "video": false,
      "title": "Jab Tak Hai Jaan",
      "recommendations": [
         14072,
         41109,
         205022,
         4251,
         8079,
         14395,
         79990,
         84533,
         21297,
         11518,
         277432,
         4254,
         11807,
         185008,
         14134,
         41517,
         10757,
         11854,
         44977,
         13986
      ],
      "backdrop_path": "/gYa9x0FTQfLCQcV64BfpNySG67b.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Major Samar Anand",
               "gender": 2,
               "credit_id": "52fe4b8fc3a368484e18eff1",
               "name": "Shah Rukh Khan",
               "profile_path": "/unfoh4zAiPvnQsHeE2CUgpNOX9u.jpg",
               "id": 35742,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Meera Thapar",
               "gender": 1,
               "credit_id": "52fe4b8fc3a368484e18eff5",
               "name": "Katrina Kaif",
               "profile_path": "/8VWJ6MI8QytWq6khqEfmBg1FcTh.jpg",
               "id": 81869,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Akira Rai",
               "gender": 1,
               "credit_id": "52fe4b8fc3a368484e18eff9",
               "name": "Anushka Sharma",
               "profile_path": "/vFOAxcCmbGVw1Txo10LXgOT6fbI.jpg",
               "id": 81928,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr. Thapar",
               "gender": 2,
               "credit_id": "52fe4b8fc3a368484e18f003",
               "name": "Anupam Kher",
               "profile_path": "/kgU5Ap1Kf9RnicB5DMcXEZqed2f.jpg",
               "id": 6217,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Dr. Zoya Ali Khan",
               "gender": 0,
               "credit_id": "58bbd5cec3a36851cd019732",
               "name": "Bindal Parikh",
               "profile_path": null,
               "id": 1770283,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Frank",
               "gender": 0,
               "credit_id": "58bbd5d9c3a368664d035871",
               "name": "Prerak Patel",
               "profile_path": null,
               "id": 1770284,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Zain",
               "gender": 0,
               "credit_id": "58bbd5ed925141609e034ef3",
               "name": "Sharib Hashmi",
               "profile_path": "/13eafNopklPSBEnVullnW5GIZly.jpg",
               "id": 1326933,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Maria",
               "gender": 0,
               "credit_id": "58bbd5ff925141609e034f09",
               "name": "Jasmine Jardot",
               "profile_path": null,
               "id": 1529821,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Captain Jagdeep Deewan",
               "gender": 0,
               "credit_id": "58bbd616925141609b0360b7",
               "name": "Gireesh Sahedev",
               "profile_path": null,
               "id": 1254401,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Captain Kamal Singh",
               "gender": 0,
               "credit_id": "58bbd622c3a36851cd019775",
               "name": "Amarinder Sodhi",
               "profile_path": null,
               "id": 1770285,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Lieutenant Hari Krishnan",
               "gender": 0,
               "credit_id": "58bbd6329251416073036bf6",
               "name": "Varun Thakur",
               "profile_path": "/64KF7KK4M2AEI1A99mu1ZVm0lNU.jpg",
               "id": 1770286,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Roger",
               "gender": 0,
               "credit_id": "58bbd63ec3a368664d0358c1",
               "name": "Jay Conroy",
               "profile_path": null,
               "id": 1770287,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Imraan",
               "gender": 2,
               "credit_id": "58bbd66b925141609e034f64",
               "name": "Rishi Kapoor",
               "profile_path": "/hgWusd2MB3g8h3N4fe0yEHGZxgk.jpg",
               "id": 35791,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Pooja",
               "gender": 1,
               "credit_id": "58bbd684c3a36851cd0197d5",
               "name": "Neetu Singh",
               "profile_path": "/dWkCWCpFTW45k3hCtrCKBXEdP2c.jpg",
               "id": 88812,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b8fc3a368484e18efff",
               "name": "Yash Chopra",
               "profile_path": "/69iwaoauWMlXGIeOww5ysXqe5Mo.jpg",
               "id": 35770,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b8fc3a368484e18f009",
               "name": "A. R. Rahman",
               "profile_path": "/vRkSrUAI2qyMMtpAAggAcxBJjPC.jpg",
               "id": 5288,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58bbd6abc3a36851cd0197f4",
               "name": "Aditya Chopra",
               "profile_path": "/zEVU7NkHcsZi4gjp2x8GC7pdY6H.jpg",
               "id": 35771,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58bbd6b6925141606b0380f5",
               "name": "Aditya Chopra",
               "profile_path": "/zEVU7NkHcsZi4gjp2x8GC7pdY6H.jpg",
               "id": 35771,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58bbd6bfc3a368668f02e534",
               "name": "Aditya Chopra",
               "profile_path": "/zEVU7NkHcsZi4gjp2x8GC7pdY6H.jpg",
               "id": 35771,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58bbd6cac3a36851cd019815",
               "name": "Devika Bhagat",
               "profile_path": null,
               "id": 231005,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "58bbd6f3925141607703796a",
               "name": "Anil Mehta",
               "profile_path": null,
               "id": 35738,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "58bbd700925141606b038133",
               "name": "Namrata Rao",
               "profile_path": null,
               "id": 1026842,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.99722,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 132316,
      "vote_count": 81,
      "budget": 0,
      "overview": "An ex-army man, leading a double life in London, must choose between his wife and muse.  Jab Tak Hai Jaan movie is a love triangle,and also marks the return of Yash Chopra as a director after eight years.  In Jab Tak Hai Jaan, Shahrukh Khan plays the character of Samar who is an angry, unforgiving, with loads of emotional baggage. His role will span two ages, one in his late twenties as a musician based in London and the other at an older age as an introverted, composed, dutiful army officer in Kashmir.  Katrina as Meera play as a seductress, an unattainable beauty. And Anushka as Akira who is 21 year old and works for Discovery Channel and makes documentaries.",
      "similar": [
         7508,
         12177,
         20453,
         4538,
         87827,
         334543,
         244267,
         38167,
         87,
         700,
         205022,
         11236,
         26428,
         27621,
         26815,
         44425,
         49009,
         21461,
         283589,
         19666
      ],
      "original_title": "Jab Tak Hai Jaan",
      "runtime": 176,
      "poster_path": "/sABBBw0zCSpRpLEOPKtoJtV7zjT.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [{
         "logo_path": "/5WSkzUe6OiyKlpX2hJUghLlWkiU.png",
         "name": "Yash Raj Films",
         "id": 1569,
         "origin_country": "IN"
      }],
      "release_date": "2012-11-13",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Yash Chopra"],
      "runtime": 176,
      "synopsis": "It quite turned out to be driving a skeptical audience to predict the entire plot in the first quarter hour, but several twists and grooves kept them absorbed to the center plot in fine. A typical \"Yash Raj Films\" banner title with four crispy short words and the obvious protagonist Shah Rukh Khan, the swansong of ardent late Yash Raj was drenched in suspense, thrill and sated romance playing hide and seek with the impeccable beauty of Ladakh and London. Akira, Anushka Sharma, a profile photographer journalist in the Discovery was struggling hard to get a footage of Major Samar Anand, Shah Rukh, rescuing her from a false act of drowning. Samar could paint Akira's mind with a hue of his pain in life before edifying her, and left her with the diary of his life's bleak glum past. The movie goes back in time and shows the entire flashback of Samar, a waiter and a young musician, and Meera (Katrina Kaif), an NRI and a high class successful businesswoman. Meera craved to marry a British and was engaged. The NRI caught glimpses of the young musician performing on the streets apart from trading wishes with Lord. Despite promising not to \"cross the line\", she was all swept off her feet by charming Samar juggling fedora, in a dickered deal that he would teach her Punjabi song and she'd guide her to speak flawless English. They fell in love until the eclectic climax hauled at an accident Samar encountered following which Meera took down her chance of getting along him wishing her last. It twisted to the scene when Major Samar defused another bomb without any safety precautions as he haggled his chances of survival with Lord's choice of bringing Meera back to him. Meanwhile the gutsy prevaricating Akira lounging on her part of romance into Major Samar's unrequited love story, pranced up to the military arena in volleyball shorts, to set up her career in the Discovery chronicling the seemingly Sergeant William James; of course falling for the romance hero and getting reciprocated intermittently. Finally a second accident put up a black rose to his ten-year old memory bedding him at the hospital to retrograde amnesia. Meera was summoned; later she revealed she was not married and kept her love ringing through the last decade while Major Samar proved his charisma aplomb in defusing 98 consecutive bombs without security gears. Meera proved her mettle in the first part in helping him recover and later Akira, the pert with her quirks and pizzazz brought him to present day Major whose memory metamorphosed his ability to defuse a bomb inside a train in London. Major Samar took his final bet on life precariously as Meera succumbed to her emotions and gave into her wisdom of love on the spot of bomb diffusal in a white chiffon saree. Both the shift of persona in the characters of Samar and Akira were glaring towards the latter half as the climaxes play the musical chair. A. R. Rahman's music background did not cater for his cliché in most of the scores, neither the Punjabi song suited SRK's chords, but all-in-all, the three-hour long saga gave us superficial medleys of Baazigar, Veer Zaara and traffic-stopping guitarist \"Karan\" and \"Raj\" from the career of the 47-year old romance hero dubbed as a 28-year old in the movie.",
      "writers": [
         "Aditya Chopra",
         "Aditya Chopra"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt2176013/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTUyMzM5OTM5NF5BMl5BanBnXkFtZTcwNTIwMjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Shah Rukh Khan",
         "Katrina Kaif",
         "Anushka Sharma Kohli"
      ],
      "reviews": [
         "Directed by the late Yash Chopra, the film doesn't cease to impress the romantic movie lovers and of course SRK fans. People go in with some expectations of a 'Yash Chopra' type of romance and are not disappointed at all. It begins with a fearless army officer Samar moving all along Kashmir diffusing bombs without tinge of fear in his mind. The story flies in flashback after the audience is well settled for the movie. Shah Rukh Khan handles the role of a strict army officer and jolly youngster so well that it seems hard to believe that both roles are played by the same man. Anushka sharma is bubbly and ' happy-go-lucky girl' who lives life to the fullest breathing every moment of her life happily. Katrina Kaif on other hand is exactly opposite to Anushka. She is a God-lover, believes in goodness,reserved, n filled totally with love. Yashji never lost hold of his directorial touch in the movie. The songs do deserve a thumbs up. Especially the romantic Saans and foot-tapping Ishq shava. Challa makes u groove a bit on your seat. Heer likely to trigger some emotion So for all the romance lovers, JTHJ is a perfect and 'go for it' film.",
         "Amazong plot, great direction and brilliant acting is what that sum up to a good movie. JTHJ had all three of them. Being one of the most anticipated Bollywood movie of the year(SRK's only movie), audiences had high hopes. I doubt any of them would have been disappointed. From the very beginning to the end, it was terrific. Three best thing about this movie were its plot, A. R. Rahman's music and SRK. His acting was brilliant, but that's hardly a surprise. Katrina, after a long time since Namastey London, has given a convincing role. Her chemistry with SRK was great. But even with her relatively small role, I think Anushka Sharma came on top with her acting and unmatched facial expressions. Movie isn't predictable...at all. You'll keep guessing how its going to end and it will surprise you. Its unpredictability is another factor you won't find anybody yawning. Summ- One of the best romantic movie to ever been made. Do NOT miss it. I would give it 11 on10, but that will be a wee bit difficult. Mr. Yash Chopra's last movie is probably his best. RIP Sir!",
         "I have watched so many bollywood movies and I am really a fan of bollywood considering the fact that this is the only film industry in the world which survives well in front of Hollywood. I would like to count Jab Tak Hai Jaan in the series of some of the outstanding bollywood flicks - DDLJ, Swades, Lagaan, KKHH, 3idiots and some recent ones, 'Paan Singh Tomar' to name a few ! Music - After a long time I was surprised to see a bollywood movie taking so much of risk in terms of music and songs. Each and every song has different kind of music that suits to different generations of people I would say. Not to forget, Yash Chopra factor dominates and viewers will feel delighted listening to Saans and Heer plus the experimental numbers like Challa and Ishq Shava. Direction - Hats off to late Yash Chopra. He has done it ! Grand locale, awesome cinematic experience, Amazing display of intense human relations and love. No words for that Legend of Bollywood. Perfect story and script, deep sacrificial love, everything seems perfect ! Acting/Performance - All three casts have done exceptional work. I always look forward to two great actors in current bollywood - Shah Rukh Khan and Aamir Khan. I must say, Shah Rukh Khan has given a splended performance after a long time (DON 2 was a bit near too) since Swades and Chak De. Most impressive part was the performance and role of two leading ladies Katrina Kaif and Anushka Sharma. Here I would like to appreciate the script writer and the director that they gave so much of space to these two actresses along with the leading actor Shah Rukh Khan, which is a rare feat in bollywood movies ! Katrina is damn impressive and Anushka does her part well. Last word for Worldwide viewers - Length of movie. You have to spend almost 3 hours in theater. But this is what bollywood all about ! Overall: Direction - 10, Music - 9, Acting - 10, This is not just a movie but an event in bollywood history !",
         "The film starts off with Yash Chopra's portrait and his own special Jab Tak Hai Jaan poem. And from that moment, you're transported to his magical world to witness his take on love. You see the world from his perspective, and accept anything (whether good or bad) with the most idiotic smile on your face. If you snap out or zone out of that phase, then you probably won't enjoy JTHJ. Otherwise, you're in for the best romantic saga of 2012, where true love is beyond anything, where love defies everything. Yes, even God's will. The premise of Jab Tak Hai Jaan is simple - almost too common. The framework is similar to Yash Chopra's Veer Zaara - start from present, flashback, 2 lovers, separation for a long time.... then the same questions. Why are they not together? Will they end up together? It worked for me in Veer Zaara. And it did here as well. If I were to compare, I'd say that Veer Zaara's story had more ''meat'' - and the reason was more compelling and made a bigger impact there. Jab Tak Hai Jaan's twist will meet with a mixed reaction - you'll either approve of it or think it's highly stupid. It will all come down to how you warm up to Meera's character, and agree or disagree with her ideologies. This is another crucial point which determines whether Jab Tak Hai Jaan will work or not for you. And if it doesn't at the interval, then do walk out because you'd certainly not enjoy the second half or the climax. Jab Tak Hai Jaan works primarily because Yash Chopra manages to make you believe in his vision. As a director, he has that ability to present his storyline in the most innocent, simplistic, convincing way. The film comes with a fair share of blemishes. The pace & length being the major culprits. In that respect, the editing and screenplay should have been tighter. The writing by Aditya Chopra could have been more imaginative The love and passion were present, and how. No one does it better than Yash Chopra. And no one portrays it better than Shah Rukh Khan. Lethal combo. I always use this vague term - but Jab Tak Hai Jaan has so much soul and has its heart in the right place. Picturisation and cinematography deserve full marks. Dialogues were simple for most part - and I liked that. There were a few really deep ones which I absolutely loved. A.R.Rahman's music is apt for the film. It does lack the ''epic'' vibe throughout the film, but then comes the title track at the end, and you're sold. Shah Rukh Khan, as Samar, was flawless. Every single time. You think he's done it all. You think there won't be any novelty in his approach. And yet he comes and blows you away. The intensity he brings in, and the powerful control of emotions he displays is just brilliant. His outburst scene at the church, is more than enough for me, to declare this as my favourite male performance of the year. Katrina Kaif went all out for this role, and it's obvious. Her dancing and attitude in Ishq Dance was out of this world!! I take my hat off to you, Kat. And her pole dancing in the tube, major turn on. This was no doubt her best look yet. Acting wise, Katrina does well. It's a sincere performance with many ups and one down. She messes up her breakdown scene before interval -but that aside, she was natural to the core, and this is something she should be proud of. Anushka Sharma as Akira brings the freshness required to get Samar out of his shell. The chick's energy is infectious - and it's hard not to fall for her character. Her crying scene is one of the most natural ones I've seen so far. Rishi Kapoor & Neetu Singh have a special appearance, but a crucial one. In fact, Pooja (Neetu)'s scene with Meera takes the story forward and those 8 minutes between the four stars were one of the plusses of the film. Rishi is his jolly, flirtatious self, while Neetu has more to play with, and leaves a good impact. Watching Anupam Kher was a delight. In short, I liked it. While not perfect as a whole, there's nothing to hate as such from Jab Tak Hai Jaan. It's a saga. An almost dreamy one. If you're charmed enough by the premise and the characters, then you'll have a good time. This will remain the most special film of 2012 - whether you love it, like it or hate it. Go, celebrate Yash Chopra.",
         "Jab Tak Hai Jaan - In a time dominated by South Indian remakes and illogical stunts comes a movie that is so refreshingly different from those mindless sagas. A movie that connects to that Old World charm and beauty of a special feeling called Love. A movie that will make you feel good about life and gives you hope about love. Though an Love Story on the surface, the movie has its own layers of emotional undercurrent running from its inception till the last frame. And The Great Yash Chopra is not called a LEGEND just like that, he justified his legendary status yet again with a MASTERPIECE. And there is no match for SRK when it comes to intense roles. He excelled in a role tailor made for him only. When MR Bachhan calls his' act as \"THE BEST\" after Swades, who are we to comment on that. Still, I believe this movie will not appeal to all, as not everyone is born with a good taste and we can't help it.",
         "We see Major Samar Anand (Shah Rukh Khan) being the shining star of the Indian Army's bomb disposal unit, clocking almost close to a hundred IED diffusion and doing so in daredevil fashion. Some call him the man without fear, while others coin the term the man who cannot die, because his job is high risk, but he doesn't take the necessary precautions. The routine involves going off for a little quiet time for himself after having stared death in the face, but this time round got rudely interrupted by the vivacious Akira Rai (Anushka Sharma), who is adamant to get a stint with Discovery Channel, and chanced upon Samar's diary of sorts which got left behind. And this natural flashback provided a look into the Major's past before his army career, being a multiple job holder in London in order to make ends meet, from shoveling of snow to the waiting on tables, to being a fishmonger, and busking in the streets. Fate allows him to meet poor little rich girl Meera (Katrina Kaif), and before you know it, their constant interaction to exchange tips in the learning of languages form the basis of their relationship, even though Meera is engaged to a rich scion. I suppose no girl can resist the charms of a man who can serenade at multiple London landmarks, and dance the way SRK does. But here's the catch which I thought was an extremely bold move. Religion comes into play, and this takes on proportions and depth of discussions about how some put religion as priority, having empowerment over their lives, that it could sometimes lead to paralysis of sorts. To save Samar's life, Meera makes a pact with her spiritual father, and I suppose only a bet as big as exchanging one's happiness with the life of another, can bring that prayerful wish to fruition. But this causes bitterness in Samar because how can one do battle with Jesus? It's almost impossible, but if this rivalry of one's heart, toward man and toward god, isn't colossus, then I don't know what is. I suppose what Yash Chopra's story was trying to say, is that without love, or keeping the faith, one's life can get really inward and withdrawn, losing that fun element with all things going really serious, and at times, reckless. Samar goes back to India and fulfills his family lineage of military men, but chooses the riskiest of professions, if only to tempt the higher being at taking his life away, and in such fashion to put a dent in his ex lover's faith. Akira enters the picture, and finds this old fashion love of the previous decade a lot more meaningful than the present throwaway ones that centers around physical love. The second half after the intermission sees the relentless pursuit Akira has for Samar, only for her constant advances to be continuously rejected, because in essence, Samar's heart was locked in on another, and left for dead. As if that wasn't enough - with how Samar has turned into a Meera even without his knowledge, in shutting people out - Yash Chopra has more up his sleeves when he has to put everyone together, forming tremendous tension especially when throwing in one of the oldest plot elements in the book for a romance, albeit too with one too many hospital stays. It's decision time, and you'll find yourself taking sides as to who Samar should eventually end up with, after having emotionally invested an hour with each heroine. Characterization here is top notch in making everyone of them rich and real, that you'll probably see shades of yourself, or people you may know, in one or more of the leading protagonists. Shah Rukh Khan once again shows why he's one of the leading men in Bollywood, with his fine all round performance in being a younger man who is full of zeal, hope and life, with the world ahead of him given his hard work, and yet balancing that out with a more sullen, serious look as the hardened military man with a death wish, nursing a broken heart and resigned to the impossibility of challenging god. Between the two leading ladies, it is difficult to pick who actually had an edge over the other, but if it's a personal choice, I'd give my vote to Anushka Sharma if only for her assured portrayal of a bubbly personality who knows what she wants and is a go getter, being in for a challenge when encountered with emotions she has yet to handle, compared to the more indecisive character that Katrina perfectly portrayed, in what would be a classic Yash Chopra model of the unattainable femme fatale responsible for the total breaking of hearts. Cinematography is great, as you would come to expect from a Yash Raj production, with lush costumes, glossy production and art design, sets and locales being nothing but the best to put you in the mood for love, and love lost or broken. Music by none other than A.R. Rahman also lifts the film into epic greatness, befitting a contemporary love story of our time. If anything, Yash Chopra's parting gift through his films, and this one in particular, is a reminder to keep the faith, that love will come in good time, and to remember to live life, not be afraid of it. A definite must watch backed by all the right reasons.",
         "ROMANCE.. Shahrukh's known for that.. and he has made sure that he will be known forever. One of the Best Romantic movies of all time in Bollywood.. DRAMA.. Who else can be more dramatic than SRK. The story unravels nicely. The movie keeps up with the high expectations of the JTHJ fans.. ACTING.. Srk, Katrina and Anushka, everyone has done a good job. Srk particularly has given a youthful, strong and masculine performance in various portions of the movie.. MUSIC.. A.R Rahman, The Maestro strikes the chord again. Most of the songs will go home with You.. Challa brings back Rabbi Shergill.. DIRECTION.. Very good.. Great Locales.. and one of Yash Chopra's best. The combination of Yash Chopra and Srk has always worked.. and this time it will become one of the highest grosser.. I am an SRK fan.. just like my girl.. so i give 10/10.. Go watch it.. make Your Diwali a Happy Diwali..",
         "Late Yash Chopra's last film leaves the audience with a happy heart.IT marks the marks the return of the ideal old world romance. The film is engaging.It's finally the season of Diwali and eternal love story is really cool..Shahrukh's entry as an army officer Samar is impressive. He looks handsome in this getup. The king is back with a bang, courtesy his lover boy image and he rocks. All the three: Shahrukh, Anushka and Katrina have done justice to their respective roles. The most touching scene is when Kat meets her mom Neetu Kapoor. This scene will definitely bring tears in your eyes.It is sure a masterpiece and typical Yash Chopra movie, with all the love elements in it. Shot in exotic foreign locations, JTHJ gives us a beautiful and larger than life picture. It has great background music. First half despite being interesting could have been better had it not had a long run-time. Katrina's acting is outstanding.",
         "It is a good sweet love story. I personally adore Late Yash sir films. Till interval I was very scared because movie is very slow till interval, almost at the level of boredom. Nothing happens. Just before 15 minutes it takes good pace and suddenly you start enjoying it. Movie runs on a good pace till half an hour before climax. Again it slows down badly before climax. I was unable to understand that if one forgets something which is not very important to survive or any strong reason then why all are very desperate to make him remember. Thank God , climax is good. A very good story but screenplay by Aditya Chopda and Devika Bhagat is not up to mark. It drags so many times. Dialogues by Aditya Chopda , are very good, especially after interval. Performance wise Anushka Sharma is show stopper. Shahrukh Khan is very good in intense emotional scenes as usual. Katrina Kaif is also good. She is very balanced actually. Music by A.R. Rehman is good. One song is very good \"SAANS MEIN TERI SAANS MILE\". It's lyrics is typical of Gulzar Saab one but rest one lacks his mastery. Tune wise this one and another song \"HEER\" is good. After all one time must watch.",
         "Hello.. I watched Jab Tak Hai Jaan.. And I am not at all disappointed after watching this movie.. Brilliant Movie.. Acting was good of all the stars.. But SRK was perfect like as usual.. Unique Love story.. Watch this movie you will fall in love once Again.. Yashji thanks for this movie.. The chemistry between SRK and Katrina was really good. Twists were good in d movie.. Music was excellent.. Direction was good. Perfect Movie to watch with family.. Guys Must watch...",
         "A perfect love story from the duo - Yash Chopra and Shahrukh again after a long time (I hope Veer-Zaara was the last). This movie filled with Love, Romance and enjoyment. Katrina's fans: you must see this :) Storyline: Though there is nothing in this story which you can't imagine while watching it, but little way out of a normal one. Direction: Direction was amazing, hats off! Acting: Shahrukh, Katrina and Anushka acted very well in this movie. A full family entertainment movie, go and watch this on this festive occasion! I would rate 8/10 Dear readers Wish you a very Happy Diwali to you and your family!",
         "Yash Chopra's last cinematic outing left me feeling somewhat conflicted, but I would still recommend it as a watch for any fan of Yashji. First I would like to elucidate the moving and effective parts of the film before I go on to the major critique. Firstly, the performances from all of the actors were at least at par with their previous work, and I thought Shah Rukh, in his role as a Major in the Indian army was one of the best of his career. In addition, the cinematography and the songs in the movie were both enchanting and involving. The story is very compelling and (though a touch filmy) gets the viewer involved in the struggle between the characters very well, a feature that is common to most of Yashji's work in any case. On to the negative aspects. While the story is engaging, the character development is somewhat confusing. We get to see the change in Shahrukh over time from a carefree worker in London to a cold and calculating soldier carefully orchestrated over time, and yet Katrina's character is portrayed in a very nebulous light. She takes her relationship with God very seriously in some areas, but in others it seems to be at the back of her mind if it is there at all. Normally I would attribute this to Kaif's lack of depth in acting ability, but in this case she cannot be entirely to blame as she was at least adequate in the role she was given. The second major problem is that the antagonist, God, is never portrayed (if He could be at all) in a very distinctive light. It would be giving away plot points to say exactly why, but suffice it to say that Chopra did not seem to have the heart to actually portray a fight against God, and so the effort of making him the only true antagonist seems to be halfhearted. Finally, in the final third of the movie, a somewhat shady tactic is used in order to propel the story forward. While I have seen worse devices used in Bollywood films, it did seem like a somewhat cheap ploy to utilize in order to move forward. This does seem to somewhat distance the audience from the actual plight of the characters and further seems to muddy Katrina Kaif's role in the film. Overall, I would not call this a terrible movie by any stretch and certainly a beautiful film to watch, but if there is any lesson to take away from this film (other than for Shahrukh Khan not to go on the streets in London) is to keep it simple and that emotion can only go as far as reality allows it.",
         "Who are familiar with Yash Chopra's movies for them this movie in short is 'Love Redefined'. And turning our eye to SRK who knows as a King Of Romance in this movie is at his best.Katrina is a shy type lady who believes to much in god. Anushka is a fun loving modern age girl who will turn a more mature and serious one at the end. The movie is a portrayal of love,devotion,emotion,faith,trust complications misunderstandings arise in a love relation and how these are resolved. The actors are their best in their character. As yash chopra movie give the viewers the opportunity to see many beautiful places this movie will show the a great view of London and Kashmir. But there is big error which I find is the portrayal of bomb disposals squad. They don't operate like the way it has been showed in the movie. It is the failure of the research team. But apart from this Jab Tak Hai Jaan is an awesome movie to watch and entertain.",
         "If you think that \"LOVE\" is just an unprioritized four-letter fluffy word, then you should most certainly go & watch it. It does have its minor flaws & is a tad lengthy, but at its core is a triumphant tale of romance which leaves an indelible mark in our hearts, & this coming from a guy who generally abhors love stories, but this saga ranks right up there with such classics as 'Titanic' & 'DDLJ'. Shah Rukh Khan, is convincing as the fearless officer in the Bomb Squad as he portrays facial expressions that make the audience think whether he will be able to defuse a bomb or not. His role and character show what the men in the Bomb Squads go through. As always he is good. Directed by the late Yash Chopra,this movie does bring some memories in some scenes, of the previous movies that he Directed – \"Kabhi Kabhie,\" \"Silsila\" and \"Veer Zaara.\" His \"signature\" of mountains and snow falling and romance, is written and can be seen very clearly on the screen and yet this can be considered as not a typical \"Yash Chopra\" movie. The scenes between Shah Rukh Khan and Katina Keif are the ones to watch out for.",
         "Amazong plot, great direction and brilliant acting is what that sum up to a good movie. JTHJ had all three of them. u should have a good movie taste to watch this movie..!!! Being one of the most anticipated Bollywood movie of the year(SRK's only movie), audiences had high hopes. I doubt any of them would have been disappointed. From the very beginning to the end, it was terrific. Three best thing about this movie were its plot, A. R. Rahman's music and SRK. His acting was brilliant, but that's hardly a surprise. Katrina, after a long time since Namastey London, has given a convincing role. Her chemistry with SRK was great. But even with her relatively small role, I think Anushka Sharma came on top with her acting and unmatched facial expressions. Movie isn't predictable...at all. You'll keep guessing how its going to end and it will surprise you. Its unpredictability is another factor you won't find anybody yawning. Summ- One of the best romantic movie to ever been made. Do NOT miss it. I would give it 11 on10, but that will be a wee bit difficult. Mr. Yash Chopra's last movie is probably his best. RIP Sir!",
         "A generation grew up watching Love defined by Yash Chopra's films. The stories evolved with time but the essential magic of Yash Chopra's direction and story telling was timeless. The now Late filmmaker's swan song is a tribute to romance and the genre that pretty much belonged to him only. Even though it may be flawed in its story and screenplay, 'Jab Tak Hai Jaan' is a fitting end to an era of old school romance with all its cheesiness, emotional quotient, drama, melodious music, spectacular scenery, stunning outfits and memorable dialogs. Two female star casts were really good. Akira/Anushka was splendid in her performance, totally a feel good acting ! May be her best performance till date in her small career. Sum- One of the best romantic movie to ever been made. Do NOT miss it. I would give it 11 on10, but that will be a wee bit difficult. Mr. Yash Chopra's last movie is probably his best. RIP Sir!",
         "awesome..First Day First Show.....\"Jab Tak Hain Jaan\"....Srk...rocks....in romancing with katrina kaif....srk rocks in lip kissing with katrina kaif..... 1st half is awesome 2nd half is mind blowing gud movie for true srk fans...........As we expected , Shah Rukh Khan's Jab Tak Hai Jaan clearly leads on this Diwali Clash in term of Box Office opening as well as Public Response !!. The movie takes an excellent opening all over India. Critics give good ratings to this film but overall most of the reviews suggest that the film is good but not extra ordinary . The film got 3-4 stars by critics. Critics praised Shah Rukh Khan 's Performance and Yash Chopra 's Direction , but old repeated story , long and slow screenplay are some of minuses for this film.",
         "What A Bliss!!!! After a long time, Bollywood gets a Romantic One and that is above everything else. It's beyond being just film, is a Expression Of Love & Happiness. Its Not a Story of Miracle,Its a Simple Story of Love. Its all about undying love of people and undying faith they have in God. Shah Rukh Khan : When it comes to Romance, yes you are The Only Emperor.. Katrina Kaif: Just Superb & Mind-blowing. Anushka Sharma: Cute, Sexy & Simply Awesome. Chemistry of SRKAT is really Sizzling & Exciting. Yash Ji, we will miss your this kind of movie.All Respect to this Gentlemen. Totally Worth Watching.(Multiple times) Movie will work on its own Merit. Kaam Bolega Bhai Kaam. #One Will Totally, Completely and Madly Fall in Love with It.",
         "A perfect love story from the duo - Yash Chopra and Shahrukh again after a long time (I hope Veer-Zaara was the last). This movie filled with Love, Romance and enjoyment. The film was stretched a bit too long in the second half and it was getting boring after Samar loses his memory. But overall the acting saved the movie. Major Samar Anand, should get thumbs up for acting and expressions. Anushka was just too awesome to say, she will really go heights in her career. Damn good acting. Katrina was just up to the mark. She did well as compared to her previous projects. Katrina was so good in the movie that gave me a little surprise. I know she is a good actress. But in Jab Tak Hai Jaan she gave her best performance yet.",
         "Best movie ever.. Yashji thanks for this movie.. The chemistry between SRK and Katrina was really good. Twists were good in d movie.. Music was excellent.. Direction was good. Directed by the late Yash Chopra, the film doesn't cease to impress the romantic movie lovers and of course SRK fans. People go in with some expectations of a 'Ya sh Chopra' type of romance and are not disappointed at all. It begins with a fearless army officer Samar moving all along Kashmir diffusing bombs without tinge of fear in his mind. The story flies in flashback after the audience is well settled for the movie. Shah Rukh Khan handles the role of a strict army officer and jolly youngster so well that it seems hard to believe that both roles are played by the same man. Anushka sharma is bubbly and ' happy-go-lucky girl' who lives life to the fullest breathing every moment of her life happily. Katrina Kaif on other hand is exactly opposite to Anushka. Overall: Direction - 10, Music - 10, Acting - 10, This is not just a movie but an event in bollywood history !",
         "Started my year with this film. Wanted to write just after it but couldn't make out time for writing review. Jab Tak Hai Jaan is a love triangle. Shar Rukh Khan, Katrina Kaif, Anushka Sharma are in the lead roles of the films. Story is penned by Aditiya Chopra & it has plenty of twists & turns. Because of so many turns & twists it gets engaging, at the same time complicated. On thing about the story is that if you are not familiar with characters like Meera who has firm believe in God, then the story might not satisfy you. If you can go with this, then you will find story terrific. Films screenplay by Aditiya Chopra & Devika Bhagat is masterfully written. Film never gets predictable. Also because of the story its keeps your interests till the end despite of its slow pace. The writers deserve Kudos for their job. Aditiya Chopra's Dialogues are very much contemporary & effective. Performances of top 3 actors are top notch. Shah Rukh Khan just lives the role of Samar Anand. He is supremely effective in both characters of struggling young man & lonely army man. He has again proved to be \"King Of Romance\" in font of camera after doing romantic character almost after long years. One thing is for sure is that you won't see such handsome Indian army officer anywhere. Katrina Kaif plays a perfect Yash Chopra Heroine (except of her part time smoking habit).it won't be wrong if it is referred as her best performance. She also dances very well. Film would've been incomplete without Anushka Sharma's performance. She just lives the character of new generation girl. Her endearing character will make you fall in love with Akira. Anupam Kher has been effective. Neetu Singh and Rishi Kapoor leave lasting impressions in short special appearances. Other actors like Shaarib Hashmi, Amarinder Sodhi, Gireesh Sahdev, Andrew Bicknell, Ameet Channa does a formidable support. Direction of Yash Chopra is just terrific. Though he is making films for almost 50 years but he gave the movie a contemporary look with his masterful hand in film making. He is just master in romance, shows his matured skill in every scene. Another feather to his cap. Songs have not been as that popular as they were expected, as this film has Oscar winning pair of A R Rahman & Gulzar. But songs go well with the moments in the movie & compliment the actors. A.R. Rahman have done experiments with music as it has the taste of Yash Chopra & his own style. Gulzar is very good with lyrics .He is brilliant with Punjabi lyrics of 'Chhalla' & 'Heer'. According to Yash Chopra supporting artists were best possible in the country & so it is. Film is shot in Exotic location like Kashmir, Ladakh, London. Anil Mehta's cinematography is grandiose & World Class. He is both excellent in capturing Indian & foreign locals. He captures the actors & their emotions gracefully and gives a look of poetry in celluloid. A.R. Rahman's background music is just too good.Songs picturisation by Vaibhavi Merchant is superb. Like other Yash Chopra movies it has also got gorgeous costumes & best make-ups. Watch Jab Tak Hai Jaan not only as it is last film of Yash Chopra, also for the reason why everyone will miss this man. Truly a man who cannot die.",
         "Is it a Yash Chopra film ? Seriously ? I was bored to death and am falling short of words at expressing my extreme displeasure at watching such a movie which came after 8 LONG years !! I mean is this the result of waiting for 8 years ? Nope, this is not the way for Yash ji to go and definitely not the swan song I was expecting from Yash ji. May he rest in peace but this is an apology of a film. Songs are below average (no hummable soundtracks) and the film is SOOOO SLOOOOW !! There is hardly any movement in the first 2 hours. Things start to get a bit interesting for about fifteen minutes or so and after that, it's all downhill. Extremely disappointed in Yash ji but lesser said about it, the better. SPOILER:- To conclude, I would like to quote SRK's statement made to Katrina in the end,\"Pehle nahin soch sakti thi\"(meaning couldn't you have thought of it earlier instead of making me wait 10 (TEN) years for it) lest it would have saved me(and the viewers) the torture. I wanted to give it 0/10 but I guess that is not possible in minimum star rating. Also, I am writing this review because it's amazing as to how everyone is praising this film. I was myself stunned at the disgusting and pathetic piece of work this film is.",
         "I'm very very very happy with this movie. Samar Anand and Major Samar Anand are the best roles SRK's ever portrayed. You cannot take your eyes off SRK once you enter the hall. Yash Sir has done something really incredible. Roles of Katrina and Anushka are nicely categorized. Katrina acts as a bold and beautiful seductress and what can I say about Anushka! She's simple and amazing at the same time. None other than this trio could have played their respective roles. Story is awesome, locations are eyeball gripping and songs in the first part create base for the script. thousand cheers for the team. I can watch this movie again and again...Jab Tak Hai Jaan.",
         "Commiserable, deplorable, distressing, feeble, inadequate, lamentable, meager, miserable, paltry, petty, piteous, pitiable, pitiful,poor, puny, rueful, useless, woeful, worthless, wretched, brain numbing, agonizing, disturbing, abhorrent, abominable, appalling, awful, beastly, detestable, disgusting, dreadful, execrable, fearful, frightful, ghastly, grim, grisly, gruesome, heinous, hideous, horrendous, horrid, loathsome, lousy, lurid, nasty, obnoxious, offensive, repellent, repulsive, revolting, scandalous, shameful, shocking, sickening, terrible! I am sorry for the ranting but I truly think that the movie is really bad! The enormous number of loopholes along with the wooden acting of all characters coupled with the weakest story I have heard in recent times makes this movie not suitable for anybody especially for children whose brains are still developing. I sincerely hope such movies never darken India's long tradition of great cinema.",
         "These Kind of horribly sense less romantic movies have become Shahrukh Khan forte. This has to be one of the most pathetic movies I've seen off late. The only saving graze of the the movie were the beautiful locations . It just starts there and ends there. The movie has every possible ingredient required for a pathetic movie. Lack of script(insult to intelligence) , over acting (Thanks to SRK and Katrina) , irritating dialogues (makes you laugh at serious movie scenarios), And no hummable songs (mediocre A.R.Rahman) and to top it all incredibly lengthy( So long that you are waiting for it to end . . . and its just the interval). The story has too much of loop holes and these loop holes are just too much digest. A beggar in London becomes the top go to Bomb diffusing expert in The Indian Army within a span of 10 years. A wannabe discovery channel documentary girl is asked to join The Indian Army without any permission. It is as simple as . . . \"come and shoot me diffuse a bomb\" (Literally that simple). And the British police allows a stranger without a diffusing suit to diffuse the bomb just because he talks some mechanical terms.And the protagonist meet with an accident every alternate time when he is on English roads.One of the lead actress is introduced when she is drowning and the protagonist saves her. . . Two hours into the movie she boasts of being a national level swimming champion. I feel the writers of this movie assume the viewers to be as dumb as themselves. Do a favour on yourself and ignore this senseless flick. Because you would experience the 3 longest hours of your life."
      ],
      "genres": [
         "Drama",
         "Family",
         "Romance"
      ],
      "productionCompanies": [
         "First Step Productions",
         "Redchillies.VFX",
         "Yash Raj Films"
      ],
      "summaries": [
         "Samar Anand, a hard working young immigrant in the city of London, glimpses upon the love of his life, a gorgeous angelic looking girl, (Katrina Kaif). They meet and their bond blossoms into love with time spent together. Samar however meets with a serious accident, and Meera vows to God she will leave Samar forever if he allowed him to live again, their love affair ends as quickly as it began. Samar angered with God and fueled with his love for Meera, declares War against Him. Samar Anand vows to walk into the jaws of death everyday as a challenge to God to keep him alive. He becomes Major Samar Anand in the Indian Army, a bomb disposal chief, defusing bombs without ever wearing a bomb suit. It is here that Major Samar also known as 'the man who cannot die' meets Akira (Anushka Sharma), a spirited vibrant, 'today's generation' Discovery Channel correspondent with a WTF attitude. Aware of Samar Anand's story, Akira is determined to unravel the mystery of love in this intriguing story, whilst herself falling hopelessly in love with Samar. Is Akira able to unravel the mysteries of love, does Samar win the battle or then does God surrender to his love?",
         "An uncompromising film on true love from the legendary and unforgettable director Yash Chopra which is fascinatingly distinctive and contemporary."
      ],
      "budget": 7217600
   },
   "movielensId": 134777,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2012-11-13",
      "dvdReleaseDate": null,
      "directors": ["Yash Chopra"],
      "runtime": 176,
      "movieId": 134777,
      "title": "Jab Tak Hai Jaan",
      "mpaa": "NR",
      "actors": [
         "Shah Rukh Khan",
         "Katrina Kaif",
         "Anushka Sharma",
         "Anupam Kher",
         "Bindal Parikh",
         "Prerak Patel",
         "Sharib Hashmi",
         "Jasmine Jardot",
         "Gireesh Sahedev",
         "Amarinder Sodhi",
         "Varun Thakur",
         "Jay Conroy",
         "Rishi Kapoor",
         "Neetu Singh"
      ],
      "imdbMovieId": "2176013",
      "originalTitle": "Jab Tak Hai Jaan",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "v0UXgoJ9Shg",
         "vaoeifnLVoE",
         "9a4izd3Rvdw",
         "EJUrpiWfFwQ",
         "smn3mDBOUy4"
      ],
      "plotSummary": "An ex-army man, leading a double life in London, must choose between his wife and muse.  Jab Tak Hai Jaan movie is a love triangle,and also marks the return of Yash Chopra as a director after eight years.  In Jab Tak Hai Jaan, Shahrukh Khan plays the character of Samar who is an angry, unforgiving, with loads of emotional baggage. His role will span two ages, one in his late twenties as a musician based in London and the other at an older age as an introverted, composed, dutiful army officer in Kashmir.  Katrina as Meera play as a seductress, an unattainable beauty. And Anushka as Akira who is 21 year old and works for Discovery Channel and makes documentaries.",
      "tmdbMovieId": 132316,
      "avgRating": 3.30435,
      "releaseYear": "2012",
      "numRatings": 23,
      "posterPath": "/sABBBw0zCSpRpLEOPKtoJtV7zjT.jpg"
   }
}