{
   "tmdb": {
      "original_language": "sv",
      "keywords": [{
         "name": "silent film",
         "id": 154802
      }],
      "imdb_id": "tt0011157",
      "video": false,
      "title": "Erotikon",
      "recommendations": [
         28294,
         214952,
         180879,
         53408,
         148168,
         119555,
         42595,
         32716,
         115527,
         72785,
         88176,
         196396,
         209677,
         132378,
         105352,
         189587,
         194039,
         98914,
         190725,
         70800
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Professor Leo Charpentier",
               "gender": 0,
               "credit_id": "52fe485d9251416c91089c49",
               "name": "Anders de Wahl",
               "profile_path": null,
               "id": 928212,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Irene Charpentier",
               "gender": 1,
               "credit_id": "52fe485d9251416c91089c4d",
               "name": "Tora Teje",
               "profile_path": "/tTTwDxGBkWike9y4CKZjrxO8kDj.jpg",
               "id": 599669,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Preben Wells",
               "gender": 2,
               "credit_id": "53359b5e925141445400493f",
               "name": "Lars Hanson",
               "profile_path": "/cACBUQ8JN3nk1zfUQl0TZtuB7NQ.jpg",
               "id": 121001,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Marthe",
               "gender": 0,
               "credit_id": "52fe485d9251416c91089c51",
               "name": "Karin Molander",
               "profile_path": null,
               "id": 668060,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Irene's mother",
               "gender": 0,
               "credit_id": "52fe485d9251416c91089c55",
               "name": "Elin Lagergren",
               "profile_path": null,
               "id": 928215,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe485d9251416c91089c45",
            "name": "Mauritz Stiller",
            "profile_path": "/e1vvaP1QinFoc7wnUg4BLO86VLh.jpg",
            "id": 121256,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.355268,
      "production_countries": [],
      "id": 82576,
      "vote_count": 6,
      "budget": 0,
      "overview": "Erotikon is a 1920 Swedish romantic comedy film directed by Mauritz Stiller, starring Tora Teje, Karin Molander, Anders de Wahl and Lars Hanson. It is based on the 1917 play A kék róka by Ferenc Herczeg. The story revolves around an entomology professor obsessed with the sexual life of bugs, and his easygoing wife who is courted by two suitors.",
      "similar": [
         2292,
         19,
         460793,
         74643,
         81003,
         227156,
         82023,
         455661,
         458663,
         705,
         62214,
         251516,
         828,
         9662,
         9833,
         36208,
         14813,
         121986,
         28966,
         140420
      ],
      "original_title": "Erotikon",
      "runtime": 97,
      "poster_path": "/6Jh4VB9priCQmM14pAjownxucxm.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1920-11-08",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "A Daring Fable of Modern Love",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Sweden",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mauritz Stiller"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Ferenc Herczeg",
         "Gustaf Molander"
      ],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0011157/",
      "coverLink": null,
      "actors": [
         "Anders de Wahl",
         "Tora Teje",
         "Karin Molander"
      ],
      "reviews": [
         "A professor has a bit of an infatuation with his niece; the professor's wife, a cosmopolitan lady of leisure, takes up with a flashy aviator, mainly, it seems, to torment a sculptor who loves her; turn up the heat, stir, and wait for the boil... The DVD release's jacket does a mild disservice to Mauritz Stiller's Erotikon (1920) by stating that its slyly sardonic approach to sexual intrigue inspired Ernst Lubitsch. As the only Lubitsch film I've seen that predates Erotikon is the preposterous and galumphing Eyes of the Mummy, I'm prepared to accept that Lubitsch had a significant epiphany that helped him become the sort of filmmaker who could make The Marriage Circle. But the expectation is thus set that Erotikon will have an effervescent comic pace and a constantly winking eye like a Lubitsch film of the 30s-- and that is not the case. A better touchstone for the film is The Rules of the Game (not least because an aviator plays so prominent a role), a movie which observes, with the sad empathy of a veteran priest with many Saturdays spent listening to confession behind him, the desperate efforts of a group of humans to chase after happiness-- only to make things worse in most cases. Erotikon begins with a fussy middle-aged professor lecturing on bigamous beetles (oddly anticipating the recent movie biography of Dr. Kinsey), and takes a consciously scientific detachment toward its characters as they scurry about, trying to keep mortality at bay by finding some form of erotic excitement in lives which are a bit too settled, under-occupied and, it appears, sexually frustrated. A comedy, yes, and even one that wraps up in high spirits, and yet a comedy that's touched throughout by melancholy, and played with a sort of gravity and a deliberate pace that gives us time to feel the hurt under the surface. Or so it seemed to me when I watched it tonight. Then I watched the \"intro\" by the film scholar Peter Cowie, and learned that Erotikon is quite the opposite. Unlike Smiles of a Summer Night, another obvious comparison, Erotikon's comedy does not have a moralistic melancholy undertone, says Cowie. What struck me as gravity, like Preston Sturges slowed down to Douglas Sirk if not Carl Dreyer, strikes Cowie as \"frothy.\" How to account for the fact that Cowie sees a completely different Erotikon than I do? Well, for one thing, I suppose he has far more experience of Scandinavian cinema on which to build his preconceptions; next to a diet of Sjostrom, Bergman, Strindberg and Hamsun, Erotikon IS frothy, I'm sure. And I doubt he had seen it, the first few times at least, with the particular score on this DVD, a Celtic dirge that seems to belong to a production of \"The Death of Cuchulain\" more than it does to a 1920s drawing room comedy; it certainly puts the film in a dourer key than a conventional romantic comedy score would have. Maybe I'll try watching it again with something peppier, and see if it's a different movie. Adding to the uncertainty of tone is the fact that the film contains a wide variety of acting styles. Tora Teje (as the socialite wife) and Lars Hanson (as the sculptor) are highly effective in a theatrical, heightened-naturalism sort of way, while Anders de Wahl as the husband and especially Torsten Hammaren as an aged professor who seems to be the Swedish answer to Mr. Muckle in It's a Gift are caricatures of woolly-headed academia. It's a bit like Deborah Kerr in Bonjour Tristesse being married to Fred MacMurray in The Absent-Minded Professor. Despite this mismatch-- perhaps to be expected in such a trailblazing comedy with no apparent models to follow, other than its stage original-- Erotikon is a striking and interesting film, one of the few silents that seems to leap out of the period, untouched by the customary moralizing Victorian preconceptions of what is proper behavior for its characters (and proper punishment for those who violate it). Erotikon simply observes what these creatures do naturally; applying morals to them would be self-delusion, and Erotikon is a movie largely free of illusions.",
         "Insects are very similar to people in their sexual lives, as the entomologist Herr Leo Charpentier ( Anders de Wohl ) knows; some insects, like some people, are bigamists, others monogamists, and the boldest are even polygamists, not to mention the \"Ipstypographus\" who has three females! Charpentier's niece Marthe ( Karin Molander ) secretly loves her uncle, and Charpentier's wife Irene ( Tora Teje ) loves Baron Felix ( Vilhem Bryde ), and as well the sculptor Preben Wells, a friend of the whole family ( Lars Hanson ) loves Irene, but that one is an unrequited love... so, that's what \"Erotikon\", directed by the great Swedish director Herr Mauritz Stiller, is: a film about love and insects. \"Erotikon\" is a film that can be divided in two different parts: in its first part it is a high comedy with a remarkable pace and very dynamic editing; the film characters live in villas, go to the city by taxi, fly in airplanes and go to the theater; in this last scene the performance of the ballet \"Schaname\" is used by Stiller as a metaphor or analogy to explain in a subtle way ( as with the sexual life of insects ) that such complicated relationships have always existed, in ancient Persia ( the ballet tells the story of the Shah's favorite who loves prince Torie, another unrequited love with a tragic ending ) as in modern Sweden ( the entwined relationships of the main characters of the film ). In the last part of \"Erotikon\" the pace is more slow and static ( focused to solve those complicated love affairs ), the film more romantic, but not forgetting the comedy anyway, emphasizing for this German Count the surprising ending, modern and very advantageous for the film heroes' love interests. \"Erotikon\", filmed in 1920, is another great example of the modernity of the silent Swedish cinema ( in editing, acting, and even the audacity to show non-conventional marital relationships ), Herr Mauritz Stiller being one of its more important exponents. And now, if you'll allow me, I must temporarily take my leave because this German Count must investigate the Ipstypographus' secrets. Herr Graf Ferdinand Von Galitzien http://ferdinandvongalitzien.blogspot.com/",
         "Huge, dead tree beetles, a long-haired Arabian beauty dancing an erotic, half-naked dance of the veils wearing an exotic peacock-feathered headdress, and a niece who secretly likes to kick up her legs and smoke, makes mutton and cabbage casserole, and flirts with her own uncle - just a few of the things featured in this somewhat weird, but interesting, and even, at times, mildly amusing silent film. The film is about Leo, a professor of entomology and his tired-looking, bored \"touched with melancholy\" wife Irene, who has a crush on her husband's best friend, a handsome sculptor named Preben (Lars Hanson). Preben is in love with Irene as well, but holds back because of his friendship with her husband. Meanwhile, Leo flirts with, of all things, his own niece (and she must be a blood relative as she has the same last name as him!). Jealousies ensue. I thought the film was pretty well done and enjoyable, though a bit slow in parts. The music score that accompanies this film didn't really suit the story very well and was pretty heavy and gloomy for most of the film - in fact, it was really getting on my nerves (not in a good way) for the last half hour or so. The music did suit the story in a few places though - namely, a scene where they attend the opera to see this fantasy ballet featuring the on-stage tale of a Shah and his beautiful \"favorite wife\", and my favorite scene in the film - an interesting bit of photography in which Irene takes a flight with another of her flirtations, Baron Felix, and we watch their little plane as it sours through the air, Irene's scarf flying in the open air cockpit, and camera strapped to the wings as it looks through the moving clouds to the landscape below. Well done. The print of this looked very good, tinted in most scenes a sort of bright yellow-brown shade.",
         "'Erotikon' is the pinnacle of Swedish comedy until Bergman's sublime 'Smiles of a Summer Night'. There are many similarities between the two - a civilised contempt for Hollywood morality; a sympathy with the melancholy inherent in romantic comedy, especially the loneliness and fear of aging of beautiful women; and an interplay between life and art, especially drama. The most shocking thing about the film is not the notorious opera scene, a hilarious parody of the kind of 'decadent' work produced in the lurid wake of Strauss's 'Salome', with its labial, human flowers looking forward to Busby Berkeley, and its largely clothes-free Queen of the Shah, writhing lubriciously, hurling herself at her husband's best friend, hurling him in jail when he refuses to reciprocate. What is even more shocking is the cynical, healthily tolerant, even amoral attitude to marriage. In a Hollywood romantic comedy, the marriage is sacred, the goal of all the preceding plot complications. You can make fun of engagements, you can dump a dowdy fiance(e), but never marriage. In this comedy, the husband and wife are patently unsuited - Charpentier is a wealthy, slightly doddery entomologist, mocked by his students, whose mentor is a senile, shock-haired don, who seems to be missing a few bones, such is his physical bendiness; Irene, on the other hand, is a beautiful and sophisticated woman of the world, whose life is organised around satisfying her pleasures (trips to the furriers, flying with a friend), but who is deeply unhappy. The film initially suggests that she is also conducting an affair, but this is apparently not so. In fact, the sheer lack of sex, the frustration of forced abstinence, the quelling of passionate, but socially unacceptable feelings, is the comic motor of the film, with all the characters' repression displaced onto the decor, with its audaciously phallic and vulval bibelots; the innuendos; the running motif of butterflies and insects (free; polygamous; caught; classifed; trapped in a glass case); and the hilarious intertitles which are framed by gorgous art-deco illustrations that provide a mocking commentary on the events. 'Erotikon' has been called a precursor to Lubitsch, with its part-satiric, part-romantic look at the upper-classes, the games they play, the roles they assume. Like Lubitsch, Stiller uses the techniques of farce, where the geometry of plot and the manipulation of space leads to complications, misunderstandings, provocations, accidents. The use of the Charpentier hallway, for instance, with its angular spaces; and the emphasis on fetishised detail (Irene's gloves and feet; the 'striptease' in front of the sculptor when she removes her coat) are all to be found in Lubitsch. But the work also looks ahead to two other European masters. just as 'Lord Arne's Treasure' looked forward to 'Le Grande Illusion', so 'Erotikon' has elements that would flower in Renoir's masterpiece 'The Rules of the Game' - the tragicomedy of the upper-classes, the complication between the heroine and a flyer, the play with the spaces of an aristocratic house. Meanwhile, the plot turn towards infidelity, betrayed friendships and duels seems like a parodic precursor to the anguished romances of Ophuls. The complex use of mirrors and framing, already a feature of Stiller's work in the 'Thomas Graal' films, are richly Ophulsian. But Stiller was a master in his own right, one who gave the audience what they wanted - a happy ending - and blithely left them to wonder if that was what they REALLY wanted.",
         "A scientist falls in love with a young girl who brings life and joy into his old house and marriage, while his wife is having an affair with his best friend. This is a completely delightful romantic comedy - one of the first ones ever? - with an abundance of wit and good acting. Mauritz Stiller is sometimes considered less interesting than his contemporary Swedish director Victor Sjöström, but Stiller had a feel for style and comedy which makes his films in my eyes fresher and more enjoyable than Sjöström's films. Stiller's more somber films have not aged as well as his comedies. Erotikon is perhaps a ditty, but it is certainly a wonderful one. If possible, see it in a cinema with a piano player playing live music - the film truly benefits from it.",
         "Beside Victor Sjostrom, the well known director of THE PHANTOM CARRIAGE, the man who contributed his wonderfully individual style into the silent productions of Svensk Filmindustrie and, consequently, into the world cinema was Mauritz Stiller. What a great name for many movie historians! The man who took all pains to make his productions special, the director who creatively brought to screen Selma Lagerlof's immortal novels, the tutor famous for discovering Greta Gustafsson (Greta Garbo)...one could endlessly continue with the significant facts. Yet, that is not the case. What seems to be important here is Stiller's innovation and his mesmerizing ability to surprise viewers. Such a surprise is his EROTIKON, a 1920 silent film which would surely meet the standards of a comedy, a vivid action film, a romantic picture with subtle images and a glorious boast of fine acting. The content of EROTIKON is seemingly simple and refers mostly to the relations, or better said 'inter-relations' among people. Yet, we have to realize that the film is being seen nowadays from the entirely different perspective with the entirely new vision of certain aspects. Naturally, even the things we expect in a comedy changed. Any silent film is, of course, being seen differently. When we consider the content regarding this very knowledge, EROTIKON occurs to be revolutionary, much ahead of its time. Stiller proves to be extremely open to modern thinking and, as a result, he becomes a milestone in the later trends in cinema. Certain notions on marriage, on the place of women in society, on the superiority of feelings to old, dusted regulations are particularly modern and appealing to an average movie buff nowadays. Here, the open minded thinking is so fresh, so unique, so absorbing though the film is, paradoxically, almost a century old. Why? Because EROTIKON is no preacher of what the things should be like but places the characters in the superior positions. Since the characters make for the story, it is thanks to them that we enjoy the film. A few people are in the lead and...their emotions, desires, dreams seem to achieve their intensity and climax at the end. This is Professor Leo (Anders De Wahl). Most professors are famous for their researches and it depends, of course, what they research on...Leo's researches are quite peculiar...their subject are the beetles. He is a book buff, a calm man who loves very concrete schedule and takes life rather optimistically. Being naive in erotic tensions here and there, he skips certain desires around. Yet, he detests one thing: dramatic endings. His wife, Irene (Tora Teje) is a character worth consideration. She is a sort of prototype of a modern woman, independent of her husband, a woman who has a clear idea of what to do with life once giving a furrier a lesson of patience, another time traveling with a 'new Ikar' by helicopter, Baron Felix. Played by Tora Teje, she is given some marvelous moments of humor. Consider her waving at the husband or flirting scenes. Then comes a young, youthful, pretty, enthusiastic Marte (Karin Molander), a sweetie who loves sweets, a character who represents a light-hearted glimpse of a young girl: listening curiously to Professor's lecture on beetles' sexual life at the door, smoking a cigarette when the guests have left, making certain sensual moves meant to arouse men. She surprises us most at the end... Finally comes Preben (Lars Hanson), the best friend of the professor who has a crush on Irene...he appears to be fluent, more aware of life, sophisticated and burning within, burning with desire. Wonderfully portrayed by Lars Hanson, the actor who later became famous in Hollywood, the character of Prebel is very clear and memorable. Those four characters supply us with wonderful tension that you will never forget. Their plots are so strongly linked to the strange fate of Shah and his wife in the Schaname that the opera sequence makes a perfect sense in the movie. When seeing EROTIKON one may notice many other innovations, artistic features that played such a decisive role in Stiller's productions. For the director who had an unbelievable flair for beauty, the film could not come out with the lack of elegant wardrobe, wonderful sets, stunning visuals, catchy close-ups, fluent camera work and the technologically modern (for the time) stimuli like phones in a car and a helicopter. It all adds a certain amount of artistic pleasure and makes EROTIKON a valuable, enjoyable movie. There is, moreover, one more aspect I would like to add when considering the artistic aspect. It is the great job done by Alva Lindbohm Lundin and the whole aesthetics and creativity in the subtitles. The pictures, created by her in the Svensk Filmindustrie, include birds chirping as the symbol of flirting or a question mark between the hearts symbolizing the dilemma who loves whom. These are just a few among the whole chain of wonderful ideas. Some people will perhaps say that there are many elements of American cinema...true to a certain extent...like modern music often models upon immortal classical pieces, the same has occurred to happen in cinema...EROTIKON is a highly recommended film as an authentic presentation of certain aspects, as a tribute to feelings that should reign our acts, as the beautiful song \"Jeg Elsker Dig\" (I love you) that mysteriously showed the characters the paths they should take. A brilliant silent film!",
         "Though critically acclaimed, this 1920 film is interesting only from a historical perspective. It was directed notably by the great Swedish director Mauritz Stiller (he was actually a Jew from Finland), who had already directed dozens of films and was a master of his craft. Although he was yet to create his masterpiece The Saga of Gosta Berling, he would only direct a handful of films before his failed residency in Hollywood and premature death in 1928. Also worthy of mention is the film's male lead, a premiere Swedish actor, Lars Hanson, who would famously star several times with Stiller's great discovery Greta Garbo. Erotikon, though, scarcely lives up to its salacious title. It may have been somewhat daring in 1920, but today it is less apt to raise eyebrows than to close eyelids. There must have been a hundred silent features that would deal more compellingly with the theme of the errant wife and the dull husband. While there is no question Stiller has grasped the art of motion picture making -- the acting and camera-work and editing are polished and some of the title cards are witty, artistically the film is a disappointment. Even for one accustomed to the conventions of silent films, it is painfully slow and devoid of arresting incident. Only the unconventional ending (which I won't divulge) somewhat saves it. And the nicely restored Kino version unhappily features a musical score which does little to arise audience interest or connection to the plot. Its atrocious fiddle-scraping may be apt for the contemplation of suicide, but after a half hour or so its annoying discordance becomes unbearable and anyone of auditory sensibilities will soon be reduced to viewing this feature in grateful silence.",
         "This well-preserved Swedish classic available on DVD from Kino shows a remarkably adult comedy about marriage, infidelity, real or presumed, and leading to the re-matching of mismatched partners through divorce. It is well photographed, acted in a naturalistic manner not unlike the French films of the time (think \"Judex\") and has many action and outdoor scenes, including an outing in an airplane and a night at the opera. It is erotic in its subject matter - the sexual attractions extant in a group of young, wealthy and healthy people - and made even more so by the choice of attractive comedians who are all extremely \"baisables\" even by contemporary standards. The major failure of this DVD is in its musical accompaniment (piano, violin, tampura and percussion) which is as ponderous, depressing and dissonant as the comedy is lightly structured and frothy. The film has many distinct musical possibilities, including a pivotal romantic love song played on the piano by the wife to her would-be lover and a night at the opera featuring a Ballet Russe-type ballet along the lines of \"Shéhérazade\" and the Prologue to \"I Pagliacci\", none of which are rendered realistically - or even satisfactorily suggested. Instead, the viewer is treated to an unbearably caterwauling faux Indian raga - as revised by Arnold Schoënberg - from beginning to end, one that doesn't take any of the plot or acting subtleties into consideration, is highly anachronistic and will have you reaching for the Extra-Strength Aspirin. I survived viewing this DVD by doubling the speed at the times when the music became simply too much for my nerves, which allowed me to watch the film and its titles in silence and make up my own music as I went along.",
         "Erotikon immediately reminded me of something I thought about when I saw Hindle's Wake, an important point that's worth looking into for social theorists and art history types: even in the 20s, feminist narratives were recognized and crafted with respect and open-mindedness. Although the norm to this very day still remains a male-centric viewpoint in cinema, Erotikon points to an open-mindedness even forty years before the titled Feminist Movement towards equality and self-ownership. Part of it has to deal with the more modernist Industrial stylings of this movie. It's a mostly upper-class comedy of manners where science and zoology help provide the seed of the idea that nature doesn't require a monogamous relationship helps provide in one woman the incentive to pursue a lover despite her marriage. But also it's a recognition of, basically, dating, the ability to decide individually who you want to be with without absolutes in love suturing two souls together. Hindle Wakes is a much more poetic, sensual allegory towards the matter. Erotikon is mostly a gorgeous pastiche of sets, character, and costume design. Hindle Wakes is a melodrama, whereas Erotikon is much more like a glamorous romantic comedy... in a way, Erotikon is the Sex and the City of the 1920s, if you'll forgive me my dated reference to a recent publicized movie in comparison to a lesser known Euro-art classic. It should also be noted that the KINO release of this movie on DVD comes with a fantastic score that really helps the experience. This is a good movie for fans of silent era cinema, but unfortunately it isn't exactly a well-known classic and it doesn't really have a huge audience, even for fans of foreign and classic films, so it might be a little difficult to find. I can't say it's worth a huge search, because there have definitely been better (and worse) silent movies out there. But it is a decently entertaining, quite beautiful movie in its own right. --PolarisDiB",
         "In the few Swedish silent films easily accessible on home video today, the sex comedy of \"Erotikon\" has no comparison. The other available Swedish films of Mauritz Stiller and Victor Sjöström are heavily dramatic. These include \"Ingeborg Holm\" (1913), \"Terje Vigen\" (1917), \"The Outlaw and His Wife\" (1918), \"Sir Arne's Treasure\" (1919), \"The Phantom Carriage\" (1921) and \"The Atonement of Gosta Berling\" (1924). The Dane Carl Theodor Dreyer made the comedy \"The Parson's Widow\" (1920) for a Swedish company, but it's a different sort of comedy and concerns different social classes. \"Erotikon\", on the other hand, is of the romantic infidelities of the upper classes. It's more akin to a Cecil B. DeMille or Ernest Lubitsch sex comedy: for instance, DeMille's \"Don't Change Your Husband\" (1919) or Lubitsch's \"The Marriage Circle\" (1924). In \"Erotikon\", a professor's wife spends her time with expensive fashion and two other men—mostly with a sculptor (played by would-be transatlantic star Lars Hanson) who also happens to be a good friend of the professor—as well as with a baron who has an aviation hobby. Supposedly, a professor's salary was quite good, because he and his seemingly unemployed wife are able to afford a luxurious home and some ridiculously expensive outfits for her. She even has a driver who she dictates to through a car phone. (Apparently, a solution to the poverty of the professor in Lois Weber's 1921 American film \"The Blot\" was for him to move to Sweden.) Based on how popular this genre has been in film history, audiences enjoy the escapism of the fashion and infidelities of the upper classes. For me, however—92 years removed from the initial release of \"Erotikon\"—this comedy isn't funny. It's at times even dull and dramatic in tone. The professor's wife is an unappealing character, who wastes her husband's salary on fashion and who prefers an overly dramatic sculptor who fawns over her to her more subdued (and, I'd add, tolerable) husband. The professor, for his part, also prefers the fawning over him by his niece and seems content if he only had a wife who'd cook for him and fix his tie. If this is what is meant by \"sophisticated\", it's an undesirable quality. Film historian Peter Cowie (\"Scandinavian Cinema\") says \"Erotikon\" was \"sensational at the time because of its lack of inhibitions and its risqué innuendo.\" That may've been so, but there's no longer anything sensational about a sex comedy where it takes over an hour before anyone kisses anyone, and contemporaries DeMille and Lubitsch weren't so shy. Nevertheless, \"Erotikon\", for its time, looks as expensive as its characters' lives. In addition to the rich interior and costume designs, the film features an elaborately choreographed play-within-the-play and some impressive aerial photography. The cinematography also features some good use of irises, including as scene transitions, and there's enough scene dissection here for a 1920 production. Its interesting self-reflexivity, however, is what raises \"Erotikon\" above the mediocre. In an early scene, the professor gives a lecture on the mating habits of beetles, which foreshadows the mating habits of the narrative's human characters. Later in the film, the play-within-the-play mirrors the outer narrative's love triangle. After the play, the professor expresses how he prefers the happy endings in movies; his sculptor friend and competitor, however, prefers tragedies. According to film historians, this self-reflexive comedy wasn't an anomaly for Sweden. One film that still exists from this period, but which hasn't been widely accessible on home video, that is high on my viewing wish list is \"Thomas Graal's Best Film\" (1917), which Stiller directed and which stars Sjöström. Swedish silent cinema was a golden age in film history; the sampling available today just leaves me wanting more.",
         "EROTIKON is a Swedish silent film that is supposed to be a sexy comedy, but much of it didn't seem all that funny nor did it especially titillate. Now this isn't saying it's a bad film, but it isn't exactly a must-see. The film is about a bored rich wife who runs about with a variety of men and her husband doesn't seem to mind or suspect that she might be cheating on him! At first, you just assume he's a moron. Later, when you see that he actually has strong romantic feelings towards his more domestically-oriented niece, you can see why he is ambivalent. There are lots of mistaken identities and situations in the film and it does have lovely camera work and costumes. As for the story, it all seems so ordinary and lacks spark. Still, as I am a lover of the silents, I did enjoy watching but I do think the film is a tad overrated. FYI--The DVD includes some bonus material that is delivered in such a dull and scholarly way that I found myself falling asleep repeatedly as I tried to watch."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Svensk Filmindustri (SF)"],
      "summaries": ["EROTIKON surely pushed the boundaries of what was acceptable on the screen in 1920: Irene, the bored wife of a distracted entomologist, pursues a womanizing aviator, but she may actually be in love with Preben, her husband's best friend. Meanwhile, her husband seems to be getting unusually close with his own niece. Stiller obviously delights in teasing his audience with each scandalous plot twist and every salacious leer, and the result is a deliciously subversive comedy that was very much ahead of its time."],
      "budget": 0
   },
   "movielensId": 134791,
   "movielens": {
      "languages": [""],
      "releaseDate": "1920-11-08",
      "dvdReleaseDate": null,
      "directors": ["Mauritz Stiller"],
      "runtime": 97,
      "movieId": 134791,
      "title": "Erotikon",
      "mpaa": null,
      "actors": [
         "Anders de Wahl",
         "Tora Teje",
         "Lars Hanson",
         "Karin Molander",
         "Elin Lagergren"
      ],
      "imdbMovieId": "0011157",
      "originalTitle": "Erotikon",
      "genres": [
         "Romance",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Erotikon is a 1920 Swedish romantic comedy film directed by Mauritz Stiller, starring Tora Teje, Karin Molander, Anders de Wahl and Lars Hanson. It is based on the 1917 play A kék róka by Ferenc Herczeg. The story revolves around an entomology professor obsessed with the sexual life of bugs, and his easygoing wife who is courted by two suitors.",
      "tmdbMovieId": 82576,
      "avgRating": 3.25,
      "releaseYear": "1920",
      "numRatings": 6,
      "posterPath": "/6Jh4VB9priCQmM14pAjownxucxm.jpg"
   }
}