{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0840305",
      "video": false,
      "title": "Comedy Central Roast of William Shatner",
      "recommendations": [
         334461,
         315850,
         333126,
         329690,
         324173,
         296193,
         296206,
         414749,
         333127,
         296192,
         329983,
         329243,
         44220,
         36963,
         266782,
         157050,
         75874,
         18128,
         108177,
         27317
      ],
      "backdrop_path": "/byVy5fDZUBYgZ3zx4UDiuZHJGJH.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e6f49251416f10000a4c",
               "name": "William Shatner",
               "profile_path": "/4byp8PsbRkC3UQVuvMAh4bcj7E2.jpg",
               "id": 1748,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e6fac3a36862f9000984",
               "name": "Jason Alexander",
               "profile_path": "/ernpSXp2RnkzeV14OEEKXRq1yND.jpg",
               "id": 1206,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e732c3a36862f60008e1",
               "name": "Andy Dick",
               "profile_path": "/ebNRu8oV7Ifv5aoP23UyNnx0lZS.jpg",
               "id": 43120,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Herself",
               "gender": 1,
               "credit_id": "5516e7479251416f0a0009bc",
               "name": "Farrah Fawcett",
               "profile_path": "/aUMdPKJVwIHJhZX8BZlFbroaRwP.jpg",
               "id": 28768,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5516e755c3a36862f3000931",
               "name": "Greg Giraldo",
               "profile_path": "/hwn8ErLgNkldrguF0TzH5R6OrVf.jpg",
               "id": 105787,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Herself",
               "gender": 0,
               "credit_id": "5516e760c3a36862ef0008fa",
               "name": "Lisa Lampanelli",
               "profile_path": "/9Vj4MKNC4rYWf0Aj8qQKYFtOTqr.jpg",
               "id": 105788,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e76f9251416f000009f2",
               "name": "Artie Lange",
               "profile_path": "/ifXG3HVuOgYhSTuvugGJCthfcN.jpg",
               "id": 20788,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e7789251416efe0009d3",
               "name": "Patton Oswalt",
               "profile_path": "/dq3uNmTB7r8XTtadV3OD3N7LqV6.jpg",
               "id": 10872,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e784c3a36862ef000902",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e7a59251416f120009fa",
               "name": "Jeffrey Ross",
               "profile_path": "/5eI6ouwszmaXl6Gy0wWlXdUCmf1.jpg",
               "id": 87281,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Herself",
               "gender": 1,
               "credit_id": "5516e7c2c3a36862f3000940",
               "name": "Nichelle Nichols",
               "profile_path": "/1p5EIwiyFBxjs5e8a6AzPRzy1JL.jpg",
               "id": 1753,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e7ea9251416f040009f4",
               "name": "George Takei",
               "profile_path": "/5eBSvAPy6DnWsMX61IlJyjUzCRJ.jpg",
               "id": 1752,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Herself",
               "gender": 1,
               "credit_id": "5516e7f2c3a36862f90009a6",
               "name": "Betty White",
               "profile_path": "/pTM0ElkoBNNtbRjT13y4do9RKnq.jpg",
               "id": 71727,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5516e7fe9251416f12000a06",
               "name": "Fred Willard",
               "profile_path": "/j1jWdqmklfIH4hpAbw1DK0gPMX0.jpg",
               "id": 20753,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5516e6909251416f0a0009a7",
               "name": "Joel Gallen",
               "profile_path": "/pxJ9n31X0a1PDqOpYJSALC2yxKX.jpg",
               "id": 57604,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5516e6af9251416efe0009ac",
               "name": "Michael Ferrucci",
               "profile_path": null,
               "id": 1371390,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5516e6ca9251416f0d0009dd",
               "name": "Mathew Harawitz",
               "profile_path": null,
               "id": 1336499,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5516e6dac3a36862ed00091b",
               "name": "Joe Kelly",
               "profile_path": null,
               "id": 1222180,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5516e71fc3a36862ed000929",
               "name": "Aaron Matthew Lee",
               "profile_path": null,
               "id": 1371393,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "TV Movie",
            "id": 10770
         }
      ],
      "popularity": 2.028711,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 296194,
      "vote_count": 14,
      "budget": 0,
      "overview": "It's William Shatner's turn to step in to the celebrity hot seat for the latest installment of The Comedy Central Roast. A parade of Shatner's friends have gotten together to boldly go ...",
      "similar": [],
      "original_title": "Comedy Central Roast of William Shatner",
      "runtime": 90,
      "poster_path": "/skPSOqgx3hTiZNBbY32MpGEzyA1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/3q7NjXSLVUPQ24CG3zrBPK7GQqH.png",
            "name": "Comedy Central",
            "id": 1538,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tenth Planet Productions",
            "id": 2933,
            "origin_country": ""
         }
      ],
      "release_date": "2006-08-20",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joel Gallen"],
      "runtime": 90,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0840305/",
      "coverLink": null,
      "actors": [
         "William Shatner",
         "Jason Alexander",
         "Farrah Fawcett"
      ],
      "reviews": [
         "Although I have not personally seen the entire program, I have heard from numerous sources that the \"N.Y. Friars Roast of Chevy Chase\" broadcast on Comedy Central a few years ago was such a disaster that even Comedy Central acknowledged its failure and vowed never to air it on television again. So far they have apparently kept to their promise. Part of the reason the show was so horrendous was apparently due to the fact that the roast's subject, Mr. Chase, did not approve of the jokes targeting his career. He was also upset that none of his old \"friends\" from his \"SNL\" days had shown up (except for one or two no-names who never found a career outside of the program) - the same \"friends\" of Chevy that later voted him as the least-liked cast member in the history of \"SNL.\" Now, I hold nothing against Chevy Chase. He's pretty funny (well, was, anyway) in those '80s comedy like \"Vacation\" and \"Caddyshack.\" But from what I've seen of the program he really didn't understand the concept at all. William Shatner, on the other hand, takes the extreme criticism in stride. He's a good sport all through this roast - some of the jokes are truly brutal, ranging from verbal jabs at his alleged hairpiece to his singing career and of course his infamous acting chops. Shatner's good humor surrounding the entire ordeal elevates this program - because I'm sure I would have felt less content to laugh along with all the jokes if Shatner had thrown a Chevy Chase and been a jerk about it. This isn't quite as good as last year's Pamela Anderson roast, I must say. Overall the jokes are tamer (excluding some crude references to a gay \"Star Trek\" castmember and his private activities, so to speak) - which isn't necessarily a bad thing, but I felt as though a lot of the dirtier stuff had been cut out. This doesn't bother me as much as the fact that the cuts were made fairly obvious. No doubt Comedy Central will feature some type of \"Uncut\" DVD in the future with bonus material \"too raunchy for television.\" Plus, I absolutely HATED the fact that they cut numerous roasters' speeches short. I understand there were time constraints, but the first one who should have been axed was Farrah Fawcett, whose speech was absolutely horrid. Apparently trying to make fun of her notorious Letterman appearance from a few years back, it quickly dissolved into another case of a joke falling victim to its own subject - she was wasted out of her mind! She completely messed up her jokes, kept turning away from the microphone (making it hard to hear what she was saying), and just generally ruined the vibe of the entire thing. The audience members (including Carrie Fisher, who gets stabbed with jokes a few times linked to her weight gain) were straining to laugh. Instead, I would have FAR preferred to see comedy genius Fred Willard's speech. They decided to cut it short and give us probably less than a minute or so of what he actually said when the show was recorded last week. Willard is such a fine, dry comedian - chances are his jokes just weren't understood by the editors of this show, who are obviously in favor of the more obvious, deliberately crude material. Basically the whole thing about the gay Star Trek member was funny the first few dozen times, but it's akin to Pam Anderson's boob jokes from last year getting old - enough is enough. Not that I'm complaining, but Andy Dick and Kevin Pollak were also cut short (I could go without hearing Dick's entire routine, I admit) - and the editing is more choppy than last year's roast, resulting in noticeable skips - as if the editors selected the \"best\" of each roaster and spliced it together. But these flaws aside, the show WAS very funny. I laughed my head off when Ben Stiller appeared in a pre-recorded roast to Shatner. Unexpected and hilarious, Stiller's was one of my favorite segments of the entire program! Jason Alexander was a surprisingly good host, although he seemed a bit hesitative and unsure at times. Overall I think I preferred Kimmel's more cynical presentation from last year's, but again, it's a minor complaint. Overall if you're a fan of these roasts you'll love this. There are some great moments such as the Shatner music flashbacks - including video pieces from his infamous \"Rocket Man\" performance from years ago. Shatner takes it all in stride and comes across as a really nice, likable guy - even after all is said and done he gets up and delivers a tongue-in-cheek roast to himself. This may not be quite as unexpected, irreverent or downright hilarious as the Pamela Anderson roast, but just barely. My only complaints, as I mentioned above, were the editing choices, really - apart from that, it was another job well done on Comedy Central's behalf! As an aside, I'd really love to see \"The Roast of David Hasselhoff\" next year. NO ONE deserves a roast as much as this guy does. So I'll have my fingers crossed for the next year, I suppose.",
         "This was one of the funniest roasts I've seen, even though it was obviously, as MovieAddict2006 commented, cut to hell and back. (But my cable company is showing the uncut version on pay-per-view, which I think would be a worthwhile indulgence.) It was clear that William Shatner (\"the past-tense of 'Shitner\" as one comic put it) was a big enough man to laugh at the comic jabs and oft-times full-out thrusts hurled in his direction. From his weight, to his hair-piece, to his acting/singing talents, nothing was deemed to sacred to mock, and he welcomed it all with humor and good nature. Also, George Takei seemed genuinely entertained at the jokes made at his expense, although many of them would appear to be the pinnancle of \"gay-bashing\" (at least to those without a sense of humor). Unfortunately, Farrah Fawcett's bit was like watching a train wreck having a bad-hair day in slooooow motion. Where, oh where was the stage hook when we needed it most? The only person I couldn't quite figure out was Andy Dick; his back- and on-stage antics made the news, but while he was taking a good a**-kicking from others (and others were taking a not-so-good face-licking from him), he was often seen shaking his head \"No, no, no\" and mouthing the words, \"That's not true\" (he even flipped someone the bird, at one point). The thing is, he seemed REALLY stoned and/or drunk, and I couldn't tell if it was all part of the scheme of things or if, in his substance-induced stupor, he was really insulted. No matter, it was great fodder for the taint-of-heart, and a welcome alternative to the regular Comedy Central programming.",
         "I anxiously awaited the roast of William Shatner this past summer, as he is one of my favorite cult-type persona's, and I found the roast of Pamela Anderson to be quite funny. However, this year's roast proved to be disappointing in a lot of aspects, defeating my expectations of it being a superiorly funny roast. The thing that annoyed me the most was that none of these actors have probably not even met Shatner in their life! These were people like Patton Oswalt, Greg Giraldo, Andy Dick and Lisa Lampenelli. Why are these people here? But now I've realized it's obvious that because they are very common on comedy central, however, it comes off awkward for the viewer and even Shatner to see these comedians who've never even met him come out and mock him. I mean, show us some Mr. Spock please or something! Not only that, but Shatner was hardly part of the show! These people mocked others more then shatner, and while there were a lot of funny insults going here, shatner just sat their laughing seldomly going in to comment. In the Pamela Anderson roast, she seemed more involved. The jokes here got old and were very hit and miss, with almost all of those comedians basically to sum it up coming up to the stand and saying \"hey, look who got bald and fat, look who's a bad actor, but really you were an idol for me as a kid with star trek.\" Unlike last year's roast, which occasionally insulted Pamela but in a not too harsh and more of a funnier way, the comedian's were overly and deliberately insulting rather then funny when roasting shatner. Jason Alexander was a bit of a let down too. One funny part of the show was the comedians pointing out how much he tries too hard to be funny and went from going to a show about nothing to literally nothing, which evidently was very true here. He couldn't come up with too many good witty jokes, so would just go into speedy or loud talking to try to be funny. He only had about one or two funny lines. Jimmy Kimmel was a much funnier roast master. Overall, this program was somewhat weak and forced compared to last year's roast, but there were some funny parts. There were some good insults, but it was hit and miss and spread out among the different comedians. Not one comedian shined specifically, however, out of all of them, 80 something year old Betty White was the funniest and best roaster. God bless her. She didn't need to be overly forced and harsh to be funny like some of the other roast masters, but naturally seemed to be darkly funny. She really knows what a roast is, because she goes back to the older days of good roasts.",
         "There were some funny parts of this DVD, but the crudeness went a bit overboard. I thought it was a roast of Shatner, yet the roasters attacked each other and few comments were made about Shatner. Andy Dick was pitiful and made your skin crawl, Farrah looked to be high and brainless, and Artie Lange was a slob. A couple of the roasters were funny, but the constant oral sex jokes about George Takei went on for too long. This is something those who like insults would enjoy, but it is not something that someone used to the TRUE roasts, of the past, would like to sit down and watch. William Shatner's part was the funniest part of the entire DVD and you have to sit through a lot of garbage to get to Shatner's part.",
         "I haven't seen a roast in years. I'd always found them cruel but amusing in the way that nasty gossip is interesting. Amusing is not the word I'd use for the William Shatner Roast. Obscene, disgusting, vulgar might work if only there were some way to combine them into a single word. I admit it. I'm a closet Trekke. I admire what Shatner has done with his lack of talent, watch almost anything he's in. I was, like another poster, so looking forward to seeing Nichols and Takei voice their dislike for the former Captain Kirk, in a comedic way, of course. What I saw instead was the potty humor of 10-year-olds taken to a new depth. From the constant reference to Takei's sex life down to Dick's (he is so well named) Butt-Birth skit, I was appalled. I also stopped watching. How did I miss the death of wit and humor?",
         "This was totally lame as far as what a celebrity \"Roast\" should be. The only funny roaster was Betty White. Where did the producers come up with the roaster list I wonder? Has-Beens-R-Us? Most of the jokes were directed at George Takei. Who was supposed to be roasted here?? I agree to a previous commenter that the Dean Martin Roasts are far superior to the tripe being produced these days. The majority of the roasters had nothing to do with Star Trek and more than likely are not friends of Shatner to begin with. That was the premise of the Roasts of the '70s. Friends and show business associates of the Roastee are part of the gist of what is supposed to be a \"Roast\". From watching this Roast, I can see why Shatner's real friends and cast mates wanted nothing to do with what was supposed to go on. Producers of the Roast, please heed this and the other comments!",
         "I really wanted to enjoy this. I love watching William Shatner. The host opens up quite well but immediately descends into profanities. Each 'comic' guest takes his or her turn to insult William Shatner, although one or two of them simply stand up and crack one-liners with no reference to 'Bill' whatsoever. Maybe I expect too much, but when many of them get up clasping pieces of paper and proceed to read their lines. I'm afraid if they aren't naturally funny then they shouldn't be there. I'm no comedian BUT I bet I could get on a stage and knock out 5 or more 'Star Trekkie' or 'TJ Hooker' anecdotes without much bother, and without the need to swear every other word. Many shots of the audience catch many of them frowning or simply shaking their heads in disbelief. The 'gay' references were unbelievable; once they started they never stopped. The whole programme deteriorated into what can only be described as school-boy humour. (Mind you most school boys would rise above this). I would describe most of the comments as infantile. If you don't mind cringing along with a bunch of has-beens or wannabees's, then watch it. Otherwise, give it a wide berth, I felt embarrassed for them. Many of the other reviews make fun of the Chevy Chase 'roasting' because he apparently didn't play ball, and didn't 'get' the humour. Maybe he did 'get' the humour and realised that maybe his career hadn't deteriorated to such a point that he had to put himself up for ridicule. The bit that really lingers about this crass production is the constant references to gay activity. It was unnecessary and simply served to highlighted the guests own short-comings. It's the first time I've heard of the guest Andy Dick or Cox. whatever, but what an absolute loser he portrayed himself to be. Really\u0085.I mean really...give this a miss. Cheap shots, cheap and crude humour. Expect more.",
         "The Comedy Central Roast are usually just an opportunity to squeeze the lowest common denominator with the least amount of thought, and this proves no different. Firstly--the majority of the jokes just weren't funny. Of course, I've never been that impressed with any of the assembled comedians, anyway. And really, the roastee shouldn't be funnier than the roasters--and bless'em, the Shat-man truly was. I do enjoy some vulgar humor but it is over-used here to a non-impressive effect. Poor Farah Fawcett was out of place and probably just selected for an opportunity to be the brunt for some easy jokes. Kevin Pollak was probably the best, but it was just a recycling of Shatner jokes we've all heard before. Artie Lange and Patton Oswalt also lent a little to the proceedings, but really not enough to salvage this work. I did at least learn how to pronounce George Takei's last name.",
         "I've been watching a few of the Comedy Central Roasts and there is very little clever or witty about them. I love comedy but these roasts, in my opinion, are the height of vulgarity and classlessness. They take cheap shots and use the crutch of vulgarity, profanity and crudeness to the extreme and frankly I don't think anyone in the room finds it funny, the smiles and laughter is forced. There is nothing more lame and pathetic when a comedian or anyone has to resort to using words like p**ss, c**nt, C**ck, and more over and over again - it screams - I don't really have anything clever to say. These roasts are nothing but schoolyard bullying but in front of a TV and wearing fancy clothes and drinking alcohol to blot out the disgust. Furthermore, after a few jabs at the beautiful Farrah Fawcett, is it just me or has anyone else noticed that shortly after William Shatner's roast she got cancer? Coincidence? I think not. At some level she had to have been disgusted, as I was, with the whole thing and her body reacted accordingly. Entertain us, I don't mind, I'll pay for entertainment, but these roasts have got to stop.",
         "Former Shatner co-stars Leonard Nimoy and Heather Locklear showed good judgment in not appearing at this disaster. For that matter, so did Candace Bergen and James Spader. In my book, Betty White lost 20 points on the class scale for her contribution. It is sad and pathetic when most of the \"roasters\" on stage are people who never appeared, never worked with or never even met the \"roastee\" - in this case William Shatner. The obnoxious phrase \"rip a new one\" must have been used 40 times. The homosexual humor was endless. From \"THE MAKING OF\" segment on the DVD, it was clear that the producers set the ugly tone trying to push Betty White and others to be as crude as possible. Host Jason Alexander - who can be a talented actor and comedienne - was funny when his jokes were about Shatner and his work but as JA crossed the line so many times, he became increasingly pathetic. Worst of the bunch - Lisa Lampanelli - aka PIG IN A WIG. Shatner summed it up best at the end when he said how disappointed he was that the roasters weren't very funny and that his long career was ample fodder they could have worked with. Comedy Central goes way overboard in trying to draw an audience and this POS excuse for a program takes it to the nth degree. A waste of 90 minutes.",
         "The Comedy Central Roast of William Shatner is a long series of unfunny comedians who are more interested in seeing if they can drive anyone off stage than in actually saying or doing anything that can be remotely construed as funny. Now, a Roast is not meant to be polite. A roast can and should run the gamut from rough to appalling. But watching Andy Dick trying to gross out everyone by running his tongue over anyone who would hold still for it is not funny. Watching Farrah Fawcett try to get through her canned jokes without breaking up is not funny. As for Lisa Lamparelli, her best line was noting that her career was dead, but she could still get a gig on Comedy Central doing roasts. Indeed she can, so long as there is no requirement that she be funny. Nor do any of these 'comedy' bits have anything to do with William Shatner. There is much about William Shatner's career that could have served a roast well: Shatner's egotism, his spreading waistline, his propensity for overacting. Yet no one was terribly interested in the subject of William Shatner. Largely, the 'comedians' were interested in themselves and the apparent belief that all transgressive behavior is funny. Most of the barbs consisted of \"You're fat and have no talent, William Shatner, now I'm going to vomit on the stage, and I love you, Bill.\" The one good routine starts the show, with a rcorded 'telephone conversation' between Shatner and Leonard Nimony, in which Shatner urges Nimoy to show up, saying it will be fun, and Nimoy saying 'Don't do it.' My hope that, after an amusing start, something good would turn up some time in the proceedings was never justified for more than fifteen seconds. Nimoy's routine, alas was correct. Shatner stayed for the entire show. Don't you.",
         "I'm a huge Star Trek fan and a fan of Bill Shatner in particular. I think it's really impressive what he's done to re-inject life back into his career, winning Emmy awards for his performance in Boston Legal. Plus I love his self-effacing sense of humor. So when I heard there was going to be a \"roast\" in his honor, I eagerly looked forward to it. Man oh man was I disappointed. Actually disgusted would be a better word to describe this travesty of a show. It started out quite funny, with a phone conversation between Shatner and Leonard Nimoy, who tried to talk Bill out of appearing on the show because \"they roast PIGS\". The exchange was lively and fun, and as it turned out Nimoy was right (unintentionally) and Shatner's description of the show as bringing together comics that no one has ever heard of and \"ex-hotties\" was woefully accurate... The show was, in a word: vile. Among the \"roasters\" were Nichelle Nichols, Betty White (???), Farrah Fawcett and George Takei. It was hosted by Jason Alexander. There were also a number of comedians including Fred Willard, Kevin Pollock (who does the best Captain Kirk impression on the planet), and Andy Dick (who I loathe). Beyond that there were a bunch of no-names and it was a mystery to me why they were there, except that maybe Comedy Central wants to boost their careers. The short version is that I felt like I was sitting through some sort of sex education/anatomy class at it's most vulgar. I'd have to say 8 out of 10 jokes had something to do with genitalia or sex (mostly homosexual) and there was plenty of dialogue that had to be bleeped out. Much of the humor was based on George Takei's recent \"outing\" of himself as gay, and it was done in excruciating sexual detail. I'd also say that 90% of the \"roasting\" was directed at the co-roasters with a minor 10% directed at the guest of honor, Bill Shatner. It almost seemed like an afterthought. I didn't tune in to see a bunch of unknown comics insulting each other with private jokes! Also depressing was seeing the likes of Nichelle Nicholes and the venerable Betty White stooping to gross sexual humor in this venue. I was taken aback that they would stoop to that level to be what, considered \"cool\"? To be honest I couldn't even finish watching it. When I tuned in I had images in my head of roasts from way back when with the likes of Dean Martin, Joey Bishop, Foster Brooks, etc. poking fun at some celebrity friend. Back then it was funny and had an edge to it, but they did it with some sense of class. Believe it or not, it is possible to roast someone and be funny without resorting to describing a prostate massage or other things I won't repeat here. As far as I'm concerned the humor reminded me of what you might overhear around a bunch of 14 year old boys. It's much more difficult but funnier when you get a laugh without resorting to vulgarity, in my opinion. I mean some of it made the audience (and myself) cringe more than laugh. Much of it was obviously done more for shock value than actual laughs. What I found especially interesting was that the LEAST amount of time was given to the guests who were the least vulgar. If you blinked you would have missed Kevin Pollock's very funny bit that was inserted almost as filler.",
         "My god, this was a gut-bustingly funny roast! Of the Comedy Central roasts that are available on Amazon Video, I think that this one is the best. While recently they have resorted to roasting people who perhaps haven't had enough of a career to warrant being celebrated this way (which is technically what this is supposed to be). Fortunately, Shatner is not a flavor-of-the-moment celebrity who happens to have done a bunch of stupid stuff with which to throw in his face. He earned his spot here. Everything is touched upon, from his unique acting style, singing career(?!), commercials, relationships with his fellow Star Trek cast members, etc. Yes, the humor was heavily scatological, but I've come to accept that as a fact of modern comedy, with these roasts in particular. On top of that, this has what is surely the best dais of all 15 Comedy Central roasts. If you're very selective about what you buy or watch (at least in terms of these comedy specials), the William Shatner roast is definitely one to get.",
         "This show is absolutely hilarious. It is nonstop laughter with arguably the greatest B actor in Hollywood history as the target for some of the most outrageously funny barbs ever uttered in a television show. What makes this show particularly amusing is that the guest roasters are spoofing an actor who is not one of the great performers but nevertheless has managed to become one of the most well-known stars in history which is an ongoing theme of this show. The one-liners come on fast and furious. Betty White is especially funny and George Takei is great. In fact this roast is spoof on the Hollywood roasts of the past except this one is a lot funnier and includes the kind of comments that makes the roasts of the past seem tame in comparison.",
         "I am a fan of TV shows and films such as South Park that are considered offensive and disgusting but this 'Roast' was just an excuse for swearing, vulgar sex jokes (if you can call them jokes) and smut. I watched this with high hopes, I am a huge William Shatner fan and for me this was just a kick in the teeth, there was absolutely no need for it, a roast is supposed to be funny, it's supposed to be friends of the roasted poking fun at them and there career not saying things such as \"i caught the bouquet at Bill's wedding, I hope to catch the cock ring at sulu's' that was aimed at George Takei and was probably the tamest of the Roast (I don't want to put the worse ones on here). Sure there were the odd funny moments but way to few and far between. Waste of time if you ask me. Watch this only if your comedy preferences are of vulgar toilet humor that to me only a young immature teen would find at all funny.",
         "Putrid beyond belief. Avoid this at all costs, especially while eating. It will literally turn your stomach. Greg Giraldo, I never heard of you before, and, after watching this travesty, I shall avoid ever watching anything with you in it for the rest of my life. I have never, ever seen such disgusting, mean, vulgar remarks masquerading as \"humor.\" You should be ashamed of yourself. And aside from his remark about Incubus in Esperanto, Jason Alexander wasn't much better -- not a funny remark to be found, just crude insults, mostly directed at other attendees. I remember the old Dean Martin roasts, and Jason Alexander, you are no Dean Martin. Those old roasts had plenty of insults, but they were clever, and everyone knew they were meant in jest, mostly. The results were hilarious, and masterfully delivered. This Comedy Central updated version is not worthy of the name \"roast.\" I'm sorry, but even Betty White's remarks were in bad taste. As to the rest of these nobodies: Andy Dick, Clint Howard, Lisa Lampanelli, Artie Lange, Pierangeli Llinas, Craig J. Nevius and Debra 'Debbie' Clark, may you all roast in hell. Surely, there was plenty of fodder for humor in William Shatner's long career, beginning with his appearances on The Twilight Zone, but it is obvious that none of these bozos ever saw Shatner's old work, and it is not obvious that they had even heard of him before that evening. If they had, they weren't intelligent to come up with anything witty and pertinent to say. What astonishes me is this travesty actually had \"writers,\" and they were willing to have their names listed in the credits! So, here they are: Michael Ferrucci, Mathew Harawitz, Joe Kelly, Aaron Matthew Lee, Michael Rowe, Chad Zumock. May you spend eternity in the TV Hall of Shame. And then there is director Joel Gallen. After looking at your credits, I can see why I've never heard of you before. What truly amazes me is how many of your productions are dominated by votes of 9 or 10 stars! So, Joel, how much did it cost you per vote? You are so pathetic, it's pitiful, and out of pity I have changed my vote from 1 to 10. If you liked this roast, you will love the \"Comedy Central Roast of Flavor Flav,\" rated 7.3, featuring insults from Greg Giraldo, Snoop Dogg and Ron Jeremy. Note to Comedy Central: Clever insults from Jimmy Stewart are funny, stupid, obscene insults from a-hole scum b-gs aren't. (Are we laughing, yet? Aren't mean-spirited comments hilarious? When do I get paid for being a \"comedy\" writer?) As to the audience, if they had any sense of decency, they would have walked out. Heck, if I were Shatner, I would have walked out. But you can't do that when you agree to a roast. Shatner knew what was going on when he called the assemblage \"nobodies.\" But, sadly, he resorted to crude obscenities, too. So, don't bother with this, unless it is shown on broadcast television during primetime -- then it would be only about five minutes long.",
         "It is William Shatner's turn to step in to the celebrity hot seat for the latest installment of The Comedy Central Roast... I love Shatner, and his career is the stuff of legends. I enjoyed his roast, but sadly, it just does not seem to hold up strongly for the full time frame... Betty White was great to see, but even the normally funny Patton Oswalt did not have his heart in this. And the jokes were repetitive. A career of 50 years, and we have to keep going over the same \"Star Trek\" humor and references to \"Rocket Man\"? He was so much more than that. Where were the gremlins on the wing? Lastly, Jason Alexander is a terrible host. I am so glad that Seth MacFarlane seems to have taken over the job on a semi-permanent basis.",
         "A night of comedy where everyone sends you up for the long career you have had in whatever your field of entertainment is, i.e. take the Mick of you, first emerged in America, and then it went to Britain. This show, hosted by Jason Alexander, has the victim being Captain Kirk from Star Trek, star of T.J. Hooker and general actor, William Shatner. The comedians and stars roasting him in the show included Sandra Bullock, Andy Dick, Farrah Fawcett, Clint Howard as Balok, Jimmy Kimmel, Artie Lange, Leonard Nimoy (in the funny opening scenes), Kevin Pollak, Sarah Silverman, Ben Stiller, George Takei, Betty White and Fred Willard, and look out for David Carradine, Carrie Fisher, Jeri Ryan and Brent Spiner. It was nominated the Emmy for Outstanding Variety, Music or Comedy Special. Very good!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Comedy Central",
         "Tenth Planet Productions"
      ],
      "summaries": ["It's William Shatner's turn to step in to the celebrity hot seat for the latest installment of The Comedy Central Roast. A parade of Shatner's friends have gotten together to boldly go where no one has gone before: on William Shatner's sh*tlist. Tune in as some of Shatner's closest friends hang out, have a few drinks, listen to a live performance by one of the hottest bands around, and then spend ninety minutes ridiculing and insulting the man behind Captain Kirk. So sit back and enjoy the night of insults as Shatner's tries not to lose his cool - or his toupee!"],
      "budget": 0
   },
   "movielensId": 134706,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-08-20",
      "dvdReleaseDate": null,
      "directors": ["Joel Gallen"],
      "runtime": 90,
      "movieId": 134706,
      "title": "Comedy Central Roast of William Shatner",
      "mpaa": "",
      "actors": [
         "William Shatner",
         "Jason Alexander",
         "Andy Dick",
         "Farrah Fawcett",
         "Greg Giraldo",
         "Lisa Lampanelli",
         "Artie Lange",
         "Patton Oswalt",
         "Kevin Pollak",
         "Jeffrey Ross",
         "Nichelle Nichols",
         "George Takei",
         "Betty White",
         "Fred Willard"
      ],
      "imdbMovieId": "0840305",
      "originalTitle": "Comedy Central Roast of William Shatner",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "It's William Shatner's turn to step in to the celebrity hot seat for the latest installment of The Comedy Central Roast. A parade of Shatner's friends have gotten together to boldly go ...",
      "tmdbMovieId": 296194,
      "avgRating": 2.9,
      "releaseYear": "2006",
      "numRatings": 20,
      "posterPath": "/skPSOqgx3hTiZNBbY32MpGEzyA1.jpg"
   }
}