{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0061556",
      "video": false,
      "title": "The Deadly Affair",
      "recommendations": [
         45888,
         45817,
         4889,
         87417,
         267523,
         259231,
         11225,
         96171,
         71402,
         115162,
         32088,
         71910,
         46335,
         183859,
         184795,
         151823,
         46358,
         26652,
         35001,
         118487
      ],
      "backdrop_path": "/84G0PJjXc3uGu8UyVsaAGvyRCr8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charles Dobbs",
               "gender": 2,
               "credit_id": "52fe46159251416c7506c9fd",
               "name": "James Mason",
               "profile_path": "/b0ebmboBdaYvk8fn2CFCQl4TaW9.jpg",
               "id": 2091,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elsa Fennan",
               "gender": 1,
               "credit_id": "52fe46159251416c7506ca01",
               "name": "Simone Signoret",
               "profile_path": "/vRI2Vt3HX911uDrVK170waQsL8b.jpg",
               "id": 12266,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dieter Frey",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca05",
               "name": "Maximilian Schell",
               "profile_path": "/xhjyQpOmwDwU48Kq2b1XCEO9G7E.jpg",
               "id": 12150,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ann Dobbs",
               "gender": 1,
               "credit_id": "52fe46169251416c7506ca09",
               "name": "Harriet Andersson",
               "profile_path": "/p3U48qquE945jWv5EmlARImOhCr.jpg",
               "id": 7569,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Inspector Mendel",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca0d",
               "name": "Harry Andrews",
               "profile_path": "/1EJXH5DyJWDtHfX8MeqSrCrUlwD.jpg",
               "id": 19463,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bill Appleby",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca11",
               "name": "Kenneth Haigh",
               "profile_path": "/iOwADz2JMTb2VMG7k3wZj3ZVoZK.jpg",
               "id": 53817,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Adam Scarr",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca15",
               "name": "Roy Kinnear",
               "profile_path": "/vPG07Lh06DuUlpcd8evvJjAGq8k.jpg",
               "id": 3463,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Adviser",
               "gender": 0,
               "credit_id": "52fe46169251416c7506ca19",
               "name": "Max Adrian",
               "profile_path": "/nIOM0almTubhJ4bCq2NG113PQVf.jpg",
               "id": 77312,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Virgin",
               "gender": 1,
               "credit_id": "52fe46169251416c7506ca1d",
               "name": "Lynn Redgrave",
               "profile_path": "/jnXKuScyfE4zZ5AqBpmrVBMKeVz.jpg",
               "id": 29791,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Samuel Fennan",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca21",
               "name": "Robert Flemyng",
               "profile_path": "/op5oO4MHBO56aDozThTlbo4dLvG.jpg",
               "id": 41958,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Inspector",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca25",
               "name": "Leslie Sands",
               "profile_path": null,
               "id": 77314,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca29",
               "name": "Corin Redgrave",
               "profile_path": "/wKQDlEJBUkuz8vPYirhNXyKxdEZ.jpg",
               "id": 13328,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca2f",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca35",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca3b",
               "name": "Paul Dehn",
               "profile_path": null,
               "id": 9916,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46169251416c7506ca41",
               "name": "John le Carré",
               "profile_path": null,
               "id": 20422,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca47",
               "name": "Freddie Young",
               "profile_path": null,
               "id": 10079,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe46169251416c7506ca4d",
               "name": "Thelma Connell",
               "profile_path": null,
               "id": 35839,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46169251416c7506ca53",
               "name": "Quincy Jones",
               "profile_path": "/mV7hXHeUSXV7KZEfsxJ8lMrKpAt.jpg",
               "id": 13301,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "56cc64c2c3a36865d900289b",
               "name": "Denis O'Dell",
               "profile_path": null,
               "id": 10589,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "56cc64de92514124550027af",
               "name": "James Liggat",
               "profile_path": null,
               "id": 2288,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56cc6503925141245a0026fb",
               "name": "John Howell",
               "profile_path": null,
               "id": 40356,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56cc65139251412452002780",
               "name": "Cynthia Tingey",
               "profile_path": null,
               "id": 39745,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "56cc652ec3a36865e100281a",
               "name": "Gerry Humphreys",
               "profile_path": null,
               "id": 24680,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "56cc6558c3a36865d90028a8",
               "name": "Les Hammond",
               "profile_path": null,
               "id": 1370816,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "56cc656ec3a36865e90027a9",
               "name": "Chris Greenham",
               "profile_path": null,
               "id": 1405343,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56cc65c7c3a36865ef002712",
               "name": "Brian West",
               "profile_path": null,
               "id": 43803,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56cc65e6925141246400269c",
               "name": "Jock Napper",
               "profile_path": null,
               "id": 1581835,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 1,
               "credit_id": "56cc6602c3a36865eb002b46",
               "name": "Betty Glasow",
               "profile_path": null,
               "id": 404709,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56cc6611925141245200279f",
               "name": "Jill Carpenter",
               "profile_path": null,
               "id": 1276586,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.848932,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 14755,
      "vote_count": 22,
      "budget": 0,
      "overview": "Charles Dobbs is a British secret agent investigating the apparent suicide of Foreign Office official Samuel Fennan. Dobbs suspects that Fennan's wife, Elsa, a survivor of a Nazi Germany extermination camp, might have some clues, but other officials want Dobbs to drop the case. So Dobbs hires a retiring inspector, Mendel, to quietly make inquiries. Dobbs isn't at all sure as there are a number of anomalies that simply can't be explained away. Dobbs is also having trouble at home with his errant wife, whom he very much loves, having frequent affairs. He's also pleased to see an old friend, Dieter Frey, who he recruited after the war. With the assistance of a colleague and a retired policeman, Dobbs tries to piece together just who is the spy and who in fact assassinated Fennan.",
      "similar": [],
      "original_title": "The Deadly Affair",
      "runtime": 115,
      "poster_path": "/7UNbXips8TUZ1RTrRudRZ3FTRSh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Sidney Lumet Film Productions",
         "id": 2964,
         "origin_country": ""
      }],
      "release_date": "1966-05-13",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney Lumet"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "John le Carré",
         "Paul Dehn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061556/",
      "coverLink": null,
      "actors": [
         "James Mason",
         "Maximilian Schell",
         "Simone Signoret"
      ],
      "reviews": [
         "Much-touted mainstream entry recommended to serious spy buffs as a well-crafted, bleak treatise on perceived realities. Deeper than many other spy films, the pleasure is derived from sifting through the strata of meaning in John Le Carre's story and reveling in the fine performances and top-notch film making. This is one of those movies where you'll recognize all the actors; Harry Andrews, Roy Kinnear, Robert Flemyng, Lynn Redgrave, David Warner, etc. One standout is Simone Signoret as Elsa, a woman without a country, who scorns Dobbs and his attempts at clearing up the death of her husband. A concentration camp survivor, Elsa has no illusions about patriotism nor allegiances in that regard, remarking to Dobbs `I am a battlefield for you\u0085 toy soldiers.\" Quincy Jones plays some fun cinematic tricks with the soundtrack (Astrud Gilberto sings the theme song) and it is appropriately melancholy for the material. Director Sidney Lumet is in fine form here and through the half-light of Freddie Young's cinematography is revealed the gray world beneath our intricately constructed lives.",
         "A complex, suspenseful, and sometimes surprisingly funny spy thriller by master director Sidney Lumet (\"12 Angry Men\", \"Long Day's Journey Into Night\", \"Dog Day Afternoon\", \"Running on Empty\"). The picture has a really brilliant cast, including James Mason, Simone Signoret, Maximilian Schell, Harriet Andersson and Harry Andrews. The photography is interesting too. Lumet and cinematographer Freddie Young used a technique called \"preflashing\". In his book \"Making Movies\" Lumet writes: \"Thematically it was a film about life's disappointments. I wanted to desaturate the colors. I wanted to get that dreary, lifeless feeling London has in winter. Freddie suggested preexposing the film.\" Lumet's approach in \"The Deadly Affair\" (1967) is perhaps even a little too realistic to make it a suspense masterpiece. But nevertheless you should really see this little gem.",
         "The Deadly Affair was the top half of a double bill on TVO, with The Spy Who Came In From the Cold, and I enjoyed it much more than the drab, monotonous Richard Burton vehicle. Sidney Lumet gathered the best English actors--Mason, Harry Andrews, Kenneth Haigh (who originated Jimmy Porter on stage), Roy Kinnear, Max Adrian, and many more, adding to them Simone Signoret, Maximilian Schell and Harriet Andersson: what a star-studded cast. Lumet keeps the action flowing adroitly; he brings the Harriet Andersson character into the story, rather than showing her in flashback as le Carré had done in the novel. All in all, it's a solid piece of entertainment. If you are a fan of Harry Andrews, as I am, you will relish the way he makes the retired policeman Mendel his own. The narcolepsy, the scene with the rabbit, the bar scene with Roy Kinnear, they are all wonderfully played. I could say that Mason is Andrews's foil, rather than the other way around. Simone Signoret is the wrong physical type for Elsa, but she manages to bring some real venom to her dialogues with Mason.",
         "As with all 1960's films, time hasn't been kind to this clever slant on the cold-war theme. However, one can imagine that at the time of its release, the film's stylish direction, cool bossa nova soundtrack and unusual filming technique was very \"in vogue\". Unfortunately, the then unrelenting interest in James Bond and Harry Palmer has meant that The Deadly Affair is one of these little known, understated thrillers that are shown late at night on satellite TV. The film's gloominess is intentional - the film having been deliberately exposed briefly to make the colour appear dull. You could say that this reflects the frustration and despondence of the main character, Dobbs. James Mason, who always seems to be cast as the down-trodden tragi-hero, plays Dobbs with consummate ease. He is supported by a long list of familiar faces including Harry Andrews as an unassuming retired policemen. The best part of the film for me is when Fannen is tailed by Mendel during a lengthy chase on foot through London. An elongated version of Quincy Jones' theme tune provides the right level of excitement to what would initially be quite a staid scene.",
         "For an espionage thriller I like a lot, The Deadly Affair is also one of the most frustrating. The movie is based on John le Carre's first book, Call for the Dead. It introduced his readers to George Smiley. For some reason, in addition to changing the name of the book, director Sidney Lumet changed George Smiley to Charles Dobbs (James Mason). I'll continue to call him George Smiley. The story is how this aging British spy with a quiet manner and a shrewd mind finally learns the identity of an East German spy. It starts when Smiley is asked to investigate a mid-level foreign officer, Samuel Fennan, who has been accused in an anonymous letter of being, at best, a Communist sympathizer. Smiley determines that the man is not a danger, but shortly after the man commits suicide...yet he left a wake-up call for the next morning. Smiley's boss tells him to drop it. Smiley won't, quits, and enlists the help of a retired police inspector, Mendel (Harry Andrews), to help him. Smiley meets the man's wife, Elsa Fennan (Simone Signoret), a survivor of Nazi death camps where experiments were performed on Jewish women. He knows something is off and slowly tries to identify just who is the spy, if there really was one. All this while he must deal with his younger wife, Ann (Harriet Andersson). Smiley loves Ann and she may love him, but she is a serial adulterer and all he can do, apparently, is agonize over their relationship. It doesn't help when a younger man, Dieter Frey (Maxmilian Schell) arrives on the scene from Europe. Frey worked under Smiley in some dangerous operations during WWII and Smiley sees Frey almost as a son as well as a friend. It isn't long before Smiley learns that Ann is bedding Frey. And there is still the spy for Smiley to catch. Lumet has directed some fine movies, and he's great with actors, but he's done a lot of flawed movies, too. With The Deadly Affair, those flaws seem magnified. First, the angst and conflicts of Smiley's relationship with his wife is a major part of the story...and it's like reading an agony column over and over. Nothing changes the impression that Smiley must be impotent and that Ann is a nymphomaniac. We're given scene after scene of the two of them emotionally baring their souls without either of them willing to identify what the problem is. Second, this means that Mason and Andersson have a series of \"acting\" moments that brings the spy story to a screeching halt. It isn't helped that Signoret as Mrs. Fennan also is given two major, teary \"acting\" scenes. Her scenes help advance the plot a bit and help us understand her, but they're basically designed by Lumet to give Signoret a change to do her stuff in close-up. Third, because of all these actor moments, the film lurches from story point to story point. One moment we're getting much involved in the spy story and how Smiley is prizing out the secrets, then we stumble into a scene where good actors are given far too much opportunity to emote. Fourth, there is a gratuitous death that serves no purpose than, as in so many Sixties and Seventies films, to make the audience think they must be watching a really serious movie. Fifth, there is an obtrusive and very with-it score by Quincy Jones that says \"the Sixties\" loudly. It doesn't fit the quiet George Smiley at all. Even with all this, The Deadly Affair is a favorite of mine. The mood of the movie is somber but it's not dull. The plot is clever and twisting, with a minimum of required violence. Figuring out the killer isn't too hard. Figuring out who is a spy, why and why the anonymous letter about Fennan that started everything takes some thinking. The acting, even with all the marital angst, is high caliber. James Mason as Charles Dobbs aka George Smiley gives as fine a performance as I've ever seen. He agonizes over his relationship with Ann while refusing to give up on learning the real story behind Samuel Fennan. Signoret may have been indulged by Lumet for those acting moments, but she never the less is a force to be reckoned with. Harry Andrews as Mendel is terrific as the literal and resourceful counterpoint to the cerebral and clever Smiley. All the secondary roles are well-crafted. For trivia collectors, watch the scene in the theater when a major character, seated in the full house, is killed. On stage is the Royal Shakespeare Company performing Marlowe's Edward II. While our killing is taking place, so is the killing of Edward, played by no less than a young and unbilled David Warner. The Deadly Affair is definitely a mixed bag. For those who admire James Mason and also early le Carre, it's worth having.",
         "A John Le Carré-based Cold War spy film will always challenge an audience with an unflinching look at the world of espionage, and confront viewers with its most unpleasant facts; true stories of manipulation and deceit where the simplistic, Manichean scheme \"good guys versus bad guys\" is exposed as deceitful and manipulative. Sidney Lumet (\"The Verdict\", \"Dog Day Afternoon\", \"Q and A\") added another feather to his cap directing this 1966 adaptation of \"Call for the Dead\", which features an international cast headed by James Mason, Maximilian Schell, Simone Signoret (not De Beauvoir, who was an Existentialist author, not an actress)and Harriet Andersson. In true Lumet fashion, characterization does not take a back seat to plot development: Mason brings his masterful touch, an understated yet poignant despair to his doomed agent Dobbs; Schell manages to come across as debonair and sinister at the same time, and world-weary Signoret eloquently speaks for the victims who were tangled up in Cold War power games. The Bossa Nova soundtrack, full of sad sensuality, creates an innovative contrast to the bleak, rainy London streets where the web of deceit is torn in a violent and realistic showdown. Excellent supporting performances by actors Harry Andrews and Roy Kinnear help make \"The Deadly Affair\", many years after its first viewing, a somber and masterful look at Cold-War espionage and a fine example of serious movie-making.",
         "The only reason I have cable is for Turner Classic Movies, and the chance to see, uncut, unedited, uninterrupted; flicks like this. The film is as stated very leisurely paced, but good (bordering on great) performances, a taut, very adult script, and an absolute joy of a soundtrack by the great Quincy Jones keep you watching. Makes this a leisurely stroll you enjoy taking. Listen to the music in the scenes between James Mason and his erstwhile wife [I won't even tell you what's going on between those two, it's just one of the most understated treatments of this subject, and that understatement gives it an outrageous power, as you are just completely agape at James Mason's... restraint] , Quincy is doing magical things. A movie where the parts, make the sum worth watching. Recommended.",
         "This enjoyable film captures the spirit of Le Carré's first novel very well. Lumet and Young's \"preflashing\" technique and their cinematic sensibilities fill the screen with the proper gloomy Sixties British atmosphere--in the weather, in the exterior scenes, in the sets, and in the characters' emotions and interactions. Mason is outstanding as George Smiley (inexplicably renamed Charles Dobbs), portraying with fine nuance both Smiley's wounded, bewildered angst and his gift for tradecraft. A treat for fans of Le Carré and of the genre.",
         "Glum London backdrops and washed-out color match British secret agent Charles Dobbs' (James Mason) despair at the infidelity of his nymphomaniac wife, and the possible murder of a likable and idealistic Foreign Office civil servant. Slightly dated yet still exciting cold war spy thriller combines the talents of James Mason, Sidney Lumet, and a fine supporting cast, though John LeCarre might wonder what happened to the novel the movie is based on. There isn't a hint of 'Swinging London'; the relationships and a gay subtext, played out on several levels, are handled maturely and without an invitation to snicker.",
         "A gloomy (and gloomily lit) but very interesting spy thriller of the 60's,with a fine performance by James Mason(as Charles Dobbs,but George Smiley in all but name),and good support from Simone Signoret(convincing as a Concentration Camp survivor),Harry Andrews,Kenneth Haigh,Roy Kinnear and Max Adrian.As an answer to the artificial,antiseptic glamour of the James Bond extravaganzas,THE DEADLY AFFAIR works very well for the most part,with an intelligent script compensating for the occasionally over-prolonged and too static dialogue exchanges between the principals.The production is set,deliberately,in dismally unattractive,murky interior and exterior locations around London,though this oddly gives the film more atmosphere,and is also helped by a haunting score by Quincy Jones,one of the best and most criminally underrated of his career. The film only drags a little in a sub-plot involving Mason's nymphomaniac wife,played somewhat uncomfortably by Harriet Andersson.The film would have worked equally well if not better had Ms Andersson been a decent,devoted spouse,and Maximillan Schell is given little to do as an old wartime colleague (and as it turns out,yet another of Mrs Dobbs' lovers) of Dobbs.But for the most part,American Sidney Lumet does a first-class job as an outsider's look into British/European espionage,and it grips solidly throughout. RATING:7 and a half out of 10.",
         "This is actually a very good spy thriller. It's one of my favorites. The movie is suspenseful, the action is good for its time, and the acting is excellent. Some may find it too slow for today's tastes, but action, spectacle and a really fast pace don't help a movie if there's not an interesting plot and story, with well developed characters. If you watch the movie with that proviso, you should enjoy it. It is, however, from a John Le Carre novel, so it's a more cerebral thriller, but that's good. Thus, the movie belongs in the category of THE IPCRESS FILE, THE SPY WHO CAME IN FROM THE COLD and THE ANDERSON TAPES rather than James Bond.",
         "Due to one of those internicene cock-ups Paramount 'owned' the name of George Smiley, a character who cropped up in several John Le Carre novels, so here he is renamed Charles Dobbs and portrayed by James Mason (who gets to keep the nymphomaniac wife, Ann the Le Carre created). That epitome of minimalist acting Simone Signoret walks away with the film despite appearing only four times - and in two of those she remains silent) and had she been able to drag the rest of the cast up to her level we'd be talking ten out of ten. As it is the rest of the cast acquit themselves more than admirably making this Cold War thriller well worth revisiting.",
         "Rather than delve into the complex plot machinations already delineated by other reviewers, I would rather touch on other, more understated, qualities present in this excellent fare. Firstly, the ever so poignant soundtrack by Quincy Jones, with its bossa-nova flavored, mesmerizing, soulful backdrop lends an atmosphere of sophistication and class that, to me, is a most essential adjunct to a wonderfully subtle, yet crisp, plot and character development. Secondly, the gut-wrenching performance by Simone Signoret in the scene at her house with James Mason was totally masterful. She totally lambasted the phony pretexts of war and its concomitant warriors, albeit the Great Wars or the more subtle yet equally deadly Cold War, as a bunch of busy-body bureaucrats shouting sanctimonious slogans and sound bites to buttress their flavor-of-the-month, tenuous political positions! In addition, each of the other actors, especially the lead, James Mason, carries out the demands of his/her respective role with understated finesse. This must be in no small part attributed to the overall thrust of the film: subtle color overtones not only of the film tones, but also the subtlety and understatement of the entire story line and plot development itself. Filmed in an era of James \"Bondish\" quasi-slapstick and technical gimmickry, \"The Deadly Affair\" comes across as an intelligent counterpoint to some of the slick, in-your-face cinematic fare of that period, whose motto might indeed be characterized as a \"triumph of form over substance\". I hope for the day when, if ever, this film gets released onto DVD format. It is a true gem of the Cold War genre and a true \"triumph of substance over form\"!",
         "debblyst who reviewed this film makes the point that Lumet took the author too seriously therefore damaging the film version of his novel. I would counter that and make the point that Lumet has in fact done a superb job and anyway how can you make a Le Carre script more serious than the very thorough author.Also the suggestion that Lumet is not a Costa Gavre is true he is much better than that. Also to say that the female cast is wasted is nonsense Simone Signoret is outstanding.What we have here is a film about intrigue, murder and based on those two issues this film is up there with the Ipcress File and the spy that came in from the cold.Harry Andrews & Roy Kinnear are absolutely top notch and Mason & Schell play their roles with great authority, Harriet Anderson seem strangely vulnerable in her role as a nymphomaniac wife, all in all a truly superb film. I cannot agree with Debblysts comments at all.",
         "This film is very close to Le Carre's \"Call For The Dead,\" a short novel and a great read. George Smiley becomes Cobb in this film version (why?). It is satisfying to read an excellent novel of this genre and see a film which follows it so closely. James Mason is not exactly my idea of George Smiley, and his wife, Ann is certainly not like the image we get in \"Tinker, Tailor, Soldier, Spy.\" A sluttish nymphomaniac, yes, but not a nymphet. Maximillian Schell is a great Dieter, and Harry Andrews is perfect as Inspector Mendel. The settings are just right, and there is a rattling good fight to the finish between George and Dieter that is most satisfying. One of the best of the genre. Too bad we can't get it on DVD or VHS. We were lucky to see it on the Turner Classic channel. John W. Hall",
         "I've only just seen this film recently on television so have unfortunately missed out on seeing it in its full cinema glory. This film straight away became one of my favourite films. It manages to be suspenseful and keep a good pace throughout, with a number of fairly clever plot twists. The casting is superb with James Mason playing the lead role, a not-so-secret agent who has been asked to investigate the mysterious suicide of a civil servant he met only the day before. The entire film is set in London at the time the film was made (1967) and manages to bring to life 60s London without all the stereotypical sixties parties, drugs etc. A very believable Cold War plot, with more depth than most other espionage films and definailey more than any Bond film, helps make this film so good to watch. The story also gives you an insight into the protagonists strange life and cleverly manages to link his life into the main plot. If you haven't seen this film I urge you to, its well worth seeing.",
         "This film is a time-tunnel trip to the Cold-War-Espionage movie boom that began in 1965 with the big hit \"The Spy Who Came in from The Cold\" and lasted through the early 70s. A thriller with schematic political innuendos, not hard to guess plot twists, and then racy sex issues (nymphomania, just mentioned very obliquely of course). All of it based on the novel by then-omnipresent John Le Carré -- the thinking man's answer to Ian Fleming -- featuring a cliché bossa-nova theme moodily sung by Brazilian Astrud Gilberto, a jazzy score by Quincy Jones and a classy international cast. This is from the time when thriller plots were supposed to be \"honest\", meaning that it gives us clues to actually guess the denouement (very unlike today, when plot twists are so far-fetched you just give up). A film from a time when we, common spectators, could still grasp the shady games of international espionage and counter-espionage. The trouble with \"The Deadly Affair\" is that it's VERY ponderous and talky, but the real shame here is the waste of the female cast. While the boys have fun with their roles, the two leading ladies, both luminous actresses, were treated badly. Simone Signoret's face is always fascinating, but her role is underwritten, unexplored and she sleepwalks through it. And what to say about poor Harriet Andersson? She -- whose work for Ingmar Bergman included her tour-de-force as schizophrenic Karin in \"Through a Glass Darkly\" -- is completely miscast, badly dubbed, badly photographed, badly directed. It's probably her worst performance ever! This film won't harm you on a cold rainy sleepless night - bu it has dated badly.",
         "Some nice atmosphere is created in this dated, but relatively engaging spy story. It also boasts a very fine cast of international film actors. Mason plays a British spy whose seemingly benign interview with a government official with Communism in his background kicks off a series of murders and attempted murders. He must, with the help of a few friends, unravel the baffling reasons behind the deaths all the while dealing with his comparatively young wife (Andersson) who can't stay out of other men's beds. Andrews offers wonderful support as an endearingly matter-of-fact and tough retired policeman. Schell is absolutely gorgeous as an old chum of Mason's. Signoret (looking not unlike Broderick Crawford and speaking almost to a level at which she can be heard) plays the dead man's bereaved widow. Other small parts are played by stalwarts like Haigh as a quasi-gay co-worker of Mason's, Kinnear as a slimy hood and Redgrave as a dippy, friendly stagehand. Assets include the bouncy Quincy Jones score, the muted, clean photography and the nuanced performances of the mostly solid cast. Detriments would be the somewhat sluggish telling of the story and the horrible sound levels in the film. Any and all sound effects and music are played much more loudly than any of the dialogue. The ear is assaulted by raindrops, car engines, anything, really, while the words can barely be heard in some cases. The heavy accents of many of the players only compound the problem. Also, Andersson is just plain bad as Mason's wife. The role is no good anyway, but she looks, sounds and acts horribly throughout. Still, there's enough mystery and polish in the film to hold the attention of a true film buff or a fan of Mason. Others, used to more electric and/or shoot-em-up fare will be bored silly from the start.",
         "The picture concerns upon the world of secrets agents an spies . An agent (Robert Flemyng) commits suicide and another named Charles Dobbs (a magnificent James Mason as Smiley though the character was renamed Charles Dobbs for this movie) believes to be a murder . His chief nicknamed Marlene Dietrich (Max Adrian) orders investigate it . Charles Dobbs married to an unfaithful wife called Ann Dobbs (actress Candice Bergen was the first choice to play Charles Dobbs' spouse , the part went to Harriet Andersson) is helped by an ex-police officer (Harry Andrews) . There are many suspects (Simone Signoret , Roy Kinnear , Maximilian Schell..) , who's the killer ? This interesting movie is a cold thriller plenty of suspense , mystery , tension and a little bit of violence . This is second and final screen adaptation of a John Le Carré story scripted by Paul Dehn , the first had been The Spy Who Came in from the Cold (1965) released a year earlier . Although the story gets several ingredients for entertainment , the plot is some embarrassing and flawed , the screenplay has gaps and results to be some confusing though entertaining . The film's source novel title 'Call for the Dead' was changed to 'The Deadly Affair' for this movie as this was a more commercial title . The character of George Smiley, 'John Le Carré's hero, was renamed Charles Dobbs for this movie , this was because the Paramount Studio had bought the rights to the Smiley name when they produced The Spy Who Came in from the Cold (1965). In this film, James Mason was the second actor to play John le Carré's famous George Smiley character on screen and TV . The casting is first-rate with a top-notch star-studded , specially by James Mason and Maximiliam Schell . Very good support cast , mainly formed by prestigious British actors such as Harry Andrews , Robert Flemyng , Roy Kinnear , Max Adrian , among others . This is the only film in which siblings Corin Redgrave and Lynn Redgrave both appear . Dark as well as colorful cinematography by the classic British cameraman Freddie Young , being first theatrical color movie of a John Le Carré story , The Spy Who Came in from the Cold was in black-and-White . Jazzy as well as evocative musical score by Quincy Jones . The flick belongs to spies sub-genre developed during ¨Cold war¨ and its maxim representations are John LeCarre's novels rendered to cinema in movies as ¨The spy who came in from cold¨ (by Martin Ritt with Richard Burton) , ¨The Kremlin Letter¨(John Huston with Nigel Green) and ¨Russia House¨(Fred Schepisi with Sean Connery) , these films get similar atmosphere and twisted intrigues about spies among East and west World but with no relation to spies from James Bond novels by Ian Fleming . The motion picture was professionally directed by Sidney Lumet . The story will appeal to suspense movies fans.",
         "This film is an excellent cold war espionage movie. James Mason plays the role of a shrewd and cynical intelligence operative who has a tortured personal life. His home life is hardly the picture of domestic bliss, as his beautiful wife is an incurable nymphomaniac. With respect to his professional life, Charles Dobbs (Mason) suffers the frustrations of working for superiors who are often incompetent or unimaginative. In collaboration with a retired police inspector (played by Harry Andrews), Dobbs succeeds in methodically solving the mystery related to the apparent suicide of a foreign office official. The appeal of this film can be attributed to the fact that plot elements and character development are emphasized-- as opposed to the current fascination with mindless violence and physically impossible stunts that so often typifies post cold-war films about espionage. Although I have never been especially impressed with Simone Signoret as an actress, her role as a disillusioned idealist and wife of the dead diplomat was well portrayed. In summation, I can highly recommend this underrated film to those who appreciate the acting talents of James Mason. Considering all of the mediocre films which are widely available in VHS or DVD format, I am mystified as to why this quality film has not been commercially released in the United States. MW",
         "If you enjoy bleak British spy films made in the 1960's then this movie will be right up your street, as they don't come any bleaker than this one. James Mason stars as Dobbs a British Intelligence Agent who is investigating the apparent suicide of a Civil Servant with whom he had spoken with only the day before. The bleakness begins from the very start of the film when Dobbs, in the pouring rain, goes to see the civil servant's wife who is played by Simone Signoret. As the investigation proceeds we also witness the marriage situation of Dobbs (sadly not a happy one). Harry Andrews plays a retired police Inspector who is helping Dobbs with his enquiries and their investigations take them to some rather grim areas. We also encounter a very seedy character called Scarr played by comic actor Roy Kinnear. Lynn Redgrave briefly appears in this film as a member of a drama group. It was about the same time that Mason and Redgrave also starred together in Georgy Girl - a much different film. Overall, I thought it a very good drama with the bleakness adding to the atmosphere of the movie.",
         "The meeting at a London park triggers the death of Samuel Fennan, a man being accused of being a communist spy. Charles Dobbs, had interviewed the man and based on his talk with Fennan, he cleared him from the charge. Fennan had confessed of his sympathies for the party in his youth, but he has lived to regret it. Dobbs, is shocked when he learns about Fennan's death, which appears to be a suicide. Dobbs is a long suffering man. His wife Ann, has had a long history of deceiving him. As he prepares to go to talk to his boss, Ann comes home from a night on the town. Charles Dobbs feels betrayed, but he is in love with Ann, in spite of her deceit. To add to his problems, the unexpected arrival of Dieter Frey, whose friendship Dobbs has enjoyed, sends him a message about his sudden appearance, which he ties to being involved with Ann. Dobbs realizes the mysterious death of Fennan is not what is made out to be. When he notices a car tailing his every move, Dobbs realize there was foul play in Fennan's demise. Visiting Elsa Fennan, complicates things for Dobbs. He finds a cold woman, a Jewish survivor of the camps, gives him a new angle to explore. With the help of police inspector Mendel, Dobbs sets out to investigate on his own account. The duo gets lucky in getting help from a disgruntled employee of a Home Office officer, who is key to getting to the bottom of the problem. An interesting thriller directed by Sidney Lumet. Based on a John LeCarre spy novel, the adaptation for the screen was entrusted to Paul Dehn. This film was a rarity for Mr. Lumet, who worked mainly in New York. Mr. Lumet takes the action to places where few tourists venture when exploring London. This is more of a cerebral account of the investigation. Mr. Lumet injects some laughs when he takes us to a rehearsal of \"Macbeth\" at a small theater. Then, he sets the pivotal scene where the mystery is solved by taking us to the Aldwich theater, the home of the Royal Shakespeare company during those years. James Mason makes a wonderful Dobbs, holding the viewer's interest throughout the film. The cast is wonderful. Harry Andrews is seen as Inspector Mendel, in a fine performance. Simone Signoret's Elsa is dignified in a quiet way. Maximilian Schell shows up as Dieter, a man whose friendship had to be questioned by Dobbs. Harriet Andersson, the Swedish star of many of Igmar Bergman's films plays the deceiving Ann. The supporting English cast does a fine job for the director. Freddy Young captures those out of the way places in London. Quincy Jones was the man responsible for the musical score. Not often seen these days, \"The Deadly Affair\" is a fine thriller that will delight fans of Mr. Lumet and John LeCarre's.",
         "Being one of the less familiar entries in the Lumet canon, The Deadly Affair is a superior John Le Carré spy cold war drama, based on his first published novel \"Call for the Dead\". The author's ability to infuse his characters with the necessary humanity, the flaws and melancholy of living in a world rapidly evolving beyond their control always does it for me and the same happens here. Mr. Lumet captures cold war London, describes the routine of decidedly unglamorous government agents (think 007 in reverse), tormented by nymphomaniac wives, sleepiness (\u0085) and, typical of Le Carre, confronted with the emotional frustration of questioning old friendships. Few abrupt \"Roeg-ish\" cuttings aside, this one gains from its splendid Freddie Young photography, the exceptional production design and the jazzy Quincy Jones soundtrack. Performances vary from the (usual) delight in watching Mason, to the magnetic (Signoret) and the downright awkward – Ms. Andersson (Bergman's one time muse) may be a wisely twisted choice but acts unconvincingly hysterical. Genre fans expected.",
         "James Mason, Maximillian Schell, and Simone Signoret star in \"The Deadly Affair,\" a 1966 Sidney Lumet film based on the John LeCarre novel, \"Call for the Dead.\" It's a George Smiley story, but the character names are changed because of rights issues. James Mason is Charles Dobbs, a British agent who wants to know why a government employee committed suicide after he received security clearance. The government had received an anonymous letter about him having ties to Communism. Dobbs interviews him and learns that the man was interested in Communism as a young man only and gives him clearance. He then learns the man committed suicide. Not satisfied with the verdict, Dobbs leaves his job in order to investigate further. Meanwhile, he has problems at home with his sex addict wife (Harriet Andersson), who is involved in an affair with an old friend from the war (Schell). This is a very dark drama set in England, which looks mighty bleak in this film. Mason plays the world-weary Dobbs very well. Signoret is excellent as the victim's wife, a concentration camp survivor. She's an intriguing character, but in the end, it's not a very big role. Mason is ably supported by Harry Andrews, Kenneth Haigh, and Robert Flemyng. The climax of the film takes place at a strong performance of Edward II, in which Lynn Redgrave has a role. Corin Redgrave also appears in the movie. Good drama - if I had more familiarity with George Smiley, I could say more. I don't. I can't.",
         "Mostly right on target, this 60's spy drama is set in a gritty-looking London, with James Mason, in an excellent and emotional (more than usual, for him) performance, facing betrayal on international, state and personal levels. Long scenes of people speaking intelligent dialogue with each other fills one with a nostalgia for this superb method of film-making - lost in similar movies made today, where vertiginous camera-work and fast cuts are relied upon to supply the thrills. Realistic violence - where victims are actually hurt after minimal fisticuffs - also raises the level above current fare. Simone Signoret provides an aching gravitas to her role. Maximilian Schell is not just handsome and suave, but plumbs the depths of his character. The great Harry Andrews is authoritative as a retired, and amusingly narcoleptic, policeman. Harriet Andersson makes the best of a thankless role (somewhat extraneously plotted,as a not very successful parallel to Signoret's role) as Mason's much younger wife; a line such as \"Why don't you just call me a nymphomaniac slut?\" was probably considered frank and \"adult\" in 1967, but just makes one wince today. Aside from that, the story is nuanced, suspenseful (even though the culprit is rather obvious) and - importantly for this genre - coherent. Quincy Jones' score, lushly orchestrated, with Brazilian inflections (Astrud Gilberto sings a recurring melody), is beautiful in itself and a treat to listen to, but jarringly inappropriate for the film."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Sidney Lumet Film Productions"],
      "summaries": [
         "After Charles Dobbs, a security officer, has a friendly chat with Samuel Fennan from the Foreign Office, the man commits suicide. An anonymous typed letter had been received accusing Fennan of being a Communist during his days at Oxford and their chat while walking in the park was quite amiable. Senior officials want the whole thing swept under the rug and are pleased to leave it as a suicide. Dobbs isn't at all sure as there are a number of anomalies that simply can't be explained away. Dobbs is also having trouble at home with his errant wife, whom he very much loves, having frequent affairs. He's also pleased to see an old friend, Dieter Frey, who he recruited after the war. With the assistance of a colleague and a retired policeman, Dobbs tries to piece together just who is the spy and who in fact assassinated Fennan.",
         "A British agent sets out to uncover the hidden facts behind a British government employee's suicide."
      ],
      "budget": 0
   },
   "movielensId": 134747,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1966-05-13",
      "dvdReleaseDate": null,
      "directors": ["Sidney Lumet"],
      "runtime": 115,
      "movieId": 134747,
      "title": "The Deadly Affair",
      "mpaa": "",
      "actors": [
         "James Mason",
         "Simone Signoret",
         "Maximilian Schell",
         "Harriet Andersson",
         "Harry Andrews",
         "Kenneth Haigh",
         "Roy Kinnear",
         "Max Adrian",
         "Lynn Redgrave",
         "Robert Flemyng",
         "Leslie Sands",
         "Corin Redgrave"
      ],
      "imdbMovieId": "0061556",
      "originalTitle": "The Deadly Affair",
      "genres": [
         "Romance",
         "Drama",
         "Thriller",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Charles Dobbs is a British secret agent investigating the apparent suicide of Foreign Office official Samuel Fennan. Dobbs suspects that Fennan's wife, Elsa, a survivor of a Nazi Germany extermination camp, might have some clues, but other officials want Dobbs to drop the case. So Dobbs hires a retiring inspector, Mendel, to quietly make inquiries. Dobbs isn't at all sure as there are a number of anomalies that simply can't be explained away. Dobbs is also having trouble at home with his errant wife, whom he very much loves, having frequent affairs. He's also pleased to see an old friend, Dieter Frey, who he recruited after the war. With the assistance of a colleague and a retired policeman, Dobbs tries to piece together just who is the spy and who in fact assassinated Fennan.",
      "tmdbMovieId": 14755,
      "avgRating": 3.04545,
      "releaseYear": "1966",
      "numRatings": 11,
      "posterPath": "/7UNbXips8TUZ1RTrRudRZ3FTRSh.jpg"
   }
}