{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "buffalo",
         "id": 2912
      }],
      "imdb_id": "tt0049432",
      "video": false,
      "title": "The Last Hunt",
      "recommendations": [
         65610,
         28484,
         80775,
         46875,
         71654,
         116048,
         34651,
         69472,
         35392,
         75363,
         43319,
         37216,
         84473,
         44921,
         77356,
         73896,
         28943,
         13385,
         38732,
         59401
      ],
      "backdrop_path": "/tecxAbBvJ2Itlo1gFmXy1anaxbo.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "5589209b92514152080007f5",
         "content": "Killing's like...err, like the only real proof you are alive.\r\n\r\nThe Last Hunt is directed by Richard Brooks who also adapts the screenplay from the novel of the same name written by Milton Lott. It stars Robert Taylor, Stewart Granger, Debra Paget, Lloyd Nolan and Russ Tamblyn. Out of MGM it's a CinemaScope/Eastman Color production with music by Daniele Amfitheatrof and cinematography by Russell Harlan.\r\n\r\nBuffalo hunter Sandy McKenzie (Granger) is tired of the hunt, but after a quirk of fate leaves him financially struggling, he accepts an invitation from Charles Gilson (Taylor) to go out on another profitable hunt. But when out on the range, Charlie starts to show a sadistic streak, and after his capture of an Indian girl (Paget), the two men are driven even further apart. Something will have to give.\r\n\r\nIt's quite often forgotten that one of the key weapons of war is food. The buffalo was an integral animal to the Native American way of life for a number of reasons, be it food, shelter, clothes or religious worth, it was an animal of great substance. So killing them off was a viable tactic for the white man during the Indian wars. The start of Richard Brooks' film tells us that in 1853 there were 60 million buffalo in the West, but within 30 years their number would be only 30 thousand...\r\n\r\nWhat unfolds in this bleak but most potent of pictures, is a tale of men emotionally battered, albeit differently, by the war, a tale tinted (tainted) by racism and ecological concerns. Essentially it's Granger's tired of it all Sandy McKenzie against Taylor's blood lust racist Charles Gilson. In the middle is Paget's Indian girl, who is courted by McKenzie but owned unwillingly by Gilson, while on the outskirts observing are the skinners, half-breed Jimmy (Tamblyn) and Woodfoot (Nolan). McKenzie can barely pull the trigger to shoot the buffalo, his inner torment etched all over his face, but Gilson can fire rapidly, a maniacal glee surfaces with each buffalo death he administers. To Gilson, one less buffalo is one less Indian, his hatred of the Indian born out when he gets chance to kill those Indians that come to be in his way.\r\n\r\nIs it the same kind of feeling you get around a woman?\r\n\r\nThe screenplay positively pings with intelligence and thought for its subjects, crucial given that it is essentially an intimate five character piece. Brooks is aware that the themes dwelling in his movie need to be handled with care, to take a sledgehammer to make a point would be wrong. With the exception of Paget (not her fault as she plays it as written) he garners great performances from his cast, with Taylor and Granger excellent and proving to be good foil for each other. Taylor has Gilson as outright scary and nasty, but there is a shade of sympathy asked of us viewers for he is a troubled mind. When a rumble of thunder pierces the sky above the group's camp, Gilson thinks it's a buffalo herd in flight, off he goes frantically in search of more kills, practically frothing at the mouth. This man clearly needs help, but out there on the frontier there is no help for battle scarred minds.\r\n\r\nWith actual footage of buffalo killings cut into the film (part of the government thinning of the herd programme), there's plenty to feel sombre about. However, there is great beauty to be found by way of Russell Harlan's photography out of Badlands National Park and Custer State Park. These lands were once home to much pain and misery, but forever beautiful they be and in Harlan's hands they offer up another reason why The Last Hunt is essential viewing for the Western fan. It's brilliant, one of the unsung classics of 50s Westerns and proof positive that Robert Taylor, when challenged to do so, could indeed act very well. 9/10",
         "url": "https://www.themoviedb.org/review/5589209b92514152080007f5"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Charlie Gilson",
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e5f",
               "name": "Robert Taylor",
               "profile_path": "/wrtbJwt7K9i3mzfH2TVAea9WGEY.jpg",
               "id": 82216,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sandy McKenzie",
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e63",
               "name": "Stewart Granger",
               "profile_path": "/vRcMlIV1NTpiXQibMdsl5N4J6gl.jpg",
               "id": 41235,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Woodfoot",
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e67",
               "name": "Lloyd Nolan",
               "profile_path": "/gh6Gli1hfPXKEJuh4tTXBGXdyuT.jpg",
               "id": 19411,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Indian girl",
               "gender": 1,
               "credit_id": "52fe4afec3a368484e171e6b",
               "name": "Debra Paget",
               "profile_path": "/hu9oG6bt7WohvU4G0ydKZ1aeDuf.jpg",
               "id": 48958,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jimmy O'Brien",
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e6f",
               "name": "Russ Tamblyn",
               "profile_path": "/eSVSJvOR18dTgLRkeOqRYd6ew31.jpg",
               "id": 6725,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Ed Black",
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e73",
               "name": "Joe De Santis",
               "profile_path": "/2CkzrebI0JHyO2zrBCPYmqTNYLQ.jpg",
               "id": 95012,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Buffalo hunter #1",
               "gender": 0,
               "credit_id": "52fe4afec3a368484e171e77",
               "name": "Ainslie Pryor",
               "profile_path": null,
               "id": 170561,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Indian agent",
               "gender": 0,
               "credit_id": "52fe4afec3a368484e171e7b",
               "name": "Ralph Moody",
               "profile_path": "/7TAlilRZmRpU0cB2sEO7JmhkwMf.jpg",
               "id": 100944,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e7f",
               "name": "Fred Graham",
               "profile_path": "/dTkrp1Y0ijc5hvc4J3vmRRUD0ti.jpg",
               "id": 111827,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Peg",
               "gender": 0,
               "credit_id": "52fe4afec3a368484e171e83",
               "name": "Constance Ford",
               "profile_path": "/rLDLMSMHuajkoI3jeiZEq1Fp3n3.jpg",
               "id": 1221520,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e4f",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4afec3a368484e171e55",
               "name": "Richard Brooks",
               "profile_path": "/2xTXd8iz1kKrH0sV4KFuEwZs62O.jpg",
               "id": 3632,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4afec3a368484e171e5b",
               "name": "Milton Lott",
               "profile_path": null,
               "id": 1085081,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 1.203055,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 127564,
      "vote_count": 6,
      "budget": 0,
      "overview": "A buffalo hunter (Stewart Granger) has a falling-out with his partner (Robert Taylor), who kills for fun.",
      "similar": [
         581,
         47914,
         3545,
         154097,
         49849,
         281957,
         57201,
         384680,
         11897,
         264656,
         9359,
         8584,
         10747,
         223485,
         294963,
         3114,
         9086,
         10530,
         395834,
         196
      ],
      "original_title": "The Last Hunt",
      "runtime": 108,
      "poster_path": "/xF7Y6QWhg3GWFAFnnHjbbj06TvF.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1956-04-30",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Richard Brooks"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Richard Brooks",
         "Milton Lott"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049432/",
      "coverLink": null,
      "actors": [
         "Robert Taylor",
         "Stewart Granger",
         "Lloyd Nolan"
      ],
      "reviews": [
         "In 1883, in South Dakota, the former buffalo hunter Sandy McKenzie (Stewart Granger) is tired of hunting the animals. He is approached by Charlie Gilson (Robert Taylor), a man that feels pleasure in killing buffalo and Indians, who proposes a high salary to him to hunt buffalo for him. They associate to each other and hire the skilled skinner Woodfoot (Lloyd Nolan) and the half-breed Jimmy O'Brien (Russ Tamblyn) to help them. When a group of Indians steal their horses, Charlie hunts them down and kills them in their camp. Charlie finds a gorgeous Indian girl (Debra Paget) with a baby boy and he brings her to his camp to be his woman. However, Sandy and she are attracted to each other but they fear Charlie. Along the days, the tension between them increases until the day Charlie kills a white buffalo that is sacred for the Indians. \"The Last Hunt\" is a gritty and brutal western in a period when the Old West is ending. Robert Taylor and Stewart Granger have great performances and Debra Paget is in top of her beauty and responsible for an increasing tension between the two lead characters. The cruel scenes where the buffalo are killed by marksmen are for real and part of the reduction of the herd planned by the government of USA. My vote is seven. Title (Brazil): \"A Última Caçada\" (\"The Last Hunt\")",
         "The arrival of vast waves of white settlers in the 1800s and their conflict with the Native American residents of the prairies spelled the end for the buffalo... The commercial killers, however, weren't the only ones shooting bison... Train companies offered tourist the chance to shoot buffalo from the windows of their coaches... There were even buffalo killing contests... \"Buffalo\" Bill Cody killed thousands of buffalo... Some U. S. government officers even promoted the destruction of the bison herds... The buffalo nation was destroyed by greed and uncontrolled hunting... Few visionaries are working today to rebuild the once-great bison herds... \"The Last Hunt\" holds one of Robert Taylor's most interesting and complex performances and for once succeeded in disregarding the theory that no audience would accept Taylor as a heavy guy... His characterization of a sadistic buffalo hunter, who kills only for pleasure, had its potential: The will to do harm to another... When he is joined by his fellow buffalo stalker (Stewart Granger) it is evident that these two contrasted characters, with opposite ideas, will clash violently very soon... Taylor's shooting spree was not limited to wild beasts... He also enjoy killing Indians who steal his horses... He even tries to romance a beautiful squaw (Debra Paget) who shows less than generous to his needs and comfort... Among others buffalo hunters are Lloyd Nolan, outstanding as a drunken buffalo skinner; Russ Tamblyn as a half-breed; and Constance Ford as the dance-hall girl... But Taylor steals the show... Richard Brooks captures (in CinemaScope and Technicolor) distant view of Buffalos grazing upon the prairie as the slaughter of these noble animals... The film is a terse, brutish outdoor Western with something to say about old Western myths and a famous climax in which the bad guy freezes to death while waiting all night to gun down the hero...",
         "Have no illusions, this IS a morality story. Granger is the troubled ex-buffalo hunter, tempted back to the plains one more time by kill-crazed Taylor. Granger can see the end is near, and feels deeply for the cost of the hunt-on the herds, the Indians and the land itself. Taylor, on the other hand admittedly equates killing buffalo, or Indians to 'being with a woman.' While Granger's role of the tortured hunter is superb, it's Taylor who steals the show, as the demented, immoral 'everyman' out for the fast buck and the goodtimes. There's not a lot of bang-bang here, but the story moves along quickly, and we are treated to a fine character performance by Nolan. The theme of this story is just as poignant today, as in the 1800s-man's relationship to the land and what's on it, and racism. Considering when this was made, the Censors must have been wringing their hankies during the scenes in the 'bawdy house', Taylor's relationship with the squaw, and much of the dialogue. Although downbeat, this is truly a great western picture.",
         "Like most other reviewers I have first seen this movie (on TV, never on the big screen), when I was a teenager. My Dad has always regarded this film highly and recommended it to me then, and I must say he was not only right, but this movie has stayed with me forever in the more than 2 decades since I saw it first time. I have seen it two or three more times since then (just a few days ago I gave it another watch) and it has not lost anything of its impact with time. It still a great and well worth to be seen movie! Manr regard Peckinpah's RIDE THE HIGH COUNTRY as one of the first and best later western, which had a realistic look at life in the old west, but the hardly known LAST HUNT is definitely the better movie and was even half a dozen years earlier. Actually it was probably 3 decades ahead of its time, or maybe it still is ... Although thinking hard and having certainly seen 100s of western (I like this genre) I can not remember any western as bleak and depressive as this one. Two men bound together, partly by hate, partly by not seeming to have other choices, surrounded by beautiful Ms. Padget, a crippled old man and a young Inian, leading the life of buffalo-killers until fate reaches out for one of them. Nobody who has ever seen this movie will be able to forget its ending and the last frames of this gem. When the camera moves on and away from Mr. Taylor a white buffalo skin comes into sight (on a tree)and echos from the past, when all the hatred began, are present again. Mr. Taylor has got his buffalo, but in the end the buffalo got him. Aside from the top performances of everybody involved, the intelligent script and the great dialogue, it should also be mentioned, that THE LAST HUNT is superbly photograped, I have seldomely seen a western that well shot (aside from the ones directed by Anthony Mann, which are also all superbly photographed), that all the locations are cleverly chosen and that even the soundtrack fits the picture very well. And director BROOKS is really a superb storyteller. Master craftsmanship!He has made quite a couple of really great movies and was successful in nearly every imaginable genre, but even in an as prolific career as this one, THE LAST HUNT still shines as one of his best, if not his best. Definitely would deserve a higher rating, compared to the 7-something RIDE THE HIGH COUNTRY enjoys.",
         "The film largely focuses on a bullying Robert Taylor as a ruthless buffalo hunter and the people who have to put up with him. Set amidst a hunt for dwindling numbers of buffalo, it portrays the end of a tragic era of senseless slaughter and is full of drama and remorse for both the buffalo and the Native Americans. Taylor is blinded by his hatred of Indians and his naivete that the buffalo herds will never disappear. In one scene, he shoots animal after animal, while in another he murders Indians and then eats the food they had cooking on their fire. Under this ruthless exterior lies an insecure person who is reduced to begging his comrades (Stewart Granger, Lloyd Nolan, and Russ Tamblyn) not to leave him. It's not the most pleasant of films and is weighed down by the drama it creates, leading to a dismal and very fitting conclusion in a blizzard.",
         "This is the most compelling and excellent performance that Robert Taylor ever gave. It even surpasses his wonderful performance as \"Johnny Eager\" coming a full 14 years after that film. His looks are still a wonder to see, but he has a maturity now that gives him the edge in this gritty, violent role. Charlie Gilson (Taylor) is the last of his breed, a buffalo hunter who kills not for the money but for the pleasure. His wild eyed killing of not only buffalo but human beings, is stunning to watch. He is basically a lonely man, needing the people around him, but they dislike him because of his sociopath behavior. His partner is Sandy McKenzie (Stewart Granger) who is sick of the hunt, and only goes along, because he is a failure at anything else. Along the way Charlie kills a family of Indians and captures the beautiful Debra Pagent. Charlie tries to seduce her to no avail, but sees that Sandy is interested in her also. Granger is kind of sad to watch, so fed up with the hunt, longing to go away with the girl and her baby. Lloyd Nolan as the drunken skinner is wonderful with his wise cracks and accordian playing. Russ Tamblyn plays the half breed trying to fit in a white world. The group is an odd mix of good and evil, young and old. In the end Taylor gets spooked by the buffalo, as many hunters before him had, and runs off leaving Sandy with the girl. Upon his return, that night Sandy leaves with the woman, setting Charlie off on a rampage of killing in a quest to get Sandy and have the girl for himself. The final confrontation comes in a snow storm and the last scene is so shocking that you will never forget it. It is Taylor's film all the way and he was truly a much underrated actor of the era.",
         "I had watched several days film shooting of this movie that summer,the end result was just two scenes in the movie. The location was Sylvan Lake in the Black Hills. Bring the wagon,stop the wagon etc . So this Dakota youth looked forward to seeing the movie and was not disappointed. The local buffalo herd was being culled so the shooting scenes were for real. (yes Doris, animals were hurt during filming) I think the ending was copied by Jack Nicholson in the Shining? A great western/social comment from the 50's. This should be in the same class as High Noon for real western drama or used as a social statement like Blackboard Jungle or Rebel Without A Cause was for 50's youth.",
         "I just watched this movie, by mistake. What a little gem. This film made in 1956 looks, and feels, like a late Seventies movie. And is in fact better, more restrained and correct than, say, Blue Soldier. The environmental, anthropological undertones are way ahead of its time. The understated cinematography is superb and terribly realistic. Much more than Dances with Wolves, The Last Hunt manages to convey the look and feel of the buffalo \"killing fields\" of the late 1800s. Probably because those in the movie were real killing fields. The movie was shot during legal forestry directed buffalo culls, so the animals you see are really being shot, the bones are real. In conclusion, a very under-rated western masterpiece, superbly acted, directed and shot.",
         "Pretty good Western set in the early 1880s , this is the story of one of the last buffalo hunts in the Northwest and Badlands National Park, Interior , South Dakota , by that time stayed survivors 3000 buffalo , only . Sandy McKinzie (Stewart Granger) is an ex-hunting buffalo and nowadays a tired rancher , he has a casual meeting with veteran hunter Charlie (Robert Taylor) , and both of whom join forces to hunt Buffalo . After that , Charley murders an Indian raiding party , and takes an Indian girl (Debra Paget , Anne Bancroft was injured on her horse , then was replaced by Paget) as his own ; then , both hunters fall out over the rescued young squaw . Meanwhile , lots of buffalo get killed one way and another . And Charlie kills a fair few Indians , too . When personalities crash , Charlie seeks vengeance on fellow buffalo hunter Sandy . As tension and subsequent confrontation develops between the two hunters till a surprising and icy ending . Very good Western starring an excellent Robert Taylor as a revenger as well as seedy Buffalo hunter who gains his his identity killing both , Buffalo and Indians . Spectacular and breathtaking scenes when there happen the buffalo stampedes . It is an exciting Western/drama that holds you interest from start to finish and right through to the intriguing as well as frozen climax . The flick displays a deep denounce about senseless acts of murders as Buffalo as Indians . The buffalo scenes were real-life attempts at keeping the animals controlled . US government marksmen actually shot and killed buffalo during production as part of a scheduled herd-thinning . Interesting and thought-provoking screenplay based on the novel by Milton Lott . The plot is quite grim by Metro Goldwyn Mayer Western standards , though it results to be entertaining . In film premiere failed at box office and it was panned by critics and lukewarm reception by public ; however , nowadays reviewers carried a detailed reappraisal of the movie . The cast is frankly well . Robert Taylor is solid , if a bit stolid . Stewart is acceptable , as usual , and gorgeous Debra Paget as a young Naive squaw . The support cast is fine , as Russ Tamblyn as a young Indian who looks to be throughly enjoying himself and special mention for Lloyd Nolan as an old cripple called Woodfoot , an upright and honorable old man. Colorful cinematography by Russell Harlan shot in National Parks such as Custer National Park, Badlands National Park, Interior, Sand Sylvan Park South Dakota, among others . Thrilling as well as evocative Original Music by Daniele Amfitheatrof . Directed and screen-played in magnificent style by Richard Brooks (Elmer Gantry, In cold blood, Lord Jim) who subsequently directed other good Westerns titled ¨Bite the bullet¨ with Gene Hackman and Candice Bergen and the ¨Professionals¨ with various tough stars as Burt Lancaster , Lee Marvin , Jack Palance and Robert Ryan . ¨The last hunt¨ is an authentic must see , not to be missed for buffs of the genre . A successful movie because of its awesome acting , dialog , score are world class.",
         "The Last Hunt is directed by Richard Brooks who also adapts the screenplay from the novel of the same name written by Milton Lott. It stars Robert Taylor, Stewart Granger, Debra Paget, Lloyd Nolan and Russ Tamblyn. Out of MGM it's a CinemaScope/Eastman Color production with music by Daniele Amfitheatrof and cinematography by Russell Harlan. Buffalo hunter Sandy McKenzie (Granger) is tired of the hunt, but after a quirk of fate leaves him financially struggling, he accepts an invitation from Charles Gilson (Taylor) to go out on another profitable hunt. But when out on the range, Charlie starts to show a sadistic streak, and after his capture of an Indian girl (Paget), the two men are driven even further apart. Something will have to give. It's quite often forgotten that one of the key weapons of war is food. The buffalo was an integral animal to the Native American way of life for a number of reasons, be it food, shelter, clothes or religious worth, it was an animal of great substance. So killing them off was a viable tactic for the white man during the Indian wars. The start of Richard Brooks' film tells us that in 1853 there were 60 million buffalo in the West, but within 30 years their number would be only 30 thousand... What unfolds in this bleak but most potent of pictures, is a tale of men emotionally battered, albeit differently, by the war, a tale tinted (tainted) by racism and ecological concerns. Essentially it's Granger's tired of it all Sandy McKenzie against Taylor's blood lust racist Charles Gilson. In the middle is Paget's Indian girl, who is courted by McKenzie but owned unwillingly by Gilson, while on the outskirts observing are the skinners, half-breed Jimmy (Tamblyn) and Woodfoot (Nolan). McKenzie can barely pull the trigger to shoot the buffalo, his inner torment etched all over his face, but Gilson can fire rapidly, a maniacal glee surfaces with each buffalo death he administers. To Gilson, one less buffalo is one less Indian, his hatred of the Indian born out when he gets chance to kill those Indians that come to be in his way. Is it the same kind of feeling you get around a woman? The screenplay positively pings with intelligence and thought for its subjects, crucial given that it is essentially an intimate five character piece. Brooks is aware that the themes dwelling in his movie need to be handled with care, to take a sledgehammer to make a point would be wrong. With the exception of Paget (not her fault as she plays it as written) he garners great performances from his cast, with Taylor and Granger excellent and proving to be good foil for each other. Taylor has Gilson as outright scary and nasty, but there is a shade of sympathy asked of us viewers for he is a troubled mind. When a rumble of thunder pierces the sky above the group's camp, Gilson thinks it's a buffalo herd in flight, off he goes frantically in search of more kills, practically frothing at the mouth. This man clearly needs help, but out there on the frontier there is no help for battle scarred minds. With actual footage of buffalo killings cut into the film (part of the government thinning of the herd programme), there's plenty to feel sombre about. However, there is great beauty to be found by way of Russell Harlan's photography out of Badlands National Park and Custer State Park. These lands were once home to much pain and misery, but forever beautiful they be and in Harlan's hands they offer up another reason why The Last Hunt is essential viewing for the Western fan. It's brilliant, one of the unsung classics of 50s Westerns and proof positive that Robert Taylor, when challenged to do so, could indeed act very well. 9/10",
         "I saw this film about twenty years ago on the late show. I still vividly remember the film, especially the performance of Robert Taylor. I always thought Taylor was underrated as an actor as most critics saw him as solid, almost dull leading man type, and women simply loved to watch his films because of his looks. This film, however, proved what an interesting actor he could be. He did not get enough roles like this during his long career. This is his best performance. He is totally believable in a truly villainous role. From what I have read, he was a very hardworking and easy going guy in real life and never fought enough for these kind of roles. He basically would just do what MGM gave him. This film proves that he could have handled more diverse and difficult roles. The other thing I remember about this film is how annoying Lloyd Nolan's character was. Nolan was a great actor, but this character really aggravated me. The last scene of the film has stuck with me for all of these years. This film is definitely worth a look.",
         "The memory of the \"The Last Hunt\" has stuck with me since I saw it in 1956 when I was 13. It is a movie that was far ahead of others at the time in that it addressed the treatment of the natives, the environment, and the ever present contrast between the short and long term effects of greed. It is as relevant today as in 1956, a cinemagraphic discussion of utmost depth and relevance. To top it off the setting is beautiful and the cinematography excellent. The memory of this movie will be with me to the end of my days.",
         "The Last Hunt is one of the few westerns ever made to deal with Buffalo hunting, both as a sport and business and as a method of winning the plains Indian wars. Before the white man set foot on the other side of the Mississippi, the plains used to have herds of American Bison as large as some of our largest cities. By the time of the period The Last Hunt is set in, the buffalo had been all but wiped out. The 20th century, due to the efforts of conservationists, saw a revival in population of the species, but not hardly like it once was. Robert Taylor and Stewart Granger are co-starring in a second film together and this one is far superior to All the Brothers Were Valiant. Here Stewart Granger is the good guy, a world weary buffalo hunter, who has to go back to a job he hates because of financial considerations. The partner he's chosen to throw in with is Robert Taylor. Forgetting Taylor for the moment, I doubt if there's ever been a meaner, nastier soul than Charlie Gilsen who Taylor portrays. In Devil's Doorway he was an American Indian fighting against the prejudice stirred up by a racist played by Louis Calhern. In The Last Hunt, he's the racist here. He kills both buffalo and Indians for pure pleasure. He kills one Indian family when they steal his mules and takes the widow of one captive. Like some barbarian conqueror he expects the pleasure of Debra Paget's sexual favors. He's actually mad when Paget doesn't see it that way. No matter how often they refer to Russ Tamblyn as a halfbreed, I was never really convinced he was any part Indian. It's the only weakness I found in The Last Hunt. However Lloyd Nolan, the grizzled old buffalo skinner Taylor and Granger bring along is just great. Nolan steals every scene he's in with the cast. For those who like their westerns real, who want to see a side of Robert Taylor never seen on screen, and who don't like cheap heroics, The Last Hunt is the ideal hunt.",
         "An intellectual western,focusing on the characters's psychology and well played by Granger and Taylor,with good support from Paget and Tamblyn. It denounces the buffalos slaughter which starved the Indians and lead to their defeat.Taylor's character is a racist,and one of his mates says that it's because he looks like the Indians he hates:he kills the buffalos,he beats women,and he blows his nose with his hands .Another one points out that when you begin to kill,you find pleasure and you are not able to stop anymore. Not only Richard Brooks denounces the genocide,but he also shows how the White men killed the Indian culture and religion:the white buffalo is a good example.And the ending,with a last picture that packs a real wallop -it could be the picture of a horror movie- ,looks like a divine intervention.",
         "I saw this movie (at a drive-in with my family) about the time, or not long after, it came out. I was eleven or twelve. I remembered scenes from this flick for fifty years until seeing it again on TCM. These scenes (a frozen buffalo hide, a guy sharpening a skinning knife, the white buffalo and its hide, and the final unforgettable scene) stayed with me for years. The movie still has power, though not as much as the mental rewrite I gave it over a half century ago threading together the scenes I recalled (nothing about the sex in my pre-adolescent memory). I found the editing and cinematography pretty poor when I looked at it a second time but the story was still good. I recall my father saying after the movie, \"I thought Robert Taylor said he wasn't going to do that kind of role any more.\" I don't know what he meant. This is perhaps Taylor's best movie. He plays a very nasty villain. And maybe that's what my father was talking about. Anyway, a curious and interesting western, exploring themes that western writers had opened up long before but were new to Hollywood. It's too bad that the lead native roles were given to Russ Tamblyn and Debra Paget, but that was 50's Hollywood. Worth watching, but mentally re-edit this film and see if you can't come up with a classic must-see.",
         "Robert Taylor as the mad buffalo hunter Charlie Gilson is the main character in this film. At the beginning I was thinking that Charlie would end up redeeming himself like John Wayne in The Searchers or James Stewart in The Naked Spur. But as the film goes along Gilson keeps doing more atrocities until you realize there is no hope for him. Stewart Granger is Sandy McKenzie, who wants to stop hunting because he realizes that the buffaloes will soon be gone and he becomes disgusted by the act of killing. Gilson is a natural killer who makes no distinction between animals or human beings. Debra Paget as the Indian girl is a surprising character considering the self imposed censorship of that time. She lies with Gilson in total resignation even though she hates him. The last scene of a frozen Gilson, is unforgettable.",
         "A mediocre \"Civil Rights\" Western that uses the historical setting to negatively portray racism. Added into the mix here is an animal rights message. It's quaint to see how politically incorrect liberals were in the mid-50's. Not only is a white woman used to play the squaw lead, but many live buffalo are killed on screen during the movie. Even though it is revealed during the initial credits that it was filmed during a federally mandated herd thinning, it would be very controversial to portray this images today. This movie's probably a little overrated because it was written and directed by Richard Brooks, who made a bunch of movies that were much better than this (The Blackboard Jungle, Elmer Gantry, In Cold Blood among others). Here's what was good about the movie: This is a really nice performance by Robert Taylor as an unrepentant racist and killer driven mad by his sins. The main theme of the relationship between killing, hate and insanity is interesting and sophisticated. Nice scenes with buffalo, even if it is a little disturbing to see them shot down for real. Kind of \"cool\" ending. Here's some of things that brought it down: Overall the plot and script were ragged. The movie does not flow well and has awkward transitions. I didn't buy Stuart Granger as a frontiersman. Looked like he was hanging out in a gay Manhattan piano bar to me. Much of the film takes place in very phony looking sound stage/campsites. The movie just beats you over the head with it racism and animal rights themes. There is no attempt to obfuscate or embed the themes in the plot or characterizations. A little too maudlin in its depiction of the Indians.",
         "For some reason, this film has never turned up in its original language in my neck of the woods (despite owning the TCM UK Cable channel, which broadcasts scores of MGM titles week in week out). More disappointingly, it's still M.I.A. on DVD \u0096 even from Warners' recently-announced \"Western Classics Collection\" Box Set (which does include 3 other Robert Taylor genre efforts); maybe, they're saving it for an eventual \"Signature Collection\" devoted to this stalwart of MGM, which may be coming next year in time for the 40th anniversary of his passing\u0085 I say this because the film allows him a rare villainous role as a selfish Westerner with a fanatical hatred of Indians and who opts to exploit his expert marksmanship by making some easy money hunting buffaloes; an opening statement offers the alarming statistic that the population of this species was reduced from 60,000,000 to 3,000 in the space of just 30 years! As an associate, Taylor picks on former professional of the trade Stewart Granger \u0096 who rallies alcoholic, peg-legged Lloyd Nolan (who continually taunts the irascible and vindictive Taylor) and teenage half-breed Russ Tamblyn to this end. As expected, the company's relationship is a shaky one \u0096 reminiscent of that at the centre of Anthony Mann's THE NAKED SPUR (1953), another bleak open-air MGM Western. The film, in fact, ably approximates the flavor and toughness of Mann's work in this field (despite being writer/director Brooks' first of just a handful of such outings but which, cumulatively, exhibited a remarkable diversity); here, too, the narrative throws in a female presence (Debra Paget, also a half-breed) to be contended between the two rugged leads \u0096 and Granger, like the James Stewart of THE NAKED SPUR, returns to his job only grudgingly (his remorse at having to kill buffaloes for mere sport and profit is effectively realized). The latter also suffers in seeing Taylor take Paget for himself \u0096 she bravely but coldly endures his approaches, while secretly craving for Granger \u0096 and lets out his frustration on the locals at a bar while drunk! Taylor, himself, doesn't come out unscathed from the deal: like the protagonist of THE TREASURE OF THE SIERRA MADRE (1948), he becomes diffident and jealous of his associates, especially with respect to a rare \u0096 and, therefore, precious \u0096 hide of a white buffalo they've caught; he even goes buffalo-crazy at one point (as Nolan had predicted), becoming deluded into taking the rumble of thunder for the hooves of an approaching mass of the species! The hunting scenes themselves are impressive \u0096 buffaloes stampeding, tumbling to the ground when hit, the endless line-up of the day's catch, and the carcasses which subsequently infest the meadows. The film's atypical but memorable denouement, then, is justly famous: with Winter in full swing, a now-paranoid Taylor out for Granger's blood lies in wait outside a cave (in which the latter and Paget have taken refuge) to shoot him; when Granger emerges the next morning, he discovers Taylor in a hunched position \u0096 frozen to death! Incidentally, my father owns a copy of the hefty source novel of this (by Milton Lott) from the time of the film's original release: actually, he has collected a vast number of such editions \u0096 it is, after all, a practice still in vogue \u0096 where a book is re-issued to promote its cinematic adaptation. Likewise for the record, Taylor and Granger \u0096 who work very well off each other here \u0096 had already been teamed (as sibling whale hunters!) in the seafaring adventure ALL THE BROTHERS WERE VALIANT (1953)\u0085which, curiously enough, is just as difficult to see (in fact, even more so, considering that it's not even been shown on Italian TV for what seems like ages)!!",
         "Robert Taylor began his career at MGM as a handsome young lead with an eager smile in the mid 30s. Somewhere along the time line, during the war years, as he lost his youthful looks, he came to appear stern and not particularly sympathetic. At the same time his acting because routinized, automatic, giving a performance for him became like driving a car is for us. You don't put any thought into it. This didn't keep his studio from casting him in semi-historical costume movies. Whether or not he could act, at least he didn't get in the way of the scenery. Nor did he appear to seek out more dramatic roles that might be more in keeping with his appearance and demeanor. He and MGM were satisfied enough. Then, here, in 1956, during his mature period, comes this movie, \"The Last Hunt,\" in which Taylor plays probably his most complex character role and gives it everything he's got, mixing meanness and pathos. I give it a bonus point for that alone. It's almost amusing to see the man criticized for overacting. Think about it. Robert TAYLOR? OverACTING? He usually has all the verve of a mechanical man in a circus side show. To accuse him of overacting is like accusing a clam of having moved. It's a Western about professional buffalo hunters in 1883. The big herds are thinning out. Taylor is still bent on shooting as many buffalo as he can, while his partner, Stewart Granger, has become a reluctant companion. The killing that the two friends have seen in the Civil War has changed them, but in different ways. It's sickened Granger, while Taylor has found that he rather likes it. On the eponymous final hunt, they pick up a young Indian boy (Russ Tamblyn) and an experienced old buffalo skinner (Lloyd Nolan). A skirmish with some Indians, whom Taylor happily shoots, gets Taylor a beautiful Indian woman to keep him warm at night (Debra Paget). The movie is sensitive to hunters pretty much having wiped out the buffalo. (It's a little like A. B. Guthrie's novel, \"The Big Sky.\") And it shows respect for the Sioux and their religion. But except for one or two sentences, it's not preachy, so it would be a mistake to code this as some tender-minded revisionist tract. For what it's worth, the high plains tribes I've lived with still revere the buffalo. They used every single part of every animal they were able to kill. As one Blackfeet man put it, \"they were a supermarket.\" At any rate, Taylor's performance is the key to the movie, and it's quite good. His character follows a trajectory similar to that of Fred C. Dobbs in \"The Treasure of the Sierra Madre\", although Taylor is no Bogart, nor does this script have nearly the same quality. But Taylor is friendly enough at the beginning. Oh, a little insensitive to others, but cheerfully optimistic, and loyal to his pal Granger. But then he becomes mercurial. By the end, he's a madman, mistaking the rumble of distant thunder for a hundred thousand buffalo. That final shot of Taylor, wrapped in a frozen buffalo hide, his face a grotesque mask coated with ice, is memorable. The shooting, alas, is often studio bound. Speech made around the camp fire seems to echo slightly. It's cold but no one's breath steams. It's good to see the manly Stewart Granger as something other than the alpha male. He's not as fast with a gun as Taylor. Nobody is. Granger is given one good scene, as a sad, truculent drunk in a cat house, and he pulls it off well. The fist fight isn't played for laughs. Constance Ford is the whore who administers some superficial comfort to the drunken Granger but he shrugs her off and leaves. Angry, she shouts after him, \"What do you think, I have a heart of gold?\" (Nice touch.) Nice job, but sad too. Taylor, and people with his tragic flaws, have left us all a little worse off than we might have been.",
         "I was initially dubious about this movie (merely because of the subject), but the richly drawn characters, the fabulous scenes of the buffalo hunt, and the dramatic conclusion make it well-worth watching. I initially had trouble distinguishing between the two buffalo hunters but as the movie progressed they increasingly distinguished themselves. I am still haunted by the final scene.",
         "Robert Taylor and Stewart Granger switch the goodie-baddie roles they held in \"All the brothers were valiant\". Taylor seems a bit uncomfortable in his bad-guy role but Granger plays his part perfectly. However the real hero in the story are the bison and the northwest. The film is perfectly made, with the atmosphere of the times wonderfully given. The direction is taut and although the film is no light-hearted entertainment it is, to my way of thinking a major film, unjustly ignored by the cognoscenti.",
         "\"The Last Hunt\" is a western that deals with buffalo hunting. The film is slow and too long -boring at times-, lacks intensity, impact and real interest in the story. Perhaps the unusual ingredient is Robert Taylor's casting as a villain. He plays Charlie Gilson an ambitious and selfish hunter but he clearly overacts in his effort to look mean and ruthless. Stewart Granger, as his sidekick Sandy McKenzie a decent and straight man, renders a better performance. The feminine touch is delivered by pretty Debra Paget as an Indian girl captured by Taylor but more interested in Granger. Russ Tamblyn and the usually correct LLoyd Nolan complete the main cast. No highlights in this movie -just a standard one- and only some good outdoor wide-open photography and a sort of original \"finale\" for the villain. Not much anyway.",
         "A lot of talk has been made about \"psychological Westerns\", but this is one of the very few that is truly in that genre. It has big name stars who perform very well, but it is the director who makes this such a good movie. Stewart Granger loses his British safari hunter stereotype to play a haggard retired buffalo hunter who is revered in the West as one of the best. Robert Taylor plays the upstart (in contrast to the usual young upstart, Taylor's character is middle aged, too), who wants to slaughter buffalo, and lures Granger into business with him. They hire two other big name actors, Lloyd Nolan and Russ Tamblyn, into being their skinners. Granger is haunted by the buffalo he has killed, knowing that he may be to blame if they become extinct, knowing if they become extinct, the Native American way of life will greatly suffer. Taylor soon reveals a sadistic side, but it is a realistic saidism, unlike the one dimensional sadists of modern film, created by nerds and dorks. He is insecure, and needs human companionship. Still, he won't stop at murder. The end pits the two against each other, with a startling conclusion. The psychological effects of what they're doing are well depicted.",
         "The Last Hunt is a wonderful piece of Western film making. Richard Brook's script and direction are top notch. Robert Taylor gives one of the best performances of his career as Charlie, a man who seems to be in love with killing and hatred, yet has a tender side to him brought out by the Indian girl he takes captive. The film is a wonderful character study of two men who are totally opposite in the way they feel about killing. And so much of the conflict within the picture results from the differences in their characters. The supporting cast is great with Lloyd Nolan and Russ Tamblyn being the standouts. The Last Hunt is hardly ever mentioned in the great westerns, but I feel it should be. It is a great film that has been overlooked way too long. Any western fan or Robert Taylor definitely need to check it out.",
         "NOTES: Locations in Custer State Park in South Dakota and the United States National Monument at Badlands. The producers express their deep appreciation to the officials and to Governor Joe Foss of South Dakota. COMMENT: A grim and unsavory tale which, though well acted, is often horrifying to watch. Taylor gives his best performance ever as the sadistic bad guy. Lloyd Nolan makes the most of his dramatic opportunities too, but the unusually colorless Stewart Granger is poorly treated by Richard Brooks in both his capacities as writer and director, aside from one good scene in which he stymies Constance Ford's saloon girl, manhandles Fred Graham's barman and generally takes on all comers at the Golden Ace saloon (or whatever it is). Debra Paget makes a rather subdued Indian widow, while Russ Tamblyn does what he can with the somewhat unrewarding role of the conventional juvenile. But it's Taylor's film and he doesn't let anyone — not even the scenery or the buffaloes — forget it!"
      ],
      "genres": [
         "Drama",
         "Western"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "Set in the early 1880s, this is the story of one of the last buffalo hunts in the Northwest. Sandy McKinzie is tired of hunting buffalo, and tired of killing-Charley on the other hand relishes the hunt and enjoys killing buffalo and Indians. When Charley kills an Indian raiding party, and takes their squaw as his own, tension develops between the two hunters, and matters will only be settled in a showdown.",
         "In 1883, in South Dakota, the former buffalo hunter Sandy McKenzie is tired of hunting the animals. He is approached by Charlie Gilson, a man that feels pleasure in killing buffalos and Indians, who proposes a high salary to him to hunt buffalos for him. They associate to each other and hire the skilled skinner Woodfoot and the half-Indian Jimmy O'Brien to help them. When a group of Indians steal their horses, Charlie hunts them down and kills them in their camp. Charlie finds a gorgeous Indian girl with a baby boy and he brings her to his camp to be his woman. However, Sandy and she are attracted to each other but they fear Charlie. Over the days, the tension between them increases until the day Charlie kills a white buffalo that is sacred for the Indians.",
         "In 1883 South Dakota, two buffalo hunters start a personal feud over a captured squaw and a stand-off with a Dakota raiding party over some stolen horses."
      ],
      "budget": 2121000
   },
   "movielensId": 134757,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1956-04-30",
      "dvdReleaseDate": null,
      "directors": ["Richard Brooks"],
      "runtime": 108,
      "movieId": 134757,
      "title": "The Last Hunt",
      "mpaa": "",
      "actors": [
         "Robert Taylor",
         "Stewart Granger",
         "Lloyd Nolan",
         "Debra Paget",
         "Russ Tamblyn",
         "Joe De Santis",
         "Ainslie Pryor",
         "Ralph Moody",
         "Fred Graham",
         "Constance Ford"
      ],
      "imdbMovieId": "0049432",
      "originalTitle": "The Last Hunt",
      "genres": ["Western"],
      "youtubeTrailerIds": ["gMPqSUaItHg"],
      "plotSummary": "A buffalo hunter (Stewart Granger) has a falling-out with his partner (Robert Taylor), who kills for fun.",
      "tmdbMovieId": 127564,
      "avgRating": 5,
      "releaseYear": "1956",
      "numRatings": 1,
      "posterPath": "/xF7Y6QWhg3GWFAFnnHjbbj06TvF.jpg"
   }
}