{
   "tmdb": {
      "original_language": "es",
      "keywords": [],
      "imdb_id": "tt0025942",
      "video": false,
      "title": "Fair of the Dove",
      "recommendations": [],
      "backdrop_path": "/10BTZxiu84OzTEFtB2GGgZc1kQQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Don Hilarión",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568d9",
               "name": "Miguel Ligero",
               "profile_path": null,
               "id": 1028289,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Julián",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568d5",
               "name": "Roberto Rey",
               "profile_path": null,
               "id": 131954,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Susana",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568dd",
               "name": "Raquel Rodrigo",
               "profile_path": null,
               "id": 263403,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Señá Rita",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568e1",
               "name": "Sélica Pérez Carpio",
               "profile_path": null,
               "id": 1173614,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tía Antonia",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568e5",
               "name": "Dolores Cortés",
               "profile_path": null,
               "id": 1055630,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Casta",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568e9",
               "name": "Charito Leonís",
               "profile_path": null,
               "id": 1173615,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "El tabernero",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568ed",
               "name": "Rafael Calvo",
               "profile_path": null,
               "id": 1039947,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Don Sebastián",
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568f1",
               "name": "Enrique Salvador",
               "profile_path": null,
               "id": 1173616,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568f7",
               "name": "Benito Perojo",
               "profile_path": null,
               "id": 1031934,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e1568fd",
               "name": "Pedro de Repide",
               "profile_path": null,
               "id": 1173617,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a7ec3a368484e156903",
               "name": "Benito Perojo",
               "profile_path": null,
               "id": 1031934,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.254449,
      "production_countries": [],
      "id": 122525,
      "vote_count": 1,
      "budget": 0,
      "overview": "A young printer's relationship with his girlfriend is in trouble after she accepts another suitor's invitation to the fair. This adaption of a popular operetta aims to please with a simple storyline and goofy slapstick.",
      "similar": [],
      "original_title": "La verbena de la Paloma",
      "runtime": 78,
      "poster_path": "/1Tlq9drOfx4O7OSZ6wgAA7QYrVp.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "1935-12-23",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Benito Perojo"],
      "runtime": 78,
      "synopsis": null,
      "writers": [
         "Ricardo de la Vega",
         "Benito Perojo"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0025942/",
      "coverLink": null,
      "actors": [
         "Miguel Ligero",
         "Roberto Rey",
         "Raquel Rodrigo"
      ],
      "reviews": [
         "Zarzuela has often been scorned as 'género chico', something not as highly artistic as opera describing it as Spanish operetta, despite which technically distinguishes it from opera are the 'sandwiched' dialogs between specifically musical pieces. Something also typical of the German sing-spiel, that gave works such in the top of art like \"The magic flute\". I say this as an argument to invite you to listen or watch Tomas Breton original zarzuela after or before this movie because (though i consider it superb for his own for a lot of reasons) if you do it, you will enjoy even more the experience. The original zarzuela with the music of Breton and the lyrics of Ricardo de la Vega is probably the most famous zarzuela and its also considered the most representative and achieved work of this genre. In my personal opinion it is splendid too. But logically the film goes further in many ways. The remarkable thing is that it does completely successfully. The great attraction of the movie is that it develops the plot of the operetta splendidly and far transpose it for the big screen, literally, and while maintaining the magnificent musical numbers, quite rightly shows us that in the version of stage music was not possible to view. That happens not only by the richness of scenarios, but the temporary expansion of the plot (of a few hours to a whole day during) or by the irruption of details that explain it much better and allow for additional readings. For example, sexual (and socio-economic) implications Don Hilarion purported relationship with La Casta and La Susana are much better told (never saw a Don Hilarion as prime as this, nor a so odious Tia Antonia and Procuress). The same happens with the sentimental, as the temporary enlargement and the mastery of the directions and the actors work allow us to better know Julian; and even you can feel his jealousy. With no doubt, to all of this should contribute the air of freedom they breathed in the Second Republic, the time when the film was made. All the film ooze out it through a kind of naturalism that has nothing to envy to the best films then making in France Jean Renoir. In this sense, the recreation of the popular atmosphere of Madrid at the end of the 19th century is unsurpassed, but camera movements and the direction of Benito Perojo is also superb. The opening of the film, with the departure of the Church by those attending the wedding of a couple that never gets to know and their subsequent transfer in a collective horse carriage to take chocolate with churros is memorable, a sort of frontispiece that warns us that we attend to something good and great. And all this by inserting music and dialogs of the original work in a way hardly improved, as it happens in the \"Coplas de Don Hilarion\" or the love song \"Also simple people\". The use of close-ups of Casta, Susana and Tia Antonia when they receive an unexpected visit from Julian at home is another moment to remember and the actions of characters that interpret the Seña Rita and her husband the bartender is also masterful. There is no doubt also that one of the main reasons for the success in the transposition of the original work of the stage to the big screen was the participation in the script and in the additional dialogs of Pedro de Repide. This journalist and writer was the official chronicler of the city of Madrid and currently we owe him a lot of the knowledge we have of Madrid at the time. But it was also a fine poet and a prolific author of naturalistic novels. Exiled after the Spanish civil war, although he later returned, was marginalized by the Franco regime because of his leftist ideas and his sexual orientation. The only tiny sticks that I put to film, and it is why i don't rate it 10, is that despite the stunning start, and the magnificent and masterful footage of the night plot (during it, if you like flamenco you will enjoy a beautiful vocal piece oriented in that way), the last 10 minutes (after the famous 'habanera concertante' \"Dónde vas con mantón de Manila\") excites me less. Perhaps because it is where less innovation and variants there is regarding the original.",
         "Two sisters dressmakers, \"Casta\" (Charito Leonís), and \"Susana\" (Raquel Rodrigo), living in the boarding house of \"Señá Rita\" (Selica Carpio Perez), are claimed by the old apothecary \"Don Hilarion\" (Miguel Ligero). When the two girls decide to go to \"Verbena de la Paloma\" with the pharmacist, when \"Julian\" (Roberto Rey) the boyfriend of \"Susana\" try to prevent it. The film is based on the famous zarzuela Madrid the same name. Its author Tomas Breton, in this piece of music, defies dominant laziness in the field of gender boy who used to consist of little music and almost always the culmination of an action taken by actors and comedians, but few musicians. In \"La Verbena de la Paloma\", the author seeks to be musical dramaturgy to a point just made in this genre. \"Don Hilarion\", \"Julian\", \"Susana\", \"Señá Rita\" and even \"Tía Antonia\" explains musically, his singing is his nature as characters, which includes up to \"Sereno\". Only \"the bartender\" with his \"chulapa\" and extravagant argument artistic escape this rule, but have musicality this character would have been an effort, and achievement, exceeding expectations and the logic of production time. As for the chorus, only with famous \"rollovers\", \"Como la Virgen de la Paloma ...\", is a hymn to Madrid festive whose echo still resounds. The film is well directed by Benito Perojo, and has a superb cast that gets splendid performances like Miguel Ligero \"Don Hilarion\" Roberto Rey \"Julian\" and Selica Perez Carpio \"Señá Rita\". The staging is very well achieved and we can see surprising sequences as the fight between \"Don Hilarion\" and \"Julian\" and the recreation of the old fairground. About the soundtrack, I think it is a gem for fans of the musical genre of \"La Zarzuela\"."
      ],
      "genres": ["Musical"],
      "productionCompanies": ["Compañía Industrial Film Español S.A. (CIFESA)"],
      "summaries": [
         "Susana and her sister Casta, who live with aunt Antonia, an old little matchmaker, flirt with the apothecary Don Hilarión, a dirty old man who gets his hopes up, not realizing that the two girls just want to have fun playing with him. This game causes Julián's jealousy, always staffed by maternal and advisor \"Señá\" Rita. After some adventures in the festival, the old man is mocked and love triumphs between Julián and Susana.",
         "A little love drama between Julián, an honest typesetter, and 'chulapa' Susana, adapted from a famous Spanish 'zarzuela'."
      ],
      "budget": 0
   },
   "movielensId": 134896,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1935-12-23",
      "dvdReleaseDate": null,
      "directors": ["Benito Perojo"],
      "runtime": 78,
      "movieId": 134896,
      "title": "Fair of the Dove",
      "mpaa": null,
      "actors": [
         "Miguel Ligero",
         "Roberto Rey",
         "Raquel Rodrigo",
         "Sélica Pérez Carpio",
         "Dolores Cortés",
         "Charito Leonís",
         "Rafael Calvo",
         "Enrique Salvador"
      ],
      "imdbMovieId": "0025942",
      "originalTitle": "La verbena de la Paloma",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A young printer's relationship with his girlfriend is in trouble after she accepts another suitor's invitation to the fair. This adaption of a popular operetta aims to please with a simple storyline and goofy slapstick.",
      "tmdbMovieId": 122525,
      "avgRating": 2.75,
      "releaseYear": "1935",
      "numRatings": 2,
      "posterPath": "/1Tlq9drOfx4O7OSZ6wgAA7QYrVp.jpg"
   }
}