{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt3017412",
      "video": false,
      "title": "Happy Ending",
      "recommendations": [
         273505,
         303904,
         308165,
         85043,
         192097,
         285803,
         184793,
         140896,
         24595,
         146003,
         330636,
         266550,
         287859,
         276935,
         199139,
         283827,
         49679,
         25867,
         291157,
         330037
      ],
      "backdrop_path": "/fFwFaelhVF4qLbGh6BuOtEr5Mtl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Armaan",
               "gender": 2,
               "credit_id": "547404419251416e58001243",
               "name": "Govinda",
               "profile_path": "/zVfyYIKYTid33lvRylQQ35mJTJq.jpg",
               "id": 97546,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Yudi Jaitley / Yogi",
               "gender": 2,
               "credit_id": "54740476c3a36845e5001f4c",
               "name": "Saif Ali Khan",
               "profile_path": "/eoRMkObOm8SgJi5ff3uGZfVrG4d.jpg",
               "id": 35747,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vishakha",
               "gender": 1,
               "credit_id": "54740486c3a368688c000cd2",
               "name": "Kalki Koechlin",
               "profile_path": "/4m81jxAeWJ1h1T6265pGBZoCC10.jpg",
               "id": 146957,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Aanchal Reddy",
               "gender": 1,
               "credit_id": "547404ac9251414f41000830",
               "name": "Ileana D'Cruz",
               "profile_path": "/9Ar8q35dHlU92ILZdiwnZKPiaqz.jpg",
               "id": 237040,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Christina",
               "gender": 0,
               "credit_id": "56abb797c3a3681c34002f9c",
               "name": "Kim DeJesus",
               "profile_path": "/sxS0Ch3YhQt1sPNJrRB3vyXLVdy.jpg",
               "id": 1514002,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Filmy girlfriend",
               "gender": 1,
               "credit_id": "56abb7d8c3a3681c31003373",
               "name": "Kareena Kapoor",
               "profile_path": "/kSDkGSPWTxvOYmnnNphB2eQcuv1.jpg",
               "id": 37233,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Divya",
               "gender": 1,
               "credit_id": "56abb7ec9251417e14003473",
               "name": "Preity Zinta",
               "profile_path": "/jBsLM6KauA8F6ItYmBFQ99jlrwY.jpg",
               "id": 35745,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Shopping Girl",
               "gender": 1,
               "credit_id": "56be400fc3a36817ef0048cc",
               "name": "Kira Cahill",
               "profile_path": "/jc39IHAlGlWjQzmpXD1p6KDpxm6.jpg",
               "id": 1576505,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Bookstore fan",
               "gender": 1,
               "credit_id": "56be40569251417347004678",
               "name": "Leah Caruana",
               "profile_path": "/5lBm5jtCM8UFfyLt2Xg1v8Fk7nY.jpg",
               "id": 1514026,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Waiter / Library Patron",
               "gender": 2,
               "credit_id": "56be40e7925141734700468c",
               "name": "Dean Barlage",
               "profile_path": "/dk6ZhpAG4K2DgDmmWqUkM3BbPzR.jpg",
               "id": 1034648,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Book signing patron / person in park",
               "gender": 1,
               "credit_id": "56be410092514173440045da",
               "name": "Hayley Gagner",
               "profile_path": "/e4DQFomYxHOL7K2Z6TZOX5kr1QC.jpg",
               "id": 1576436,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Diner Patron",
               "gender": 0,
               "credit_id": "56be411492514173560047f3",
               "name": "Sabrine Ferretti",
               "profile_path": "/7BaeOXgeJIApl6ZgRDcZoKQzyq4.jpg",
               "id": 1286524,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Book Talk Attendee",
               "gender": 0,
               "credit_id": "56be416292514173500046c3",
               "name": "Lee O'Brian",
               "profile_path": "/9GXbGMG6Hg8MxPBEnSrelNbwLiR.jpg",
               "id": 1387036,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "546cd906925141305d001ce1",
               "name": "Krishna D.K.",
               "profile_path": null,
               "id": 81675,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "546cd91a9251413053001c7e",
               "name": "Raj Nidimoru",
               "profile_path": null,
               "id": 81676,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.384445,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 303281,
      "vote_count": 20,
      "budget": 0,
      "overview": "Yudi’s happy life is about to encounter a speed breaker-his BMW gets towed away and his dues have started piling up. He’s run out of money and luck! To make matters worse-his supposed ex-girlfriend isn’t really his ex.",
      "similar": [],
      "original_title": "Happy Ending",
      "runtime": 135,
      "poster_path": "/xAiIWa12o3yVpzQpMv4uh4EKFwu.jpg",
      "spoken_languages": [{
         "name": "हिन्दी",
         "iso_639_1": "hi"
      }],
      "production_companies": [],
      "release_date": "2014-11-21",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Krishna D.K.",
         "Raj Nidimoru"
      ],
      "runtime": 135,
      "synopsis": "An erstwhile bestselling writer gets attracted to another writer who has replaced him at his publication. While his only chance to get back some of his fame (& money) is to write a Hollywood meets Bollywood kind of script for a sleazy single screen hero who wants to make it big at the multiplex as well.",
      "writers": [
         "Raj Nidimoru",
         "Krishna D.K."
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt3017412/",
      "coverLink": null,
      "actors": [
         "Saif Ali Khan",
         "Ileana D'Cruz",
         "Kalki Koechlin"
      ],
      "reviews": [
         "Friends who have seen Raj Nidimoru and Krishna DK's (aka Raj and DK's) earlier ventures such as 99, SHOR IN THE CITY or the recent GO GOA GONE, would readily agree that the director duo really showcased some exceptional talent in these three films, moving ahead than a routine Bollywood project made on the same old set routine patterns. Hence, watching the witty promos of HAPPY ENDING, well supported by a few peppy dance numbers and an interesting cast really made everyone expect a fairly enjoyable rom-com from the team once again. But perhaps crime thrillers remain their proved forte and a romantic comedy is not exactly the genre Raj & DK are comfortable with. Because what they present in HAPPY ENDING is full of all been there-seen before sequences with nothing fresh except few occasional good dialogues or only four entertaining scenes of Govinda. Taking its clear references for certain insertions (like the book reading one) from BEFORE SUNSET (2004) and more, HAPPY ENDING begins on a fairly interesting note and then goes on to become a boringly long ride with everything predictable till the end. The romance loses all its charm as it progresses and the writers remain confused between their target audience making a vain attempt to cater the viewers within the country as well as abroad. In fact this has been the dilemma or conflict seen in most of the projects today when they try to incorporate plots for both the diverse territories and in the effort make a complete mess out of the film deliberately. With no impressive performances delivered by the lead pair, HAPPY ENDING once again wastes the gifted Govinda just like the last week's KILL DIL. The veteran has only 4-5 scenes in the entire film, but still manages to give you at least something to cheer in those few minutes, especially in the song \"Nacho Saare G Phaadke\" offering his famous and immensely enjoyable dance moves. Saif Ali Khan continues his 'no-show' post BULLETT RAJA & HUMSHAKALS, plus Ileana D'Cruz gives another similar yet sweet kind of appearance as the fellow writer. Ranveer Shorey tries hard to contribute his bit & does bring some rare smiles with his witty dialogues but Kalki, Preity Zinta and Kareena Kapoor fail to add anything significant to this long, painful watch in their small cameos. Music remains the only saving grace in the film (with few catchy dance tracks), which unfortunately doesn't get the support it deserved from the script. On the other hand Cinematography as well as Background score do not come up with any extra ordinary feature to mention here. In short, its really strange why the director duo chose this kind of stale and overdone subject for their next venture\u0085.. Or was this another case of the producer interfering into the script as per his own vision as always. In any case, HAPPY ENDING is not at all a HAPPY watch to recommend with nothing else to offer except Govinda. So you can easily give it a skip to be later watched at any Cable Channel or on Home Video when its official DVD gets released in the coming week.",
         "well, it was a movie i watched till the end, so it wasn't horrible. and i had gone fully prepared to abandon it midway, but i guess i didn't. and i don't like romantic comedies to begin with, so there i have my disclaimers out of the way. basically its a slow paced movie, and not very well made so it just trudges along predictably, while making fun of other such predictable movies. saif is the centrepiece of the movie, and he does hold it together ; but we've seen similar performances from him before. his alter ego is quite annoying though. elena is a total miscast, seems like she is in a daze. govinda has been one of my favourites, and its sad to see him having aged and playing second fiddle. preity zinta is also a mistake i think; should have had a fresh face. why do we need to see her ageing ? and in such an inconsequential role too. ranveer shourey also does not add much to the movie. apart from saif i guess none of the characters have any depth. the dialogues are quite predictable ; and i can see a new trend of having the characters speak in an American way. the only thing i liked was the ending where they preserved some of the story's integrity.",
         "After the disastrously dull Go Goa Gone, Writer-Director Duo Raj Nidimoru & Krishna D.K, churn out a rather predictable film with 'Happy Ending. The Storytelling, The Treatment & The Exeuction, offer no novelty at all. A Been-There-Seen-That Rom-Com! 'Happy Ending' Synopsis: A once-successful author finds his life on the edge, until a fellow-writer inspires him to write again. 'Happy Ending' lacks the wit & energy, besides it being shamelessly predictable. The central protagonists portrayed by Saif Ali Khan & Ileana D'Cruz (both looking tired & bored) aren't romantics by nature & that's the prime reason why the on-screen chemistry between the two doesn't work. But not all's bad in here, 'Happy Ending' redeems itself to some extend, by giving us some deliciously entertaining supporting characters. Govinda, as a fading film star, hits all the right notes, despite being reduced into a brief cameo. Ranvir Shorey, as Saif's best-friend, who's petrified of his wife, brings the house down. He's hilarious! Kalki Koechlin, as Saif's stalker girlfriend, however, steals the show with a terrific performance. Her scenes are the high-point of the enterprise. Sadly, there isn't much of her! On the whole, 'Happy Ending' is a letdown.",
         "After GO GOA GONE, the director duo - Raj & DK is one of my favorites. Their films have everything that the youth can enjoy - ROMANCE, COMEDY, NAUTANKI, EMOTIONAL DIALOGUE, SUPERB SOUNDTRACK, EXTRAORDINARY LOCATIONS, DOUBLE MEANING JOKES & LOL/ROFL MOMENTS. This film is better than the previous that I don't know, but, it's surely enjoyable with LOL. Saif Ali Khan is perfectly suitable for these kind of roles. His long hair, his shorts, designed T shirt, cool sun glasses & macho body. Ileana D'Cruz looks sexy in some dresses. But allover looks okay but acts well. Kalki is unbearable for some of the boys in the audience. She has a small role. Kareena & Priety have a special guest appearance. While I liked the role of Priety. Ranveer Shaurey is damn funny as always. But the main reasons to LOL in H.E. is Govinda. He is too funny. Me & my friend could not be able to control ourselves while laughing out loudly. Sachin-Jigar has given a marvelous soundtrack. ALL the songs are catchy. Dialogues by Hussain Dalal are fine. But, it could be better than these. Screenplay is good as well. Some portions has to be little bit faster than the actual. Raj & DK's direction in their second film is outstanding. Some scenes may able to open your eyes as well as mouth saying Wow. Locations are of to mark. Salute to the DOP. On the whole, who loved Go Goa Gone, just go for it. Those who didn't like GGG, just watch Dabang2 type movies. I don't know about any other RJ or critic's ratings, but, as per my enjoyments, I am giving 8*/10*.",
         "A thoroughly entertaining movie. Sure it starts off slow, and along predictable lines, but the punch lines are awesome, given with really hilarious acting. The script was amazing. In the way that it was no different than regular Bollywood movies yet so amazingly entertaining. This movie was definitely a fine balance of romance and comedy. Cameos by Kalki, Ranvir and Govinda were also appreciable. However, Saif and especially Ileana rocked the movie. The songs were timely and good (save the first one). The romantic conversations between Saif and Ileana were great. All in all loved the movie. Please do watch this if you're a fan of bollywood :)",
         "Every Thing Was Perfect... Must Watch Saif Ali Khan, Ileana D'Cruz, Govinda and Kalki Koechlin All did the great job... Bollywood must make movies like this Different Story Line Great Work Best Of Luck i hope it will be Success on Box office... Also Wins heart of people............. G Phaad Ke ..... is a song in this movie and entertainer song ....... Happy Ending is a Hindi romcom bollywood movie directed by Raj Nidimoru and Krishna D.K. and produced by Illuminati Films......Yudi (Saif Ali Khan) is a writer who hasn't written anything for a few years. He is caught between finding inspiration and finding love. Armaan (Govinda) a fading movie star who goes to Hollywood to get a Bollywood script written in Hollywood style in his desperation to save his stardom.[6] He approaches Yudi to write a film for him. Habeb Al_janaby",
         "This film is illuminati's 5th film. And every time i watch a movie of this banner i left with 'wow'. Happy Ending is one of those movies. The cast of the film is superb. All of them especially Saif and Govinda plays their role superbly. Songs of the film are good. G phaad ke and jaise mera tu are my favnurite. First half of the film was quite slow. The only thing that lacked was script writing. But overall, film is very good. After Humshakals, saif is back in form. And i liked that. But film is not finding audience. So, i will recommend to go for it. You will definitely likes it guys. I will go with 6/10. And you should watch it guys.",
         "I saw \" Happy Ending \" yesterday. Well, it isn't a bad movie but then again it isn't really entertaining either. There are some moments that are outright boring but these are balanced out by the \"relatively\" funnier moments. Saif plays the character of Yudi who is a broke writer as his books are not selling anymore. When an unsuccessful Bollywood actor (played by Govinda) comes to Los Angeles where Yudi lives and asks him to write a script for his next movie, Yudi gets a chance to redeem himself. Now, the story seemed to be nice to me which is why I decided to watch the movie, but after watching it I wish the directors could have interpreted the story in a different manner rather than making it look so cheesy on screen. Saif is used to playing peppy characters. He has played one in this movie. But I just wish the movie was as lively as Yudi is shown to be. On a completely different note I fell in love with Yudi's red convertible BMW and the super-posh LA locality where he happens to be staying. For all the American affluence that has been shown in the movie, I'll give it a 7 out of 10.",
         "Happy Ending does just what the doctor ordered, providing a sweet romantic comedy at the end of 2014. The story is as fundamental as it can be, still the events playing out on the screen are as refreshing as tangy orange after a exhaustive workout, makes you smile more often than not. You get to see what you want, with Ileana stealing away the heartbeat with each of her grace and timely dialogues. The dialogues are wittingly written, Saif and Ileane did justice to it. The romance develops fittingly with this generation, direction is simple yet meticulous.Govinda seems getting close to his old times best, Ranvir is apt in the supporting role, with Kalki also doing reasonably well.Some lively music and Rekha Bhardwaj's unique voice has filled in the silent voids well. Overall one would have a hard time finding a dull moment, with the audience asking for more.Ileana deserves a special mention for having brought me to the the theater, rest all the review is objective.",
         "Direction by Director duo Mr. Raj and Mr. Krishna, is good. There is nothing in the name of story written by director themselves. Yes love stories have rarely something new to offer but this one has literally nothing. Dialogues by Hussain Dalal are witty. Screenplay is OK. Few scenes are quite good and innovative. Like, the scene when both lead ask for lift on roadside is routine but the way they have improvised and presented made it fresh and innovative. The bed scene in hotel started with common note of extra room not available type of lame excuse but then ended with a very fresh and entertaining way. The restaurant scene started with a common way but ended on a cute note of both had poured water on each other. Screenplay is actually in bits and pieces. Sometimes you enjoy the movie but then it bores you too mostly. This boredom comes due to absence of story too. Interval is just because they had to divide the film in two part otherwise it was not required at all. The filmy stardom satire through Govinda's character was not so apt. Performance wise Saif Ali Khan is perfect in his comfort zone. Ileana D Cruz is fine. Kalki is a good actress but nothing was her to perform then also she is good. Govinda and Ranvir Shorey are OK. Music by Sachin Jiagar is good. \" Pajji tussi such a pussy cat\" is foot tapping and \"Jaise Mera Tu\" is melodious.",
         "Yogi (saif) is a writer who is involved into work but doesn't really care for feelings like love. In that aspect, he rejects one girl (kareena) and after that comes Vishakha (kalki). She loves him so much that she also puts an app in his mobile which shows his location. Meanwhile, he gets an offer from Armaanji (govinda) an actor who wants to capture mulitplexes. For that, Yogi decides to become friends with Aanchal Reddy (ileana) a writer whose novels are hot property. In that process, he falls in love with her. What happens after that forms the rest. The directors have come up with a good storyline and while the presentation was rich, the narrative was engaging . The dialogues were well written. The script was decent and the tight screenplay made it better . The background score was melodious and two songs were worth watching. Cinematography was good. Editing was okay.Costumes were well designed and stylish while the art department was colorful. Saif Ali Khan dominated with his presence and did his two roles very well. Ileana is very expressive and naturally photogenic, she was nice. Kalki was energetic and good as the psycho girlfriend. Ranvir Shorey was hilarious,his act was standout. Govinda rocked with his role whenever on screen. Andrew Kneebone came and went. Preity Zinta was brief but good. In this film, the first half breezes smoothly with elements of romance, some comedy and also some dramatic moments. The interval bang was good and films keeps on going with the light hearted romance and comedy well. Over Saif Ali Khan who is synonymous with romcoms, so is this one any different, well it is predictable, and it is clichéd at times but are not all romcoms now, this one still has fresh presentation, and it has hilarious moments. Overall the film has beautiful locations, it has many LOL moments, It is acted well, and the film is very fresh and breezy. A recommend watch. 4/5* or 8/10",
         "Happy Ending was a complete surprise with engaging script , hilarious moments and nice songs. A struggling author gets a chance to write \"kick-ass\" script for an ageing actor who himself is planning to re-invent. From the director of entertainments like 99, Shor In The City and Go Goa Gone, Krishna D.K., Raj Nidimoru gives you another wonderful story after a long time on Indian Screen. The theme is niche and will be acid test for them if it will be accepted by Indian audience. The film starts off very will with Saif Ali Khan, Ranvir Shorey and Govinda tickling your funny bone. Directors do not waste much time and gets into crux of the plot. Till interval , you will be engaged and entertained but the second half becomes little monotonous and climax scene could have better executed. Krishna D.K. and Raj Nidimoru are getting better with each film and this one is no exception. Screenplay is tight but loses the steam later. Art direction and cinematography is awesome. Dialogues are funny. Music by Sachin-Jigar is foot-tapping with\"G Phaadke\" being pick-up from the lot. Performance Ranvir SHorey, Govinda and Saif Ali Khan is note worthy. They are amazing and will make sure to entertain you. Illeana overacts and Kalki does justice to her part. Overall , Happy Ending is a feel-good rom-com attempted by the director duo and probably witnessed on Indian Screen after a long time and thumbs-up to the makers for trying out something new. Good 3/5",
         "Lending quirky touches to a romantic soufflé through its protagonists who are quite similar in their attributes, director duo Raj and DK give a Woody-Allen type verve to the rom-com genre in their latest flick, \"Happy Ending\". It gives us a feeling of \"Been here, seen there\" when we encounter the philandering and commitment- phobic writer, Yudi(played by Saif Ali Khan)who just can't say \"I love you\" to any of his romantic interests, because he feels love comes with a big baggage. Riding on an ostentatious high in Los Angeles with his success- script which he wrote five and years ago,Yudi is happy with his highly questionable 'single' status, his miserably married Montu(Ranvir Shorey) and the grizzly grumpy alter-ego, Yogi(Saif again, with thick long beard and paunch)who advises philosophy and gives him gyaan. And this is until one fine day , when he collides with the harshest reality - he has virtually gone bankrupt with no financial support to pay his bills. In a desperate move to gain quick bucks, he agrees to write a 'kick-ass' script for a fading Bollywood superstar, Arman-ji(Govinda)whose career is on a downward spiral and he needs a hit badly. To get inspiration, he follows the gorgeous romantic- novel writer Aanchal(Illeana) who brushes off his charms initially only to fall into love. Right from the start,Raj and DK achieve an instant connect with the audience. Unlike their previous projects (Shor in the city,Go Goa Gone),the setting here is quite urbane - foreign locales,skyscrapers,bright sunny days and the sprightly dialogues that make the mood upbeat. And the best part of the film are its hilarious moments of laughter , specially involving Yudi and Montu when they break into Yudi's ex-Vishaka's(Kalki Koechlin) flat.The romantic built-up meanders through a long drive alongside the scenic beaches, the sun playing razzmatazz with the sea waves which ends up funnily with the couple on bed. However, the second half trespasses into a slog zone ;perhaps the writers wanted to try too much of their sensibilities to make it more palatable by offering us the routine slow music numbers, the lovers' conflicts and a conventional climactic airport scene. What certainly works here is the rehash of the characters that Saif Ali Khan has already played. Reprising the same uber-cool, urbane and metro-sexual ,self-conflicted lover, he gives Yudi an endearing touch and the ingenious charm which is his forte. At the same time, the actor must contemplate about re-inventing himself before being typecast.Govinda puts forth a delicious Bollywood narcissist who throws up some real gems and you get a moment of 'aww' when he goes shirtless to show his newly developed abs.Ranvir Shorey, in his typical straight-faced avatar, is the staple source of all humor that goes as a credit for the movie.Kalki impresses with her psycho- stalker syndrome and its her uninhibited self which makes the character interesting.Illeana's looks sweet but her character comes across as a fluffy one without much of depth.Preity Zinta as Yudi's 2AM friend has an extended cameo and you might get a pang of the yesteryear Salaam Namaste! On the whole, Happy Ending is a breezy feel-good entertainer. It starts happily and ends happily. And as the writer says, \"Dont Analyze Love, just live the moment\", it calls for a momentous indulgence with modern-day relationships.",
         "Don't miss this one. Its from the directors of Go Goa Gone, so you know what to expect. Don't miss this one. Its from the directors of Go Goa Gone, so you know what to expect. Their films have everything that the youth can enjoy - ROMANCE, COMEDY, NAUTANKI, EMOTIONAL DIALOGUE, SUPERB SOUNDTRACK, EXTRAORDINARY LOCATIONS, DOUBLE MEANING JOKES & LOL/ROFL MOMENTS. This film is better than the previous that I don't know, but, it's surely enjoyable with LOL. ALL the songs are catchy. Dialogues by Hussain Dalal are fine. But, it could be better than these. Screenplay is good as well. Some portions has to be little bit faster than the actual. Raj & DK's direction in their second film is outstanding. Some scenes may able to open your eyes as well as mouth saying Wow. Locations are of to mark. Salute to the DOP. On the whole, who loved Go Goa Gone, just go for it.",
         "Well, the makers didn't really put up a contest for us to guess what the film would be about. Because we all knew it would have a beginning, a body, and yeah, a happy ending. So, lets not discuss cliché, and focus on why Raj & DK's latest venture is just below average. Saif Ali Khan is in every single frame. And he shimmers, with his 'dude' like costumes and brattish, dapper look. He plays Yudi, a broke writer who has a studio apartment in plush Los Angeles. Now hold your horses before I blurt out more deductions, and this is just the first five minutes. He chases skirt as a full time job, but doesn't believe in commitment. This is the crux of the clichéd story we have vowed not to talk about. Frames pass by with bits of average humor and drama, and another writer turns up. Aanchal (Ileana) is the female version of Yudi, who is originally a fake, but you shouldn't worry about it (even the writers don't). A phony weirdo (Govinda) comes out of nowhere and asks penniless, one-book old writer Yudi to pen a script which shouldn't be \"hard-hitting and fine as life.\" This is like a film inside a film, and it sucks big time. If all other sequences of the film except the ones with Govinda in it were to be trimmed out, I would have personally marched to the production studio and burned the prints of the film with gasoline and then proudly be incarcerated for arson. And then somehow I'd have written a review from inside the prison. Now Govinda is fine with his portrayal, I loathed his character for mocking reality. Yeah, he and his dialogs spark and take potshot at the reality bits of film-making - the Southern film remaking machinery in Bollywood, plagiarism, et al. But, along with all that we had to put up - his physique and blown-off, heavily expletive- ridden songs, I almost had a panic attack myself, just like Yudi constantly has in the film. Ranvir Shorey is the only character that I enjoyed watching; his funny dialogs actually made him look like a hero from a Pritish Nandy production, but it was satisfactory. Koechlin was fine. And surprise, surprise - Preity Zinta has finally come out of the cave and portrays so realistically the role of a cleavage-revealing, thigh-flashing, generously saggy boobed mother of triplets. I almost thought, looking at her physique, that she really gave birth to the triplets for the sake of the role. Cinematography, editing, and all those stuffs that Bollywood usually doesn't bother about while making a film were fine. It is evident that the makers wanted to come up with a film that would reflect the Y, the X, and the selfie generation clubbed together, but the recipe is so outdated and stale that if it were to be found in the recesses of popular website 4chan, it would not surprise me. BOTTOM LINE: Raj & DK have carved out a film using resources from various facets of traditional life, re-enacting them in a foreign location, spicing normal dialogs, casting hot actors, tinging it with generic essences of romance and commitment-phobic expressions to conclude in a corollary that evinces how broke and expended all the people connected with the project really are, which includes Saif and excludes puppet Ileana. All said and done, it is a below average film that you may check out soon to forget it before another film releases next Friday. Can be watched with a typical Indian family? YES",
         "Happy ending is a movie about a writer(Yudi) who wrote a book five and half year ago and still enjoying the fame got from it.He loves to date girls but is not committed with any girls.According to him 'I LOVE YOU' is the beginning of the end of a relationship.He thinks that after marriage you can't lead a good life as after marriage your life becomes full of problems.One day he is dumped by the publisher as a new bestseller writer(Aanchal) overtakes him.He becomes bankrupt so he agrees to write a film script for Armaan,a bollywood star who wants to gain his fame back.Yudi has wrote many stories but never finished any due to a suitable happy ending.He dates Aanchal and falls for her.How he gets Aanchal and a suitable happy ending forms the rest story.Screenplay is good and flow of the story is excellent.Dialogues of the movie are very nice and humorous.Saif has played such type of roles many time and this time again he steals the show with his role of a confused writer but he looked older.Illeana looked sweet and her chemistry with Saif was superb.Ranveer and Kalki essayed their respective roles smoothly.Govinda is awesome and his dialogue delivery is truly amazing.His well sculpted body is hot.Locations are good and music is average.Cameo of Preity and Kareena was good.They both looked gorgeous.Happy ending is a spoof of bollywood romcoms.In these days of south remakes and mindless action movies this is worth a watch.No doubt it has its flaws yet it is like a current of cool breeze but don't go with too much expectations.Overall a funny romantic story..... RATING : 6.4 out of 10",
         "Every Thing Was Perfect... Must Watch Saif Ali Khan, Ileana D'Cruz, Govinda and Kalki Koechlin All did the great job... Bollywood must make movies like this Different Story Line Great Work Best Of Luck i hope it will be Success on Box office... Also Wins heart of people............. G Phaad Ke ..... is a song in this movie and entertainer song ....... Happy Ending is a Hindi romcom bollywood movie directed by Raj Nidimoru and Krishna D.K. and produced by Illuminati Films......Yudi (Saif Ali Khan) is a writer who hasn't written anything for a few years. He is caught between finding inspiration and finding love. Armaan (Govinda) a fading movie star who goes to Hollywood to get a Bollywood script written in Hollywood style in his desperation to save his stardom.[6] He approaches Yudi to write a film for him.",
         "its a best movie you also try to same things and same hero heroine is the best ever roll over Saif Ali Khan, ileana d'Cruz is best and also very comedy and for young generation they need this thought of movie inspire them all Preity Zinta is also look very cool in come back please try some more of same thing we all love this movie and no matter how peoples react but for new generation we like this thought of your movie all the best and very good casting and team work and you choose the best places for shooting keep making good luck.",
         "For a director duo's first film, Happy Ending is a well packaged product. In fact one can describe the movie as a male version on a chic flick. Saif Khan again repeats his act of an over grown child coming of age in love and life. Ileana is good but Kalki towers upon her with a sublime performance. Priety Zinta is good and seeing her with Saif in a shot one might believe its Salaam Namaste 2. But Happy Ending really belongs to Govinda who plays the act of an ageing superstar who wants to move from single screen to multi screen. His dance moves, comic timing, and now the 6 pack abs steal the scene from the rest in less than 20 minutes of screen time. Watch it if you want to see a rehash of 4-5 Saif Khan movies and especially the class of Govinda.",
         "Happy Ending comes out as fresh flick unlike the same old formula based movies in the rom-com genre.Set in L.A., the plot revolves around a writer forced to work on a movie script for a rising single screen star,five and a half years after his maiden novel release.Saif pulls off the casanova image with ease supported by decent comic performances by govinda,ranvir shorey,ileana and kalki.Happy Ending is colorful movie with its fair share of comedy and decent music.It does not fail to mock at the lust of Hindi cinema for copying the south Indian flicks time and again.Happy Ending may not be the best of the movies of 2014 but it isn't bad either,and is definitely worth a watch.",
         "Happy Ending is a fresh film. The film in set in the US where Saif plays his cool urbane character.The plot moves on fast and is somewhat boring in parts though.But the directors have presented the script well. Saif Ali Khan does his job brilliantly . Illena D'Cruz, Ranvir Sheroy and Kalki have acted nicely. But the show stopper has to be definitely Govinda.He has just four scenes in the movie ,but he makes sure that all eyes are on him. He delivers his lines incredibly well. Music is funky and the songs are decent. To sum up, please watch the movie .",
         "HAPPY ENDING is yet another attempt by director duo Raj Nidimoru & Krishna D.K. to offer Indian cine audience glistening, newfangled & avant-garde cinematic experience by making a Kickass Romedy (As per Govinda in the movie) but it fails to strike the right chords. If we look at their past directorial ventures, they have made contempo & modish flicks, be it their first movie 99 or Shor in the city and Go Goa Gone with the underlying tone of the movies being either satire or spoof. Happy Ending is an extension to that and in fact, it seems that this movie in a way represents their personal contemplative on the typical rom-coms that they have always shirked away from making. But yes, one thing is sure that despite this being their biggest big budget outing so far as this movie has it all ; picturesque locales, big stars n even bigger ensemble starcast, glossy frames and great technical finesse, it lacks the soul.",
         "A producer/director will never ask you and me before making a film. They will make what they like. And we audience have to judge them on their own merits. Film is made under Illuminati Films' banner which has given us Love Aj Kal, Cocktail, Go Goa Gone. More about this banner can be read at Wikipedia. Happy Ending isn't meant for masses. It is a romantic comedy, but there was hardly any romance as such. Comedy never went over-board, and was very real. Acting was just perfect and was very lively. Characters were bit unorthodox which brought freshness, a book writer, a wanna be movie maker who likes to bring Hollywood touch to Bollywood movie, a hubby who is controlled by his wife, a mad funny girlfriend, a stud. All actors fits perfectly in the role. Full marks for choosing Ranveer Shorey, and Kalki for their roles. The life shown is what actually spent by young Indians living abroad in US. Shooting is very good , done probably entirely in US. Music is very good but not all songs are shown in the movie which was a good decision. Govinda is good in a cameo. But his role in Kill Dill has more punch and spice than this one. Characters use common urban language with words like Kiss, Sex etc. Don't watch this movie with family. Movie comes out with a simple but powerful and effective message that marriage is a reality and sooner you realize this, the better for you. Else you might keep looking for yet another chance and another and another and so on wasting your youth-chances all your life. Happy ending means putting your running-for-romance habit to an end and starting next phase of life which is married life. ... and yes there is one more Saif Ali Khan. But who is he ? A double role, or a hypothetical character ?",
         "Oh No Saif..not again. Till when are you going to portray the man child character on screen. It started with Yeh Dillagi way back in the 90s to Dil Chahta Hai to Hum Tum to Cocktail and now this film. Dude, I'm bored of these characters you play. You have the talent in you but you're wasting it. Hope Phantom will bring some reprieve. (Phantom got released a week ago and the reviews are not great, so its not a good time for Saif). When can we see you play again Langda Tyagi or Cyrus Mistry, roles which gave life to your career ?? Speaking of Saif, there are two Saif's which includes one who is his inner voice. Oh Saif, why ?? The movie is very slow and worse boring. And thats a pity considering it is written and directed by Raj & DK who gave us the excellent Shor in the City and the enjoyable Go Goa Gone. Looks like a case of lost in translation. Ileana D'Cruz in a meaty role doesn't disappoint. However, her character is poorly written like the film. Its the supporting casts that saves the film a bit. Ranvir Shorey and Kalki Kochelin are top notch and when they're on screen, you'll have a laugh. However, its Govinda who steals the show. In a short cameo playing a Bollywood star, he is fun to watch and his hilarious. Wish Saif, Raj & DK had given more screen time to Govinda's character. This would have been a far better film.",
         "RomComs (or Romedy as they refer to it in the film) has become such a major trend with Bollywood, and whilst there are many good ones out there - Happy Ending is certainly not one of them! Happy Ending is a typically clichéd film, with plenty of 'obvious' moments in the film, supported by very poor acting and a weak script. The story does not flow whatsoever, and after the intermission you're sort of unclear of what is actually happening. The 'happy ending' of the film is too obvious, and you already know what it will be around 3/4 of the way through the film. Saif Ali Khan is a very seasoned actor, but he is not able to carry such a film on his shoulders. Whilst his performance is okay at best, the storyline of the film just doesn't help him whatsoever. He is able to pull off some funny scenes quite naturally, and plays the casanova guy role off with ease but how many times is he going to play such a role? Ileana looks lovely on screen, but her chemistry with Saif is quite dry. Ranvir Shorey is the scene stealer each time! He is brilliant as Saif's best friend and some of his one liners will leave you in stitches. Kalki is her usual annoying self, but I guess that is her forte right? Govinda is funny in bits, but a little over the top at times . It was lovely to see Preity Zinta back again, even though it was a small role, and while she pulled off her part quite effortlessly, she doesn't look nearly as good as she used to - unfortunately for her (and I absolutely love her), age has taken a toll on her look. The music of the film is catchy with my favourites being Jaise Mera Tu and Khamma Ghani, but any music album that consists of a song like Paaji Tussi Such A Pussy Cat should be placed in the bin! Overall the film is a total bore, and you really question why you even decided to watch it. My advice is to save yourself and watch a proper RomCom!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "160-H Productions",
         "Charter Management",
         "Eros International"
      ],
      "summaries": ["A confused writer goes on the search of inspiration for his next story and falls in love with a best seller author who doesn't believe in love."],
      "budget": 0
   },
   "movielensId": 134815,
   "movielens": {
      "languages": ["हिन्दी"],
      "releaseDate": "2014-11-21",
      "dvdReleaseDate": null,
      "directors": [
         "Krishna D.K.",
         "Raj Nidimoru"
      ],
      "runtime": 135,
      "movieId": 134815,
      "title": "Happy Ending",
      "mpaa": "",
      "actors": [
         "Govinda",
         "Saif Ali Khan",
         "Kalki Koechlin",
         "Ileana D'Cruz",
         "Kim DeJesus",
         "Kareena Kapoor",
         "Preity Zinta",
         "Kira Cahill",
         "Leah Caruana",
         "Dean Barlage",
         "Hayley Gagner",
         "Sabrine Ferretti",
         "Lee O'Brian"
      ],
      "imdbMovieId": "3017412",
      "originalTitle": "Happy Ending",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["XxU1B54LRGs"],
      "plotSummary": "Yudi’s happy life is about to encounter a speed breaker-his BMW gets towed away and his dues have started piling up. He’s run out of money and luck! To make matters worse-his supposed ex-girlfriend isn’t really his ex.",
      "tmdbMovieId": 303281,
      "avgRating": 2.625,
      "releaseYear": "2014",
      "numRatings": 4,
      "posterPath": "/xAiIWa12o3yVpzQpMv4uh4EKFwu.jpg"
   }
}