{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "education",
            "id": 2470
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "senegal",
            "id": 6544
         }
      ],
      "imdb_id": "tt0442001",
      "video": false,
      "title": "Binta and the Great Idea",
      "recommendations": [
         31073,
         38640,
         41163,
         144097,
         79779
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "54c58f819251416eae0111fc",
               "name": "Zeynabou Diallo",
               "profile_path": null,
               "id": 1418649,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "54c590939251412489008aa7",
               "name": "Agnile Sambou",
               "profile_path": null,
               "id": 1418650,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "54c590a4c3a36823e3000d71",
               "name": "Aminata Sane",
               "profile_path": null,
               "id": 1418651,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4efbc3a36847f82b51ed",
            "name": "Javier Fesser",
            "profile_path": "/ljDbu5ncnRgatqwASA9VhZhOlRY.jpg",
            "id": 56470,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.693377,
      "production_countries": [],
      "id": 245017,
      "vote_count": 6,
      "budget": 0,
      "overview": "Binta, a little girl from Senegal, tells us about the everyday life in her village, the importance of education for the girls, and about her father's great idea to make the world a better place.",
      "similar": [
         21385,
         8392,
         1579,
         346,
         155,
         568,
         10527,
         19,
         22881,
         8871,
         792,
         49026,
         158852,
         157336,
         140300,
         597,
         10191,
         81003,
         363676,
         74643
      ],
      "original_title": "Binta y la gran idea",
      "runtime": 30,
      "poster_path": "/AS9f17yZkHFiRGUE0h88oKbxML.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "2004-10-25",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Javier Fesser"],
      "runtime": 30,
      "synopsis": null,
      "writers": ["Javier Fesser"],
      "originalLanguage": "Jola-Fonyi",
      "imdbLink": "http://www.imdb.com/title/tt0442001/",
      "coverLink": null,
      "actors": [
         "Zeynabou Diallo",
         "Agnile Sambou",
         "Aminata Sane"
      ],
      "reviews": [
         "What a great treat to watch on Saturday upon waking from a night full of dreams! Thank you, Fesser, for your humanity and childlike warmth. Thank you for showing the so-called developing world in all its true glory, carefully hidden from the mass media, where we are only made to feel sorry for the poor people in Africa. And yes, there are terrible maladies, social and political in many African countries, but there are as well good places to live in a sustainable way, in opposition to our arrogant perception that takes for granted everyone wants to drive a car, and travel and see the world, and accumulate a fortune only to be ridden by fear and create even more unnecessary layers around ourselves as individuals and as societies. It strikes me this short was finished in 2004, before it became a trend for Hollywood stars and the like to adopt Senegal children. But I laughed out loud when I finally listened to the great idea, since it seems a total slap in the face of some do-good no-good well known names that have been the focus of a heated discussion here in London. Oscar for you! so you can go on spreading good vibes.",
         "I recently caught this gem at the Delray Beach Film Festival. I didn't know anything about it. It wasn't really promoted in any way. Luckily, it was part of a block of shorts I attended. Simply put, I was BLOWN AWAY by it. It was easily the best film I saw all week(including my own.) It takes place in an African village and the director captured the inner beauty of these simple, wonderful people in a way that is nothing short of magical. The music was top notch and complimented the fantastic imagery perfectly. I have seen many films, but few surpass this one. It's story transcends all barriers of race and celebrates the basic human goodness in all of us. Put this one on your must see list. You will not be disappointed.",
         "I honestly wasn't expecting too much out of this film. I watched it because I saw that it was made in Senegal, a wonderful country which I had the chance to visit 2 years ago. I simply wanted to relive my experiences and hoped I would see something that might remind me of my trip. I got so much more. OK, so the acting isn't THAT great, its obviously low budget, and there is really nothing too fancy here. But WOW, what a message! I found that it really captured what I got out of my trip to Africa: yes, Africa lacks much by the standards of Western Society. But there is a lot we can learn from them as well. I would gladly give up all of my modern comforts to go live in that much more simple society. The film also portrays the culture very well, and highlights the strategy of social progress via performance arts. This strategy is often used for advancement of human rights. I would definitely recommend this to anyone who is going to West Africa.",
         "This short film was nominated for an Oscar for 2006--losing to the incredibly clever WEST BANK STORY. This film isn't a traditional Western-style narrative, as the story is constructed in an unusual way--in addition to the story, there are interludes where the kids in a school act out some of the scenes. For example, a young girl pins to go so school but her father, a very traditional man, says she cannot because it's not a girl's place to become educated--she's to take care of the men. However, at times, this exact same struggle is being acted out by students of the local school where she would like to attend. This was odd and a tad confusing, but was also unique and interesting. In fact, the theme of this short film is schooling along with the notion that we are all the same and need to look out for each other. Nice sentiments, though occasionally done in a somewhat heavy-handed manner. Still, this was not a serious problem. In fact, the story itself isn't the best or most important part of the story. I really think it was just nice to have a glimpse of a totally foreign culture and gain insight into their spirits. A nice film that is well worth seeing, but probably should not have won the Oscar. This and many more are included on the DVD \"A Collection of 2006 Academy Award Nominated Short Films\" and is well worth buying because it is jam-packed full of 13 wonderful shorts.",
         "At almost 30 minutes, this is the longest of the film \"shorts\" on the DVD, \"Collection of 2006 Academy Award Nominated Short Films.\" This one didn't win but it tells a charming tale. There are actually two stories going on at once. One is of the members of a black African village to convince all the men to let their daughters go to school, to learn to read and write and to better themselves. It seems that the men still feel that they \"own\" the women and can treat them as possessions, to stay home and clean and cook. The other story is of a man who has the idea that he can adopt a homeless child, raise the child, give the child opportunities. If he is successful, and others follow his lead, together they can all improve the prospects of their people.",
         "The issue this film deals with is a young woman prevented to get an education. The treatment is overly didactic. It feels too much like \"feel good\" social propaganda. It does not help that non-professional actors are used. Acting is amateurish. Fortunately the camera work is professional. Curiously that adds to the general feeling that this is government propaganda. There are jabs at backwards social practices of rural provinces. Theater is used as a medium to educate the local communities of their backward ways and convince local folks to change. All of this is for a good cause. Yet, being propaganda, it is predicable and tiresome. I would have left the cinema if it were not for a subsequent short."
      ],
      "genres": [
         "Drama",
         "Family",
         "Short"
      ],
      "productionCompanies": ["Películas Pendelton"],
      "summaries": [
         "Binta is a tiny child in a village in Senegal's Bignona Prefecture. Her school teaches peace, tolerance, friendship, and fraternity. Two stories intertwine: Binta's older cousin Soda's father will not let Soda go to school; and Binta's father gets a grand idea when he learns that Westerners (tubabs) have so many fish they no longer need to work together and have guns to protect their wealth. He dictates his idea to Binta and then carries the paper to the lieutenant governor of the prefecture, then to successive higher officials. Meanwhile, the school children act out Soda's plight, staging it for her parents and the village. And what is Binta's father's grand idea?",
         "Binta, a little girl from Senegal, tells us about the everyday life in her village, the importance of education for the girls, and about her father's great idea to make the world a better place."
      ],
      "budget": 0
   },
   "movielensId": 135210,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "2004-10-25",
      "dvdReleaseDate": null,
      "directors": ["Javier Fesser"],
      "runtime": 30,
      "movieId": 135210,
      "title": "Binta and the Great Idea",
      "mpaa": "",
      "actors": [
         "Zeynabou Diallo",
         "Agnile Sambou",
         "Aminata Sane"
      ],
      "imdbMovieId": "0442001",
      "originalTitle": "Binta y la gran idea",
      "genres": [
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Binta, a little girl from Senegal, tells us about the everyday life in her village, the importance of education for the girls, and about her father's great idea to make the world a better place.",
      "tmdbMovieId": 245017,
      "avgRating": 3.7,
      "releaseYear": "2004",
      "numRatings": 5,
      "posterPath": "/AS9f17yZkHFiRGUE0h88oKbxML.jpg"
   }
}