{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1592503",
      "video": false,
      "title": "Alien vs. Ninja",
      "recommendations": [
         27058,
         39909,
         30305,
         142322,
         223646,
         51245,
         51106,
         60489,
         40914,
         128280,
         26439,
         73737,
         62149,
         15166,
         17940,
         26877,
         65214,
         61613,
         32629,
         36837
      ],
      "backdrop_path": "/aV42sRGmA6nbfMsj6CWn9F5aIk0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Rin",
               "gender": 1,
               "credit_id": "52fe4920c3a36847f818a4b9",
               "name": "Mika Hijii",
               "profile_path": "/gKUry0Yyj3Jn5XRzfNRmtjqPgtR.jpg",
               "id": 227615,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4bd",
               "name": "Ben Hiura",
               "profile_path": "/zMyDoDUClrjZgBmCpz2F2wtwOBt.jpg",
               "id": 227616,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Yamata",
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4c1",
               "name": "Shûji Kashiwabara",
               "profile_path": null,
               "id": 227617,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4c5",
               "name": "Masanori Mimoto",
               "profile_path": "/xQ8JVsQWYVndgnZlAdAP40Wxcue.jpg",
               "id": 227618,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4c9",
               "name": "Yûki Ogoe",
               "profile_path": null,
               "id": 227619,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4cd",
               "name": "Donpei Tsuchihira",
               "profile_path": "/mzHRylKMPOrlNneLRLuKaVkwyy9.jpg",
               "id": 227620,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4a3",
               "name": "Seiji Chiba",
               "profile_path": null,
               "id": 84748,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4a9",
               "name": "Seiji Chiba",
               "profile_path": null,
               "id": 84748,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4af",
               "name": "Seiji Chiba",
               "profile_path": null,
               "id": 84746,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4920c3a36847f818a4b5",
               "name": "Yoshinori Chiba",
               "profile_path": null,
               "id": 76173,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "539464c20e0a266dce00416c",
               "name": "Kuniyuki Morohashi",
               "profile_path": null,
               "id": 1176802,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "539464d50e0a266dbb00429d",
               "name": "Tetsuya Kudô",
               "profile_path": null,
               "id": 1328773,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "539464e80e0a266dbb0042a6",
               "name": "Ryô Uematsu",
               "profile_path": null,
               "id": 1328774,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "539465060e0a266dbb0042ac",
               "name": "Seiji Chiba",
               "profile_path": null,
               "id": 84746,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5394651e0e0a266db40041c9",
               "name": "Sôichi Umezawa",
               "profile_path": null,
               "id": 552561,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "539465400e0a266dce00417d",
               "name": "Yuki Ikeda",
               "profile_path": null,
               "id": 1328775,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.810508,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 57011,
      "vote_count": 27,
      "budget": 0,
      "overview": "A band of ninja warriors, led by an Iga Ninja named Yamata, witness a giant ball of fire drop from the sky and crash into the forest. When the warriors find and attempt to identify the object, they discover aliens that attack and feast on them. Yamata and the survivors swear vengeance, but in challenging the aliens, they learn that their weapons have no effect.",
      "similar": [],
      "original_title": "Alien vs. Ninja",
      "runtime": 81,
      "poster_path": "/bUhKcG7wqbdRRUCtsKh9unhP6qn.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "North CKY",
            "id": 24728,
            "origin_country": ""
         },
         {
            "logo_path": "/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png",
            "name": "Nikkatsu",
            "id": 955,
            "origin_country": "JP"
         }
      ],
      "release_date": "2010-07-03",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "Only one can win.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Seiji Chiba"],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Seiji Chiba"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt1592503/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BODk2NjEzNDkzNV5BMl5BanBnXkFtZTcwNTc2Mjg3NA@@._V1_UY268_CR6,0,182,268_AL_.jpg",
      "actors": [
         "Masanori Mimoto",
         "Shûji Kashiwabara",
         "Donpei Tsuchihira"
      ],
      "reviews": [
         "Plot? See title. Low budget? Yep. Filmed on digi-cam? Yes. Terrible CGI? You bet. Men in rubber suits straight out of Power Rangers? Oh man, you've seriously got to see it to believe how cool it is! Word to the wise: if you can't appreciate flicks like The Story of Ricky, you may not like this. It's an action-comedy, the effects add to the fun, there are plenty of cool bits and if you like kung fu this should leave you pumped-up. Watch this film! (An extra line to make the 10 minimum, please ignore)",
         "I saw this at the world premiere at the New York Asian Film Festival and it was a great deal of fun. Its a film where the title tells the whole story and if you're good with that you'll have a great time. The plot of the film has a fireball fall to earth \"several hundred years ago\"(nudge nudge). In it are some aliens which go about tearing up the villages. Into the mix are a bunch of ninja who stumble upon the creatures and decide to take them on. Thats it. This is a very knowing, very bloody, very fun film that doesn't try to do anything other than entertain. Most of the effects are very good, though the monsters are very much men in suits, which is fine. I mean they aren't reinventing the wheel just trying to have a good time. High art its not. High fun it is. Crack open a cool one, get some popcorn and some friends and enjoy.",
         "Another fantastic hyperactive movie comes out of Japan. In the wake of the recent years releases of over-the-top movies that come from Japan, \"Alien vs Ninja\" is right up there along with movies like \"Tokyo Gore Police\", \"Meatball Machine\", \"Samurai Princess\", etc. These movie are amazing with their low budget, excessive amounts of blood and gore, and totally crazy story lines. The story told in \"Alien vs Ninja\" is very, very simple. A group of ninjas are out scouting when a meteor crashes near their village. And a vicious alien has come to Japan, spreading havoc and destruction. Now it is up to the ninjas to stop the aliens before it is too late. \"Alien vs Ninja\" borrows elements from movies such as \"Alien\", \"Invasion of the Body Snatchers\" and \"Army of Darkness\". The alien, though it looks cheesy, was actually a nice enough touch to the movie. And you just got to love the way it sort of resembles a mixture between Godzilla and the aliens from the famous American sci-fi franchise. Oh, and it was also hilarious the way you could see it was just a dude in a latex suit from the way of the sleeves and pants were reacting to his movements and its general appearance. Moving on... The outfits worn by the ninjas were actually really cool, lots of nice details and rather cool appearance they had. The special effects were good enough, though at times it was obviously fake. But with a movie of this caliber, this hyped up speed and action, you don't really mind the low budget effects. And frankly, they were working quite well most of the time. The small creatures that went inside people's nostrils and throats were cool as well. \"Alien vs Ninja\" has a lot of fighting scenes in it, and these work quite nicely as well. They are well-choreographed and looks good on the screen (despite the cheesy alien). All in all, I found \"Alien vs Ninja\" to be surprisingly good. I was thoroughly entertained throughout the entire movie. Highly recommended for fans of Japanese movies, and for those liking gore and high-octane action.",
         "My god, I laughed and laughed...with it and at it. I was of course expecting a romp, but not..\"this\". They knew what they were filming from the start and it shows beautifully. Choreography was great, cinematography ditto. As to people dissing this work of art I only say : loosen up, guys! \"revdkooi771\" said that aliens and ninjas looked cheap blah, blah. Of course they look cheap, look at the budget. Look at the title of the movie. Does it reek with seriousness? I think not. It's like I buy a Justin Beiber CD, listen to it and say it's bad, the music is amateurish...of course it is and it's our fault if we can't turn on our brains and deduct that before we waste time, money and remaining grey cells. But hey, everyone has a right to speak his mind",
         "A great little romp of Japanese cartoonish madness. If you love weirdly titled, poorly shot films, then this is for you. It has bad CGI and even worse suits/puppets. How can I possibly defend it? I enjoyed it dammit. It had action, adventure, betrayal, and never let its budget get in the way of imagination. The little alien critters were grotesquely simple, while the big alien dudes were uncomfortably phallic. The comedy mostly came from bizarre deaths, and though these were more normal than usual (for this type of movie) the sword fights were more than convincing enough. This is the kind of film that young teenagers make with their friends on a nice summer afternoon. Only difference is, that here we have grown-ups that should know better, and with that immaturity comes innocence and excitement.",
         "This is a strange Anime-like, Power Rangers reminding Action-Splatter-Comedy. Doesn't this say all? Yeah it's sounds stupid but it's still entertaining as hell. Although it's done really cheap, reminding of some strange 90s series, I had to watch it until the end. It was original and contained quite a lot of cool ideas, the movie didn't take itself seriously and kept a nice grade of tension which I truly did not expect. The actors performance was nice, I wouldn't say the actors were bad at all they simply played strange roles. The whole feeling you get watching this is like: I'm watching something old-school, but no you are not! I have to admit, I will watch it again, perhaps not tomorrow but maybe this year and I won't regret it. Especially for folks who play video-games this might be really enjoyable.",
         "You cannot take a movie with a title like that seriously. And as the reviewer, who saw it at the New York Asia Film Festival also stated in his review: You can have a lot of fun with the movie. Why stop and start thinking or applying rules on this movie, that it cannot abide (like a story, dialog that actually has some philosophical statement and so forth) and will only spoil the movie for you? Having said that, it might drag at places, but the pace stays intact almost throughout the movie. I can only recommend this to people who love their low budget movies to be completely insane. And that is what you can expect from this movie. Almost non-stop nonsense. But in a \"good\" way! I enjoyed this at the Frightfest in London, where it played at midnight ... A great movie to close a day!",
         "When there are multiple copies of a DVD in my local exchange shop, as there were for Alien vs. Ninja, it usually suggests that the film is utter garbage, but in this case what it really meant was that your 'average Joe' clearly buys films with little idea of what they're actually getting, and has zero appreciation for comic-book-style martial arts craziness featuring amazingly trashy 'man-in-suit' aliens, tons of over-the-top gore, and a hot female ninja (played by Mika Hijii) in a tight rubber outfit. Admittedly, the plot is a little derivative (it's essentially Predator, but with ninjas) and the pacing is a little off, with the film taking quite a while to get going, but those who hang on in there will be rewarded with some incredibly inventive visuals and lots of mindless bloody action—think 18-certificate Power Rangers (that's 'R' rated for those of you in the US)—all of which proves hugely enjoyable if viewed in the right frame of mind (ie., let go of all sense of logic and accept the sheer silliness of the whole thing). In Alien vs. Ninja, the fashion conscious warriors wouldn't be seen dead in the traditional hooded ninja suits of the type found in many an 80s B-movie, instead opting for designer outfits equipped with nifty body armour and cool accessories; the aliens are dinosaur-like creatures—clearly men in rubber suits enhanced by CGI—equipped with deadly prehensile tails and small parasitic babies that crawl out of openings in their skulls. When the two species meet, the result is a whole deal of hyper-kinetic, well choreographed martial arts, with impressive sword-fights, lots of blood and guts (assorted severed limbs and decapitations), and plenty of gratuitous shots of sexy female ninja Rin bending over or doing the splits as she narrowly avoids being impaled on the creatures' tails or, later on, by the swords of the zombie-like ninja hosts of the alien young. I had a huge amount of fun with this knowingly daft, intentionally humorous and action-packed gore-fest, more than enough to ensure that I won't be taking my copy back to the DVD exchange shop: it's staying on my shelf, right where it belongs.",
         "Again and again people are having trouble with flicks coming from Japan. They used to be extremely gory but the scene over there evolved too and got a bit away from the gore. Still, they deliver weird flicks with fast moving ninja's or other persons. In other words, you have to understand there way of living, I mean the Eastern philosophy, to appreciate such a flick. I've waited a few months to get my hand on an official release, finally it's out in our region. And it was worth the wait for me. I enjoyed it because it had a bit of humour and gore in it. Naturally you have to dig ninja to enjoy it. First of all, the alien will be a let down for so many people. It doesn't look like \"alien\" it's more based on Godzilla and sometimes it's CGI and sometimes it's a man in a suit. Even the ninja's look a bit weird, you have the macho type more busy with his hair, a coward too old to fight and a real ninja. Naturally there's a female ninja too and it's funny to see that the alien wanted to grap her breasts. There is so much fun in it that you can't take it seriously. But it clocks in under 90 minutes and that's good. The first 20 minutes is all about stupidity and comedy, after that the gore and red stuff appears. If you know that the director also was responsible for \"Ninja\" then you know what I mean. You love this one or you will hate it, there's no in-between.",
         "I sat down to watch this on Netflix assuming it would be just plain awful based on the title alone. What I actually got is an low-budget poorly dubbed but ultimately very fun gore-fest of a film. Some of the action sequences actually aren't half bad and while the CGI and monster suit both are low-budget and the dubbing is just awful there is some semi-decent fight choreography. There is also a lot of humor, some intentional, some not so much. If you sit down with low expectations you can get a lot out of this film. For one thing there's a beautiful Asian ninja to look at, a goofy rubber alien, gory ridiculous death scenes that seem like something out FEAST or a Sam Raimi flick. Not sure how highly I'd really be willing to recommend it but you could do a lot worse, and I mean a lot worse (I'm looking at you Thankskilling).",
         "Though the was one part that was extremely reminiscent of the original 'Alien' movie (not to mention extreme similarities to the aliens depicted in this film and that) I found this to be extremely well choreographed, the swordplay in particular, for being one of the \"less known\" Asian films (at least to me). The choice of actors - and matching dubbed voices - seemed to also be very well chosen. Like most things translated and dubbed, I would have preferred this to be in the original language and subtitled, but that isn't really up to me. I may never watch it again (except for laughs and a few awesome moves), but it was pretty decent for an accidental late evening watch on Hulu. If any ever get the chance, before it's taken off Hulu, and you enjoy a semi-long action sci-fi ninja film, take a look.",
         "This is another weird, wacky Japanese genre effort in the same vein as Vampire Girl vs. Frankenstein Girl and Robo-Geisha. The title says it all: a group of ancient Japanese ninja end up going claw to sword (and eventually sword to sword) with some monstrous aliens (that look suspiciously like people in moderately expensive Halloween costumes).  There's really no more story beyond that and a hinted at love triangle between two of the male shinobi and their female counterpart. Nothing about the \"aliens\" is explained, they just show up and start swiping people's heads off and fiercely trying to grab boobs. Alien vs Ninja isn't as gross or ultra-violent as many similar movies can be, but it does have its moments. People get ripped in half and have little mind-controlling aliens crawl up their noses, and plenty of pink pepto bismol alien blood flows all over the place.  AvN won't win any awards for storytelling or production values, but it's a goofy and occasionally fun way to waste some time. There are better similar movies, but genre fans should find it worthwhile. ",
         "i don't know what got into me when i bought this DVD. it must have been the little i-like-trashy-movies-guy inside my brain (the one who laughed so hard when Ash shot his evil twin in the face... remember?). anyway. it all started with the embarrassing ninjas jumping from the rooftop at the very beginning. my sucky-movie-detector flashed an angry red... i was still motivated to watch it. (i mean come on, bad effects happened even in blade 2)it's a ninja movie. i expected some great fights. and there were some! thank you for that. but here's what annoyed me to no end: the blond guy and the monster. i know it's trashy on purpose. but there are different kinds of trash. entertaining trash and the kind that just annoys you. machete is a good example for good 'bad films'. alien vs ninja represents the other kind. i wont say more. you can heed my warning or go ahead and watch it. your move, pal!",
         "An alien lands in old Japan and takes on a group of ninjas. That's the plot but if you like ninjas, swordplay, bouncing aliens, gadgets, gore and pink babies this is the film for you. After the first great bit of fighting it slows down for a while then picks up the pace and moves fast until the end. The action is excellent and the film as a whole manages to be goofy and charming and exciting, sometimes in the same scene. It is low budget (it's mainly set in the same forest) but it is far more entertaining than a lot of mega-budget productions. The cast is good and plausible in the action scenes except for Donpei Tsuchihira as Nezumi the comic relief who is very irritating, though I only saw a dubbed version so he might be funnier in the original language. Though I doubt it. The alien design works well in the context of the film. It may be someone in a rubber suit but that's not necessarily a disadvantage. (That's indeed why some fans love the traditional Godzilla. None of this CGI nonsense.) The ninja team (well those that live) go off together at the end and I for one would like to see them in more adventures. Predator vs. Ninja anyone?",
         "I think this movie deserves 6\\10. At first half it has some boring scenes. The special effects sometimes are cheap like it was made on youtube. However the jokes are so cool and free and same time they not evil and hypocrite like I see in all same and predictable Hollywood movies. I really hate Hollywood movies this days. They are morally retarded and primitive. Like Avatar for example. Amazing visuals yet so dumb and retarded. AvN mostly seems to be a parody. The fights are funny at times. Some moments are completely bizarre like that f*ck you episode. I think fights made pretty nice here. Good funny movie. I liked the music played there. Reminded me of video games music. The actor play at times is prolonged. And some moments are prolonged. The overall feel after movie - that was fun. It gave me good laughter. I think jokes were creative and not hypocrite.",
         "I was first introduced to this film in Baltimore while at Otakon in 2010 where we had a good time heckling the crap out of it Mystery Science 3000 style. The cross synthesis between American and Japanese culture is beautiful in it's chaos of stylistic emulations. I personally think that Aliens Vs. Predator is trash when compared to the original Alien and Aliens movies. One of the glories I had while watching this movie was that by satiricizing Aliens Vs. Predator, there was a redemption with it's goofy spoof. Rather than space age sci-fi, this low budget film is themed around feudal Japan with warring ninja villages. A meteor crashes in the vicinity of a country, and the funny boisterous distraction continues from there. It's not a great movie, but can be a lot of fun if you're with creative friends. One of the comments that I made while they were removing the impregnated alien from one of the possessed ninjas throats was, \"This will never go over well in Utah.\" And in Japanese the possessed ninja asked, \"What happened to me?\" And, \"Well, you see when you're raped...\" Yeah, it could be awful. : -)",
         "Unfortunately this promising title fails to deliver. When I started watching this I didn't expect so much goofy and campy humor. Im a great fan of Keita Amemia's work, especially the ZEIRAM series and MIRAI NINJA. So when I saw the poster and the trailer for this film I expected something similar - cool Asian sci-fi action, with great atmosphere, created by the blend of genres. Aliens and ninjas - looked like this can't go wrong! But it did. There are a lot of boring dialogs. The movie's pace is messed up. Even for its 80 minutes it is still slow. It starts with a great opening shot that leaves you thirsty for adrenaline and you don't get it for the next 25 minutes. The real problem is the poor comedy attempts. The parody elements are annoying and they just ruin it all, which is a shame. It has a production value high enough to make it a modern B-classic. It's obviously a B-movie and no one expects state of the art effects from it. Actually I prefer the practical effects - puppets, costumes and animatronics are a breath of fresh air in this CGI era. What I like the most about it is the work of the art department. The character and creature designs are cool and the costumes are really neat. Some look like live cation versions of manga drawings. I guess that Ninja Gaiden fans would appreciate the looks of the main character. The martial art scenes are decent, but nothing really remarkable. Directing, camera-work and acting are mediocre at best. Alien vs Ninja is a great concept and I regret to see it wasted like that.",
         "ALIEN VS NINJA is a low rent sci-fi flick from Japan which basically sees a director assembling a handful of actors, taking them out to the woods and filming a series of short, brutal and ballistic fight sequences while trying to string together something resembling a plot. It's kind of like the zombie film VERSUS, yet lacking that movie's finesse and vitality, probably because the budget is a great deal lower. Instead of a plot, we get cheesy humour, even cheesier computer graphics and the dodgiest looking alien since the days of the '50s-era B-movie. Sexy ninja Mika Hijii spends much of the running time battling the alien threat in a skin-tight PYC costume; the director ensues she's either doing the splits or flying through the air artfully at all times. The aliens are silly and kind of fun, and the hyper-kinetic action can be a hoot at times. There are touches of black comedy, like a crow plucking at a severed head's eyeball, thrown into the mix as well. Is this a good movie? Far from it: it's dumb, plot less, predictable and clearly made on the cheap. Is it an entertaining movie? To a degree, yes; not something I'd consider watching again (it lacks the genuine B-movie intricacy of a film like CYBORG COP) but it passes the time for undemanding genre fans.",
         "since i got the movie i thought, going by the title it would be a basic fight and kill the monster movie and i was right, although it was completely outrageous, however the fight scenes (using words loosely) were entertaining. the movie itself was low budget but was made to look like a high budget movie which kinda saved it, if i have to be picky ,one character over acted to the point of wishing he would die soon, now the \"Alien\" looked like rubber but it was funny and as for the gore in the movie, soft for a movie for its type. this film is not a waste of time, i wouldn't buy it but i did rent it and i am glad i did, if u decide to buy/rent it watch it with friends but make sure u have a few cold ones. ;)",
         "I haven't seen much movies that are worse than this. Probably not 1. First off, you can't put random people in Ninja outfits, and expect them to be Ninja's! Worst Ninjas ever put into a movie. Oh, and Ninjas don't cry and wine all the time! Second, pff... how do i say this without crying behind my computer... The Aliens, they remind me of the Power Rangers era, except the enemy's of the power rangers in their outfits wore better costumes then these aliens... Then... worst is yet to come, some fighting scenes are pretty cool (especially between 2 ninjas), but with the aliens... The aliens dance like the powers rangers did, and... they... there is one scene, where they... pfff, they jump trough the air, shooting... shooting people! Yes, shooting. Aliens that shoot guns from ninjas. There are a couple of things wrong with that, first off, real ninjas don't use guns, second, its wrong because its just wrong, and third, why jumping?!?! Well, it's not not entertaining, its more laughable entertaining, because the movie was supposed to be serious... :P Well, you have to see it for yourself, just make sure not to spend (much) money on it. See it when you are drunk, with some friends and wanna laugh hard about how bad it is.",
         "This movie has a bizarre plot. Like, wow. Still, it's kinda good fun to watch actually. See underneath. -story- An alien lands in a forest (in what we are supposed to believe is feudal Japan. Yeah, right) and is found by a bunch of ninjas. You can pretty much fill in the rest yourself. -acting- Well, Id say 2 clicks above Power Ranger level. It's not really annoyingly bad but average at best. Some typical Japanese characters just annoy the hell out of you. But alas, that's normal with Japanense movies. Somehow. -special effects- Um, yeah. Where to start. the gory bits are actually quite well done. I was pleasantly surprised to see people get torn in half in a rather good looking fashion. some other bits are quite poor CGI. And the alien suit is too obvious a suit in some scenes. but overall, again, 2 clicks above Power Ranger level. -Fights- The most important bit. let's be honest. No one will watch this hoping to see shocking plot twists or major character development. The fights are actually kinda good. especially the ninja vs ninja bits are well done. smooth and slick, actually. The alien vs ninja bits are, eh, slightly less slick. But they're humorous. In a good way. This movie doesn't try to take itself seriously and the fight scenes reflect this. -Lolz?- Yes, lolz. Couple of things though. don't watch this hoping to see an epic ninja movie - don't watch this hoping to see a scary monster / horror movie - don't watch this when you re not in a light mood and up for lulz - don't watch this and try and take it seriously. The movie doesn't take itself seriously, neither should its audience. - don't watch this and be an analysing critic. it will ruin your fun. This movie is low level popcorn entertainment. It's not long at 90 minutes. But its a good laugh all the way through. With the right mindset ('this is gonna be bloody awful but hilarious none the less') this movie -will- entertain you. I started watching this thinking 'what am I getting myself into'. As it went on I was actually having a good time. Very lulzy to watch if taken with a proper dose of cba-ness regarding anything that makes a movie quality stuff."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Nikkatsu",
         "North CKY"
      ],
      "summaries": ["A comet crashes into a Japanese forest and a group of mighty ninjas must fight a group of killer Aliens before they reach their village and kill everyone."],
      "budget": 600000
   },
   "movielensId": 135454,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2010-07-03",
      "dvdReleaseDate": null,
      "directors": ["Seiji Chiba"],
      "runtime": 81,
      "movieId": 135454,
      "title": "Alien vs. Ninja",
      "mpaa": "NC-17",
      "actors": [
         "Mika Hijii",
         "Ben Hiura",
         "Shûji Kashiwabara",
         "Masanori Mimoto",
         "Yûki Ogoe",
         "Donpei Tsuchihira"
      ],
      "imdbMovieId": "1592503",
      "originalTitle": "Alien vs. Ninja",
      "genres": [
         "Horror",
         "Action",
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["7M_QC2fatXQ"],
      "plotSummary": "A band of ninja warriors, led by an Iga Ninja named Yamata, witness a giant ball of fire drop from the sky and crash into the forest. When the warriors find and attempt to identify the object, they discover aliens that attack and feast on them. Yamata and the survivors swear vengeance, but in challenging the aliens, they learn that their weapons have no effect.",
      "tmdbMovieId": 57011,
      "avgRating": 2.3,
      "releaseYear": "2010",
      "numRatings": 20,
      "posterPath": "/bUhKcG7wqbdRRUCtsKh9unhP6qn.jpg"
   }
}