{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt2406422",
      "video": false,
      "title": "Walking the Camino: Six Ways to Santiago",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4e38c3a368484e214d91",
            "name": "Lydia B. Smith",
            "profile_path": null,
            "id": 1202450,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.074909,
      "production_countries": [],
      "id": 217576,
      "vote_count": 1,
      "budget": 0,
      "overview": "'A Walk to Within: The Camino de Santiago' tells the story of walking the ancient 500-mile pilgrimage across norther Spain known as 'The Camino de Santiago'. The documentary follows six strangers from incredibly diverse walks of life as they attempt to cross an entire country on foot with only a backpack, a pair of boots, and an open mind. Each pilgrim throws themselves heart-and-soul into their physical trek to Santiago de Compostela, and their personal journey to themselves. As you watch, you will learn the rich history of this honored tradition, as well as witness the Camino's remarkable ability to change lives and provide those who choose to walk its paths with a greater sense of self and spiritual knowledge.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         297762,
         376867,
         394117,
         437557,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Walking the Camino: Six Ways to Santiago",
      "runtime": 84,
      "poster_path": "/aC2Z8g3cRy8bzF8PPaIMjKFeAAH.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2013-02-27",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.caminodocumentary.org/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Lydia Smith"],
      "runtime": 84,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2406422/",
      "coverLink": null,
      "actors": [],
      "reviews": [
         "Greetings again from the darkness. There aren't many traditions that span more than 1200 years, and only one of those involves walking 500 miles \u0085 the Camino de Santiago. Its origin is as a religious trek to Santiago de Compostela where tradition holds that the magnificent cathedral contains the remains of St. James the Apostle. These days, the Camino is no longer limited to those with Christian beliefs, and in fact many modern day pilgrims take it on as a personal quest rather than a spiritual journey. Director Lydia B Smith and her camera allow us to travel along with a group of (six) pilgrims, each with their own story, background and motivation. The journey involves both physical and emotional challenges, and results in varying degrees of self-awareness. One obvious difference in today's pilgrims versus those of medieval times is the experience is much more communal these days. Not only do the walkers eat and sleep in the same hostels along the route, they also freely share their emotions and thoughts with each other (and the camera). This contrasts greatly with the tradition of solitude and quiet introspection. Call it a lesson in generational differences. The elements rotate between favorable and challenging. The pilgrims must face cold, hot, rain, and wind. These obstacles of nature are magnified with foot blisters, sore knees and other bodily ailments. However, for most of these people, the mental challenge is every bit as steep. For 6 plus hours each day over approximately 35 days, they focus on the incredible scenery as well as their own thoughts. It's impossible to hide from one's self, even though friendship \u0085 and even relationships \u0085 form along the path. Each of those who complete the journey realizes it's not about the destination, but rather the inspiration and spiritual enlightenment – even if it wasn't their original goal. There is talk about the \"internal Camino\" and how you walk with your heart. Reflection on this spectacular path leads to harmony with nature and self. A lovely Spanish guitar accompanies our viewing pleasure, and it's impossible not to imagine ourselves on this journey. If inspiration strikes, just be aware that spending that much time with one's self is an activity far removed from our generation's typical day.",
         "This was very well done! The photography, the six main people followed, the music, the mood -- all were well-edited, directed, and produced. It shows the full range of the Camino experience: the internal thoughts, the spiritual insights, the physical strains, the solace of nature, the weather, the new friends made, and the sharing with others of all ages and from all countries. In many aspects, I enjoyed this documentary a little bit more than the commendable Camino film \"The Way.\" (I did the last 200 mile portion to Santiago with my two best friends in 2005, and heartily encourage everyone to give it a try...) This film will truly inspire you. Buen Camino!",
         "Nowadays we are constantly bombarded by disaster, horror and destruction on a daily basis. When I left the theatre after viewing \"Walking the Camino\" I was totally relaxed and felt that there was a greater purpose to life. As often happens to me, I had just finished reading a book by Paulo Coelho called \"The Pilgrimage\" where he describes his experiences on the trek to Santiago de Compostela. He had some pretty momentous stories to tell, so naturally I was extremely interested to find out that others have been doing this walk and also that a movie had been made about it. What makes the movie work for me was that we follow the trek of various couples and individuals from all sorts of different ages, countries of origin and occupations. Without exception, they all seem to experience trans-formative events along their journey and are far more in tune with themselves and the world at the end of the journey. The excessive walking and exercise seems to clean out their system from physical and emotional junk and allows them to appreciate the world that exists right in front of them on a NOW basis. Filming the end of the walk must have been really tough for the film maker, because all the subjects were so emotional about what they had been through and experienced.",
         "This film traces the progress and feelings of a dozen or so people trekking the Camino de Santiago, or Way of St James, to the believed remains of one of Jesus' 12 disciples at the Santiago cathedral. This is an ancient Christian pilgrimage stretching back it seems to at least AD 850. While there are many starting points and routes to Santiago, this film follows people from a range of nationalities, backgrounds, ages and abilities who commence at St Jean Pied de Port in south eastern France, some 800 km from Santiago in north western Spain. We see stunning countryside, intimate moments from those who are suffering, recovering and jubilating from their efforts. The volunteer hostelliers, priests and others they meet along the way enhance the context. The photography makes the film – it is brilliant and without this, the film probably would not have worked. The editing makes the viewer feel the transitions the walkers are experiencing, and must have been a challenge to select the succession of snippets that provide a cohesive narrative. The coda to Finisterre was a masterstroke and ended a well constructed documentary, recommending a high many pilgrims on the route may have overlooked.",
         "My wife and I have driven the Camino back in '93 but I could not walk it so this comment may be skewered a great deal; however, we did start it in Paris and drove as close to the real Camino as we could. I honestly did not want to give it a low vote because both Diane and I expected more from the film. I have often criticised reviewers for saying what I just said,\"...expected...\" because a viewer does not have the right to believe that a film should follow their cinematic desires. We did not think that the script picked the right people to follow on their journey. We also believed that the ones they did follow were cut off too quickly; those stories were the most interesting and we never heard of what happened to the people again. The camera work was very good, however, and the scenes photographed for the film were superb. However, because it was a documentary we believed that there could be more pedantic information about prices, foods eaten and places taken for sleep if the Camino establishments were full. A film for the thoughtful though.",
         "This film is AWESOME in so many ways. For those that have walked the Camino, this is a fantastic film for reminiscing and inspiring a second Camino. For those that are considering the Camino for an adventure of a lifetime, this is an absolute rendition of what walking the Camino is like. Yet, each person experiences their own camino; Prospective Camino walkers will experience their own Camino too! And for everyone, those that walked, those that aspire to walk, and those merely curious, the film touches every range of emotion, fear, tear, excitement, and laughter, and captures the spirit of walking the Camino! More info about the Camino (and the various routes for walking) is available at americanpilgrims.com or APOC. Buen Camino",
         "Sioux Holy Man, Black Elk said, \"The first peace, which is the most important, is that which comes from within the souls of men when they realize their relationship, their oneness, with the universe\u0085and that its center is within each of us.\" Lydia Smith's documentary Walking the Camino: Six Ways to Santiago follows six pilgrims from different parts of the world in their attempt to discover that center. The 500-mile trek to Santiago de Compostela Camino in Spain has been undertaken in the past by St. Francis of Assisi, Charlemagne, Ferdinand and Isabella, Dante, and Chaucer (and Shirley MacLaine), and has become a big part of Europe's tourist industry with thousands of travelers from every religion and walk of life completing the walk each year. Beginning in St. Jean Pied de Port, France, the path, beautifully photographed by cinematographer Pedro Valenzuela, crosses cities, small villages where cows meander in the center of the road, highways, mountains, and fields en route to Santiago. Wayne is an Episcopal priest from Canada who is undertaking the journey with his friend Jack to pay tribute to his wife who died four years ago. Sam has battled with clinical depression and looks to the trek to discover a renewed sense of self. Annie is an American who develops tendinitis and is forced to slow down, a welcome opportunity for reflection. Tatiana from France has brought along her three year old son Cyrian \"to learn many things that he couldn't at home.\" The boy's presence strains an existing family relationship with her brother Alexis, however. During the walk, a tentative friendship blossoms into a relationship between Misa and William. \"I'm just trying not to figure out why. I'm just supposed to enjoy it,\" she says. Tomás, from Portugal, like many others, has to deal with foot blisters, a painful knee injury, and changes in the weather that slow the trek. With everything stripped away, they rediscover their ability to transform their life. \"The mask disappears, and you transform into yourself,\" one man says. All struggle to some degree with physical and emotional difficulties along the way but discover that the profound connection which exists in community becomes stronger when you are hungry or hurt and tired but are determined to keep going together."
      ],
      "genres": [
         "Documentary",
         "Adventure"
      ],
      "productionCompanies": [],
      "summaries": [
         "Walking the Camino: Six Ways to Santiago follows various pilgrims, from ages three to 73, as they attempt to cross an entire country on foot - with only a backpack, a pair of boots and an open mind. Driven by an inexplicable calling and a grand sense of adventure, each pilgrim throws themselves heart and soul into their physical trek to Santiago de Compostela, and most importantly, their personal journey to themselves. Whatever their motivation, no one can predict just how their paths will unfold, what personal demons or angels they will face, or what transformations they will undergo by trail's end. Called \"A brilliant documentary\" by Martin Sheen, this multiple award-winning film has been selling out screenings worldwide.",
         "A profile of six pilgrims taking the Camino De Santiago pilgrimage."
      ],
      "budget": 375000
   },
   "movielensId": 135464,
   "movielens": {
      "languages": [""],
      "releaseDate": "2013-02-27",
      "dvdReleaseDate": null,
      "directors": ["Lydia B. Smith"],
      "runtime": 84,
      "movieId": 135464,
      "title": "Walking the Camino: Six Ways to Santiago",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "2406422",
      "originalTitle": "Walking the Camino: Six Ways to Santiago",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["LqlAGqeIVwk"],
      "plotSummary": "'A Walk to Within: The Camino de Santiago' tells the story of walking the ancient 500-mile pilgrimage across norther Spain known as 'The Camino de Santiago'. The documentary follows six strangers from incredibly diverse walks of life as they attempt to cross an entire country on foot with only a backpack, a pair of boots, and an open mind. Each pilgrim throws themselves heart-and-soul into their physical trek to Santiago de Compostela, and their personal journey to themselves. As you watch, you will learn the rich history of this honored tradition, as well as witness the Camino's remarkable ability to change lives and provide those who choose to walk its paths with a greater sense of self and spiritual knowledge.",
      "tmdbMovieId": 217576,
      "avgRating": 3,
      "releaseYear": "2013",
      "numRatings": 3,
      "posterPath": "/aC2Z8g3cRy8bzF8PPaIMjKFeAAH.jpg"
   }
}