{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "stranded",
            "id": 9743
         },
         {
            "name": "hatred",
            "id": 158449
         },
         {
            "name": "space opera",
            "id": 161176
         }
      ],
      "imdb_id": "tt2660888",
      "video": false,
      "title": "Star Trek Beyond",
      "recommendations": [
         54138,
         47933,
         13475,
         246655,
         68735,
         43074,
         324668,
         177677,
         308531,
         330459,
         205584,
         333484,
         87101,
         290250,
         343611,
         302946,
         313297,
         203801,
         534,
         333371
      ],
      "backdrop_path": "/6uBlEXZCUHM15UNZqNig17VdN4m.jpg",
      "revenue": 343471816,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "57932005c3a368636b006bd1",
            "content": "Some diehard **Star Trek** fans may not necessarily feel that the Justin Lin-directed third installment of this science fiction/space saga film franchise “boldly goes where no man has gone before” creatively. Surprisingly, Lin (director of two “Fast & Furious” flicks) shows some engaging and intriguing heft in **Star Trek Beyond** as the adventurous exploits of the USS Enterprise crew are likely to stir the collective pot where the nostalgic sentiments of the Star Trek brand from yesteryear bridges the gap to the current cinematic explosiveness of modern-day Captain Kirk and company. Although it is extremely difficult to immediately dismiss filmmaker J.J. Abrams’s resourceful fingerprints concerning the imaginative **Star Trek** (2009) and the thoroughly enjoyable **Star Trek Into Darkness** (2013) he graciously steps aside to allow Lin’s energizing directorial vision to further explore Trek mythology on the big screen.\r\n\r\nEssentially, **Star Trek Beyond** is a vibrant cosmic canvas that is expansive in its boundaries of exploration. Visually arresting, well-paced and armed with compelling story-telling and a healthy dosage of curiosity and mystery, Lin manages to stay true to the traditional Trek-oriented universe by incorporating rousing special effects and offering a galactic grandeur of planetary peculiarities and exotic alien races to stimulate the exquisite narrative. Screenwriters Doug Jung and Simon Pegg (Star Trek’s on-screen character Montgomery “Scotty” Scott) incorporate an eye-opening mixture of dramatic edginess, off-the-cuff humor and the cohesive rapport among the cast-mates that have inherited the iconic Star Trek personalities and made these familiar faces from the classic 60’s TV show and previous non-reboot films a revelation in the millennium age of blockbuster sci-fi action adventure.\r\n\r\nThe plot channels in a sense of challenging malaise for the USS Enterprise’s top officers in Captain Kirk (Chris Pine) and Commander Spock (Zachary Quinto). What seemingly spices things up regarding the deja vu space journeys aboard the spacecraft is the questionable and powerful device that Kirk and his crew are babysitting. This powerful tool of destruction is capable of destroying humanity as we know it. In particular, the opportunistic Krall (Idris Elba) is the lizard-looking culprit determined to get his diabolical hands on the corrosive contraption. Naturally, Krall and his menacing minions must subdue Kirk and his crew to achieve success in having this ominous object in his deadly grasp. Krall’s willingness to cripple the USS Enterprise proved to be an ambitious mission fully accomplished. For Kirk and his group the results were disheartening as Krall’s forceful attacks rendered the ship disabled as it crashed on the desolate planet of Altamid. Thus, Kirk and his charges are stranded on his rocky haven with no hope in sight. The harsh reality for the vulnerable USS Enterprise visitors, besides being divided and scattered in all directions on this problematic planet, involved getting into survival mode as the hostile reptilian creatures surrounded them at will.\r\n\r\nThe aforementioned split of Kirk and his exposed cohorts called for a series of various crisis carried on at different, chaotic spots. Kirk and Russian crew member Pavel Chekov (played by the late Anton Yelchin) were primarily tasked with trying to rescue their colleagues from the claws of Krall and his cronies. Elsewhere, Dr. Bones (Keith Urban) tries to patch up the injured Spock following the aftermath of the ship’s wrecking. Pegg’s Scotty and womanly warrior in alien Jayla (Sofia Boutella) make the valiant effort in trying to reach Kirk in the middle of total ribaldry.\r\n\r\n**Star Trek Beyond** has stylized flash and Lin ensures that his pulsating production stays faithful to the Trek legacy. Sure, **Beyond** is not anything innovative or wildly distinctive in comparison to the other earlier entries but it still thrives where it counts in the spectacle of space-aged escapism. The cast is solid as the players–Pine, Quinto, Pegg, Urban, Yelchin as well as Zoe Saldana’s Uhura and John Cho’s Sulu–all demonstrate a suspenseful unity on screen and give the audience an indescribable excitement in this latest chapter that far from disappoints. Elba’s Krall is robustly villainous in physicality and attitude and the alien race featured are interestingly hypnotic in creepiness. Lin, in the same vein as Abrams, is not shy about gift-wrapping his **Star Trek** edition in boisterous, sweeping helpings of scope and whimsy.\r\n\r\nOverall, this kinetic outing of **Beyond** practically guarantees that the rebooted **Star Trek** phenomenon will not be experiencing its final frontier any time soon.\r\n\r\n**Star Trek Beyond** (2016)\r\n\r\nParamount Pictures\r\n\r\n2 hrs.\r\n\r\nStarring: Chris Pine, Zachary Quinto, Zoe Saldana, Karl Urban, Anton Yelchin, Simon Pegg, John Cho, Idris Elba, Sofia Boutella\r\n\r\nDirected by: Justin Lin\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Space and Fantasy Saga/Action and Adventure\r\n\r\nCritic’s rating: *** stars (out of 4 stars)\r\n\r\n(c) **Frank Ochieng** (2016)",
            "url": "https://www.themoviedb.org/review/57932005c3a368636b006bd1"
         },
         {
            "author": "Linda Robinson",
            "id": "5795237dc3a3681f3100424b",
            "content": "I saw this movie two hours ago and I can't remember how it started. Ah. Diplomatic mission to offer a truce artifact to one of the warring sides from the other. It does not go well. Just a tad shy of 3 years into the 5 year mission and Kirk is bored enough to take a desk job. Screenplay set-up signifying it's all about to get much less stultifying. I don't know enough about camera angle choices to know if that's what makes the film feel disjointed, or the script, or editing chops, but something certainly felt unconnected. I started noticing details I had no business noticing. Everybody's hair is bigger. I watched Galaxy Quest recently, and when Krall showed up I choked on popcorn. In fact, prosthetics needed an above the title billing. Running from intruders in a dark corridor, I could see Uhura's earrings glinting. If I could see those, the enemy could, too. The device designed to End The Universe is too much like Big Hero 6. The space station too much like Elysium. And the jumpstart of a starship too much like Furious 7. One of these days in the near future scenic designers will stop putting skyscrapers on hula hoops in deep space. And it's a space station - where are all the people running to when the bad stuff starts happening? It's a scene device that needs to go. The Bad Dude airship docking station is right out of Independence Day. Can we get a little new here? Visual effects are gooey (literally) with some stuff that may or may not be a cue to the bee reference, and is at one point, squished out I don't know how while Kirk rides a vintage motorcycle in circles. And then the squish hardens. I also don't know how, or what that goo was supposed to keep in or out. Much of this is superfluous, but the story was not interesting enough to make me stop looking around. There are way too many wire bundles, a feature of Star Trek Next Gen Borg episodes. When we finally get the Bad Dude's backstory, it isn't enough. Kirk's bored, Bad Dude is disappointed, and how the hell Uhura survives every encounter requires too much suspension of belief. I also noticed that the guys in the theater were sporting ball caps with sunglasses perched on the brim. Noticing fashion in the cinema is not why I go to the movies. Read this week that Chris Hemsworth has signed on to the next Star Trek as George Kirk. Does not bode well for new better adventures.",
            "url": "https://www.themoviedb.org/review/5795237dc3a3681f3100424b"
         },
         {
            "author": "Austin Singleton",
            "id": "57acef75c3a368206600016a",
            "content": "Star Trek Beyond is what a summer blockbuster is all about. Read my full review here! \r\n\r\nhttp://www.hweird1reviews.com/allreviews/star-trek-beyond-review",
            "url": "https://www.themoviedb.org/review/57acef75c3a368206600016a"
         },
         {
            "author": "Reno",
            "id": "5835d8509251416c2e013535",
            "content": "**When theirs rescue mission failed...**\r\n\r\nIt's not like I'm a big fan of 'Star Wars', so I disliked it. I have seen many space adventure films, but I never felt this series so interesting. I enjoyed some of the 'Star Trek' films though. I know this sequel is not good the previous ones, but for me this look okay than those. Because it was so simple, particularly story wise, and the rest of the film was action and adventure.\r\n\r\nNo offense, but this series is like the collection of the rejections from other franchises. I mean, look at the cast, most of them are comedians and some of them are the category two actors and the rest are, I don't know what they are, bur decent actors. But these films pulled off successfully at the box office. Not a big impact like the recent 'Star Wars' film or any Marvel's films, but quite an impressive figure knowing the above fact I stated.\r\n\r\nFrom the Taiwanese director who made four 'Fast and Furious' films, handled his best for this. This film tells the story of the captain James Kirk, who leads his ship and crew to a rescue mission to a distant planet where some alien race who had stranded. But when they reach their destination, an unknown space army takes them by surprise and they too take a refuse on the same planet. From there how they plan to escape and to learn who were those attackers, all comes in the next half.\r\n\r\nThis id full of action adventure. The story was little, but quite neatly developed characters, I mean the new ones with some good stunt sequences. As usual, there's no complaint about the graphics. I mean for the casual viewing, but who knows if you carefully look for the flaws, you might get a few. I suggest you to watch it just for an entertainment, but it might fail to satisfy the die-hard fans of 'Star Trek'. I think overall, it is not a bad film, even the two hours long is not an issue due to the good pace. \r\n\r\n_7/10_",
            "url": "https://www.themoviedb.org/review/5835d8509251416c2e013535"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "58564e9d9251411a4604c3c2",
            "content": "Last Saturday me and the kids sat down to watch Star Trek Beyond which we received in the mail the day before. In general we liked the movie quite a lot. Plenty of action, good special effects and a not too bad story. However, one thing irked me to now end. They blew up the enterprise…again. Stop destroying the bloody Enterprise in every movie for Christ sake! Been there, seen that done that. It is getting both old and frustrating.\r\n\r\nApart from that it was a good entry in the new timeline movie series. I am not sure what all those people giving it one star ratings and calling it the worst movie ever expected to get? Anyone who has watched the two other movies should be expecting a fairly action loaded blockbuster with lots of CGI in it and that is exactly what we got. Personally I think this is a good thing. I was getting rather bored by some of the previous installments in the original timeline where they almost never fired a shot and tried to talk or reason their way out of every problem they encountered.\r\n\r\nThe story was not too bad although I have to agree that it did not really advance the story or timeline much. It was more like a TV-show episode blown up to a full feature movie. It worked nicely though as a action story although I would have liked to know more about how Edison transformed into Krall and, although that could be explained by some mutation caused by the alien technology, how he managed to transform himself back to Edison.\r\n\r\nThe CGI with the alien swarm moving fluidly over the screen and the huge Yorktown station was quite stunning as far as I am concerned. I also liked that the ships, both Enterprise and the Franklin could take quite a bit of abuse before starting to fail. In a lot of the previous movies as well as the TV-shows it took one hit and some console exploded and the warp core went down.\r\n\r\nAll in all both me and the kids quite liked this installment in the series.",
            "url": "https://www.themoviedb.org/review/58564e9d9251411a4604c3c2"
         },
         {
            "author": "lukan87",
            "id": "59fa29c1c3a3680f2c004509",
            "content": "I always loved these type  of movies.This one is very adventurous and full of suspans.\r\nNice one.I've watched it more than 3 times and every time i have the same feeling.\r\nExtraordinary😁!!!!",
            "url": "https://www.themoviedb.org/review/59fa29c1c3a3680f2c004509"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Captain James T. Kirk",
               "gender": 2,
               "credit_id": "54d9f3e0c3a3687aa900124a",
               "name": "Chris Pine",
               "profile_path": "/vSe6sIsdtcoqBhuWRXynahFg8Vf.jpg",
               "id": 62064,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Commander Spock",
               "gender": 2,
               "credit_id": "54d9f3ea9251410a4b0015bd",
               "name": "Zachary Quinto",
               "profile_path": "/gSBxQWda0T67hrK3pNyqreRYoyw.jpg",
               "id": 17306,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Dr. 'Bones' McCoy",
               "gender": 2,
               "credit_id": "54d9f3f29251410a3f0012aa",
               "name": "Karl Urban",
               "profile_path": "/tHYOUO33K7iaDw8nXyqRvDIkVuM.jpg",
               "id": 1372,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Lieutenant Uhura",
               "gender": 1,
               "credit_id": "54d9f3d99251410a450014e6",
               "name": "Zoe Saldana",
               "profile_path": "/ofNrWiA2KDdqiNxFTLp51HcXUlp.jpg",
               "id": 8691,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Montgomery 'Scotty' Scott",
               "gender": 2,
               "credit_id": "55927cc1c3a36877410007cd",
               "name": "Simon Pegg",
               "profile_path": "/23e2uoNlpDvLumNic16fS2YjZjL.jpg",
               "id": 11108,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Sulu",
               "gender": 2,
               "credit_id": "55927cdd9251415df8000739",
               "name": "John Cho",
               "profile_path": "/wlA5pkKGun8BS7GjCqXrzthTOk4.jpg",
               "id": 68842,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Chekov",
               "gender": 2,
               "credit_id": "54d9f3f8c3a3687abe00158d",
               "name": "Anton Yelchin",
               "profile_path": "/mrIe5ZDQG3py9apQmxy0MKfSI8x.jpg",
               "id": 21028,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Krall",
               "gender": 2,
               "credit_id": "55927cea92514152d500081e",
               "name": "Idris Elba",
               "profile_path": "/d9NkfCwczP0TjgrjpF94jF67SK8.jpg",
               "id": 17605,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Jaylah",
               "gender": 1,
               "credit_id": "55927cf7c3a368775a000773",
               "name": "Sofia Boutella",
               "profile_path": "/btLeUFNIGTxG7FecTMRztSALj6L.jpg",
               "id": 568657,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Manas",
               "gender": 2,
               "credit_id": "55bbd4ecc3a3686526000504",
               "name": "Joe Taslim",
               "profile_path": "/jTKPQryiRDTdlRot43FIDzARgi5.jpg",
               "id": 592496,
               "order": 9
            },
            {
               "cast_id": 116,
               "character": "Kalara",
               "gender": 1,
               "credit_id": "576f9c0d925141285500688a",
               "name": "Lydia Wilson",
               "profile_path": "/ndlya4VREXguyeZYLP7OB3HHjzu.jpg",
               "id": 1095524,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Keenser",
               "gender": 2,
               "credit_id": "55927d5cc3a36877570007be",
               "name": "Deep Roy",
               "profile_path": "/rCg84FP1x5tOutHKRB4OKhQeR4N.jpg",
               "id": 1295,
               "order": 11
            },
            {
               "cast_id": 118,
               "character": "Ensign Syl",
               "gender": 1,
               "credit_id": "576f9c0d925141190f0040e4",
               "name": "Melissa Roxburgh",
               "profile_path": "/4ujnM0rRBQKUFRYGDfTvVwMIUKz.jpg",
               "id": 1006731,
               "order": 12
            },
            {
               "cast_id": 122,
               "character": "Tyvanna",
               "gender": 1,
               "credit_id": "57a5a3dfc3a3684a25006cd3",
               "name": "Anita Brown",
               "profile_path": "/rfannDjHZ0XQzWERFOFJghS7EBs.jpg",
               "id": 119758,
               "order": 13
            },
            {
               "cast_id": 127,
               "character": "Ben",
               "gender": 2,
               "credit_id": "57ed6978c3a36842bb00202f",
               "name": "Doug Jung",
               "profile_path": "/tO5KexaTsUWEk2JDvF4GzVYRdCC.jpg",
               "id": 65779,
               "order": 14
            },
            {
               "cast_id": 121,
               "character": "Fi'Ja",
               "gender": 2,
               "credit_id": "57a5a3b39251410f3b002fb2",
               "name": "Danny Pudi",
               "profile_path": "/tQePBWCu70VyqBWZNQBHFFV09E9.jpg",
               "id": 205179,
               "order": 15
            },
            {
               "cast_id": 126,
               "character": "Zavanko",
               "gender": 2,
               "credit_id": "57ed6969c3a3683afa008365",
               "name": "Kim Kold",
               "profile_path": "/pvbowINXuR5FSXxemujx2kWrx87.jpg",
               "id": 936415,
               "order": 16
            },
            {
               "cast_id": 140,
               "character": "Hider",
               "gender": 0,
               "credit_id": "580407f49251411983005276",
               "name": "Fraser Aitcheson",
               "profile_path": "/2RGS9m0znydtC8WrS3FupISvLij.jpg",
               "id": 1366510,
               "order": 17
            },
            {
               "cast_id": 141,
               "character": "Blue Shirt",
               "gender": 2,
               "credit_id": "580407f5c3a3681659005015",
               "name": "Matthew MacCaull",
               "profile_path": "/aRIdwgwZ6pXK8W6gXR8ZftGxXHp.jpg",
               "id": 140182,
               "order": 18
            },
            {
               "cast_id": 142,
               "character": "Blue Shirt",
               "gender": 0,
               "credit_id": "580407f59251411aae005404",
               "name": "Emy Aneke",
               "profile_path": "/4T5HXkZum4u6mrf4xGihtkJC4sd.jpg",
               "id": 1225951,
               "order": 19
            },
            {
               "cast_id": 114,
               "character": "Commodore Paris",
               "gender": 1,
               "credit_id": "576f9c0c92514119b7003f6f",
               "name": "Shohreh Aghdashloo",
               "profile_path": "/iSx8zmrDe4jd7xXZvLpfJ2d3rmM.jpg",
               "id": 21041,
               "order": 20
            },
            {
               "cast_id": 125,
               "character": "Commander Finnegan",
               "gender": 2,
               "credit_id": "57ed695b9251416df2001635",
               "name": "Greg Grunberg",
               "profile_path": "/kFK6AaPoUlLJArwLuHetUav8q19.jpg",
               "id": 17305,
               "order": 21
            },
            {
               "cast_id": 143,
               "character": "Control Tower Technician",
               "gender": 1,
               "credit_id": "580407f5c3a368156d004bf0",
               "name": "Jennifer Cheon",
               "profile_path": "/8Lep9PNACEJqvjCynal2IDwnDM5.jpg",
               "id": 1516834,
               "order": 22
            },
            {
               "cast_id": 144,
               "character": "Control Tower Technician",
               "gender": 2,
               "credit_id": "580407f59251411baa005421",
               "name": "Jarod Joseph",
               "profile_path": "/6QopNtsLPP63IaQgqfNweJEV67t.jpg",
               "id": 939589,
               "order": 23
            },
            {
               "cast_id": 145,
               "character": "Control Tower Technician",
               "gender": 2,
               "credit_id": "580407f6c3a36810f6005085",
               "name": "Jeremy Raymond",
               "profile_path": null,
               "id": 1051473,
               "order": 24
            },
            {
               "cast_id": 147,
               "character": "Kissing Guy",
               "gender": 0,
               "credit_id": "59d01559925141141e007d23",
               "name": "Harry Han",
               "profile_path": null,
               "id": 1897698,
               "order": 25
            },
            {
               "cast_id": 148,
               "character": "Kissing Girl",
               "gender": 0,
               "credit_id": "59d0156e925141141e007d4b",
               "name": "Gina Brinkman",
               "profile_path": null,
               "id": 1897699,
               "order": 26
            },
            {
               "cast_id": 119,
               "character": "Injured Red Shirt",
               "gender": 2,
               "credit_id": "576f9c0ec3a3680a35004580",
               "name": "Adam DiMarco",
               "profile_path": "/mBsj4hdMSMDwKOzYcJR3yEAShgW.jpg",
               "id": 936932,
               "order": 27
            },
            {
               "cast_id": 115,
               "character": "Orion Girl",
               "gender": 0,
               "credit_id": "576f9c0d92514119b7003f71",
               "name": "Fiona Vroom",
               "profile_path": "/bZMGDCfMLZHm7ZoML02jcTdBz7A.jpg",
               "id": 1397812,
               "order": 28
            },
            {
               "cast_id": 149,
               "character": "Chancellor Ambassador",
               "gender": 0,
               "credit_id": "59d01594c3a3687929007528",
               "name": "Richard Laurence",
               "profile_path": null,
               "id": 1897700,
               "order": 29
            },
            {
               "cast_id": 150,
               "character": "Sir Olden (as Doug Chapman)",
               "gender": 0,
               "credit_id": "59d015c4c3a3687929007589",
               "name": "Douglas Chapman",
               "profile_path": "/woJlBx2I4Hv1nKkC8f1G5cXqvXu.jpg",
               "id": 1081488,
               "order": 30
            },
            {
               "cast_id": 128,
               "character": "Wadjet",
               "gender": 2,
               "credit_id": "57ed6986c3a3683a7000a940",
               "name": "Dan Payne",
               "profile_path": "/bXP1ugF0oUaycp2NexyKtHiNIx7.jpg",
               "id": 85505,
               "order": 31
            },
            {
               "cast_id": 151,
               "character": "Jin",
               "gender": 0,
               "credit_id": "59d0161392514113eb00772b",
               "name": "Anthony Shim",
               "profile_path": "/arT1JGA942VWnB1RmLGmpRZ77bD.jpg",
               "id": 1085618,
               "order": 32
            },
            {
               "cast_id": 152,
               "character": "Jeanine",
               "gender": 0,
               "credit_id": "59d01642c3a36878ec007d44",
               "name": "Andrea Yu",
               "profile_path": null,
               "id": 1846455,
               "order": 33
            },
            {
               "cast_id": 153,
               "character": "Teenaxi Leader (voice)",
               "gender": 2,
               "credit_id": "59d0166dc3a368786c007a16",
               "name": "Shea Whigham",
               "profile_path": "/xlLI0hrutcyKOIHs4b47iSh65NU.jpg",
               "id": 74242,
               "order": 34
            },
            {
               "cast_id": 154,
               "character": "Jae",
               "gender": 2,
               "credit_id": "59d01686c3a36878d70074e7",
               "name": "Christian Sloan",
               "profile_path": "/zV6CljfStbaoVJgnCORTFbk2R5S.jpg",
               "id": 1508117,
               "order": 35
            },
            {
               "cast_id": 155,
               "character": "Krall's Henchman",
               "gender": 0,
               "credit_id": "59d016f3925141142f0079a6",
               "name": "Jake Huang",
               "profile_path": null,
               "id": 1897705,
               "order": 36
            },
            {
               "cast_id": 117,
               "character": "Night Watch Captain (as Priya Ragaratnam)",
               "gender": 0,
               "credit_id": "576f9c0d92514118d1004163",
               "name": "Priya Rajaratnam",
               "profile_path": "/p3NVW7YzfNQKwomH2m7XYyop8VO.jpg",
               "id": 1502989,
               "order": 37
            },
            {
               "cast_id": 156,
               "character": "Yorktown Red Shirt",
               "gender": 0,
               "credit_id": "59d0170792514114480078d9",
               "name": "Luka Hays",
               "profile_path": null,
               "id": 1897706,
               "order": 38
            },
            {
               "cast_id": 157,
               "character": "USSE Bridge Crew",
               "gender": 2,
               "credit_id": "59d0172a92514113eb0078bd",
               "name": "Thomas Cadrot",
               "profile_path": null,
               "id": 1858370,
               "order": 39
            },
            {
               "cast_id": 158,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d01738c3a36878ec007eae",
               "name": "Jennifer W. Evans",
               "profile_path": null,
               "id": 1897707,
               "order": 40
            },
            {
               "cast_id": 120,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "576f9c0ec3a3680bdd004279",
               "name": "Roxanne Fernandes",
               "profile_path": "/iIHuiMfO5EwzpvzPKMWksIP4Jnu.jpg",
               "id": 1641530,
               "order": 41
            },
            {
               "cast_id": 159,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d0174692514113fc007d04",
               "name": "Jake Foy",
               "profile_path": null,
               "id": 1287589,
               "order": 42
            },
            {
               "cast_id": 160,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d01753c3a36879160075ef",
               "name": "Jodi Haynes",
               "profile_path": null,
               "id": 1696921,
               "order": 43
            },
            {
               "cast_id": 161,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d017629251411452008072",
               "name": "Nathan Jean",
               "profile_path": null,
               "id": 1512174,
               "order": 44
            },
            {
               "cast_id": 162,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d0176e92514113eb007917",
               "name": "Tarun Keram",
               "profile_path": null,
               "id": 1794575,
               "order": 45
            },
            {
               "cast_id": 163,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d01783c3a36878d700763d",
               "name": "J.P. Mulcaster",
               "profile_path": null,
               "id": 1897709,
               "order": 46
            },
            {
               "cast_id": 164,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d017f89251411433007d11",
               "name": "Edwin Rodriguez",
               "profile_path": null,
               "id": 1897710,
               "order": 47
            },
            {
               "cast_id": 165,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d018169251411448007a40",
               "name": "Alex Rose",
               "profile_path": "/ocMTZGOPHosBwIwIdzwBHeFRtQO.jpg",
               "id": 1405540,
               "order": 48
            },
            {
               "cast_id": 166,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d018259251411448007a66",
               "name": "Polina Soldatova",
               "profile_path": null,
               "id": 1897711,
               "order": 49
            },
            {
               "cast_id": 169,
               "character": "USSE Bridge Crew (as Sarah Yu)",
               "gender": 0,
               "credit_id": "59d01864c3a36879040081cc",
               "name": "Lia Lam",
               "profile_path": null,
               "id": 1759617,
               "order": 50
            },
            {
               "cast_id": 168,
               "character": "USSE Bridge Crew",
               "gender": 0,
               "credit_id": "59d01842c3a36878d7007737",
               "name": "Ian Nsenga",
               "profile_path": null,
               "id": 1897713,
               "order": 51
            },
            {
               "cast_id": 124,
               "character": "Kalara Alien VO (voice) (as Sara Maria Forsberg)",
               "gender": 1,
               "credit_id": "57ed69369251416ded001621",
               "name": "Sara Forsberg",
               "profile_path": "/7d1v2HROeoyNEUjeBiM2xQlaphz.jpg",
               "id": 1590377,
               "order": 52
            },
            {
               "cast_id": 130,
               "character": "Starfleet Official",
               "gender": 0,
               "credit_id": "57ed69dac3a36842bb002055",
               "name": "Jeff Bezos",
               "profile_path": "/b9a6LHkkNttNlhf7gLgz9hJzh2H.jpg",
               "id": 1686562,
               "order": 53
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d489251416c751360b5",
               "name": "J.J. Abrams",
               "profile_path": "/uiEVOx3QclxnN76t8PU6v5IcUUP.jpg",
               "id": 15344,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d489251416c751360bb",
               "name": "Gene Roddenberry",
               "profile_path": "/9WMyiCTdtBEdx1JUCavoFiDl7wd.jpg",
               "id": 1745,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "549da5f9c3a368764f001ff1",
               "name": "Justin Lin",
               "profile_path": "/68zKal0ffNlJPR7OtRN59kY1cWl.jpg",
               "id": 58189,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55b6663ac3a36822720001b9",
               "name": "Simon Pegg",
               "profile_path": "/23e2uoNlpDvLumNic16fS2YjZjL.jpg",
               "id": 11108,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55b6664e92514120e3000163",
               "name": "Doug Jung",
               "profile_path": "/tO5KexaTsUWEk2JDvF4GzVYRdCC.jpg",
               "id": 65779,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5767baa4c3a3680f3b00042b",
               "name": "Bryan Burk",
               "profile_path": "/8sjfYlGhhqPwCoDzhze211ONtBX.jpg",
               "id": 28977,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5767babc9251412e1c00043f",
               "name": "Roberto Orci",
               "profile_path": "/tDfYa9L50WUTbJh4bmPcrKKj5Ku.jpg",
               "id": 15346,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5767bad3c3a3680f3b000432",
               "name": "Michael Giacchino",
               "profile_path": "/2YW8sSVvRhCwiQmsFCgtFsGkbv8.jpg",
               "id": 15347,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5767bae79251412f380004a1",
               "name": "Stephen F. Windon",
               "profile_path": null,
               "id": 58192,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5767bb369251412e58000428",
               "name": "Greg D'Auria",
               "profile_path": null,
               "id": 1204243,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767bb459251412f97000442",
               "name": "Dylan Highsmith",
               "profile_path": null,
               "id": 1204245,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767bb54c3a3680fbd00043d",
               "name": "Kelly Matsumoto",
               "profile_path": null,
               "id": 58193,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5767bb649251412ea9000469",
               "name": "Steven Sprung",
               "profile_path": null,
               "id": 931286,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767bb75925141655a0020fc",
               "name": "Alyssa Weisberg",
               "profile_path": null,
               "id": 765144,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5767bb879251412ea900046e",
               "name": "April Webster",
               "profile_path": "/kck0zX5OHJsvmI6SoLh8ZZE5XaX.jpg",
               "id": 6052,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5767bb97925141655a002101",
               "name": "Miranda Davidson",
               "profile_path": null,
               "id": 1429626,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5767bbc49251412ebf000433",
               "name": "Corinne Clark",
               "profile_path": null,
               "id": 986277,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5767bbd69251412f8b000418",
               "name": "Jennifer Page",
               "profile_path": null,
               "id": 1122003,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5767bbe8c3a3680ef0000420",
               "name": "Yesi Ramirez",
               "profile_path": null,
               "id": 1155432,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 2,
               "credit_id": "5767bc149251412f380004cb",
               "name": "Stephen M. Davis",
               "profile_path": null,
               "id": 15354,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767bc2a9251412f97000462",
               "name": "Paul Rabjohns",
               "profile_path": null,
               "id": 67695,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 1,
               "credit_id": "5767bc439251412e58000448",
               "name": "Valeria Migliassi Collins",
               "profile_path": null,
               "id": 1352983,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767bc7cc3a3680f2b00040c",
               "name": "Whitney Donald",
               "profile_path": null,
               "id": 1638547,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 2,
               "credit_id": "5767bcc1c3a3683cb9000d1e",
               "name": "Thomas E. Sanders",
               "profile_path": null,
               "id": 2486,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5767bcd09251412e1c00049e",
               "name": "Salim Alrazouk",
               "profile_path": null,
               "id": 1638548,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5767bcdec3a3680f3b0004a4",
               "name": "Stephen Christensen",
               "profile_path": null,
               "id": 1192526,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5767bcf09251412f380004f3",
               "name": "Denny Dugally",
               "profile_path": null,
               "id": 61277,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5767bd00c3a3680ef0000449",
               "name": "Natasha Gerasimova",
               "profile_path": null,
               "id": 1293467,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5767bd11c3a368102a000484",
               "name": "Dan Hermansen",
               "profile_path": null,
               "id": 61177,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5767bd22c3a368102a000488",
               "name": "Andrew Li",
               "profile_path": null,
               "id": 1311175,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5767bd319251412ea90004a4",
               "name": "Harry E. Otto",
               "profile_path": null,
               "id": 1271735,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5767bd40c3a3680ef000044f",
               "name": "Lauren E. Polizzi",
               "profile_path": null,
               "id": 38022,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5767bd519251412e1c0004b3",
               "name": "Jeremy Stanbridge",
               "profile_path": null,
               "id": 32200,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5767bd699251412ea90004ab",
               "name": "Andrea Carter",
               "profile_path": null,
               "id": 1481282,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 1,
               "credit_id": "5767bd8bc3a3680f3b0004bc",
               "name": "Jenne Lee",
               "profile_path": null,
               "id": 1395430,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5767bddc9251412e58000484",
               "name": "Sean Goojha",
               "profile_path": null,
               "id": 1519426,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5767bdedc3a368102a0004b1",
               "name": "Travis Witkowski",
               "profile_path": null,
               "id": 1447571,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5767bdfec3a3680fbd0004a9",
               "name": "Uzair Merchant",
               "profile_path": null,
               "id": 1638550,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "5767be3a9251412e58000496",
               "name": "Kris Bergthorson",
               "profile_path": null,
               "id": 1378676,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "5767be4cc3a3680e76000499",
               "name": "Tim Flattery",
               "profile_path": null,
               "id": 1081075,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "5767be759251412f970004b6",
               "name": "Simon Lee",
               "profile_path": null,
               "id": 1638551,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "5767be90c3a3683cb9000d5b",
               "name": "Victor James Martinez",
               "profile_path": null,
               "id": 1357046,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 1,
               "credit_id": "5767bea1c3a3680f7a0004f3",
               "name": "Milena Zdravkovic",
               "profile_path": null,
               "id": 229828,
               "department": "Art",
               "job": "Conceptual Design"
            },
            {
               "gender": 0,
               "credit_id": "5767beb69251412f3800052e",
               "name": "John Dale",
               "profile_path": null,
               "id": 1621492,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 1,
               "credit_id": "5767bed09251412f38000533",
               "name": "Lin MacDonald",
               "profile_path": null,
               "id": 12384,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5767bedfc3a3680ef0000488",
               "name": "Don MacAulay",
               "profile_path": null,
               "id": 961544,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 1,
               "credit_id": "5767beefc3a3680f3b0004ef",
               "name": "Sanja Milkovic Hays",
               "profile_path": null,
               "id": 2519,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5767bf679251412f970004df",
               "name": "Kevin McGill",
               "profile_path": null,
               "id": 1638552,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5767bf7a9251412ea90004fc",
               "name": "Riki Butland",
               "profile_path": null,
               "id": 1638553,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5767bfa9c3a3680ef00004a8",
               "name": "Steve Koster",
               "profile_path": null,
               "id": 1404739,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 0,
               "credit_id": "5767bfdb9251412f38000569",
               "name": "Geoffrey Haley",
               "profile_path": null,
               "id": 82169,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "5767bfee9251412ebf0004d8",
               "name": "Kimberly French",
               "profile_path": null,
               "id": 1378716,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "5767c00ac3a3683cb9000da8",
               "name": "Dale H. Jahraus",
               "profile_path": null,
               "id": 1389671,
               "department": "Camera",
               "job": "Additional Camera"
            },
            {
               "gender": 0,
               "credit_id": "5767c01e9251412ea9000511",
               "name": "Bruce McCleery",
               "profile_path": null,
               "id": 1364399,
               "department": "Crew",
               "job": "Second Unit Cinematographer"
            },
            {
               "gender": 0,
               "credit_id": "5767c03ac3a3680f2b00049f",
               "name": "Andrea Quaglio",
               "profile_path": null,
               "id": 1638554,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "5767c04ac3a3680f2b0004a5",
               "name": "Chris Gibbins",
               "profile_path": null,
               "id": 1638555,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "5767c05f925141655a0021d9",
               "name": "Gregory Irwin",
               "profile_path": null,
               "id": 1530723,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 0,
               "credit_id": "5767c093c3a3680f3b00053d",
               "name": "Christopher Prampin",
               "profile_path": null,
               "id": 1399475,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5767c0ab9251412ea9000528",
               "name": "David McClung",
               "profile_path": null,
               "id": 1638556,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5767c0c1c3a36842f7000001",
               "name": "Jarrod Tiffin",
               "profile_path": null,
               "id": 1418404,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "5767c12bc3a368424d000018",
               "name": "Summer Dietz",
               "profile_path": null,
               "id": 1638557,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "5767c13dc3a368102a00052f",
               "name": "Irena Stepic",
               "profile_path": null,
               "id": 1202779,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "5767c156c3a36842f700001a",
               "name": "Nava R. Sadan",
               "profile_path": null,
               "id": 1439109,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c16a9251412e1c000559",
               "name": "Jessica Lythgoe-Green",
               "profile_path": null,
               "id": 1531862,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c18cc3a368424d000033",
               "name": "Roma Wnuk",
               "profile_path": null,
               "id": 1638558,
               "department": "Costume & Make-Up",
               "job": "Seamstress"
            },
            {
               "gender": 0,
               "credit_id": "5767c19dc3a3680fbd000532",
               "name": "Pamela Cameron",
               "profile_path": null,
               "id": 1431099,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "5767c1ad9251415638000022",
               "name": "Phuong Chau",
               "profile_path": null,
               "id": 1638559,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "5767c1bd925141655a002217",
               "name": "Amy Hetland",
               "profile_path": null,
               "id": 1638560,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "5767c1cd9251412e58000545",
               "name": "Amy Schilbe",
               "profile_path": null,
               "id": 1580832,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "5767c1df925141655a002222",
               "name": "Mariela Zapata",
               "profile_path": null,
               "id": 1519437,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "5767c22dc3a36842f7000058",
               "name": "Dan O'Connell",
               "profile_path": null,
               "id": 1338372,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "5767c23f9251412e58000558",
               "name": "John Sanacore",
               "profile_path": null,
               "id": 1426828,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 0,
               "credit_id": "5767c257c3a36842bd000050",
               "name": "Eliot Connors",
               "profile_path": null,
               "id": 1548462,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "5767c269c3a36842f7000060",
               "name": "Stephen P. Robinson",
               "profile_path": null,
               "id": 1413453,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "5767c28b925141655a00223e",
               "name": "Lee Gilmore",
               "profile_path": "/m3J8KCmSZ2ByrV4gHlbhw9zec2J.jpg",
               "id": 1360099,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767c29ec3a368436f000058",
               "name": "Frank A. Montaño",
               "profile_path": null,
               "id": 1394130,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "5767c2c1c3a3680fbd000561",
               "name": "Peter Brown",
               "profile_path": null,
               "id": 7239,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "5767c2f7925141655a00224f",
               "name": "Robert A. Pandini",
               "profile_path": null,
               "id": 1314457,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5767c310c3a368424d000060",
               "name": "Joel Harlow",
               "profile_path": null,
               "id": 75375,
               "department": "Costume & Make-Up",
               "job": "Makeup Designer"
            },
            {
               "gender": 0,
               "credit_id": "5767c3379251415663000065",
               "name": "Dave  Cory",
               "profile_path": null,
               "id": 1194885,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767c349c3a368433500005b",
               "name": "Meghan L. Noble",
               "profile_path": null,
               "id": 1407685,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767c420c3a3684335000079",
               "name": "Cameron Waldbauer",
               "profile_path": null,
               "id": 1394952,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c44fc3a36842bd0000a1",
               "name": "Austin Aplin",
               "profile_path": null,
               "id": 1638562,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5767c4619251412ea90005b9",
               "name": "Graeme Marshall",
               "profile_path": null,
               "id": 1638563,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "5767c4759251415638000085",
               "name": "Joseph Farrant",
               "profile_path": null,
               "id": 1531512,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767c488c3a3684335000088",
               "name": "Abhishek Chauhan",
               "profile_path": null,
               "id": 1401140,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "5767c49d9251412f38000631",
               "name": "Ron Ames",
               "profile_path": null,
               "id": 186721,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5767c4b0c3a368436f0000a0",
               "name": "Jenna Kerr",
               "profile_path": null,
               "id": 1638564,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5767c4c3925141655a002286",
               "name": "Kondareddy Suresh",
               "profile_path": null,
               "id": 1638565,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5767c4d79251415638000093",
               "name": "Dane Allan Smith",
               "profile_path": null,
               "id": 1386918,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5767c505c3a368102a0005f3",
               "name": "Andy Taylor",
               "profile_path": null,
               "id": 1408381,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5767c51e9251412f38000641",
               "name": "Devin Fairbairn",
               "profile_path": null,
               "id": 1345602,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "5767c5379251412e580005cc",
               "name": "Sean Stranks",
               "profile_path": null,
               "id": 1439740,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c548925141566300009e",
               "name": "Kevin Baillie",
               "profile_path": null,
               "id": 1345600,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c55cc3a36842bd0000cf",
               "name": "Ryan Tudhope",
               "profile_path": null,
               "id": 1420157,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c56f92514156630000a9",
               "name": "Stefano Trivelli",
               "profile_path": null,
               "id": 1459914,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5767c5829251412e1c000608",
               "name": "Peter Chiang",
               "profile_path": null,
               "id": 122274,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57e6b8d29251412ae300932b",
               "name": "Cameron Hilts",
               "profile_path": null,
               "id": 1603473,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "57eea2929251416ce8008469",
               "name": "Ron Ames",
               "profile_path": null,
               "id": 186721,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "57eea2a7c3a3682a65005686",
               "name": "Josh Henson",
               "profile_path": null,
               "id": 1687043,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "57eea2c89251416cd600817d",
               "name": "Justin Lin",
               "profile_path": "/68zKal0ffNlJPR7OtRN59kY1cWl.jpg",
               "id": 58189,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57eea2d8c3a3682a650056a7",
               "name": "Jeffrey Chernov",
               "profile_path": null,
               "id": 40592,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "57eea2e59251416cd600818c",
               "name": "David Ellison",
               "profile_path": "/sC8zY6PJ6ahLVSQbA2PNWcsUUIg.jpg",
               "id": 58433,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "57eea2f4c3a3684e1e006e0f",
               "name": "Dana Goldberg",
               "profile_path": null,
               "id": 29018,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "57eea3029251416cd3008145",
               "name": "Tommy Harper",
               "profile_path": null,
               "id": 1106751,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "57eea318c3a3684d9a006ffb",
               "name": "Helen Pollak",
               "profile_path": null,
               "id": 8850,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 1,
               "credit_id": "57eea32cc3a3684e1e006e25",
               "name": "Lindsey Weber",
               "profile_path": "/9aN6x2W7DlPAMX8MZxcqB1Hyf8v.jpg",
               "id": 1636657,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "594690cec3a36816c502a579",
               "name": "Alexander Vegh",
               "profile_path": "/l3KnGQXLV9EPkO54To0BmKdnIa8.jpg",
               "id": 1410580,
               "department": "Visual Effects",
               "job": "Pre-Visualization Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5a3cecb20e0a264cca234a13",
               "name": "Leonard Nimoy",
               "profile_path": "/rTQulQ5WMehA3SSBnGTmayTsF0m.jpg",
               "id": 1749,
               "department": "Crew",
               "job": "In Memory Of"
            },
            {
               "gender": 2,
               "credit_id": "5a3cecdbc3a3680b9d21eba6",
               "name": "Anton Yelchin",
               "profile_path": "/mrIe5ZDQG3py9apQmxy0MKfSI8x.jpg",
               "id": 21028,
               "department": "Crew",
               "job": "In Memory Of"
            },
            {
               "gender": 0,
               "credit_id": "5a46b8d8c3a3683e9d000d6a",
               "name": "Randall D. Wilkins",
               "profile_path": null,
               "id": 1368863,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 2,
               "credit_id": "5a5c9392c3a3686d77009057",
               "name": "Mark N. Tompkins",
               "profile_path": "/p7a7MPqqXrdvFL9pgL0qP0I7lUH.jpg",
               "id": 1546584,
               "department": "Crew",
               "job": "Scenic Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 42.108407,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 188927,
      "vote_count": 3265,
      "budget": 185000000,
      "overview": "The USS Enterprise crew explores the furthest reaches of uncharted space, where they encounter a mysterious new enemy who puts them and everything the Federation stands for to the test.",
      "similar": [
         201,
         172,
         1895,
         1892,
         1894,
         11,
         199,
         330459,
         1891,
         13475,
         140607,
         13532,
         1893,
         54138,
         205775,
         18,
         75174,
         286217,
         752,
         339964
      ],
      "original_title": "Star Trek Beyond",
      "runtime": 122,
      "poster_path": "/mLrQMqyZgLeP8FrT5LCobKAiqmK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/zlFa3VNua4hJyGEI4X2sqDrtEH9.png",
            "name": "Skydance Media",
            "id": 82819,
            "origin_country": "US"
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": "/p9FoEt5shEKRWRKVIlvFaEmRnun.png",
            "name": "Bad Robot",
            "id": 11461,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Perfect Storm Entertainment",
            "id": 34530,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alibaba Pictures Group",
            "id": 69484,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sneaky Shark",
            "id": 83644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Huahua Media",
            "id": 83645,
            "origin_country": ""
         }
      ],
      "release_date": "2016-07-07",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/gWl5pN2FplE709aVtA4lakwsE6t.jpg",
         "name": "Star Trek: Alternate Reality Collection",
         "id": 115575,
         "poster_path": "/w2IVqa43Ge49mrY3qSaJWpyDtz6.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.startrekmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Justin Lin"],
      "runtime": 122,
      "synopsis": "In the opening scene, Captain James T. Kirk (Chris Pine) is meeting with the Teenaxi people to make a treaty between them and their enemies, the Fenopians. Kirk is holding an artifact that he claims is a gift of peace from the Fenopians, but the Teenaxi leader (Shea Wigham) considers it a threat. He rolls down to confront Kirk, where we see that the leader and the rest of his people are small creatures. Still, they gang up on Kirk and attack him. Kirk calls for Scotty (Simon Pegg) to beam him back up to the Starship Enterprise. Kirk records a log, stating that they are now about three years into their five-year mission to explore the ends of the universe. Kirk has become rather bored by this point, and he wonders what else there is to see out there. Kirk is joined by Bones McCoy (Karl Urban) with a bottle of scotch that he took out of Chekhov's (Anton Yelchin) locker. Bones notes that Kirk's birthday is coming up, which Kirk isn't looking forward to since it reminds him of how his dad died on the same day, and how Kirk will be a year older than his dad when he died. Bones states that Kirk has spent all this time figuring out who his dad was in his life, and now he's wondering what it means to be Kirk himself. The crew descends onto Starbase Yorktown to replenish their supplies. Spock (Zachary Quinto) and Uhura (Zoe Saldana) appear to be going through a rough patch in their relationship. She is ready to hand him back a necklace that he gave her, but he refuses to take it back. Mr. Sulu (John Cho) reunites with his life partner and their daughter. Spock is then called aside by two elder Vulcans. He is informed that his older self, Ambassador Spock Prime, has just died. Kirk meets with Commodore Paris (Shoreh Aghdashloo) to apply for a position as Vice Admiral. He requests that Spock be made captain of the Enterprise in his place. A distress signal is picked up by the Federation from an alien named Kalara (Lydia Wilson), who claims to have been part of a crew whose ship suffered a critical malfunction. She asks for help in rescuing her crew on the far side of the nebula. The Enterprise sets off on the rescue mission. As they proceed through the nebula, they approach a Class M planet, they are suddenly attacked by a massive cluster of ships that move like a swarm of insects. The swarm quickly causes heavy damage to the Enterprise, the aliens riding the ships breaching the hull in a matter of minutes. The crew tries fighting back, but their weapons aren't strong enough, and when Sulu tries to warp them out of there, Scotty reports that the ship's nacelles have been sheered off by the enemy. The aliens then allow their leader, Krall (Idris Elba), to enter. His soldiers find the artifact that Kirk possessed earlier, a bio-weapon called the Abronath. However, when Krall tries to get his hands on it, he finds that its container is empty. With the damage to the Enterprise critical, Kirk orders a general evacuation. Spock and Bones get in a pod that heads down to the planet. Krall battles with Kirk, winning the upper hand until Uhura separates the saucer from the engineering section of the ship, taking Krall with her. Kirk then goes with Chekhov and Kalara as they make their escape. As the pod is ejected, Kirk watches the Enterprise crash to the ground. Scotty's escape pod nearly flies into a vast canyon, but he jumps out in time. He is cornered in the forest by the planet's savage inhabitants. Before they can attack him, a scavenger named Jaylah (Sofia Boutella) shows up and beats the savages. Scotty introduces himself to her as an engineer. They agree to work together, with Scotty helping fix something of Jaylah's, and she will help him find the rest of the crew. Jaylah takes Scotty to her home, which happens to be a long-lost Franklin-class Federation starship, the USS Franklin. Spock and Bones have also crash-landed, with Spock impaled by a chunk of metal in his abdomen. Bones manages to pull it out and stop the bleeding. The two navigate the area, but they must slow down since Spock is still badly wounded. As they sit down, Spock tells Bones about Ambassador Spock's death. He feels that he must continue carrying out his older self's work on New Vulcan, and he wanted to tell Kirk, but Bones says he probably wouldn't like that. After landing, Kirk confronts Kalara, thinking she knew what was coming. She defends herself, saying it was to help save her crew. With Chekhov, they rush to find the Abronath on the saucer. Kalara then turns on Kirk, confirming she led them to a trap and that she was working with Krall the whole time. She finds that the Abronath is not where Kirk claimed to have left it. Moments later, the three are ambushed by drones. Kirk and Chekhov manage to activate the saucer's thrusters, which lift the saucer high enough until it crashes down hard, killing Kalara. Krall captures Uhura, along with Sulu and the rest of the crew. He and his soldiers take them to his base of operations. It is shown that Krall is able to drain people of their life force to rejuvenate himself, as well as alter his appearance. He threatens to kill Sulu for the Abronath, but an Ensign named Syl (Melissa Roxburgh) gives it up, having kept it hidden in the back of her head. He brings Uhura and Syl into a chamber where he demonstrates the use of the weapon. He locks Syl in the chamber and activates the Abronath, releasing a black cloud that envelopes Syl causing her to decompose. Krall intends to use this against the Federation. Kirk and Chekhov run into a perimeter trap that Jaylah set up, encasing them in a crystallized shell. Scotty and Jaylah find them, and she breaks them free when Scotty says they're part of his crew. They team up to rescue the rest of the crew. Scotty fixes the Franklin's transporter pad to teleport people onto the ship. They start with Spock and Bones, who are about to be killed by more drones until they are both beamed onto the Franklin. On the computer, they receive a signal on Uhura's location since the necklace Spock gave her is also a tracking device. They see she's with the rest of the crew at Krall's hideout, but Chekhov says they are unable to beam everyone up from there. Kirk figures they need to head in there and come up with their own rescue plan. Jaylah wants no part since she knows people who go near Krall's camp never come back alive. Her father fought Krall's right-hand man Manas (Joe Taslim) and was killed. Scotty says she is not alone and can work with the others to save the crew. Kirk creates a diversion with a motorcycle he found on the Franklin while Spock and Bones sneak around to take a number of crew members at a time onto a pad and use a beacon to beam them onto the Franklin. Krall's men attack, leading to Jaylah fighting Manas one-on-one. Kirk protects the crew by spreading the crystallizing material to shield them from Krall's army. As the rest of the crew is saved, only Kirk and Jaylah remain. Jaylah pushes Manas off the pad to his death and jumps to reach Kirk as he activates his beacon, sending them back to the Franklin. Krall and his army fly toward Yorktown so he can activate the Abronath and kill everyone. The Enterprise crew follows. Spock and Bones beam onto a drone ship and figure out that they need to use a distraction to get by the other drones. Scotty uses Jaylah's music system to create discordant noise with The Beastie Boys' \"Sabotage\". The drones are obliterated, leaving only Krall's ship plus two others. The Franklin manages to stop Krall's ship, causing it to crash into a fountain. The crew goes off to find Krall and make sure he's dead. They find two dead bodies drained of their life force. As they continue making their way, they notice a video of the original crew of the Franklin from centuries ago. Uhura spots a familiar face among everyone else. The man she sees is Balthazar Edison, captain of the Franklin, but he is now Krall. Kirk asks to see Edison's old logs, skipping to the last one to see Edison having become jaded and angry with the Federation after his ship was stranded with no help, following his crew's own series of missions. Edison mentioned discovering a life-sustaining force that he intended to use to keep himself alive. Krall, now looking slightly more like his old self, takes the Abronath to Yorktown's life support hub, which would allow the black cloud to spread throughout the entire starbase. Kirk finds Krall and starts fighting him to take the Abronath away from him. Kirk tries to reason with Krall, but he is no longer the same captain he once was. Kirk's crew attempts to open the doors into space to pull Krall out. Krall activates the Abronath, which starts releasing the black cloud. Kirk avoids getting killed and pushes Krall into the path of the cloud. The door opens and sucks Krall into space with the Abronath, where he is consumed by the cloud and is thus disintegrated. Kirk gets pulled out as well, but Spock and Bones fly in and pull him to safety. In the aftermath, Commodore Paris offers Kirk the Vice Admiral position, but he chooses to remain a captain since he prefers to fly. Meanwhile, Spock goes through Ambassador Spock's old materials. Among them is a picture of the Prime Enterprise crew right before they retired. Bones then brings Kirk to a surprise birthday party with the whole crew there to celebrate. Spock and Uhura reconcile their relationship. Kirk and Scotty pull some strings and get Jaylah into Starfleet Academy. The main crew then sees a new Enterprise ship is being built. With that, the crew recites the original \"final frontier\" monologue as they resume their mission. The film closes with the words \"In Loving Memory of Leonard Nimoy\" (who had passed away in 2015) and \"For Anton\", a dedication to Anton Yelchin who died shortly before the film's premiere in 2016.",
      "writers": [
         "Simon Pegg",
         "Doug Jung"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2660888/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZDRiOGE5ZTctOWIxOS00MWQwLThlMDYtNWIwMDQwNzBjZDY1XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Chris Pine",
         "Zachary Quinto",
         "Karl Urban"
      ],
      "reviews": [
         "Where do I begin? As a lifelong Star Trek fan I had an uneasy feeling while watching this movie. I could not shake the sense that I was just looking at another mediocre summer popcorn flick; an experience that would evaporate from my brain just hours after I leave the theater. I remember sitting in the cinema with my head low embarrassed by the movie, although I wanted it to prove me wrong ever since I saw the \"Beastie Boys\" trailer back in 2015. Instead, it dragged along with that \"proven\" Hollywood formula of what a summer hit should look like. Constricted by its own creative limitations I was looking at a product that was not a science fiction in its core, but a creation that had only one intention since its birth: to milk as much money as possible. Star Trek Beyond was so devoid of the primordial concepts set up by Mr. Gene Roddenberry that it contributed to the confused identity of the picture. The plot of the movie is so \"light\" in its essence that it lacks the moral dilemmas, the exploration (inner and outer) and the development usually present in the Star Trek universe. There was neither message nor any character evolution and we did not learn more about anything really. Instead of Kirk, Spock and Scotty you could stick just any name over the protagonists and nobody would have noticed. The story was atrocious and full with plot holes patched up by unnecessary although flashy looking CGI. Star Trek Beyond also has one of the weakest villains in its history. It was definitely not the actors fault and such a shame to waste the opportunity of having a strong artist like Idris Elba. It was the fault of the writer and the director who missed the opportunity to take Star Trek back on its track. Instead they created a cute flick full with needless CGI scenes, explosions and dialogue written for \"dumb\" audiences. Everything had to be explained to the viewers, nothing was left to the imagination. There was nothing to debate with your friends after the movie or something to stir your imagination or to push you to prod its meaning. Nothing like that at all, everything was given on a run-of-the-mill plate for the audience to consume in a shortest possible time frame. The movie had its moments, so not everything was complete rubbish. I liked the character of Jaylah and some of the humor, but that was it. Some of the scenes were of course visually impressive though sometimes things would fly around too much and contaminate the image. Of course this movie was done by people, who know their job, but I am not pondering the execution and the skill of the artists, I am merely concerned about the soul of this thing we love so much. This thing we used to know of as Star Trek.",
         "Disappointed with this entry in the series. Star Trek to me isn't about motorcycles and loud music, it's more about exploring science fiction concepts and themes through great storytelling (which this film has very little of). The \"twist\" at the end is figured out about a 1/3 of the way in. Lazy storytelling where props are laid for action scenes for no apparent reason (why is there a motorcycle aboard a starship?). On the plus side, the cast is magnificent and the charm they bring to their roles makes this enterprise watchable. It's too bad the script and direction don't give them much to do. Mr. Lin, while a good action director, isn't a good storyteller. While that's good for the Fast & Furious franchise, Star Trek deserves better.",
         "How is it possible to spend so much cash making a movie so utterly meaningless and bad? 185 million USD? This is 2 hours of your life that you will never get back. So, where to start? First off the story is so thin and seems like a child wrote it. It has no depth and right from the beginning you feel basically nothing for the bad guys or the good guys, and there are so many holes in the story. There happens to be a huge base far out in space where the Enterprise is going to restock? Isen't the Enterprise supposed to be out in deep space exploring? Next to this large space base there is a nebula and apparently a planet with perfect conditions for human survival. It seems to be right next to the large space base, which would seem very very unlikely considering the vastness of space. And the crew happen to land on the same small area of this huge planet so they can all meet up. Then they meet a character that seems to be a bad mix of Rey from Star Wars and Neytiri from Avatar who happen to have found an old federation ship (that of course they can get to work after 150 years on a deserted planet), very unoriginal. So the reason for the bad guy Krall to lure the Enterprise to his planet and destroy it seems to be a device that Kirk has that will help Krall kill people. But in the end of the movie it is very clear that using his ships alone he could have easily destroyed the base - so what was the purpose of this relic device in the first place? There is quite bad CGI during the whole movie. In every action packed scene especially the fighting the camera moves around so much it is hard to grasp what is happening. But even with this shaky camera trick it's impossible to miss how utterly bad these scenes are. The fighting scene between Manas and our Rey character is one of the worst Iv seen in a long time. The only thing decent with this movie are some of the actors and their dialog. Everything else, from story to script to CGI is just garbage. Im sorry I like Star Trek I really do, but this movie is not worth seeing in the cinema.",
         "I did not want to see this movie because I knew from the trailer it was going to be bad. In a pique of boredom last night I watched it. Sadly my instincts were right. Overdone CGI. WHen I say overdone I mean WAY overdone. Like they were in a contest to see how much CGI they could cram into 2 hours. If there is one thing about ST it's \"less is more\", not \"massively overloading your brain with irrelevant CGI is better\". Literally dozens of implausible / impossible scenarios. People falling off of high places uninjured (repeatedly), sliding down wrecked passageways without a scratch (repeatedly), getting in fistfights/shootouts with no injuries (repeatedly) heck even sliding down the entire outside of the wrecked saucer section of the Enterprise and merely \"jumping off\" at the end with no injuries. Laughably overdone filler. Lazy dialogue. Weak humor throughout. Kirk somehow comes up with a retro motorcycle that he uses to go rescue his crew. Yes. A motorcycle magically appears on an alien planet across the galaxy from earth where a motorcycle probably hasn't even existed in over 200 years. And, he just shows up riding it out of nowhere. No explanation of where he found it or where it came from. Ridiculous. We are also supposed to believe that they were able to revive a crash landed Federation ship from decades earlier, and rev the impulse engines enough to drop it off a high cliff to gain speed, where it hits rock outcroppings and mountains on the way down with NO damage to itself or crew and it still flies perfectly! And it's not until near the end of the movie that we find out that the arch enemy is a former Federation captain. This should have come out much sooner to add to what pathetic amount of a story line they had form the start. To make a long story short, this movie may have finally killed off what was left of the ST franchise and that's probably a good thing.",
         "After the noisy and irretrievably stupid (though reasonably entertaining) Into Darkness, I wasn't desperate to watch this one, but when I finally did I was relieved to discover that it was even more enjoyable than the first film in the reboot, a rollicking adventure with terrific alien weapons, fun McCoy/Spock repartee, a promising newcomer alien, and a lot of really excellent action scenes. The movie had almost all the qualities of the original series except one - the thinking part. The smartest thing in the movie is the funny opening scene, which suggests the difficulty of communication between different cultures. But that's the last thing in the movie that suggests even a moment of thought. The main villain has very little in the way of motivation, and when he explains his purpose it's quite disappointing. Nothing in this movie is there to provoke thought, and I'm not entirely convinced that anything in the movie really makes sense, although there's nothing at the time that hit me as too absurd to live with (unlike the previous movie). If you expect this movie, like the series, to explore racism and war culture, well, you're not going to be happy. But if you just want some old-fashioned action with some familiar characters, this totally hits the spot.",
         "The Gene Roddenberry's legacy is nowhere to find in this film. This Star Trek movie feels more as a Marvel Comics flick than a Star Trek movie. One- dimensional characters, a whirlwind of imagery, a meager story and over the top villains and hero's. A true Star Trek movie for me is one with a nice story, sound science, a spec of humor, real characters, and last but not least; always in search of the human condition. Star trek is more than the sum of episodes and movies, its a way of thinking, and inspired millions of people -personal and professional- to make the world a better place. The brightest people off all humanity, like Stephen Hawking, NASA scientists, all love Star Trek. If Director Justin Lin had seen all of the Star Trek series and movies, he would never made such a terrible -for me- horrible movie.",
         "Nine hundred and sixty-six days into its five-year voyage, the USS Enterprise arrives at Starbase Yorktown, a massive \"snowglobe\"-like station with its own internal atmosphere and cityscape, to replenish dwindling supplies while the crew takes shore leave. Struggling to find continued meaning in their mission, Captain James Kirk has applied for a promotion to Vice Admiral of Yorktown, and plans to name Spock as the new captain of the Enterprise. Meanwhile, Hikaru Sulu reunites with his husband and daughter, Spock and Nyota Uhura have amicably ended their relationship, and Montgomery Scott works to keep the ship operational. Spock also receives word from New Vulcan that Ambassador Spock, his elder counterpart from the original time-line, has passed away. An escape pod drifts out of a nearby nebula. The survivor, Kalara, claims her ship is stranded on Altamid, a planet in the nebula, and the Enterprise is dispatched on a rescue mission. The rescue turns into an ambush when the Enterprise is overwhelmed by a massive swarm of ships and is badly damaged. The swarm's alien commander, Krall, boards the ship searching for an alien artifact that Kirk had obtained on a recent mission. The swarm rips apart the Enterprise, and the saucer section crashes to the planet as the crew abandons ship in escape pods. On the planet's surface, Sulu, Uhura and other surviving crew are captured by Krall. Kirk and navigator Pavel Chekov, accompanied by Kalara, find the crashed saucer section. Kalara is discovered to be Krall's ally when she attempts to retrieve the artifact for him. To escape Krall's crew, Kirk activates the still-functional boosters, causing the saucer to lurch forward and crush Kalara. Meanwhile, a seriously wounded Spock and Dr. Leonard McCoy search for the other survivors. Spock tells McCoy of Ambassador Spock's death and that he intends to leave Starfleet to continue his counterpart's work on New Vulcan. Meanwhile, Scotty is rescued by Jaylah, a scavenger who previously escaped Krall's encampment. She takes him to her makeshift home, the wreck of the USS Franklin, an early-generation Starfleet vessel that went missing over a hundred years ago. With Scotty's help, the ship is repaired, and Scotty, Kirk and Chekov, and McCoy and Spock, reunite using the ship as a base. The group plans to raid Krall's camp to rescue the crew and transport them to the Franklin then escape the planet. Meanwhile, Krall coerces a member of Kirk's crew to hand over the artifact that she had kept hidden for Kirk. Krall reveals the artifact is the missing half of an ancient bio-weapon, created by the planet's original inhabitants, that can disintegrate a humanoid life form in seconds. With the device now complete, Krall intends to attack Yorktown and kill its inhabitants, and, using its advanced technology, go on to attack the Federation. Kirk and the others free the crew as Krall launches from the planet with the bio-weapon, leading his fleet to Yorktown. The Enterprise crew pursues Krall in the Franklin. Scotty transports Spock and McCoy into one of Krall's drone ships where they eject the crew. They discover how the drone vessels coordinate. Krall's communications is disrupted with VHF transmissions, causing mass confusion that results in the fleet's destruction. Krall and his three remaining officers crash in Yorktown. As Krall escapes into the city, Uhura and Kirk discover from the Franklin's logs that Krall is actually Balthazar Edison, the captain of the Franklin. A human soldier from before the Federation's formation, Edison became disillusioned with his life and purpose after peace was established with humanity's enemies. When he and his crew were stranded in the nebula, he believed he had been deliberately cast aside. Having prolonged his life using the planet's alien technology that also physically deformed him, Krall/Edison now plans to destroy the Federation in revenge. Kirk pursues Krall into the Yorktown's ventilation system where Krall attempts to unleash the bio-weapon on the entire station. Kirk forces Krall into a portal, causing the weapon and Krall to be ejected into space, where the weapon consumes Krall. Spock and McCoy save Kirk before he is blown into space. Kirk is offered the promotion to Vice Admiral, but he opts to remain as a captain. Spock receives a box containing some of the personal effects of Ambassador Spock; reflecting on an included photograph of the aged crew of the Enterprise from the original time-line (circa Star Trek V: The Final Frontier), he chooses to remain in Starfleet and resumes his relationship with Uhura. Jaylah is accepted into Starfleet Academy on Scotty's recommendation. As the crew celebrates Kirk's birthday, they view the construction of their new ship, the USS Enterprise-A.",
         "I was worried when Justin Lin was signed on to direct. I am not a fan of the mindless Fast and Furious franchise with its ridiculous stunts and silly plots. I gave him a chance, because after all, its Star Trek. What we got was Fast and Furious in space. Just running, fighting, explosions, one frantic scene after another with no time to develop characters, motivations, or even plausible Sci-Fi. It feels shallow, a promising plot sacrificed to the alter of YA expectations. Another Star Trek movie where the enterprise is destroyed, again? Is this sci-fi disaster porn now? The dialogue is forced, the banter off tempo, and in the end, the actors talents and IP were wasted on what feels like a B movie.",
         "I've always said that if I was wrong about something, I would own up to it. Well over the last year or so, I've been immensely skeptical of Star Trek Beyond. I became iffy over the problems with the script, I was skeptical over Fast & Furious director Justin Lin being put at the helm and then the first trailer seemed to confirm all my worst fears about what the film would become. I about washed my hands of it, deciding for the first time that I wouldn't see it in cinemas. Then it came out and people whose opinions I trust sang it praises. So I decided to give it a go after all... Well folks I was wrong. Star Trek Beyond wasn't the wham bam, action driven and plot less film that the trailer made it to be back in December. Far from it, truth be told. Though it didn't start out that way. The opening minutes of Beyond are comparatively slow compared with the openings of the two films that proceeded it though it does do a nice job of bringing the audience up to speed where this version of the Enterprise crew stand some three years into their five year mission. The film finally gets going plot wise though that ultimately leads into the first major action sequence which felt like a long retread of a big part of the climax of Into Darkness. That was just the opening of the film thankfully. Once it moves beyond that slow and at times clunky opening, Beyond soars. The plot is an intriguing mix of Trek elements including exploring elements of the series mythos including tie-ins to one of the franchise's spin-offs that came as a pleasant surprise. Not only that but the film contains quite a few little Easter eggs for long time fans which range from references to lines of dialogue. These are things that will make those fans happy while not alienating an audience of new viewers, something that has been key to the success of the this new Trek film series. Not only that but that but Beyond's ultimate message about strength in unity, not giving into the prejudices and patterns of the past is also a timely one as well. Despite the issues with the early part of the film, it's a significant improvement over the plot of Into Darkness three years ago. The action sequences of the film also work splendidly. While the trailers gave the wrong impression of many of them, in context they work splendidly from chase sequences to fist fights that take full advantage of what a big budget film can do over what the series did back in the 1960s. The climax is a tour de force of the kind of sci- fi action/adventure that Trek does well even if it does include a Beastie Boys song as part of the action (which I have to admit didn't work in the trailer but actually works in context here). Actually that last sentence sums up so much of the action sequences, most especially a sequence involving a motorcycle which makes no sense until you see it in the film itself. In the midst of all that though, it doesn't lose track of its characters. There's quite a bit for everyone to do in this film after some of them were sidelined in the past. Simon Pegg's Scotty comes across quite well and there's more screen time for Zoe Saldana's Uhura and the now sadly late Anton Yelcin's Chekov. The focus though is on Trek's three greatest lead characters and it is a genuine pleasure to see Chris Pine, Zachary Quinto and Karl Urban grasp their roles and run with them. The film's supporting cast does well with Sofia Boutella's Jaylah coming off the best of the lot. Idris Elba's villainous Krall is effective in his scenes though Elba as an actor is effectively lost behind layers of makeup. All told though, it's a solid cast with the Enterprise crew really getting a chance to shine here. Despite what is one of the poorest marketing campaigns in the history of the Star Trek film series, Beyond is definitely worthy of the franchise as a film. While not on the level of the 2009 reboot, it is definitely a step in the right direction that proves that this fifty year old creation of Gene Rodenberry is far from being done. So forget the terrible trailers and boldly go see it at a cinema near you.",
         "I had very little expectations on this film but I really liked it. Maybe its because it has no lens flare and the shaky cam actually works. It seems the characters have \"aged\" well, Kirk seems more mature and Spock seems to genuinely care about Uhura. Jaydah eclipses Uhura as the female lead, she has much more screen time and action sequences. Bones is so much better than the previous films. He manages to bond both with Kirk and Spock, it doesn't feel fake or forced like in the past 2 films. I didn't like the \"Sulu is Gay\" scene. I really doesn't add anything to the story. Why are his partner and daughter in the Starbase in the first place? Besides, it looks like everyone already knew about it. Even George Takei didn't like it. Krall feels more like Khan (from ST WoK) than John Harrison/Khan (from Into Darkness) . He was stranded on a desert planet, he blames the federation for it and wants revenge. But even so, I think Idris Elba did a good job, its clear Krall has a personal agenda, not just \"destroy the federation\" BTW Krall reminded me of Jerry from Enemy mine. Just saying. The Spock prime scene was touching, but they missed to mention how he died. Again no biggie. It was kind of weird having Scotty be the ladies man (sort of) and not Kirk, but it kind of worked. The action scenes are good, no lens flare and a little bit of shaky cam (no where near Bourne levels), a couple of scenes suffer from bad CGI but for the most part it gets the job done. In the end I think its be best of the trilogy, lets see what the next installment will bring. I wonder how will they deal with Anton Yelchin's death. Will they kill the character? or replace him?",
         "I stopped watching this movie after half an hour. This is not Star Trek. Not even close. If you want to make a fun movie about space and lasers and people jumping around like bunnies on LSD just make another Guardians of the galaxy movie. (Wich was a greate movie by the way) Star Trek is about interesting SF concepts and space phenomena, interstellar politics, social interaction with alien races and now and then a space battle. This whole new series of parallel universe Star Trek movies is just a cheap ripoff of one of the best franchises ever made. They cannibalized it for fast profit and killed their long term profit. Even if you would have wanted to bring a bit more action to a new series of Star Trek movies there would have been a more enjoyable way to do this. What people are waiting for decades is the untold story of the Klingon wars. A new series about the Klingon wars would have been the most profitable thing that would have been ever created and all fans would have loved it. Instead they just made a remake of Captain Kirks Star Trek and killed his character. RIP Captain Kirk and RIP Star Trek franchise.",
         "Those of you who haven't seen this movie, do yourself a favor and skip it. If you gave this movie a high rating when it was out, I suggest you try to watch it again. I'm betting that you will see what I saw -- a really bad movie. In fact, it is so bad, I'm actually taking this time out of my day to write this. I feel ripped off by it. The dialogue was so bad, the audience was laughing at it throughout the movie. With the crap they had to work with, the actors didn't shine either. Chris Pine came off stiff and unlike-able. He's still not my favorite Kirk but he's been good prior. With nothing to work with in terms of a script, the cast is just limp and uninteresting. The story itself is silly and implausible. Now, I know in science fiction you have to suspend belief to some degree but this story just stretched me way to far in terms of mad coincidences. I couldn't wait for this film to end. I'm a life-long Star Trek fan but I'm bailing on this reboot series. \"Beyond\" was the worst Star Trek movie I've ever seen.",
         "Not a Star trek fan, I'm a sci-fi fan. There's a difference. Loved the first, disappointed with the second, then this. I don't know why early reviews are so positive, but anyway, it's my view. Been so long since a movie of this genre has been the complete package, story, acting, directing, CGI, etc. This movie does nothing to address that. I got bored 2/3 way in, wanting it to end. So many plot holes, just so many. Go see it, but don't have great expectations. It was nice to look at, but that's all. The bad guy started out being very good (at being bad I mean). Opening was OK, nice special effects, just no credibility. And way too much shaky camera, way to much.",
         "Being less \"Star Trek\"-ish isn't bad per se. What's wrong with this (motion) picture is that it fails in trying the exact opposite. This feels like your \"regular blockbuster\" within Star Trek (reboot) universe. It's interesting because things keep happening, thus it keeps your attention, the time passes by quickly. But, at the end, you don't feel much, if anything. Nothing really interesting actually happened. It's somewhat unfortunate. It starts of good. There a few funny lines/situations. The story is Star Trek-ish, yet a little different. But, about the time that the rebooted JT Kirk mutters that his \"life feels episodic\", it starts to feel forced. Everything. The story, the visuals, the \"funny\". Take \"gay Sulu\", for example. Sulu's sexual orientation has no bearing on this story what so ever. So, the only reason to show it is to be able to say \"we're good with LGBT\". Thus, it's forced, plain and simple. All of it screams \"we want to make a blockbuster\". But, that shouldn't be the point, really. They should be wanting to make a good movie. If it were really good, given the extent of Star Trek fandom, you can bet it would have been a blockbuster. So, what we have gotten is watchable, but, oh-so-forgettable. Let me put it this way: for all it's many flaws, I actually prefer \"Into Darkness\" to this movie.",
         "This ain't your daddy's Star Trek (and the 3D is so unnecessary that it is NOT worth the extra cost): (1) The plot is close to incomprehensible (2) The directing is mediocre (okay, that is a characteristic in common with the original series) (3) The audience manipulation is palpable (4) The action is overblown (5) And did I mention the plot is close to incomprehensible? Don't get me wrong. The film is generally fun. But it lacked the heart and soul present in all five television series (ain't counting no cartoons). The \"Spock Prime\" character is about as confusing as it gets. And while the homages to Leonard Nimoy were touching, they were a bit heavy handed. But worst of all was the loss of any subtlety and heart. This reboot increasing seems to be solely about the money. And the negative reaction to Zulu being gay -- which was handled with taste and, unlike the rest of the film, subtlety -- was just plain crazy. I would think that fans would have been a lot more upset about the Uhura-Spock romantic relationship given the nature of Vulcans, even half-human, half-Vulcan ones -- now that's moving away from the Roddenberry playbook far more than making Zulu gay. All in all, Star Trek Beyond is a pleasant, but not very satisfying addition to the Star Trek compendium.",
         "Those of us who know and love Star Trek are fully aware of the enormous wealth of its universe (indeed several parallel universes, and even recently this reimagined timeline that is anathema to some, but acceptable to others including myself). The whole comprises tens of films and hundreds of episodes in many series, and even life-imitates-art aspects like comments made by makers and stars at Conventions years later! This all has the paradoxical effect (also very visible with series like the BBC's Dad's Army) that the version we hold in our imaginations is now always likely to be richer and more meaningful and greater than any individual installment - past or present - that we actually get to see. And that is as true of ST \"The Original Series\" as it is of Abrams's new offering \"Beyond\", not least given that many of the Kirk-Spock-Scott-McCoy outings from the 3rd season of the \"Original\" were weak, and only erased as turkeys from our memory by reappearances of the original cast in great films like STIV and STVI. All of this is a lengthy if relevant way of building up to the idea that criticism of \"Star Trek Beyond\" (what a bad title, BTW!) for failing to match standards is inevitable, given that NO individual ST item can fully represent something that has notched up thousands of hours of screen time! Personally, I'm prepared to accept the revamped timeline in order to meet up again with beloved characters. And I don't even find the crossovers between timelines provided (perhaps now for the last time) by Nimoy-Spock and Quinto-Spock annoying. They touch the hearts of those of us who have been faithful to Star Trek for decades. It's also right that Quinto plays it a little differently to (if worse than) Nimoy, Pine likewise compared with Shatner, and Soldana with Nichols. Perhaps Karl Urban's McCoy is closest to the prototype (from DeForest Kelley), and after coming to that conclusion on the basis of three films, I'm not sure it's a good idea. Anyway, these are characters we somehow know, diverging gradually from the universe we remember, but it's mostly OK and even fun. Scotty in this film resolves into a semi-comic character from Simon Pegg (who also co-wrote the episode), and even that's OK. But of course a huge aspect of Trek is the way the key characters interact with each other - and with aliens they encounter. Idris Elba as the bad guy here does alright, but far more so in the last 10 minutes of the film than in the whole of the rest. Jaylah the alien played by Sofia Boutella is also moderately interesting in and of herself, and in the way she connects with our heroes. There are also moments here when all key characters seem to contribute to resolving a problem in a way that the Original would never have done, so plus-marks for that. On the minus side, some dialogue is just plain banal, and we do get rather few of those profound moments so vital to the ST concept. To be fair though, these are NOT absent altogether, so the standard criticism of \"dumbing-down\" cannot be applied fully here. We do have some interesting and novel McCoy-Spock moments in this film, as well as Sulu-Uhura moments. The fact that Sulu has a male partner back in port is reasonable, and a fitting enough tribute to George Takei (art imitates life in this case). The Spock-Kirk interactions do not give us much that is new, and the idea that Captain and Number 1 both might have had faltering commitment at the same time is surely inconceivable for those of us who know and love those characters!! As others have pointed out, the whole pseudo-military and naval side of ST is vanishingly weak in this film. Clearly this matters less and less to 21st-century viewers, but hurts a bit if you're an old-timer. Which brings us to the plot of \"Beyond\", which is neither especially interesting nor especially inspiring (but then that too could be said about many individual ST episodes). Many aspects are implausible (even beyond what we are used to), and not everything seems to gel into a logical and satisfying whole. Like several large-scale (and long) films of recent times, this one rather flies by without quite seeming to have given a full 122 minutes worth of content. Effects take up quite a lot of that time (too much, of course), and in quality terms they naturally go way, way beyond what we remember from the old days - but also annoyingly so. Things go whizzing by at such speed that we still don't know at the end of a 2-hour film what we have really been seeing! To me that's an inexcusable sacrificing of substance for the sake of style. Likewise, the Bridge on the Enterprise is to a design so ludicrously \"busy\" that no crew could possibly function in it for 5 days, let alone 5 years! However, very much on the plus side is the boundless imagination that has gone into conceptualising both the Yorktown Space Station and the planet Altamid. These aspects made the film for me, along with certain serious and comedic interactions between the main characters. Overall, then, this is a mixed bag of a Star Trek film that will doubtless prove quite acceptable to viewers with less historical and emotional Trek baggage. Old-timers may find it more problematical, but will probably (mostly) conclude as I do that better this Trek than no Trek at all. Given my own clear conviction (expressed in other IMDb reviews) that better no new \"Independence Day\" than the new outing, and better no contemporary \"Star Wars\" than the latest offering, this may be considered reasonable praise for the makers of \"Star Trek Beyond\", and for the film itself.",
         "As crazy as my title sounds, it's actually very apt..., looking back at the original Star Treks, they're starting to look old, for a futuristic show it sure is like stepping back into the past. However, with Star Trek Beyond, the Star Trek universe looks futuristic once again, spectacular action sequences and outlandish locations..., this is the Star Trek we all thought we loved, but it's only now we can actually say we love it. Where no man has gone before..., until now, the crew of the starship enterprise is attacked by a gang of unknown aliens, rendering them stranded on an exotic planet unknown to the federation..., many of the lesser crew perish, but our heroes survive albeit getting split up and separated in the process. What follows is a very modern action/sci-fi flick that is attractive to the casual viewer, but somewhat alienates the die hard Trekkie's..., less Star Trek, more modern blockbuster..., obviously the casual viewer isn't clever enough to keep up with the gist of \"real\" Star Trek, so it's toned down a lot. The casting is pretty much the same as the previous two films in the series, albeit this was the last film ever made by the late Anton Yelchin who plays the ever reliable Mr. Chekov..., where the series goes from here is a mystery; they can either stay faithful to the original series by replacing Yelchin with a new Chekov, or they can throw the book out of the window and kill the character off completely, either way the next film will suffer from fan backlash. Did I enjoy Beyond or didn't I? Difficult question, if it were a stand alone film then yes I enjoyed it very much, but as it's part of the Star Trek universe, I can honestly say I was very disappointed, as a life long Trekkie I don't like how they're trying to make the series mainstream..., Star Trek has a cult following and should appeal only to it's true fans, not the wider audience. My personal favourite was Captain Kirk played by the amazing Chris Pine, the guy at least embodied the spirit of William Shatner, giving an extra kick to the iconic character, making him new again and breathe again, while staying true to the original, for that I can't fault the actor..., just a shame the film's crew didn't share the same sentiment. Yes Star Trek Beyond is most certainly deserved of a watch, as a casual viewer you'll love it, as a true Trekkie you won't, a bit like marmite to be honest.",
         "You don't fool me. You might have put Justin Lin at the helm it is so obvious you were pulling the strings. Because everything in this film has your hand print on it. Star Trek Beyond even starts with a freaking lens flare. At this point I had made peace with the new Star Trek and just wanted to enjoy myself. Bring on the spectacle and eye candy. Give me the super slick action and your edge of your seat thrills. All I wanted was to have fun. But no, that would actually require some effort and you could not be bothered huh Abrams? So yes let me be one of those guys complaining that this is not my Star Trek. I have been a fan of the original franchise for a long time. I actually embraced the reboot until Star Trek Into Darkness. Although that did not stop me from enjoying for what they were. Fun popcorn movies but so far removed from what Gene Roddenberry's Star Trek should be about that it simply is not funny anymore. But would you believe it that Beyond even fails as a fun popcorn flick? All the spectacle and eye candy was unimaginative, uninspired and ultimately boring. Yes, you heard me say it. Star Trek Beyond is boring. It had me going for the first ten minutes and then I lost interest completely. There is nothing in this adventure that drew me into these events. I could overlook the minimal story and lack of genuine twist and turns. Although the big one at the end was decent enough if it weren't for the fact that I already had stopped caring about this film entirely. All the characters in this film could have died and I would not have given a damn. Maybe except for Bones. Karl Urban can do no wrong with me. Even if he tried to. But all the other characters got on my nerve. Anton Yelchin's Chekov was a parody of the original. Worse of all though he is not in the film as much as I would have liked to. There isn't a single scene that serves has a proper send off and farewell to the magnificent actor he was. And that pisses me off to be frank. Actually a lot of characters including Chris Pine as Kirk lack the charm and wit from previous films. Spock was more human than Vulcan. Let me remind you people that it was his Vulcan half that made him an interesting character. It was like no one in this production cared about this film at all. Then why should I? Why should I give in and accept this mess of a film? And trust me I tried shutting of my brain and simply enjoy it but I couldn't. Because nothing about this adventure is memorable or exciting. Most important reason is that the spectacle is predictable as hell. Even the Beastie Boys scene you could have seen coming miles ahead. Now I must admit that that scene did put a smile on my face. But one brief moment of joy like that is not enough. Not by a long shot. In order to remain fair I have judged this film solely on what it did offer and not of what it could or should have been. Still I do have to point out that this latest part in the reboot franchise is proof that this is not Star Trek. The older films and TV Shows next to spectacle always offered good drama and thought provoking concepts about many essential things that matter in life. Star Trek made science and philosophy accessible and fun for people who otherwise might not have been interested. Star Trek Beyond however dismisses all of this and treats it's audience like they are idiots. The people behind this new franchise assume current audience only want action and spectacle and nothing more. And maybe this is true which makes me sad. Very sad. I like to be challenged. I like to be provoked about political and social issues when done right. However like I first stated that I was willing and able to overlook the lack of this in favour of fun. But that's just it. Beyond rarely is fun. The very few moments that were could not make me forget the agony I experienced while watching this film. I stared at the screen in such detached manner that I think I would have gotten more enjoyment watching noise. I for one am hoping that they are done with this and that they will go back to what Star Trek should be about. But if they don't the fans will. So many wonderful fan made Star Trek projects out there that are made with love and passion that surpass these crappy movies in every way. Simon Pegg claims to be a huge Star Trek fan. Then it is so puzzling to me that he could have written this script. Almost everything about it is a downright insult to the real fans and legacy of Gene Roddenberry. I never realized this until now but Simon Pegg is kind of a douche. Overall don't bother people. Star Trek Beyond is a giant waste of your time.",
         "OK, so I'm a Star Trek fan being old enough to have watched the original series BEFORE it was in re-runs! But Star Trek Beyond just plain disappoints. It's not terrible\u0085 but it's not great either. It's Star Date 2263.2 and Kirk (Chris Pine) is into the third year of their \"5 year mission\" (which seems to somehow throw away a lot of potential sequel opportunities already doesn't it?). Less buoyant and confident than he used to be, Kirk is feeling a little emotionally 'Lost in Space': after all, as the Hitchhikers Guide to the Galaxy put it \"Space is big\u0085 REALLY big\". Spock (Zachary Quinto) also receives some news of a personal nature that unsettles him. They are both in need of a vacation, and Starbase Yorktown (queue some spectacular special effects and an operatic Michael Giacchino track) appears to be able to offer them that. The crew disperse for a bit of R and R: Sulu (John Cho) goes off to spend time with his family (after the big internet furore, the gay aspect of this is very subtle); Kirk gets career advice from the Admiral; and Spock and Uhuru (Zoe Saldana) go their separate ways since – like Ross and Rachael – they are \"on a break\". The reverie is rudely interrupted by the arrival of a frantic alien called Kalara (Lydia Wilson) from the other side of a dense nebula. She needs help to rescue her crew, stranded on a planet there. Kirk's rescue mission however goes far from to-plan, and he and his crew are caught in the clutches of the warlord Krall (Idris Elba). What's nice about this film is that the core crew of Kirk, Spock, Uhuru, Bones (Karl Urban), Scotty (Simon Pegg), Sulu and Chekov (the tragically departed Anton Yelchin) gel together really nicely as an ensemble cast. The traditional by-play between the characters feels unforced, comedic and provides a warmth at the heart of the film. There is also a touching tribute to Leonard Nimoy, who died while the film was in pre-production, woven into the story of which I'm sure he would have approved. Supporting the crew as a potential new character is the strikingly attractive and kick-ass Jaylah played by Sofia Boutella (the evil amputee Gazelle from \"Kingsman\"). There's also some fine and innovative alien technology on display with the 'swarm-like' alien fleet harking back (in an expanded scale) to the invulnerability of the nanites from an original episode. Unfortunately, all of these positives are severely offset by a largely planet-bound Simon Pegg and Doug Jung story (didn't the woeful \"Insurrection\" teach writers that this tends not to be a good idea?) and action sequences that are so manically fast-moving that it is almost impossible to keep track of what exactly is happening. (Perversely, this is a film that might actually make more sense on the small screen than the big one, which is just BAD CINEMA!). There was even one point in a final fight scene where I seriously feared Kirk and Krall might have a 'sharing of mother's names' moment (if you know what I mean) but fortunately this script apocalypse is avoided. At the conclusion the story actually makes no sense to me at all: without spoilers, it is difficult to discern exactly what the motivations of Krall actually were. Throw in a graphic in the final reel that looks like Krall is attacking the Death Star (no, seriously – watch for it!) and the concoction just doesn't hang together very well. I know Simon Pegg and director Justin (\"Fast and Furious\") Lin are huge Trekkers, but – sorry guys – this was a C- for me. It's a mildly diverting popcorn movie, but with (for me at least) yet another disappointing film, its getting to the point where the best 'summer blockbuster' is likely to be Deadpool\u0085 and that was released in February! (Please visit http://bob-the-movie-man.com for the graphical version of this review. You can enter your email address there to automatically receive my future reviews. Thanks).",
         "As a life-long trek fan, I really appreciated the effort here. This very easily could have resulted in \"pew-pew\" only story with cheap fan-boy trek crap thrown in like we got in STiD. We didn't get that. I didn't leave the theater feeling like I had just got gut-punched as I did after watching STiD. Loved the opening scene (funny). Loved Kirk's monologue. We get to see the most beautiful, most scientifically accurate, presentation of a star ship traveling at warp I've ever seen. Right up there with the black hole depiction in 'Interstellar\"! Kirk and Bones meet and have a few drinks, speaking of birthdays. Nice little nod to previous trek movies speaking of \"old-age\" etc. Their toast to \"good eyes and a full head of hair\" was also nice. (see STiD, this is how a little homage is done) The space station Yorktown a sight to see - BEAUTIFUL! The most bad ass detailed space station I can remember in SCI-FI, let alone Trek. Uhura and Spock break up! (yes!) We then see Kirk speaking with Commodore Paris played by Shohreh Aghdashloo. I think she has a great screen presence (and unique voice). We learn that Kirk is seriously considering leaving the Enterprise. While on Yorktown we see Sulu meet up with his husband and daughter. I sided with Mr. Takei and thought this change was a bad choice and not needed nor desired, but I have to say - it was done perfectly. They showed the relationship and appropriately didn't make a big deal out of. Nicely done. Then Spock is informed that Spock (prime) has passed away. I actually felt for our new Spock. Just how the hell would I feel knowing that an older version of me, that I met, had passed away? (a legendary one at that) Off to save Kalara's stranded crew. More amazing visuals as the Enterprise navigates the densest asteroid gathering in history albeit inside a nebula. I personally think a few of these scenes were too dark and I really wish they would put away the shaky camera. So hard to follow the action. It's already \"fast and furious\" enough Justin; the additional shaky cam was NOT necessary. The battle ensues with the swarm of ships. 1701 is getting the crap kicked out of it to the point of the nacelles falling off! We learn Krall is not just on board for the Abronath, he wants the crew as well! The Kelvin pods are pretty nifty\u0085 they change the uniform of all the officers that use them. Not sure I like the \"away\" uniforms, but they aren't all that bad. We get saucer separation and a crash landing on the planet with all that's left of the Enterprise. Visually epic. Our crew ends up divided into very interesting pairs. Bones & Spock, Kirk & Chekov, Scotty & Jayla and Uhura & Sulu. Great decision by the writers here. I think the best part of this movie is all the character moments we get because of this and how all of them work together. The entire ensemble is involved, not primarily Kirk-Spock centric as we saw in the last 2 movies. We learn that Spock is considering leaving Enterprise to serve his race in lieu of Spock (prime)'s death. The crew is being held in a camp and will be used as food for Krall who is using ancient technology to stay alive. Jayla is an awesome character and her \"home\" ends up being the USS Franklin (NCC-326). They all end up there and collectively figure out how to locate the crew using an amulet Spock gave Uhura. They can only beam 20 over the crew out at a time so they need a plan/diversion. The plan is set and Kirk gets to use the conveniently included motorcycle. I am thinking this is going to be pretty bad, but it doesn't turn out that way. Kirk uses the motorcycle and Jayla's holo-gadget thingy and it was is done pretty well. The rescue is orchestrated nicely and works IMO. Uhura's effort to warn the Yorktown was subverted by Krall so all their space ships are heading to the wrong point in space. Our crew figures out that a VHF signal will disrupt the swarm and of course - enter the Beasty Boys. At this point I'm ready for a huge let down. I just am not confident this will come off well and bracing myself for the worst. But I have to say I found myself smiling and enjoying the Franklin flying around to 'Sabotage'. Not bad, I was surprisingly pleased with how it all worked together. Kirk & CO figure out Krall's plan and are off to stop him. The Franklin navigates the interior of the Yorktown and stops the invading ships. Quite exciting and enjoyable watching it all. The backstories for Krall and Jayla were cut from the final product. I don't think Krall's reasoning for revenge was bad, just not presented very well. Kirk is again conversing with Commodore Paris. She thanks him and Kirk says \"it wasn't just me, never was\". Kirk turns down the ADM position to stay with his crew and the Enterprise. Loved it; Kirk's maturation is complete. Then Spock is going through some of Spock (prime)'s trinkets. He opens a case we see a picture of the old Enterprise crew. Very emotional scene. Spock then realizes his place is on Enterprise as well. Could I have written a scathing review of this movie? Certainly. It is not without fault, but I truly do think that Pegg, Dung and Linn had their hearts in the right place and gave us a pretty damn good Star Trek movie for our 50th year celebration. I feel relieved. I left the theater wanting more from these guys. I can't say the same when I left the theater after STiD.",
         "I am a trekkie who has watched everything Star Trek related from the past 50 years including every film and TV show. Although I've enjoyed the rebooted films, they never quite had the same magic as the originals. Until Star Trek Beyond, that is! Star Trek Beyond is the third installment in what is being called the \"Kelvin timeline\" of Star Trek with the rebooted universe of Kirk's storyline. Compared to Star Trek 2009 and \"Into Darkness\", this film felt astronomically more like a Star Trek film. I was absolutely blown away; what I thought was going to be a mindless, action-oriented Star Trek movie, was actually a brilliantly written and directed Star Trek film that felt more than fitting in the Star Trek universe. The spoiler-free storyline; the Enterprise is sent to investigate the disappearance of an alien race's crew in a nebula. The Enterprise (per the trailers...) ends up getting destroyed and the crew held hostage on an alien world that is used as a \"booby trap\" for countless other species that have also been tricked into exploring the nebula in one way or another. Throughout the story, we are not only introduced to new alien races, but also are introduced to past elements of Star Trek, included a desolate/abandoned NX-class starship! This film pays enormous tribute to not only \"Star Trek Enterprise\" and it's story-arch, but other Star Trek films/shows as well. For the die- hard trekkies, there is plenty to think and talk about after seeing the movie, as there are tons of references and connections made to the rest of the Star Trek universe (including ancestors of Star Trek characters seen in later series...). Furthermore, the movies makes a touching tribute to the death of Leonard Nimoy, by announcing the death of Spock Prime. It was done in a very tasteful and respectful way, and I believe most trekkies and die-hard fans would agree that it was only fitting to announce the death of his character in the film. Simon Pegg and the new director did a phenomenal job on this film. It felt so much more like a Star Trek film, at least to me, than the previous ones. The storyline was much more original than the retelling of the \"wrath of Khan\" events. Chris Pine is also really starting to hone-in on his role of Captain Kirk. Not only was the acting better, but the script this time around made him much more into the masterful Captain Kirk we grew up with in TOS and less of a party-boy. Overall, Star Trek Beyond fantastic Star Trek film. I can't believe I am endorsing and praising it as much as I am, but in my opinion, they got it right this time. After seeing this, I am starting to have more faith/confidence in the new cast continuing the Star Trek legacy and I look forward to the new films that come out in the series. If you're an old-school fan, give this one a try. It's a fun adventure and feels appropriate in the Star Trek universe.",
         "I really didn't think it could get any worse after Into Darkness. Oh yes, it did big time. I am not able to review the movie in full as I turned off after about 1 hour or so. It's not Star Trek - full stop! I would rather watch Enterprise, that's how bad it is. Please no more, please!",
         "My review is short and simple. I am both a Star Trek and science fiction fan. I decided to go in on full free fall mode. Despite what the haters were saying; they themselves not even having watched the film yet. I stayed away from that poison. If you're a Trekkie or Trekker, you'll love it. If you're into fantasy, you'll love it. If you just appreciate a good movie, you'll love it. If you're one of those \"fans\" who are never satisfied with reboots in general and think that nothing could ever top your original love, then you'll definitely dig around for something trivial to make you bash it. A true fan who loves the concept, the science fiction of it all, the art, the futuristic sense, the imagination, the escape that Star Trek undoubtedly brings, then you'll appreciate the story. The actors deliver. The character development is on point. The music? Amazing. Go in and watch the movie and accept it for what it is. Don't look for something negative because if you go in with that mentality then you'll find find it. Haters gonna hate. Ainters gonna ain't. Go on. Be an \"ainter\". When you walk out of there realizing that for two hours you had escaped the harshness of the world, a world Gene Roddenberry was so against, you'll thank yourself for allowing it.",
         "Easily the Worst Star Trek I have ever seen. Has Zero elements known for being Trek and simply transplanted Fast & Furious into Outer Space. Story-wise its utter trash. Would Starfleet have the tech to build a vast city-station of the type seen in this at such an early stage in Federation history? No. It moves so fast its incomprehensible- the CGI and lens flares make it look so synthetic I realized how good the miniatures and physical effects looked in the early movies and ached to see them again. Krall- the bad guy's motives are never really explained and is a totally forgettable villain- just an excuse for more CGI. The only saving grace are the performances of Simon Pegg and Karl Urban who really nail their performances as Scotty and Bones. So thanks to JJ and company TWO of the greatest SF franchises lay in ruins, raped and eviscerated. ST and SW.",
         "Where to even begin on how bad this movie is? How in the world did they spend 180 million dollars on this? I assume the word \"beyond\" refers to the enterprise traveling beyond a nebula of rocks for the first time. But what a shocker; they're not the first to do it. Even though the new superior enemy destroys their ship in seconds, they just find a new ship waiting for them there. On a hostile planet. Nothing ever feels dangerous in this movie. There's even a scene where Kirk saves 50 people with a off road motorbike. In the camp of an enemy who controls a swarm of 500.000 super fast spaceships. All the characters now seem like one dimensional stereotyped versions of themselves. Spock spends the whole movie thinking and looking sideways. Scotty is there to talk Scottish and call everyone Lassie, even a new female from an alien race he never met before. Doctor McCoy is never concerned about anything and doesn't seem like he's actually experiencing anything, not even the near death of his friend Spock. Many of the lines they speak honestly sounds like gibberish. Kirk is supposed to be the concerned one. And always looking clean and newly showered, even after crashing his spaceship in the jungle. All in all, this crew is not affected by what is actually happening in the movie. The entire story consists of of recycled clichés. The Enterprise goes to a new planet, but there's a bad guy there who looks like a lizard, has a dark voice, enjoys violence and wears black armor. Never seen that before. The CGI looks poor. And everything is so fantastic in scale, the movie doesn't even begin to explain how any of it works. The mass destruction seen here is on a scale nobody can relate to. There's simply no logic in this movie. The audience is just forced to accept that someone can have a fistfight standing in the ceiling 5 kilometers above ground on an artificial planet. I can't believe JJ Abrams is involved in this. The Star Trek series featured many stupid episodes that didn't make any sense in terms of the main story. But the purpose of these movies was to take the best the series had to offer and make it even better. Raise some of the central questions of exploring life, technology and space. Instead Star Trek Beyond is just a generic dumb action orgie."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Skydance Media",
         "Alibaba Pictures Group"
      ],
      "summaries": [
         "After stopping off at Starbase Yorktown, a remote outpost on the fringes of Federation space, the USS Enterprise, halfway into their five-year mission, is destroyed by an unstoppable wave of unknown aliens. With the crew stranded on an unknown planet and with no apparent means of rescue, they find themselves fighting against a ruthless enemy with a well-earned hatred of the Federation and everything it stands for. Only a rebellious alien warrior can help them reunite and leave the planet to stop this deadly menace from beginning a possible galactic war.",
         "Getting through the first half of their five-year mission, Captain Kirk and the USS Enterprise crew now venture into uncharted territories. They arrive at Starbase Yorktown for shore leave, Kirk intends to be promoted to Vice Admiral to remain there and has recommended Spock for his present position as ship's captain. After a devastating attack by a massive army of unknown aliens, Kirk and his crew find themselves stranded on an unknown planet with no means of contacting the Federation or each other. The alien warlord Krall seeks an ancient weapon called the Abronath that Kirk has kept after an unsuccessful diplomatic mission. Reunited and aided by the alien warrior Jaylah, Kirk and crew must fight to survive and take on this deadly menace with a strong hatred for the Federation. Will they be able to destroy the new danger before it's too late?",
         "The U.S.S. Enterprise crew explores the furthest reaches of uncharted space, where they encounter a new ruthless enemy, who puts them, and everything the Federation stands for, to the test."
      ],
      "budget": 185000000
   },
   "movielensId": 135569,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-07-07",
      "dvdReleaseDate": null,
      "directors": ["Justin Lin"],
      "runtime": 122,
      "movieId": 135569,
      "title": "Star Trek Beyond",
      "mpaa": "PG-13",
      "actors": [
         "Chris Pine",
         "Zachary Quinto",
         "Karl Urban",
         "Zoe Saldana",
         "Simon Pegg",
         "John Cho",
         "Anton Yelchin",
         "Idris Elba",
         "Sofia Boutella",
         "Joe Taslim",
         "Lydia Wilson",
         "Deep Roy",
         "Melissa Roxburgh",
         "Anita Brown",
         "Doug Jung",
         "Danny Pudi",
         "Kim Kold",
         "Fraser Aitcheson",
         "Matthew MacCaull",
         "Emy Aneke",
         "Shohreh Aghdashloo",
         "Greg Grunberg",
         "Jennifer Cheon",
         "Jarod Joseph",
         "Jeremy Raymond",
         "Harry Han",
         "Gina Brinkman",
         "Adam DiMarco",
         "Fiona Vroom",
         "Richard Laurence",
         "Douglas Chapman",
         "Dan Payne",
         "Anthony Shim",
         "Andrea Yu",
         "Shea Whigham",
         "Christian Sloan",
         "Jake Huang",
         "Priya Rajaratnam",
         "Luka Hays",
         "Thomas Cadrot",
         "Jennifer W. Evans",
         "Roxanne Fernandes",
         "Jake Foy",
         "Jodi Haynes",
         "Nathan Jean",
         "Tarun Keram",
         "J.P. Mulcaster",
         "Edwin Rodriguez",
         "Alex Rose",
         "Polina Soldatova",
         "Lia Lam",
         "Ian Nsenga",
         "Sara Forsberg",
         "Jeff Bezos"
      ],
      "imdbMovieId": "2660888",
      "originalTitle": "Star Trek Beyond",
      "genres": [
         "Action",
         "Adventure",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "XRVD32rnzOw",
         "Tvq3y8BhZ2s",
         "QSYLhl57pqM",
         "cr6bYn2EzvQ",
         "kfPKpVYFSnU",
         "3MBXBMkcUNo",
         "NwpvjQKdpvI"
      ],
      "plotSummary": "The USS Enterprise crew explores the furthest reaches of uncharted space, where they encounter a mysterious new enemy who puts them and everything the Federation stands for to the test.",
      "tmdbMovieId": 188927,
      "avgRating": 3.57806,
      "releaseYear": "2016",
      "numRatings": 2293,
      "posterPath": "/mLrQMqyZgLeP8FrT5LCobKAiqmK.jpg"
   }
}