{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "uprising",
            "id": 8862
         },
         {
            "name": "witch hunter",
            "id": 177900
         }
      ],
      "imdb_id": "tt1618442",
      "video": false,
      "title": "The Last Witch Hunter",
      "recommendations": [
         205584,
         68737,
         249070,
         228066,
         68735,
         49017,
         308531,
         238615,
         257445,
         184315,
         166424,
         287948,
         100241,
         87421,
         266647,
         290595,
         241554,
         265208,
         205775,
         76757
      ],
      "backdrop_path": "/o6saqjLAgKpczr0yhJkEI9fNwN7.jpg",
      "revenue": 146936910,
      "reviews": [
         {
            "author": "Frank Ochieng",
            "id": "562c283fc3a3681b610063af",
            "content": "There was a time when the movie gods were treating audiences to the omnipresence of zombies. One could not swing a dead cat without running into zombie-related cinema. It was all the rage at the box office that was experiencing a certain celluloid renaissance with overloading narratives within the “zombie zone”. Sure, zombies are still the norm in pop cultural media on both the big and small screen (anybody not heard of “The Walking Dead”?). However, another iconic horror-induced symbol–the witch–is making its way back into prominence in the cinema circles. Unfortunately, the “twitch of the witch” is explored in an over-the-top, messy and misplaced CGI-coated production of the outlandish The Last Witch Hunter.\r\n\r\nSo there are a number of reasons why the whimsical wasteland The Last Witch Hunter might be considered high-tech jumbled junk. Nevertheless, the consensus is that sometimes high-tech jumbled junk is one enthusiast’s treasured and enjoyable guilty pleasure worth its mindlessness in gold. Well, The Last Witch Hunter certainly will attract its share of followers as a gaudy and grainy fantasy adventure both big in scope and surreal absurdity. Still, this mythical monstrosity feels annoyingly strained and tries too hard to sell its outrageous, synthetic spryness.\r\n\r\nThe Last Witch Hunter is about larger-than-life throwaway silly thrills and cherishes its berserk-style entertainment with unapologetic relish. There is nothing inherently wrong with upping the ante in boisterous bounciness but Hunter is unfocused and all over the map while never committing fully to being a distinctive, impish-minded vehicle. Instead, Hunter is incoherent and erratically ridiculous as it shamefully incorporates bits and pieces from other better-made schlocky showcases.\r\n\r\nThe casting of the monotone and muscle-toned Vin Diesel seems inspired and logical for something as clumsily radical as The Last Witch Hunter. Diesel, the movie action star that made his notable mark in money-making film franchises that include The Fast and the Furious and Riddick entries, sinks his teeth into another so-called explosive characterization in Hunter’s 800-year old immortal witch hunter Kaulder. Of course Kaulder is a tortured soul and has made it his mission in hunting down naughty witches throughout his eternal existence. Kaulder needs to eradicate these magical misfits in his bid to deal with the tragic curse that has dominated his tattered psyche.\r\n\r\nKaulder may have an affinity for seeking and wreaking havoc on the notorious witches that threaten to corrupt the surroundings but he is partial to one witch in particular–the youngish Chloe (Rose Leslie from “Game of Thrones”) whose assistance is invaluable to the brooding Kaulder. Also, Kaulder is joined by diminutive cleric sidekick Dolan 37 (Elijah Wood) as well in the quest to hunt down these wily witches.\r\n\r\nThe mysterious vibes pertaining to Kaulder is somewhat realized. For instance, we know that Kaulder works steadily for the organization known as Axe and Cross. Plus, we are introduced to Kaulder’s only close buddy Dolan 36 (Oscar-winning Michael Caine) and are given a vague backstory about Kaulder’s troubled past and histrionics. The no-nonsense Kaulder’s passion for witch hunting is the only straight-forward sign that we definitely have no doubt about one way or the other.\r\n\r\n\"Witch\" way to go? Who knows but only one witch hunter can answer that in Vin Diesel's Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\n“Witch” way to go? Who knows but only one witch hunter can answer that in Vin Diesel’s Kaulder from the flaccid fantasy THE LAST WITCH HUNTER\r\nIn addition to highlighting Kaulder and company’s expectations to wipe away the “broomstick broads”, the plot starts to thicken as concerns are brewing involving the resurrection of the menacing creature in the Witch Queen (Julie Englebrecht). Naturally, the Witch Queen presents an immediate danger to the cautious Kaulder because of their nostalgic convoluted conflicts previously. Can the crazy-minded coven that looks to promote the Witch Queen succeed and overcome the slaying methods of Kaulder and his crew of crusaders?\r\n\r\nNotoriously clichéd and cockeyed, The Last Witch Hunter is a corrosive concept meshed together with all the creative comparison of a tangled ball of yarn. Similarly, director Breck Eisner’s toothless witch fantasy adventure Hunter echoes the same kind of forgettable computer-generated gibberish that was evident in this year’s bombastic medieval miscue The Seventh Son featuring the Academy Award-winning Jeff Bridges front and center in another numbing sword-swinging, supernatural sideshow of sorts. The overall film project, plagued with Eisner’s scattershot direction and a tepid script by a trio of screenwriters in Cory Goodman, Burk Sharpless and Matt Sazama (responsible for the disastrous Priest and Dracula Untold), screams of a flavorless stew–many ingredients are mixed in but a natural taste for the concoction never comes into fruition. Relentlessly murky and misguided, The Last Witch Hunter fails to trigger anything remotely intriguing beyond the furious flourishes of shocking, cartoonish imagery.  \r\n\r\nThe premise can be regarded as feeling woefully forced and choppy. The dank cinematography is indistinguishable and the visual special effects are an ambivalent hit-and-miss result depending on what frame of the movie’s indescribable spectacle that grabs your undivided attention at the moment. The storyline is hardly gripping or contemplative even from a campy standpoint. The Last Witch Hunter is frivolously flaccid and never manages to capture any of its dizzy-oriented imagination no matter how wildly off-kilter it tries to achieve in its aimless execution.\r\n\r\nDiesel fans may buy his high-wire act in Hunter and go with the flow but the actor does not deviate away from the familiar characters he has revisited countless times over in his better known on-screen outings. For years Diesel has reveled in preposterous volt-making vehicles for the most part has captured the curiosity of his targeted demographics in both excitable fanboys and hormonal female followers alike. The question remains: can they show some solid consideration in having the balding bad boy of action-packed capers toil among the foolish inclusion of wayward witches and sorcerers in an exposition that looks as if it was conceived with a Middle Ages crayon? The supporting players in Hunter are as arbitrarily acknowledged as the saturated and over-indulgent whims of this far-fetched fable that seems uniquely colorless despite its chaotic grand package of black magic banality.\r\n\r\nSomehow labeling Diesel’s Kaulder as the “last witch hunter” feels deceptive because if the Hollywood sequel machine has its way their version of “last” will undoubtedly be continuous into the next eye-rolling chapter. The real sinful hex at large that some unsuspecting moviegoers will ultimately suffer is succumbing to the laughable supernatural spell that The Last Witch Hunter will cast in insufferable, confusing fashion.\r\n\r\nThe Last Witch Hunter (2015)\r\n\r\nSummit Entertainment\r\n\r\n1 hr. 46 mins.\r\n\r\nStarring: Vin Diesel, Elijah Wood, Rose Leslie, Michael Caine, Julie Engelbrecht, Olarfur Darri Olafsson, Rena Owen\r\n\r\nDirected by: Breck Eisner\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Horror and Fantasy/Supernatural\r\n\r\nCritic’s rating: * 1/2 stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng (2015)",
            "url": "https://www.themoviedb.org/review/562c283fc3a3681b610063af"
         },
         {
            "author": "Reno",
            "id": "57c8b10cc3a3685c00000a63",
            "content": "> Fighting the same witch twice in the 800 years!\r\n\r\nI have seen Vin Diesel in many avatars, from the sci-fi to action, adventure and thriller, they all suits him better, but this supernatural theme seems weird. There was lots of action, so it does not feel like a fantasy film, which is merely the idea of film concept. From the director of 'Sahara', the story of an cursed with eternal life witch hunter named Kaulder. Except the opening, the remaining film sets in the present New York city where he has to stop a witch who is trying to bring back the witch queen from the dead.\r\n\r\nIt was just another those films where the ancient meets the modern world. Okay, I agree a few films did impacted from the last two decades since the evolution of the CGI. Even though, they were not considered the greatest, in the meantime, I don't know where did this one come from. It was not based on any book, but I think just to make a few quick bucks using the star power. Other than that this film offers nothing new.\r\n\r\nYes, I liked the Diesel's presence in this, but he should not do films like this, except if the screenplay and role developed to his caliber. It was not a big box office hit, but merely survived and critically didn't. Even the film fanatics and fans of the star disappointed with it. Now I can't believe the sequel is announced, but I hope it won't take off. Anyway, it could become a decent television series rather than a film franchise.\r\n\r\nDiesel is the reason for this film to look okay and the story was maybe the hundredth time used. Come on we all know this story, but with a new cast and the settings, it looks different. So for me the film was an average, other than that, I don't think it is worth recommending to the others. If you still want to see it, then pick the digital 3D version where you can at least enjoy some special effects.\r\n\r\n5/10",
            "url": "https://www.themoviedb.org/review/57c8b10cc3a3685c00000a63"
         },
         {
            "author": "clyde e collins",
            "id": "57c9ac0e925141538c001d86",
            "content": "**The initial tableaux:** \r\n\r\n**Initial, part I**: We're in the black plague era in Europe, say 13th century.  The spread of the plague is attributed to the spellcasting of evil witches.  Vin Diesel's character, Kaulder, is one of the witch hunters who finds the Witch Queen.  Kaulder and company put an end to the plague, but at the cost of Kaulder's wife, his only child, and most of his hunter friends.  While dying, the Witch Queen curses Kaulder.\r\n\r\n**Initial, part II**:  In current New York City, Kaulder is still hunting witches.  Yes, the same Kaulder. He's allied with an old group within the church, the Axe and Cross, which tries and imprisons witches.  They also keep secrets.  Kaulder's main contact with Axe and Cross is Dolan the 36th, played by Michael Caine, in one of those short roles that he does so well.  Dolan is quite old, and Dolan the 37th seems ready to take over being contact with the immortal Kaulder.\r\n\r\n**Delineation of conflicts:**\r\nIn the present, witch activity seems to be picking up.  Something large is brewing.  Kaulder suffers a number of reverses, and his list of allies shrinks.\r\n\r\nThe film began in apocalyptic mode, and near the end it is almost there again.  Kaulder must face what he did not face the first time, 800 years ago.\r\n\r\n**Resolution:** Will Kaulder find new allies, or must he carry the day himself?\r\n\r\n**One line summary:** Attempt at another Vin Diesel movie franchise.\r\n\r\n**_Statistics:_** \r\n\r\n**Cinematography:** 8/10 Well done on the whole; the visuals kept my attention.\r\n\r\n**Sound:** 8/10 Dialog is clear.  Music seemed appropriate.\r\n\r\n**Acting:** 5/10 Michael Caine was fine in his short role as noted above.  Vin Diesel is convincing as an action hero, even here with swords, magic, fists, and intention instead of cars, guns, and explosives. Julie Engelbrecht had her fine moments as Kaulder's arch nemesis, the Witch Queen, at the very beginning, and at the very end. Olafur Darri Olafsson was a blast as Belial, an in-your-face opponent for Kaulder.\r\n\r\nElijah Wood's performance sucked rocks.  Rose Leslie (Game of Thrones, 17 episodes) was almost interesting as Kaulder's on-again, off-again witch ally.  That was a bit weak, since she was supposed to be the female lead.\r\n\r\n**Screenplay:** 5/10 Violence and threat moves the plot along, so the 106 minutes runtime does not drag too badly. I'm glad I saw the film, but would not watch it again.  Why not?  The narrative is not well-constructed.  It seemed like every five minutes there was some change or rules, or some impressive (?) artifact to consider.\r\n\r\nAt the end of the film, I felt that I should have been happier for the protagonist, but just could not be. Would there be major challenges for him in the centuries to come?  Would Chloe be a reliable ally? By this time I did not care, and I felt this to be a major failing of the film.\r\n\r\n**_Final Rating:_** 6/10 I liked it better than most people did, but I would be hard pressed to say, 'you must see this one.'",
            "url": "https://www.themoviedb.org/review/57c9ac0e925141538c001d86"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Kaulder",
               "gender": 2,
               "credit_id": "544dff5d0e0a2608d4003f9d",
               "name": "Vin Diesel",
               "profile_path": "/7rwSXluNWZAluYMOEWBxkPmckES.jpg",
               "id": 12835,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Chloe",
               "gender": 1,
               "credit_id": "544dff63c3a36872b4004119",
               "name": "Rose Leslie",
               "profile_path": "/yWFmxrAfLtXePzVRatiAMv1KDQS.jpg",
               "id": 1223793,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dolan 37th",
               "gender": 2,
               "credit_id": "544dff74c3a3682424001767",
               "name": "Elijah Wood",
               "profile_path": "/hHzLAVspGGuPg1KW5JAEsyRvnUT.jpg",
               "id": 109,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Belial",
               "gender": 2,
               "credit_id": "544e000c0e0a2608d4003faf",
               "name": "Ólafur Darri Ólafsson",
               "profile_path": "/fDUMXqM9UALD86fiC076XVgitDO.jpg",
               "id": 110902,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Glaeser",
               "gender": 1,
               "credit_id": "562aa9ed9251414ab700135a",
               "name": "Rena Owen",
               "profile_path": "/gH41kolbpQswwqYomRiicZMOOXj.jpg",
               "id": 7241,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Witch Queen",
               "gender": 1,
               "credit_id": "544e0034c3a36872d800434a",
               "name": "Julie Engelbrecht",
               "profile_path": "/6DKJYisd8T9Frfa4G8V8kclXnH9.jpg",
               "id": 587207,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Dolan 36th",
               "gender": 2,
               "credit_id": "544dff7e0e0a26134b000b03",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 6
            },
            {
               "cast_id": 113,
               "character": "Ellic",
               "gender": 2,
               "credit_id": "5774098a92514104ae0012df",
               "name": "Joseph Gilgun",
               "profile_path": "/zTOh3XhMSQ0g7hSDPdPF2Vd5tdv.jpg",
               "id": 225610,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Max Schlesinger",
               "gender": 2,
               "credit_id": "544e00290e0a2608d000409e",
               "name": "Isaach De Bankolé",
               "profile_path": "/pr2AoaFlgQfdbIIv88UhCyp8wuF.jpg",
               "id": 4812,
               "order": 8
            },
            {
               "cast_id": 114,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "577409b8c3a3686b55001707",
               "name": "Sloane Coombs",
               "profile_path": "/mSrcmwSuG0qMmEBkAmCgeO2Mi6X.jpg",
               "id": 1643212,
               "order": 9
            },
            {
               "cast_id": 115,
               "character": "Danique",
               "gender": 1,
               "credit_id": "57740b78c3a3686ef400136f",
               "name": "Dawn Olivieri",
               "profile_path": "/ezcRQlpLaIE3jklAc7P3xdr3qjt.jpg",
               "id": 92614,
               "order": 10
            },
            {
               "cast_id": 121,
               "character": "Sonia",
               "gender": 1,
               "credit_id": "59a2ef3c92514177a704342d",
               "name": "Inbar Lavi",
               "profile_path": "/mymW9BD3nTj2sHQkK9IBo3nLHmo.jpg",
               "id": 211596,
               "order": 11
            },
            {
               "cast_id": 6,
               "character": "Bronwyn",
               "gender": 1,
               "credit_id": "544dff900e0a2608c20041bb",
               "name": "Bex Taylor-Klaus",
               "profile_path": "/yMbHsA77JAQHxtWKYDoSW2vFnLu.jpg",
               "id": 1252871,
               "order": 12
            },
            {
               "cast_id": 9,
               "character": "Miranda",
               "gender": 1,
               "credit_id": "544e00150e0a2608c5004010",
               "name": "Aimee Carrero",
               "profile_path": "/xB8yTJVu2ISh0bc0dOCFdyT2R2q.jpg",
               "id": 1224238,
               "order": 13
            },
            {
               "cast_id": 12,
               "character": "Armani",
               "gender": 0,
               "credit_id": "544e003dc3a36872b400413c",
               "name": "Armani Jackson",
               "profile_path": "/3I2hGHIKS8AL8iZwKBfvrsUpZuF.jpg",
               "id": 1378129,
               "order": 14
            },
            {
               "cast_id": 13,
               "character": "Little Girl",
               "gender": 0,
               "credit_id": "544e00470e0a2608d4003fb3",
               "name": "Samara Lee",
               "profile_path": "/67l7wx45zOiMTGs0YQwliWNi5nY.jpg",
               "id": 1378130,
               "order": 15
            },
            {
               "cast_id": 14,
               "character": "Wall Street Witch",
               "gender": 0,
               "credit_id": "544e0052c3a368242900173d",
               "name": "Stephanie Bertoni",
               "profile_path": "/rbIzmDwh1vvAXS3CrC2PeUGU0nF.jpg",
               "id": 102466,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Bodyguard #4",
               "gender": 0,
               "credit_id": "562aaa17c3a3681b61003015",
               "name": "Kurt Angle",
               "profile_path": "/p3epAYgkSphwevAC5Lu667d0wCU.jpg",
               "id": 90031,
               "order": 17
            },
            {
               "cast_id": 116,
               "character": "Council Member #1",
               "gender": 2,
               "credit_id": "57740bc092514104bf00141c",
               "name": "David Whalen",
               "profile_path": "/gtJNHMohbiHEYNIdVNd4I3aoUCx.jpg",
               "id": 1124950,
               "order": 18
            },
            {
               "cast_id": 117,
               "character": "Council Member #2",
               "gender": 0,
               "credit_id": "57740bd3c3a3686fdf0013b2",
               "name": "Jack Erdie",
               "profile_path": "/sFFUnfeU1bwdEc4XggtrfmKbi0r.jpg",
               "id": 991960,
               "order": 19
            },
            {
               "cast_id": 118,
               "character": "Council Member #3",
               "gender": 2,
               "credit_id": "57740bff92514104bf001439",
               "name": "Toussaint Raphael Abessolo",
               "profile_path": "/yQc3CV6rUMUzHxtLQQBO2Yc9DFC.jpg",
               "id": 1643217,
               "order": 20
            },
            {
               "cast_id": 120,
               "character": "Fatima",
               "gender": 1,
               "credit_id": "57e11ce1925141045c0052b3",
               "name": "Allegra Carpenter",
               "profile_path": "/c9CaHEoj3C4sRqQugOcygtVVSTy.jpg",
               "id": 1378128,
               "order": 21
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56a940359251417dce001daf",
               "name": "Jay Oliva",
               "profile_path": "/y7EbnuoKFMvU7uZ4aD50jThyNoF.jpg",
               "id": 105643,
               "department": "Writing",
               "job": "Storyboard"
            },
            {
               "gender": 0,
               "credit_id": "56a54ff4c3a368389e007d97",
               "name": "Stefan Sonnenfeld",
               "profile_path": null,
               "id": 62723,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 2,
               "credit_id": "544e00730e0a2608bb00427a",
               "name": "Breck Eisner",
               "profile_path": "/axuZves3hOQYb5R8OnmIcrO6IOH.jpg",
               "id": 52609,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56a4fcbfc3a368388e007501",
               "name": "Cory Goodman",
               "profile_path": null,
               "id": 120119,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56a54bf49251412b4400020e",
               "name": "Eric Laudadio",
               "profile_path": null,
               "id": 1567950,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56a54ee29251412dda00114b",
               "name": "Stephen P. Robinson",
               "profile_path": null,
               "id": 1413453,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "56a741c492514129f5002877",
               "name": "Pimentel A. Raphael",
               "profile_path": null,
               "id": 1409237,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "563bc86092514150af002c8f",
               "name": "Bernie Goldmann",
               "profile_path": null,
               "id": 65377,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "563bc86ac3a3681b4b02307c",
               "name": "Mark Canton",
               "profile_path": null,
               "id": 46088,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56a4fccec3a36838a3006897",
               "name": "Matt Sazama",
               "profile_path": "/vfYuk0NTHNQT6KHzdupi6sqS9mi.jpg",
               "id": 1167472,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56a4fcdec3a368388b0079be",
               "name": "Burk Sharpless",
               "profile_path": "/ciQUbLMC6Jdpk9ArWpcpA5Nwl6n.jpg",
               "id": 1167473,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56a4fd0392514172070074f6",
               "name": "Vin Diesel",
               "profile_path": "/7rwSXluNWZAluYMOEWBxkPmckES.jpg",
               "id": 12835,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a4fd17c3a368388e00750a",
               "name": "John Papsidera",
               "profile_path": "/quM89TMS6BncoIh4NdlWugXVhuF.jpg",
               "id": 561,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56a4fd4e925141524c00255c",
               "name": "Donna M. Belajac",
               "profile_path": "/4B6EVzcu6zOd9vFiQNgukZjts9.jpg",
               "id": 1328148,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "56a4fd62c3a36838900081a1",
               "name": "Deanna Brigidi",
               "profile_path": null,
               "id": 989750,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "56a4fd81925141551c0027a0",
               "name": "Chrissy Callan",
               "profile_path": null,
               "id": 1548460,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "56a4fd94c3a36838900081ad",
               "name": "Kelly Chambers",
               "profile_path": null,
               "id": 1567759,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 2,
               "credit_id": "56a4fdad9251412dda000563",
               "name": "Luca Mosca",
               "profile_path": "/adtSrjn37EhoTSHFPfqxDmBTw6z.jpg",
               "id": 52682,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "56a4fdcbc3a368389e0071cd",
               "name": "Darcie Buterbaugh",
               "profile_path": null,
               "id": 1328147,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a4fde8c3a368389b0076e1",
               "name": "Laura Wolford",
               "profile_path": null,
               "id": 1399477,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a4fdfa925141551c0027b3",
               "name": "Lindsay Mayfield",
               "profile_path": null,
               "id": 1567762,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56a4fe13c3a36838930071de",
               "name": "Paul John Carli",
               "profile_path": null,
               "id": 1401999,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "56a4fe2fc3a36838930071e1",
               "name": "Kim Berner",
               "profile_path": null,
               "id": 1418491,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "56a4fe4892514154f0005324",
               "name": "Megan Graham",
               "profile_path": null,
               "id": 1567766,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a4fe659251417207007525",
               "name": "Jessica Kivnik",
               "profile_path": null,
               "id": 1567767,
               "department": "Directing",
               "job": "Script Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "56a4feadc3a36838a30068da",
               "name": "Dean Semler",
               "profile_path": "/AnqGebF9LTL5mkertSBIegQvlB7.jpg",
               "id": 4501,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56a4febdc3a368388b0079f2",
               "name": "Chris Lebenzon",
               "profile_path": "/eA6NqE5wdIM0LT3g1ihanv5vUM7.jpg",
               "id": 541,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56a4fecec3a368389e0071f7",
               "name": "Dean Zimmerman",
               "profile_path": null,
               "id": 54271,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "56a4fee2925141551c0027dc",
               "name": "Julie Berghoff",
               "profile_path": "/2sz3g3VtNuB0NP4Tw5nzikV4uFs.jpg",
               "id": 141301,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56a4feff9251410c08005165",
               "name": "Tom Reta",
               "profile_path": null,
               "id": 92302,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56a4ff10c3a368388e007545",
               "name": "Dennis Lee Dressler",
               "profile_path": null,
               "id": 1567768,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56a4ff22c3a36838a30068eb",
               "name": "Sophie Neudorfer",
               "profile_path": null,
               "id": 1324262,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "56a4ff8992514144ba006a93",
               "name": "Steve Jablonsky",
               "profile_path": "/yXeYMIpz95tlYpzpl64nNBRVVQO.jpg",
               "id": 18264,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "56a4ffa8925141551c0027f3",
               "name": "Schuyler Grimsman",
               "profile_path": null,
               "id": 1567769,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56a4ffcdc3a368389b007734",
               "name": "Corey Sweazen",
               "profile_path": null,
               "id": 1567770,
               "department": "Art",
               "job": "Art Department Assistant"
            },
            {
               "gender": 0,
               "credit_id": "56a4ffe49251410c0800517e",
               "name": "Stephanie Spiegel",
               "profile_path": null,
               "id": 1567771,
               "department": "Art",
               "job": "Art Department Assistant"
            },
            {
               "gender": 1,
               "credit_id": "56a50000c3a368388b007a2a",
               "name": "Nellie Ann Prestine-Lowery",
               "profile_path": "/dHiHxpwFZroTwW0PBm7INqdI57e.jpg",
               "id": 1463346,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 1,
               "credit_id": "56a50028c3a3683893007221",
               "name": "Karen Lovell",
               "profile_path": null,
               "id": 407795,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "56a500509251417207007570",
               "name": "Candace Orlandi",
               "profile_path": null,
               "id": 1567772,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56a5006292514154f000536a",
               "name": "Jason Renner",
               "profile_path": null,
               "id": 1567773,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56a5007ec3a368389300722a",
               "name": "Mary Everett",
               "profile_path": null,
               "id": 1521453,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56a500a2c3a3683893007230",
               "name": "Justin Raleigh",
               "profile_path": null,
               "id": 1289047,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "56a500b992514154f0005375",
               "name": "Danielle Noe",
               "profile_path": null,
               "id": 1407889,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56a54bccc3a3683896007d8b",
               "name": "Patrick Loungway",
               "profile_path": null,
               "id": 12575,
               "department": "Crew",
               "job": "Second Unit Cinematographer"
            },
            {
               "gender": 0,
               "credit_id": "56a54c09c3a3683893007d2a",
               "name": "Brian S. Osmond",
               "profile_path": null,
               "id": 1552169,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56a54c50c3a3683893007d38",
               "name": "Jody Miller",
               "profile_path": null,
               "id": 1425829,
               "department": "Camera",
               "job": "Steadicam Operator"
            },
            {
               "gender": 0,
               "credit_id": "56a54c739251410c08005cc7",
               "name": "Scott Garfield",
               "profile_path": null,
               "id": 1419105,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "56a54c9d925141524c0030e4",
               "name": "John S. Moyer",
               "profile_path": null,
               "id": 1401989,
               "department": "Camera",
               "job": "Additional Camera"
            },
            {
               "gender": 2,
               "credit_id": "56a54ce09251412dda00110b",
               "name": "Henry Tirl",
               "profile_path": null,
               "id": 1408357,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 2,
               "credit_id": "56a54cf6c3a368389b008364",
               "name": "Petr Hlinomaz",
               "profile_path": "/2KckUR9iCfShGftU4moo6KRGykb.jpg",
               "id": 18087,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 2,
               "credit_id": "56a54d27c3a368389b00836a",
               "name": "Mitchell Amundsen",
               "profile_path": null,
               "id": 24310,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 2,
               "credit_id": "56a54d409251412dda001117",
               "name": "Thomas Townend",
               "profile_path": null,
               "id": 968858,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 0,
               "credit_id": "56a54d7792514154f0005dd5",
               "name": "Kris Krosskove",
               "profile_path": null,
               "id": 1537471,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56a54dc29251412b44000259",
               "name": "Maarten Hofmeijer",
               "profile_path": null,
               "id": 1419924,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a54e2ac3a3683896007e01",
               "name": "Daniel S. Irwin",
               "profile_path": null,
               "id": 1392085,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a54e43c3a368388e0080cf",
               "name": "Katy Wood",
               "profile_path": null,
               "id": 1458578,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a54e6ac3a3683893007d91",
               "name": "Kerry Dean Williams",
               "profile_path": null,
               "id": 1405235,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "56a54e8192514154f0005e0f",
               "name": "Daniel S. Irwin",
               "profile_path": null,
               "id": 1392085,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 2,
               "credit_id": "56a54ec7925141720700811a",
               "name": "Lee Gilmore",
               "profile_path": "/m3J8KCmSZ2ByrV4gHlbhw9zec2J.jpg",
               "id": 1360099,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a54f00c3a3683890008ee6",
               "name": "Joe Dzuban",
               "profile_path": null,
               "id": 1309884,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56a54f24925141419f003777",
               "name": "Mark Paterson",
               "profile_path": null,
               "id": 1395709,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "56a54faec3a36838a3007421",
               "name": "Elizabeth Hitt",
               "profile_path": null,
               "id": 1412721,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 2,
               "credit_id": "56a54fc3c3a36838a3007426",
               "name": "Paul Carlin",
               "profile_path": null,
               "id": 32806,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "56a54fdac3a36838a3007429",
               "name": "Andy Kaplan",
               "profile_path": null,
               "id": 1414558,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "56a5500bc3a3683896007e32",
               "name": "Heidi Tebo",
               "profile_path": null,
               "id": 1483848,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "56a55026c3a3683890008f0c",
               "name": "Emily Chiu",
               "profile_path": null,
               "id": 572365,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a741ddc3a36819d50028da",
               "name": "Daniel Mizuguchi",
               "profile_path": null,
               "id": 1568456,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7420d92514129f5002882",
               "name": "François Schneider",
               "profile_path": null,
               "id": 1561353,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7422592514129f1002b1b",
               "name": "Pavel Pranevsky",
               "profile_path": null,
               "id": 1408352,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a74263c3a36819d0002d2d",
               "name": "Jason Williams",
               "profile_path": null,
               "id": 1568459,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7427ac3a36819d0002d33",
               "name": "Sebastien Francoeur",
               "profile_path": null,
               "id": 1568460,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7432292514129f50028ae",
               "name": "Roxanne Dorman",
               "profile_path": null,
               "id": 1415622,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a74339c3a36819c900293e",
               "name": "Jose Marra",
               "profile_path": null,
               "id": 1568461,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a7434e9251412a04002848",
               "name": "Rob Zeigler",
               "profile_path": null,
               "id": 1568462,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a74368c3a36819da002921",
               "name": "Stephane Paris",
               "profile_path": null,
               "id": 1411095,
               "department": "Visual Effects",
               "job": "VFX Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7437d92514130ab000349",
               "name": "Holger Voss",
               "profile_path": null,
               "id": 1384387,
               "department": "Visual Effects",
               "job": "VFX Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7439bc3a36819c9002959",
               "name": "Charles-David Deschenes",
               "profile_path": null,
               "id": 1316727,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56a743b7c3a36819d0002d6d",
               "name": "Marie-Pierre Boucher",
               "profile_path": null,
               "id": 1568467,
               "department": "Visual Effects",
               "job": "Visual Effects Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56a743d992514129fb0029f0",
               "name": "Joel Thompson",
               "profile_path": null,
               "id": 1399866,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a743ee92514129f50028e4",
               "name": "Pascal Rigaud",
               "profile_path": null,
               "id": 1568468,
               "department": "Crew",
               "job": "Visual Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "56a74418c3a36819d5002913",
               "name": "Thomas Elder-Groebe",
               "profile_path": null,
               "id": 1568469,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a7442f92514129f50028f4",
               "name": "Allan Magled",
               "profile_path": null,
               "id": 1394282,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a74480c3a36819cb0028c6",
               "name": "Mare McIntosh",
               "profile_path": null,
               "id": 1568470,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a7449492514129f500290b",
               "name": "Paul Patrick Quinn",
               "profile_path": null,
               "id": 1568471,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a744adc3a36819d500293f",
               "name": "Steve Griffith",
               "profile_path": null,
               "id": 1406116,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a744c5c3a36819c9002998",
               "name": "Tara Conley",
               "profile_path": null,
               "id": 1484197,
               "department": "Visual Effects",
               "job": "Visual Effects Producer"
            },
            {
               "gender": 0,
               "credit_id": "56a7459692514130ab0003b8",
               "name": "Mathew Krentz",
               "profile_path": null,
               "id": 1430495,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a745ae9251416c8d000bfe",
               "name": "Vincent Cirelli",
               "profile_path": null,
               "id": 1327027,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "56a745c9c3a36819c6002bf0",
               "name": "Bruce Woloshyn",
               "profile_path": null,
               "id": 1394033,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a7462bc3a36819d0002dd5",
               "name": "Tom Wood",
               "profile_path": null,
               "id": 1568475,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56a746e392514130e70003f1",
               "name": "Ara Khanikian",
               "profile_path": null,
               "id": 1462852,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57921221c3a3685961001e8f",
               "name": "Matt Russell",
               "profile_path": null,
               "id": 1520683,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 14.701584,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 274854,
      "vote_count": 1628,
      "budget": 90000000,
      "overview": "The modern world holds many secrets, but by far the most astounding is that witches still live among us; vicious supernatural creatures intent on unleashing the Black Death upon the world and putting an end to the human race once and for all. Armies of witch hunters have battled this unnatural enemy for centuries, including Kaulder, a valiant warrior who many years ago slayed the all-powerful Witch Queen, decimating her followers in the process. In the moments right before her death, the Queen cursed Kaulder with immortality, forever separating him from his beloved wife and daughter. Today, Kaulder is the last living hunter who has spent his immortal life tracking down rogue witches, all the while yearning for his long-lost family.",
      "similar": [
         60304,
         671,
         672,
         675,
         767,
         11342,
         16859,
         129,
         68737,
         76492,
         37430,
         27022,
         673,
         674,
         290595,
         159824,
         68728,
         9100,
         12444,
         841
      ],
      "original_title": "The Last Witch Hunter",
      "runtime": 106,
      "poster_path": "/xw1GFKzxjgfm3dQoK1swFcHmfaC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "NeoReel",
            "id": 24097,
            "origin_country": ""
         },
         {
            "logo_path": "/rUp0lLKa1pr4UsPm8fgzmnNGxtq.png",
            "name": "Summit Entertainment",
            "id": 491,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Atmosphere Entertainment MM",
            "id": 2995,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "One Race Films",
            "id": 7154,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Goldmann Pictures",
            "id": 12006,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aperture Entertainment",
            "id": 33832,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TIK Films",
            "id": 72441,
            "origin_country": ""
         }
      ],
      "release_date": "2015-10-21",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Hunt forever.",
      "adult": false,
      "homepage": "http://www.thelastwitchhunter.movie/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Breck Eisner"],
      "runtime": 106,
      "synopsis": "The warrior Kaulder (Vin Diesel) seeks out witches with his allies, the Axe and Cross. The witch hunter is haunted by the thoughts of his dead wife Helena (Lotte Verbeek) and daughter Elizabeth (Sloane Combs). The men walk through the woods before encountering a horde of witches, which the men proceed to slay. Kaulder takes out a number of witches, but his main target is the Witch Queen (Julie Engelbrecht). Kaulder battles the Queen until she knocks him into a pit within a large tree. She takes the fight down there with Kaulder as the tree begins to catch fire. Kaulder takes his blade and sets it on fire to kill the Witch Queen with \"iron and fire\", ready to perish himself. However, before the Witch Queen dies, she curses Kaulder with immortality, so that he may always live with his suffering. 800 years later in the present day year of 2015, Kaulder is on a plane where he finds a young witch, Bronwyn (Bex Taylor-Klaus), who is in possession of some weather runes that Kaulder is seeking. Outside, a storm is pounding the plane until Kaulder gets his hands on the runes and calms the storm. Kaulder continues to work in New York City with the Axe and Cross, made up of special priests called \"Dolans\". Kaulder's current ally is Dolan The 36th (Michael Caine), who is approaching retirement. His successor is set to be the 37th (Elijah Wood), a young man eager to work with Kaulder. 36th warns 37th of how intense Kaulder can be. 37th calls Kaulder one day to inform him that 36th has passed on. After the Axe and Cross hold their service for 36th, 37th becomes initiated as the next Dolan. He tells Kaulder that he remembers him from his childhood since Kaulder killed the witches that killed 37th's parents, and he has been waiting all his life to fight with Kaulder. The two go to 36th's apartment to find answers. Kaulder notices three dead insects scattered close to each other and senses something suspicious. He discovers that the place has been cursed with dark magic, implying that 36th was murdered. Kaulder brings 37th to a bakery run by Max Schlesinger (Isaach de Bankole), who uses magic creatures in his food to enchant customers. He has done shady dealings with witches and warlocks, leading them to suspect that Max gave something valuable to a warlock named Ellic (Joseph Gilgun), who was sent by someone worse to look for something in 36th's apartment. Kaulder brings Ellic before a council of witches led by Glaeser (Rena Owen) to determine Ellic's fate. He is imprisoned by them. Kaulder and 37th go to 36th's body and realize that he's not dead, but cursed, and the only way to break the curse is to kill the witch or warlock that did it to him. Back in the apartment, Kaulder notices a book that 36th left clues in. On three separate pages, the words \"remember\", \"your\", and \"death\" have bloody fingerprints on them. Kaulder knows it's a message, and he states that there's only one way for him to remember his death: magic. Kaulder goes to a witch bar run by Chloe (Rose Leslie), who is a special type of witch known as a Dreamwalker. As he enters the bar, all the other witches and warlocks head for the hills, knowing of the witch hunter's brutal reputation against their kind. Kaulder approaches Chloe and asks for a memory spell to remember his death. She injects such a spell into a cherry for Kaulder to consume. He pops the cherry in his mouth and lays back, making Chloe think he's passed out. She takes the opportunity for a witch hunter selfie, but Kaulder is still awake. He then swallows the cherry for real and sees himself walking toward the burning tree where he fought the Witch Queen. He enters and sees his charred corpse, but before anything else can be shown, a warlock named Belial (Olafur Darri Olafsson) pulls him out of the spell and has Kaulder chained to the floor. Kaulder breaks the bones in his hand to release himself as Belial lights the bar on fire. Kaulder and Chloe get out of there in time as the place is destroyed. Chloe wakes up in an apartment and wanders through it. Dark forces begin to rip through the apartment and she briefly appears to be pulled into the walls where she sees a monstrous entity. Kaulder's arms then appear to pull Chloe out until she reawakens to the real world. She's pissed at Kaulder for causing the destruction of her bar, but he still needs a memory spell to figure out what he needs to remember from his death. Knowing that Chloe is a Dreamwalker and that she doesn't need a liquid potion to help Kaulder, he gets her to take both of them into his mind to remember the day he died. They find his charred body again, but this time, they hide as the Axe and Cross arrive. They see the Witch Queen's corpse crumble, leaving her heart still beating. The Dolan tries to stab it, but the burnt Kaulder awakens and screams in pain. Realizing that the heart can't be destroyed without killing Kaulder for good, the Dolan takes the heart with him, leading present day Kaulder to figure out that the Axe and Cross betrayed him and let him endure immortality. Chloe receives a phone call from her friend Miranda (Aimee Carrero), whom she last saw as Kaulder arrived at the bar. The two find Miranda dead after Belial got through with her. He calls them from Miranda's phone to taunt Kaulder. Kaulder and Chloe go to a place where witches are disguised as beautiful women with the power of magic gems that conceal their ugliness. They find the leader, Danique (Dawn Olivieri), who puts Kaulder under a trance where he sees Helena and Elizabeth. Chloe enters Kaulder's mind and breaks him out of the trance. They then interrogate Danique over her business with Belial. She confesses that he helped them obtain the gems in return for helping him obtain the heart of the Witch Queen. Before they leave, Chloe crushes Danique's gem, making her look like a hag once again. Belial locates the Witch Queen's heart with the council of witches, all of whom he murders. He releases Ellic and takes Max to use him as a cocoon to bring the Queen back after burying the heart in the dirt next to Max. Kaulder arrives and finds Max held up by roots. Belial appears from behind but Kaulder kills him with a dagger to the throat. The Witch Queen is already half-alive until she uses a root to grab Kaulder and use his immortality (which she says was always meant for her) to fully return. She peels off Max's skin and emerges in her true form before setting off to unleash her plague upon humanity. Kaulder returns home to find 36th, reawakened after Belial's death. Although Kaulder thinks he's failed in stopping the Witch Queen and is discouraged by the Axe and Cross's deception, 36th encourages him to do what he's always done best. The Witch Queen uses Ellic as a vessel to unleash her plague. Kaulder and Chloe find him in a trance. Chloe enters Ellic's mind to kill him and stop the plague while Kaulder goes after the Queen. Chloe fights Ellic in his mind and pushes him down a hole where he lands on his face and dies, holding off the plague. Still, the Queen's dark magic is spreading across the city. Kaulder battles her and nearly kills her until 37th enters, holding Chloe at gunpoint. He reveals that the witches Kaulder killed in 37th's youth weren't attacking his parents, they WERE his parents. He gives Chloe to the Witch Queen in the hope that she will grant him the magic that he was born without, but the Queen refuses and kills 37th. The Queen possesses Chloe and continues to spread the plague. Kaulder resumes his fight after being motivated by a vision of Helena and Elizabeth. As the Queen uses her powers against Kaulder, he grabs his sword and hurls it into the Queen's chest, where it combines with falling lightning bolts to destroy the Queen once again. As her body crumbles, her heart is exposed again. Kaulder is ready to permanently get rid of her and himself, but Chloe stops him. Despite retaining his immortality, Kaulder is more at peace than before, now having found a new reason to keep living. He joins Chloe as they drive trough the city on another adventure.",
      "writers": [
         "Cory Goodman",
         "Matt Sazama"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1618442/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjM5Njk5MzYzM15BMl5BanBnXkFtZTgwNzM1Mjk4NjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Vin Diesel",
         "Rose Leslie",
         "Elijah Wood"
      ],
      "reviews": [
         "I didn't expect much from this movie. In fact, the only reason why I went to watch it was because of Vin Diesel. It's another one of those Hollywood cliché filled movies. Don't expect much of a storyline other than bad things happened to my family, I became a witch hunter, defied death and killed witches. It's just filled with moments you know exactly how they're going to turn out if you've seen any other movie from Hollywood. The visual effects were good enough. And the actors played their role. The plot has so much potential. Something like knights of the round table dedicated to incarcerating witches for using black magic. It's a nice idea but poorly executed since the idea is crushed half way into the movie. Go see it if you like 21st century shotgun + sword action and Vin Diesel. Otherwise stay way from it.",
         "Besides short segments taking place in the Middle Ages and another on a plane, this supernatural flick takes place in modern New York. We have Vin Diesel's character, Kaulder, a man who lost his family due to witches, still alive after 800 years and still hunting them. One would think that Kaulder would be a stereotypical stoic, somber, asocial killing machine, but such is not quite the case. I was pleasantly surprised to find Vin Diesel more smiling and \"human\" than usual. In fact, on more than one occasion, his hero actually showed restraint and compassion, which was quite refreshing. After that Middle-Ages intro, I thought all the witches would be evil, despicable, one-dimensional creatures (which would have been boring) but then again, I was fooled as we actually delved more into the modern witch community. As far as story goes, despite the seemingly cliché setup, I'd say it was stronger than usual for that kind of supernatural-action film with a few good twists I didn't see coming. The special effects were rather good and I especially liked how the magic was so nature-oriented (as it should be for witches). One of the neatest places was that bar with the subtle light magic. I also liked the design of the old witches and that bone sentinel. There was visual stuff there I hadn't actually seen before or at least a dozen times over. Unfortunately, I found the action scenes somewhat weak in general. I know that close-in fighting is supposed to be messy and chaotic but the cuts here were sometimes so poorly done I had trouble knowing what was happening. Thankfully, it's never as bad as in that first fight in the past, and it does get better as the film goes on. So don't go in expecting to be thrilled too much by the quality of the action. Surrounding the more-emotional-than-usual Diesel, there's actually a pretty decent cast including Michael Caine (always classy), Elijah Wood (amusing and solid) and Rose Leslie, that redhead wild woman from Game of Thrones. For me, she was the highlight acting-wise and elevated everything up a dramatic notch. As for the directing, besides the poor action and annoying flares, it was competent but not particularly memorable. The \"dream\" visions were nice, but then they usually are. I saw this at a preview screening and there wasn't much crowd reaction, however it should be noted that the film kept my (very) jaded interest throughout. I didn't have trouble with the pacing or story confusion as other reviewers did. I actually found the world of the Last Witch Hunter somewhat intriguing and enjoyable. Rating: 7 out of 10 (good)",
         "Say what you will about Vin Diesel, the guy has performed a variety of roles. From the famous furious action series, sci-fi, family comedy and even the lesser known crime drama, he's a legitimate blockbuster draw. However, in his recent fantasy escapade, he's bogged down by the same flaws from Constantine and even Van Helsing; far too much stylish fireworks and lacking any real focus on narrative. The Last Witch Hunter tells the story of Kaulder, an immortal who hunts witches for centuries. Straight from the first act, the movie tries to jam as many expositions as possible while panning through myriad of hidden exotic locations practically every five minutes. It feels like a rushed tour of New York and none of CGI view made lasting impression. This is a missed opportunity since the occult version of modern city is teeming with potential. Other movies, even comic books and video games have used this premise to captivate audience effectively. The screenplay could've showcased the mythology with calm pace and imaginative scenery, yet the movie abruptly shifts between uninspiring random clubs, which makes the entire environment seems generic. It doesn't have to be Hellboy 2 level of sophistication, but the lore available feels terribly underutilized. Visual is mostly crafted with CG, and the action is mediocre with crude choreography. Underneath the cosmetic spells, the production value feels simply average, far too similar to Constantine from last decade. This rushed pace is also translated to the characters, which appear like random strangers meshed together and suddenly given strange development. This is not on Vin Diesel alone, the movie has good acting prowess with Elijah Wood and Michael Caine, among others, however the characters are nothing more than stereotypical eccentric magicians or familiar villain. At some points it even looks like some cop procedural series with awkward buddy gimmick. Lastly, Vin Diesel himself isn't that convincing even though he's groomed for superhero epic. In fact, he fared much better as Riddick, at least he had an identity as the stealthy assassin. While as Kaulder he's just another grunting protagonist despite the presentable physique or the grand attire. The Last Witch Hunter is a fantasy foray filled with shallow parlor tricks and incompatible hero in Vin Diesel. It had potential to be spectacular, but the shoddy presentation only offers pedestrian exhibition.",
         "This modern revisit of the witch-legend is not actually a bad movie. I mean it won't be the \"film of the year\" but, if you are looking for some nice special effects and a little bit of action, this film will help you pass a nice evening! I found it enjoyable and not too long, and moreover, Vin Diesel is good for this part. He always give his best in this kind of \"badass\" character (Riddick, Fast and Furious). If I had to point out something not good about this movie I would say that is too stereotyped, especially in the end, but, in the end, I think it's worth spending 10$ to see it!",
         "This movie has garnered a lot of criticism, and to be honest, I'm a little surprised. The plot and CGI were good. The acting and casting was excellent. Some parts of the movie felt really similar to The Exorcist II (Boorman), and I appreciated the lucidity and metaphysics embedded in the plot. I felt like the scene changes and juxtaposing modern/mythical images did a good job of sliding the viewer into the otherworldliness of the script. Most of the criticism seemed to revolve around expectations of Vin Diesels performance. The Character is written tersely for a reason. Why do people expect someone to be Shakespeare, simply because they lived 800 years. That experience might make some people very quiet, and I found Vin Diesel's interpretation believable and appropriate. He isn't portrayed as a scholar or wizard: just a good man who happens to be cursed. Frankly, I don't think most of these people would have been happy with a 20 min monologue by Alan Rickman. The movie was a good fantasy/action movie with some clever plot elements and creative representations of traditional magical elements.",
         "Both my wife and I really enjoyed this movie. It is character and plot driven. It does not rely on excessive violence, cheesy sex scenes, or gratuitous skin to sell tickets. What you get is engaging performances from Diesel, Leslie, Wood, and Caine, a murder mystery, and a compelling fantasy action-drama. The effects and scenes are beautifully created and shot. As fans of the fantasy genre, we loved the sword and sorcery aspects of the movie, blended with mystery, spiritualism, teamwork, and high concept story telling. This is my first Vin Diesel movie. I liked the way he played the character of Kaulder as a man with complex and layered emotions. I expected bravado and machismo, but instead got a man of depth and quality. I cannot say enough good things about the scenes with the Witch Queen, both when she first curses Kaulder with immortality, and at the end during the climactic battle with Kaulder. I really appreciated that the movie villain was not completely evil, but rather had motives that makes it clear why she acts as she does. I am looking forward to seeing it again on BluRay!",
         "If Vin Diesel is planning to star in another franchise after the successes of The Fast and the Furious and Riddick, he has another think coming. There is a fair bit of action that makes use of Diesel's physical presence but the movie is bogged down in expository dialogue and a story that is incomprehensible at times. It also doesn't help when the majority of the film is set at night with quite a few of the action scenes being difficult to see. Kaulder (Vin Diesel) is an 800 year old warrior whose main goal in life is to rid the world of witches. Just before he succeeds in eliminating the Witch Queen (Julie Engelbrecht), she curses him with immortality. We next see him in present day where he is still fighting the evil forces, this time with a priest bestowed with the title of Dolan 36th (Michael Caine). Realising that he can't continue forever unlike his immortal friend, Dolan 36th introduces Kaulder to another priest in Dolan 37th (Elijah Wood) who will take over the reigns as Kaulder's sidekick. Joining them is a good witch named Chloe (Rose Leslie), otherwise known as a dream walker. Vin Diesel has a limited acting range but makes use of it in this type of role where he is the action hero although he's not as convincing as he is in the Fast and the Furious series. That's probably because the wisecracks are funnier and the character of Dominic Toretto is more fleshed out. Two time Oscar winner Michael Caine has a small role and is in a coma for most of the film. He once said of his Jaws 4: The Revenge role that the house that Jaws built was terrific so the role of Dolan 37th must have financed his holidays. Elijah Wood displays his dramatic abilities and is involved in a twist which is preposterous. The editing is fast and furious at times which makes it difficult to focus on what's happening in the action sequences. They seem to be well-choreographed with the exemplary sound effects bringing the fight scenes to life. Most of the visual effects are of the CGI variety and make a solid contribution to the look of the film. No matter how successful or unsuccessful a film is with the technological side of things, if the story is inferior like it is in this film, the overall impact suffers. There is a lack of tension for this particular genre and if you can remember the majority of the film after seeing it, you're doing much better than I am. The Last Witch Hunter is a forgettable movie that has better action sequences than plot lines and dialogue. Vin Diesel has shown in the past that he can carry a movie, just not this one. The box office reception suggests that he should stick to the Fast and the Furious franchise. http://mlaimlai2.wix.com/magical-movie-review",
         "In the Middle Ages, the witch hunter Kaulder (Vin Diesel) hunts down the Witch Queen (Julie Engelbrecht) with the inhabitants of towns devastated by the black plague that she had spread.. The Witch Queen curses Kaulder with eternal life to make him suffer the loss of his wife and daughter for the eternity. Eight hundred years later, there is a balance in the world and the witches live peacefully among humans. The witch hunter Kauder and The Axe and Cross that judges and imprisons witches in the darkness are the responsible for keeping the world in peace. The priest Dolan 36th (Michael Caine) is the liaison between The Axe and Cross and Kauder, giving support and keeping the record of his life. On the same day of his retirement, Dolan 36th dies alone in his apartment. Kauder goes to his apartment with Dolan 37th (Elijah Wood) to investigate his death and finds black magic in the spot. Further, he finds that Dolan 36th is still alive under a powerful spell. Now Kauder visits the witch Chloe (Rose Leslie), who owns a witch bar, to seek her help to recall his own death following clues left by Dolan 36th. However the bar is attacked and destroyed by the witch Beliel (Ólafur Darri Ólafsson) and Kauder leaves Chloe under his protection. When she uses her abilities to help Kauder, he learns a dreadful secret about his immortality. \"The Last Witch Hunter\" is an entertaining fantasy with lots of action and special effects. The excellent cast with Michael Caine, Vin Diesel, Rose Leslie and Elijah Wood give pedigree to the adventure. The conclusion is prepared for a sequel with Kauder's discovery. My vote is seven. Title (Brazil): \"O Último Caçador de Bruxas\" (\"The Last Witch Hunter\")",
         "The Last Witch Hunter really left a lot to be desired. It's a typical last of your kind story. Vin Diesel stars as that said last of his kind. Oh, and he's immortal by the way. Something about killing the witch queen. I'm not really a big fan of Vin Diesel, but even to those who are I'd just avoid this. I mean Vin himself does what he can, but honestly the guy couldn't act to save his life. Though he's far from the worst of it. The biggest shocker was Elijah Wood. I mean, seriously? The guy doesn't really give a convincing performance. I mean he's had his fair share of bad movies (ex. North, All I Want, Spy Kids 3-D (etc.)), but his performance in the movie made it almost seem like he was desperate, knowing he could in no way save the movie, but felt he had to make a conscious effort to do so. The problem with his character being the bad guy is that the movie hints so many times he's the bad guy and he at one point is even questioned and denies it. This wouldn't be such a problem if they didn't make it so painfully obvious he's in cahoots with the Queen. Like I said, I love the Lord of the Rings movies as much as the next guy, but he's had better movies. The rest of the cast doesn't leave much of an impression, but we do have Michael Caine as the guy who was cursed. He's bland, but what can you expect? As for the story it's more confusing than interesting. Most of the logic seems to be set aside for glimpses of CGI effects which are only average at best and the editing during these scenes is too jumpy. Can't seem to stay on one thing too long eh? And for a movie all about action there doesn't seem to be very much of it. It seems like 70% of the movie is philosophy BS and 30% is actual action. So there you have it, a 106 minute winded philosophical mess. It probably would've been better off as a TV series or a short film, but as a movie it wears out it's welcome far too quickly.",
         "\"The Last Witch Hunter\" casts spells that are far from inspired and mediocre at best. \"Dungeons & Dragons\" aficionado Vin Diesel toplines this ponderous, PG-13 rated pabulum as an 800-year old protagonist who struggles with the help of the Catholic Church to preserve a precarious peace between witches and mankind. Not only does Diesel appear incredibly miscast as an immortal \"Highlander\" type medieval warrior careening around contemporary New York City in a sports car, but also this witchy washy yarn doesn't surpass superior witchcraft fantasies such as \"Snow White and The Huntsman\" (2012) and \"Hansel & Gretel: Witch Hunters\" (2013). The chief problem with this lavishly-produced, CGI-laden extravaganza is that it takes itself far too seriously. Apart from its dire shortage of humor, this dreary potboiler suffers from a dearth of quotable dialogue, banal adversaries, and second-rate supporting characters. Gifted thespians like Oscar-winner Michael Caine and Elijah Wood shrivel in lackluster roles as our hero's sidekicks who are designated as 'Dolans.' \"Sahara\" director Breck Eisner and three scenarists, Cory Goodman of \"Priest\" along with Matt Sazama and Burk Sharpless of \"Dracula Untold,\" have conjured up a synthetic storyline that generates neither charisma nor spectacle. Actually, they appear to have imitated the sensational Wesley Snipes' vampire saga \"Blade\" right down to its rebirth of an ancient blood demon. Similarly, \"The Last Witch Hunter\" should have bristled with non-stop momentum, violently outlandish combat sequences, and a coherently contrived mythology. Instead, it degenerates into a dreary mumbo-jumbo melodrama. The most ambitious CGI scene pits our hero against a clumsy beast known as 'the Sentinel,' and he destroys behemoth with a sword as if he were a bullfighter straddling it. This unruly creature resembles a huge tiger that appears as it if were assembled from wicker and features a jet engine afterburner for its gullet. Our hero's chief adversary is a hideous Witch Queen swarming with creepy crawlies who looks like she has spent too many centuries in a mud bath. Moreover, she boasts none of the imaginative flamboyance of Charlize Theron's enchantress in \"Snow White and the Huntsman.\" \"The Last Witch Hunter\" unfolds during the chilly Middle Ages. A group of stalwart souls armed with swords trudge through snow-swept, mountainous terrain to storm an eerie cluster of haunted trees. A despicable looking dame known as the Witch Queen (Julie Engelbrecht of the TV mini-series \"The Strain\") inhabits this stronghold raging with fire and brimstone. Predictably, she isn't glad to see these bearded gate-crashers with their religious iconography. This homicidal hag with her hatred for mankind has already decimated humanity with a black plague and incurred our hero's wrath. The Witch Queen's pestilence exterminated our hero's wife and daughter, and his happier times with them are recounted in several flashbacks. When Kaulder (Vin Diesel with dwarfish dreadlocks) and the Witch Queen tangle, our fearless witch hunter skewers her with his flaming sword and finishes her off. Ironically, Kaulder survives this trial by combat, but his survival becomes a tribulation. \"I curse you,\" howls the wounded witch. \"You'll never know peace. You will never die.\" Afterward, \"The Last Witch Hunter\" shifts its setting from the 13th century to the 21st century. Our brawny, shaven-headed hero with neither dwarfish facial fuzz nor noggin fur prowls a passenger jet as it encounters foul weather. Actually, an ignorant young witch has smuggled a dangerous collection of runes aboard the aircraft, and she is to blame for the increment weather. Naturally, our erudite hero invokes his age-old wisdom and defuses these volatile artifacts. Nothing about this scene creates either suspense or excitement. As his own personal reward, Kaulder seduces a nubile stewardess before he sits down for the last time with his 36th Dolan (Michael Caine of \"The Dark Knight\"), a revered Catholic cleric who has spent the last 50 years chronicling our protagonist's escapades for posterity. Incidentally, Dolans are members of a covert Axe and Cross society within the Catholic Church. Like Kaulder, they have devoted themselves to maintaining an uneasy truce between humans and witches. In \"The Last Witch Hunter,\" witches walk the earth with mankind, just as vampires did in \"Blade,\" but few people know about their phantasmagorical presence. Kaulder and the clerics act as intermediaries who work alongside the crafty Witch Counsel to keep these necromancers in line. Kaulder captures witches who illegally practice black magic, and the Witch Counsel entomb them in a maze of caves. The 36th Dolan is poised to retire, and the 37th Dolan (Elijah Wood of \"The Lord of the Rings\" trilogy) prepares to replace him. Although he saved the 37th Dolan from a coven of witches, Kaulder doesn't immediately recognize this newcomer. Meantime, dramatic complications occur when the 36th Dolan appears to have been murdered under mysterious circumstances by a shape-shifting sorcerer. Kaulder discovers black magic at the scene of the crime and suspects that his ancient adversary, the Witch Queen, may have been playing possum all those years. Along the way, Kaulder recruits a 'good' witch Chloe (Rose Leslie from \"Game of Thrones\") to help him sort out the mystery. Chloe's claim to fame is her ability to cavort in dreams. Happily, she rescues Kaulder from one disastrous dream after another when the Witch Queen's evil cronies attack him on several occasions. Our hero believes the solution to his quandary lies within his \"Matrix\" like dreams. Ultimately, \"The Last Witch Hunter\" is largely incomprehensible gobbledygook. Eisner and his scribes have enormous problems mapping out their complex witchcraft mythology. They sprinkle bread crumbs of information about these conjurers throughout the muddled melodramatics, but seldom does anything about them come across as palatable. Two surprises occur during these sluggish shenanigans, but neither are genuine revelations if you have paid attention to the formulaic plot. The villains don't stand out from the background, and the Witch Queen is stuck in the mud from the start. Eisner orchestrates several big-budget action scenes, but these emerge as sloppy exercises. Altogether, \"The Last Witch Hunter\" qualifies as hex-rated rubbish.",
         "The Last Witch Hunter looks like a pointless mix of \"Blade\" (very cool), \"Hellboy\" (very very cool), \"The Highlander\" (classic), \"Constantine\" (very good), \"The Priest\" (worse), \"Max Payne\" (worst) and the other Gothic-, horror- and fantasy-like movies. The main problem is that the authors put some boring CGI in every scene for no reason. The second is the cast: it is hard to imagine Vin Diesel in the role of a 800-year old immortal hunter. To be honest: the start is hopeful (thanks to the \"13th warrior\"...). In the intense first scene he's wearing some badass hair, beard and costume, but in the rest of the movie he is more looking like some Armani-model from a fashion show. He is talking, walking and acting like Dom Toretto. Which means his suffering is unbelievable too. Despite I think Vin is a likable actor and I've really liked him as Riddick. But this character just isn't his type. The others - the young witch, the old witch, the young priest, the old priest - and the whole imaginary world are totally sketchy. Even if they've tried to copy a lot of computer games (for example The last of Us) the result is awful. Very colorful and nice-looking, but empty. And finally: the writers and the script. There is no need for words... The only good thing about the film is Michael Caine: he is funny and good as always. I have a question to the director (the guy who directed the impressive The crazies) Breck Eisner: Why did you do this and why?! You're not Uwe Boll, so stop doing this! No offense. ;)",
         "The Last Witch Hunter (2015): Dir: Breck Eisner / Cast: Vin Diesel, Elijah Wood, Rose Leslie, Michael Caine, Julie Engelbrecht: Imbecilic science fiction action film that seems to suggest our defence against evil. Vin Diesel plays a cursed witch hunter who is ages in years and now hunts witches in modern day. Elijah Wood plays a young priest who aids Diesel and comes off as unfortunately laughable because he is hardly threatening. His portion of the film is also terribly predictable. Rose Leslie looks stunning in her black leather and flashing red hair but again, her scenes come off as laughable. She works in a bar, likely to intoxicate herself into figuring out how she went from Game of Thrones to this junk. She is a witch but feels outside the box because she is a creature of good yet viewed as a creature of evil because of reputation. Julie Engelbrecht has the good fortune of being under heavy makeup so that she can less associate herself with this junk. She plays a scary witch whom Diesel stabs a half dozen times and plays x's and o's with her body while she burns. Perhaps the worst aspect is how veteran actor Michael Caine got roped into this. He is friends with Diesel before being cursed into a sleep. That is pretty much his role for the remainder of the film. He might as well be asleep for all the good this tripe will do for his overall career. The special effects are okay but director Breck Eisner seems to let everything get away on him just like the swarm of insects that emerge towards the end. This pointless drivel is so pathetically lame that perhaps jamming a stake through it would do it good. Score: 2 / 10",
         "Bit of a mess all around this. Never really got off the ground and the script was a load of nonsense. Acting was only ever tepid and the sets were not good at all.. Michael Caine was just in it for a few quid and Van Diesel can look forward to the money he earned for it..maybe it could be used for acting lessons. Bad effects and all the extras were uninspired the whole way through. Brought nothing at all to the genre and is an easily forgettable pile of bad movie making. Originally gave it a 3 but after reading my own review just before submitting I changed it to a 2!",
         "Vin Diesel plays Witch hunter who is cursed with immortality, he goes there the centuries preventing any supernatural disasters from happening. Until a mysterious figure appears that may have a connection to his past. It's up to him to uncover the secret before a disaster may come afoot? The film is not bad, but not great either. It spots they could have done better that what they have done. I do admire that it does not try to be over the top with camp. Vin Diesel does give quite a sophisticated performance, at no point I fell he never tries to over do it. Elijah Wood is also memorable in his role. And the effects are alright, an entertaining movie to pass the time.",
         "Expecting one thing and getting another, is one of the main reasons people end up disliking what they see. If you expect horror going to see The Last Witch Hunter, you're bound to be disappointed. It's not a horror movie - I wouldn't be seeing it if I thought it would be. This is another one of the sort of comics heroes of a new sort that Vin Diesel specializes at. Check almost all his roles, he's always creating a super tough guy, which is a borderline superhero, and very often an actual superhero without the costume. That's why he's always looking for new franchises, cinematic franchises are the modern day equivalent of comics superheroes. They carry on from one episode to the next never ending, as long as there's demand for the product. I love comics, especially sci-fi comics, and fantasy as I stated more than once is a variation of sci-fi. Now sci-fi comics aren't real sci-fi,they use the sci-fi elements to create a setting for the heroes. Same is true with any other sort of comics, the only important thing is that you can always create a new sequel, a new episode. Considering all that, TLWH, is doing it's job very nicely. It has plenty of action, good CGI (it's not a surprise anymore, but it's still worth mentioning). It does call for a lot of suspension of judgment, and the plot itself is not always very consistent, (i'd rate it higher if it was). The acting is all right, Vin does come out a bit wooden at moments, but as a rule he's a much better actor than he's given credit for - as long as he stays inside his comfort zone. The indestructible tough guy with a sensitive heart hidden inside. Bottom line, if you want an action fantasy comics, you'll get it here. Don't look for anything else, you won't find it.",
         "Clearly timed, in fact rushed, for the upcoming Halloween holiday (no big revelation here), this horror-schlock is resembling a typical holiday souvenir stand: an assortment of cheap, popular items, all mixed up together without taste or general concept, but everyone that stops by will find something to one's liking. Vin Diesel and his helium-soaked voice are sleepwalking through the main role just like the stand employee, who is in his mind at home with his family, but he just has to make it through the shift somehow. Diesel makes it, in some sort of brooding, drab performance, thinking that this is how one portrays a tired old man, which is what his character is supposed to be. The story that revolves around him is a convoluted mixture of popular horror motives and ideas from bigger and lesser films, and first that come to mind are \"Highlander\", \"Blade\", \"Underworld\", \"Mummy\" and \"Constantine\". Really, if you've seen any of those five - don't bother with this one, it will bore you to untimely death. If you, however, do wish to pay tribute to the Halloween by seeing a suitable film, prepare for one that is unevenly and uninspiredly directed and acted, filmed in a generic, overly dark cinematography that will from time to time be interrupted by jarringly kitschy and colorful dream-shots. There may be some art in all that but it is as nonsensical as all the complicated rules the film throws at the viewer in many boring expository scenes - which then itself forgets to follow (the script must have come directly from some goth kid's diary). There is a couple of twists thrown in to atone for the absence of a proper culmination. There are some history lessons, just to try to make the story relevant. There are also Michael Caine and Elijah Wood, making underwritten and probably expensive cameos. There's the predictable ending and a set up for the sequel. If they promise the Plague wins the next time, I'm up for it all the way. Meanwhile, I'm thinking of buying a witch mask and trolling policemen on the block in it, just to make up for the seriously underwhelming experience of seeing this.",
         "I'm not dumb, I knew what to expect when I put this on. I wasn't expecting some Tarantino esque film with tons of heart and interesting dialogue. I was ready for some mindless monster action along the lines of Underworld or Blade, unfortunately none of that was to be found. Instead \"The Last Witch Hunter\" plays out like a very shallow detective movie with a very unlikable detective. Vin Diesal just didn't work in this, Vin isn't in movies because of his acting chops, he is in movies because we love to watch him be a badass. In this though he is basically just walking around investigating clues while we are treated to some pretty lame CGI. There is very little action in the movie and the few action scenes that do take place are pretty underwhelming. \"The Last Witch Hunter\" should have been a mindless action movie, it really didn't have the cast or the story to be what it really was trying to be. Pretty much all in all this was a very dulled down version of much better movies. 3/10",
         "well..i am a big fan of any fantasy, fiction, science fiction, horror , mystery etc films all my life..the unknown is fascinating me...i have seen thousands of films of this kind..some good , some bad, some interesting, some childish, some boring, some cruel, some excellent...but i notice that the inspiration is drying up already (with the exception of ''snow piercer '' which fascinated me for some reasons)....the last years we see again and again, the same and the same scenario... a story beginning with a little mystery and ending with a big battle against the main evil character..we have seen all kind of evil so far...vampires, demons, werewoolves, ghosts, monsters, evil aliens, zombies, witches, dinosaurs, etc etc...i appreciate the effort of the producers to entertain us, but we now need a new kind of threat or fear or theme...lets say something about the matter of St John s revelation..or the matter of flat earth..or the matter of hollow earth..or the matter of several dimensions..or the matter of Cern ..or a good adaption of arthur clark s ''end of childhood''...or the matter of nephelim below the surface in hades..or a good adaptation of ''life after death'' by the book of Emmanuel Swedenborg... or a good adaptation of Enoh book of fallen angels...so many new things to handle...its time for the writers to adapt in these new challenges...no more vampires or zombies, its enough, OK! thank u for all your offering to our entertainment, but its time to go forward, the next step front.,, (i like vin diesel though).",
         "I have no high expectations when i heard this movie. All I know is this movie stars the great Vin Diesel, about witches and an seemingly awful trailer. Yeah, it's a sign for a bad movie. But the movie eventually delivers a fun ride that no one would ever expect, thanks to the spoiler-free trailer (which also awfully bad at the same time). Vin Diesel's performance was incredible, like his Fast and Furious persona. Michael Caine's acting was also still awesome as always. The film also has twists, something that I couldn't imagine before. Overall a good experience by the way Although with solid performance and a fun story. The film still has several mistakes. The storyline itself was confusing (in my opinion) so it's no surprise that people may not understand the story at first glance. The CGI still can be spotted easily, but several CGI involved scenes were spectacular. The plague in form of million of bees(?) were jaw breaking. The lack of humour in this movie, in my opinion, for me makes this movie not really enjoyable. The film also has several plot holes (once again, it's in my opinion, everyone's view to this movie are different) But overall, this movie is a fun ride to be watch. For die hard Vin Diesel fans, this is a movie for you! Final Score: 7/10",
         "700-odd years ago, Kaulder (Vin Diesel) leads a party in pursuit of the Witch Queen, bent on retribution for the deaths of his wife and daughter. He is the only survivor. We next find him in present-day Manhattan, cursed with immortality by the Witch Queen, as witch-hunting enforcer for an organisation called Axe And Cross where he aided and abetted by a chap called the Dolan. The current and 36th Dolan (Michael Caine) is on the point of retiring when he suddenly dies. With the assistance of the 37th Dolan (Elijah Wood) Kaulder starts to chase down some aspects of the death which don't make sense. It was a good idea to take a supernatural movie and put a CSI emphasis on it. It isn't entirely successful here but, mostly, this is a decent romp. Vin Diesel manages to bring together his hardman and his soft side, and makes a protagonist who is fun to identify. Michael Caine plays Alfred again in a \"where's my pay cheque?\" part, which gets the performance it deserves. Rose Leslie – very pretty, and I'd never heard of her having never watched Downton Abbey or Game Of Thrones – does what she can with a part which is chunky in terms of screen time and skeletal in terms of character development. This isn't a terribly good film, but I quite enjoyed it simply because it's the sort of not terribly good film which I quite enjoy. I suspect it won't be the franchise-starter it looks as if it hoped it would be,",
         "Contains all the good stuff you can expect from a good supernatural Vin Diesel movie. Even supersedes my expectations. The visual effects and the feeling of being plunged into a dark world matches Constantine. The acting is good - Michael Caine and Rose Leslie are really great in their roles. All the main characters are engaging and believable in the context of the movie. Even the baddies have souls to feel through the screen. I would like to see sequels of this. The witch-world really caught me. Some flaws exist that annoyed me. I try to just ignore them and not be the negative guy, but it was hard this time: Who decided the title \"The Last Witchhunter\". Last how? Was there any other ever? \"The Witchhunter\" would sound better and match the movie content. The witch magic was very diverse and immensely powerful. Yet all witches were afraid of the one Witchhunter and failed to beat him. They could drag people to different dimensions, trap them in eternal mind-dreams, throw them around like leaves etc. But the Vin Diesel character was just too cool maybe? He always beat them with fists, a sword or a thrown dagger. What's wrong with some firearms? If non-magical blades worked, some rifles would be a better bet if the fate of the world was at stake. Not cool enough I guess. I truly hate it when the hero fights for his life and needs to save the world, but when he has won and just need to finish of the enemy, he needs to pause, say some cool one-liners, spin around the sword or make an absolutely ridiculous finishing-attack - like a wrestler making a flip from the top-rope. But I loved the movie.",
         "In a world where most of the films are boring and predictable, The Last Witch Hunter was a joyful surprise. Most of what i see, in the realm of non indie or non blockbuster, the Halloween or summer movies realm, is the same formula, and while TLWH relies on a old one, still manages to safe a few surprises in the plot, that i didn't expect, and there's what makes this a better entertainment than the others holidays films. It's a movie where you can sit, watch, get some popcorn with your friends, and enjoy one nice evening on home or cinema. The acting is not the best from the actors, Michael Caine and Diesel are what the movies needs, and is where lies the goal of this flick, is not the best, but do what propose to, be a good time, there's nothing else we can complain about it, a good time movie is way better than a boring ultra deep, 3-hour, intellectual film that goes nowhere, and is easy to say that the enjoyable is worse than the art for the sake of art. In the end of TLWH i was very satisfied, i wont remember forever, it wont won a Oscar, but the times i'm home ate Friday night with some friends, probably this will be in the list of movies that i mighty see, so don't mind the reviews, if you like some time without a urge to be smart and cool, grab a snack, see this film and enjoy what the entertainment world has to offer, entertainment.",
         "The Last Witch Hunter is a supernatural action film that is generally fond on establishing its own mythology than anything else. And honestly, it works, perhaps only because it helped glossing out the weaknesses of the plot and the action scenes. Some strange ideas are better than the others, but the plot is just dumb, what's worse are the twists, resulting the entire film as a generic schlock despite of the neat world they are building up. Some visuals can look cool and there are reasons to chill onto this universe that makes no sense. And that is much it: it's not fun enough, neither clever enough. k The movie moves its story like you are seeing an already existing property; while you hear familiar jargon that relates to the fantasy genre, we are also introduced to new legends, like the Witch Queen or this centuries old organization called the Axe and Cross. There are witches that need to be slain, while there are ones that for some reason are allowed to roam around. We don't quite see how this world affects, more specifically, the modern times; we assume the less dangerous witches are just goths. To sum it up; evil witches still exist and Kaulder (Vin Diesel) is the only one who can stop them in this time. And the movie keeps digging within this mythology than throwing in another action set piece, which is kind of an interesting turn, and even having anything substantial within the storyline. Though some ideas are appealing, like how one priest of every generation are devoted to serve the witch hunter (despite that they're kind of needless, at least based on what we saw.) The scenes that involve these priests are intriguing, probably because they're such an odd misfit with its protagonist. It's amusingly intriguing having Vin Diesel and Elijah Wood potentially sparking a strange chemistry together as a mismatch duo. Unfortunately, the movie wants to be conventional and finds Kaulder a more competent sidekick. Put the world building aside, the plot is too simple, yet so dumb. It's basically just finding out the plan of the villains instead of actually chasing them. At one point, they manage to meet face-to-face for an action scene, but the heroes rather go detective work for a friend who is comatose by a curse, it keeps building this world without developing much of the plot, the major twist bogs the story big time, in which they could have done it simpler without coming across with other places for the sake of telling the audience that this is a rich universe. Everything else about this \"universe\" isn't quite as inspired as it thinks. The hero himself is just one of those non-aging protagonists who broods about the misery of their immortality. The main antagonist is also a stock villain whose threat is only defined by its aesthetic. Again, the supporting characters are a lot interesting for bringing distinct flavor here, well, hypothetically. The dream-walking though is sort of tough to follow, but anyway. The acting is nothing special, either. Although Vin Diesel tries to be different by showing a charisma, but that lighter side didn't shine enough in the performance. Rose Leslie does try to make her role somewhat appealing, but it didn't shine enough either. Elijah Wood presence alone kind of brought the oddness, more or less, while Michael Caine brought some warmth in a minor role, however isn't quite convincing of being someone who is supposed to be younger than Vin Diesel, but that idea alone is ridiculous anyway to work, unless the script was any stronger than this. The visual effects are cool enough for its own good, while the action scenes, though watchable, are nothing memorable. No matter how much the movie builds its universe, trying to reserve the action for the sake of focusing on how \"fascinating\" this new mythology is, it's still kind of a generic action film, suffers with a few yet big clichés and wasted opportunities. Maybe only a silly person like me would have think that a supernatural buddy action film starring an immortal Vin Diesel and a priest Elijah Wood as the main concept is a better idea than what the movie ended up to be. What makes a cinematic or a grand fictional universe appealing is its distinctness and creativity in plot, characters and inspirations. The latter slightly does get there, except the formers are the ones that suffer. My expectations might be too ludicrous to work, but hey, strangeness are at least interesting. Though, what generally lacks here is enough pizazz of making the diversions engaging. The surface is still pretty good to look at and granted, mind traveling witches and padre sidekicks are nice. All we need is a plot that actually goes somewhere, a novel hero and a truly threatening villain.",
         "I am not a hater at all.. in fact i love him in Furious, Riddick and in Knockaround Guys... but in this film, truly, there is no magic in his performance. He is atrocious... the guy worth 20 MIL every movie but he is still among the worst actors in Hollywood... Here, the rest of the cast is pretty bad too. Elijah Wood now a B league actor who cannot save a big movie even if Vin Diesel is the main actor is also a reason why this movie does not work. To whoever choose the final casting, please retire with Vinnie as well. Breck Eisner who direct an OK adventure flick ''Sahara'' and a cool horror remake ''The Crazies'' is not doing well here... if he makes a film every 5 years or so, let's pray this his is last one. I was more entertain in 2011 ''Season of the Witch'' starring Nicolas Cage and at least it was not serious. It is the problem here, it is taken too seriously and it start average to mediocre. Avoid at any costs !! Does not even worth a download in my book.",
         "I think it would be hard for people not to admit that Vin Diesel is one of the most likable actors living today. He's not the thespian that a Leonardo DiCaprio or Daniel Day-Lewis is, but the man is entertaining as hell. The Last Witch Hunter is yet another vehicle for Diesel to excel in as a true movie star, no Fast and Furious pun intended. The film is not very good at all, but it's incredibly entertaining. Putting Vin aside, you have a solid cast with Elijah Wood, Rose Leslie, and the cinema legend Michael Caine for gosh sakes. This was most definitely a paycheck film for Caine, but he gave a formidable performance. Leslie, from Game of Thrones fame, also was solid as the dream-walker/semi love interest for Diesel. Elijah Wood has a very limited role and I never really bought into his character or performance rather. The writing is not exactly Oscar worthy, it's rather poor actually. But it didn't need to be. Vin gave us just as many lame one liners as every Fast and Furious film. Plus, it's hilarious hearing Diesel call Caine a 'kid'. It's these gags that added to the outrageously fun experience. The reviews for the film have been poor to say the least, and I can't really argue with them. For me, it was just endlessly entertaining. I actually found the CGI to be quite effective for the most part especially for the villainous witch queen. So the story and writing can be confusing, weak, and contradicting at times, but the visuals and performances make the viewing worth while. There's not much else to say, but I hope this 90 million dollar film turns into a franchise, although I think it's destined to flop. +Perfect film for Diesel +Solid cast +Leslie holds her own +CGI -Weak writing -Contradicting story 6.3/10"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "Summit Entertainment",
         "TIK Films",
         "Mark Canton Productions"
      ],
      "summaries": [
         "The modern world holds many secrets, but the most astounding secret of all is that witches still live amongst us; vicious supernatural creatures intent on unleashing the Black Death upon the world. Armies of witch hunters battled the unnatural enemy across the globe for centuries, including Kaulder, a valiant warrior who managed to slay the all-powerful Queen Witch, decimating her followers in the process. In the moments right before her death, the Queen curses Kaulder with her own immortality, forever separating him from his beloved wife and daughter in the afterlife. Today Kaulder is the only one of his kind remaining, and has spent centuries hunting down rogue witches, all the while yearning for his long-lost loved ones. However, unbeknownst to Kaulder, the Queen Witch is resurrected and seeks revenge on her killer causing an epic battle that will determine the survival of the human race.",
         "In the Middle Ages, the witch hunter Kaulder hunts down the Witch Queen with the inhabitants of towns devastated by the black plague that she had spread.. The Witch Queen curses Kaulder with eternal life to make him suffer the loss of his wife and daughter for the eternity. Eight hundred years later, there is a balance in the world and the witches live peacefully among humans. The witch hunter Kauder and The Axe and Cross that judges and imprisons witches in the darkness are the responsible for keeping the world in peace. The priest Dolan 36th is the liaison between The Axe and Cross and Kauder, giving support and keeping the record of his life. On the same day of his retirement, Dolan 36th dies alone in his apartment. Kauder goes to his apartment with Dolan 37th to investigate his death and finds black magic in the spot. Further, he finds that Dolan 36th is still alive under a powerful spell. Now Kauder visits the witch Chloe, who owns a witch bar, to seek her help to recall his own death following clues left by Dolan 36th. However the bar is attacked and destroyed by the witch Beliel and Kauder leaves Chloe under his protection. When she uses her abilities to help Kauder, he learns a dreadful secret about his immortality.",
         "Cursed with immortality after a fierce battle with a dark coven of witches and their horrifying Witch Queen--the evil sorceress who plagued the world with Black Death--the valiant warrior, Kaulder, walks this earth for eight hundred years. As the last of the witch-slayers, Kaulder along with the Dolans, the ancient brotherhood of the secret Axe and Cross Order, work tirelessly to keep the fragile truce between humans and witches, without knowing, however, that a modern coven intends on ushering in a new age by unleashing another plague. Is Kaulder all that stands between mankind's future and total annihilation?",
         "The last witch hunter is all that stands between humanity and the combined forces of the most horrifying witches in history."
      ],
      "budget": 90000000
   },
   "movielensId": 135532,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-10-21",
      "dvdReleaseDate": null,
      "directors": ["Breck Eisner"],
      "runtime": 106,
      "movieId": 135532,
      "title": "The Last Witch Hunter",
      "mpaa": "PG-13",
      "actors": [
         "Vin Diesel",
         "Rose Leslie",
         "Elijah Wood",
         "Ólafur Darri Ólafsson",
         "Rena Owen",
         "Julie Engelbrecht",
         "Michael Caine",
         "Joseph Gilgun",
         "Isaach De Bankolé",
         "Sloane Coombs",
         "Dawn Olivieri",
         "Inbar Lavi",
         "Bex Taylor-Klaus",
         "Aimee Carrero",
         "Armani Jackson",
         "Samara Lee",
         "Stephanie Bertoni",
         "Kurt Angle",
         "David Whalen",
         "Jack Erdie",
         "Toussaint Raphael Abessolo",
         "Allegra Carpenter"
      ],
      "imdbMovieId": "1618442",
      "originalTitle": "The Last Witch Hunter",
      "genres": [
         "Fantasy",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "xsuG2JUgs_8",
         "QJDRdGxGw8U",
         "3gjjSjhfuT0"
      ],
      "plotSummary": "The modern world holds many secrets, but by far the most astounding is that witches still live among us; vicious supernatural creatures intent on unleashing the Black Death upon the world and putting an end to the human race once and for all. Armies of witch hunters have battled this unnatural enemy for centuries, including Kaulder, a valiant warrior who many years ago slayed the all-powerful Witch Queen, decimating her followers in the process. In the moments right before her death, the Queen cursed Kaulder with immortality, forever separating him from his beloved wife and daughter. Today, Kaulder is the last living hunter who has spent his immortal life tracking down rogue witches, all the while yearning for his long-lost family.",
      "tmdbMovieId": 274854,
      "avgRating": 3.12638,
      "releaseYear": "2015",
      "numRatings": 542,
      "posterPath": "/xw1GFKzxjgfm3dQoK1swFcHmfaC.jpg"
   }
}