{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "adoption",
            "id": 2393
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "tv movie",
            "id": 156321
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt4573800",
      "video": false,
      "title": "A Deadly Adoption",
      "recommendations": [
         221488,
         332839,
         109636,
         228245,
         83857,
         22060,
         44289,
         46302,
         333089,
         334648,
         112666,
         44250,
         63367,
         231646,
         98130,
         82432,
         78411,
         296025,
         174344,
         168128
      ],
      "backdrop_path": "/9lBNbJWz2BTyrtbQLbgdqo5Kyo5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Robert Benson",
               "gender": 2,
               "credit_id": "5576271c9251413fd2004bbc",
               "name": "Will Ferrell",
               "profile_path": "/dGxt3uGPlUJKIfHYiLasnEgR90e.jpg",
               "id": 23659,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sarah Benson",
               "gender": 1,
               "credit_id": "55762721c3a36801670004d6",
               "name": "Kristen Wiig",
               "profile_path": "/iqRX3PDxA33zFhSfKTo5BE593G4.jpg",
               "id": 41091,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bridget / Jodi",
               "gender": 1,
               "credit_id": "5576272cc3a36855f5002a38",
               "name": "Jessica Lowndes",
               "profile_path": "/qWmn22cJqO2tZ6iB086EyUSWlRt.jpg",
               "id": 84698,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dwayne Tisdale",
               "gender": 2,
               "credit_id": "55805e409251412271000247",
               "name": "Jake Weary",
               "profile_path": "/jpVMl6LI5J7rVCrocHeUbBtBJBl.jpg",
               "id": 133980,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sully",
               "gender": 1,
               "credit_id": "55805e51925141271000022e",
               "name": "Alyvia Alyn Lind",
               "profile_path": "/iRgOBaCvrBLJm1q2vob9lQNpQa6.jpg",
               "id": 1274510,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Christine",
               "gender": 1,
               "credit_id": "55805e649251412710000233",
               "name": "Brooke Lyons",
               "profile_path": "/8UtOpgTdd4MSkuaGvoeffzCX6w0.jpg",
               "id": 74617,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "55805e77c3a3684f930001f6",
               "name": "Debra Christofferson",
               "profile_path": "/8DYZ5eGlruBsRxEfRxOE1nP96Nt.jpg",
               "id": 168331,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "55805e81c3a3684e02000285",
               "name": "Bryan Safi",
               "profile_path": "/lqL5SWL5E6V4Uz8X0sXBZx80fke.jpg",
               "id": 1171718,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "55762702c3a368569a002d2f",
               "name": "Rachel Goldenberg",
               "profile_path": null,
               "id": 110876,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55762713c3a368560600284c",
               "name": "Andrew Steele",
               "profile_path": "/y9LWt91HNGTirjvKILq4qWPFsWI.jpg",
               "id": 1215937,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "565affdcc3a368506d00240f",
               "name": "Adam Silver",
               "profile_path": "/oZuVm1q8Y7l7RiiglPtw166zZtN.jpg",
               "id": 88134,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "565b003c925141692b0021f3",
               "name": "Mj Mynarski",
               "profile_path": null,
               "id": 1197076,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.146636,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 343921,
      "vote_count": 42,
      "budget": 0,
      "overview": "Things go awry when an author and his wife welcome a pregnant woman into their home, with plans to adopt her baby.",
      "similar": [
         3134,
         74997,
         281,
         281957,
         400,
         185,
         4141,
         948,
         298312,
         452507,
         395834,
         9538,
         226,
         11309,
         341006,
         133805,
         2142,
         527,
         434873,
         357096
      ],
      "original_title": "A Deadly Adoption",
      "runtime": 90,
      "poster_path": "/zOiQHV2OWEzllNPO0dWB7llGuZ9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "National Picture Show Entertainment",
            "id": 39703,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gary Sanchez Productions",
            "id": 4740,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Marvista Entertainment",
            "id": 6679,
            "origin_country": ""
         }
      ],
      "release_date": "2015-06-20",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "The birth of a plan gone wrong.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rachel Lee Goldenberg"],
      "runtime": 84,
      "synopsis": "Robert Benson (Will Ferrell) sits in his luxurious garden on a sunny afternoon chatting to his friends, with his baby in his arms. He is an author and his friends agree that his bestselling books have helped them manage their money. They toast him and wish him well on his journey as a \"financial guru\". Robert's pregnant wife, Sarah (Kristen Wiig) calls to him from the jetty at the bottom of the garden, \"Hey! Let's take the boat out!\" Robert tells his friends that the dock is rotten. Sarah is insistent and she leans back against the jetty railing which gives way. She falls, in slow motion, into the water. Robert (in slow motion) dashes into the water after her and they disappear below the surface. Suddenly bubbles arise and he emerges from the water with Sarah in his arms. As his friends stand around and watch, he pleads for her to wake up. He performs perfunctory mouth-to-mouth which appears to do nothing. He places his hand on her heavily pregnant stomach with another \"Please, Sarah!\", which appears to revive her. An ambulance drives her to the hospital. Robert walks into her hospital room and she shakes her head. \"I'm so sorry,\" he cries. Opening credits begin to roll over a bird's eye view journey over a dark river and a wintery pine forest. \"Five years later\" appears on the screen as we pan up from Storm Lake to the Benson's dark, forlorn house. The remains of the dismantled jetty are strewn across the bottom of the garden. We are introduced to Robert's office. He is typing busily and we see certificates of his philanthropic endeavours from 2010 and 2011. He is interrupted by his New York agent, Debbie. \"My word, the recluse!\" she exclaims. Robert discusses his desire to help people with his new book. He confirms that he is \"clean and sober\", when she asks him how everything else is going. However he opens his desk drawer to a large bottle of alcohol, and sighs. Sarah is at an outdoor local farmer's market full of happy, good-looking families. She is selling her organic, refined-sugar-free pies and honey. Her assistant Charlie (Bryan Safi) confirms that all the gluten-free produce went fast. \"Either this town's getting hip, or it actually tastes good.\" Sully Benson (Alyvia Alyn Lind) runs up to her mother with Robert not far behind. It is Sully's birthday and Sarah gives her a new bike. Robert looks aggrieved and complains that they had decided to wait another year before giving her a bike. \"We've talked about this, you know exactly what this will do to her blood sugar level!\" he declares. He relents in the face of his daughter's excitement. At Sully's birthday party, Sarah complains to her friend Julia (Antonia Stout) that Robert babies his daughter and is obsessed with checking her blood sugar levels. \"Something's different\", she says. She confirms that Robert hasn't had a drink in 6 months. Julia asks how the baby search is going and Sarah is excited that the agency has a new birth mother for them to meet. She thinks that another baby will bring \"the old Robert\" back. Julia says she remembers the old Robert. \"He used to dance around this kitchen to corny old music!\" Later in bed, Robert and Sarah talk about the day. Robert says he is distracted by his book deadline and his anxiety around the day of Sarah's accident. \"Robert, stop beating yourself up. You know what happens,\" Sarah warns. Sarah hopes that meeting the new birth mother will improve matters. Sarah and Robert cuddle. The next day Sarah is watering the garden when a car pulls up. A lithe leg in high heels emerges from the car. Bridgette Gibson (Jessica Lowndes) appears. She is doe-eyed with a dewy complexion and long luxurious locks. Her white slip covers her large, pregnant belly. The adoption agency contact, Ellen (Debra Christofferson) introduces Bridgette, who is eager to see the Benson's huge luxurious house. Bridgette and Sarah chat nervously and Sarah shows her a photo of their daughter. Robert meets Bridgette and appears taken with her. When Bridget extends her hand in greeting she drops the photo and the glass breaks. She is flustered and apologies profusely. Bridgette says she lives in Idaho Falls and had to drop out because she couldn't afford it. She says she read one of his books: \"Debt: Not just a four letter word\" which preaches fiscal responsibility. She says she is living in a shelter, and that it would probably be better if she could rest a little more. She is carrying a boy and is 6 months pregnant. The Bensons look at her approvingly as she declares her love for her baby, and her desire to afford a house like theirs and to give him a life like the Bensons could. As Bridgette leaves she scolds Scully for not wearing a helmet. \"Let's keep that head safe so you can grow up smart like your mom and dad,\" says Scully gently. The Bensons are concerned about Bridgette living in a shelter. They invite her to live with them until the baby is born. Robert broods over Sarah's accident. Later that evening, they decide that they like Bridgette. \"If she's read one of my books she can't be that bad,\" affirms Robert. Bridgette arrives to her new home in a flowery slip. Sarah shows her the guest room. \"It's nice, it's so big!\" says Bridgette happily. Sully runs into the room. Sully asks her how the bike riding is going. \"My daddy won't let me take off my training wheels,\" she says sadly. \"Is that a baby in there?\" Sully asks, looking at Bridgette's belly. Bridgette says it is Sully's baby brother and asks her if she wants to feel it. Sully shyly declines. Bridgette asks for a bowl of ice-cream. Sarah says that because Sully is diabetic they don't keep sweets in the house. \"Just to warn you, I'm one of those organic people,\" says Sarah. Charlie arrives and meets Bridgette. \"I like her!\" he exclaims. Later that evening Bridgette texts someone, \"I'm here.\" She sighs and looks at photos of the family. She sees a magazine with Robert and Sarah on the cover, and rips Sarah's photo away. \"\"Oh Robert, what a mess,\" she says, rubbing her belly. Bridgette comes down to breakfast in a tiny camisole and shorts. They discuss plans for the day. Bridgette asks if she can head down to the dock to read. The Bensons look at each other awkwardly and say that the dock is off limits. Sarah and Sully head into town and Bridgette stays at home while Robert works. Robert's agent presses him to go on a book tour to sell his new books. She doesn't understand why he refuses to go on one since his last book tour 6 months previously. He \"blacked out last time\" and doesn't want a repeat of his boozy book tour. Bridgette knocks on his door and nervously asks him for sunblock. She bashfully says that she must be bothering him, but he assures her he is just used to being in his own Writer's world. \"It must get hard, Robert,\" she says demurely. \"Hard?\" he asks nervously. \"It is sometimes,\" he admits. \"Alone, all the time,\" she replies. Bridgette and Robert head into the store room. She hides the sunblock behind a bottle. \"I don't see it,\" she says. He reaches over her should in triumph. \"Found it!\" She turns around quickly into his arms and they share a too-close-for-comfort moment together. She looks up into his eyes disarmingly. \"If you need anything else, batteries, lighter fluid, it will be in here,\" he says uncomfortably. Back at the farm stall, Charlie asks Sarah about Bridgette. \"You just leave her in the house with him?\" Charlie wonders. \"She's six months pregnant,\" Sarah scoffs. \"Some men like that!\" says Charlie, and acknowledges that though he might be gay, he knows what men like. \"Although knowing Robert, he's probably hiding in his attic too afraid to even talk to her.\" Robert steps outside onto the patio to see Bridgette sleeping lazily in the sunshine. Her breasts heave gently, and she opens her eyes to see Robert staring at her. Bridgette says she is too tired to go into town. Sarah is disappointed to see Robert's text letting her know they are staying at the house. Later that day, Bridgette argues harshly with someone on the phone while in a coffee shop. \"These things take time! Would you stop freaking out!\" Charlie bumps into her, and she softens completely once he reminds her of his friendship with the Bensons. When he asks to feel her belly, she declines awkwardly. Charlie watches her walk away with a questioning look in his eyes. Later at dinner they discuss the town. Bridgette agrees with Robert that she prefers a smaller quiet lake. She tells a story about an ex-boyfriend who made her sit on the front of his large boat in a bikini \"just to show me off.\" Sarah talks about her relationship with Charlie and how he encouraged her to expand her business. Robert says he hopes to retire. \"Sarah can work and I'll stay at home with the two kids.\" \"That sounds perfect,\" says Bridgette wistfully. Bridgette shares with the family that she is overjoyed her baby will have such a perfect home. Sarah says that she, too, will have a perfect life one day. \"I hope it's in a town like this with a family like yours,\" Bridgette replies. That night Bridgette watches over Sully as she sleeps. The next morning Bridgette teaches Sully to ride without training wheels. She lets her go straight into the road as car drives by. Sully screams and disappears out of sight. She runs into a greasy looking tattooed hunk. Bridgette knows the man, Dwayne. She tells him he has to wait for her at the cabin, and leave straight away. As he leaves, Bridgette soothes Sully. \"Men like that, you gotta be careful, Sully. Most of them just want to use you.\" She tells Sully to keep the encounter with Dwayne a secret. Later Sarah and Charlie agree that Robert has been \"a little off\" lately. She sends Charlie to the store for coffee. Bridgette and Robert sit watching the lake. He tells her about Sarah's accident and the loss of their child. \"The worst part is, I blame her. If she just hadn't acted so foolishly. Sometimes I think I may never love her the way I used to. It's funny, I've never told anyone that before.\" He agrees that he might feel safe around Bridgette. He asks her if she is happy. She think she will be happy, \"soon\". \"You really are a strange girl,\" Robert muses. They chuckle. Charlie, on his coffee run, sees Bridgette and Dwayne arguing in the street next to his green pick-up truck. Sarah and Charlie sit by the fire in the evening. Charlie blames Sarah for leaving chocolates in the pantry. \"You know the dangers of diabetic ketoacidosis!\" he accuses. Sarah says that Robert has to trust Sully. \"Even since you got back from your last book tour you have completely shut down! It is suffocating! What is going on?\" Sarah demands. The next day Bridgette prepares to have a shower, Sully rushes into the room and sees her in her underwear. Bridgette is wearing a fake pregnancy belly. She assures Sully that some women don't show when they're pregnant and she wants the Bensons to believe her that she really is pregnant. Bridgette makes Sully promise not to tell, \"otherwise something really bad is going to happen\". The next day, Bridgette asks Sarah if she can take Sully to the park. \"Robert's idea. Wanted to check w/ you :)\" Bridgette tells Robert that Sarah asked Sully to take her to the farm stand. Robert agrees, but looks suspicious. He goes to her room, which is vacant. He feels her silky pink camisole. He finds the Debt book Bridgette mentioned earlier (\"Dare to Save\"). It has an inscription: \"To Joni - Don't stop Daring. Robert\". He flashes back to his last book tour at a busy bar. He is drunk and a red-head asks her to sign his book to her, Joni Mathers. They run out into the rain laughing and kissing. \"Not here\", she says and takes him to her motel room. After they have sex Robert sits with his head in his hands. \"It'll be our little secret,\" she says. Lightning flashes and we see that Joni is, in fact. Bridgette. Robert rushes to Sarah to ask her where Sully is. They call the police. Robert is asked why he went into Bridgette's room and why she might want to take Sully. He says he is just concerned and has no idea. Sarah thinks that Robert is overreacting. The police show the adoption agency's picture of Bridgette to the Bensons. She is a different woman and not the Bridgette they know. They realise they have been duped. Bridgette/Joni drives to the cabin in the woods with Sully. \"We'll get crazy money,\" smiles Joni. That evening, Robert admits his infidelity to Sarah. \"I did something I can never take back. And it consumes me every day. I know you hate me, but I hate myself more.\" Sarah denies hating him for lying. \"I hate you for endangering our child!\" In the morning, Sully wakes up groggily as Joni watches her from the doorway. Joni has transformed: she wears heavy make-up has ratty hair extensions and is dressed in a very revealing outfit. Joni says that Sully's parents had to go and help a sick friend. Sully says that she has a stomach ache. Joni realises that she forgot Sully's diabetic medicine. Dwayne says that his brother had the same condition: \"Low blood sugar. Just give her a couple candy bars\". Dwayne heads into town to find candy. He tells Joni to call Robert and demand ransom. Charlie is at the police station and informs them about the fight he saw Joni having with Dwayne. Charlie can't remember anything much about the car. He describes Dwayne in detail. Robert searches through his emails to Ellen, the adoption agent. He hasn't heard anything from her. Charlie spots Dwayne in town. He follows him to the lake cabin, and calls Sarah along the way. The call breaks up. Charlie snoops around the house and is knocked unconscious by Dwayne. Dwayne just wants to leave. Joni wants to stick to her plan. Dwayne and Joni take Charlie out to the forest and shoot him. Slow motion montage of missing child posters, and sad folk music. The police tell Sarah that Ellen has been murdered. They show her a picture of Dwayne, and tell her he is wanted in Texas in connection with two murders. The policeman asks Sarah if it possible that Joni and Robert are together. Sarah is speechless. In the cabin, Dwayne is concerned that Joni is going to meet Robert. Sully is still sick. Dwayne fights with Joni. \"You're not keeping the kid! I'm in this for the money,\" he says. Dwayne is not happy. Joni confronts Sarah in her garage. Joni reveals that she was 3 months pregnant with Robert's child. She lost the baby and was furious when she saw Robert and his family on the TV. \"I hate you for stealing him away from me,\" she growls. They fight and Sarah is overpowered. Joni puts an unconscious Sarah in the drivers seat and pipes the running car's petrol exhaust into the car, in an attempt to suffocate Sarah. Joni finds Robert and attempts to persuade hi to run away with her. Robert demands to know where Sarah is and pushes Joni away. \"Robert, you're acting very strange. Don't you get it? We have everything ok? We can start our lives together. This is what we always wanted. You told me you were unhappy.\" Robert tries to call the police and Joni shoots him in the arm. Robert tries to convince Joni to take him to Sully. He lunges for the gun and it goes off. Robert falls to the ground. Joni runs away. Back at the cabin, Dwayne realises that their plan was about Robert all along. He refuses to let Sully go with Joni. Joni shoots Dwayne. \"I'm your new mommy now,\" Joni assures Scully. Back at the hose Robert comes to and rescues Sarah from the garage. He walks out of the slowly opening garage with Sarah in his arms to the sound of heroic trumpets. He lays her on the floor. \"Sarah, breathe!\" he demands as he gently touches her face. Sarah tells Robert about the cabin. Robert is determined to rescue Scully. \"The only other way out of Storm Lake is across Mackinaw Bridge.\" \"Robert, you, you can't,\" says Sarah faintly. Robert looks up, determined. Robert powers his boat down the lake, his wedding band gleaming in the early dawn light. He wears a look of grim determination. A distressed Sully and erratic Joni drive out of town. Dwayne is found by the police and arrested. Sully looks at Joni, crying and sick. Robert motors down the lake, parks his boat and stands in the middle of the bridge. Joni appears in Dwayne's pick-up and tries to mow down Robert. Sully squeals and pulls the steering wheel. They crash. Sully runs towards Robert. Joni interrupts their reunion angrily and the Bensons stare down the barrel of her gun. \"You used me, Robert. You are never going to use me again,\" she declares. She demands Sully return to her. Robert whispers something into Scully's ear. \"I trust you, ok?\" Robert says to Scully. Scully walks hesitantly towards Joni. She stops and dives off the edge of the bridge. Robert follows her. They swim to the motor boat and struggle to start the engine. Joni takes careful aim and is about the pull the trigger. We hear a shot ring out and see a bullet wound on Joni's shoulder. Sarah stands at the end of the bridge, having mortally wounded Joni. Joni falls, in slow motion, into the water. Six months later, Scully is riding on her bike without training wheels. The sun is shining. Gospel music is playing. Sarah and Robert are in the kitchen. Robert looks on adoringly as Sarah rolls out some pastry. \"She sure loves that bike. I told her she could ride it into town tomorrow,\" says Robert. \"Look at you,\" smiles Sarah. \"Not a care in the world!\" Robert acknowledges that she can't be a baby forever. \"At some point you just have to trust her.\" An upbeat song comes on the radio. \"I love this song!\" Robert exclaims. He turns up the volume. He invites Sarah to dance with him. Scully skips into the kitchen and dances with her parents. The dancing goes on. They keep dancing. Sarah boogies. Robert pretends to play the trumpet. Sarah does the twist. They continue to dance. They fade away and the words \"inspired by a true story\" appear.",
      "writers": ["Andrew Steele"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt4573800/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTU1MzMxMDgtNmJkMC00ZjEwLTgyZWUtMjY3ZjQ4Mzk5YTJlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UY268_CR10,0,182,268_AL_.jpg",
      "actors": [
         "Will Ferrell",
         "Kristen Wiig",
         "Jessica Lowndes"
      ],
      "reviews": [
         "After much speculation it turned out the movie wasn't at all a comedy/parody, although some moments could've been interpreted in a funny way(the garage door opening being one of them), it is actually a Lifetime tribute with essential elements of their movies that have been popular with its audience: a life-altering accident, a fresh start after couple of months/years(it occurs twice in perfect sync at the beginning and ending of the movie), alcoholic husband, naive partner/wife, dark past that gets everyone in trouble, a crazy ex-lover, best friend who knows too much for his own good, phone that stops working in a crucial moment, police getting involved all too late, saving the day ending and lets not forget the classic handgun shooting happening between almost all characters in a row. For a Lifetime casual fan this will a great movie of their beloved genre full with all the dramatic bits that they enjoyed throughout the years involving 2 A+ listed actors who attracted attention, in order to celebrate their 25th anniversary of hilarious clichés. For non-lifetime viewers this will be a new and enjoyable experience which they could find funny in some scenes given the 2 comedy Gods involved in it, but you need to have seen at least 1 Lifetime movie to understand the replicated elements that are included in this anniversary. Its not a parody per-se because they didn't had to exaggerate the already overly-dramatized bits which are usually found in Lifetime movies and which some of their casual viewers find hilarious, its simply a replication of those but bunched together in a single movie. 10/10",
         "Now here is something you don't see everyday, or at least in a long while: a deadpan, totally serious, almost (sometimes) dramatic take on Lifetime movies-of-the-week on Lifetime. If what my wife tells me is correct, A Deadly Adoption actually has practically the same plot as another Lifetime movie not too long ago - a pregnant woman with nefarious intentions gets her way between a husband, wife and their child and wreaks havoc while seemingly about an adoption scenario. This is, I'm sure, intentional on the parts of executive producers Will Ferrell and Adam McKay; they not too long ago made Casa de mi Padre, a stone-faced take-off on Spanish tela-novellas with Ferrell playing Mexican full-tilt, and Wiig herself was in a series on IFC, The Spoils of Babylon, which was also a take on soaps (the writer of this film, Andrew Steele, was one of the writers for Babylon). But what a strange, entertaining beast this is. At first I wasn't sure what to make of it - is this really trying to be *serious*? How much of this is supposed to be a joke or a comedy? One may go into A Deadly Adoption with Ferrell and Wiig at the top of the cast and wonder what's up, if this is going to lampoon Lifetime movies. I should say it does, but not as much as I thought it would, or rather it's in small doses. There are lines and scenarios that are very funny, such as referring to the main couple's daughter's condition: \"You know the dangers of diabetic ketoacidosis!\" Or the fact that Ferrell's character, Robert Benson (like Bob Benson from Mad Men, I wonder, maybe just a coincidence), is now a reformed alcoholic who used to go on benders during his book tours... for books on financial advice. And to be sure, at first, seeing Ferrell and Wiig delivering such earnest dialog, and just how they look is funny (Ferrell with a beard that could have easily been pasted on). But all of the other actors are the people who you would usually see in a Lifetime movie, and the director, Rachel Goldenberg, is not a Hollywood pro exactly. She has a wild mix of credits, from Asylum movies (Sherlock Holmes, to tie in with the 2009 movie) to actual TV movies of this ilk (Escape from Polygamy) and more recent comedy work. Steele has more of a foot in comedy, as a writer and collaborator on SNL, though he, the director, and the actors do a remarkable thing: they completely commit to the scenario, the drama around this crazy 'new woman' who comes in to turn everything upside down and cause violence and kidnapping and affairs revealed and shocks galore. And I wouldn't want it any other way. I thought about other made-for-TV cable movies that come out, like the Sharknado movies and the like on the SyFy channel, which probably have about the same self-awareness as A Deadly Adoption. But I never see the actors in those movies - many of them are all but winking at the camera as they go to collect their quick paychecks to get eaten by CGI sharknados or Megapythons or whatever. Ferrel, Wiig and company aren't out to make anything cheap or silly here (though maybe the last scene is goofy, perhaps just like a Lifetime movie). The funny thing is, because Ferrell and Wiig and co-star Jessica Lowdnes play everything completely straight - and Ferrell and Wiig are better actors than a Lifetime movie should ever deserve - and it's all believable, sometimes verging on maybe, kinda, sorta being dramatic in a *good* way... until one realizes what they're saying, more often than not, is absurd, as are the situations they get themselves in. The tropes are all recognizable if one is into Lifetime movies, and that's also the idea, from the happy white family and the \"bad\" girl that comes in to make things chaotic. It's not something that can be easily parsed into 'Oh, it's just a parody' or 'Oh, it's actually just another Lifetime movie with these actors'. I found myself laughing many times during A Deadly Adoption, if not during every scene. It's a wholly clever, successful experiment in poker-faced absurdism.",
         "This was a parody, plain and simple, where the comedic actors played their roles as dead-pan seriously as they could, in order to keep you off-guard as long as possible. It pokes fun at Lifetime movies: the moronic plots, the stereotypical characters, and the predictably happy endings (the painfully long happy dancing at the end subtly asks the audience, \"did you catch the joke?\") How many times had you asked yourself, \"WTF?\" An author's book signing tour becomes a debaucherous drunken spree, where he scores as much tail as a rock star? (WTF?) And he doesn't remember the hot girl until it's too late? (WTF?) He gets shot twice and, after a large volume of blood gushes from his arm, goes out to confront the girl without bandaging his wounds ? (WTF?) The boyfriend gets shot in the gut, and gets up to scream at the police? (WTF?) The hero motorboats to the bridge and stands in the road, moments before the villain arrives in the pickup ? (WTF?) The escape plan was to have your daughter jump off the bridge, then you jump off after her ? (WTF?) Other reviewers caught most of the funny moments that I recall, like the slow-motion heroic garage door opening scene, the intense look of concern and determination on the slow-motorboating Ferrel's face, the psycho's high heels following her off the bridge as she plunged to her death from her fatal shoulder wound... I came in late in the movie, where the family was eating breakfast, but by the time the scene with Ferrel and the girl in his study took place, I knew from the dialog that the film was tongue-in-cheek: \"IT must get HARD sometimes...\" she says provocatively. \"Yes, IT does get HARD,\" or words to that effect.",
         "OK. I sort of get it. Lifetime wanted to make fun of itself by doing a very typical Lifetime movie starring two comedic kingpins, but play it deadpan so that nobody will actually know what's what. The result? Nobody really knows what's what. Although there are a few moments that seem to be a parody of a Lifetime movie, mostly it is just played straight and the result is just a really poorly written plot orchestrated by two very talented actors. If only it would have decided which it wanted to be: a comedy or a serious drama. But it lingers somewhere in between so that at the end, it's really just another Lifetime movie, and if you don't get the jokes, a very poor one at that.",
         "\"I really think another baby will bring the old Robert back.\" Robert (Ferrell) and Sarah (Wiig) are happily married and expecting a new baby. When Sarah has an accident and they lose the baby their lives are changed. Years later Sarah thinks that if they can adopt Robert will return to his old self. They find a pregnant mother who is willing to give them their baby and allow her to move in with them. This is when the obsession is revealed. First of all if you don't already know this is a spoof of a Lifetime movie. This is not a Scary Movie over the top spoof but it does poke fun at the Lifetime movie genre. Ferrell and Wiig play this straight and that is what makes this work. The script and the acting are purposely horrible and just about every cliché is in this. The movie is predictable, but what Lifetime movie isn't. I will admit this wasn't as funny as I was hoping, but what it is is a perfectly done send up of this genre and for that reason this is worth watching. Overall, a serious spoof of an extremely melodramatic genre. I enjoyed it. I give it a B-.",
         "There seems to be a lot of people struggling over 'the point' of this movie. Is it a spoof or is it just a regular cruddy Lifetime movie? With a plot that is so tiresome that I'm not going to bother detailing it, I say it's undoubtedly the latter. This is no spoof and Kristen Wiig and Will Ferrell are merely playing a standard Lifetime script totally straight. They're not winking at the audience and I'd be very surprised if this was written specifically for them. I imagine it was an off-the-peg script that was lying around in the Lifetime offices. And *that* is the joke. That's why Wiig and Ferrell were keen on doing this. Everyone else involved was just doing their regular job, safe in the knowledge that the film would be seen by a far wider audience than their usual output because of the curiosity aspect. The currently awful rating on IMDb will be of no surprise to either star and I doubt either of them will be losing any sleep as it drops even further. So... the point? To get lots of viewers. To give Wiig and Ferrell a bit of fun. To get people talking. And they succeeded. But should you watch this movie? No, because the joke isn't for anyone's amusement other than the two stars - and a joke that has to be explained is really no use to anyone. This is a slightly dull movie that happens to star two A-list performers - and that's hardly unique.",
         "This is typical Lifetime fodder, neither good nor bad; pretty much middle of the pack. Nothing unique about this. Yes, when you watch Ferrell, you expect him to do something \"over the top\" to legitimize it as a spoof but that doesn't happen. It's not great or even good drama. It is mediocre. I know of what I speak because I have seen a lot of the Lifetime original movies. Stating that, it can't be stated as satire. It is far too subtle to be considered satire. It can have a life of it's own as bad Lifetime but it's not really bad enough. I don't know why Ferrell and Wiig did this movie. I will say, however, that Lifetime, had a coup with this because it is has created a stir in social media and that may have been the outcome desired all along.",
         "It isn't exactly clear what the heck this Lifetime movie is. The trailer, with over dramatic music and scenes so intense they were ludicrous, was quite funny. Two stars for the trailer! However, whether the complete film is meant as a parody, satire, comedy, or straight drama, it's pretty darn bad. Awkward, uncomfortable, or poorly done is not necessarily funny. Neither is just plain awful. Will Ferrell is not a very good dramatic actor and in this masterpiece he comes off as if he's doing a deadpan skit from SNL without the twinkle in his eye. In fact, watching this is like sitting through a sketch from that show that's terrible and the audience is silent. That's very similar to the pain caused by this misguided production. Kristin Wiig is actually a very good straight actor but if she's really going legitimate here, she can't overcome what she has to work with. No one's that great an actor. Deadly Adoption is a mystery without a solution. If it's all some sort of elaborate practical joke, it's the kind of prank that pisses off the victim of it and no one ends up laughing. Yes, the joke's on us and there is nothing remotely humorous about this thing at all.",
         "Anticipated this movie. Very disappointed. If this was intended to be a spoof of Lifetime's melodramas, it failed abysmally. Waaaay too subtle for me. Script - Stunk. Could have been written by a team of 12 year olds, stupified by PopTarts and Dr Pepper. Generic dialogue and plot. A 'thriller' with no thrills. Predictable. Included every stereotype and cliché. All, I assume, intentional to elicit booming laughter. A fail. Note to writer, Andrew Steele (former writer for SNL): If parody was your objective, exaggeration....blowing things out of proportion.... is needed. That was missing....so the viewer was left to make some kind of sense of it, one way or other. Not an enjoyable task. Irritating. Acting - Stunk. Looked forward to seeing Wiig and Ferrel either in a spoof or in serious roles. Still waiting. Robotic acting with painfully slow takes (meant to be funny?) and little emotional range (same reason?) Caricatures? Missed the mark by miles. Directing - Stunk...ie...Closely following the bad guy's car on a dirt road and parking a stone's throw from his cabin...in day light? Really? Really? Kid is missing and Mom is not moved a bit. Neither comedy or drama....though the family's extended 'dance' scene in the end was worthy of a smirk. If the whole thing was a 'gag'...success at last! You made me gag. Could have been a clever parody. Wasn't. A waste of time and talent.",
         "This movie was beyond awful. It was almost like watching an SNL skit and waiting for the satire to kick in but it never happened. All I can say about this actually making it on air ( even for Lifetime) is that somebody must've owed someone a huge favor. Either that or they were so far into budget that they had no choice but to air it and hope curiosity would draw enough viewers to save it. This movie was so bad I actually found myself laughing near the end. The ridiculousness of seeing Wil Ferrells character shot twice (once two inches above the heart) and then get up and carry on with the energy of a marathon runner was priceless. A first year film student would've been advised to switch majors if they tried to put something like this on a roll of digital tape. And as for the acting throughout? I can only blame the director, because I know Ferrell and Wiig have talent. And as lousy as the actual dialogue was, the only thing worse was the delivery. For the director to not yell \"cut\" every ten seconds was a travesty. Rest assured if there's a Razzy category for this work, the staff should blow the dust off their tuxedos. Because you're a shoe-in. I normally wouldn't exert this much time in a negative review, but after subjecting myself to two hours of torture delivered by two of my favorite comedic actors, I was compelled to rip this tripe apart!!!",
         "There's a reason I dislike Lifetime movies..The ONLY reason I even watched this movie was because Will Ferrell and Kristen Wiig was in it. I'm sure that this is why MOST people even watched it. It wasn't even a decent lifetime type movie. I think the reason it was considered a comedy is because they made it pretty obvious how fake things were. Example - when Will Ferrell's character is shot and near death..minutes later, he's up, talking and carrying his wife! Anyways, I just wasted 2 hours of my life..and I can NEVER get it back. Good Grief! I'm not sure exactly why these two big hitter stars even decided to do this movie. Perhaps they were offered good money...or they were bored...or both. Who knows.. Terrible movie to say the least...",
         "The main difference between this movie of the week and the amazingly wonderful Positively True Adventures of the Alleged Texas Cheerleader-Murdering Mom, which was also a movie of the week and based on a true crime story...is that The PTAATC-MM was done with a highly skilled crew of professionals. While watching A Deadly Adoption it is so PAINFULLY clear that the script is rotten, the performances are rotten and can not hide behind the guise of \"camp\". \"Camp\" is one of my favorite genres. And this ain't \"camp\"...it's more like \"CRAMP\" because of the feeling i got in my gut from wasting time watching it....or more precisely...CRAP. Don't believe the spin doctors who are trying to pawn it off as classic camp. It is merely a situation where a writer (from SNL) got his actor pals (from SNL) to agree to make a little cash real quick-like...all on Lifetime's dime.",
         "This TV movie was a bit of a strange one, it was advertised is if it was a serious dramatic film, but you cannot ignore the fact that two comedy stars are in the leading roles, which made you question whether this film is a joke, I had to watch and decide for myself. Basically Sarah Benson (Kristen Wiig) is a successful organic food vendor, her husband Robert (Will Ferrell) is a best-selling author and finance guru, their life was rocked by a tragic accident, Sarah was near an unsafe dock and fell into the water of Storm Lake, the trauma caused her to lose their second child in pregnancy, she is no longer able to bare children. Five years have passed, Robert has become reclusive and recovering alcoholic, he has been sober for six months, he and Sarah are looking to adopt an unwanted child, but have not been satisfied by any suggested birth mothers. Then they meet seemingly sweet and innocent attractive young woman Bridgette Gibson (90210's Jessica Lowndes), in the final months of her pregnancy, she claims to be living in a homeless shelter, Sarah and Robert decide to give her the bedroom their lost child would have slept in, she will stay with them until she gives birth. As time goes by however Bridgette is obviously not all she seems, six-year- old daughter Sully (Dark Skies' Alyvia Alyn Lind), who Robert is over-protective of because of her diabetes, is the first to spot that Bridgette is not pregnant at all, she has been wearing a fake enlarged belly pad, she lies to the girl that she is pregnant, but that she would not be believed. Bridgette has another agenda entirely, she and her tattooed hoodlum boyfriend Dwayne Tisdale (Jake Weary) are scheming to get money from the family, the intend to kidnap Sully perhaps for ransom, but also Bridgette has her own reasons. It is revealed that in the past when he was a writer they encountered each other and he made love to her, but he left her after a short time to be with Sarah, she lost a baby that she was pregnant with, she wants both revenge, and perhaps to try and get closer to Robert again. All the secrets and lies come spilling out from all sides, Robert has to try and protect his family, Bridgette is crazy and will do whatever it takes to get what she wants, and Sarah is caught in the middle, there will be deadly consequences for all involved in the complicated situation. Also starring Mousehunt's Debra Christofferson as Ellen Macy, Bryan Safi as Charlie, Erik Palladino as Sheriff and Terminator 3: Rise of the Machine's Carolyn Hennesy as Debby. Ferrell and Wiig are reasonably good at playing serious, Lowndes is too soapy to be believable as an antagonistic bitch, this apparently is supposed to be a humorous imitation of those late 80s and 90s films with twisted affairs and evil characters playing happy families, it does have moments inspired by Fatal Attraction or The Hand That Rocks the Cradle, but it is not quite executed as well as it could have been, you can see the funny side of it though as it is awash with clichés, not a completely terrible parody psychological thriller. Okay!",
         "Satire is huge right now on the internet but not everyone can make it work. It's a difficult craft that has to have a balance of looking real enough to feel like it belongs with the product that is being made fun of but also ridiculous enough where (most) people don't fall for it and think it's real. \"A Deadly Adoption,\" in my opinion, found that perfect formula. The film looks and feels like a real Lifetime Original (only with far better acting) and in that realism is where the film becomes very funny. This Lifetime movie never sits there and childishly mocks these specific types of film like you'd get from a \"Scary Movie\" or equally poorly produced parody. Instead, the film feels like a loving representation of Lifetime's products and, it is in that representation, that the humor is derived from. I found it to be a very creative and unique work of comedy and it was definitely entertaining to sit through. Not to mention, it's just cool that both Kristen Wiig and Will Ferrell are refusing to allow their comedic talents to become stagnate and repetitive and it's pretty neat that Lifetime has a good enough sense of humor about itself and allowed this all happen.",
         "I'm not sure what this a was trying to be, I think like most people with Will Ferrell and Kristen Wiig attached I went into this expecting a parody of Lifetime movies. The problem is the parody is missing so all this is, is a Lifetime movie. Yes every cliché is used and emphasized just a little bit more (slow motion tragedy scenes, overbearing mood music, bright happy outdoor scenes, the gay best friend etc) and I did laugh a couple of times (Robert's little indiscretion while drunk off his ass during his book tour, \"based on a true story\" tagged on at the end) but this is not funny ha, ha like you'd be expecting. Wiig and Ferrell play it straight up until and for the most part including the final super HEA musical scene. I guess really the only parody thing this has going for it is how predictable it is; story, music situations. Lifetime movies are all a degree of bad so for this to work it had to be super bad or at least OTT, as it was it was just average. I'm left wondering what was the point? Ferrell plays Robert Benson a successful (bearded) author, wearer of bad khaki pants and husband to Sarah of organic food fame, Together they have a daughter 'Sully' and are expecting another when tragedy strikes (in slow motion) and Sarah loses the baby. 5 years later Robert is getting over a drinking binge and is overprotective of his precocious diabetic daughter. They are hoping to adopt when their agency introduces them to Bridgette, a beautiful and mysterious pregnant woman who the Bensons soon take into their home. All is not as it seems though and their dreams of adopting her unborn child soon go awry. 7/27/15",
         "Robert Benson (Will Ferrell) is a best selling author and financial guru. His wife Sarah (Kristen Wiig) suffers a miscarriage after a dock accident. Five years later, Robert is a recluse and a recovering alcoholic. Sarah is an organic food vendor. He's overprotective of their diabetic daughter Sully (Alyvia Alyn Lind). They're looking to adopt and they meet expecting mother Bridgette Gibson (Jessica Lowndes). They invite Bridgette to stay with them rather than going back to the women's shelter. The problem is that something ominous about Bridgette. Is it a spoof? Yes, sort of. This is a fascinating odd little Lifetime TV movie. These are great comedians playing it somewhat straight. Yet the dialogue is read with a (pardon the pun) pregnant pause. They are acting sincere but they seem to be doing it with a nudge and a wink. It is serious but it is not at all serious. It opens with a ridiculous dock accident. There's no way this is being treated as a serious drama. Just look at Will Ferrell's hair. That's insanely wrong. But nobody is playing this for easy Wayans brothers' parody laughs. I laugh when Sarah and Bridgette fight but they are not doing a fake comedic fight. This is a fun weird movie.",
         "I don't know what to make of this movie. It's got A list movie stars like Will Ferrell and Kristin Wiig in a lifetime thriller. As it unfolds it becomes more like a spoof of a lifetime thriller. An evil woman scams a couple into thinking she's giving up her baby for them to adopt. Will Ferrell rising from being shot and going after the bad guys is just laugh out loud. The beautiful Jessica Lowndes is a good villain. And the way they were so happy even though their friends were killed and dancing around at the end is just ludicrous. Watch it for the stars but be warned it's weird.",
         "Excellent performance by Will Ferrell and Kristen Wiig. Even the actors I never heard of did an excellent job. Great casting and excellent screenplay. Quality dialogue and good story. It is a classy suspenseful and tasteful thriller. I usually prefer gory thrillers or horror movies, but when a movie is written well, you don't need to see the gore to get the impact of the moments in this movie. Quality directing, producing, casting, all around good judgement for everyone who was involved with putting this film together. This movie was an excellent treat and I thank Lifetime, for what felt like a night out at the movies for free.",
         "If you watch Lifetime movies of the week you can guess they tend to be overwrought, supposedly true life melodramas with a cookie cutter script plus not good scripts and bad acting. A Deadly Adoption could had gone for the parody route like Scary Movie, Austin Powers or Naked Gun films. Instead they have de- constructed the typical Lifetime film and made a better version of it with its usual tropes and clichés with just a hint of a knowing wink here and there. As one character states:'I found an unopened box of chocolate today. You know the dangers of diabetic ketoacidosis.' The biggest difference is that this television movie of the week has two A list cinema stars. Will Ferrell plays a financial management guru with a string of successful books. Kristen Wiig is his wife who sells organic food in market stalls in their small town. They have a five year old daughter Sully to whom they are overprotective towards especially as she is diabetic. Right at the beginning we see Wiig falls over from a dilapidated boat dock into the river which results in a miscarriage. Some years later as the story progresses they meet Jessica Lowndes who is homeless and giving her baby up for adoption however she is not all sweet and innocent and her path has crossed with Ferrell before. Ferrell and Wiig play it straight. Ferrell also has what looks like a fake beard and recites the corny lines likes it is Shakespeare. You get a hint that he might be sexually attracted to Lowndes as he looks down her cleavage and Lowndes has a hoot playing the femme fatale role. Yet its surprisingly zippy, it moves along at a fast pace, it has a fair amount of cheesiness, bad stunts and ludicrous plot developments. In a sense Ferrell and Wiig just made a better Lifetime movie than Lifetime normally manage to do. Still there is only so much you can when you try to polish up a turd.",
         "...then you'll probably find this film funny. I don't. It's a parody, after all, and Ferrell makes the mistake of playing it too straight, apparently believing that being good at being a bad actor will make it funny. It doesn't. It just makes it tedious. Kristen Wiig fares somewhat better, but her performance depends a lot on Ferrell, so she is limited in that respect. The child actress is cute but mumbles her lines, so we rarely know what she says. Sometimes that matters, mostly it doesn't. Some of the supporting players understand the assignment better that the principals. Brian Safi and Carolyn Hennesey know how to play it straight for humor, but they need someone to play off of. Jessica Lowndes, playing the villain of the piece, has the easiest assignment. All she has to do is be evil, exactly as she would in an otherwise straightforward version. Doing exactly that with Jake Weary as her scruffy boyfriend, she handles it well. To do a parody successfully, the creators must have respect for the original. In this case, it is unclear whether they do or don't.",
         "When I saw that Will Ferrell and Kristin Wiig had made a TV movie I was excited because I figured they must have found an amazing script to get them both to sign on. So I was a little bit disappointed when I got around to actually watching 'A Deadly Adoption' only to find a slightly above average movie by TV standards. What went on behind the scenes to get them both on board I'm not sure, but it certainly wasn't the script alone as I had hoped. Seeing Ferrell playing a serious role took me quite off guard at first. I hadn't actually seen any of the previous serious work he's done and only knew him for his comedic roles which he is the best in the business at. I wouldn't call his performance overly natural, he seemed like he had a slightly tough time adjusting to not just saying whatever hilarious line popped into his head. Wiig on the other hand I did find very natural. Her role wasn't written overly well and didn't give her a lot to do, however the scenes she did have she handled well and overshadowed Ferrell in the acting sense I'd have to say. There's a lot of \"by the book\" writing involved and the clichés are a little bit overbearing at times (ie. the gay best friend). For a TV movie though it's very watchable and the short runtime passes by quick enough. Often comedic actors like to delve into the world of serious films, with mixed results. Apparently Ferrell falls into that category as well. I hope he doesn't spend too much time trying it out though, because he would truly be a tremendous loss to the world of comedy if he did so. Worth a look but don't expect anything too special.",
         "Having seen the entire movie, which was a struggle for a few scenes, I ended up slightly confused. I figured it was meant to be a parody on a lifetime movie, however, was the content or the waste of time the joke? If the joke of the actors and/or writers was to confuse the audience,it shouldn't have been a mediocre-at-best movie, that just makes the joke very pathetic. From the beginning on the movie didn't pick a side. The sloppy, uninspired writing and ridiculously unoriginal characters could've been used perfectly for a comedy, and for a lousy lifetime movie, but has been used for none. Just a random waste of time, brought forth by the attractive casting. Will Ferrell has proved to be capable of playing a more serious character and pulls it of quite well again, letting one crying scene slide, and Kristen Wiig actually plays her part very smoothly, displaying a credible happy hippie wife. Jessica Lowndes, though I've never seen her in any other movie worth mentioning, is ready for some bigger roles, mainly because she uses her insanely attractive looksperfectly in portraying different sides of her character. Will and Kristen could have turned a story with actually some real potential ina hilarious comedy, however, decided to ignore their instincts and followthe instructions of a few lousy writer and crew members to cash in their pay check.",
         "I was curious to say the least. I wouldn't say I am a super fan of Wil's but I do like him, so when I saw this I thought give it a go. Looks like he wants to play it straight so who knows, might be good. Please. Pleaaaasseeeeeeeeee. I watched the trailer and already my head told my heart jog on. But did I listen, no! I thought go on, watch a bit, what's to lose? other than the will to live, 'scuse pun! It's bad, bad everything. Writing, acting, no need to write about spoilers because you can see them coming a mile down the road. It is truly awful and unless you need to watch a very bad film because you're being made to watch one to analyse in film class then stop right there Mrs.... It's not worth it. I'm disappointed, because I like Will but wow, what was he thinking. Deserves a zero. minus",
         "Will Ferrell tries drama here and he is quite effective as an alcoholic writer deeply affected by the loss of a child when his pregnant wife falls off a dock in a freak accident. As a result, he becomes a doting, over-protective father to his surviving child, a diabetic. Unable to have more children, the couple bring into their home a supposedly young, innocent pregnant girl, with the hope that they shall adopt her child. The film takes on familiar Lifetime themes of someone coming into your life and wreaking havoc along the way. Then there is always the ironic twist in their films. The girl is anything but innocent, yet alone pregnant as she plots revenge for having had a tryst with Ferrell years before, leaving her pregnant and also losing the child."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Gary Sanchez Productions",
         "MarVista Entertainment",
         "National Picture Show Entertainment"
      ],
      "summaries": [
         "Living in the small town of Storm Lake, married upper middle class couple Robert and Sarah Benson faced a life changing incident five years ago when a freak accident led to a then pregnant Sarah, an organic hobby farmer, losing the baby and not being able to conceive children anymore. Feeling guilty for not fixing their broken dock which caused the accident, Robert, an author of personal financial management self help books, took to the bottle, although he has now been sober for six months. Robert dotes on their only child, six year old Sully, and constantly worries about her diabetic condition. They are pursuing adoption as Sarah believes another child would bring a much needed balance into their lives, especially in getting Robert out of his funk. He has been in this state specifically since his last book tour, about which he does not remember much due to his drinking and hard partying. They believe they have finally found the perfect adoption mother in Bridgette Gibson, a young woman in a difficult personal situation, she who is currently living in a shelter. As such, Robert and Sarah decide to let Bridgette live with them until the child is born in three months time. Bridgette entering their lives is not by accident, she who orchestrated it along with her redneck boyfriend Dwayne Tisdale. She is keeping a couple of secrets, one from the Bensons and another from Dwayne in getting what she alone wants. These secrets are added to one already kept by Robert, who has to balance his against his family's best interest in whether to come clean. This mixture of secrets has the potential to lead to deadly consequences.",
         "A distanced couple decide to take in a seemingly innocent pregnant woman in hopes of adopting her unborn child. However, there is more to a book than its cover."
      ],
      "budget": 0
   },
   "movielensId": 135508,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2015-06-20",
      "dvdReleaseDate": null,
      "directors": ["Rachel Goldenberg"],
      "runtime": 90,
      "movieId": 135508,
      "title": "A Deadly Adoption",
      "mpaa": "",
      "actors": [
         "Will Ferrell",
         "Kristen Wiig",
         "Jessica Lowndes",
         "Jake Weary",
         "Alyvia Alyn Lind",
         "Brooke Lyons",
         "Debra Christofferson",
         "Bryan Safi"
      ],
      "imdbMovieId": "4573800",
      "originalTitle": "A Deadly Adoption",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["921UzgGkcVw"],
      "plotSummary": "Things go awry when an author and his wife welcome a pregnant woman into their home, with plans to adopt her baby.",
      "tmdbMovieId": 343921,
      "avgRating": 2.34615,
      "releaseYear": "2015",
      "numRatings": 26,
      "posterPath": "/zOiQHV2OWEzllNPO0dWB7llGuZ9.jpg"
   }
}