{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "miniaturization",
            "id": 12101
         },
         {
            "name": "part animation",
            "id": 193521
         },
         {
            "name": "stemp",
            "id": 198187
         }
      ],
      "imdb_id": "tt0096282",
      "video": false,
      "title": "Tommy Tricker and the Stamp Traveller",
      "recommendations": [],
      "backdrop_path": "/5bo0xcJXX6llESIbaEMavYQAeqN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tommy Tricker",
               "gender": 2,
               "credit_id": "52fe44b39251416c91019d5d",
               "name": "Anthony Rogers",
               "profile_path": null,
               "id": 178952,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ralph James",
               "gender": 0,
               "credit_id": "52fe44b39251416c91019d61",
               "name": "Lucas Evans",
               "profile_path": null,
               "id": 997707,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Nancy James",
               "gender": 0,
               "credit_id": "5303e248c3a3680a287364f2",
               "name": "Jill Stanley",
               "profile_path": null,
               "id": 1294261,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Albert",
               "gender": 0,
               "credit_id": "5303e24fc3a3680a376c338f",
               "name": "Andrew Whitehead",
               "profile_path": null,
               "id": 1294262,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cass",
               "gender": 2,
               "credit_id": "5303e2f9c3a3685ce740eccd",
               "name": "Paul Popowich",
               "profile_path": "/sE7bFNJqwJHR2T3G2TokvLkSmRj.jpg",
               "id": 102703,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44b39251416c91019d59",
               "name": "Michael Rubbo",
               "profile_path": null,
               "id": 544818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5303e345c3a3680a1970251c",
               "name": "Michael Rubbo",
               "profile_path": null,
               "id": 544818,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 0.446498,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 32038,
      "vote_count": 4,
      "budget": 0,
      "overview": "When the joker Tommy Tricker plays some practical jokes on some of his friends, his best friend Ralph, a stamp collector, discovers the secret of \"stamp travel\" to make him travel around the world on a stamp to bring back the mysterious Charles Merriweather, who never returned on a stamp for 75 years.",
      "similar": [
         862,
         72105,
         28178,
         8839,
         102899,
         109414,
         68718,
         50544,
         13,
         19913,
         489,
         36536,
         24420,
         277547,
         38167,
         1024,
         397422,
         13523,
         226,
         82703
      ],
      "original_title": "Tommy Tricker and the Stamp Traveller",
      "runtime": 105,
      "poster_path": "/avGpt94z8VFHzmSbgoMPVhl0pEo.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Atlas Film",
            "id": 17619,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Productions La Fête Inc.",
            "id": 15979,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Societe Generale du Cinema du Quebec",
            "id": 20178,
            "origin_country": ""
         },
         {
            "logo_path": "/kcNh09qqR2Pkw1JAzRW4CommrW4.png",
            "name": "Téléfilm Canada",
            "id": 806,
            "origin_country": "CA"
         }
      ],
      "release_date": "1988-12-08",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Rubbo"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Michael Rubbo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0096282/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ3NjgwODQ3Nl5BMl5BanBnXkFtZTcwMzc4OTUzMQ@@._V1_UY268_CR3,0,182,268_AL_.jpg",
      "actors": [
         "Lucas Evans",
         "Anthony Rogers",
         "Jill Stanley"
      ],
      "reviews": [
         "This was THE movie of my youth, yet none of my childhood friends have heard of it, let alone seen it. I suppose this Canadian production was released straight to video in Australia though, so probably no wonder. The story revolves around Ralph, an avid stamp collector, and his sister Nancy, who stumble across a mysterious collection that reveals a secret method of traveling across the world on a stamp. Yes, that's right. The traveller repeats a certain chant then shrinks to a hundredth of his or her size, then literally falls into the stamp. Ralph decides to journey to Australia in hopes of uncovering a missing stamp collection for his dad, but after a series of misadventures, is misdirected to China by the local prankster, Tommy Tricker, who wants to find the expensive collection himself. The rest of the movie relates Ralph's stay in China, and the confrontation between he and Tommy in Australia. This is a really enjoyable film. I know it's meant for elderly children, but I think anyone below 24 would be pleasantly surprised. Tommy Tricker reminds a bit of a more abrasive Joey Jeremiah from Degrassi High!",
         "I always enjoy watching this movie again and again, although I'm in my thirties: To my mind, \"Tommy Tricker\" always manages to bring back to me nice memories of my youth (what might be true for other adults as well). I even recall the first time I watched it: it was the Summer of 1991 (probably the first time \"Tommy Tricker\" was aired on an Italian television, but I may be wrong). I remember I felt that every character was so sympathetic and easy to agree with, that I immediately loved the movie. In fact, at that age (more or less 15), I was a little awkward in the same way as Ralph was, and I would have liked to have been more self-confident like Tommy (incidentally, Lucas Evans and Anthony Rogers act great, with just minor flaws, which - in my opinion \u0096 contribute to render the movie even more realistic). Moreover, I must admit it's always a pleasure to hear different English accents (mainly Canadian and Australian) as is possible in this movie: being a non-native speaker of English I always appreciate it when I can \"feel\" these differences, which are easy to catch, since, in this case, the linguistic level is not that difficult. To sum up: congratulations to the director and... too bad that the young actors didn't go on acting (at least, to the best of my knowledge).",
         "I have a few vague memories of watching this on cable years and years ago, laughing at it with my brothers and sister the first time through, then, later, grudgingly admitting that I'd enjoyed it. I can recall only bits and pieces of the actual film, though: some of the characters shrinking themselves onto stamps (was there a dance or a chant involved?), a chase through a bus station (or was it an airport?), and, finally, a scene with a dragon kite in China. I always meant to catch the sequel, but, alas, I kept missing it. The original, anyway, was very imaginative, very fun, and I would love to see it put out on DVD - or at least show up on cable again.",
         "Tommy Tricker & the Stamp Traveller is an original film based on a child who can travel across the world on stamps. I haven't seen it since I was younger, but I remember that I enjoyed it, although it was quite frightening. I think it is a very imaginative film. (The basic plot of the film was about this young boy who was a stamp collector, and he could travel by putting himself onto stamps with a little bit of magic.) I remember that my brothers enjoyed this film too, although there were some very frightening bits in the film, and I seem to remember that the special effects were good. (Tommy being transfered to the stamp or from the stamp.)",
         "Tommy Tricker & The Stamp Traveler is hands down one of the most delicious movies I have ever seen. Ralph and Nance are an amazing brother and sister pair, taking on the dirty, underbelly of the underground (doubly crass and dangerous!), Canadian Stamp World -- chasing after Blue Noses and Penny Victorias like madmen in Keds. The IMDb description isn't quite accurate, in that Tommy Tricker is most definitely not Ralph's \"best friend\" at the beginning of the story, but by the finale, you could correctly call them modern day Bosom Buddies. Albert's voice is amazing, especially when he is making reference to Tommy's dad being a bum. His \"real dad\"! This movie effectively gets kids riled up to collect stamps. We learn that stamps = the coolest adventure of one's life, should one decide to take on the call of duty. Don't lose Dad's Man on the Mast though, or he'll totally tear down your club house and have you falling down Tommy's ghetto stairs just to try and get it back!",
         "I just watched this movie for the first time in seven years. I found the o.g. VHS my mom taped when it first came out, and it had me laughing the whole way through the movie. dragons, kangaroos, boomerangs, stamps, postcards, and a aborigine playing a didgeree-doo. The guys in the stamp shop were awesome. Tell them to tell her to them nothing. It sucks that I can't find a newer copy of it where I am at. But I'll have to say it is the best movie I have seen in a long time. My cat Hitler gives the movie four paws up cause he sat through with me and watched it the whole time. Anyone up for some sardine sandwiches. How about a ride on the back of a horse, or a dragon, or behind a kangaroo.",
         "Good show for children up to early adolescent. Interesting story line and catchy tunes. We have rented this film many times.",
         "I just recently purchased the DVD of this film from Amazon.ca, and it arrived today. I watched it for the first time in several years, having last seen it on a VHS copy my Mom taped off Superchannel some years back. The movie is quite original, with the basic plot being that Ralph gets conned out of his father's good stamp by Tommy Tricker and in the process, discovers a valuable stamp album stored in Australia. The whole idea of a live action film involving stamp travel is quite ingenious in my mind. The location details in China and Australia are quite good, as are all the special effects. The acting is also, in my opinion, very well done, and very believable. I won't spoil the ending for you, but I think you will find the ending to be an interesting twist. Either way, the adventures, acting and special effects will keep you enthralled from start to finish. If you see this movie in a store, you have to buy it. 10/10",
         "I wasn't quite sure what to make of this film. My guess is that it is aimed at children to get them interested in the fascinating world of stamp collecting. My brother had a sizable collection when he was a kid, personally it wasn't something I got interested in. First of all the title character Tommy Tricker is aptly named, he's a mischievous kid who cons this other kid Ralph out of some of his father's valuable stamps. But one he didn't con was an enchanted stamp which with a magic chant and placing it on a letter will get you shrunk right on the stamp and you will emerge when the letter is delivered. Ralph gets himself shrunk and put on a letter to a stamp collector in Australia, but Tommy waylays the letter and sends him to China. Ralph eventually gets to Australia, but so does Tommy. Both have a lot of adventures with kids from Canada, China, and Australia and some run-ins with a few grownups as well. Tommy Tricker and the Stamp Traveller was a well intentioned Canadian production. Somehow though I didn't feel the magic coming from this film which you would have to in order to enjoy it. Too many concepts I just couldn't get my mind to believe. Perhaps if I was 8 years old again, maybe.",
         "i saw this movie when i was very young and i remember that i enjoyed it. i don't remember very many details of the movie, but maybe this will give you an idea before you watch it. it was kind of difficult to understand what was going on in certain parts. it is often funny in a random way. the acting is kind of weird sometimes, at least that is what i though. your opinion of the movie will depend on what you are expecting out of the movie. if you are expecting great acting and an excellent storyline, you might be disappointed. as long as you begin watching it with an open mind, you should be okay. but it really is entertaining for younger viewers. that is, ones that watch more than just animated programs.",
         "While in his club house, a young boy named Ralph (Lucas Evans) and his sister discover a secret letter written by Charles Merriweather which claims that a stamp album with some of the most valuable stamps in the world is hidden somewhere in Australia. Then Ralph embarks on a fantastical treasure hunt that takes him to China and then Australia. He not only encounters some very colourful characters along the way – particularly in mainland China – but he comes up against a master con artist (who tricked him out of a rare blue nose stamp) aptly named Tommy Tricker (Anthony Rogers). This movie is made primarily for kids, which is why some of the dialogue may come across as too puerile for adults to take seriously. Yet one has to admire the imagination that went into creating this intricate plot which defies all movie formulas. For instance, there is an incredible scene where Ralph shrinks to a midget and ends up on stamp after his sister and friend perform a strange chant. But after that magic trick takes place, only the people who do not perform this ritual can put the letter into a mail box to be sent halfway across the world to Australia. Crazier still, after the letter arrives at its destination and is opened, Ralph blows up to his regular size and lands in the most inconvenient places. To craft a scene like that takes a lot more imagination than is put in most movie scripts. Director-writer Michael Rubbo also has a great eye for locations, with the result that we are treated to China's roadways clogged with cyclists, a gorgeous Chinese garden, a dragon, Tai-Chi, and Australia's cricket match.",
         "This family adventure movie, produced in Canada, was released when I was two years old, before any of my earliest memories (I think). I obviously didn't see it when it was brand new, but remember seeing a lot of it several times in the 90's. However, I don't recall ever watching it right to the end in my childhood, as I could never remember how it ended. At 23 years old, I've finally gotten around to seeing \"Tommy Tricker and the Stamp Traveller\", the whole film, from start to finish, after not seeing any part of it for maybe around fifteen years. This probably wouldn't have happened if I hadn't remembered it from my childhood. I thought much of the movie was reasonable, thanks to the humour, but eventually, it got a little tiring. Ralph James and his con artist friend, Tommy Tricker, are both elementary school kids who collect stamps. Tommy likes to use stamps as a way to swindle his peers, and even does this at school, until Albert, the leader of the stamp club, stops him. Unfortunately, when Tommy comes over to Ralph's house one day, Ralph becomes another one of his victims. Tommy tricks him into trading one of his dad's rare stamps, and Ralph doesn't realize he's been tricked until the young schemer is on his way, and it's too late! Ralph knows he will be in trouble when his dad finds out, and his sister, Nancy, decides to help him try and get it back or find a replacement. After failed attempts, the siblings discover how to magically shrink and travel inside a stamp, and Ralph decides to do just that, in a search to find Charles Merriweather, a stamp traveler who has been missing for 75 years! This movie is not billed as a comedy, but I probably wouldn't be able to give it an above average rating if it weren't for the times I laughed. I think many people would agree that the film clearly has more for kids than adults, with a storyline that could easily bore adults. I can't forget such comedic highlights as the way Albert tells Tommy to stop swindling other students with stamps, Ralph locking himself up while his dad tries to get him to come out, and the chase through the mall (featuring an early appearance from Rufus Wainwright, years before his music career took off). I did not care much for Tommy as a character, with some of the things he does, such as the prank he pulls on Albert early in the film. Mind you, even that character can be funny at times. Unfortunately, in the end, the humour is not consistent enough to carry the film, and to me, the film seemed a little overlong. If it were shorter, I might be able to rate it 7/10, instead of 6, but as it is, I can't say I highly recommend it for adults.",
         "well this has to be one of my favourite movies, its such a fun and enjoyable movie for all. I really love Tommys persona. The movie is about a 3 friends Ralph, Tommy, and the lovable Nancy (who Tommy falls for in the return of Tommy Tricker). Its starts of with Tommy stealing Ralphs grandparents stamps, then the gang realise that the old tale of the stamp is true and Tommy and Ralph travel the world for certain stamps. This movie is great for younger children, but the whole family could easily enjoy it. If you like kiddy adventures this movie probably is with the Goonies and the sandlotkids. This movie is one of my favourites.",
         "You can usually pick out the work of Rock Demers/Michael Rubbo and the French-Canadian Disney of the North (I meant that in a complimentary way). First, there are no loud, screaming car-chases or machine guns; next, the pace is slow, and the audience has to think along with the cast; third, the kids treat the adults and each other with politeness and respect.....what a novel thought!!! Probably his best effort, 6/10+.",
         "I think there are two kinds of kid movies. In the first group, there is a good story which both kids and even adults find interesting. You also have a good casting and feel that the producers respect the audience. In the second group, you see that a standard movie has been converted into the kids world, and child players act as if they are much more older then they actually are. Even though i must admit that this film has a relatively good story, i think it is in the second category, which makes it a extremely disturbing film. You just can't feel any warmth for the child actors which causes you dislike it all from the beginning.",
         "I absolutly hated this film. This is the only film I've given a 1 so far. This movie has extreamly bad child actors, a horrible ending, and a dumb storyline. I had to watch this piece of crap in school, that made it even worse. For your own safety avoid this film at all cost, it sucks!",
         "This is a moderately decent film for kids, but anyone over 11 will be bored by it. I wish Mike and the 'bots of MST3k could have gotten a chance to view this film. A good scene for the 'stinger', or little odd clip from the film at the end of an episode, would be Ralph running between the trees. I say this because the way he is running looks like really really weird.",
         "In the past I have warned others to avoid this hilariously bad movie. Now, with the popularity of this Rufus Wainright guy growing, I feel I must once again spread the word. Do not see this film. Don't go looking for it. If it is on TV, read a book. I'm telling you, the acting, the plot, the pacing, the very look and feel of the film are straight-up BAD. I had to air it over and over again at a television station, inflicting this travesty on the unsuspecting viewing public. Even cheap-o fare like \"The Retrievers\" and \"Castlerock\" were better than this, and they were not good. One other warning. Don't go looking for it thinking \"If it's this bad, I GOTTA see it.\" Trust me, it isn't even good as a joke. You will be angry you wasted your time and money. If you see it at the store, leave it be. Don't touch it. Don't even look at it. Just keep walkin'.",
         "The idea of traveling by stamp will enchant most kids. There are some fun sequences with the kids as they learn about this odd way of travel. There are also enough holes and leaps of logic to make most adults scratch their heads throughout the movie. The movie is harmless enough to let your young children watch it, but not something that will expand your children's horizons as much as you may want. For the seasoned film fanatic, the idea is interesting, but the execution lacks distinction from many other \"kids on magical adventure stories\". Another blah movie that won't shock or thrill you much. The guy with bass drum and other instruments, whose song plays whenever the kids transfer to stamp, reminds me of the Big Bad Wolf in The Three Little Bops. Just a random thought for that dumb ten lines rule."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Les Productions La Fête Inc.",
         "Téléfilm Canada",
         "Société Générale du Cinéma du Québec"
      ],
      "summaries": [
         "When the joker Tommy Tricker plays some practical jokes on some of his friends, his best friend Ralph, a stamp collector, discovers the secret of \"stamp travel\" to make him travel around the world on a stamp to bring back the mysterious Charles Merriweather, who never returned on a stamp for 75 years.",
         "Young Ralph James and his scheming friend Tommy Tricker collect stamps. But when Tommy snatches a rare stamp, Ralph discovers the secret of stamp travel to take him around the world and bring back the 75-year gone traveller Charles Merriweather."
      ],
      "budget": 0
   },
   "movielensId": 135647,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1988-12-08",
      "dvdReleaseDate": null,
      "directors": ["Michael Rubbo"],
      "runtime": 105,
      "movieId": 135647,
      "title": "Tommy Tricker and the Stamp Traveller",
      "mpaa": "",
      "actors": [
         "Anthony Rogers",
         "Lucas Evans",
         "Jill Stanley",
         "Andrew Whitehead",
         "Paul Popowich"
      ],
      "imdbMovieId": "0096282",
      "originalTitle": "Tommy Tricker and the Stamp Traveller",
      "genres": [
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When the joker Tommy Tricker plays some practical jokes on some of his friends, his best friend Ralph, a stamp collector, discovers the secret of \"stamp travel\" to make him travel around the world on a stamp to bring back the mysterious Charles Merriweather, who never returned on a stamp for 75 years.",
      "tmdbMovieId": 32038,
      "avgRating": 3,
      "releaseYear": "1988",
      "numRatings": 1,
      "posterPath": "/avGpt94z8VFHzmSbgoMPVhl0pEo.jpg"
   }
}