{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0068941",
      "video": false,
      "title": "Peeping Toms",
      "recommendations": [],
      "backdrop_path": "/e4JNNGZ1b9ydfFVe6YUlB9o2PSS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Eli",
               "gender": 0,
               "credit_id": "52fe488fc3a368484e0ff181",
               "name": "Arik Einstein",
               "profile_path": "/3ssqGEHokpWOir8RdxwIZA9Uwz4.jpg",
               "id": 257575,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Gute",
               "gender": 0,
               "credit_id": "52fe488fc3a368484e0ff189",
               "name": "Uri Zohar",
               "profile_path": "/tGPSUXr1qHfRGy4IUDprW1gj8G3.jpg",
               "id": 32297,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mili",
               "gender": 0,
               "credit_id": "52fe488fc3a368484e0ff185",
               "name": "Sima Eliyahu",
               "profile_path": null,
               "id": 568334,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Davidke",
               "gender": 2,
               "credit_id": "52fe488fc3a368484e0ff18d",
               "name": "Tzvi Shissel",
               "profile_path": "/lzspGliclfpnhNj6bs3dB3p07WK.jpg",
               "id": 585487,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe488fc3a368484e0ff193",
               "name": "Uri Zohar",
               "profile_path": "/tGPSUXr1qHfRGy4IUDprW1gj8G3.jpg",
               "id": 32297,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe488fc3a368484e0ff199",
               "name": "Uri Zohar",
               "profile_path": "/tGPSUXr1qHfRGy4IUDprW1gj8G3.jpg",
               "id": 32297,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe488fc3a368484e0ff19f",
               "name": "Arik Einstein",
               "profile_path": "/3ssqGEHokpWOir8RdxwIZA9Uwz4.jpg",
               "id": 257575,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.097138,
      "production_countries": [{
         "iso_3166_1": "IL",
         "name": "Israel"
      }],
      "id": 73147,
      "vote_count": 1,
      "budget": 0,
      "overview": "Gote and Eli are two aging friends who don't want to age. Gote is a lifeguard who's fighting peepers on the Tel-Aviv beach. Eli is a guitar player who dreams of building a night club in altman's restaurant.",
      "similar": [],
      "original_title": "Metzitzim",
      "runtime": 90,
      "poster_path": "/qxiIO2vpsQaxgpp7uCr3oG2oPbj.jpg",
      "spoken_languages": [{
         "name": "עִבְרִית",
         "iso_639_1": "he"
      }],
      "production_companies": [],
      "release_date": "1973-06-06",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Israel",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Uri Zohar"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Arik Einstein",
         "Uri Zohar"
      ],
      "originalLanguage": "Hebrew",
      "imdbLink": "http://www.imdb.com/title/tt0068941/",
      "coverLink": null,
      "actors": [
         "Arik Einstein",
         "Uri Zohar",
         "Sima Eliyahu"
      ],
      "reviews": [
         "This film is much more than just a beach movie. Gute (Uri Zohar) is an aging lifeguard, responsible for the Tel Aviv beach. With another few excentric characters, he lives his life with no goal or meaning. Pretty soon, after he'll get slapped frm his superior, be rejected by a beach hussy, and will be ridiculed by a couple of teenagers and a beloved whore, he'll understand that the world is moving on, with or without him. Director/actor/writer Uri Zohar gives the viewer a piece of life, fragile and realistic. Though in Israel this movie was successful as a people comedy, it is much more than that. It is a brilliant masterpiece by one of Israel's best directors. Try and locate this film everywhere.",
         "Metzitzim remains the best Israeli movie ever made, and that is saying a lot about it, considering the fact that it was made over 30 years ago and did not deal with the classic Israeli subject matters, meaning the political or the religious. In fact, the film's subject matter is as universal as it gets, dealing with loneliness and hanging on to youth, but at the same time this is undoubtedly the most Israeli movie ever filmed, due to the wonderful dialogues which were co written by Zohar and Einshtein. Many of the film's nuances are utterly untranslatable and will be unfortunately missed by non-Hebrew-speaking viewers. The movie is a must nonetheless, especially if you appreciate truth in film. I can think of no other movie in any language which blends humor with deep sadness in such a subtle manner. \"Metzitzim\" is the ultimate sad clown. The funny sequences are masterful, such as the silent peeping tom scene, but it is the rare dramatic moments, summed up by mere glances, which make this movie shine. Notice the look on Gutte's face in two scenes near the end, when he looks back at Eli and Milli with a trace of disgust, or when he finds \"little Altman\" with his favorite prostitute. 10/10",
         "While the rest of the world was smiling benevolently under the impression that in their spare time between valiantly defeating our enemies, young Israelis were roasting potatoes and singing around the campfire, overgrown playboys Guteh and Eli, are going nowhere, or going 'round in circles, although they haven't hit bottom. While Guteh is presumably a lifeguard, he spends little time actually guarding lives and more time chasing boys away from peeking into the women's changing rooms and trying to get laid; while his friend Eli, married and with a toddler daughter to whom he pays zero attention, tries to convince his neighbor Altman to let him open a nightclub in Altman's basement; in between which both friends swig bucketsful of Turkish coffee and cognac while commenting on each others' lives. Like many Israelis, Guteh and Eli are two men stuck in adolescence, as they were never taught what it is to be men other than the one-dimensional macho ethos prevalent in the Mediterranean at the time. Yet in contrast to the cartoonish, vulgar characters inhabiting Chagigá beSnuker and Charlie veChetzi (of the same period, but featuring primarily Jews of Middle Eastern origin), Guteh and Eli embody the allegory of the spiritually \"empty cart\" that is Israeli society to which the rabbis referred in the early years of the state. Thus perhaps it's no irony that Uri Zohar, who plays Guteh, later became twice-over famous for abandoning the life portrayed in Metzitzim and \"getting religion\". Guteh and Eli are barely employed and stay just this side of the law (what's that stuff they snort out of a dropper?), with zero values or anything to carry them from day to day other than the next drink, the next ruse to disperse the persistent peeping Toms, the next scheme to open a nightclub. Meanwhile Altman Junior, who absorbs the message that sexual conquest is respected, and later toddler Meirav (having received no attention from her father and thus craving male attention) will be next in line to take the places of the prostitutes who work the beach and their johns. While I disagree with the other reviewer that it's the best Israeli film ever (I would award that to Or (Mon Tresor) and Knafayim Shvurot), Metzitzim is an engaging study."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [],
      "summaries": ["Gote and Eli are two aging friends who don't want to age. Gote is a lifeguard who's fighting peepers on the Tel-Aviv beach. Eli is a guitar player who dreams of building a night club in Altman's restaurant."],
      "budget": 0
   },
   "movielensId": 135641,
   "movielens": {
      "languages": ["עִבְרִית"],
      "releaseDate": "1973-06-06",
      "dvdReleaseDate": null,
      "directors": ["Uri Zohar"],
      "runtime": 90,
      "movieId": 135641,
      "title": "Peeping Toms",
      "mpaa": "",
      "actors": [
         "Arik Einstein",
         "Uri Zohar",
         "Sima Eliyahu",
         "Tzvi Shissel"
      ],
      "imdbMovieId": "0068941",
      "originalTitle": "Metzitzim",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Gote and Eli are two aging friends who don't want to age. Gote is a lifeguard who's fighting peepers on the Tel-Aviv beach. Eli is a guitar player who dreams of building a night club in altman's restaurant.",
      "tmdbMovieId": 73147,
      "avgRating": 3.25,
      "releaseYear": "1973",
      "numRatings": 2,
      "posterPath": "/qxiIO2vpsQaxgpp7uCr3oG2oPbj.jpg"
   }
}