{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "tennis",
            "id": 1488
         },
         {
            "name": "swimming pool",
            "id": 8181
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "argentina",
            "id": 10596
         },
         {
            "name": "dead body",
            "id": 10877
         },
         {
            "name": "cunnilingus",
            "id": 148534
         },
         {
            "name": "economic crisis",
            "id": 189933
         },
         {
            "name": "gated community",
            "id": 196672
         }
      ],
      "imdb_id": "tt1386741",
      "video": false,
      "title": "The Widows of Thursdays",
      "recommendations": [],
      "backdrop_path": "/p1gyUzECmyrUZF30pnoVFadMLHc.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Martín",
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa27",
               "name": "Ernesto Alterio",
               "profile_path": "/AjJTvctbOJ1Z2sOlOiRP2hrIzmS.jpg",
               "id": 27459,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Gustavo",
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa2b",
               "name": "Juan Diego Botto",
               "profile_path": "/kSjrSosAt5qwu9LNCAUkMuFALwH.jpg",
               "id": 36632,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Lala",
               "gender": 1,
               "credit_id": "52fe46a29251416c9105aa2f",
               "name": "Gloria Carrá",
               "profile_path": null,
               "id": 1070264,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Teresa",
               "gender": 0,
               "credit_id": "52fe46a29251416c9105aa33",
               "name": "Ana Celentano",
               "profile_path": "/vTBnE4DlrrrV93MZAovhES0s0iI.jpg",
               "id": 64771,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Juan",
               "gender": 0,
               "credit_id": "52fe46a29251416c9105aa37",
               "name": "Camilo Cuello Vitale",
               "profile_path": null,
               "id": 1070267,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Tano",
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa3b",
               "name": "Pablo Echarri",
               "profile_path": "/uFF8TKTY2d5lTWu53IkI7e97L2V.jpg",
               "id": 87016,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa3f",
               "name": "Adrián Navarro",
               "profile_path": "/iXOCuOsokZF87zPARRufDs5iZzc.jpg",
               "id": 433326,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Ronnie",
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa43",
               "name": "Leonardo Sbaraglia",
               "profile_path": "/kLOwLkOlAtV0vqRV5jCrX8HbxmD.jpg",
               "id": 19803,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Trina",
               "gender": 1,
               "credit_id": "52fe46a29251416c9105aa47",
               "name": "Vera Spinetta",
               "profile_path": null,
               "id": 970306,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Mavy",
               "gender": 0,
               "credit_id": "52fe46a29251416c9105aa4b",
               "name": "Gabriela Toscano",
               "profile_path": null,
               "id": 104068,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Carla",
               "gender": 1,
               "credit_id": "52fe46a29251416c9105aa4f",
               "name": "Juana Viale",
               "profile_path": "/2WDsdYmH1SqmncSCEmNUkD4MKus.jpg",
               "id": 965297,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46a29251416c9105a9f3",
               "name": "Marcelo Piñeyro",
               "profile_path": null,
               "id": 87014,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a29251416c9105a9f9",
               "name": "Marcelo Figueras",
               "profile_path": null,
               "id": 66916,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c9105a9ff",
               "name": "Claudia Piñeiro",
               "profile_path": null,
               "id": 1070259,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa05",
               "name": "Marcelo Piñeyro",
               "profile_path": null,
               "id": 87014,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46a29251416c9105aa0b",
               "name": "Gerardo Herrero",
               "profile_path": null,
               "id": 47059,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c9105aa11",
               "name": "Juan Carlos Macías",
               "profile_path": null,
               "id": 1070260,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe46a29251416c9105aa17",
               "name": "Natalia Smirnoff",
               "profile_path": null,
               "id": 125978,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c9105aa1d",
               "name": "Jorge Ferrari",
               "profile_path": null,
               "id": 45538,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "52fe46a29251416c9105aa23",
               "name": "Vanessa Ragone",
               "profile_path": null,
               "id": 433332,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46a29251416c9105aa55",
               "name": "Alfredo Mayo",
               "profile_path": null,
               "id": 1143456,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.860919,
      "production_countries": [],
      "id": 38238,
      "vote_count": 5,
      "budget": 0,
      "overview": "The closed community of \"Altos de la Cascada\", a private neighborhood of high-priced houses, is moved by the discovery of three corpses that appear floating in a pool and rushes to frame it as an accident. It is the starting point so that through the life of some married couples who live there, Tano (Pablo Echarri) -manager of a multinational- and Teresa (Ana Celentano), Ronnie (Leonardo Sbaraglia) who lives at the expense of his wife Mavy , a real estate agent (Gabriela Toscano), the pusillanimous Martin (Ernesto Alterio) and his dissatisfied wife Lala (Gloria Carrá) and the newcomers Gustavo (Juan Diego Botto) and Carla (Juana Viale), the film attempts a description of the social sector that makes up that type of community and, by extension, to a broader sector of society at the time.",
      "similar": [
         984,
         96,
         4771,
         445954,
         10651,
         2749,
         18587,
         15069,
         26390,
         12150,
         1949,
         979,
         205,
         807,
         4638,
         75780,
         281,
         281957,
         357096,
         133805
      ],
      "original_title": "Las viudas de los jueves",
      "runtime": 122,
      "poster_path": "/9BfkALW4sFJxLLdcuS9VL4JS91Q.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [],
      "release_date": "2009-09-10",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "El lado oscuro de una vida perfecta.",
      "adult": false,
      "homepage": "http://www.lasviudasdelosjueves.com",
      "status": "Released"
   },
   "imdb": {
      "country": "Argentina",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marcelo Piñeyro"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Marcelo Figueras",
         "Claudia Piñeiro"
      ],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt1386741/",
      "coverLink": null,
      "actors": [
         "Rafael Aieta",
         "Ernesto Alterio",
         "Roberto Antier"
      ],
      "reviews": [
         "After having watched Marcelo Piñeyro's \"El Metodo\" and being breath taken by it, I was very exited to learn that he is making a new movie, \"Las viudas de los jueves\" with two of the El Metodo's cast. Being so impatient to watch this movie, in the mean time I found the book the movie is based on by Claudia Piñeiro and read it. It was a great book, so my expectations rose. But just because I read the book, I think I liked the movie less. Probably it is hard to capture all the aspects that I loved about the book, but what really bothered me was that the movie intervened a bit in the characters and even the story. Anyway it is a good movie, well acted, well produced, it has the right atmosphere. But yet, I 'll stick to liking the book and also \"El metodo\" much more.",
         "This film; together with \"El Secreto de tus Ojos\" are representatives of the best of the new Argentinean Film industry strengthened with some other Latin American and Spanish partners. In spite of some weaknesses in the youngest widow performance (Juana Viale), this movie is touching and very well done. With a stunning shooting and a deep psychological approach to each character through minor and well placed hints; this thriller is an true masterpiece about how to achieve it without long and boring scenes. I would like to quote a sentence of the leading role \"Tano\" that could be from any middle aged men in the western world :\" When I was a teenager I used to believe in God; I felt that He failed to me; then in my youth I believed in Democracy as a tool for solving everybody's needs, it also failed to me, now I am convinced that the only one thing that deserves my faith is Money\"",
         "I don't agree with \"santiencalidaddeque\", and with other negative reviews. I wonder how old he is to better judge him. In colloquial conversation within closed friends. especially so among an all-female or all-male group, genitals ARE verbalized with their more common and vulgar names, notwithstanding how gruesome or shocking they may be. Most supermarkets, gyms, malls, shopping centers ARE certainly called exactly like that, IN English, not only in Argentina, but also in Paraguay, where I live. There are lots of jokes traveling throughout the Web mention that what we used to call \"gimnasio\" is now called *gym*; almost every English term I mentioned has a translation to Spanish...yet, somehow, these days urban society chose to say them in English. The acting is overall very good...including young Mirtha Legrand's controversial niece. I have yet to read the book, which should probably be much better (that's already a sort of \"classic\", abbreviated and not-too-good transferrence of novels or stories to the screen, with very few exceptions).",
         "The proliferation of 'gated communities', named 'countries' in Buenos Aires, gave affluent yuppies an outlet to stay away from the rest of the less affluent population of their city. The idea was to get away to places where they could socialize and mingle with their own kind. In fact, in the story, this particular development is an ideal place of how to be amongst a \"big family\". The action within the closed community is juxtaposed to the unrest going on within the great Buenos Aires with the decision of the government not to let people withdraw from the banks big amounts from their accounts. The country was a chaos for a segment of the population accustomed to living well, as it is the case with all the four couples at the center of the story. The beginning of this tale gives us a clue as to what really happened as the bodies of three of the rich members of the country club are seen at the bottom of the pool. Teresa, the wife of Tano, one of the dead men, does not even shed a tear. The narrative goes back in time to the arrival of a new couple, Gustavo and Carla who have bought a house in the complex. The good times, alas, do not last long in this country club enclave. We get to meet the other three couples already enjoying their paradise. Teresa and Tano are the most outspoken residents. Ronnie and Mavi seem to be the more normal of the octet, and finally, Martin and Lala, have the most to lose because he is the accountant that oversees the finances of the group. They are the people who became wealthy in the Menem era in Argentina. As such, they are all hedonists looking for a better way of life at all costs. There is a contrast between the men and women that populate this secluded community. Not having read the novel by Claudia Pineiro, we have no way of knowing how well the novel was adapted for the screen by its director, Marcelo Pineyro, who had been absent from the Argentine cinema for a while and the co-writer, Marcelo Figueras. The film, and probably the original book, are probably more politically motivated since 2001 was a horrible year for the economy of the country. While there are riots in the street and people demanding reforms, the inhabitants of this particular country seem to be living in another world altogether. There is a despicable character, Tano, whose business consists in buying terminal patients wills for a cheap price, reaping a big profit as the person dies eventually. Only Ronnie and his wife Mavi are the only decent characters in this tale. The younger Juan and Trina show some spunk in this rarefied atmosphere where money is king. Tano's proposal, while selfish, serves as a redeeming act for a way out of their problems. Leonardo Sbaraglia fares best among the all star cast. Ana Celentano makes an impression with her Teresa. Part of the problem with the film is the screenplay with its awkward dialogs and situations. Technically, the film is a quality product, but somehow, it feels empty. Probably, in the hands of another writer would the material have transcended the treatment it was given here by Mr. Pineyro. The film is not a thriller, or a drama, although there are aspects of both within the narrative. Alfredo Mayo, the cinematographer gets interesting results with the way he photographed the proceedings. The musical score is by Roque Banos.",
         "'Las Viudas de los Jueves' is a breathtaking drama, that cuts to the bone in its depiction of a world that's crumbling -even though its surfaces are glamorous and everybody keeps smiling... till it's too late. It feels like Edgar Allan Poe's 'The Masque of the Red Death'-meets-Visconti's 'The Damned'.. but sexier, and -I tremble at the very thought of it- happening as we speak... Even though it tells a story with a definite location (Argentina) and time frame (the economic crisis that sunk that country in 01), the film paints a bigger canvas -one that sends shivers down the spine in its timeliness. It speaks about the privileged people that deludes themselves, thinking they could keep earning millions while the rest of the world starves. Sounds familiar? Suspenseful, subtle, resonant. Great director, great DP, great actors.",
         "While knowing that Echarri is normally a mediocre actor, trailer looked attractive and I decided to give this one a shot. Bad choice. The plot could have been interesting, but it is ruined a slowness and predictability. Actor's performances are mostly poor or barely average, and the attempted social critique falls short of fulfilling any meaningful purpose. The intended \"sneak peek\" into an utopian high society \"bubble\" allegedly isolated from social reality is barely a misguided collection of stereotypes and a mediocre sociologist's fantasy that fails to reflect reality in most senses. While it may still appeal to foreign public, argentine viewers will be more likely to sense the unconvincing artificiality of the whole thing. I give it a couple stars, though, for some visually attractive scenes, in particular the opening sequence. But in overall it's rubbish. Add the fact it was screened almost simultaneously with Campanella's \"El Secreto de sus Ojos\" and it is no wonder that \"Las Viudas...\" went under mostly unnoticed.",
         "I love dramas but Las viudas de los jueves is a very BORING film. I mean, you know how it's gonna end since the beginning, completely predictable and bad acted. What happened with the score, Roque? It appeared in the most particular moments and then disappeared, without any sense. We can give this production a good mark actually, and I must recognize that. Filming places, cameras, light and makeup were perfect. Another thing you have to know is that this movie is a drama, there is no suspense, you just want the characters to die and finish the story once for all. I found very disturbing the constantly repeated word \"pija\" in a drama of this characteristics. I mean, you can add what you want in a movie, but why so many times? Teens were good, but the girl was a bit annoying. What more I dislike was the lack of action, but I am not talking about cars exploding or something like that, I mean, It was too much quietness and slowness and sadness and depression and at the end It becomes foul plus the message that this movie gives you at the final scene. What was that? What were you thinking Claudia when you wrote that ending so predictable? I give it a 6, just because I liked Ronnie and Mavi's family and the fact that they were normal people (you will know what happens then). Well, one more movie for the Argentinian market. Hope people liked more than me. Please, do not make more movies about crisis and recession. I really do not want to remember that. Not Menem, please.",
         "I agree with Santi. The movie is too slow, there are some really bad performances... I didn't like the girl either! And I really hated these \"top society\" people speaking some words in English like \"bye\", \"whatever\", etc. That doesn't really happen!!! The rest of the recreation of people's superficiality was quite real to me. I found the final quite interesting, not so predictable... I thought that was good at first, but then, maybe that is because through the film they don't give you the idea of the real chaos inside each character... like... they were worried, they were not happy... but... to me that wasn't enough. Well that's my opinion. A 6, the mark you need to pass an exam at Highschool in Argentina. :)"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Castafiore Films",
         "Haddock Films",
         "Instituto Nacional de Cine y Artes Audiovisuales (INCAA)"
      ],
      "summaries": ["In a gated community, where everyone seems to have it all, secrets start to come out."],
      "budget": 0
   },
   "movielensId": 135637,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "2009-09-10",
      "dvdReleaseDate": null,
      "directors": ["Marcelo Piñeyro"],
      "runtime": 122,
      "movieId": 135637,
      "title": "The Widows of Thursdays",
      "mpaa": "",
      "actors": [
         "Ernesto Alterio",
         "Juan Diego Botto",
         "Gloria Carrá",
         "Ana Celentano",
         "Camilo Cuello Vitale",
         "Pablo Echarri",
         "Adrián Navarro",
         "Leonardo Sbaraglia",
         "Vera Spinetta",
         "Gabriela Toscano",
         "Juana Viale"
      ],
      "imdbMovieId": "1386741",
      "originalTitle": "Las viudas de los jueves",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["lG0F-h5IKVQ"],
      "plotSummary": "La cerrada comunidad de “Altos de la Cascada”, un barrio privado de casas de alto precio, se conmueve con el hallazgo de tres cadáveres que aparecen flotando en una piscina y se apresura a encuadrarlo como accidente. Es el punto de partida para que a través de la vida de algunos matrimonios que allí habitan, Tano (Pablo Echarri) -gerente de una multinacional- y Teresa (Ana Celentano), Ronnie (Leonardo Sbaraglia) que vive a expensas de su esposa Mavy, una agente inmobiliaria (Gabriela Toscano), el pusilánime Martín (Ernesto Alterio) y su insatisfecha esposa Lala (Gloria Carrá) y los recién llegados Gustavo (Juan Diego Botto) y Carla (Juana Viale), la película intente una descripción del sector social que compone ese tipo de comunidad y, por extensión, a un sector más amplio de la sociedad de la época.",
      "tmdbMovieId": 38238,
      "avgRating": 3.25,
      "releaseYear": "2009",
      "numRatings": 4,
      "posterPath": "/9BfkALW4sFJxLLdcuS9VL4JS91Q.jpg"
   }
}