{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "son",
            "id": 5153
         },
         {
            "name": "hunting",
            "id": 33688
         }
      ],
      "imdb_id": "tt0052906",
      "video": false,
      "title": "Hound-Dog Man",
      "recommendations": [],
      "backdrop_path": "/winj5EzPjyDzlpZ9dH99SC5qTeL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Clint McKinney",
               "gender": 2,
               "credit_id": "56f44a2bc3a3682fcf003868",
               "name": "Fabian",
               "profile_path": "/zznWM7jaB3nGio4kqPfxhqC1eeq.jpg",
               "id": 39757,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Cora McKinney",
               "gender": 1,
               "credit_id": "56f44a469251411a940032c7",
               "name": "Betty Field",
               "profile_path": "/lqTpbIAThp7ChbHC3Pf914MMtul.jpg",
               "id": 13785,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Blackie Scantling",
               "gender": 2,
               "credit_id": "56f44a60c3a3682fe600383c",
               "name": "Stuart Whitman",
               "profile_path": "/bAtT3otGuwA8hG07lQSqTt7N1jq.jpg",
               "id": 38761,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Aaron McKinney",
               "gender": 2,
               "credit_id": "56f44a829251411a8b003365",
               "name": "Arthur O'Connell",
               "profile_path": "/rWoLpGwQlIZSiPIzJqE1yIMiDxr.jpg",
               "id": 857,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Fiddling Tom Waller",
               "gender": 2,
               "credit_id": "56f44aa69251410e640011b9",
               "name": "Royal Dano",
               "profile_path": "/5kHyvS5Xaa97Lulrxy0ZgtqHqMI.jpg",
               "id": 19968,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Dony Wallace",
               "gender": 1,
               "credit_id": "56f44abbc3a3682fe00037d5",
               "name": "Carol Lynley",
               "profile_path": "/9dxF0lP9OOKXZjSaidxIXXvKT4p.jpg",
               "id": 7504,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Nita Stringer",
               "gender": 0,
               "credit_id": "56f44ad6c3a3682fe00037db",
               "name": "Dodie Stevens",
               "profile_path": null,
               "id": 1251711,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56f44afa925141769e002513",
               "name": "Don Siegel",
               "profile_path": "/vylrJ53CsYbxECA8c2CDEqkYKge.jpg",
               "id": 14773,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "56f44b229251411a8b00337d",
               "name": "Fred Gipson",
               "profile_path": null,
               "id": 240006,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56f44b3e9251411a8b003382",
               "name": "Winston Miller",
               "profile_path": null,
               "id": 30287,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.656383,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 148784,
      "vote_count": 1,
      "budget": 0,
      "overview": "A rustic drama set in the early 20th century, Hound Dog Man is the simple story of a young man, Spud Kinney (Dennis Holmes) constantly in hot water for disobeying his mother (Betty Field). The lad should be watching the family farm, but he falls in with his older brother, Clint (pop music's teen heartthrob Fabian), and his reckless buddy Blackie Scantling (Stuart Whitman) who take him hunting in hillbilly country. The boy falls in love with a beautiful mountain girl (Carol Lynley), while Blackie has his own fling with another attractive hillbilly maiden, Nita Stringer (Dodie Stevens), and then becomes mixed up with an older, married woman, Sussie Bell (Margo Moore).",
      "similar": [
         2539,
         10054,
         8272,
         103663,
         8967,
         2288,
         4347,
         7345,
         425,
         773,
         858,
         13,
         111,
         334,
         49519,
         112160,
         39254,
         244772,
         277216,
         11012
      ],
      "original_title": "Hound-Dog Man",
      "runtime": 87,
      "poster_path": "/sfDdgNBiAQZwSBOO2TADssLVM9e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1959-11-11",
      "vote_average": 4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Don Siegel"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Fred Gipson",
         "Winston Miller"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052906/",
      "coverLink": null,
      "actors": [
         "Fabian",
         "Stuart Whitman",
         "Carol Lynley"
      ],
      "reviews": [
         "This is really just some good old country fun, pretty well done. Hound dog refers to a real dog that they took out hunting, and a young fellow wanted to do that when he grew up. You have romantic tangles with Carol Lynley and young Dodie Stevens, who had a hit with Pink Shoelaces at the time. Pleny of singin and dancin, including a rollicking enjoyable barn dance scene. Fabian sings and so does Dodie. The title song was made into a good rock and roll hit, written by the famous Doc Pomus and Mort Shuman. Not all the songs are great and I have no idea why This Friendly World got any attention. The picture was wide Cinemascope, but full-screen on TV.",
         "I haven't seen this film since my parents took my sisters and me to see it when it first came out. I was about six or seven. I thought, given the title, we were going to see an Elvis Presley movie. Even at that age I'd heard so much about Elvis that I was anxious to see it. My parents might have fallen for the deceptive title too as far as I know. I don't recall the movie being really bad (when I was that age i was just happy to go to the movies at all) but I thought the music and the guy singing were awful. I recall thinking that this Elvis guy was awful and I didn't pay any attention to him until a couple of years later when I saw \"It Happened At The World's Fair\". That was 1963 although I probably didn't see it until 1964. I thought Elvis was a lot cooler than he was in \"Hound Dog Man\" but again, the music was really unmemorable. A year or so later came \"Viva Las Vegas\". I don't remember whether I saw that one in the theatre or not but I remember that, thanks to the Beatles, I had been listening to the radio constantly for about a year or so by then and \"Return To Sender\" was a hit. Wow! That song knocked me for a loop. I couldn't get enough of it. I guess I must have thought the other films were just a couple of bumps in the road because this guy Elvis was GREAT! Around the same time I found out that it wasn't Elvis in \"Hound Dog Man\" at all but Fabian! I am quite proud of the fact that at only six I could tell that Fabian was a bad actor and an even worse singer. Looking at the incredible cast of \"Hound Dog Man\"-Stuart Whitman,Arthur O'Connell, Carol Lynley-I'm thinking it might not be such a bad movie after all. If I could sit through the music I might consider watching it again. But I doubt it.",
         "Producer: Jerry Wald. A Company of Artists Production for 20th Century-Fox. Copyright 1959 by 20th Century-Fox Film Corp. New York opening at neighborhood cinemas: 27 April 1960. U.S. release: November 1959. U.K. release: May 1960. Australian release: 4 February 1960. 7,817 feet. 87 minutes. SYNOPSIS: Based on Fred Gipson's classic novel of the same name, \"Hound Dog Man\" begins with the lone figure of Blackie Scantling (Stuart Whitman) ambling up a country road. When this happy-go-lucky ne'er-do-well, whose life is one round of raccoon hunts and fishing holidays, turns into the farm of Aaron and Cora Kinney (Arthur O'Connell and Betty Field), he finds that he has acquired two idolaters in the persons of young Clint Kinney (Fabian) and his eight-year-old brother Spud (Dennis Holmes). Off on a holiday hunt with their new-found hero, the boys are dismayed to witness the \"Hound-Dog Man\" showing more than a passing interest in Dony Waller (Carol Lynley). Clint has little time for women and considers Nita Stringer (Dodie Stevens), whom they meet on the trip, a nuisance. NOTES: Film debuts of Fabian Forte and Dodie Stevens. COMMENT: Big Bear, California, has never looked so attractive as through the lens of Clarke's CinemaScope camera here. The players are surprisingly winning too. The slice-of-Americana story by Fred \"Old Yeller\" Gipson holds the interest, both despite and because of Don Siegel's controlled but uncharacteristically leisurely direction. OTHER VIEWS: It was nice to do a picture that children could go and see. I wish I could do more. My reputation may be as a director of violence, but that doesn't mean I can't, or don't want to, do comedy or love stories. My favorite picture is David Lean's \"Brief Encounter\". I might add that the film was based on a very good book, \"Hound Dog Man\", by Fred Gipson. Sam Peckinpah, who had been my dialogue director and assistant, wanted to do a picture based on the book. I'm sorry he didn't do it. He would have done it the way it should have been done: small! — Don Siegel."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Twentieth Century Fox"],
      "summaries": ["It looks like we don't have any Plot Summaries for this title yet. Be the first to contribute! Just click the \"Edit page\" button at the bottom of the page or learn more in the Plot Summary submission guide."],
      "budget": 0
   },
   "movielensId": 135895,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-11-11",
      "dvdReleaseDate": null,
      "directors": ["Don Siegel"],
      "runtime": 87,
      "movieId": 135895,
      "title": "Hound-Dog Man",
      "mpaa": "",
      "actors": [
         "Fabian",
         "Betty Field",
         "Stuart Whitman",
         "Arthur O'Connell",
         "Royal Dano",
         "Carol Lynley",
         "Dodie Stevens"
      ],
      "imdbMovieId": "0052906",
      "originalTitle": "Hound-Dog Man",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A rustic drama set in the early 20th century, Hound Dog Man is the simple story of a young man, Spud Kinney (Dennis Holmes) constantly in hot water for disobeying his mother (Betty Field). The lad should be watching the family farm, but he falls in with his older brother, Clint (pop music's teen heartthrob Fabian), and his reckless buddy Blackie Scantling (Stuart Whitman) who take him hunting in hillbilly country. The boy falls in love with a beautiful mountain girl (Carol Lynley), while Blackie has his own fling with another attractive hillbilly maiden, Nita Stringer (Dodie Stevens), and then becomes mixed up with an older, married woman, Sussie Bell (Margo Moore).",
      "tmdbMovieId": 148784,
      "avgRating": 2,
      "releaseYear": "1959",
      "numRatings": 1,
      "posterPath": "/sfDdgNBiAQZwSBOO2TADssLVM9e.jpg"
   }
}