{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cyborg",
            "id": 679
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "strong man",
            "id": 157681
         }
      ],
      "imdb_id": "tt0186655",
      "video": false,
      "title": "Universal Soldier III: Unfinished Business",
      "recommendations": [
         10704,
         42012
      ],
      "backdrop_path": "/vl9RSfWg2tV7UM5t5sYcnpMZyc3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Luc Devereaux / GR44",
               "gender": 2,
               "credit_id": "5481c8a09251416e7400652c",
               "name": "Matt Battaglia",
               "profile_path": "/jA9toiou3KV9vnevWCj1u1zGpmv.jpg",
               "id": 15282,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Veronica Roberts",
               "gender": 1,
               "credit_id": "5481c8ae9251416e6c005a04",
               "name": "Chandra West",
               "profile_path": "/7iUjeknSaQZtbcy07k1vKMjQAFm.jpg",
               "id": 54634,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "McNally",
               "gender": 0,
               "credit_id": "5481c8ba9251416e74006530",
               "name": "Roger Periard",
               "profile_path": null,
               "id": 103873,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Walker",
               "gender": 2,
               "credit_id": "5481c8c7c3a36829b50076e7",
               "name": "Richard McMillan",
               "profile_path": "/7IaSYFMcqTxpEUPM9UGZ2i6qIJg.jpg",
               "id": 5924,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mentor / CIA Deputy Director / GR88",
               "gender": 2,
               "credit_id": "5481c8d6c3a36829ae005bfd",
               "name": "Burt Reynolds",
               "profile_path": "/g5AyPAhdr5OtHVRGLD3i8Gw4oas.jpg",
               "id": 16475,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Charles Clifton (as Juan Chiorian)",
               "gender": 0,
               "credit_id": "5481c8e5c3a36829a7006316",
               "name": "Juan Chioran",
               "profile_path": null,
               "id": 1226510,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Grace / GR83",
               "gender": 0,
               "credit_id": "5481c8f29251416e8100615b",
               "name": "Claudette Roche",
               "profile_path": null,
               "id": 1228781,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Eric Devereaux / GR87",
               "gender": 2,
               "credit_id": "5481c9c3c3a36817a500647b",
               "name": "Jeff Wincott",
               "profile_path": "/oA1AVImV3w3761o5zWRhnUWuRjH.jpg",
               "id": 104509,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "542b5df3c3a36868e6000947",
               "name": "Jeff Woolnough",
               "profile_path": "/koqPv7NreDiF6CRjIdJN15gVk9S.jpg",
               "id": 66240,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5481c88f9251416e7b005bec",
               "name": "Peter M. Lenkov",
               "profile_path": null,
               "id": 58839,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.371189,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 27847,
      "vote_count": 9,
      "budget": 0,
      "overview": "Luc Devereaux and Veronica Roberts continue their attempts to expose the Universal Soldier unit. But after a hostage situation mistakenly leaves Veronica a fugitive, the two escape the city and go into hiding. CIA Deputy Director Mentor and Dr. Walker are also in the middle of literally 'growing' a powerful new Universal Soldier clone of Luc's brother Eric to assassinate him and Veronica.",
      "similar": [
         5548,
         9323,
         5550,
         5549,
         792,
         1865,
         19995,
         315837,
         12140,
         3176,
         8077,
         8078,
         2277,
         218,
         120,
         563,
         296,
         602,
         861,
         1369
      ],
      "original_title": "Universal Soldier III: Unfinished Business",
      "runtime": 95,
      "poster_path": "/ez7ytIV9ffBfjqY6o32mMUIJJ05.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rigel Independent Entertainment",
            "id": 40417,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Catalyst Entertainment Production",
            "id": 40418,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Durrant Fox Productions Inc.",
            "id": 40419,
            "origin_country": ""
         }
      ],
      "release_date": "1999-12-01",
      "vote_average": 3.8,
      "belongs_to_collection": {
         "backdrop_path": "/bonZuSo9YE7LFHEFE8oLD3qv32o.jpg",
         "name": "Universal Soldier Collection",
         "id": 10713,
         "poster_path": "/w6VKg5MJFmoACGgLcDUMmNSPYOv.jpg"
      },
      "tagline": "Back in action and deadlier than ever!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Woolnough"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Peter M. Lenkov"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0186655/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQzNTc1MTMzNV5BMl5BanBnXkFtZTcwNzQxMjIyMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Richard McMillan",
         "Roger Periard",
         "Layton Morrison"
      ],
      "reviews": [
         "If you can actually tolerate watching \"Universal Soldier III: Unfinished Business\" all the way through, you find yourself much like Keanu Reeves in \"The Matrix\" with all you can say being, \"whoa.\" This whole movie is just plain weird. The sheer fact that the producers made a cheesy spin off \"Universal Soldier II\" only to make a sequel-to-the-sequel \"Universal Soldier III\" tells you someone had too much fun with the storyline. Amazingly enough, despite the low budget nature of this film, the acting (while poor) and scenes are surprisingly better than \"Universal Soldier: The Return\" which says something about the quality of sequels. If you can't sleep at night, this is one of those movies you can watch to waste time.",
         "Unfinished Business indeed. As if you hadn't been bored to death already, here's another hour and a half to really knock you out. In case there's anyone out there at all interested, this follows straight on from the 'cliffhanger' of no.2 \"Brothers in Arms\" (NOT \"The Return\"), following the exploits of poor old Luc what's-his-name and some woman as they get ever closer to uncovering the truth behind an illegal government conspiracy to sell undead soldiers to......snore.....snore.....snore. I can't quite remember, but I think there might actually be an explosion in this film somewhere - just for all you high-octane action junkies out there. Oh and occasionally people fire big guns. Other highlights? The trailers and the end credits. Yes, it's really THAT good.",
         "This movie is a direct sequel to the second Universal Soldier movie, and makes no sense alone. Here, we get to know a bit more about things we were so extremely excited to know (yeah, right), for example who the leader of the bad guys is. The story becomes a bit more interesting than in the previous movie, and because of that I think it's a better one. The action is also better (although it still sucked). Battaglia does the same job all over again, Jeff Wincott should just forget that he ever took part in this, and Burt Reynolds (!!!, yes, Burt is in fact in this one. How low can you get) has just gone down the drain. This is not a great movie at all, but it can't be used as a torture device like it's prequel.",
         "Having escaped from the Universal Soldier HQ (see Universal Soldier 2: Brothers in Arms), Luc Devreaux (Battaglia) and Veronica (Chandra West) set out to expose the sinister plot whilst evading capture by fleeing to Canada. Meanwhile the Mentor (Reynolds) has plans to use the unit to steal US gold and a new stage in the units evolution begins as a foetus in a test tube has it's growth accelerated to produce the first organic soldier. \"It can't happen again\" exclaims one of the characters during the film, \"It's only temporary\" says Burt Reynolds at another stage. Unfortunately it is happening again and believe me it doesn't feel like it's temporary at all. This follows on from the \"success\" of the first sequel and makes all the same mistakes as the first. The plot is convoluted but still manages to be lame. The essence is the same as US:2 in that the two heroes follow clues whilst avoiding shootouts etc. The bit about stealing gold is just an excuse for more shooting while the whole breeding a soldier thing doesn't make sense - the fully grown man is Eric (Jeff Wincott), Luc's brother who died in US2. If he was grown from a test-tube, how does he have memories? If it really is Eric then how is he brought back as a foetus? Again it's only an excuse to have a brother:brother stand off at some point. Given that the whole thing is a CIA conspiracy then this should have a more shadowy feel to like - a touch of the X-files perhaps? But it doesn't go down that road at all. Some bits are just plain insulting - Luc and Veronica go to Canada to escape and to get Veronica's ex to help them. They meet up at a party which immediately gets taken over by terrorists, who force Veronica to read their demands live on TV to hide their identity. Once Luc kills the terrorists on TV, everyone knows where they are and the chase is on again. Oh and the three terrorists are brought back as soldiers. No reason why or how. This and other things are so badly thought out that it's just stupid. Which just leaves the action...which is dull. All shoot outs are the same, with no real action or tension. Witness Luc and Veronica escaping down a corridor 'pursued' by 2 soldiers firing automatic weapons - yet both parties are walking slowly rather than running. This is the same all the way through. To make it worse all the shoot outs are unnecessarily brutal - a stealth robbery begins by blasting anyone in sight and a convert operation on a hospital by the soldiers begins by....you guessed it... by blasting nurses etc. Excitement is not measured in body-count, yet unfortunately the director uses this violence to stand in for decent action scenes and drama. In US2 the action was boring and here they haven't made any improvements at all - it's a wasted action movie. The performances are really the final nail in the coffin. The only good performance is Claudette Roche as the terrorist leader Grace - she's dangerous in a foxy way and she quite sexy! She is good until she's brought back as GR83 with a terrible haircut replacing her once beautiful locks and then gives a very robotic performance. Battaglia is even more wooden here than in the last movie - it's like he trying hard and you can 'see' him act, making him very unconvincing and very, very wooden. He has to deliver several Bruce Willis style one-liners and they are terrible, he has all the charisma of a bookcase and you do wish Jean Claude Van Damme could have been booked. West is so-so but doesn't really bring anything to the role again. The standout performance is Burt Reynolds! Why does a man make Boogie Nights and this rubbish at around the same time? Here he gives the worst Irish accent I've ever heard - I know lots of actors get accused of this (Pitt in The Devil's Own, Gere in The Jackal) but trust me those sound like Bob Geldoff himself compared to this. It's almost worth watching 10 minutes of the film just to hear it. I thought he should have gotten more awards for his role in Boogie Nights, after US2&3 I realise that that was just an one-off from a has-been rather than a slightly better than usual performance. Sad to see how low he's gone. The same visual tricks are used here as in US2 - slow-mo, jump-cuts etc and again they fail to add any interest in this junk. In fact the only bit in the film that made me sit up, my palms sweat and my heart beat increase was the ending that left it open for another TV sequel. NOOOOOOOOO! If you can't find something better to do with 90 minutes of your life than this then perhaps you need to sit down and work out where you're going wrong.",
         "Apparently shot back-to-back with the truly abysmal UNIVERSAL SOLDIER II: BROTHERS IN ARMS, this is marginally better than its predecessor but still a generally worthless and unnecessary second sequel to a film which didn't need one in the first place. Firstly, let me go through all the bad points. Battaglia and West are back from the first film, and they don't seem to have gained much acting skill in the process, although their characters are slightly more human and likable this time around. Human action-man Jeff Wincott returns as Battaglia's brother, this time reprogrammed as a robot baddie. Get this: he has a titanic bust-up with his brother, remembers their history, gets to do some male bonding, and then finally explodes. An interesting cameo appearance to say the least. This \"explosion\" is one of the most amusing aspects of the movie and a highlight of its inadequacy - a scientist tells us the blast radius is \"twenty yards\", but the actual underwhelming explosion is no more than twenty inches! Unfortunately director Jeff Woolnough's irritating camera tricks are still evident as the film goes in slow-motion for absolutely no other reason than to look supposedly \"stylish\", and sudden loud bursts of music assault the viewer for no particular reason (all loud, pumping military-type stuff, with the occasional burst of hilarious classical music during the mindless shooting as we had in Part II). The plot is utterly boring as usual, as our characters go from one dangerous action set-piece to the next, the film-makers displaying scant regard for logic or reason. The final half just seems to be lots of minor characters getting shot to little or no effect; in fact the same sequence is repeated so often that there's no impact at all when it happens. The laughable script has lines like \"resurrection failure\" and the like. When one robot said \"nice night for a walk\" (like in THE TERMINATOR) I couldn't believe my ears. The first hour is almost totally devoid of action, although the few deaths and shootings that do occur are mildly entertaining in a silly, over-the-top dramatic kind of way. Where this film is better than sequel is in its amusing sequences like when a failed soldier is burnt alive in a big oven which just happened to be there. Burt Reynolds also has a fairly prominent role this time around, replacing Gary Busey's role from the previous instalment as he chews on a cigar and speaks in frankly the most unrealistic accent (Irish? Who knows) that I've heard in a film. At least he isn't hiding in the shadows, but to watch this once respected actor (remember DELIVERANCE?) throw away what career he had - especially coming only a year after the mainstream success of BOOGIE NIGHTS - is a little sad. In a bizarre metaphor for his acting career, Reynolds commits suicide in the movie - much like he killed his career when making this film. However, there is some hope for the actor - in the film, he's reborn, so perhaps his career will be \"reborn\" in the next few years. I guess we'll have to wait and see. UNIVERSAL SOLDIER III is a bad film, yes, but with a few amusing minor elements to make it a harmless time-waster. The ending adds an amusing conspiracy-type twist with the insinuation that the president himself is a robot, and leaves things open for possible further sequels. Thankfully, in the three years since this was made, none have followed, which may be just as well.",
         "Where to begin. The story is fine, the acting is pure, even when Luc is supposed to be human he is worse than Star Trek DATA, and it this really Universal Soler III or IIb? As you can tell, this spinoff of the series is messed up. The acting would be solved if they had meant money on Van Damme (to go with Gary Busey, Burt Renolds, and a Bill clinton voice impersonator). Unfortunately they dont, and this \"high tech\" looking TV-seried (parts one and two) finds the need to recreate the end of Universal Solder I and then erroniously place the date as 1998 not 1992. Berronlia and West are merely Canadian versions of the Universal Soldier I characters and it shows. Like other movies (aka The Jessee Ventura story) the Canadians come off as fake and crude (especially in the Canadian business scene). Anyway not to bash on Canadians as the movie does have one of the funniest lines I can remember. Burt Reynolds: \"General Clancy, I need a favor.\" Clancy: \"Whats that sir?\" Reynolds: \"I need you to die. Don't Worry its only temporary.\" Hopefully this teo part blip and Burt Reynolds fakish Scotch Irish accent are only temporary.",
         "Universal Soldier III: Let's be honest here, my hopes for Universal Soldier 3 were not exactly high. In fact, so low were they that even a modicum of style or verve would have been acceptable. So, did it live down to my prejudices? Oh, yes indeedy. In a move so audacious, they can only be commended, the casting personnel for the movie managed to locate and hire the only man alive with less acting talent and on screen charisma than either Long Cord Man Slamme or Dolphin Lundgren. In fact, when comparing the lead role here with Dolphin, it is hard not to bring to mind a battle of acting prowess between Meryl Streep and Jimmy Krankie, with Dolphin in the role of Streep. Matt Battaglia, a one man slab of mahogany gurns and stammers his way through a movie so lacking in style at one point I actually broke down and wept, head falling forwards, face slapping into my bowl of Super Noodles (beef), only able to breath by mercy of the fact that one noodle slipped up a nostril and I was able, through sheer force of will, to suck enough oxygen through the wheat construct to sustain life. When my energy returned, mercifully, the movie had ended, the on screen message taunting me \"View Again?\" No, my friend, I commanded the V+ box, not ever again.",
         "This second sequel to \"Universal Soldier\" starring Jean Claude Van Damme and Dolph Lundgren is a made for TV movie starring Matt Battaglia and Burt Reynolds (using an Irish accent) that was made side by side with its prequel \"Universal Soldier 2: Brothers In Arms\" with the aim of leading to a TV show (that never happened) Matt Battaglia continues in the Van Damme role and likewise Chandra West in the Ally Walker role. Burt has a lot more to do this time around, which automatically raises the quality of this instalment, although there is still an over use of slow motion. There are some impressive is set pieces and well directed action scenes however a bit of dodgy acting in certain quarters ruin what could have been an average TV movie. I think had he been able to anticipate the success of \"Boogie Nights\" and his subsequent Oscar nomination for his performance, he may have been a bit more picky about what roles he was taking, and bided his time waiting for a quality script to keep the momentum of his comeback going. However his ongoing financial worries at this time, probably dictated he grabbed what ever work was offered to him as he made seven movies in both 1997 and 1999.",
         "You know a film must be pretty awful when: a) Burt Reynolds is the best actor in it. b) You keep wishing Jean-Claude Van Damme would make a re-appearance. Absolutely dire is a kind way of describing this pitiful offering. The original concept behind the Universal Soldier had plenty of potential, but this sequel to a sequel (and not even real sequels, but TV Movie sequels!) is almost too bad for words. Each and every one of the actors is truly terrible, especially the leading man, Battaglia. I know he's supposed to be playing a mindless automaton to begin with, but give me a break! Wooden doesn't begin to describe his performance which was so devoid of energy and enthusiasm that I began to long for Jean Claude to return. Now that's pretty bad! Burt Reynolds is the best of the bunch, but he fails miserably to deliver even a half-way decent Irish accent. At first, I couldn't even figure out what accent he was trying to portray, let alone whether it was any good or not. Please Burt, go back to the retirement home and stop making a fool out of yourself. The plot is pure silliness, coming from the \"straight-to-video action movie\" library of crass, \"fire-fight for no reason\" scripts. Endless gun fights, interspersed with \"arty\" shots of shell casings falling to the floor a la The Matrix (but never more than about three, almost as if they only had three casings). Lots of automatic gunfire, but the only people that actually get killed appear to be innocent bystanders. The Unisols in this movie appear capable of A-Team like innaccuracy when it comes to hitting the main characters. <spoilers ahead> In fact, when it comes to automatic fire, this film did teach me one thing. Ambulances are bullet-proof and perfect for escaping from machine gun toting uber-killers! Despite being hit front and rear, the ambulance received not even a scratch, not one bullet hole or broken window. The same ambulance also proved to be impervious to suicide soldiers who leapt in front of it, again sustaining no damage apart from a few sprinkles of fake blood. There are a large number of pointless or contrived scenes and heaps of foolish dialogue that falls flat on its face. A number of scenes are just plain risible, such as the scene where the Unisols are \"covertly\" entering a military airbase. They come up against a chainlink fence and resort to the best means to \"covertly\" cut through it to gain entry - a frickin blowtorch! No pansy boltcutters or wire-snips here. A full on blowtorch to melt through the links. Yep, the guards'll never notice a blowtorch in the pitch darkness! Duh! Pure idiocy. Later, inconsistent scenes and dialogue appear, such as the bomb in the hero's brother's chest, which we are told has a blast radius of twenty yards. When it goes off (moments later) it's more like he had a firecracker under his shirt. No, I take that back. A firecracker would have been more dangerous. Pathetic film-making! Then there's the scene with Burt leaping to his death from a rooftop onto the roof of a car. All the windows except for the windscreen itself blew out, but the screen wasn't even cracked? C'mon! I know it's only a TV Movie, but how dumb do they think the audience really is? All in all, this movie is not worth watching except perhaps as an exercise in how not to make an action movie. There's really no excuse for thinking that this kind of rubbish will satisfy even the most easily pleased of movie-goers. I know TV Movies have a very limited budget, but this takes the p**s. If they could afford Burt Reynolds, they could have afforded a few old cars to smash up or even an old van they could have painted up like an ambulance so they could have put bulletholes in it, for Chrissake! The Director appears to have only worked in television, directing odd episodes of this series or that, and the small screen mentality really shows in this movie. But it's the plot that really is beyond poor. An average six year old could probably come up with a more interesting and gripping action script than this one. If you are a fan of the original, give this a very wide berth, or it'll scar you for life.",
         "A film devoid of merit, it almost defies articulation in its lack of creativity, originality, and knowledge of film making. Burt Reynolds provides a complete rationale for why his career has almost come to an end with a performance that probably best describes his true essence. This film has accomplished one feat I would have thought impossible, it almost made Jean-Claude Van Damme's earlier version seem worthwhile. Put a torch to this tape and spare future viewers the wasted time."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Catalyst Entertainment Production",
         "Durrant Fox Productions Inc.",
         "Rigel Independent Entertainment"
      ],
      "summaries": [
         "Luc Devereaux and Veronica Roberts continue their attempts to expose the Universal Soldier unit. But after a hostage situation mistakenly leaves Veronica a fugitive, the two escape the city and go into hiding. CIA Deputy Director Mentor and Dr. Walker are also in the middle of literally 'growing' a powerful new Universal Soldier clone of Luc's brother Eric to assassinate him and Veronica. Now it may leave Luc no chance to end it all.",
         "The Return Luc Deveraux and Veronica Roberts continue their attempts to expose the Universal Soldier unit."
      ],
      "budget": 0
   },
   "movielensId": 135959,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-12-01",
      "dvdReleaseDate": null,
      "directors": ["Jeff Woolnough"],
      "runtime": 95,
      "movieId": 135959,
      "title": "Universal Soldier III: Unfinished Business",
      "mpaa": null,
      "actors": [
         "Matt Battaglia",
         "Chandra West",
         "Roger Periard",
         "Richard McMillan",
         "Burt Reynolds",
         "Juan Chioran",
         "Claudette Roche",
         "Jeff Wincott"
      ],
      "imdbMovieId": "0186655",
      "originalTitle": "Universal Soldier III: Unfinished Business",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["qPnCt8jR0TA"],
      "plotSummary": "Luc Devereaux and Veronica Roberts continue their attempts to expose the Universal Soldier unit. But after a hostage situation mistakenly leaves Veronica a fugitive, the two escape the city and go into hiding. CIA Deputy Director Mentor and Dr. Walker are also in the middle of literally 'growing' a powerful new Universal Soldier clone of Luc's brother Eric to assassinate him and Veronica.",
      "tmdbMovieId": 27847,
      "avgRating": 2.5,
      "releaseYear": "1999",
      "numRatings": 14,
      "posterPath": "/ez7ytIV9ffBfjqY6o32mMUIJJ05.jpg"
   }
}