{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spaceship",
            "id": 9831
         },
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "cloning",
            "id": 11628
         }
      ],
      "imdb_id": "tt0486761",
      "video": false,
      "title": "Leroy & Stitch",
      "recommendations": [
         15567,
         20760,
         13417,
         15657,
         8965,
         15653,
         16690,
         73245,
         12448,
         10010,
         13683,
         51985,
         34942,
         50393,
         22643,
         77887,
         82424,
         11544,
         14873,
         3126
      ],
      "backdrop_path": "/fg3LcGnn6s5zhHImcmOdXtP7KzY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nani",
               "gender": 1,
               "credit_id": "52fe4414c3a368484e00e3d5",
               "name": "Tia Carrere",
               "profile_path": "/s2y4Hj7ZIuEMyE0W3o8WCVcHwiL.jpg",
               "id": 13445,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lilo",
               "gender": 1,
               "credit_id": "52fe4414c3a368484e00e3d9",
               "name": "Daveigh Chase",
               "profile_path": "/xiJf7nTOvVVWIyWG9fyoauU6Ff3.jpg",
               "id": 1580,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Grand Councilwoman (voice)",
               "gender": 1,
               "credit_id": "52fe4414c3a368484e00e3e3",
               "name": "Zoe Caldwell",
               "profile_path": "/wbVtmnOg8n0JWXthhttzdi9kcNt.jpg",
               "id": 937681,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Pleakley (voice)",
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3e7",
               "name": "Kevin McDonald",
               "profile_path": "/vqLF8voWGTGxpMJ1wqhAovQuL94.jpg",
               "id": 58955,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Stitch/Leroy",
               "gender": 2,
               "credit_id": "59c055189251417d9b005388",
               "name": "Chris Sanders",
               "profile_path": "/m4kZMS2J0AFjlAuwtijEmsOXYfc.jpg",
               "id": 66193,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Gantu",
               "gender": 2,
               "credit_id": "59c05530c3a36804b1004f40",
               "name": "Kevin Michael Richardson",
               "profile_path": "/9dMOW2CFRrlDkNzeXVGMJfASupM.jpg",
               "id": 24362,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Reuben",
               "gender": 2,
               "credit_id": "59c055489251417dd4005411",
               "name": "Rob Paulsen",
               "profile_path": "/hHgifZsqtTchMvpxGspoKGnqvmZ.jpg",
               "id": 43125,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hamsterviel",
               "gender": 2,
               "credit_id": "59c055579251417dc3005070",
               "name": "Jeff Bennett",
               "profile_path": "/bms3A7TA0QItjtUlB28qv4MFFAH.jpg",
               "id": 34982,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jumba",
               "gender": 2,
               "credit_id": "59c0557bc3a3680489005740",
               "name": "David Ogden Stiers",
               "profile_path": "/zngM0eXq6RuYZmdocsAY2AMKUja.jpg",
               "id": 28010,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3ed",
               "name": "Roberts Gannaway",
               "profile_path": "/7q1wZMMoRVdNcn12gKKT73dpFTQ.jpg",
               "id": 210053,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4414c3a368484e00e3f3",
               "name": "Roberts Gannaway",
               "profile_path": "/7q1wZMMoRVdNcn12gKKT73dpFTQ.jpg",
               "id": 210053,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "589b6039c3a3680c5b0007cc",
               "name": "Tony Craig",
               "profile_path": null,
               "id": 185072,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 9.940045,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21316,
      "vote_count": 105,
      "budget": 0,
      "overview": "Lilo, Stitch, Jumba and Pleakley have finally caught all of Jumba's genetic experiments and found the one true place where each of them belongs. Stitch, Jumba and Pleakley are offered positions in the Galactic Alliance, turning them down so they can stay on Earth with Lilo. But Lilo realizes her alien friends have places where they belong, and it's finally time to say \"aloha.\"",
      "similar": [
         228161,
         348,
         126889,
         7453,
         16866,
         10679,
         15493,
         49849,
         118340,
         19995,
         157336,
         8077,
         602,
         339964,
         601,
         607,
         608,
         9016,
         283995,
         9982
      ],
      "original_title": "Leroy & Stitch",
      "runtime": 73,
      "poster_path": "/84ii0eIQy8wyzo5ZOSDbnoDtQ4O.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/jTPNzDEn7eHmp3nEXEEtkHm6jLg.png",
         "name": "Walt Disney Television Animation",
         "id": 3475,
         "origin_country": "US"
      }],
      "release_date": "2006-06-23",
      "vote_average": 6.6,
      "belongs_to_collection": {
         "backdrop_path": "/oKfkaJLqc1cRURbq8DG2D6TOeAX.jpg",
         "name": "Lilo & Stitch Collection",
         "id": 97461,
         "poster_path": "/bstyyXaLinnYwoyvo5HaDceJN07.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Tony Craig",
         "Roberts Gannaway"
      ],
      "runtime": 73,
      "synopsis": null,
      "writers": [
         "Roberts Gannaway",
         "Jess Winfield"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0486761/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BZmU2MWFjYmItY2ZmNC00MDY0LTg1MjEtYzBkNjZhMmIzNWEzXkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_UY268_CR4,0,182,268_AL_.jpg",
      "actors": [
         "Daveigh Chase",
         "Chris Sanders",
         "David Ogden Stiers"
      ],
      "reviews": [
         "When the L&S movie came out way back in 2002, I didn't really think much of it other then the fact that is was different from the usual Disney fare (Fairy tales, etc) not to mention wholly original. However ironically I wouldn't get on the fan wagon until the TV series to which I then watched the movie. Granted they were two completely different monsters with the series focusing more on adventure but still I dug it for what it was and enjoyed the expansions of all the characters within (save for Cobra Bubbles whose VA couldn't be bothered). But alas it's the end of the line now as the L&S series takes it final bow with its fourth (Yes FOURTH) and final movie in the series that wraps everything up\u0085and actually does it quite nicely. Premise: The 626 experiments from the TV series have all been caught, reformed and been given their one true place on Earth. As such Lilo, Snitch, Pleakly and Jumba are regarded as heroes but what more surprising the latter three have now been given a chance to leave Earth and find their own true places as well, but of course this mean they'll have to leave Lilo and Nani behind. If that wasn't bad enough, Hamsterviel (the main thorn in our heroes side since Stitch the Movie) has once again escaped from prison with yet another fiendish plan of his own that involving making a duplicate of our favorite blue koala looking alien only of course evil and then trying to conquer the universe. Can Stitch, Lilo and their ohana stop him? To say the least the movie wraps things very well with a few shade of the themes from the first film (though not as heavy handed) and actually falls back on continuity of the series for fans of it though you don't have to watch it to truly understand all of it. Plus we get some rather cool battles as well, nothing mind blowing but still enough to whet your appetite. Whats even better we get to see all the experiments (even some that wasn't featured in the series) take a quick spotlight role especially near the end when everything hits the fan. So fans of the series(myself included) shouldn't be disappointed here. The only downsides I can think of is some issues not getting resolved ranging from minor (Do Nani and David ever really get together?) to major (Lilo and Myrtle's platonic friendship which was barely touched upon in this film. In fact I thought the latter's involvement in the film was kinda tacked on. And why aren't there more scenes of Victoria or the \"Yeah\" girls, there're just a part of this as Myrtle is?) But other then those issue, there not much to complain about. Overall is a nice send off to a very great franchise and fans of the series shouldn't be disappointed. I'll admit am gonna miss this series but then again, going off by the ending of the movie, we may not have heard the last of the quirky little Hawaiian girl and her \"mutant\" dog ;).",
         "This is a great follow up to the series, we get to see all the experiments in a flash cameo. The animation was good, not up to snuff with the original film, however much better than Stitch The Movie! This is set after the series, when all 625 experiments are captured and turned from bad to good. The Grand Council Woman gives Lilo Stitch , Pleaky and Jumba jobs in fields they feel they are best in, which splits apart the ohanna. Jumba back at the Lab, Pleakly a non teaching teacher at GCAC, Stitch now has Gantu's job and Lilo is sole protector of all the experiments. The jobs are what they want but this little family can't stay apart forever as a new experiment, experiment 629 is created by Jumba by force of Dr. Hampsterwheel. The film comes to a show stomping show down when all 626 experiments take on all 100,000 Leroys which were cloned by Hampsterwheel. This is a film that wraps up the Lilo and Stitch Series nicely. This film gets an 8 out of 10 from me, only because it is ending the series. However another movie would be great, as David and Nani are still not married and we all know they belong together.",
         "It was good, trying to follow the same formula as the previous movies, but I feel they didn't get it completely. The story is decent and with some funny moments but also I feel that they were just recycling and repeating the previous movies stories. The plot was decent and convincing with a very good rhythm. I like the music very much and the animation was great as it is always on Disney's movies. The cast of voices was very decent and good. In conclusion, this wasn't the best movie of the series by far, but I think its pretty enjoyable and entertaining to spend a good Sunday afternoon with the family.",
         "To all the director and development teams out there please follow this style of ending. I have seen this brand evolve from the beginning from the first movie to the TV series to the video games to the amusement park involvement to the ending. This was by all means a good ending of the brand. Me being in hong kong last year there was one thing that i have to say. Lilo and Stitch is a HUGE and when i say HUGE i mean like crazy huge. Last summer the theme was Summer Blast and who would be doing the blasting well who would be better than stitch. Everything was dressed up as that style and was truly spectacular. Now i feel that this movie really did it justice to the brand. Could it have been better yes of course but most films can be better. I feel maybe they could have played off alittle more on the \"key\" cousins but in order to do that it would need a longer period than 1 hour. So for the time they had been given i feel it did a good job. And the best part was that they summed everything up with a simple word. Aloha",
         "Leroy and Stitch was a film I found very entertaining. I don't think it is as good as the original, which is wonderful and one of Disney's better movies of the 2000s, but I would put it on par with Lilo and Stitch 2:Stitch Has a Glitch, and a notch above the TV series. All of these though are better than Stitch the Movie, while not absolutely terrible, I did find it disappointing and mediocre to say the least. I did think Leroy and Stitch was a little too short, and a little rushed at times. Also while the story was fast-paced and fun to watch, more could have been done with it, namely Nani and David's relationship and the platonic friendship between Lilo and Myrtle. This aside, the animation is still lively and colourful, and the soundtrack is bright and breezy. The writing is witty, funny and warm, and the characters still have their infectious personalities, Lilo and Stitch are still cute, Jumba and Pleakley are still funny and Nani's personality thankfully is less distorted than it is in the series. Leroy is a worthy character too, and the voice work is also top notch. All in all, very entertaining. 7/10 Bethany Cox",
         "I liked all the Lilo and Stitch movies. The TV series weren't that great, but I put my opinions of the series aside when I watched this movie. And I must say... It was bad. One thing I found disappointing was the animation. Yes, you heard it. The animation. I found its quality greatly degraded since the first movie. Its quality was only as high as the TV series', something which I did not expect at all. If you're looking for eye candy, don't expect anything much here. Also, the animation failed to portray any serious moods. Even in the supposed sad scenes, I didn't feel anything for the character, another downgrade from the first movie. The next, was the absolutely horrible voice acting. I found it very, very unconvincing, and wondered why, Disney, with all its riches and glory, couldn't afford voice actors with real talent. The voice actors' skill were just as annoying as the one in the series. I tolerated the one in the series because, hey, who wouldn't be tired out when made to voice act for so many episodes? Heck, I don't even know how many episodes there are (Theoretically, there are 624, but I just can't believe that). However, I thought that the voice acting would improve in the movie, and I was put down in the face by the truth, that what they could do in the series was already their best. Next, was the horrible script. It was cheesy beyond redemption, and the writers just try too hard. They try to put some jokes in, but I just found them annoying. Maybe it wasn't the voice acting, but the cheesy dialogues that ruined the sound section. (On the upside, the soundtrack wasn't too bad, and matched the mood quite well.) Fourthly was the problem with the storyline. I predicted everything, and the storyline was what made the characters so unoriginal and unlikeable all of a sudden. You have the aliens get new positions and responsibilities inouter space. After the initial hype, they realize that they actually didn't like it and miss their old life. Meanwhile, the evil villain gets broken out of jail after a very 'action packed' action scene and breaks in to Jumbaa's lab to steal his experiment. The experiment was then cloned into 100 others and the hamster wants to conquer Earth. When the main characters find out, they try to stop the evil hamster but gets confronted in some cheesy final showdown against the experiment and owns him in an extremely lame excuse for trying to make the series to look cool. The characters then give up their new privileges and return to Earth to resume their life. Seriously, how many other movies has used that ending already? The that storyline was extremely short and formulaic, so don't expect too much from it. So Disney has failed in sound, graphics and storyline. The only charm of the series was the original characters, and how they managed to retain the 'feel' of the characters, but even that wasn't able to save the movie. I tried to like it, I really did, but I give it a rating of 4/10. Another Disney failure.",
         "That lovable space alien Stitch finds himself in an adventure as big as the galaxy. A mean spirited Dr. Hamsterviel breaks out of prison and creates a whole army of evil Stitch twins. Jumba is forced to create a trouble-making twin of Stitch named Leroy, who has the undesirable need for destruction. Lilo, Stitch, Pleakley and even Jumba must somehow defeat the evil doctor and his minions to save the universe. Ruling the stars is not an easy undertaking...and Hamsterviel is thwarted. Not exactly the best of the genre, but a Walt Disney animated adventure is safe for the whole family to enjoy. And you know Lilo...there just has to be a few Elvis Presley tunes included. The story is not too busy and definitely not too long; but just right to fit into a lazy afternoon. The vocal cast includes: Daveigh Chase, Chris Sanders, Tia Carrere, Kevin McDonald, David Ogden Stiers, Jeff Bennet, Zoe Caldwell and Ving Rhames."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Disney Television Animation",
         "Disneytoon Studios"
      ],
      "summaries": [
         "Lilo, Stitch, Jumba and Pleakley have finally caught all of Jumba's genetic experiments and found the one true place where each of them belongs. Stitch, Jumba and Pleakley are offered positions in the Galactic Alliance, turning them down so they can stay on Earth with Lilo. But Lilo realizes her alien friends have places where they belong, and it's finally time to say \"aloha.\" Meanwhile, Gantu has left Earth and broken Doctor Jacques Von Hamsterviel out of prison, who's planning to create and clone a new experiment named \"Leroy,\" one that will allow him take over the galaxy.",
         "New circumstances forces Lilo and her alien friends to part ways while Gantu and Dr. Van Hamsterviel create the Stitch clone, Leroy, in order to capture all of the experiments and take over the galaxy."
      ],
      "budget": 0
   },
   "movielensId": 135953,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-06-23",
      "dvdReleaseDate": null,
      "directors": [
         "Roberts Gannaway",
         "Tony Craig"
      ],
      "runtime": 73,
      "movieId": 135953,
      "title": "Leroy & Stitch",
      "mpaa": "G",
      "actors": [
         "Tia Carrere",
         "Daveigh Chase",
         "Zoe Caldwell",
         "Kevin McDonald",
         "Chris Sanders",
         "Kevin Michael Richardson",
         "Rob Paulsen",
         "Jeff Bennett",
         "David Ogden Stiers"
      ],
      "imdbMovieId": "0486761",
      "originalTitle": "Leroy & Stitch",
      "genres": [
         "Animation",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["SXw5RThp2HQ"],
      "plotSummary": "Lilo, Stitch, Jumba and Pleakley have finally caught all of Jumba's genetic experiments and found the one true place where each of them belongs. Stitch, Jumba and Pleakley are offered positions in the Galactic Alliance, turning them down so they can stay on Earth with Lilo. But Lilo realizes her alien friends have places where they belong, and it's finally time to say \"aloha.\"",
      "tmdbMovieId": 21316,
      "avgRating": 3.13235,
      "releaseYear": "2006",
      "numRatings": 34,
      "posterPath": "/84ii0eIQy8wyzo5ZOSDbnoDtQ4O.jpg"
   }
}