{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0760169",
      "video": false,
      "title": "Hallettsville",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mrs. Jensen",
               "gender": 1,
               "credit_id": "52fe454cc3a36847f80c6557",
               "name": "GiGi Erneta",
               "profile_path": "/5XZm2mkdVenUZUztC6vnDCIjiHz.jpg",
               "id": 43757,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sheriff David Ketchum",
               "gender": 2,
               "credit_id": "54d8632c9251415f9c007243",
               "name": "Gary Busey",
               "profile_path": "/n66ycv61ZoqusHthcQde1g3JY6T.jpg",
               "id": 2048,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Tyler Jensen",
               "gender": 2,
               "credit_id": "54d86337925141424100018c",
               "name": "Derek Lee Nixon",
               "profile_path": null,
               "id": 297095,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "April",
               "gender": 1,
               "credit_id": "54d86344c3a3683b99006f94",
               "name": "Katie Fountain",
               "profile_path": null,
               "id": 155023,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mark",
               "gender": 2,
               "credit_id": "54d8634d925141716000783a",
               "name": "Jordan Brower",
               "profile_path": "/p4nnRMYdWJEdwFKNNLMUPvslHcy.jpg",
               "id": 137391,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Adam Lemmerich",
               "gender": 0,
               "credit_id": "54d86358c3a3683ba0007eec",
               "name": "Aidan Marus",
               "profile_path": null,
               "id": 229005,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Young Tyler",
               "gender": 2,
               "credit_id": "54d863649251416b930072ae",
               "name": "Ellar Coltrane",
               "profile_path": "/wJvJrUlWFrwGSbij5mB3KlpdqXQ.jpg",
               "id": 931944,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe454cc3a36847f80c655d",
            "name": "Andrew Pozza",
            "profile_path": "/bK242HMgXIIfuYMTyCGScgh76Qj.jpg",
            "id": 60693,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 0.156225,
      "production_countries": [],
      "id": 9935,
      "vote_count": 3,
      "budget": 0,
      "overview": "Something awaits Tyler Jensen and his friends in the Hallettsville house. When Tyler's lifelong friends start dying, he must figure out a way to save himself, his girlfriend and the rest of the crew before the demons come.",
      "similar": [],
      "original_title": "Hallettsville",
      "runtime": null,
      "poster_path": "/i6AtodIwCt2tQa8NGDIIFqvEWYc.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "2009-03-05",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Andrew Pozza"],
      "runtime": 87,
      "synopsis": "Gary Busey stars as a no-nonsense sheriff in HALLETSVILLE, an intense indie horror flick about terror in a small town. When a group of friends decide to spend one last weekend in a soon-to-be-sold ranch house, they wind up confronting more than just emotional demons. As the young adults begin to suffer sudden, mysterious deaths, the remaining friends must scramble to silence the horrific poltergeists.",
      "writers": [
         "Derek Lee Nixon",
         "Andrew Pozza"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0760169/",
      "coverLink": null,
      "actors": [
         "Gary Busey",
         "Derek Lee Nixon",
         "Logan Patrick Brown"
      ],
      "reviews": [
         "Hallettsville is a rare gem that starts off well and fizzles out into a forgettable, underachieved conclusion. It's in an indie with the only name actor being Gary Busey, whose recent filmography probably won't get the attention of most viewers looking for an above average horror movies. Alas, I gave it a shot\u0085 online at Netflix, and I was pleasantly surprised. I expected a b horror movie with a predictable plot, lame acting, and lousy cinematography. But the Hallettsville has a lot of talent tucked into it's indie bundle. First time director Andrew Pozza directed and co-wrote this supernatural thriller which has a very standard plot: A group of college aged friends go to one of the kids' parents' cabin where they later reveal that 'something bad happened.' It's true what they say: it's all been done before, but it's not the story you tell, it's how you tell it, and Pozza and company do it well\u0085 for a while. The cinematography and sound design were the two things that I enjoyed the most about this film. The acting was solid as well accomplished. The dialogue was good for the most part and Busey's small role was well played and memorable. Most of the cast was solid as well and I couldn't help but notice one of them strangely resembled a young Johnny Depp. I wouldn't be surprised if his face shows up in a mainstream film one of these days. Hallettsville is full of memorable scares and jumps, but the film becomes increasingly B-movie when the killing starts and we don't really see much of anything. The ending was just lame, and what the hell is up with the book? It brought nothing to the story, it only reminded me how similar to The Evil Dead this film was and it mislead me into believing that things would be better explained when they ultimately weren't. However, this film deserves a lot of credit for the atmosphere it credited, but the third act really hurt the quality and turned my expectations belly up.",
         "After inheriting a secluded cabin in the woods, a college student and his friends head up to the forest for a weekend retreat. Upon arriving, they start disappearing one by one due to some demons... or something. A sheriff (Gary Busey) shows up occasionally as well. Gary Busey. No, that's not enough for a review? Well, if it isn't, then I wouldn't suggest bothering with this film as it doesn't have very many other redeeming factors. It's basically just another in the dozens upon dozens of wannabe 'The Evil Dead' films without any real merit other than a few jump scares. Technically, it fails for the majority of the time but does have a few positives. For one, the cinematography isn't too bad, though it does \"borrow\" heavily from, again, 'The Evil Dead.' Also, the story's background isn't too shabby with the mass murder of a dozen school children by some demonically possessed schoolteacher. But, beyond that, it's nothing special at all. The direction is quite boring, the editing is fairly shoddy, the dialogue is unbearably stupid and not at all realistic from anyone I've ever met, and the acting (even Busey's) was pretty subpar. Also, the ending was just pathetically lame and tossed in for, well, I can't really think of a reason to include it to be honest. Overall, 'Hallettsville' fails in many areas and doesn't succeed enough in the rare element to make it worth any time unless you're a fairly big fan of Gary Busey. Final verdict: 3.5/10. Purely out of watchability and, well, that's about it. It's not really worth the time, unless you have a LOT of it to spare. -AP3-",
         "It's a B movie, so does it make it okay for the film to suck? And if it is so, then why bother making such movies, and why do people bother to even watch such movies? It's because B movies doesn't mean that it can be okay to suck, it just means that the movie lacks known actors, and it doesn't have huge funds to make the movie. So pardon me for saying that this film failed big time. The nonsensical storyline, long-winded plots, lame dialogs, made this film bad. And Busey's couldn't help to raise the bar. On the plus side, there are some scary moments, but still not enough for it to warrant a better rating than a 2/10 stars.",
         "They should've called it \"Pink Lemonade\", because I think that's what they used for fake blood. And they use it a lot. Furthermore, this movie has such a pathetic plot line that even one of the lead roles says in one scene, where they are huddled up around the campfire, that \"it's one of the most retarded stories ever\" and he is right. The average adult movie has got better story lines than this mess. Also, the music selection for some scenes just makes you laugh. It's so bad, I don't know how to describe it. Thru n' thru this is a really sad, pathetic, awful movie. Don't waste almost 2 hours of your life watching it. I wish I hadn't. Not even the legendary Gary Busey can save this flick from a rock bottom grade.",
         "Well, some will find this a horror flick straight out of the books. Sure, it has the typical ingredients: a group of youngsters with individual characters and problems, an abandoned house, ghostly legends, policemen that are there just to be slashed, women that are just there to scream, that kind of stuff. So hey, if you're into this, please see this movie. But be warned: the acting is off the charts horrible, the story makes no sense whatsoever, and the character development and/or description failed in every way. Since I'm not an entirely evil person, I will add some positive remarks. I liked especially the special effects inside the house. They were not innovating, but they do give you the necessary scare. Secondly, the story could be workable. I believe a better writer (and better actors) could have pulled off a much better story. 3 out of 10 for the positive remarks, which are then only based on the effects. As for the whole experience: don't torture me again!",
         "When I saw this in the theater, I was expecting to see a predictable, low budget cut horror movie. That we would just get bored with. But I was wrong. This has to be one of the most clever movies. Believe me, this was an awesome thriller. Andrew Pozza should stick to movies like this, It had a wonderful cast. Nice lines. Scary moments. Classic horror scenes that will keep you at the edge of your seat. Though not a movie that you'll rewind and want to watch again and again. Too predictable. The ending was OK could have been better. So, if you have good taste in horror movies, or are looking for something original, watch this film. Its OK for a fun weekend horror mara! 7/10",
         "Didn't expect a lot with a rating of 3.6, but was pleasantly surprised. The effects were great, especially considering the budget, and it wasn't as cliché as I thought it would be. The premise of the story was interesting; however, it could have been fleshed out better, and the ending was weak. Mostly the acting was nothing special, but Gary Busey and Jesse Janzen were good. The main reason I liked it was because the characters in this horror flick had very strong survival instincts--you don't see them making dumb choices left and right and it makes it more believable, tense, and scary.",
         "While attempting to look in on a family house before it gets sold, a group of friends find themselves the victim of a murderous spirit who has far more sinister plans for the group than they initially figured. This one wasn't really all that spectacular, mostly due to the fact that this one doesn't exploit it's pretty decent premise for all it's worth. This one could've been pretty good with it's storyline about the hauntings within the house, possession and such, but instead it manages to focus on the kids' problems and never really gets anything going since we're stuck dealing with their issues that aren't interesting or even appropriate in the film. That leads to the final part of the film generating anything good, which is actually somewhat decent with some pretty good encounters with the spirit and a pretty god bit of innovation in having outsiders who they stumble upon believe their story instead of just writing it off as demented rambling, which adds a sense of realism to the film. Still, this one could've been much better. Rated R: Graphic Language and Violence."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Break Through Pictures",
         "Subtitled Films"
      ],
      "summaries": ["Something awaits Tyler Jensen and his friends in the Hallettsville house. When Tyler's lifelong friends start dying, he must figure out a way to save himself, his girlfriend and the rest of the crew before the demons come."],
      "budget": 500000
   },
   "movielensId": 135949,
   "movielens": {
      "languages": [""],
      "releaseDate": "2009-03-05",
      "dvdReleaseDate": null,
      "directors": ["Andrew Pozza"],
      "runtime": 0,
      "movieId": 135949,
      "title": "Hallettsville",
      "mpaa": "",
      "actors": [
         "GiGi Erneta",
         "Gary Busey",
         "Derek Lee Nixon",
         "Katie Fountain",
         "Jordan Brower",
         "Aidan Marus",
         "Ellar Coltrane"
      ],
      "imdbMovieId": "0760169",
      "originalTitle": "Hallettsville",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "Something awaits Tyler Jensen and his friends in the Hallettsville house. When Tyler's lifelong friends start dying, he must figure out a way to save himself, his girlfriend and the rest of the crew before the demons come.",
      "tmdbMovieId": 9935,
      "avgRating": 1.75,
      "releaseYear": "2009",
      "numRatings": 2,
      "posterPath": "/i6AtodIwCt2tQa8NGDIIFqvEWYc.jpg"
   }
}