{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt1129381",
      "video": false,
      "title": "Lower Learning",
      "recommendations": [96378],
      "backdrop_path": "/jtmQLyTLHycl9vfL1wdxAL5NajW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tom Willoman",
               "gender": 2,
               "credit_id": "52fe457d9251416c750583eb",
               "name": "Jason Biggs",
               "profile_path": "/7CcISIHMvpzcUVo4NmxgA6f71RQ.jpg",
               "id": 21593,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rebecca Seabrook (as Eva Longoria Parker)",
               "gender": 1,
               "credit_id": "52fe457d9251416c750583ef",
               "name": "Eva Longoria",
               "profile_path": "/z18w0MSVXaI6caYVcnv2DYOg1WV.jpg",
               "id": 52605,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Harper Billings",
               "gender": 2,
               "credit_id": "52fe457d9251416c750583f3",
               "name": "Rob Corddry",
               "profile_path": "/k2zJL0V1nEZuFT08xUdOd3ucfXz.jpg",
               "id": 52997,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Laura Buchwald",
               "gender": 1,
               "credit_id": "52fe457d9251416c750583f7",
               "name": "Monica Potter",
               "profile_path": "/eHLvw07VvLiqDkacrsMhMj2lNzp.jpg",
               "id": 2140,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jesse Buchwald",
               "gender": 2,
               "credit_id": "52fe457d9251416c750583fb",
               "name": "Will Sasso",
               "profile_path": "/5Lz3WLWkgU04Fy4Xa0pjE5U53Wi.jpg",
               "id": 39125,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Turner Abernathy",
               "gender": 2,
               "credit_id": "52fe457d9251416c750583ff",
               "name": "Nat Faxon",
               "profile_path": "/vvT2BZrhz3AfeeOU3ECXtnDsufN.jpg",
               "id": 105648,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Nurse Gretchen",
               "gender": 1,
               "credit_id": "52fe457d9251416c75058403",
               "name": "Jill Latiano",
               "profile_path": "/g37gSAprjNV2NSNJHDdC2BbzEZn.jpg",
               "id": 180408,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Decatur Doublewide",
               "gender": 2,
               "credit_id": "52fe457d9251416c75058407",
               "name": "Kyle Gass",
               "profile_path": "/jSo0tKozbudF78NaR6DCNSXKSP9.jpg",
               "id": 22297,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Digdug O'Shaughnessy (as Hayes Macarthur)",
               "gender": 2,
               "credit_id": "52fe457d9251416c7505840b",
               "name": "Hayes MacArthur",
               "profile_path": "/seCypSY6hLZQRUL12jCYoiwClCN.jpg",
               "id": 74930,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Carlotta",
               "gender": 1,
               "credit_id": "52fe457d9251416c7505840f",
               "name": "Ryan Newman",
               "profile_path": "/Ag7e413NQrCyxpKhn52944JMJGY.jpg",
               "id": 57189,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Frankie Fowler",
               "gender": 2,
               "credit_id": "57df3da8925141785500ec84",
               "name": "Zachary Gordon",
               "profile_path": "/faiQPS0APY9Fb3xqW1a43mJyM4W.jpg",
               "id": 89819,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "57df3db292514135dc00a59e",
               "name": "Ed Helms",
               "profile_path": "/euQxeETzWnPUqu1vm4hGtFa7zPd.jpg",
               "id": 27105,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "57df3dc0c3a36812c600a358",
               "name": "Kiernan Shipka",
               "profile_path": "/k2nVQVHu3quZgQxkM0HGA1YuiVm.jpg",
               "id": 934289,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Sling Shot Kid",
               "gender": 2,
               "credit_id": "5a4c7ab80e0a2646cf006654",
               "name": "Nadji Jeter",
               "profile_path": "/cG48MotQHIvqIe6Vz82TiXXWFDz.jpg",
               "id": 587035,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457d9251416c750583e7",
               "name": "Mark Lafferty",
               "profile_path": null,
               "id": 74685,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe457d9251416c75058415",
               "name": "Shahin Chandrasoma",
               "profile_path": null,
               "id": 1047490,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457d9251416c7505841b",
               "name": "Mark Lafferty",
               "profile_path": null,
               "id": 74685,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.232014,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13577,
      "vote_count": 11,
      "budget": 0,
      "overview": "Barry Goldwater Elementary is on the brink of collapse: the lowest test scores in the state, teachers who are either drunk or having sex on school grounds, and a principal who extorts money from parents. It's up to Tom, the down-on-his-luck vice-principal, to rally the lazy teachers, expose the principal's corruption, and turn the school around before an end of the day board decision.",
      "similar": [],
      "original_title": "Lower Learning",
      "runtime": 97,
      "poster_path": "/OddlC6E22S5aHtmoVrfawFMCbX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2008-10-10",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.lowerlearningmovie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mark Lafferty"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Shahin Chandrasoma",
         "Mark Lafferty"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1129381/",
      "coverLink": null,
      "actors": [
         "Jason Biggs",
         "Eva Longoria",
         "Rob Corddry"
      ],
      "reviews": [
         "With a pretty good cast composed of Jason Biggs, Rob Corddry, and Eva Longoria-Parker, and an interesting enough storyline of a failing school facing closure by the schoolboard, I thought this actually stood a chance to at least toss out a few laughs. Unfortunately, two minutes into the film, it basically gave up on itself (I specifically note the fat kid farting while raising the flag up the pole). These days, especially living in California, I know what it's like to see failing schools due to grades and budgetary issues. . . unfortunately, this ignored anything even remotely interesting on these subjects and, instead, focused more on a bunch of annoying characters and a minimal & stupid plot. I'd suppose the only benefit of this film is to give hope to aspiring filmmakers that with a couple million dollars and a few connections, one can make a film with some reasonable stars and make some money from it. Other than that, avoid the film unless you literally expired every other option. Final Verdict: 3.5/10 -AP3-",
         "I worked in a 'troubled' school district for two years, and uh, a whole lot of this movie is a LOT more true than one might think; from experience, I mean, a teacher pouring booze in a coffee cup (yes), a PE teacher stashing porno in his locker-room office (yes), a pill-popping school inspector (yes). A lot of the small moments were, in fact, absolutely dead on. Things I've seen: an administrator strut into a parent's group in a $4,000 suit and tell them, \"I'm not here for missionary work\"; taking over a 2nd grade classroom while the recently-divorced teacher went to the break room and smashed furniture while screaming obscenities audible through the whole school, then coming back as if nothing had happened... However, the structure of this movie just didn't make it for me, and actually, while there are some awesome, laugh-out-loud (if black comedic and uncomfortable) moments in here, the whole just doesn't work. The overarching theme of corruption and etc. would have been, if the 'story' as such had been properly handled, unnecessary. Although I do question whether if, someone had actually done an accurate portrayal of just how demoralized and chaotic and just plain dirty schools can get, it's possible that 1) nobody would believe it and 2) nobody would find it funny except those who have lived it. So, 3 stars, mostly for the little pieces, and the brief moments with the kids (\"No, I can't hug you; lawsuits, remember?\" Yep, been there). At least SOMEONE made a movie about elementary school from the perspective of the staff. This isn't a good movie, but at least it's out there.",
         "OK, it is not \"dead poets society\" or \"good will hunting\". It is in reality much more like \"police academy\" for schools. That being said, don't expect high brow humor and you will be pleased. I went in with low expectations because it is a Jason Biggs film, and i was thoroughly pleased. The supporting cast his hilarious! They make the film. Eva Longoria Parker is great, as is Monica Potter. The cast is wonderful as burned out teachers, and the kids are great in their roles both as victims and as accessories. Another special standout in the film is the principle, Rob Corddry. He is hilarious as the sleazy con artist. It is worth your time, just don't expect high brow comedy.",
         "With 2 big names (Eva Longoria and Jason Biggs) playing leading roles in a satirical film about failing education; this film aimed to hit the higher targets. Yet, through a series of dead-end, awkward jokes and innuendos; this film failed to even meet the lower targets. This film only gains any credibility through the children's credible and compelling performances. Perhaps this film would have been better with an entirely child based crew working on its production\u0085like a more updated idea of 'Bugsy Malone'. Regardless; the plot lacked sequence and organisation, much of the acting was frightful at best and the incongruous plot holes allow me to rate this as the worst film I have ever watched. Lower Learning is as titled, lower learning.",
         "Either there's something wrong with me, or there's something wrong with all the viewers who gave it appallingly low votes. This movie was disturbingly hilarious. Period. And since IMDb is telling me that I am required to scribble more--although I had planned on ending the review at the preceding \"Period\"--I will go on to say this movie, which I doubt too many have ever heard of, deserves, IMHO, to have been a sleeper for whichever year it came out (2008, I believe). Its (to use a cliché) dark humor is so over the top that it surprised even jaded little ol' me--or maybe I'm not as jaded as think I am...and I'm really an innocent waif shocked by a movie which a genuinely blasé, cosmopolitan viewer would find merely perfunctorily cynical?",
         "Lower Learning is funny and a wild ride. From the teachers drinking to the principal having lobsters delivered to his office, you are in for a roaring good time. Within Lower Learning there is tons and tons of tongue and cheek humor, with is not only at times witty but also smart. With a cast like this I wish they would have let them do what they do best. Eva Longoria plays a role that many have never seen her in before and it is sort of refreshing. Jason Biggs is raunchy and full of laughs but the role seemed a bit stretched and unnatural. I also wish that it focused on the problem at hand and the whole film seemed a but rushed. If you are looking for a film that will make you laugh this one is it!",
         "Lower Learning is pretty funny, pretty cute and the kids in the film are awesome and adorable. If you like low-brow, feel good, quirky, maybe dumb-at-times movies then you will like Lower Learning. It is an easy watch that will make you laugh out loud a few times. All the characters, especially the kids and Rob Corddry are great. They are strong and each have a funny tid bit about them. While I don't care for Jason Briggs he didn't annoy or bother me in this film. Eva Longoria plays the inspector who has a weakness for any 'light' drug. You get to see Eva doing whip-its, which, let's face it, is funny. What else is always funny? Kids doing and saying adult things. Lower Learning is kind of like an extremely crude, not for kids version of Little Rascals and the Kindergarten Cop. It ends up being just as sweet and endearing, with an important message even if presented in a silly, maybe disturbing, way.",
         "If you're looking for a fun, no pressure movie that you can just sit back and relax with, this one's for you. Not the most complicated of plots, but certainly has its funny parts and charm. Rob Corddry is a comedic genius in my opinion, and I always enjoy his performances. This movie was no exception. Overall a good time, if you're aware of what you're watching, which is a simple comedic picture. Jason Biggs is his usual charming and good guy self. Many heart warming moments in the movie with him as the vice principal. Eva Longoria makes one of her first film debuts and fairs well. This movie blends a time tested element of comedy, which is juxtaposing small children and adult themes, so it goes without saying this one may not be for the kids. Just watch and try not to think about it too much, and you'll have a good time. The world needs more lighthearted comedies like this",
         "This title is definitely not making into any contest of best comedies ever, or best comedy of this year for that matter... Nevertheless, I've found it very amusing, and I'm not really sure why it is so though. One thing that did impress me was the way the cast played their roles. None of the comedians (or \"serious\" actors and actresses) is on my favourites list, but I'm glad to tell none of them has decayed on my concept after this movie. Specially Eva, which I've always thought of being a dumb actress from a dumb TV show, and now has raised to the level of my judgment to the point that I want to see her next movies - even more if it's a comedy. She certainly has some skills we'd never be able to see on Desperate Housewives. Kudos for Corddry, which has been just as surreal as his Daily Show's days suggested; and for Biggs, who finally seems to be getting free from the \"guy who f** the pie\" stereotype. Oh, just one warning (not a spoiler, I think) - if you're the kind of person who thinks children should be hermetically shielded from the adult world's dirtiest sides, you may feel a little bit offended with some scenes.",
         "Well, a waste of Cordry, at least. I really wish the writers and editors hadn't been lazy for this film, it coulda been funny. It was fimed well but thats not saying much when the material was lacking. It was a series of throwaway dark skits. Like, maybe, a bunch of deleted Upright Citizen Brigade scenes, not quite ready for the big show. A lot of the little story ideas were good but when they were put together for a full length film, they just didn't seem to work. Try again, writer/director guy, but this time, maybe write a better outline and make sure you know what you want the the audience to feel and, most of all, write BETTER jokes.",
         "Lower Learning is pure crap, plain and simple. I love Jason Biggs, but this movie has nothing hilarious about it. I was bored senseless through this movie actually, and don't recall laughing even once. Eva Longoria Parker may be famous due to her Desprate Houswives part, but I do not care for her at all. Surprisingly I enjoy trashy DTV stuff, i'm very open minded, but there is nothing what so ever, enjoyable about this. Rob Coddry's character as the principal is especially disgusting. Bottom line. Nothing much to view here. Spend your time on better comedies. 2/10",
         "If you really like Will Ferrell or Monty Python, you stand a very good chance of enjoying this ridiculous, subversive, offensive movie, which is much more original than mainstream Hollywood comedies such as Bad Teacher, and has to do with schools about as much as Scary Movie 3 had to do with crop circles. The Corddry role was written with him in mind and is the most consistently amusing thing I've seen him in. He's such a villainous school principal that he doesn't just have some lobster delivered on the taxpayer's dime, he revels in tearing apart the lobster suggestively and rather randomly while confusing Eva Longoria's character as to what he might be suggesting. Biggs is an ostensible good guy, although too apathetic to mind having a boy walk the railroad tracks for hours, again, as punishment for pouring gravy on another student. (But \"where did you get gravy at nine o'clock in the morning,\" he wonders, and the kid just shrugs, exactly as that kid would, and moving on....) People tend to suck a lot, pretty much of all us, and this movie makes fun of people for it, relentlessly and mostly creatively.",
         "This movie may have its flaws, its painfully awkward moments, and downright wrong use of children. BUT that is what make it so great. People who love the Office, will love this movie. People who can channel childhood and empathize with children, will Love this movie. I hate to see this movie being downgraded by uptight white people. People who work with children, or have ever been to a public elementary school will have a surreal, \"Oh My God I remember that\", feeling throughout this movie. One other review said the plot drifts too much, and it does, but it only makes the movie better, it gives it a whole new feel for the movie, it makes the viewer see that the school is a community. The whole time you are watching the movie you feel like you walked in when it was already half way through, things are unexplained, things are left unsaid, and as a VIEWER its your job to figure them out. Unlike every other second rate commercial film that likes to spoon feed its Zombie-like trance-state audiences. There was so many good things about this movie it out shined everything else, it was American Pie Elementary School Edition. If you think you can relax and laugh, WATCH IT.",
         "Lower Lesson had potential to at least be above horrible. The acting isn't actually that bad compared to your typical school films but it is the depth of the crudeness that sinks this film to the bottom. I could handle the principal's tasteless style because you have Biggs and Eva's characters to counter. The real problem is Monica Potter's character. I have to wonder if she fired her agent after this film. She is the worst teacher in film history unless you get into horror films where they are killing the little rascals. It is painful as ever. It is obvious that they shot her character without any actual kids in the room as you will not see any near her in most shots. After you see her and hear what she has to say you will know why. She rants at the kids with \"F U\" comments and every vile thing that could come from a person. It would be bad enough if these were high school kids but elementary? You have got to be kidding. I was really surprised considering Potter typically plays a good character. Anyway, the film has little going for it to counter the entire negative. You know it is bad when a supposed comedy weighs you down with guilt. Avoid this film at all cost.",
         "If you like Luis Bunuel films you will appreciate this totally bizarre story about a day at Geraldine Ferraro Elementary School. Make no mistake about it, this film is not for children! The person (my ex-wife) that I watched this with did not like it half as much as I did,the major complaint being what she thought was 3rd grade bathroom humour. Then again, she was never a big Bunuel fan either. I thought the writers and actors captured the spirit of the master very well. Some of the children, as well, were amazing! I'm still laughing about the scene where, what I would guess is a 6 year old, tells the Vice Principal that her daddy sings \"Social Worker, Social Worker. Come take Adele away\".",
         "Maybe too many people attended schools like the one this film makes fun of. Far funnier and more intelligent than the ratings and comments give it credit for. Whether it's because most people are sensitive about their education and they simply lack the ability to enjoy over-the-top satire or are over-sensitive to comedies about elementary school and young children, it's too bad they aren't as intelligent as the actors and writing involved in this film. Maybe the combination of graphic sex discussions and having a topic that appeals to parents pulled in an overly conservative crowd. It would make a good combination film with the documentary Nursery University.",
         "Not wanting to sound as if I'm infringing your god given right to your First Amendment, I want to let you know that you may watch this film, but it's better if you find something else to watch (or do) instead. This film is just isn't worth your precious time. The cast is star studded, but it didn't make the film enjoyable. With poor storyline, poor execution, and poor (or rather, non-existent) acting from the cast, this film is destined to be a disaster. With figures of around $2m of budget, one would think that the film can be something better, but unfortunately it was not the case. I went through the thread discussion and found out that they'd have to sell heaps of DVDs to recover the cost. And based on how things go, I do not think they can ever break-even. The only saving grace is Biggs, who have changed his character from being a nutter in his previous films, to somebody who can give substance and impact to the film. No more is he only known as the guy who f**ked a pizza. As for Eva Longoria, I think she acted better in her previous film (Over Her Dead Body), and I hope she chooses her character carefully before committing herself. All in all, not the best film around, and not a good film, as the film is aptly called.",
         "In complete honesty, this movie was not a complete waste of time, but it was with question not nearly as funny or as enjoyable as anticipated, and what was anticipated was nothing at all. This movie had a very small potential of being somewhat funny, it had some elements that could have created a good story, such as a very cute storyline with some very cute little kid actors. However, the movie was not a total wreck, there were actually some funny parts that actually made it possible to sit through the film, but the comedy was quite raunchy and at times just down right disgusting. If there is nothing, and I mean nothing, else for you to watch, then putting this on the TV is better than sitting doing nothing. But lower learning is definitely not worth spending money on. Do not expect to enjoy this film, no matter how much you like the actors. Just expect nothing, and then maybe you'll get something out of it",
         "For the reviewers that said \"those that reviewed this film low didn't like it because the graphic sex conversation offended them\" Well not for me, but maybe some. But even if the graphic sex was done correctly and so far the only person I know that would be able to pull off a movie with kids while adults discuss sex, etc would be Kevin Smith. Also there is good \"over-the-top\" and bad \"over-the-top\" this was bad \"under-the-bottom\" The kids in the movie do a decent job for the prediciment they were put in by their agents, or parents and their acting tried to save this movie, but I think they knew they couldn't save the movie if they stuffed it full of Hannah Montana money. For the adults with the exception of Biggs, my CAT could act better than the rest of the adult cast. I actually for a moment thought that Biggs at one point was going to break out a pie and do nasty things to it, honestly. Yeah sure maybe its my not so subtle attempt at humor and making fun of this movie, but seriously my joke was AT LEAST ten times better than this film, that I can assure you of. The poor children were put in odd, awkward situations almost as if the Director said okay now, improvise, and the kids are like \"seriously?\" so the director saws : Say \"c**k S**ck*ng Mofo. The kids are like \"um, OK.\" The first ten minutes were funny. Scenes like Biggs and Fowler in the parking lot, when you first see Billing in his office, etc. I actually though the kid farting while raising the flag was a bit funny. For me was Potter's character is when this movie started heading south. I worked in a Family Health Club and at a teen center and heard more vlugar stuff than anything going on in this film and most of the kids were YOUNGER than those in this film. That was scary. What's scarier is that I actually had to watch a movie that seemed to be based on those things said. So no, it's not offensive, but it was certainly scary. I was expecting a comedy. Now I question those that wanted to make this film. This is just one man's opinion, but there seems to be consensus with the majority on this board as to why and how this film got made. Yeah we know \"how\" money, but why. Satires are supposed to be funny not create a lot of bad awkward silence with the actors. I could have sworn I saw a couple times the kids look off camera to the director looking \"you want me to what?\" This movie has replaced the Avengers as the worst movie I have ever seen.",
         "It opened up funny. It opened up with a unique look at school. Then it seemed to disappear somewhere into strange and stupid land. Then the humor came back for a while. Then it disappeared again.. It has moments of being really good, then all of a sudden loses everything again and becomes a wreck. Sometimes the scenes were downright stupid and senseless and the acting was horrible and the dialog was outright stupid and boring and useless. Other times the scenes were horribly insanely funny. I think you might enjoy it more if you're not sober.",
         "\"Lower Learning\" is one of those annoying movies that thinks it's so much more clever than it actually is. The kind of movie that thinks every single line of dialogue is supposed to be a Tarantino-like one-liner that people will be repeating for the next couple of decades, we'll figure out less important stuff like plot and characters later on. Well, guess what: Mark Lafferty isn't quite Tarantino, and everything about this movie is so laughably forced that it almost becomes unwatchable. How long did it take these people to even find actors willing to utter lines like \"we have to be as quiet as a fairy fart\"? Honestly, just let that line sink in for a while. If that made the final script, I don't even want to think about what lines might have been cut (if any). If you can't write a decent line of dialogue to save your life, you probably shouldn't transform more than half of the scenes into long conversations that barely have anything to do with the actual story. Through the power of trial and error the movie does occasionally stumble into a territory where it's almost good (the \"they get detention!\" scene has a peculiar charm to it), but these moments are way too few and far apart to make me stop hating this movie. Garbage."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Ambush Entertainment",
         "Starz!"
      ],
      "summaries": [
         "Geraldine Ferraro Elementary is on the brink of collapse: the lowest test scores in the state, teachers who are either drunk or having sex on school grounds, and a principal who extorts money from parents. It's up to Tom, the down-on-his-luck vice-principal, to rally the lazy teachers, expose the principal's corruption, and turn the school around before an end of the day board decision that is certain to lead to its closure.",
         "Geraldine Ferraro Elementary vice principal Tom Willoman, a life-long screwup without any self-confidence, feels his professional life is over when the school inspector, former schoolmate Rebecca Seabrook, warns her report will almost certainly mean the end of his school. However they agree to find out what the arrogant, suspiciously unconcerned principal Harper Billings is up. They discover his abusive practices towards pupils, de-motivated staff and blackmailed parents culminate in a real estate plot. Tom spearheads the counteroffensive."
      ],
      "budget": 2000000
   },
   "movielensId": 135969,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-10-10",
      "dvdReleaseDate": null,
      "directors": ["Mark Lafferty"],
      "runtime": 97,
      "movieId": 135969,
      "title": "Lower Learning",
      "mpaa": "R",
      "actors": [
         "Jason Biggs",
         "Eva Longoria",
         "Rob Corddry",
         "Monica Potter",
         "Will Sasso",
         "Nat Faxon",
         "Jill Latiano",
         "Kyle Gass",
         "Hayes MacArthur",
         "Ryan Newman",
         "Zachary Gordon",
         "Ed Helms",
         "Kiernan Shipka",
         "Nadji Jeter"
      ],
      "imdbMovieId": "1129381",
      "originalTitle": "Lower Learning",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Barry Goldwater Elementary is on the brink of collapse: the lowest test scores in the state, teachers who are either drunk or having sex on school grounds, and a principal who extorts money from parents. It's up to Tom, the down-on-his-luck vice-principal, to rally the lazy teachers, expose the principal's corruption, and turn the school around before an end of the day board decision.",
      "tmdbMovieId": 13577,
      "avgRating": 2.07143,
      "releaseYear": "2008",
      "numRatings": 7,
      "posterPath": "/OddlC6E22S5aHtmoVrfawFMCbX.jpg"
   }
}