{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [],
      "runtime": 168,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0297120/",
      "coverLink": null,
      "actors": [
         "Marguerite Moreau",
         "Malcolm McDowell",
         "Dennis Hopper"
      ],
      "reviews": [
         "Could've been better, but could've been worse. I'd say my interest in and longtime hope for a sequel to \"Firestarter\" made me enjoy this film. I wasn't totally disappointed, but my biggest pet peeves were that the flashbacks didn't match up with the events of the first film (Manders Farm, Vicky and Andy's deaths) and the fact that Rainbird was supposed to be dead. Could've been a lot worse though and for a miniseries this wasn't bad. A lot of the new characters make you wonder, though, and I could see why Drew Barrymore decided not to do this miniseries. Marguerite Moreau had some big shoes to fill and she didn't do too badly imo. I wonder though if things would have been different if this had been planned as a feature-film instead of a miniseries.",
         "What the heck was this movie?? A rejected script for X-Toddlers?? That is the only thing that i kept asking myself through out the long duration of this horrible thing. I must admit that i have never read the book, but i am a fan of the original film. This film ALL but erases the existence of it. Let's change the entire ending of a movie and make another and call it a sequel. That is exactly what has happened here. With the additions of the little village of the damned mutant children making it so far out there it was borderline comedy. The two good things out this film were the actress who played Charlie who was actually a good actress, just the wrong film for her. Danny Nucci was good as always. But they could not save this horrid thing. Stay away from it or you will wish you were set on Fire.",
         "The Sci Fi Channel almost had a hit with \"Firestarter: Rekindled.\" Almost. For those who read the Stephen King novel or has seen the 1984 movie version of the novel with Drew Barrymore, stop right where you are. They have taking a HUGE liberty with both. In the novel, there were only 3 remaining subjects of the Lot 6 program (Charlie's parents and Richardson). This version has an agency that is bumping off the original participants by promising a cash settlement from the program. Danny Nucci plays Vincent Sforza, working for the agency in finding these people, although her doesn't know what happens once they're found. One of the people on the list is Charlie McGee, now a young woman (Marguerite Moreau). Seems that Charlie has some issues of her own. Whenever she gets \"excited,\" she gets VERY hot, so hot that things catch fire (In one instance, she smolders an entire hotel room). She's also been living her life on the run ever since her parents were killed by the government agency known as The Shop. One of their operatives, Rainbird (Malcolm McDowell), wants Charlie, even after she turns him into a charred lunatic. He wants Charlie bad enough to kill (And he likes using a pencil as a weapon!). He's also done something else with the Lot 6 experiment: 6 boys with individual powers (One is an energy vampire, another with a killer voice)that are being used to create an ultimate weapon. A lot of questions were left unanswered: What happened to The Shop and the Manders? There are a lot of plot holes: Are we supposed to swallow the fact that Rainbird who, in both the novel and 1984 version was burnt to a crispy critter, yet manages to survive without looking MORE disfigured? And what's the thing with Richardson(A bored looking Dennis Hopper)? He doesn't really serve any real purpose other than to claim that he knows what's going to happen. They recreate Charlie's early story rather than use the footage from the original to keep the story in balance, also changing her parent's fate. If you could get over these problems, then you could really enjoy the film on a decent level. If you're a purist of the novel and the 1984 version, then you are going to spend all of your time picking the film apart. The saving grace is the 6 boys. They don't know the real story behind Rainbird, that they could possibly end up in the same situation as Charlie.",
         "How can a mini-series be so good for the first half and be so awful for the second? The first two hours pick up where the Stephen King novel and associated movie leave off, only ten years later. Character development is generally good, and Marguerite Moreau is both easy on the eyes and the ears. But-- the second half of the show is terrible. Pointless dialog, nonsensical action and plot holes you can drive a truck through. Don't even bother with part 2, just watch the first part and learn to live with the cliffhanger ending.",
         "Originally airing as a Sci-Fi Channel original movie/mini-series, \"Firestarter 2: Rekindled\" is the only sequel to \"Firestarter,\" a little horror movie from 1984 that was based on a Stephen King novel and starred a very young Drew Barrymore as the title character. Arriving 18 years later and stretched out to nearly three hours, \"Rekindled,\" re-writes history, re-making the previous film through flashbacks as it goes along. To say it takes liberties with its source material would be an understatement. Since this is 2002, and Drew Barrymore has better things to do, the role of Charlie McGee has been re-casted with Marguerite Moreau, who will certainly ring a bell to fans of \"The Mighty Ducks.\" Malcolm McDowell of \"A Clockwork Orange\" fame steps into the shoes of George C. Scott and looks even less Native American as John Rainbird, the manipulative megalomaniacal psychopath who exploited Charlie in the past and who, like Sam Loomis in \"Halloween,\" can't shake his past obsessions, no matter what cost it comes at. Aside from spending the first half catching you up in case you didn't see the first movie (and offending you by assuming you are stupid if you have), \"Rekindled\" finds there to be more survivors of the \"Lot 6\" program, which used human beings to test mind-expanding drugs, which had an adverse effect on their psychological well-being. It's the job of Vincent Sforza (Danny Nucci) to track these people down so they can receive the rewards of a class action lawsuit (a.k.a. a brutal and swift cover-up death) and once he realizes something is awry, helps Charlie once again escape the clutches of Rainbird and his cronies, as well as fending off a group of genetically engineered \"Super-Kids,\" who serve merely as plot devices and filler. Also, there's Dennis Hopper as a tortured psychic who was obviously only written into the script so that his name could appear in the credits, possibly lending credibility to this sequel. All these little sub-plots do well enough to pad out the length of the \"film,\" but for the most part, it follows the same \"fox on the run\" formula of the first. The flashbacks which serve to remake the first movie tend to bog things down and, in the end, are unnecessary and unfortunate. The fact of the matter is, for this movie to exist, nothing in the first movie needed to be re-written. The flashbacks were unnecessary because not only did they not add to the narrative at hand, but also because anyone watching a TV-movie/sequel should have at least seen the first movie or read the book. Thankfully, though, for a TV-movie, it's actually quite entertaining, despite some cheesy moments and obvious padding. There's a good hour that probably could have been cut from the flick, and it would have been all the better for it. On the upside, Marguerite Moreau is a nice replacement for Barrymore, even if she looks and acts nothing like her. Malcolm McDowell hams it up a bit, but at least gets into his role enough so that you believe he is truly insane. Dennis Hopper shows up, reads his lines and drives off, but his presence is still noteworthy. For a fan of the original \"Firestarter\" who doesn't mind seeing it violated just a bit, \"Firestarter 2: Rekindled\" serves as a nice way to kill a rainy afternoon. View it with a grain of salt, and you will find that despite its limitations and short-comings, it's actually not all that bad for a TV-movie. Truth be told, if they had billed the movie simply as \"Firestarter: Rekindled,\" dropping the \"2,\" the results would have been less offensive and it would be suitable as more of a remake than it is a sequel. Think of it as an overblown piece of fan-fiction on the small-screen, and it has its merits.",
         "Being a huge Stephen King fan I recently read the book Firestarter, and today rented Firestarter 1 and 2 at Blockbusters out of curiosity. Firestarter 1 was good, it stuck with the book's plot, it changed a few minor details and cut a few scenes as expected but much of the actual dialogue was just as the book word-for-word.... however when I put Firestarter 2 in the DVD player, I was cringing at every detail, the information isnt accurate, it's made a complete mess of the original movie, the flashbacks to \"what happened\" were totally different, everything from the way her mother was killed to what happened at the Manders Farm. If you've never read the book or seen the first movie, you'll probably like it, but once you've read the book and gotten attached to the characters, you'll find this movie a huge disappointment.",
         "A Minor Spoiler In the 80's, Stephen King's Firestarter was a successful movie in Brazil, with the lovely Drew Barrymore. However, this sequel is horrible: bad actors, senseless screenplay and a waste of unnecessary special effects. The name of Malcom McDowell in the credits is a synonym of a bad movie. Remove the wonderful 'A Clockwork Orange', 'Cat People' and 'Star Trek Generation' from his extensive filmography, and what rests? Danny Nucci keeps a dummy expressionless face along the whole story, no matter what he is doing. Charlie (Marguerite Moreau) seems to lose control of her power only when having sex. And why destroy the whole town in the last scene? Wouldn't it be enough to kill her enemy John Rainbird? Dennis Hopper keeps his arms down in the most of his scenes. Does he have a problem with his arms? My vote is five. Title (Brazil): \"O Jogo dos Espíritos\" (\"The Spirit Game\")",
         "In both the book and the first movie, John Rainbird is quick-fried by Charlie...old boy is deader than Dubya's chances of re-election! The book also describes Rainbird as a Native American; correct me if I'm wrong, but neither George C. Scott (in the first movie) nor Malcolm McDowell (in the second) struck me as even trying to look Native American!!! Now, are we to believe that you can look like the guy who played Patton, get quick-cooked, and come back looking like the guy that killed Captain James T. Kirk? Are we also to believe that you can have an accent of one who hails from Wise, Virginia, get roasted, and suddenly have the accent of one raised in Leeds, England? Just how MANY Native Americans raised on the reservation have British accents, anyway?",
         "I've seen worse . . . and I've seen better. It's actually a decent sequel, especially considering it came almost 20 years after the original, but still it's far from perfect. My biggest gripe would have to be the continuity flaws in the flashbacks; instead of flashing to footage from the original film, they shot some scenes to custom tailor to this film's needs . . . I can kinda understand the reasoning and wanting to be consistent with style. But the flashbacks don't always line up with the story told in the first film (at least, what I remember of the first FireStarter film). Next, despite being 4 hours long, you never seem to get close to the characters. The narrative too frequently jumps from character to character to get the plot across that it never seems to stick long enough to make you sympathize with anyone, and when we do see them it's filled with lots of plot/character cliches that we expect from your typical story. It's really a shame since the cast seems very capable of diving much deeper. Hopper's character is seen least, and interestingly was most memorable and deep in my mind. His quirky personality and looped speeches about the illusion of choices given in an almost ominous, allknowing (but reluctant) way . . . as good as the other actors are in this film, Hopper makes the best of the screen time he's given. His character has the Oracle essence that the Matrix films so desperately need. Mixed feelings about the children . . . I do like the idea of the experiment on children and especially Cody's power. I didn't like how they felt like the little freak-show gang waiting to have a West Side Story brawl with Charlie. I think it would've been more effective with just Cody, or Cody and one other. The rest of the Children didn't add anything significant to the story line and just took up valuable development time. The ending I didn't much care for either. Though the inferno was fine, the build up was all wrong. They could have pulled that ending off if some key changes were made, some key people surviving. I thought it would have been more interesting in Cody's obsession with Charlie's power threw a wrench in the works of Rainbird's plans and his own obsession. In the end, I think it suffers from trying to do too much, cover too many characters, and really fails to convince us that what does happen can happen. (Charlie's sex life, for example). I think a few critical cuts and development changes would've made the climax work much better. That's not to say Firestarter 2 is bad, it just doesn't quite hit the mark. The cast does well overall, the music is several notches above the first (as much as I like Tangerine Dream, this one's better.) -J",
         "Spoilers herein. This is an ordinary story told in an ordinary way. Pretty tepid stuff. As the story goes on, Charlie's hair gets less and less red, as if it had started browning from her first experience with Rainbird. The red was stolen by Dr. Wanless and transferred to his wife. You can see the same effect with Mary Conant as well. Dennis Hopper here in his most natural role since `Apocalypse Now' both roles are him. He has a really cool negotiating session with the dastardly Rainbird. Its a very clever piece of time folding. How do you try to coerce with a man that knows the future. Other than that, this is a waste of time. Ted's evaluation: 1 of 4 -- You can probably find something better to do with this part of your life.",
         "Firestarter II is about the adventures of psychic Charlie McGee (Marguerite Moreau, Drew Barrymore's character from the first film) who is pitted against the evil John Rainbird (Malcolm McDowell) and his band of evil psychic children. Unlike the first film, this one deals primarily with \"Evil Corporation With the Sole Purpose of Murdering People\" rather than \"Government Conspiracies With the Sole Purpose of Killing off Government Researchers\". The film is not as special-effects heavy as you might be led to believe from the previews, and pretty much all the special effects used are of fire, and generally fire making things explode. In one scene, fire even knocks bullets out of the air. Go fire. Tension \"Develops\" between Moreau's and McDowell's characters through about three dozen identical standoffs. You'll be able to guess the dialogue for each one after the first. Also, the writing of pretty much any scene in the movie with Dennis Hopper is a horrifically bad attempt to back-fill plot holes. Fortunately, these scenes aren't very long. The only really memorable performances are Vincent's (Danny Nucci) limping around acting clueless and Malcolm McDowell's shambling around scowling at things. The ending of the miniseries seems almost solely purposed to leave this WAY open for any sort of sequel(s). This might seem like an odd treatment for an 18 year old not-particularly-popular film, but it IS the Sci-Fi channel.",
         "I really liked the whole thing, and was pleasantly surprised - I was half-expecting a sloppy horror movie without much of a plot. Not at all. Malcom McDowell is always good, here as elsewhere, and he was appropriately frightening, in that insanely calm, logical way. Moreau was good, too, and played very nicely off the others as well. I was very pleased with the whole thing. It had enough scary stuff in it to make it fun, and it was creepy at times, and we got a little romance along with it. What more could you want?",
         "Is this movie even an official sequel? I ask so because this movie totally ignores events from the previous movie and simply blatantly even alters things. This movie is filled with some flashbacks, that however don't make any sense when you have already seen the first movie. It completely ignores some fact from the first movie as well as actual moments that we did see happening. Who knows, perhaps this is all more faithful to the actual Stephen King novel but just don't call your movie \"Firestarter 2: Rekindled\" when you are taking a totally different approach with the story and completely ignore the stuff from the earlier 1984 movie. \"Firestarter\" had a pretty much closed ending. All of the bad guys died and Charlie McGee eventually ended up well. But guess what, apparently the bad guy didn't die at all. He just altered. He now suddenly looks like Malcolm McDowell with a half burned face, instead of George C. Scott, who played the villain John Rainbird in the first movie. But if you have seen the first movie you know that it's pretty much a solid fact that there is no way the character could still be alive, or at least could definitely not look as 'well' as Malcolm McDowell did. It reminded me of the way they brought back the Durant character in all of the Darkman sequels. Couldn't they simply come up with a fresh new villain? But this is the foremost problem with this movie; it's a sequel without any imagination or good ideas. Here you have a movie in which your main character has the ability to put everything on fire with her telekinetic powers, as well as a bunch of other persons with X-Men like powers. Plenty of awesome ingredients and potential to play around with you would imaging but strangely enough the only thing they could come up with was letting the main character accidentally put stuff on fire every time she was getting too excited during sex. So great, she can never have an orgasm. An excellent subject for a science-fiction/thriller, you guys! They really didn't come up with anything good or exciting, which is really the most disappointing thing about this movie and its story. But I still don't really know either what the main plot was supposed to be all about. Why does John Rainbird want to create super humans? And why does he need Charlie McGee for that so badly? What makes her so exceptional? Even though the movie is about 3 hours long (it can also be aired as a mini-series) nothing is really ever explained well enough, which also makes this movie a real unsatisfying one by the end, as well as just a pointless sequel and movie in general. Also really don't understand why Dennis Hopper showed up in this. He plays a real boring character, that also really doesn't add anything to the story and could easily had been left out. It also would had been nice if they actually cast someone who somewhat looked like Drew Barrymore, who played the main lead in the movie but instead they casted brunette Marguerite Moreau. The acting in this movie was not all that bad though, which probably prevented it from ever becoming a truly bad and ridicules one. No, I really don't want to sound like I completely hated it. It's definitely watchable all, in the long run. You probably have seen way worse than this movie but a better story should had really made this movie at least somewhat remotely exciting and original to watch. You're really way better off watching just and only the first movie, which wasn't even that great of a movie in the first place either. 5/10 http://bobafett1138.blogspot.com/",
         "I couldn't believe it! They TOTALLY REWROTE the ending of Firestarter 1, to accommodate this piece of trash! The movie would've been fine. I would've even settled for Skye McCole Bartusiak *shudders* as a stand-in for Drew. Not that she could've ever hoped in a million years to fill her shoes. But to bastardize the original movie that the fans have come to love, just cheapens this already shaky film. Marguerite Moreau was a disaster as \"Charlie\" McGee. Her character was hollow and as plastic as a Barbie\u0099 doll. Her performance was hesitant and off the mark completely. The only thing good I have to say about this \"sequel\" is that the effects were believable, but that doesn't begin to redeem this horrid waste of film. So disappointing to have them rewrite the ending of 1 like that. If they hadn't done that, I might could have liked it. It gets a sorry 0.2/10 from... the Fiend :.",
         "This movie was nothing but an excuse for violence. I'm glad they created their own flashbacks because it separates this trash from the original (book and movie). In the original, Lot 6 was nothing but a variation of a hallucinogen that went terribly warped. Rainbird was nothing but a hit-man with a fascination about death. He didn't care about Charlie except for what he imagined he would be able to see in her eyes when she died. In this trash they made Rainbird the head honcho of the Lot 6 program and stated that it was all on purpose. The whole storyline made no sense. They managed to get a couple of big names who must cringe when they see how the movie came out. What a waste of time. I missed perfectly good reruns to watch this. I stuck with it, hoping it would get better but it only got worse.",
         "I have seen the original 1984 version of 'Firestarter' and loved it. I was as young as Drew Barrymore. It was my favorite movie in 1984. Now, I have seen the new version 'Rekindled' and also loved it. Marguerite Moreau is great in it. She was great in \"Queen of the Damned\" too. I love Stephen King, always have. Pretty much read and seen all of his movies/books. Anyway, I'd like to see this become a regular series. There is so much the producers and directors can do with it. With the new kids with new powers, what happens to Charlie now, and what new problems can arise for her to confront. Don't stop at the mini-series! Make it a series. The ratings could go off the chart. Give it a try! I have visited SciFi.com and posted the same message. I'll do anything to see this a series! Tanya Arizona",
         "I am not saying Firestarter II is a bad movie, but I think the premise was poorly thought out. Whoever was in charge of writing the plot/ storyline, obviously did not do their research. Anyone who creates a sequel should try to be as accurate as they can with elements from the previous film. When they had flash backs to when she was child (from Firestarter) they did not have scenes from the previous film but instead they made new scenes that were not what happened in the first film with different actors, different scenery, and not even the same premises. My friend and I were so disappointed, it was so long and didn't make any sense after seeing the 1st film. And I have never read the book but my friend said that the 2nd film isn't accurate with the book either. I just recommend if you are going to watch Firestarter or Firestarter II, I would pick one or the other to watch. Don't watch both of them. Unless, you want to be disappointed!..",
         "Watched this movie today from the \"Firestarter- The Franchise Edition\" ( A 2 Movie set with both the original, & the Sequel. My comments are reflective of the sequel- Firestarter 2 Rekindled. I don't even understand why this movie was made. It is way too long, has some of the worst acting and story plot I've ever seen. It neither follows the book or the established storyline laid out in the first movie. It is so bad that I just bet the Producers of the First movie absolutely refused to allow them to use any footage in the flashback segments, which the details of the story were greatly changed. Also the part of the villain- John Rainbird goes from a brutal assassin with devious charm, to some kind of Pencil stabbing Hannibal Lector. It just didn't work for the part of that particular character. Also Charlene sure takes quite a while to unleash her powers and \"free herself\" from the unrelenting agency that has tracked her down and killed everyone and everything she ever cared about. Just a bit hard to swallow. I just kept asking myself and my wife..... How much of this movie is there left???? That is never a good thing!",
         "I was totally disappointed when I watched this film. This sequel in my opinion does not do the first movie nor the book any justice. If the film industry read the book and also took references from the first film properly and did a decent story, and had Drew Barrymore in it, the film may have been spectacular. In my view, this film just insulted the book, the first film and the fans of them. Rainbird was killed in the book and in the first movie. He should not of been brought back to life. As for the relationship between him and Charlie in this film in my opinion is stupid as he killed her father in the 1st movie and in the book. I felt I was let down and betrayed after watching this film. Oh yes, and they should of stuck to Drew Barrymore playing Charlie McGee. Is it really a wonder why she didn't???????",
         "When I found this movie I thought it was a sequel to \"Firestarter\", 1984, a movie that adapted a Stephen King story. However, after watching, I had doubts about whether to consider it a sequel or a remake. My doubts rest on the natural comparison between both and the realization that this film has broken any relation to the events of its predecessor. However, it is undoubtedly intended to function as a sequel. The whole structure of the script fails because it was based on real quicksand, and this ends up ruining the film. Malcolm McDowell is the most famous name of this production, having done a reasonable performance, according to what was requested and the garbage that he has received to work. The remaining actors did what they could but could not save the movie from being disastrous. More disastrous still: the protagonist, who dominated relatively well her power in the first film, is now reduced to a teenager who sets things on fire during sex. Is it some kind of pun with the expression \"to have fire under the skirt\"? Very funny...",
         "I was really disappointed with the boring start to the movie to the boring end of it too. I was expecting a better cast too, like the original cast from the first movie. Despite loving Drew Barrymore's acting in the first FireStarrer I thought I would give this a shot. The storyline made NO sense, going back to the first movie and not exactly being accurate left me very annoyed as it could have been done heaps better. The special effects are pitiful, cheap and nasty just like the acting. 2/10- one of the worst \"Stephen King inspired\" movies. He would be rolling in his grave if he knew his novel would be such a terrible film.",
         "I was never a fan of the first Firestarter (1984). I thought it was highly melodramatic, Drew Barrymore was a whiny brat and the only good side was the amazing soundtrack by Tangerine Dream. I highly doubt I'll enjoy the supposed 2015-16 remake, either. However, I loved King's Firestarter novel, and thought that maybe this would be a different experience... Man, I should've known better when I found it in a bargain bin at the local Dollar Store. Technically Rekindled was a TV miniseries, incredibly and unnecessarily long but somehow it was fit onto a DVD. It features the now college-aged Charlie as she researches her pyrokinetic abilities. Meanwhile an old enemy whom she assumed was dead long ago has come back, with a whole new gang of kids, and each kid has a \"wild talent\" all their own. The actress who played Charlie herself was pretty pathetic, and her character was obviously designed to appeal to pervy guys. There is one pointless scene where she has sex on the roof of a random guy's car (no idea who the guy is, is she a prostitute?) and making love makes her want to go burn down some buildings. What the...? Also, as a kid the nickname Charlie (Charlene) might be \"cute\" but you'd think that as an adult she would no longer be going by Charlie. The annoyingly bad CGI, obvious green screen, sex comments that took away from the story, lousy soundtrack and generally bad acting built up to the point where by the end of the movie I had already made plans for the bonfire. I was very lucky to be burning the DVD's of that god-awful Hunger Games series crud the same day, so Firestarter 2 really \"rekindled\" the burning movie heap of bad ones in my backyard. I would've sold it except I doubt anyone would've bought it. Firestarter was good enough on its own in 1984, the sequel here and the supposed upcoming remake is all just garbage and a cliché attempt to interest people with the plot of psychic powers. I don't recommend watching this, and if you decide to, well, I wish you the best of luck in not having a breakdown right in front of your television.",
         "Marguerite Moreau takes over the role of \"Charlie\" McGee from Drew Barrymore, playing the now grown woman who is still on the run from sinister government forces determined to use her mental fire making abilities for their own ends, especially John Rainbird(now played by Malcolm McDowall) who has continued his experiments with a group of boys, whom he plans on using to take over the world... Strange sequel foolishly tries rewriting the climatic events of the first, in order to explain how Rainbird is still alive, despite his apparent demise there. Story goes on far too long, and isn't at all interesting; Though both Moreau and McDowall try their best, this misconceived sequel falls totally flat.",
         "OK I'm a little sketchy on this whole storyline. I have read the book one time, and it was ages ago. But Charlie as a child, hated starting fires, and hated it worse when people were hurt because of it. And since when can a man who was turned into charcoal(Rainbird) come back from the dead? She totally toasted his sorry butt, and in this sequel he's back with little brat minions? WTH??!!!! When I first saw this movie I thought it was good, but now I'm starting to see that it's just another piece of crap that should have been BURNT!!!!! Only reason I bought it is cause it came in a 2 disc package with the original.Wonder what Stephen King thinks of this garbage does anyone know? Cant believe these people get away with horrible stories like this. And what's worse it doesn't do Drew's Charlie justice at all.",
         "Too bad. I loved the book, and liked the original movie. As many others have commented, the script is so poorly done, with so many holes, that some pretty good actors are wasted. Just one example **possible spoiler**: after struggling for the entire four hours to avoid using her powers at all, she goes ballistic and kills innocent people left and right, before killing the man she really hates, who's standing vulnerable right in front of her? From the looks of things, even Marguerite Moreau (hot, yes!!) had trouble convincingly acting this part of the movie out. It totally makes no sense, like so many other things in this screenplay, too numerous to detail. A shame, I really enjoy excellent sci-fi action movies, eg, \"Pitch Black\". The writers simply tried to load too much into this movie. They shoulda Kept it Simple, Stupid. It probably would have made a much better film."
      ],
      "genres": [
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "USA Films",
         "Traveler's Rest Films",
         "USA Cable Network"
      ],
      "summaries": [
         "Charlie McGee is a young woman with the unwanted and often uncontrollable gift of pyrokinesis, lighting fires by mere thought. Charlie has been in hiding for nearly all her life from a top-secret government fringe group headed by the maniacal John Rainbird, who wants to find and use Charlie as the ultimate weapon of war. Vincent is a young private investigator unwittingly sent to look for Charlie, and evenutally tries to help her escape from Rainbird, who has formed a group of young boys from other research projects -- each with different special abilities -- in a plot to take over the world.",
         "Vincent Sforza works for a research company, and he has been put in charge of locating several people who were part of an old experiment from the 1970s, in which a group of college students were given a dose of a chemical called LOT-6. Apparently, the victims of the experiment have won a class action lawsuit and need to be found so that a check can be issued.  Included on the list is teenager Charlene \"Charlie\" McGee, the child of two of the dead participants in the experiment. When Charlie was a kid, Charlie's mother Vicky was murdered by thugs who worked for the Shop, the corrupt government department that wanted to do experiments on Charlie. Charlie's father Andy was killed by John Rainbird, a killer who had been hired by the shop. Ever since then, Charlie has been in hiding to protect herself. When Vincent finally locates Charlie, he sets into motion a deadly series of events. It turns out that there really isn't a class action lawsuit settlement.  It seems that John Rainbird, who was thought to be burned to death, is still alive, scarred from the burns, and nutty as ever -- and he's looking for Charlie, because he's still obsessed with her. Rainbird has been using the lie about a class action lawsuit to lure the original LOT-6 experiment's victims out of hiding so these victims can be killed one by one. Charlie gets help from James Richardson, one of the victims of the LOT-6 experiment. The experiment has given James the ability to tell the future. When Vincent discovers that he's been duped into luring Charlie back to Rainbird, Vincent also decides to help Charlie. John's been working on perfecting the LOT experiments, and has created 6 young boys with powerful abilities. One has the power of suggestion, another can sense truth and deception, two can move things with their mind, one has the destructive voice from hell, and the most dangerous is a boy who can suck the life and energy from anybody or anything. And they're after Charlie. Rainbird is also using these children to rob a bank as a test of warfare in the new decade. Now with Vince and James on her side, Charlie must decide whether to keep running, or fight Rainbird to the end.",
         "A young woman who has the ability to start fires with her mind, must now face the trauma of her childhood by battling with a group of very talented children and their cruel leader, John Rainbird."
      ],
      "budget": 10000000
   },
   "movielensId": 135939,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-03-10",
      "dvdReleaseDate": null,
      "directors": ["Robert Iscove"],
      "runtime": 168,
      "movieId": 135939,
      "title": "Firestarter 2: Rekindled",
      "mpaa": "",
      "actors": [
         "Marguerite Moreau",
         "Malcolm McDowell",
         "Dennis Hopper",
         "Danny Nucci",
         "Skye McCole Bartusiak"
      ],
      "imdbMovieId": "0297120",
      "originalTitle": "Firestarter 2: Rekindled",
      "genres": [
         "TV Movie",
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "dnGR_FldNeg",
         "Mbep3cTWwSo"
      ],
      "plotSummary": "Charlie McGee is a young woman with the unwanted and often uncontrollable gift of psychokinesis, lighting fires by mere thought. Charlie has been in hiding for nearly all her life from a top-secret government fringe group headed by the maniacal John Rainbird, who wants to find and use Charlie as the ultimate weapon of war.",
      "tmdbMovieId": 19792,
      "avgRating": 2.53846,
      "releaseYear": "2002",
      "numRatings": 13,
      "posterPath": "/yW8kkPkviF6ZjLIuC4RV1sFxsUl.jpg"
   }
}