{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0099935",
      "video": false,
      "title": "Killer Tomatoes Strike Back!",
      "recommendations": [
         36896,
         23205,
         33303,
         177229,
         20468,
         289040,
         61640,
         25690,
         83412,
         49225,
         32013,
         129385,
         27743,
         19809,
         55066,
         5248,
         15482,
         184710,
         48288,
         15901
      ],
      "backdrop_path": "/7oUmgVNiVGVIrczO1zFHOdVAspM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kennedi Johnson",
               "gender": 1,
               "credit_id": "52fe460a9251416c9104705f",
               "name": "Crystal Carson",
               "profile_path": "/uElWCFsHuEjhwgJgvwOw4g9o6IQ.jpg",
               "id": 121809,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Igor",
               "gender": 2,
               "credit_id": "52fe460a9251416c91047067",
               "name": "Steve Lundquist",
               "profile_path": null,
               "id": 121816,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Charles White",
               "gender": 2,
               "credit_id": "52fe460a9251416c9104706b",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Jeronahew/Prof. Gangreen",
               "gender": 2,
               "credit_id": "52fe460a9251416c91047075",
               "name": "John Astin",
               "profile_path": "/2b0Iv7mg0kTnyH4ZU0ajk2e0wYL.jpg",
               "id": 41230,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Capt. Wilbur Finletter",
               "gender": 2,
               "credit_id": "52fe460a9251416c91047079",
               "name": "J. Stephen Peace",
               "profile_path": "/9V7Wna8fg5ptxwGQQxEZTtANY4h.jpg",
               "id": 22356,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Detective Lance Boyle",
               "gender": 2,
               "credit_id": "52fe460a9251416c9104707d",
               "name": "Rick Rockwell",
               "profile_path": null,
               "id": 22358,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Evan Rood",
               "gender": 2,
               "credit_id": "5593012d92514152db002623",
               "name": "John Witherspoon",
               "profile_path": "/mlrxal9uTk2h6i0suarNOyYGiTN.jpg",
               "id": 56902,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe460a9251416c91047071",
            "name": "John De Bello",
            "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
            "id": 22353,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.61586,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36779,
      "vote_count": 15,
      "budget": 0,
      "overview": "Police assitant Boyle along with tomatologist Kennedi Johnson look into investigations about Killer Tomato attacks, and discover Gangrene plans to brainwash people via TV talk shows to take over the world! Will Gangrene be stopped? Will Johnson become part of a Bacon, Lettuce and Human sandwich?",
      "similar": [],
      "original_title": "Killer Tomatoes Strike Back!",
      "runtime": 87,
      "poster_path": "/2pJqVxbooEyZQv7Pk5VPwSA5dbc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1991-11-14",
      "vote_average": 4.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Killer Tomatoes! Collection",
         "id": 47983,
         "poster_path": "/dle8G0LFT8d4MAS2BFFJhwBjn0Q.jpg"
      },
      "tagline": "When good vegetables go bad!",
      "adult": false,
      "homepage": "http://www.killertomatoes.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John De Bello"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "John De Bello",
         "Costa Dillon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099935/",
      "coverLink": null,
      "actors": [
         "Debi Fares",
         "Rick Rockwell",
         "John Witherspoon"
      ],
      "reviews": [
         "Sure, it's not AS funny as Return Of The Killer Tomatoes (1988), but it's still pretty damn hilarious in its own right. Cmon, a tomato robs a bank. Thats on par with zombies renting Day Of The Dead in \"The Dead Next Door.\" Seriously though. If you like B films, enjoyed Return or Attack of the killer tomatoes and want some good old fashion fun, RENT this movie! Seriously, it's almost as good as \"robot monster.\" Anyways, you have Gomez Adams (John Astin) returning as Prof. Gangreen in this sequel in which the tomatoes have faces! Seriously, go see this film - it took forever to get it on DVD. Maybe, one day, if we are lucky, they will add a 5th film to the series. And when will the TV show be released on DVD?!",
         "This is the third in the four films of the Killer Tomatoes trilogy. Unlike the others, this one didn't even attempt a theatrical release and went straight to video. In fact, it almost seems to have been fit into the production schedule during a lull in the preparations for the climatic KILLER TOMATOES EAT FRANCE. This installment takes the form of a police thriller. Rick Rockwell (the future \"Who Wants to Marry a Millionaire?\") stars as Lance Boyle, a Dirty Harry parody. J. Stephen Peace does his third and final turn as Wilbur Finletter, hero of the Tomato Wars and now a police captain. Crystal Carson is this installment's obligatory gorgeous blonde, in this case the biochemist Kennedi Johnson. The ever-delightful John Astin returns as the nefarious Professor Gangrene, this time setting his sights on conquering through the world through the medium of daytime talkshows. Aiding him is the ever-faithful and ever-dim Igor, played as always by Steve Lundquist. Aside from the original, this is probably the lowest-budgeted of the Killer Tomatoes series. Still, the creative team makes the most of their resources. Look for appearances in front of the camera by various members of the creative team. The Killer Tomatoes series is almost a world in itself. The cast and crew do not appear to have been involved in many other film or TV projects. Given the gorgeous leading ladies, this is a bit of a tragedy. Still, given how few people ever get to make a single film, let alone complete a four-part trilogy, De Bello and his team have pulled off quite an accomplishment. Thanks, guys!",
         "Say what you want about the \"Killer Tomato\" flicks, but this particular entry does contain one of the better and more beautiful homage sequences to classic horror milestones that I've seen in a long, long time. There's a wondrous scene that spoofs/tributes \"Jaws\", \"Psycho\" and \"The Omen\" all at the same time. During a virulent tomato attack in the shower, both the uncomfortable tune of \"Jaws\" and the satanic music of \"The Omen\" can be heard. Very pleasant regardless of how stupid it sounds and looks. I seem to be watching the \"Killer Tomato\" franchise in reversed order. The fourth and thus far final episode \"Killer Tomatoes Eat France\" was the first film I watched – and admittedly quite liked – and this second sequel (the one NOT starring George Clooney in an early embarrassing role) is also my second acquaintance. This time, the killer tomatoes and their wacky master Dr. Gangrene are back. The crazed maniacal scientist now even hosts a TV talk show and fiendishly plots to take over the world via subliminal brainwash messages. The only people who are able to stop him are the sport-addicted detective Wilbur Finletter, who denies the existence of killer tomatoes, and the sexy female \"tomatologist\" Kennedi Johnson. Like with \"Killer Tomatoes Eat France\", the film relies on a handful of downright hilarious situations and genuinely clever gags, but the overall wholesome of the script is plot-free and juvenile. Personally, I find it very amusing to watch tomatoes wearing tiny little Jason Voorhees hockey masks or ninja outfits, but obviously you can't really refer to it as being a good film. John Astin obviously enjoys himself very much, as he purposely aims his over-the-top evil laughs directly into the camera and combs his longish hair in such a wild and unmannered style that he looks even more deranged. I guess it's because movies like this one that some brainiac invented the term \"guilty pleasure\".",
         "This is a silly, silly movie without a serious intent in its entire running time. But funny, it certainly is, and the high points are the all-too-brief scenes featuring Kevin West as a mad bank teller. I've bought the movie just for these scenes (though it is fun in general). West is one of the underrated comic wizards of our time, and the bank scene will convince you. I won't spoil it with details, but it's Deliverance meets PeeWee. A second Westian moment, in which he's held captive by the villains and discusses his odd proclivities, is priceless. I can say no more. Overall, the film lacks the out-of-the-box wildness of the original, but hey, it's a Killer Tomatoes film and therefore not without some fruitful redeeming value. John Astin is, as always, John Astin. The premise is strictly Saturday morning cartoon. It's neither Brecht nor Hemingway, though it's both absurd and mercifully brief. But Kevin West is the draw, and no tomato is safe.",
         "As far as I can see, this third installment is basically more of the same. This time it is detective Lance Boyle teaming up with babe scientist Kennedi Johnson to fight the vile vegetables. It is also a sendup of tabloid television and trash talkshows. I guess you shouldn't expect much of credibility from a movie about killer tomatoes, but I guess this is as credible as the intended market, 10-14 year olds, need. The movie tries to play in the same league as Loaded Weapon or Naked Gun police spoofs, but just like the Police Academy sequels, it doesn't have the budget to go through with it. This kind of movies needs at least one joke a minute - as a minimum. The movie has a few good jokes but not nearly enough. Dr. Gangreen's hideout looks cheap, the water in the piranha tank is dyed black since there no piranhas and, most important, it is filled with second-rate actors. Neither Rick Rockwell or Crystal Carson had much experience before - or has had much since, at least as far as feature films are concerned. (Rick Rockwell is now, well, famous as the millionaire in 'Who wants to marry a millionaire?') And some scenes are superfluous, like Lance Boyle visiting the zoo or the irate guy at the bank. If you like horror movies and the Police Academy series, you will love this. Otherwise, spend some time benefiting humanity instead.",
         "Well, it's a lot more entertaining that most of the previous installements. If you turn off your brain you might even get a giggle ouf of this movie. As others mentionned, it's a poor attempt at imitating the Leslie Nielson /Zucker brothers movie style. I think the funniest thing in this movie is seeing people wearing MC Hammer pants with a suit jacket... man thats scary!",
         "The story is absolutely not scary,but at times a little funny. POSSIBLE SPOILER: The plot is about angry tomatoes that kill people with small knives and chainsaws.The movie is very similar to all Leslie Nielsens movies,with the exception that Leslie Nielsen's movies are a lot more fun. If you have nothing better to do than spend 2 hours watching a bunch of angry tomatoes attack people you need help,and by that I mean professional help. I guess I laughed 3 times in the whole movie and all of them were when the tomatoes talked,It sounds like this\"glubiopi dombi bumbiompi hompi\" Don't see this movie unless you are really drunk or love ketchup. Ps:Can be scary for little kids.",
         "Unlike the others who have commented on this movie, I am not going to complain about it not being humorous or anything like that. (Before you go on, I want to remind you I am an insane, dumb, anime-obsessed 13-year-old who has nothing better to do, and I have not seen the other Killer Tomatoes movies.) This movie strikes me as rather dumb. To me, that's okay, because I like dumb movies. Dumb movies make me laugh, and I love to laugh. This one has to be the dumbest of them all, though. I mean, tomatoes trying to kill people? That may be the dumbest thing I've ever heard. But that's why I like it - it's a strange idea overall and that makes it funny.",
         "The original 1978 Attack Of The Killer Tomatoes was an oddly entertaining funny little film that mocked itself from start to finish with it's Airplane (1980) style humour. It's sequel was far weaker but still delivered the laughs, this third movie delivers them very few and far between but there is still fun to be had. Following directly on from the second film we see John Astins Professor Gangreen return with another scheme for world domination. The tomato sfx have gotten more advanced and that's a bad thing, the novelty has thoroughly worn off and it's just not funny anymore. The cast make the most of the script and there are laughs to be had but the whole killer tomato's thing has grown stale. The Good: Hilarious opening sequence The Bad: Novelty has worn thin Not as much humour as previous films Things I Learnt From This Movie: I may have been a tomatologist in a previous life Boyles trouser collection is the stuff of legends Ordering a bloody mary in a tomato bar is unwise I found the Godtomato scene more interesting than every Godfather movie combined A woman having ketchup poured all over her chest is not as sexy as you'd imagine",
         "This movie features the Killer Tomatoes returning once more with Professor Gangreene using TV to hypnotize the world or some stupid thing like that. This film makes no sense even by the standards the other movies do. It features the main cop character saying that he doesn't believe in killer tomatoes. In the first movie, there was a war that everybody saw that showed these things! It's even said there was a second war with these guys. I saw the second movie and it wasn't a war. It was a far smaller conflict. They even show scenes from the first movie. They do that and still get the plot of the second one wrong. The second one, while very bad, at least had some interesting fourth wall jokes going on. There are much fewer here and the jokes are not funny at all. The only good thing is that we finally get to see the tomatoes with faces. That's what the movie posters were promising us for such a long time. Just when you think the series has ended, Professor Gangreene is somehow shown to have survived the tomatoes with just damage to his nose. Maybe I could forgive this if it was actually entertaining. There's only so many times you can show tomatoes attacking people. It's just them showing how much they can milk this single joke for a whole movie series. *1/2",
         "More of the same, and why not? The first one was a pretty bad film, but you have to admit its concept was, uhm, daring and innovating. The second one was the same dumb fun, slightly better made, with even a couple of highlighting gags coming close to hilarious. This third film is as dumb as the second one, on a technical level pretty much on par with the second one, though less in hilarious outbursts. Either way, if you've had some laughs with the first two, I can't imagine you'll complain about this third entry. Silly, ridiculous, tacky, campy and... well, plain dumb actually. The people who made these films, own them. And they know it. I think the world hasn't seen the last of these Killer Tomatoes yet. For better or worse, that's for you to decide. Good Badness? Yes, if only for actually being funnier than \"Munchies\" (1987). 4/10 and 5/10",
         "I do not know why this got a 3.3 this movie very funny. It is very underrated. This is the third killer tomatoes movie. This first two are good. This one is better. This is one of the funniest movie from 1991. The forth killer tomatoes movie Killer tomatoes eat France is better. Still this is a good movie. There are not to many comedy movie that are not funny. This one is very funny. This movie has a great story line. It also has great acting. It also has great special effects. This movie is a must see. John Astin is very funny in this movie. Cystal Carson is a great actress. Rick Rockwell is a good actor. John De Bello is a great film maker. See this movie. See all the killer tomatoes movies.",
         "Police detective Boyle along with beautiful tomato scientist Kennedi Johnson are investigating suspicious deaths. Johnson believes it's killer tomatoes but Boyle dismisses her. Professor Gangreen (John Astin) is disguised as outrageous TV talk show host Jeronahew to brainwash the people and enslave the world with his killer tomatoes. Johnson is attacked by a tomato but Boyle refuses to believe. Boyle is a horribly stupid character and not in the funny way. He is annoying and the actor is not funny. He is so unfunny that he actually subtracts from the others. Johnson's fake screaming is an almost funny gag. John Astin could have worked in a better movie. I just can't stand Boyle. There is a small chance that some people will find this to be so bad that it becomes good. For me, I don't drink that much anymore."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Four Square Productions"],
      "summaries": [
         "Police assitant Boyle along with tomatologist Kennedi Johnson look into investigations about Killer Tomato attacks, and discover Gangrene plans to brainwash people via TV talk shows to take over the world! Will Gangrene be stopped? Will Johnson become part of a Bacon, Lettuce and Human sandwich?",
         "Professor Gangreen attempts to brainwash the world; a police assistant and a tomatologist team up to stop him."
      ],
      "budget": 0
   },
   "movielensId": 136022,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-11-14",
      "dvdReleaseDate": null,
      "directors": ["John De Bello"],
      "runtime": 87,
      "movieId": 136022,
      "title": "Killer Tomatoes Strike Back!",
      "mpaa": "PG",
      "actors": [
         "Crystal Carson",
         "Steve Lundquist",
         "John De Bello",
         "John Astin",
         "J. Stephen Peace",
         "Rick Rockwell",
         "John Witherspoon"
      ],
      "imdbMovieId": "0099935",
      "originalTitle": "Killer Tomatoes Strike Back!",
      "genres": [
         "Action",
         "Comedy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Police assitant Boyle along with tomatologist Kennedi Johnson look into investigations about Killer Tomato attacks, and discover Gangrene plans to brainwash people via TV talk shows to take over the world! Will Gangrene be stopped? Will Johnson become part of a Bacon, Lettuce and Human sandwich?",
      "tmdbMovieId": 36779,
      "avgRating": 1.81579,
      "releaseYear": "1991",
      "numRatings": 19,
      "posterPath": "/2pJqVxbooEyZQv7Pk5VPwSA5dbc.jpg"
   }
}