{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "mixed martial arts",
            "id": 9917
         },
         {
            "name": "kumite",
            "id": 12379
         },
         {
            "name": "tournament",
            "id": 12380
         }
      ],
      "imdb_id": "tt0115714",
      "video": false,
      "title": "Bloodsport III",
      "recommendations": [
         36693,
         25087,
         36859,
         42552,
         26962,
         48302,
         36790,
         30396,
         29474,
         26125,
         74101,
         36996,
         19667,
         36567,
         38046,
         32065,
         55377,
         68895,
         20236,
         36942
      ],
      "backdrop_path": "/4KspoeWhgbrymdFmyIi5UBaVwJU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alex Cardo",
               "gender": 0,
               "credit_id": "52fe46029251416c910460bb",
               "name": "Daniel Bernhardt",
               "profile_path": "/xu8MSrkaP5PH2VlkOAfdRYF8wnB.jpg",
               "id": 9452,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jacques Duvalier",
               "gender": 2,
               "credit_id": "52fe46029251416c910460bf",
               "name": "John Rhys-Davies",
               "profile_path": "/dvT1NPY8CXIVQh0O1h6rpfYOgKz.jpg",
               "id": 655,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Crystal Duvalier",
               "gender": 1,
               "credit_id": "52fe46029251416c910460c3",
               "name": "Amber Van Lent",
               "profile_path": null,
               "id": 115985,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Shari",
               "gender": 1,
               "credit_id": "52fe46029251416c910460c7",
               "name": "Uni Park",
               "profile_path": null,
               "id": 115986,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Master Sun",
               "gender": 2,
               "credit_id": "52fe46029251416c910460cb",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "David Leung",
               "gender": 2,
               "credit_id": "52fe46029251416c910460cf",
               "name": "Pat Morita",
               "profile_path": "/eMLWaQ2uQIpiyVeaU7xl0ozs2B7.jpg",
               "id": 23915,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46029251416c910460d5",
               "name": "Alan Mehrez",
               "profile_path": null,
               "id": 115983,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46029251416c910460db",
               "name": "James Williams (V)",
               "profile_path": null,
               "id": 1082403,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.682694,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36692,
      "vote_count": 20,
      "budget": 0,
      "overview": "Bloodsport III brings us back to the world of Alex Cardo. This time he must battle in a fight to end all fights - The Kumite, the most vicious warrior alive - Beast. He must not only battle for his own honor, but also avenge the death of Sun, his mentor, teacher, and spiritual \"father\", when Sun is spitefully killed by crime boss Duvalier. In order to defeat Beast, destroy Duvalier, and avenge Sun's death, Alex turns to Leung to whom he was indebted in Bloodsport II. Leung directs him to the great shaman, Makato \"the Judge\", to whom Alex must turn for guidance. The judge teaches him to fully channel the energy in his mind and body in order to rout the Beast in the Kumite...",
      "similar": [
         55292,
         11841,
         9053,
         9461,
         146,
         605,
         24,
         604,
         140300,
         11770,
         9502,
         7549,
         9312,
         2024,
         9335,
         9947,
         8456,
         603,
         682,
         16320
      ],
      "original_title": "Bloodsport III",
      "runtime": 91,
      "poster_path": "/oA9mDA0gQhel2SWxoyPefJIcmIs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "FM Entertainment International N.V.",
         "id": 10354,
         "origin_country": ""
      }],
      "release_date": "1996-12-05",
      "vote_average": 4.4,
      "belongs_to_collection": {
         "backdrop_path": "/1DXtjAAaK7597GV5MSZH6nn0uqS.jpg",
         "name": "Bloodsport Collection",
         "id": 36694,
         "poster_path": "/sTqv7FQalXNVGSpfSJaWek077w9.jpg"
      },
      "tagline": "The Fight For Justice & Truth Continues...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Mehrez"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["James Williams"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0115714/",
      "coverLink": null,
      "actors": [
         "Daniel Bernhardt",
         "John Rhys-Davies",
         "Amber Kelleher-Andrews"
      ],
      "reviews": [
         "Daniel Bernhardt returns as Alex Cardo as he tells in flashback to his son, how his mentor James Hong was killed, how he wins the kumite against \"The Beast\" who is a titan and along the way discusses how he met the lad's mother. Also on how the kid's grandfather was a no good scumbag, in other words it is Bloodsport for a younger generation. Bloodsport II wasn't exactly great (In fact far from good) but when compared to this boring dud of a sequel, it almost feels as if you can sense how bored the movie is with itself. The fight sequences this time are terribly staged, with martial artistry so sloppy, you'd swear you walked in on a drunken fight. The movie starts off reasonably well enough but once the training montage begins, you'll be so bored that your only excitement in the fight sequences, will be getting closer to the ending. The movie is just so lame. Also the singing in which Amber van Lynt does, is quite positively more damaging to the human body, then any harm \"The Beast\" inflicts. (I'm not sure if i'm the first to bring that up, but how nobody remembers such awful singing is mind boggling.) * out of 4-(Bad)",
         "When I first saw bloodsport 2 I was so impressed. Bloodsport 2 had everything. Lots of fighters,a ruthless villain{Demon} and the character of Alex Cardo was cool. The story was good. A man sent to prison and makes friends with a man who becomes a mentor to him. And the man teaches him the Iron hand and Alex in return fights in the Kumite to win his friends freedom and to honor him for making Alex a changed man. Then we come to Bloodsport 3. I was expecting another good movie. Instead I was let down. Don't get me wrong. The only good part about this movie is the fight scenes. Thats it. This movie didn't have many fight scenes. Or for that matter many fighters. And the main villain/fighter the beast,is no where as awesome and ruthless as the Demon from the second film. He seemed slow and tired at times and it looked liked they had to stop the fights just so the guy could regain his breath. Not to mention the storyline. What was the point of Alex having to go re learn martial arts if he already knew how to fight. All he would have to have done is use the iron hand on the beast and win the damn thing. And the fighters in this movie wern't as good. They seemed skinny as hell and arrogant. This movie shouldn't have been made. Or it needed another storyline. A better storyline. Stick with the first 2 films. Don't waste your time on this movie. It will disappoint you start to finish.",
         "Daniel Bernhard returns in this 3rd installment in the series. I suspect that this movie were made in a big rush, since it's worse than \"Bloodsport 2\" in many ways. First of all, the story is a little bit too standard. But that is of course not the most important. The fighting in this movie isn't that good, and it's just too much of the same styles. The Kumite in this movie has to be the worst Kumite ever arranged. One detail that particularly draw my attention, was one of the fighters sitting on the bench ringside and waiting to fight. On the bench, he didn't have any hair on his chest at all. But when he was fighting, he suddenly had lots of hair. Things like this confirms that this is a C-movie, and probably really low-budget. What where they thinking?",
         "You should watch Bloodsport III if you have enjoyed the first two, but know that it is inferior to those movies. First of all, the narration style is the same as in the second one(told by flash-backs). This is not bad, but it doesn't bring anything new to the franchise, and the between flash-back scenes in B2 were arguably better. Secondly, the main villain (who somehow looks like Vince Vaughn). His name is \"The Beast\"...OK, the name of the bad guy in B2 was \"Demon\", so does every bad guy now have to have a weird name like \"Evil Guy\" or whatever? Also, and more importantly, he really isn't that impressive, and doesn't look like he poses a threat to the hero. Finally, all the other Kumite fighters sucked. Some of them had funny names (Lima Lama, JJ Tucker), but none of them were sympathetic, rather super annoying (except for Lima Lama). Now for the good. The movie was a shot in Sri Lanka, which makes for an interesting change of locale. A lot of the team behind B2 is back for this one, and it's nice to see actors like Pat Morita and James Hong don't mind coming back for just one scene. It's also nice to see actors like John-Rhys Davies, who played Sallah in Indiana Jones, and Gimli in Lord Of The Rings, will also act in movies like Bloodsport. Also, and importantly, though handled somewhat awkwardly, the underlying storyline in B3 is deeper and has more meaning than all the other Bloodsports. All in all, while inferior to it's predecessors, Bloodsport III is a movie for which one should not have high expectations, and with Daniel Bernhardt in the lead, it delivers it's promise.",
         "Swiss martial arts dude Daniel Bernhardt stands in again for Van Damme in this second sequel to \"Bloodsport\". Alex Cardo has retired from martial arts after winning the Kumite in the last flick, but rich heavy Jonathan Rhys-Davies wants him to compete in a new Kumite he's putting on. When our hero refuses, Davies kills his former teacher James Hong (who wisely appears to have agreed to be in this movie for less than 5 minutes). Cardo seeks out Pat Morita (also in this flick for mere minutes), who hooks Cardo up with his brother, who trains him, even though it is repeatedly stated that Cardo is the best martial artist in the world. He returns to take revenge on Davies by entering the Kumite ... which is actually what Davies wanted him to do in the first place. I confess to being confused at this point. Cardo \"gets revenge\" by winning the competition, which is what Davies wanted ... but now he doesn't???",
         "Alex Cardo (Bernhardt) is a Punchfighter, but he'd rather be having tender heart-to-heart talks with his classically 90's son Jason (David Schatz). While he trains his tot in the ways of Martial Arts, he regales him with stories of the time he won the Kumite (thus eliminating any sense of suspense or drama and telegraphing a spoiler alert from the get-go). Alex recounts the tale of his time in \"the Far East\" when he used to frequent casinos while dressed in a white tuxedo. Jason, clearly riveted, continues to listen. Alex tells of the evil fight promoter Duvalier (Rhys-Davies), and how he murdered his mentor Master Sun (Hong). He neglects to mention why Pat Morita is only seen for about 30 seconds and for no apparent reason. To win the tournament, Alex goes to the countryside and begins training extensively, which is a prerequisite if you want to win. Alex soon dons his singlet and enters the ring, and proceeds to work his way through a bunch of fighters with no character development beyond their names, such as Bruce Burly (McElroy) (though why J. J. Perry had to play a guy named J. J. Tucker remains unexplained). Finally he faces off against The Beast (Oleson), an almost comically oversized meathead of the highest order. Will Alex live to tell the tale to his son? Well, yeah, of course he will. Grown men punching and kicking each other. It can take on many wondrous and colorful forms. Apparently there's no real limit on how many of these types of movies can be made. The original Bloodsport and Kickboxer films truly opened the floodgates during the video store era for Punchfighters for decades to come, even up to the present day. But the problem with movies like this is, during the last half-hour at least, it gets very boring and repetitive. But you have to show the Kumite, right? So on and on it goes. Before the internet and even Pay-Per-View, renting movies like this was one of the only ways to see fighting of this kind on film. It's easy to forget that in this day and age. So the movie gets somewhat of a pass, but it really should have bothered to do a bit more character development and maybe concentrated a little less on extended Kumite footage. We realize we're talking about Bloodsport III here, but still, we think that's a fair criticism. The first half of Bloodsport III is actually a lot of fun. It has that silly, funny, absurd vibe we love so dearly. But then it slows down and becomes more standard, unfortunately enough. Daniel Bernhardt must have been an obvious choice to fill the shoes of Van Damme, because, let's face it, he's basically the same person. We've never seen them in the same place at the same time, have we? It must have been tough living in the shadow of JCVD. But somewhere in between Van Damme and Olivier Gruner, the Bernhardt dwells. At many points throughout the film, you could swear that it IS Van Damme. But Bernhardt puts forth his best \"suave eyebrow\" to woo the ladies, and why wouldn't he go after Crystal Duvalier (Van Lent), with a singing voice like that? In the \"white tuxedo\" scene, he truly is Daniel BernBond. But the man has his own personal problems and demons as well, as he has nightmares of recycled footage that he has to contend with. Perhaps, in the end, Bloodsport III raises more questions than it answers (what exactly is the timeline of all these Kumite matches as they relate to parts II and III? Why do deathfights to the death have a ref? And so many others...). But it does have a noteworthy end-credits song, \"Rhythm of the Kumite\" - a techno tune where you think at any moment someone will yell \"Mortal Kombat!!!!!\" - but they do indeed yell \"Bloodsport!!!!!\", so, no harm no foul. So basically the first half is entertaining but it devolves into a slog. So watch it on YouTube and save the money on your credit Cardo.",
         "Not interesting at all, plot is also bad. Bloodsport I was okay, II was kinda watchable, but III and IV are terrible! Poor acting, poor fighting scenes... This movie is one of those movies where you want to leave the cinema although you paid to watch it. Of course I didn't watch it in the cinema, but I was like \"dear God, will it end already\". You get bored watching it, you know the ending, there are no surprising parts, twists, nothing. I give it 5/10 while being very very generous! It's better than Bloodsport IV, but hey, that's not so hard since IV is one of the worst movies ever made! It would be better for director if he hadn't made sequels after first Bloodsport movie with van Damme. I'm really disappointed.",
         "There isn't much to say about this film, except that slowly goes down... This is just one of those bad martial arts films... with classic story about Alex Cardo who's taking a revenge upon a rich mobster and his \"monster\" fighter called the Beast. Again with Daniel Bernhardt in leading role and his Van Damme face expressions. He travels on Thailand to another master to train him for next Kumite. But, this time... it IS personal! We get to see John Rhys Davies as the leading bad guy, the mobster, who is doing nothing but walking around with a large cigar in his mouth and look menacing, just like in \"Cyborg Cop\", James Hong and Pat Morita are there again... The fights are good, no complaints there... This is strictly for martial arts fans.",
         "Just finished watching the movie, yesterday I have seen part II. It's not as good as part 2, and well, they shoudn't have named it part III. I mean, the events concerning master Sun, are not possible since Master Sun was telling the students about the last kumite as an old man, so he was still alive. But then again Highlander 2,3 and 5 are also horrible, whilst parts 1 and 4 are very nice, and the increasing number behind American Ninja/kickboxer is also, let's say not an increase of quality. I have the tendency to watch lets say, the lesser pearls of the movie world in the weekend. And if you expect a B film, this is rather OK. It's 90 minutes of not-too-bad acting and nice fighting scenes. Obviously the continuity is very very poor (JJ and the bandage of the long haired fighter) and the biggest mistake??? location... 'several years after winning the kumite, I was living in the far east'....WHY SAY THAT??? the film was shot in Sri Lanka, all the people are 'indian', why say that it's in the far east?... Eventually this film is OK, I enjoyed watching it... If you want to see it, don't expect anything fancy, just real B material, and you can have a nice 1.5 hr. cheers",
         "at first,it looked like this movie was going down the crapper and quickly.somehow, though,it turns out not too bad.unlike,number two,which isn't really a sequel,this one is.the main character returns,and learns more lessons.i liked the training montages.to me,they were better than the ones in the second film.at times,i could swear it was Van Damme on screen.Daniel Bernhardt really looks like at times.the plot is quite ridiculous,but the action is better,i think.the fight scenes are better at times. the ending could have been a bit better,as the climax seemed to short.however,overall,this movie is no better or worse than the previous entry, and it's not a complete waste of time.in fact,it's quite entertaining.so i'll give it a 6/10",
         "I saw Bloodsport, sadly one of Van Damme's best films, and could say it wasn't all that stupid. Number 2 was far more entertaining, mostly because they cast Daniel Bernhardt as the lead, (a basically taller, better acting, better looking and better fighting version of JCVD). Now comes lucky number 3. For the love of your sanity, don't see this movie! Don't touch this piece of maggot-infested crap! I lost an hour of my life that i'll never get back (thats how much of it I stomached before I tossed it out the window). If you feel the need to see a film that so bad that it actually entertains you, go see \"Cool As Ice\". Bloodsport 3, however, is not one of those films.",
         "when i watched the first two bloodsport films i thought that they were pretty good (especially the first film). and then when they made a third one i immedietly rented it at the local movie store and was dissapointed in how stupid this film was. the action seens werent too bad, but the storyline was completely messed... if you ask me, there was no point in making this film. I rank it a *** out of **********.",
         "The first Bloodsport is a great action movie. Bloodsport 2 came and that was okay. Now here is Bloodsport 3, And Boy! It's sure sucks big time. The plot and the acting sucks. My 2-year old brother can act 1,000,000,000,000,000,000 times better than the actors in this movie. Watch the first movie instead. And stay far far away from this crappy movie. I hope to god there will not be a Bloodsport 4. * out of ****",
         "I'm not kidding. In my opinion this truly is the WORST FILM EVER MADE. The only thing that could possibly be worse is the fourth installment, which I was unaware of until now. The only reason you would watch this is to laugh at how bad it is, which I did for the first half hour or so. But the novelty of that wears off quickly, especially once you realise that it is for real ... they're not kidding ... this isn't a comedy. So on second thoughts don't even see it for that reason. If you want to watch something that's so bad it's enjoyable, go rent out Plan 9 From Outer Space. Hell this film is even worse than Scary Movie 2, and I really, REALLY hated that film. But don't go see it if you liked Scary Movie 2. It's nothing like it."
      ],
      "genres": [
         "Action",
         "Sport"
      ],
      "productionCompanies": ["FM Entertainment International N.V."],
      "summaries": [
         "Bloodsport III brings us back to the world of Alex Cardo. This time he must battle in a fight to end all fights - The Kumite, the most vicious warrior alive - Beast. He must not only battle for his own honor, but also avenge the death of Sun, his mentor, teacher, and spiritual \"father\", when Sun is spitefully killed by crime boss Duvalier. In order to defeat Beast, destroy Duvalier, and avenge Sun's death, Alex turns to Leung, to whom he was indebted in Bloodsport II. Leung directs him to the great shaman, Makato \"the Judge\", to whom Alex must turn for guidance. The judge teaches him to fully channel the energy in his mind and body, in order to rout the Beast in the Kumite.",
         "A little while after winning the Kumite, Alex Cardo--now an art dealer--no longer wishes to fight in tournaments. After Alex rejects millionaire, Jacques Duvalier's (John Rhys-Davies) invitation to a new Kumite he in sponsoring, Duvalier has Alex's spiritual father, Sun, executed. Feeling empty inside and wanting revenge, Alex is directed by David Leung (Pat Morita) to Master Makato \"the Judge,\" Sun's brother who Alex met in the previous Kumite. Makato helps Alex rebuild himself and teaches him things to build on what he learned from Sun. Alex finally decides to compete to avenge Sun's murder and honour his memory. All of Alex's wrath and fight abilities may not be enough to stop Duvalier's evil henchman: Beast--the biggest, strongest, and most powerful fighter the Kumite has ever seen."
      ],
      "budget": 0
   },
   "movielensId": 136012,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-12-05",
      "dvdReleaseDate": null,
      "directors": ["Alan Mehrez"],
      "runtime": 91,
      "movieId": 136012,
      "title": "Bloodsport III",
      "mpaa": "R",
      "actors": [
         "Daniel Bernhardt",
         "John Rhys-Davies",
         "Amber Van Lent",
         "Uni Park",
         "James Hong",
         "Pat Morita"
      ],
      "imdbMovieId": "0115714",
      "originalTitle": "Bloodsport III",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["sBTDK2avjnw"],
      "plotSummary": "Bloodsport III brings us back to the world of Alex Cardo. This time he must battle in a fight to end all fights - The Kumite, the most vicious warrior alive - Beast. He must not only battle for his own honor, but also avenge the death of Sun, his mentor, teacher, and spiritual \"father\", when Sun is spitefully killed by crime boss Duvalier. In order to defeat Beast, destroy Duvalier, and avenge Sun's death, Alex turns to Leung to whom he was indebted in Bloodsport II. Leung directs him to the great shaman, Makato \"the Judge\", to whom Alex must turn for guidance. The judge teaches him to fully channel the energy in his mind and body in order to rout the Beast in the Kumite...",
      "tmdbMovieId": 36692,
      "avgRating": 2.92857,
      "releaseYear": "1996",
      "numRatings": 7,
      "posterPath": "/oA9mDA0gQhel2SWxoyPefJIcmIs.jpg"
   }
}