{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0385890",
      "video": false,
      "title": "My Big Fat Independent Movie",
      "recommendations": [
         48490,
         24939,
         31253
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Julianne",
               "gender": 1,
               "credit_id": "52fe4547c3a368484e050fc1",
               "name": "Paget Brewster",
               "profile_path": "/4yzWN3Up7HXvAmuq8D4CBxGjtlz.jpg",
               "id": 15423,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sam",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fc5",
               "name": "Neil Barton",
               "profile_path": null,
               "id": 1213118,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Harvey",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fc9",
               "name": "Eric Hoffman",
               "profile_path": null,
               "id": 1179247,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Johnny Vince",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e050fcd",
               "name": "Darren Keefe",
               "profile_path": null,
               "id": 102669,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Anomalie",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fd1",
               "name": "Ashley Head",
               "profile_path": null,
               "id": 1271493,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Memento Guy",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fd5",
               "name": "Brian Krow",
               "profile_path": null,
               "id": 1271494,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Spader",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e050fd9",
               "name": "John Fortson",
               "profile_path": "/zlQ7X7iZH9rgRs7DTbk44o8sjtN.jpg",
               "id": 156978,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Lanky Man",
               "gender": 2,
               "credit_id": "52fe4547c3a368484e050fdd",
               "name": "Neil Hopkins",
               "profile_path": "/cMdv9Repj3ALJlqjkJPWm5pAiwx.jpg",
               "id": 59755,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Bald Genius",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fe1",
               "name": "Rob Schrab",
               "profile_path": "/kjmkAqDGnYIMjn8NXPYYvfQgZZH.jpg",
               "id": 57195,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Lola",
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fe5",
               "name": "Regina Berger",
               "profile_path": null,
               "id": 1168893,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fb1",
               "name": "Philip Zlotorynski",
               "profile_path": null,
               "id": 1271492,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4547c3a368484e050fbd",
               "name": "Adam Schwartz",
               "profile_path": null,
               "id": 1032033,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "57ebacc2c3a36839410040e7",
               "name": "Chris Gore",
               "profile_path": "/7uyfByuNXiVZwRg0oFlLyW6oH2o.jpg",
               "id": 1179326,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.249732,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27404,
      "vote_count": 7,
      "budget": 0,
      "overview": "This film is a spoof along the lines of \"Scary Movie\" and \"Not Another Teen Movie.\" It includes parodies of some of the indie film world's most renowned movies such as \"Memento,\" \"Pulp Fiction,\" \"Magnolia,\" \"My Big Fat Greek Wedding,\" \"Amelie,\" \"Run Lola Run,\" \"El Mariachi,\" \"The Good Girl,\" \"Pi,\" \"Swingers\" and many others.",
      "similar": [
         3134,
         298312,
         8810,
         281,
         948,
         4638,
         10212,
         11564,
         43923,
         133805,
         2142,
         12162,
         1359,
         4771,
         431,
         8923,
         10285,
         23483,
         101,
         205
      ],
      "original_title": "My Big Fat Independent Movie",
      "runtime": 80,
      "poster_path": "/qmfjng969NjJOcYwk7Nc3PX7vqq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Film Threat DVD",
            "id": 60481,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aloha Pictures",
            "id": 73337,
            "origin_country": ""
         }
      ],
      "release_date": "2005-03-04",
      "vote_average": 2.7,
      "belongs_to_collection": null,
      "tagline": "The lowbrow comedy for the highbrow crowd.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Philip Zlotorynski"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Chris Gore",
         "Adam Schwartz"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0385890/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg1NTYyNjUwOV5BMl5BanBnXkFtZTYwMjc0NjM3._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Paget Brewster",
         "Neil Barton",
         "Eric Hoffman"
      ],
      "reviews": [
         "This was one of the absolute worst films I have ever seen. Every single \"joke\" had no substance. The film makers expected that pointing out what characterizes Indy films would be funny enough to not have to actually write a movie. The jokes weren't jokes, but explanations of plot techniques used in the films it satirized. On top of that, a good amount of what it made fun of for being \"unoriginal\" were unique elements giving the films the \"Indy\" feel. Films like Pulp Fiction, Amelie, and Reservoir Dogs are films whose worst offenses are starting cliché's, not supporting them. I will say that i laughed at seeing Pauly Shore. But a cameo shouldn't be the highlight of any movie, comedy or not. I can't urge you enough not to see this film. Granted, parodies are hard to make work. But this was so bad it was embarrassing. Movies like this shouldn't be paid attention.",
         "I don't expect movies like this to be good, but I don't expect them to be this bad. This was awful. It was an extremely disjointed, low budget spoof of independent films, including Pulp Fiction, Amelie, My Big Fat Greek Wedding, Memento and many more. Where I enjoyed all of those films, I hated this with a passion. It was painfully unfunny and not one of the stupid jokes made me laugh. It had a cast of some semi-known celebrities including Jason Mewes from the View Askew films doing the voice of an answering machine, and Clint Howard (from practically everything) as the mechanic. I found all of the movies this parodied funnier than this. My rating: 0/****. 98 mins. Rated R",
         "This movie was horrible. Possibly one of the worst that I have ever seen -- and trust me, I've seen countless horrible student films and indies at festivals. I got every one of the jokes. I knew all the references. None of them were funny. It wasn't even watchable -- I'm one to respect movies that are so bad that they're attention grabbing. I also respect movies that I think were terrible but at least an attempt to do something new. This doesn't fall into any one of those categories. There wasn't one good actor who displayed any sort of charisma in this entire god awful movie. However, to their defense, there was nothing to work with to begin with. The writers thought they were hilarious and witty, but ended up trying to banter movies that they will never be worthy of being associated with in their lifetimes and I find it pathetic that they thought they were. They milked the same jokes -that weren't even funny to begin with- for all their worth (i.e. calling everything cliché, describing every film term that is being used, and complaining about goddamn voice over). The only reason why the content in any of the movies that were spoofed is a \"cliche\" is because horrible and painfully unoriginal screen writers & film makers (like the ones responsible for this piece of garbage) relentlessly parody them to no end. To the people responsible for this: UNDERSTAND THAT YOU'RE NOT FUNNY AND THAT YOU DESERVE TO DRINK A TALL GLASS OF SHAME!",
         "The only reason I was able to enjoy this movie is because I had seen every movie referenced in the script.. I DON'T think that most people are going to \"get\" this flick because it is so reliant on identifying with what movie they are spoofing. In the same way Scary Movie required knowledge of the material to get the jokes- so does this movie require that you have seen a long list of indie films. If you are not into this genre you will miss a LOT of the jokes!! This weakness aside it's pretty cool fun as an Airplane! style adventure through various spoofed indie moments. So like I said- if you haven't seen Mullholland Drive and Secretary- maybe you will be scratching your head? Understanding who Amelie is would help with 60% of the movie's jokes. Is El Mariachi a restaurant to you? Don't bother then. For the thin sliver of a crowd this movie spoofs on- it does OK. I suggest watching the following films before attempting to watch this film: Pulp Fiction, Memento, Amelie, El Mariachi, The Secretary, Waking Life, Reservoir Dogs, Swingers, and if you can stand it.. Pi. There may be some jokes that still escape you- this is an indie lover's film fer sure.",
         "The problem with this movie is that it's parodying something that really can't be parodied or doesn't want to be parodied. To parody indie movies means that there's a style to an indie movie that every indie movie has. But that's not the case which is why this movie loses a lot of the humor that comes from a great comedy like Airplane. A disaster movie, a superhero movie or a similar genre has a structure that's similar across all movies of its genre. But an indie movie doesn't have a similar structure. A early Weinstein period piece is very different from a Tarantino flick which is very different from a mumblecore movie. To say that all Sundance movies are alike means that there's a formula for Sundance movies that you just have to follow and you can get into Sundance. Perhaps that is what the screenwriter is trying to say. There may be some truth to that but he hasn't found the right vehicle to satirize that.",
         "Not a horrible movie, but it definitely has flaws. The script is too self-referential. I get that this is one way to make fun of movies, but honestly 75% of the films jokes (the ones that worked, anyway) were simply making fun of movie clichés. Taken one at a time these references are done well and \"funny\" for lack of a better word, but it gets old (and predictable) fast. The acting was also inconsistent. Most of the leads do a great job, actually, but a few weak links really make this feel like an amateurish effort. And as with any parody movie, some of the gags worked, and some didn't. Jokes that are too obvious, out of place, or just not that funny frequently come up. On the other hand, some of the actors do a great job, most of the gags are based on ideas that are funny (note, based on), they don't try to parody too many movies at once (epic movie, date movie, etc,), and it only dips into true-low brow humor a couple of times. The movie also has a good flow to it. I wasn't laughing much, but the movie went by smoothly without dragging. The energy and cinematography are good, although the sound was inconsistent in the beginning. Overall, I was surprised by the production value of this movie; they nailed \"independant\" movie without looking like a \"bad\" movie. The actors are fine, the plot is adequate, the music is actually great. The humor, unfortunately, is not all it should be. I'd recommend it to fans of pulp fiction and film school students.",
         "No. Just no. If you're thinking about being in the same city as this movie, no. Don't do it. My friend held the remote hostage and forced me to watch it. I will never get that time back. I wish I could get struck in the back of the head and forget that it was ever created. Oh yeah, it's that bad. To explain it's horrible quality further, the movie just makes retarded allusions to other horrible movies. I felt like eating my own heart to end it quicker. The only slightly redeeming quality is that the black protagonist's hair made me chuckle. It's kind of like a sponge wrapped around his head. Or even better, it's like a quarter of an afro. But that's all. I only wish that the 10 scale could be a 1,000,000,000,000 scale so I could give it a lower rating.",
         "The most surprising thing about My Big Fat Independent Movie is that no one had made it sooner. Crammed full of every cliché\u001a it can lay it's hands on, and openly disparaging of every independent movie made from Pulp Fiction to Run Lola Run its crude, disgusting, full of sexual innuendo, stupid dialogue, foul language and is hysterically funny from beginning to end. Oh sure it's as subtle as a brick wall and as intellectually challenging as professional wrestling, but that's half the fun. Billing itself as the lowbrow comedy for the highbrow crowd, it makes no pretensions to being anything more than a brilliantly stupid movie. High art this isn't and thank goodness for that. Like a scythe in a cheap horror movie it cuts everything down in size so no ones a head and shoulders above anyone. All your favorites are seen minus their aspirations to art hood. Oh sure some of the jokes are more stupid than funny, but that's to be expected when you're shooting target practice with a grenade launcher. You'll blow everything up, but stuff is bound to be a little messy around the edges. In case you were wondering, there is a plot to this movie, mainly useful for bringing in the stunning variety of clichés and allusions to other movies that pepper the film, but it does provide a semblance of structure for the fun. Two thugs Sam (Neil Barton) and Harvey (Eric Hoffman) are sent to Las Vegas by their employer to botch a robbery of a suitcase. On their way, they are supposed to pick up a guy with a guitar case full of weapons. Unfortunately, he has a tragic encounter with a semi-trailer while engaged in conversation with a French girl, Anomalie (Ashley Head) who just wants to make everyone happy. (If their idea of happiness is winding up dead in horrific accidents than she does a bang up job) Instead, they pick up a guy with a trombone case, with a trombone in it; Johnny Vince (Darren Keefe) He's happy to go along because he's still recovering from breaking up with his girl friend, who he went out with twice five years ago. What with the restraining order and all, it's been difficult to try and get back together with her, and the lure of Las Vegas irresistible to the want to be hep-cat. What independent movie would be complete without the confused and disillusioned woman who just can't be happy with her lot in life? With that in mind, they kidnap Julianne (Paget Brewster) after some really gratuitous violence in a grocery store. Julianne is so confused that she can't decide if her husband ignored her because he lusted after the male black gardener, or if she was dissatisfied with the life of being waited on hand and foot by a devoted husband. As they continue along on their trip they stop for lunch at My Big Fat Greek Restaurant (the highest grossing independent restaurant ever), run over a German woman jogging, and meet up with the Lanky Man (Neil Hopkins doing a remarkable impression of Christopher Walken) who has the key to the warehouse where they are supposed to botch the robbery. He also has the key to their obligatory fantasy scenes, until he gets so disgusted with the clichés involved he throws them all out. One of the sillier aspects, but still nicely done, of the movie is having the characters commenting on the \"independent\" aspects of what's happening in the scene. Whether it's choosing appropriately ironic music for a torture sequence, or deciding on the best way to get the audience to relate to your anti-hero psychotic tendencies, they're very concerned about ensuring that they make the grade. Along with two sub plots; a trio of Hassidic hit men intent on discovering the formula for the ideal corn beef sandwich, and a guy who can't remember anything except Kenny G. is responsible for his wife's death, our companions finally make it to the warehouse. After the obligatory surreal dance sequence, the final showdown can take place. Suffice to say it's just what you'd expect, but more. My Big Fat Independent Movie is stupid, inane, pointless and howling funny. It is obviously made by people who are both fans of independent movies and who are aware of how contradictory that term is becoming. To genuinely appreciate this movie, it will help if you've seen the movies they're teasing. I'm sure part of the fun for some people will be trying to identify the thirty or more features referred to in the movie. Watching Pauly Shore getting his head blown off with what looked like a rocket launcher, and Jason Mewes as a sex starved answering machine are just added bonuses to this delightfully intelligent, stupid movie.",
         "First off, let me preface this by saying that I am a big fan of independent films. I saw this movie at the San Diego Comic-Con this summer. It was a work-in-progress screening so the movie may not have been finished, but I thought it looked great and was very funny. They manage to spoof a lot of films (over 20 if I counted right) and work the jokes into the story. Some of the movies they spoof are Pulp Fiction, Reservoir Dogs, Amelie, Memento, Run Lola Run, Pi, Sex Lies and Videotape, Swingers, The Good Girl and a bunch of others. There are a lot of different styles of humor so there should be something for everyone, and the characters and dialogue are funny enough to keep you giggling. And even though you don't have to know the movies they're spoofing to get some good laughs, most of the movies are ones that everyone knows about (Pulp Fiction, Memento) so chances are you've seen some of them. Sometimes it's actually fun to guess what movies they're making fun of! This movie is way better than movies like Loaded Weapon, Mafia, or even Scary Movie 3 IMHO. It's more like Not Another Teen Movie for independent films. I rated this movie a 9 out of 10 because even though it's not perfect, it does what it's supposed to do and it's about time somebody spoofed independent movies!",
         "The tag line for this movie says it all. \"The lowbrow comedy for the highbrow crowd.\" The people who like the lowbrow comedy won't understand the spoof, and the people who saw the highbrow movies won't enjoy see them spoofed. The crowd for this movie paper thin, but I happen to be part of the crowd. I loved this movie, I thought it was one of the funniest things I've seen in a looooong time, but I understand the low score because it is not for everyone. See the movie and have a laugh, it's hit or miss. If you are like me, you will love this flick, if you're not as the movie says: \"What did you expect? IT'S AN INDEPENDENT MOVIE!\"",
         "This movie is definitely one of the worst, if not the worst movie I have ever seen. I rented this movie and watched it with a few friends thinking that it would have some good laughs. As we have all seen the movies that it was poking fun at, I assumed we would get most if not all of the jokes. As we watched the movie, we quickly realized there were no jokes to get, because the dialogue was absolutely retarded. They spent so much time making fun of how independent movies are made, and how they follow the same style, and typical dialogue and weird ideas/characters. The worst parts of the movie were of the 2 guys making fun of pulp fiction, some of the gayest and worst lines in a movie. While I am positive this was the directors and screenwriters intent, I am also positive they expected these lines to deliver huge laughs. Another scene that was retarded was the john travolta rip-off taking a crap on the toilet. I'll bet they were dying filming that scene, and it comes off horribly. Avoid this movie no matter what, rent Donnie Darko, Matchpoint, or Punch-Drunk Love instead.",
         "Very unimaginative, terrible script, awful acting, lack of any substance even remotely humorous and for only an 80 minute film it seemed like eternity. Seems the only purpose of this film was for the film maker to insult and belittle several well known movies in a frustrating failing attempt, that were much better than any film this film maker would ever produce. It appears that the film maker is saying in this film, \"since I will never make a good film I will just create parodies of some and not be funny at it at the same time\".I have seen many movies and I would have to say this is one of the worst films I've ever seen. I only write this because I am upset that I will never get those 80 minutes of my life back.",
         "Movies like this give me hope as an aspiring screenwriter because if crap like this can make it out there, there has to be hope for me. This movie sucked, make that S-U-C-K-E-D, with a capital S! It TRIES to be funny but just redoing scenes from great movies doesn't make it funny. This movie was a waste of my life and waste of my time. If I were part of this film, I would NEVER include this film on my resume. It was disastrous, boring, uninteresting and not the least bit funny. I didn't laugh once, and I laugh very easily as anyone could tell you. It doesn't take much to entertain me, however this film doesn't even come close to being entertaining. DO NOT RENT THIS MOVIE!! You'll be sorely disappointed. 1 star out of 10.",
         "The movie was slightly funny, bearable to watch maybe. Unoriginal script is probably my main issue. If there is nothing else to do, go ahead watch it, don't expect it to be that novel independent film. It probably would have been better if they didn't attack good films, normally attacking the bad ones is a slightly better approach. I'm not defending all movies portrayed in this film, ie; Big Fat Greek Wedding. The movie was well put together except for the script, so at least you wont be completely disappointed, and like I said it is funny in a sort of monotonous, \"cliched\"-(sorry) way. All things being fair, I probably couldn't have done better.",
         "This is one of those genre-spoof films and while it's enjoyable if you're a fan of the independent movie scene, it might have been funnier if it had a little less creative integrity. The \"story\" is really just a coat rack on which to hang a bunch of references and observations of the conventions and clichés particular to independent films. It's basically a road trip where the guys from Pulp Fiction (Neil Barton and Eric Hoffman) grab one of the guys from Swingers (Darren Keefe) and head to Las Vegas to pull off a botched robbery in an abandoned warehouse. Along the way they kidnap the Jennifer Aniston character from The Good Girl (Paget Brewster) and run into that guy from Momento (Brian Krow), while the girl from Amelie (Ashley Head) and the guy from Pi (Rob Schrab) pop up throughout the film. The humor is a mixture of lowbrow fart, poop and sex jokes mixed with sarcastic digs at the highbrow pretensions of indy movies, and there's some genuinely good laughs on both levels. There are legitimate jokes, like when the girl from Amelie runs into the guy from El Mariachi on the highway - absurdist bits, like the foul-mouthed answering machine voiced by Jason Mewes – and general mockery, particularly of My Big Fat Greek Wedding. There are a couple of things that keep the movie from being funnier, however. One is that by focusing on independent movies, it faces a different challenge than other spoofs. The advantage of films like Airplane! or the Scary Movie series is that there are a lot of bad disaster or horror films that plenty of people have seen, so there's a buttload of easy humor targets at which to aim. But most of the independent films that are widely known are actually pretty good, otherwise they would never have become widely known. It's a little like trying to make a gangster spoof if the only gangster movies anyone had ever watched were The Godfather and Goodfellas. My Big Fat Independent Movie has to use really good films like Reservoir Dogs and Sex, Lies and Videotape as stand-ins for all of the really lame, \"we're too good to be entertaining\" indy movies that most people haven't seen. That's a much tougher comedy feat to pull off. Another problem is that the filmmakers stay too true to their concept. A lot of spoofs degenerate into stewpots where every joke possible gets thrown in, even if they have nothing to do with the focus of the spoof. And while it has some fart, poop and sex stuff, almost all of the straight comedy tries to stick to making fun of independent movies. That results in the film coming back to the same basic joke more than once and sometimes trying to mock things that aren't easily mockable. Though by sticking to their guns, the filmmakers do end up with some bits that are a lot smarter than you'd see in other spoofs, like the World's Largest Mexican Standoff. My Big Fat Independent Movie is definitely something you'll enjoy if you've watched a lot of non-Hollywood fare, but there might not be enough laughs for you if you stick with big budget blockbusters all the time.",
         "Philip Zlotorynski and his film, My Big Fat Independent Movie accomplished the humor and wit that the Scary Movie trilogy attempted and failed. This movie is one of the better spoofs that have been created to date. Zlotorynski's knowledge of the indie genre is apparent in this film's plot, which spoofs a variety of the biggest films in the indie genre. The main storyline is a mixed up version of Tarantino's Reservoir Dogs and Pulp Fiction. Though we first are introduced to the film's protagonists in a spoof of the naming sequence of Reservoir Dogs, the resemblance of Harvey and Mr. Fuchsia to Pulp Fiction's John Travolta and Samuel L. Jackson is unmistakable. The plot of the two films becomes even more intertwined when the audience is told that they are on a journey to an empty warehouse for a robbery (they are supposed to steal a suitcase). Zlotorynski even included the famous cutting of the police officer's ear scene from Reservoir Dogs. As a huge Tarantino fan, I was impressed with the director and author's brilliant portrayal of these two favorites. Though Tarantino's works are some of the best in the indie genre, My Big Fat Independent Movie would not have been as good without the intrusion of Memento into the plot. Leonard Shelby was the perfect choice for an antagonist and possible foil to the robbery plans of Harvey and his cohorts. Staying true to the plot of Memento, Leonard's character still has little memory and recollection of his past, and is still in search of revenge through his tattoos and photographs. However, this time he believes that Harvey is involved in the murder of his wife. I loved the part in which Johnny has the same pictures as Leonard because they came with his wallet. Also, one could not discuss this film without mentioning Zlotorynski's use of Pi, though in an extremely distorted fashion. I was upset with the distance in which the director traveled from Pi's plot in his spoof, but that didn't stop me from laughing. Instead of trying to decode the stock exchange and find a number that controls the universe, Maximillian is looking for the secret of the perfect corned beef sandwich recipe. I wish the electric drill gun scene could somehow have been added and spoofed as well in the film. Lastly, other films that were alluded to in the My Big Fat Independent Movie are Amelie, Run Lola Run, The Good Girl and My Big Fat Greek Wedding, of course. This film is perfect for anyone who loves the indie genre and films in general. Even a non-indie person will laugh throughout the feature due to Zlotorynski's wonderful directing and the writing genius of Chris Gore.",
         "Frankly as an Indy film lover and guy who works with Indy filmmakers myself. I've seen most of or know enough about most of the films being ripped on here I have to say this is so dead on. Don't get me wrong I love Pulp Fiction, Swingers, Run Lola Run and all the rest (except The Good Girl which this film so burns so rightly) but yes this film rips each one of them a new one. And the rip on \"The Good Girl\" OMG I couldn't have done or said it better. I know some people will see this film and lose their minds over the fact someone has the nerve to parody their sacred cows but yes someone did it and did it well. Even going after Momento and Amelie. By the way, the actress that parodied Amelie, she was great! The other actors were wonderful too. I can't say enough about how funny and in your face this movie was.",
         "without a doubt this is the dumbest movie I have ever seen. Exploitation producer, Chris Gore, came up with a title and a nifty poster and then, as an afterthought, the movie... and it shows! he even made up a totally fake sounding name director pseudo-name, Philip Zyozixgisijjti or something. that was the only joke that made me smile. the movie quickly went downhill from there and then hit a tree, burst into flames, killed all the forest animals, burned down the forest, and make Smokey the Bear cry. it was that offensively bad. this movie reminded me of a UWE BOLL film if Boll decided to direct his own Scary Movie spoof- style film. chris gore shouldn't be allowed to direct a film again. ever. stick to writing about movies, gore. clearly you don't know anything about making. them.",
         "Though it puts me in the minority to say so, the successful independent films of the past dozen years have been pretty awful. For every great picture like Clerks, there's a vast number of unwatchable ones like The Good Girl, My Big Fat Greek Wedding, Memento, Waking Life, and The Blair Witch Project. The talent behind My Big Fat Independent Movie realizes that just because a movie is independent and successful, it doesn't that the flick is any good. Taking a cue from the relatively recent hit parodies such as the Scary Movie franchise and Not Another Teen Movie, screenwriters Chris Gore (editor of Film Threat) and Adam Schwartz along with director Philip Zlotorynski have crafted an enjoyable, well cast, and occasionally hilarious spoof of most of (if not all) the indies of the 1990s and 2000s so far. Some of the best material comes from the Pulp Fiction and Reservior Dogs jabs, but where 'Independent Movie' really hits gold with its low brow, bluer than blue humor. It's very easy to make a jokes about excrement and sex. It takes certain skill to make the joke actually funny without seeming unnecessary. Finally, a comedy that knows exactly how to use its raunchiness correctly. None of that American Pie \"let's throw it in there to meet a running time\" found here. However, like with most spoofs, 'Independent Movie' runs pretty thin by the hour mark. Once the final act begins, the laughs become almost nonexistent. For that, I can only recommend the R-rated version as a rental. The unrated version may be slightly better. 6/10",
         "Nobody seems to have gotten this movie. It was supposed to be bad. It was total black comedy and utter satire. It was not supposed to make sense. It was supposed to be badly acted. It was supposed to be weird. It was supposed to be lame. It was supposed to make us cringe. It was supposed to use references as a jumping off point to nothing. It was supposed to have incomprehensible plot. It was supposed to have bad dialog. It was supposed to have unknown actors who only slightly resembled other people. Did anyone think this was supposed to be a straight comedy? I certainly didn't...and that is the whole roast beef sandwich. I didn't come here for some existential movie. It was a porthole between fantasy and reality. And the death of Kenny G.",
         "I cannot believe this abysmally horrible film is actually playing on Sundance as I type. I get it...they're making fun of independent films being popular now...since they have been hip to the concept for sooooo long...I'm sorry though...if you are going to make fun of the concept of being original and creative before every third rate hack artist steels your ideas and make them a cliché bit of Americana melodrama, you might want to start by being at least seminally clever. Because seriously...every film parodied in this z list hack job has been systematically appropriated by every pencil necked idiot with a digi-cam. If I had a nickel for every idiot who thought that they were into film for their obvious appreciation of appreciated independent films, then I would be rich (culturally rich) enough to not participate in these insipid forums... It is so poorly written, directed, produced, and acted in, that it should never be discussed or viewed again.",
         "Watched this movie at home the other day. It wasn't great. It has a real student project feel, over that of an independent film. But I set the bar low, and in my opinion, it wasn't as awful as some are making it sound here. It was a spoof, so really wasn't trying to do much of a story on its own. It was trying to comment on a lot of the clichés you find in a lot of 'high brow' independent films. That it did a pretty good job of. I like independent films. But if you don't, you probably wouldn't like this movie much. I laughed as it exaggerated devices and nuances one just accepts in these 'indy' films. I think it's nearly as smart as the films it mocks (which it never does in a spiteful way), even if it's not the funniest movie around. But if you wouldn't watch The Secretary or Amelie or Memento, why would you be angry at this film? It was funny. Not, Airplane! gag-a-minute funny, but worth a watch if you enjoy its fodder. But if you think those films are too good to be joked about, move on.",
         "Okay, I wanted to like this movie because I love spoofs and satiric films but this movie was way over the top. It was a combination of Pulp Fiction, A Big Fat Greek Wedding, and other films but the script lacked sense and the cast of characters were nobody familiar. I applaud first time directors who try to be innovative but the film needs some type of structure and I hope that they keep trying to spoof films whether classic or sensational. You can spoof so much more like Titanic and other popular forms of film. There is so much but you can't do it all in one film. First, the casting should have been better. The location shooting was fine but like again the film kept shoving popular film spoofs in our face. Most of us haven't seen all the films that they are spoofing."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Aloha Pictures",
         "Film Threat DVD"
      ],
      "summaries": ["\"My Big Fat Independent Movie\" is a spoof along the lines of \"Scary Movie\" and \"Not Another Teen Movie.\" It includes parodies of some of the indie film world's most renowned movies such as \"Memento,\" \"Pulp Fiction,\" \"Magnolia,\" \"My Big Fat Greek Wedding,\" \"Amelie,\" \"Run Lola Run,\" \"El Mariachi,\" \"The Good Girl,\" \"Pi,\" \"Swingers\" and many others."],
      "budget": 3000000
   },
   "movielensId": 136002,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-03-04",
      "dvdReleaseDate": null,
      "directors": ["Philip Zlotorynski"],
      "runtime": 80,
      "movieId": 136002,
      "title": "My Big Fat Independent Movie",
      "mpaa": "R",
      "actors": [
         "Paget Brewster",
         "Neil Barton",
         "Eric Hoffman",
         "Darren Keefe",
         "Ashley Head",
         "Brian Krow",
         "John Fortson",
         "Neil Hopkins",
         "Rob Schrab",
         "Regina Berger"
      ],
      "imdbMovieId": "0385890",
      "originalTitle": "My Big Fat Independent Movie",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["fvipnU9IjzM"],
      "plotSummary": "This film is a spoof along the lines of \"Scary Movie\" and \"Not Another Teen Movie.\" It includes parodies of some of the indie film world's most renowned movies such as \"Memento,\" \"Pulp Fiction,\" \"Magnolia,\" \"My Big Fat Greek Wedding,\" \"Amelie,\" \"Run Lola Run,\" \"El Mariachi,\" \"The Good Girl,\" \"Pi,\" \"Swingers\" and many others.",
      "tmdbMovieId": 27404,
      "avgRating": 2.5,
      "releaseYear": "2005",
      "numRatings": 1,
      "posterPath": "/qmfjng969NjJOcYwk7Nc3PX7vqq.jpg"
   }
}