{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0405052",
      "video": false,
      "title": "Irish Jam",
      "recommendations": [
         169800,
         16433
      ],
      "backdrop_path": "/lo1qUef1yOujhXbMHD3dN7DGwDq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jimmy McDevitt",
               "gender": 2,
               "credit_id": "52fe457d9251416c9103422d",
               "name": "Eddie Griffin",
               "profile_path": "/jgz5HDtC3aXYXBSULqay1PKWQOL.jpg",
               "id": 62842,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Michael O'Malley",
               "gender": 2,
               "credit_id": "52fe457d9251416c91034231",
               "name": "Christopher Dunne",
               "profile_path": "/8ky6LE3YTH0I9wFNEEvYQhmJ9vu.jpg",
               "id": 2052,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maureen Duffy",
               "gender": 1,
               "credit_id": "52fe457d9251416c91034235",
               "name": "Anna Friel",
               "profile_path": "/ccSUerm8OyftugbfsVdrrKKbBrv.jpg",
               "id": 58016,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pat Duffy",
               "gender": 2,
               "credit_id": "52fe457d9251416c91034239",
               "name": "Dudley Sutton",
               "profile_path": "/B5T9dy3eSv1ea9ZuWrz5kNwO7i.jpg",
               "id": 27393,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Lord Hailstock",
               "gender": 2,
               "credit_id": "52fe457d9251416c9103423d",
               "name": "Kevin McNally",
               "profile_path": "/fIJF3TZn8ckHkcl44oX77GvPv9e.jpg",
               "id": 2449,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Tom Flannery",
               "gender": 2,
               "credit_id": "52fe457d9251416c91034241",
               "name": "Roger Ashton-Griffiths",
               "profile_path": "/3lvWs4Kz0aATpcSY7PyPhkKgH6W.jpg",
               "id": 20243,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Pyscho",
               "gender": 1,
               "credit_id": "5a945e68c3a36824f9036160",
               "name": "Mo'Nique",
               "profile_path": "/2oXH2sx32C3w7t7HmorpPNGCUgG.jpg",
               "id": 60561,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Father Duffy",
               "gender": 2,
               "credit_id": "5a945e8992514141830303d9",
               "name": "Tom Georgeson",
               "profile_path": "/90IirxcNYdJANlTW1i782SGnCkn.jpg",
               "id": 8947,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Kathleen Duffy",
               "gender": 0,
               "credit_id": "5a945e96c3a3682517032e63",
               "name": "Tallulah Pitt-Brown",
               "profile_path": null,
               "id": 1986065,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Tony McNulty",
               "gender": 2,
               "credit_id": "5a945ea30e0a2616c30371a7",
               "name": "Tony Maudsley",
               "profile_path": "/7VjhAftH1YBVEm3GRznNiX0Q3Pu.jpg",
               "id": 79856,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Malachy McNulty",
               "gender": 2,
               "credit_id": "5a945eaf92514107a9021b34",
               "name": "James Bradshaw",
               "profile_path": "/oHaaaEdPYnLqaR5IwXqUKhDn57p.jpg",
               "id": 35922,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Sean McNulty",
               "gender": 0,
               "credit_id": "5a945ebb925141417d033a85",
               "name": "Nevan Finegan",
               "profile_path": null,
               "id": 53388,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Danny",
               "gender": 0,
               "credit_id": "5a945ece0e0a265f7a024ce5",
               "name": "Philip Martin Brown",
               "profile_path": "/624lOsRpzEdippiIUBDMijEGAx9.jpg",
               "id": 26857,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Milos O Shea",
               "gender": 2,
               "credit_id": "5a945edb9251414177035064",
               "name": "Angus Barnett",
               "profile_path": "/usYsWRccdM4Y00RycsQFFOdNVe.jpg",
               "id": 1714,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Donna",
               "gender": 0,
               "credit_id": "5a945ee80e0a265c4e0222ce",
               "name": "Marion O'Dwyer",
               "profile_path": null,
               "id": 78285,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Doc Murphy",
               "gender": 0,
               "credit_id": "5a945ef3c3a36824f9036271",
               "name": "Ray Callaghan",
               "profile_path": null,
               "id": 202439,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Mr. Pettikreep",
               "gender": 2,
               "credit_id": "5a945efe0e0a2616c3037249",
               "name": "Vass Anderson",
               "profile_path": null,
               "id": 101919,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Jeno",
               "gender": 0,
               "credit_id": "5a945f0cc3a36824f6035ef7",
               "name": "Wilbert Thomas",
               "profile_path": null,
               "id": 1986066,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Mr. Suzuki",
               "gender": 2,
               "credit_id": "5a945f15925141417d033b08",
               "name": "Togo Igawa",
               "profile_path": "/8rKFVCdEKIvHj1ZYdY6ya73VIpE.jpg",
               "id": 9192,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "5a945e32c3a3682517032db1",
               "name": "John Eyres",
               "profile_path": null,
               "id": 100369,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a945e380e0a2616c0038ad9",
               "name": "John Eyres",
               "profile_path": null,
               "id": 100369,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a945e410e0a2616c60380a4",
               "name": "Max Myers",
               "profile_path": null,
               "id": 963453,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.668063,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 34789,
      "vote_count": 5,
      "budget": 0,
      "overview": "Upon discovering that their town is up for sale, crafty Irish villagers scheme to raise the money to prevent the buy-out. They hold a poetry contest with a tempting grand prize -- the deed to their local pub. But what could happen when a duplicitous American rapper emerges as the best poet around?",
      "similar": [],
      "original_title": "Irish Jam",
      "runtime": 94,
      "poster_path": "/lhWA2xSoq4ArdBH8925TfTZV6wi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bauer Martinez Studios",
            "id": 34999,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Defender Production",
            "id": 7817,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hannibal Pictures",
            "id": 8692,
            "origin_country": ""
         }
      ],
      "release_date": "2006-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "The luck of the Irish just ran out.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Eyres"],
      "runtime": 94,
      "synopsis": "Jimmy The Jam McDevitt (Griffin) is a Los Angeles conman getting into all sorts of trouble. He is on the run from his ex-fiancé (MoNique) who he stood up at the altar and is dodging his landlord because he cant pay his rent. Jimmy enters a poetry contest sponsored by a town in Ireland with the hopes of escaping his troubles. The small Irish town is controlled by a greedy mogul and the only thing he does not control is the local pub. The villagers are unable to make the payments to support the pub and decide to offer a poetry contest with a small entry fee to raise the money needed to keep the pub. Jimmy wins by plagiarizing a rap song and submitting it to the locals. As the winner of the contest Jimmy travels to Ireland to become a first time local pub owner. Maureen (Anna Friel), a beauty with the voice of an angel, entertains pub patrons with Irish songs and soon finds herself falling for Jimmy.",
      "writers": [
         "John Eyres",
         "Max Myers"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0405052/",
      "coverLink": null,
      "actors": [
         "Dudley Sutton",
         "Tom Georgeson",
         "Anna Friel"
      ],
      "reviews": [
         "This movie was not even filmed in Ireland but rather Cornwall, England and is offensive to Irish citizens and wasn't worth the producers while to insult the Irish as nobody no matter what race will find these horrible movie funny. I wouldn't be surprised if not any of the movies directors, producers or actors had actually ever been to Ireland. It is about an American who gets evicted then decides to move to Ireland where everyone has no electricity, believes in leprechauns and has red hair! I did not laugh once during this movie and unless you think poor impersonations of Irish insults is funny then avoid this movie at all costs.",
         "bit of a spoiler at the end of this my gawd (to paraphrase our American cousins) Only watched this for a bed what a heap of unadulterated muck, how can anyone say that this is firstly any way entertaining. Listen lads i'm from Ireland, rural Ireland as a matter of fact and how anyone can say this is anyway remotely realistic or bearing any semblance to the truth is beyond me. Darby O'Gill, Finians Rainbow with it's leprechauns and little people is more realistic than this. But first and foremost you can overlook Hollywood 'orishiness' (tom cruises accent still one of the worst ever in home and away, Nicole kidmans accent actually not bad, but not to be nitpicking but as a landlords daughter she would actually have an English accent) if it is well made with a good plot, storyline, script and acting. The pinnacle of this of course is the Quiet Man, which is a great film despite it referring to an Ireland that only existed in John Ford's imagination. So don't be bothering with this rubbish (only one Irish actor in the cast) and get out some good decent Irish films like \"inside I'm Dancing\" or \"Michael Collins\" and save yourself wasting two hours of your life. (p.s i don't know how a whole village can be mortgaged)",
         "Don't know where this little gem came from, or if it ever appeared in any theater, but it tops most of what comes out of Hollywood these days. It's funny, touching, and a sensory feast for the eyes and ears. If you like anything about Ireland, you'll likely enjoy this movie. All of the performances are excellent. Be warned that is does deserve its PG-13 rating, so it may not be family-friendly for all. It's unfortunate that movies like this don't have enough pull to find a profitable audience, but I suppose that's where Blockbuster and the like can have an impact. It's a bit strange that the overall user rating on IMDb is rather low, but most of the reviews are favorable. In this instance, I think the reviews tell the real story. Give this one a try and judge for yourself.",
         "This movie caught my attention on Cable TV's HBO. I thought it would be a stereotyped, hyped, overblown character movie and I was absolutely correct - and I was also damned wrong too! How do you write a \"realistic\" script based upon a young black hustler from Los Angeles running a pub in Ireland? When has there been such an event to occur in the Emerald Isle? So give it a chance! No one really speaks about the Irish as \"Ni--ers\" in Europe and America. Call them the Fighting Irish, the Lucky Shamrocks, but this movie gave every viewer a new definition of the \"Black Irish\". So I was intrigued and astonished as the characters discussed this in the village square. Ireland is always romanticized and its traditions are to blame. Every Irish commenter complains about it - and I guess secretly would be mad as hell if Ireland ever lost its glossy image. What's a more \"realistic\" Ireland these days? I guess it's true that you get whatever you put into any subject. Let me say that Griffin marrying and kissing his costar at the end of the movie made my day! My ex-lover who's Irish married a black man and they have had quite an unusual romance (until he died) so it was entertaining to see ART imitate LIFE and not vice-versa for once... This movie is not a classic. Will never ever be a masterpiece. And I wouldn't want it any other way. Monique being kicked back into a bathtub wearing a wedding dress is not Shakespeare - it's funny! Watching an entire village nearly begging a lovable hustler to stay among them is priceless. My home of America is a true \"melting pot\" of just about every race & culture, the \"land of the free and the home of the brave\" - but I'll never see Ethnic Irish visitors being asked by the gangs of South Central Los Angeles to move in nor will I see it occur in Beverly Hills either. Yet I have enough faith in the Irish to see it happen one day to someone visiting like the \"Jimmy Jam\". This movie is an entertaining, multi-dimensional, comedic, fairytale, about what was never ever supposed to happen and did - against everyone else's say-so and better judgment. Watch it, laugh at it, ridicule it, and then when no one else is looking - love it. It's an original concept.",
         "I was shocked by how good this movie is! It was around St. Patrick's Day and a friend and I found \"Irish Jam\" in Blockbuster. We figured it would be terrible, but we took a chance. Thank God. This comedy is totally original and beautifully written. The comic elements are framed by tragic circumstances: poverty and the need for self-preservation. These elements give a poignancy and depth to the comedy that sharpen the film. Irish Jam is funny before \"Jimmy Tha Jam\" (aka Eddie Griffin) even gets to Ireland, but the film erupts in comedy once he does; the culture-clash gives rise to hysterical situations with fantastic dialog. If you come across \"Irish Jam\" I suggest you watch it! I don't think the movie has been publicized enough. You'll find the movie even better if you're familiar with actual Irish culture (not just wearing green and being an overly proud that you're third generation Irish-American).",
         "When I see Eddie Griffin I was thinking... \"Oh God, another vehicle for this modern-day Stepin Fetchit to come and trash in the name of appearing politically correct\" WRONG! Eddie as Jimmy McDevitt in the USA was a loser's loser - landlord tosses him and his possessions out, creditors at his back and a psycho lady (played by Mo'Nique, first time I disliked her - good acting) that he jilted is chasing him to the ends of the Earth... He butts up on a newspaper ad that he mistakenly thinks is the Caribbean, and ends up winning an Irish pub - which is where the fun begins! Jimmy getting used to Celtic maudlinery and their style of dancing and cadence of singing. Jimmy slowly getting entangled in a triangle betwixt himself and Anna Friel as Maureen a widowed lass who helps run Finnigan's pub and the man who came up with the idea to auction the pub to save the village from an evil land developer... Also the village's priest is the scene-stealer when he appears! A man of the cloth in leathers for motorcycling and punching when required, so much for pacifism! Lord Hailstock is the furthest thing from Irish you'd expect, totally Anglicised in the vein of a Colonel Blimp type, he ill treats his butler/secretary/manservant - eventually to his cost, when you see! The slow evolution of the romance between Jimmy and Maureen and the misperception of his actions and the deft insight of Maureen's daughter who's a self-inflicted mute after the death of her father combined with the other threads make it fine Celtic Tapestry.",
         "Saw this lurking in a corner of the DVD store and borrowed it on a whim. It was much better than I expected. Eddie Griffin was funny as usual, the beautiful Ann Fridel was great. Quick outline - village pub in Ireland is about to be sold to greedy land developer. To prevent this, the villagers decide to have an international poetry contest and give the pub to the winner. Ghetto hustler Jimmy Tha Jam(Eddie Griffin), on the run from various creditors and ex girlfriends, somehow wins the contest. Much culture-clash humour then ensues, but Jimmy eventually gets the villagers on his side. Much better than I'm making it sound here. Not too many clichés around, which is nice. Not to take anything away from Ediie, but I think if Will Smith had done this movie, it would have been huge!",
         "Excellent movie, AWESOME music.............as long as you can stand 1 obnoxious character then you will love this movie. I may be biased as I am Celtic and thus am partial to anything Irish/Scottish. The setting, characters and music really show the Irish traditions and make you fall in love with the country and music all over again. This movie has humor, romance, loyalty, depicts the \"fighting Irish\", has an old world feel alongside with today's American life...........it really has a bit of everything and really has some pretty quirky twists. Goes to show, you can't judge a movie by it's cover......it's almost like watching two movies in one or having two worlds collide. Watch this movie with an open mind and enjoy!!!!",
         "With all due respect to my Irish brothers and sisters, I wasn't too offended by the stereotypes in this movie -- African American OR Irish. It was just a cute film. I don't know Irish accents very well, so I'm going to assume, based on what many of the Irish posters said, that they were brutal. But, as far as escapism -- this did it for me. I love how parts of Ireland look (Damn you 'Quiet Man') and I wasn't disappointed by the pastoral beauty. I KNOW that it's an artificial view, just as artificial as a big, black, loud woman in a wedding dress stalking Eddie Griffin's character around the world. Give this film a chance just to touch you and it will. I'm not a big fan of Eddie Griffin and my only *minor* complaint with him is that this could have been a little better movie with a more skilled actor. Still, there's just a general good spirit that permeates this film. SPOILERS -- For those who see it as hackneyed, of COURSE, the mute child would speak by the end. Of COURSE, the bullies would get their comeuppance. And... OF COURSE the male and female leads were going to dance to some Motown in the kitchen. Sometimes I'm not in the mood for 'Happily Ever After', but these characters were pleasant and the female lead was a great singer -- and easy on the eyes. What was done exceptionally well, in my opinion, was that Griffin (for the most part) didn't turn into Super Black Man and pull amazing physical feats out of his cornhole. The scam was a bit untidy, though. For a central plot point, it should have been a little tighter. WHERE did the $90 million come from that they bated the villain with? And, if they had that much dough, why in the hell would they worry about the relative drop-in-the bucket amount that the town owed? And, as an earlier poster suggested - how does an entire village have one mortgage?",
         "This film had a typical and simple plot carried off in a pleasant non-overwhelming fashion. It was fun to watch, went through the usual ups and downs, and ended ... (can't say). If you like a movie that you can watch more than once, this is it. Basically, it is a story that addresses cultural stereotyping at it's core, but the simple love story and fun activities tend to overshadow the seriousness of that problem. There are certainly no surprises in the movie, which makes it good for a relaxing evening with spouse and family. Eddie Griffin does a good job of acting, as does Anna and the rest of the cast. The film also ends with a rather fun video that will make you smile and a few bloopers.",
         "I think that Irish Jam is by far the funniest, romantic, and heart-touching movie that I've watched. I might be only seventeen years of age, but i have seen a whole lot of movies, and so far this is the only one that I could watch ten times straight. Jimmy was hilarious with all his wangsta ways, and Maureen is a beautiful lady. The part that got me was the ending, Kathleen and Maureen just took my heart to tears with their acts. By the way where can I get the Irish music that Maureen sang in the show? Who's the original artist? I would really like to get her music! So please send me the name of the Irish music singer.",
         "How can anyone in their right minds think this kind of crap is either funny or entertaining? If it was made about any other country except \"cute Ireland\" there would be a lawsuit to end all lawsuits. Does anyone really think people in Ireland are this thick and uncouth? Why a fine actress like Anna Friel got involved is beyond me. Yes, I'm Irish and I notice other posts from Irish people, who feel the same way. There's a reason for that. We would like our country to be portrayed as a forward thinking financially successful European nation, with a buoyant economy, a well educated and industrious work force. We are not fools, living in mud huts who never shower and spend our nights drinking ourselves into stupors, as films like this portray us. Had to get that off my chest!",
         "Just the opposite of other's reviews... I too saw this lurking in the movie store the day before st. patty's day. Looked funny, had 'Irish' in the title, we'll give it a shot. Tapped the keg at 6am and watched 'Boondock Saints' (greatest Irish movie ever) then Leprachans II. We then watched 'Irish Jam'. The first half hour drove our buzz away quicker than St. Patrick drove the snakes out of Ireland. It was downright horrible, with the lame plot line, the shamefully stereotypical black dude that's in every cheap comedy, and even the Irish them on St. Patty's day couldn't save this peace of crap from being ejected. I purposely damaged the disc before returning it so no one else entering my movie store would subjected to such crap again. (If you couldn't tell, we HATED this movie).",
         "This film was absolutely brutal. i cant believe they even brought out a film like that about Ireland. i thought Jesus it must of been based on years ago,but it was not. Ireland isn't even like that now, having them all in the film going round wearing crappy old fashioned clothes. they made us look like scruffy old people. And we don't talk like that either.. the film hardly made any sense. i thought it would have been funny too with Eddie griffin in it. To be honest it was pure stupid. it made Irish look like pure fools.it has to be one of the worst films i have ever seen. i wouldn't bother wasting my time watching it if i was you..",
         "This is a cute movie...it's not meant to be an Oscar-winning masterpiece, it is what it is...and it's cute. The village may be depicted as a bit of an \"European Cliché,\" but it makes the movie all the more charming. If Irish people really are insulted by it...I honestly don't know why. Why would anyone be insulted as being portrayed as a hard-working, religious, honest people? I am from the mountains of North Carolina, and often my people are portrayed as \"hillbillies.\" Does that offend me? NO, because some of them are...and even if I don't consider myself a \"hillbilly,\" I am PROUD of where I come from...and proud of my ancestry - ALL of it...the \"hillbillies,\" the \"rednecks,\" and the \"educated, Southern don't-want-to-be-associated-with-North Carolina's-past\" people...all of them...so, why aren't the Irish proud of this...even if it relies somewhat on cliché'??",
         "I think this film was very funny, and they were stuck doing some stereotypical moments in the film, but overall I was really interested in their editing. Quick edits, sometimes 4-5 segments right on top of each other within 2-3 seconds. I love that. The editing style reminded me a lot of 'crank' which you may love or hate, but the piece was fun. The emotional reactions of half the actors really felt very realistic, and the parts that didn't were incredibly scripted. It was interesting to see the age groups approve more of this film the younger they were, must be not quite set in their ways. Funny how the film is about that even. The soundtrack was pretty well scored too, and it felt like it just fit. Its good to see the acting talent actually sing instead of be voiced over constantly. The voice acting was very clean and some digital effects had to be introduced, because they sounded extremely clean. If this is all too technical, Ill let you back to the other postings. Also, I think the outtakes are pretty funny. Really funny to say the least.",
         "You've seen it before and if you have, I certainly have seen too much of it. What will they think up next, I wonder, considering they haven't thought up anything since they were born? Let me summarize it: lovely ethnic community in trouble; evil (or rather obnoxious) guy trying to steal their livelihoods; differently ethnic street punk, accidentally finding himself in the posture of the hero; normal cliché loud smart-mouth, always saying something sounding funny, but which isn't; lovely ethnic girl who is at first repulsed and then attracted by our hero; hero seeming to fail miserably, then succeeding, mostly due to luck. And no, I did not spoil anything, since you've seen it all before. That was my point!",
         "I cringed a little when I picked up the DVD of Irish Jam, it had all the hallmarks of a 'lets send Eddie Griffin to a wee old Irish village and have the leprechauns steal his lucky charms' type movie. However I was sort of pleasantly surprised after viewing it. Irish Jam is a nice story. Basically, a small Irish village is in trouble of being bought out by an aristocratic Englishman, Lord Hailstock (Kevin McNally), who wants to turn it into a theme park called Leprechaunland. The only place in the village not owned by him, and therefore the final piece in his puzzle, is the local pub. The owners of the pub can't afford to keep it and to avoid having to sell it to him decide to hold a worldwide poetry contest which will raise the necessary funds to keep the pub, and present it as a prize to the winner, keeping it out of Hailstock's hands. Meanwhile in America, Jimmy McDevitt (Griffin), a down and out amateur conman, comes across an ad for the poetry contest in a newspaper. What follows is a nice story of friendship amongst clashing cultures in which Griffin is both funny and sweet. The fact that this movie is filmed in England and not Ireland doesn't really make much difference, as the Cornwall setting could just as easily be mistaken for rural Ireland. My main, and big, gripe with this movie is its casting. More or less ALL of the Irish villagers are played by English people. Not so bad if they could all do good Irish accents, but they can't. Some sound like they have been practicing with re-runs of Ballykissangel, others like they have been forced to watch the Commitments over and over. It ends up like a mismatch of Dublin, Belfast and Kerry accents and wannabe Irish accents. How hard would it have been just to get ACTUAL Irish actors? To put it in perspective, its like having a movie set in a tiny Essex village where the 'locals' have Liverpool, Manchester, Sheffield and Glasgow accents. Or having a movie set on a ranch in Texas where the 'locals' sound like they're from the Bronx, Chicago or even Toronto. Maybe viewers who don't know any better won't notice. But any Irish viewers, or probably anybody who's ever been to Ireland will cop on immediately. All this aside, Irish Jam will more than anything probably leave you with a good feeling in your heart and a song in your head. Albeit song you might want to jig and breakdance to all at once.",
         "Though Eddie Griffin's performance can grate on one's nerves (he tends to overact)but what you have to watch for is the amazing performance of Anna Friel, just before she won the role of Chuck on the television series \"Pushing Daisies.\" She and Ireland are a lovely combination not to mention the familial bond between her and the young girl who plays her daughter which I found endearing. I definitely liked the cultural crossing aspect of the film, a bit of an unusual twist on a 'fish out of water' story. The video and blooper reel during the credit roll is amusing, the village actors seemed like really great sports. My only question is where to purchase the soundtrack? Loved Anna's traditional Irish singing!",
         "I loved the movie... At first Jimmy's character is a bit annoying and over the top, but after the movie gets past the beginning and you get to know the characters more, the movie sets somewhere in your chest and you'll never forget it. Also the theme song, \"Irish Jam...\" will stick in your head like an addictive commercial jingle. Even though you've seen the character types a thousand times in other movies, the characters are very unique. My wife and I are still mentioning scenes and characters a week after seeing this movie. I'm almost embarrassed to say that I enjoyed the movie as much as I did, but I really enjoyed this movie. No, its not going to win any Oscars for acting or direction but the movie does stay with you.",
         "Fun entertaining movie that brings together hip-hop and Irish folk music. How many movies do that effectively, or at all? I have to admit I love almost all Irish-themed movies and this is no exception. Eddie Griffin is wonderful. His best role yet. Funny and warm and romantic. Who knew? The music in this movie is fun. The plot may not win any awards, but the acting and the characters in the small Irish town are cozy and feel like family. Eddie's love interest and her daughter have great chemistry with Eddie's character. His character really grows during the film, at first very distant and the typical con-artist then turns into a sensitive sweet guy, his facade being broken down each day he spends in this beautiful little village.",
         "This movie totally was an unexpected Miracle. This movie was wonderful. Beautiful and simply one of the best romantic movies I have ever seen. The director, writers, actors were simply excellent. The fact that this was a modern day movie and not something set way back when was also nice. Braking racial barriers and bringing reality to the screen with humor was excellent. The witting was such that it Made me feel as if I was in the movie with them. My brother told me about Irish Jam, I'm 100% glad that I finally watched it. Me and my wife watched it, and I both agree that its got it all. Suspense, villain, Heroes, Comedy, Tear Jerker and a great original Story line. 10 Stars movie. Good music, good Comedy, all around fun. JEM",
         "A beautiful movie in several ways. Anna Friel as Maureen is lovely to watch as her past and background develop. Her daughter, played by Tallulah Pitt-Brown, is charming and nearly steals the show in many of her appearances. But the real star is the village of Ballywood, which exudes old-Irish charm ... as it eases into the 21st century. Ireland of today is not the third world country of last century. As the townspeople accept and embrace Eddie Griffin's character, their personality unfolds. Great music, scenery, and characterizations round out an enjoyable movie."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Bauer Martinez Studios",
         "Defender Production",
         "Hannibal Pictures"
      ],
      "summaries": ["Upon discovering that their town is up for sale, crafty Irish villagers scheme to raise the money to prevent the buy-out. They hold a poetry contest with a tempting grand prize -- the deed to their local pub. But what could happen when a duplicitous American rapper emerges as the best poet around?"],
      "budget": 10000000
   },
   "movielensId": 136008,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2006-01-01",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 94,
      "movieId": 136008,
      "title": "Irish Jam",
      "mpaa": "PG-13",
      "actors": [
         "Eddie Griffin",
         "Christopher Dunne",
         "Anna Friel",
         "Dudley Sutton",
         "Kevin McNally",
         "Roger Ashton-Griffiths"
      ],
      "imdbMovieId": "0405052",
      "originalTitle": "Irish Jam",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Upon discovering that their town is up for sale, crafty Irish villagers scheme to raise the money to prevent the buy-out. They hold a poetry contest with a tempting grand prize -- the deed to their local pub. But what could happen when a duplicitous American rapper emerges as the best poet around?",
      "tmdbMovieId": 34789,
      "avgRating": 2.5,
      "releaseYear": "2006",
      "numRatings": 2,
      "posterPath": "/lhWA2xSoq4ArdBH8925TfTZV6wi.jpg"
   }
}