{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0903606",
      "video": false,
      "title": "Hooking Up",
      "recommendations": [
         75013,
         32367,
         27226,
         46534,
         27408,
         27047,
         293901,
         97683,
         21509,
         39997,
         83866,
         56325,
         47107
      ],
      "backdrop_path": "/6fE3foeyPmfBDh5zl602S7HNfrC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Ryan",
               "gender": 2,
               "credit_id": "52fe4407c3a368484e00b4f5",
               "name": "Corey Feldman",
               "profile_path": "/odE8az9kgHCkWMtWzfmcDBuZiww.jpg",
               "id": 3034,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Dr. Jordan",
               "gender": 2,
               "credit_id": "52fe4407c3a368484e00b4f9",
               "name": "Brian O'Halloran",
               "profile_path": "/Ah9gKFDAfCthMIL4bjItjlut4vd.jpg",
               "id": 23629,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Mr. Kimbal",
               "gender": 2,
               "credit_id": "52fe4407c3a368484e00b4fd",
               "name": "Bronson Pinchot",
               "profile_path": "/hGaFZsohQbRIskmkLtNbwJNgLPN.jpg",
               "id": 4689,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Dave",
               "gender": 0,
               "credit_id": "58124b2ec3a3687a9d01a7ee",
               "name": "Josh Macuga",
               "profile_path": "/4xVJpfOdH1sAZjKAWtP3bKlQLPf.jpg",
               "id": 1003283,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4407c3a368484e00b4eb",
               "name": "Jeff Siegel",
               "profile_path": null,
               "id": 86908,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4407c3a368484e00b4f1",
               "name": "Vincent Scordia",
               "profile_path": null,
               "id": 86912,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.074142,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20983,
      "vote_count": 10,
      "budget": 0,
      "overview": "After \"hooking up\" with a series of guys at a house party, April is the talk of her high school.",
      "similar": [],
      "original_title": "Hooking Up",
      "runtime": 95,
      "poster_path": "/vdS9WgkSbXVfgCCFL8roLcvKzEn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bipolar Films",
            "id": 3875,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Entropy Entertainment",
            "id": 3876,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Morbid Mind Productions",
            "id": 3877,
            "origin_country": ""
         }
      ],
      "release_date": "2009-01-01",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.morbidmindproductions.com/hookingup/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Vincent Scordia"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Jeff Siegel",
         "Jeff Siegel"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0903606/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTIxNTAzMjk0MV5BMl5BanBnXkFtZTcwMzQ4OTkwMw@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Corey Feldman",
         "Brian O'Halloran",
         "Bronson Pinchot"
      ],
      "reviews": [
         "I love a good \"stupid comedy\". This thing was just pathetic though. I did not laugh 1 single time. I'm really not even sure what part of this movie qualifies it as a comedy of any sort. The acting was awful to awkward. The camera work was amateurish. There was no plot, no twist, and no end. The soundtrack didn't even make sense with the movie. Simply put, there really is not one single redeeming quality about it. I am ashamed to say that I wasted my time watching it. No matter what anyone tries to tell you, don't fall into the same trap I did. AVOID IT AT ALL COSTS.",
         "This weak, unbalanced and (mostly) unfunny attempt at a teen sex comedy left me with a new lack of respect for Corey Feldman, which is quite a feat. It's full of dialog that you can tell is SUPPOSED to be funny, but never really manages to draw out a single laugh. The opening scene is a prime example of this...if you don't laugh in the first five minutes of the movie, just turn it off because you are in for a whole lot more of the same. The pacing of the movie doesn't make any sense. You'll see Corey Feldman (Ryan) do mean thing after mean thing to his decade-younger girlfriend, only to have her come crawling back every time, never learning a thing. You expect some kind of turnaround or revenge to come out of all this suffering, but it never does, which makes the movie's ending all the more depressing, not to mention sudden. It's as if they ran out of budget in the middle of shooting and the director said, \"Okay, I guess we've got our movie!\" If I were being forced at gunpoint to say something nice about the movie (which I am, at this very minute, please help), I'd say that Leah Viens-Gordon (Michele) is a cutie and probably has the potential to become a decent actress. There, I said it. Now please let me live!",
         "No, I'm not a teen (I'm 40+) No,I don't rent films like these to look at hot chicks having simulated sex. But I admit that I like high school comedies when they are close to good. But this isn't a bad copy of American Pie. It's much worse than that. To see Corey Feldman in such an awful film is sad but maybe not that surprising. To see Brian O'Halloran from my old favorite \"Clerks\" in this is more depressing. I'm not a fan of censorship but there should be some punishment for making films like this one. I would rate it 0 out of 10 if possible, but I give it 1 star because of the hilarious joke that O'Halloran (born 1969) plays a 45 year old dad while Feldman (born 1971) plays a 25 year old hunk.",
         "Movies are supposed to cause you to feel emotions for the characters, good movies will leave you talking about the film to others and referring to the characters as if its real. This movie caused some emotions, mostly anger, but not in the good movie kind of way. The \"villain\" of the story never gets served, instead it feels he is glorified, and that I place on the screenwriter/director who is the age of said character... As a low budget put together movie, it has its ups and downs, mostly downs. There were some good acting roles by the younger cast, mainly Alison Whitney (Caroline), although Parker Croft (John) did an above average job as long as he's not really like that in person. The different characters' stories did a okay job of coming together at the end, I still feel there wasn't resolution between the brother and sister (Jim deProphetis and Allyson Muñoz; Colin and April respectively) as well as poorly put together ending for Caroline and Ryan (and Michelle). Stick around for the credits for John's predictable ending. In the end, if you are into VERY crude language and poorly written jokes, you might enjoy PART of the movie. Would I buy the movie, never. Rent it, probably not. Watch it online (netflix, etc), not more than once.",
         "I bought 400 DVD's for 50 cents each when our local rental store went out of business. In that group there were some truly awful movies, but \"Hooking Up\" was by far the worst of the bunch (no contest). It occurred to me during the painful viewing process that the whole project must be one huge inside joke. The three featured actresses (a term I use loosely in this case) have minimal physical appeal. Given the target audience, it seems inconceivable that such casting choices were unintentional. Perhaps the producers just wanted to get a laugh thinking about the disappointment of anyone who rented this thing for its promised exploitation potential, only to end up with a long episode of \"The Animal Planet\". The main reservation I have about this theory is that the DVD has a bunch of features: behind-the-scenes, interviews, deleted scenes, outtakes, etc. In all of this stuff I did not detect the remotest sign of the presence of any intelligent life forms associated with the project.",
         "This is as bad as movies can get. Camera-work and editing is, like other comments said, home video quality. Actors act like it's their first attempt in front of the camera. Script doesn't make sense. During dialogues, characters constantly say things that don't make sense in the context, things no one would ever say. I'm not sure which parts of this movie were supposed to be comedic. There is a little nudity but it's badly shot and lit that it doesn't look the least bit sexy. Characters are all irritating, inconsistent, and the movie abruptly ends without any of story lines being wrapped up (some just get forgotten along the way). Attempts to imitate other movies of the genre and likewise irritating. And are times that bad for O'Halloran and Feldman that they have to take roles in movies this bad? Don't watch this movie, even if you're an avid fan of teen sex comedies. There's nothing in it for you and you'll just be bored for an hour and a half.",
         "Corey Feldman, Bronson Pinchot and others in what is little more than a soft core comedy about teenage sex. The film (I use the term loosely) would be okay if there was some funny humor instead of crude talk but there isn't. Worse the film seems more like a glorified home movie put together in order to get girls for the cast and crew. I'm guessing the availability of female flesh was what got the male actors involved, because it wasn't the script which seems to be little more than just sexually explicit talk. I have no idea who this movie was made for\u0085no wait it was made to for crew to get girls, I just don't know why we're being asked to pay to see this since its not very good. Then again if this makes money I might consider putting my home movies out on DVD and fleecing the public as well.",
         "This is the worst piece of crap in the pants movie I've ever seen. You ever watch Blood Rayne? That movie is a masterpiece in comparison. Corey Feldman is a giant douche. The female characters are retarded weak. The skinny guy and his friend are the only good quality of this movie...But it's more because of the individual actors than anything else. The production quality is fair. The screenplay is horrible. Jeff Seigel should stay a production assistant because he sucks as a writer. This movie is garbage. I'm actually upset that my day has been ruined by just watching this movie. Oh, and I almost forgot to mention, the movie doesn't really end. It just kind of stops...Which I was happy about, but the fact that their is no real story to it at all probably greatly contributes to its overall crapping. Their is no conflict, or rising action, or resolution. It's is just an hour and a half of vomit inducing crap. I've had more fun pissing blood than watching any part of this movie. Oh, and two of these reviews, the one from the Cohen guy, and the one from the Jacob Hester guy are probably people who were involved with the movie, and are full of baloney. (The Cohen guy's email address starts with info...I'm guessing info @ hooking up movie .com.)",
         "I just finishing sawing the film now, and i am wondering if this is the worst film i ever seen... it has no history, no main action, and no truly end, this seems more like an episode of a TV series... The filming team, is one of the worst ever, looks like a home made video, and the sound??? horrible, there is a moment that the action goes on in a house where they were making a party, and all you can hear is voices... and the sound track of this film must have only 3 or 4 tracks... i cant understand how did they did the cast, because all the girls in here are around 16, and in the real life they must be 20 or over!and in the film they have sex... seems more like child pornography, not to mention that any of the girls that participated in the film were really hot.... They where ever stupid enough to make a homosexual part that is not ever explained in the film. This is just a big failed movie.",
         "This looks like a 70's XXX porn movie where people without the budget or the any near approximation of the talent tried to make an actual narrative film and failed miserably. But the target audience didn't really care because, hey, it was porn. Like a porn movie, the actors in this are all WAY too old for the characters they play. Corey Feldman is supposed to be 25, but was about 40. And I'd guess all the \"teenagers\" are played by actors at least five or ten years older. Like a porno, the characters are all paper thin and the situations so absurd that this doesn't begin to make it as a serious drama. But if it's supposed to be a comedy, it's not funny, and some things are actually pretty damn unfunny (although the people getting offended or saying it should be \"illegal\" are overreacting a little). The problem this movie has is it's NOT a porn movie. There are only a few boring boob shots of the three \"teenage\" actresses. Instead, it just tries to be REALLY outrageous, kind of like \"Clerks\", but it REALLY makes you appreciate the relative talent of Kevin Smith. Here you just have horribly misfired jokes about anal sex, incest, \"virgins\" who perform oral sex on everybody, \"glory holes\", \"seagulling\" (don't even ask), cocaine, girls being slapped around and called the \"c word\" that rhymes with \"punt\", and perhaps worst of all, washed-up 80's child actor Corey Feldman having sex with three different 15-year-old girls (OK, they're obviously not really 15, but still. . .). The other two name actors, Brian O'Halloran and Bronson Pinchot, manage to maintain what little dignity they had to begin with. O'Halloran plays a characters his own age (the school principal) and Pinchot plays a teacher who fends off one of the teenage girls after she slips off her thong after class and tries to seduce him (in an ACTUAL porno movie, she would certainly have succeeded). This isn't good. It isn't so bad, it's good. But it IS bad in a horrible, slow-motion car crash kind of way. You can't easily look away (as much as you may want to), and you really have to wonder what was possibly go through anyone's mind here. I'd buy the theory of has-been actors and never-will-be filmmakers getting together to lure impressionable young actresses by making a \"movie\". But why actually put film in the camera? And why foist something on the public that will actually do MORE damage to your completely moribund career? This is SO bad it's actually kind of fascinating in a morbid way.",
         "This movie is about three teenage girls who are exploring their sexuality, and how different guys they come in contact with react to the girls' promiscuity. I didn't like this movie because it supports the emotional abuse of women. The three main characters all do sexual things with guys, and none of the girls is painted in a good light by the director. I am a guy who is not a feminist, but this movie still ruined my night. If you are a sadist and hate women, you might like this movie, otherwise don't watch it. The way the movie paints the main female characters makes you question if the director had a bad relationship with his mom or got cheated on by a past girlfriend and is still bitter about it. Aside from how depressing it was, the movie's plot was disjointed, there was some decent character development, but there seemed to be no resolution. There were a lot of loose ends left at the end of the movie.",
         "Well first of all, it's all about sex, this girl gives head to a bunch of guys at a party and thinks shes not a slut because she didn't have sex, dumb girl. A bunch of teenage sex, something that most people don't do in school, talk extremely loud about sex, student trying to hook up with a teacher or anybody she can so she can be ahead of her friend (the one who is giving head to everybody) the Average slut scene. This is pretty a movie about teenage girls, how stupid they can be, how much of whores they can be. A lot of fake things and stuff that most people wouldn't do or more people wouldn't be stupid enough to stay in an emotional or psychically abusive relationship(another girl in the movie) But above all if you like seeing teen girls slut about school and three guys talk about sex one of whom is shown masturbating for at least half an hour of the movie off and on, one who is constantly looking up different disgusting sex rituals and one of whom is actually normal, a fourth guy who cheats on his girlfriend, beats her and emotionally abuses and is a pedophile then this movie is for you. -90 out of 10 stars.",
         "Just saw a screening of this movie and I found it enjoyable over all. The aptly titled Hooking Up is a humorous look at a lot of teenage social trends that have started to get a little attention lately – casual oral sex which is viewed as a way to preserve virginity, friends with benefits, the lengths girls will go to get popular, unhealthy, obsessive relationships, etc. It then also goes on to highlight a series of sexual \"urban legends\" (or perhaps \"suburban legends\" given the setting) which are found on the internet – a gloryhole, rainbow parties, and (the one you'll be talking with your friends about) something called \"seagulling\" – creating an interesting mix of the realistic and the absurd. The stars are mostly young unknowns who all managed to do well. Parker Croft (who plays John Johnson) definitely stood out to me, delivering an energetic, poised, and hysterical performance, and definitely got the most laughs. Keep your eyes open for this guy, he's going places. Of the veteran actors, Bronson Pinchot's cameo role of Mr. Kimbal, a chemistry teacher who is constantly dodging one student's ravenous attempts to sleep with him, was hysterical. Brian O'Halloran, best known as Dante in the Clerks movies, held his own as the naïve high school principal. And Corey Feldman was cast well as the consummate asshole Ryan, an older guy that preys on insecure high school girls. If I had complaints they would be that it was a little too sprawling and not focused on any particular character long enough. It revolves around 7 characters sort of drifts in between story lines, but they did a decent job of tying everything together. I thought the ending of the Ryan/Caroline story could have been a little stronger as well. It doesn't have the look of a polished Hollywood movie, but I think it works well for what it is. Especially once I heard about how it was made – by a few friends who pooled all their money together after graduating from college. I definitely respect the \"do it yourself\" approach they took. There were some really hilarious moments throughout this dialogue heavy film (a lot of which reminded me of early Kevin Smith lines). I really enjoyed the whole \"seagulling\" storyline, and thought it was a fresh, independent take on a lot of these cliché teen sex movies. I don't think it's winning any awards, but it's entertaining, good for some laughs, and will definitely spur some interesting conversations amongst friends. Definitely worth a rent.",
         "Im not a perverted pig by any means at all but this movie is so full of sexual content you would think there would be a little more nudity, but no. I was so bored with this movie that i actually fast forwarded to any parts that may have had nudity in them. Granted these teens were portrayed as under the age of 18 the funny thing is they show the actress that is portraying the youngest teen in the movie. This movie flat out sucks harder than the chick who give BJs through it, at least she was hot, the only good part about this movie. Corey Feldman is, was, and always will be a douche for making this movie, even though he was one before.",
         "I came across this film while browsing for some American (my country of origin) movies in downtown Tokyo. It purports to be part of the American Pie series, but you can tell it was not created with that intent. In fact, I had to search under Corey Feldman's profile to find it under this title, since the Japanese title is \"American Cherry Pie.\" I have to say I was pleasantly surprised with the movie. It's clear it wasn't made for a big budget, but the dialogue is sharp and fast and John (Parker Croft) in particular does a good job with the comic timing. The opening track scene drew me in and left me wanting more. The girls were serviceable, but I found myself more interested in the conversations between the guys. I was also somewhat taken out of the film when Corey Feldman was on screen. Maybe it's because he's a \"face\" or because he's never been a super-strong actor, I don't know. Bronson \"Balky\" Pinchot, on the other hand, was terrific. You could tell the old guy was having some real fun working with a young cast. His character wreaked awkwardness in the best kind of way. I only wish he had a meatier role. I could watch a film based around that character and his foibles. The film was a bit sprawling, but the dialogue and situational comedy kept my attention. I didn't expect much more than an American Pie ripoff, but what I got was more like the teenage version of \"Clerks,\" which was appropriate given the presence of Brian \"Dante\" O'Halloran. I don't know if the film is out stateside yet (I checked Amazon and didn't see it), but when it does come out it's certainly worth a watch or two. There are some very memorable scenes, to say the least. I mean, who hasn't wondered about a girl born with two vaginas?",
         "This movie is a brilliant combination of hilarity and drama. It is a story of a group of friends and their sexual woes. The side story shows the hardships of abusive relationships. Corey Feldman and Parker Croft give two of the most compelling and riveting performances to date. The sexual scenes of the movie are tastefully done. The nudity is not over the line and allows for some mystery. However there are two major flaws. Firstly there is more plot in porn than in this movie, and secondly the budget for this movie was probably the amount of money it took to pay Corey Feldman. The soundtrack is weak as it is one guitar riff that plays over and over again. I am fairly certain the crew walked around a neighborhood to break into houses they could film in. Overall the movie is a glorified home movie, but it is so bad that it is fun to watch.",
         "As teen films go, it doesn't get much better. Yeah, the acting may not be perfect, but it's very believable and you'll find yourself woven into the story, feeling it. It's unique or near unique in the approach. This isn't a happy ending teen romantic comedy. It's comedy, it has romance, and of course nudity because it's intended for young males mostly, but this is a film that girls must see. There's enough male flesh that teen girls don't have to be concerned about suffering though just the typical teen guys with lots of hot naked chicks film. It's also an excellent story for guys without sisters. It brings reality and perspective into teen relationships while still being funny and sexy and having a good enough soundtrack to not feel like it's another film directed to sell you old music.",
         "I have to admit this movie was good with the three main guys (tyler, and I cannot remember the others). The intro is funny, especially the two vagina joke. The library scenes are also super funny. However, not to sound like a misogynist, but the parts with the girls weren't funny. Actually they were terrible. I know stuff like that happens, like an abusive boyfriend or becoming a slut, happens to girls but dear God. They were a buzz kill to the comedy. And I thought that during the time the Caroline (the blonde girl) gets hit and then gets cheated on would have some comedic relief, but none was deliver. I would honestly skip the last part of the movie and just go to the credits.",
         "I'm sad for these actors, all the crew members, anyone who spent money on this movie, and now for me for having seen it. I have never written a review, just came to read others, but have to say... how anyone ranked this with anything more than 1star? In response to reviewer Awduvall, imagining a camera left on then put into its case to shoot the silent interior of its case... that WOULD be better than this... thing. I'm sorry Balki Bartokomous, absolutely NO happy dance for this.",
         "The other reviews are correct this maybe the worst movie EVER. I mean lets forget about the weak writing and plot, that could have been made up for. But the acting. I honestly thought I ran into someone's high school film project, and not a GOOD high school film project at that. Its weird the 3 random \"stars\" they got in the movie including Dante from Clerks (he sucks in this) The biggest travesty is Corey Feldman yes 45+ years old Cory playing a 25 year old kid, I assumed he wanted the role to make out with 20 somethings?? I mean really??",
         "This movie ranks among the all time worst that I have ever seen and that includes the movie \"Bullet\" which I previously had as the worst. The jokes were lame and juvenile, the acting poor, the plot nonexistent. There was no character growth or development, even for a misfit comedy. It's kind of like the movie started one way and then ended the same way. Don't waste your time. Usually movies with substance this weak will at least have some laughable moments. There were none. It's amazing what gets funded and produced. I wish I'd read the reviews prior to me watching on Netflix. Shame on me! Should be a zero out of 10.",
         "This might be the worst teen movie I have scene in years. Considering it was made in 2008 but not released until 2013 probably says something. There were some funny parts. At the same time there were so many plot holes. They didn't address it was actually the brother who gave his friend oral through that glory hole. Also I'm sorry a\"25\" year old sleeping with a 15, 16 year old and nothing happening to him I kept waiting for him to get turned in to the cops on rape charges. But guess it was OK for an adult to sleep with kids. The funniest scenes were with the Tyler character especially in the library. All in all the story was uneven, maybe all these story lines came to an end but then the editing was awful. But hey Josh \"The Wildman\" Macuga is in it!!!",
         "You would assume that from the looks of this movie that it is going to be yet another of those generic teenage comedies. But this is so far from it. You wonder just how this movie came about into existence. The storyline was as atrocious as the acting was. This movie was nothing more than director Vincent Scordia's chance to show of sexual exploits without actually delving into the adult industry. The storyline was so unfathomably weak that it got lost along the way of trying to put sexual exploits to the screen. The acting in \"Hooking Up\" was just as non-existing as the storyline, and it was hard to think why the actors and actresses would agree upon to being in this movie after having read the script. And Corey Feldman was of course the main attractor on the cast list, but wow, are you kidding me? This was just painful to witness. Not amongst my favorite of actors, sure, not by a long shot, and not since \"Friday the 13th part IV\" has I stumbled upon anything impressive from him. Running at an hour and thirty-five minutes, this movie is one to avoid at all costs. Take heed to the low rating it scored here on IMDb and give it a wide berth. Some of us suffered through this atrocity of a movie so the rest of you don't have to.",
         "This website lists Bipolar Films, Entropy Entertainment, and Morbid Minds Productions as the production companies of this film. I absolutely cannot believe three companies were all willing to spend money on this movie. Granted, after watching the film I can't assume it was that much money. Does your town have a local business that makes terrible commercials starring the owner trying to demonstrate a humorous situation explaining why his prices are so low? You know what I mean, local car dealerships are notorious for 'em. Everyone of those commercials is a cinematic masterpiece compared to \"Hooking Up.\" Every single video on youtube is better than \"Hooking Up.\" If you forgot to turn off your camcorder before putting it back in it's case, inadvertently filming darkness until the battery ran out, you would have made a movie better than \"Hooking Up.\"",
         "Let me ask you one thing: Do you care how this movie was made? I'm not asking because I try to be mean about it, it's just that this low budget movie had a difficult standing all along. But does that or should that change about how you should feel about it? And let me make one thing clear, I admire the filmmakers, who went out and just did it (no pun intended). It's one thing to talk or criticize movies, it's a different ball game, making one. Still having said all that (and if you watch the interviews on the DVD you will see, they are likable), that does not change, that the movie never reaches any potential it set out to achieve. I'm not even going to compare it to American Pie or other successful teen comedies (maybe the latter installments of the American Pie series ... they weren't that good either). One of the main problems are the characters. Not the actors so much mind you, but the characters. There's an introduction scene, where you get to see all of them and you get some info on them. Not memorable at all. You forget about them (and their names), while you watch their intro. The other thing is, they are not really different. While it might have been a story idea (showing adults behave like their teenage sons and daughters), it does not help the movie be diverse. Talking about all that, might sound a bit too much and too harsh for a low budget movie like this. But it's many things in-between that are not working here. And it's a shame, because the basic idea is not that bad."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Bipolar Films",
         "Entropy Entertainment",
         "Morbid Mind Productions"
      ],
      "summaries": [
         "After \"hooking up\" with a series of guys at a house party, April is the talk of her high school. Her best friend Michelle, envious of all of April's attention, decides to try and follow in her footsteps and become more sexually forward. At the same time, their mutual friend Caroline has become so infatuated with her older boyfriend Ryan that she doesn't realize he's just using her. All the while, John, spends the week informing his two best friends, Colin (April's repressed and confused brother) and Tyler (the subject of Michelle's crush), about obscure sexual urban legends he reads about online, that just somehow end up managing to come true. Throw in the naive principal Dr. Jordan, who also happens to be Michelle's father, and Mr. Kimbal, a chemistry teacher trying desperately to dodge repeated seduction attempts from his students.",
         "In this over-the-top comedy, the relationships of three girls and fours guys - in affluent, adolescent suburban reality - intersect through the topsy-turvy world of love, power...and hooking up."
      ],
      "budget": 400000
   },
   "movielensId": 136188,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "2009-01-01",
      "dvdReleaseDate": null,
      "directors": ["Vincent Scordia"],
      "runtime": 95,
      "movieId": 136188,
      "title": "Hooking Up",
      "mpaa": "NR",
      "actors": [
         "Corey Feldman",
         "Brian O'Halloran",
         "Bronson Pinchot",
         "Josh Macuga"
      ],
      "imdbMovieId": "0903606",
      "originalTitle": "Hooking Up",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["7YX-h_yZ2Zk"],
      "plotSummary": "After \"hooking up\" with a series of guys at a house party, April is the talk of her high school.",
      "tmdbMovieId": 20983,
      "avgRating": 2.125,
      "releaseYear": "2009",
      "numRatings": 4,
      "posterPath": "/vdS9WgkSbXVfgCCFL8roLcvKzEn.jpg"
   }
}