{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ventriloquist",
            "id": 9704
         },
         {
            "name": "stand-up comedy",
            "id": 9716
         }
      ],
      "imdb_id": "tt1143143",
      "video": false,
      "title": "Jeff Dunham: Spark of Insanity",
      "recommendations": [
         14542,
         75190,
         14541,
         276306,
         25396,
         257192,
         24439,
         203059,
         108176,
         22427,
         137144,
         14137,
         127421,
         259395,
         263111,
         423122,
         250556,
         108930,
         217787
      ],
      "backdrop_path": "/OhIhjPDosg2yVxViS5iK5DtKTz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself / Walter / Achmed the Dead Terrorist / Melvin the Superhero Guy / Peanut / José Jalapeño on a Stick",
               "gender": 2,
               "credit_id": "52fe45fd9251416c750696a3",
               "name": "Jeff Dunham",
               "profile_path": "/6eIcIJbFj0cpZ3eRZFHkzlOTuB9.jpg",
               "id": 76982,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe45fd9251416c750696a7",
               "name": "Paige Dunham",
               "profile_path": null,
               "id": 76983,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45fd9251416c750696b3",
               "name": "Michael Simon",
               "profile_path": "/dmY5RZIjbkleBLBgeE9Pr8DOBNj.jpg",
               "id": 77042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696b9",
               "name": "Judi Brown-Marmel",
               "profile_path": null,
               "id": 77043,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696bf",
               "name": "Myra Byrne",
               "profile_path": null,
               "id": 77044,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45fe9251416c750696c5",
               "name": "Jeff Dunham",
               "profile_path": "/6eIcIJbFj0cpZ3eRZFHkzlOTuB9.jpg",
               "id": 76982,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696cb",
               "name": "Robert Hartmann",
               "profile_path": null,
               "id": 77045,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696d1",
               "name": "Steve Kroopnick",
               "profile_path": null,
               "id": 77046,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696d7",
               "name": "Stu Schreiberg",
               "profile_path": null,
               "id": 77047,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696dd",
               "name": "Steve Marmel",
               "profile_path": null,
               "id": 77048,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696e3",
               "name": "Tim Gaydos",
               "profile_path": null,
               "id": 77049,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696e9",
               "name": "Dave Harrison",
               "profile_path": null,
               "id": 77050,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a5d0b82925141118800230d",
               "name": "Jeff Dunham",
               "profile_path": "/6eIcIJbFj0cpZ3eRZFHkzlOTuB9.jpg",
               "id": 76982,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.204149,
      "production_countries": [],
      "id": 14540,
      "vote_count": 34,
      "budget": 0,
      "overview": "Combining his amazing talent and his unorthodox sense of humor, Jeff Dunham returns, yet again, with a hilarious stand-up comedy and ventriloquist performance. Starting off with the infamously known Walter, scrutinizing every bit of today's American society. Followed by two new characters, Achmed the Dead Terrorist, who continuously threatens the crowd with Silence and Death, and Melvin the Superhero.",
      "similar": [
         200133,
         416477,
         35595,
         16290,
         62206,
         49013,
         703,
         812,
         270946,
         13015,
         23483,
         51828,
         67308,
         4543,
         86130,
         435126,
         32930,
         228165,
         449674,
         34001
      ],
      "original_title": "Jeff Dunham: Spark of Insanity",
      "runtime": 80,
      "poster_path": "/l2IGY5LOVIXyfHpNnex714XP9Qq.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Levity Productions",
         "id": 2922,
         "origin_country": ""
      }],
      "release_date": "2007-09-17",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.jeffdunham.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Simon"],
      "runtime": 80,
      "synopsis": "Combining his amazing talent and his unorthodox sense of humor, Jeff Dunham returns, yet again, with an hilarious ventriloquist performance. Starting off with the infamously known Walter, scrutinizing every bit of today's American society. Followed by two new characters, Achmed the Dead Terrorist, who continuously threatens the crowd with Silence and Death, and Melvin the Superhero, who can stop a speeding bullet! ... only once... He wraps up the show with the adorable Peanut and an uncanny debate between him and Jose Jallapinio (on a Stick). Brilliantly written with an Outstanding performance.",
      "writers": ["Jeff Dunham"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1143143/",
      "coverLink": null,
      "actors": [
         "Jeff Dunham",
         "Paige Dunham"
      ],
      "reviews": [
         "I first saw Jeff Dunham when I was in high school and all he had was Peanut and Jose Jalapeno. My sister and I were always saying the \"zooom\" Peanut does when someone doesn't get a joke - and actually, still do! When I saw him on Comedy Central a couple of years ago, I could not believe it had been about 15 years since I had seen him. I am so glad he still has Peanut and Jose Jalepeno (on a stick!) and absolutely love Walter. Luckily I was able to see him in Boca Raton last year and he was outstanding. It is impossible to not think the puppets are the ones who are actually alive - he is a truly gifted ventriloquist. Anxious to see what new characters he comes up with - Achmed is too funny. Can't wait to see him again!!!",
         "This is the 2nd DVD of Dunham's shows, and I wish we could rate higher than a 10, since the 1st one is a 10 and this DVD is even better. We chanced upon these from a DVD rental service where you can watch some movies for free, and have never laughed so hard or for so long. There are a variety of characters, and the audience is able to relate to at least one of Dunham's \"friends.\" Dunham first comes out doing a stand-up routine, which of course each character manages to work into their routine when they are brought out later. You get the sense that these are not puppets but actual beings. Want even more laughs, head to youtube and check out the bloopers.",
         "The public celebrates his jokes with extremely patriotism. Jeff knows where is the money and he gives to his public exactly what they want. And that is the feeling that American people are superior. All his characters make, more or less, some racist joke. It cant turns very irritant the loudly \"HUUUUU!!!\" and idiots claps approving the racist comments. Melvin the superhero is lovely, maybe because it's the most innocent character of the show. And make jokes without \"american-inside-sense\" is very difficult. That's the spirit of the show, and Melvin has it. Too bad that the others needs permanently support of racist jokes. Jeff is funny. And very talent. You can't see less of two persons on stage.",
         "Dunham has to be one of the funniest comedians working today, and note I didn't specify just as a ventriloquist. Having said that, I have to pause for a moment to reflect on something: Achmed the Dead Terrorist is hysterical, and it's probably better to laugh at your enemy than fear him, but I think Dunham pushes the envelope a little too far with this character. Ditto Jose Jalapeno. I am amazed Mexicans haven't risen up in revolt, except they have no voice yet in America. Jose reminds me of Bill Dana's Jose Jimenez character or for that matter, the Taco Bell dog. Or even Speedy Gonzalez and his siesta-loving buddies. So maybe Dnham is the equivalent of Triumph the Insult Comic Dog or Lisa Lampanelli, both of whom also push the envelope to the point of discomfort -- even while they have me bending over in spasms of laughter. But it's easy for me, a white, English-speaking, Christian male, to laugh at what in truth is thinly veiled racial humor. Imagine Achmed as a Jewish moneylender or Jose as an Italian organ grinder. Not so funny now, huh? Characters like Walter and Bubba, on th other hand, are right out of the Edgar Bergen and Charlie McCarthy days, although I don't think I ever heard Bergen's puppets get that rude. Peanut is another matter entirely. One way or the other, I believe Dunham is a truly gifted performer even if his humor does get pretty vexsome. The guy is pulling in $30 million a year, so he must be doing something right. Someone here has suggested characters like Achmed and Jose Jalapeno are simply playing on American ignorance, which is exactly what Borat does. But I'm not so sure this is true in Dunham's case.",
         "This is a brilliant stand up comedy from the genius mind of Jeff Dunham,it starts off with Jeff Dunham doing somee comedy without any of his which was just sorta a warm up for the dolls,but it was still funny,then he had Walter who is my favourite out of them,he just complains about everything,and he is just hilarious,then he got Awkmad the dead terrorist,who's catchphrase is \"silence,I kill you\" and also said lines that are said a lot lately like \"stop touching me\" and \"knock,knock,who's there?,me I kill you,then he took out the super hero \"Melvin\" who has a shirt that says D that stands for his theme song \"Du Du DA DA\"and his super powers are to fly,x-ray vision and to stop a speeding bullet-once!,then he got his weird but hilarious puppet Peanut,who has a confusing but hilarious personality and then he takes out Halipino on a stick (while he still has Peanut)-and all in all great show.",
         "Coming to you from Washington, D.C., this is Jeff Dunham's second comedy special and the guy is simply a blast. No pun intended there considering Achmed the Dead Terrorist pretty much takes the term literally. Achmed is joined by Dunham's regular stable of suitcase pals - old curmudgeon Walter, Melvin the Super Hero, Peanuts and Jose, Jalapeno on a Stick. It's quite difficult to catch Dunham move his lips while voicing the characters, every once in a while you'll notice, but otherwise he's got the ventriloquism gig down perfectly. Notice the fan reaction to Dunham's routine, you have people in the audience who double over from the snarky comments of his characters and his precise comic timing. As an aside, did you ever see a picture of Walter and former Vice-President Joe Biden side by side? The resemblance is uncanny.",
         "I'm not very knowledgeable when it comes to stand-up comics, but I don't think I've ever laughed harder at a single comedian than Jeff Dunham. The guy is a master. Watching his shows is a non-stop ticket to comedy heaven, and the acts do not get any less funny when watched repeatedly. Jeff Dunham brings back some of his most popular puppets (Walter, Peanut, and Jose Jalepeno), and brings on two new ones (Achmed the Dead Terrorist and Melvin the Superhero Guy). Walter, my personal favorite, is funnier than ever. I was laughing so hard that I could hardly breathe. Unfortunately, Dunham brought back his weakest puppet, Peanut, who's worse than before. In \"Arguing with Myself,\" Peanut boasted a few laughs. Here, he nearly brings the show to a dead stop. Dunham needs to take the hint and get rid of this irritating Muppet-wannabe. Have the somewhat funnier Jose the Jalepeno pair up with another puppet. Or better yet, get rid of him as well and bring back a funnier doll, like Sweet Daddy D. His two new puppets are more successful. Achmed the Dead Terrorist is Dunham's most famous puppet, and there's a reason for it: he's hysterical. The inept ex-suicide bomber is almost as funny as Walter. Dunham risked a lot by putting such a controversial character into his show, but Dunham is never insulting to anyone (except terrorists). Less successful is Melvin the Superhero Guy, but he can generate a few laughs. The big-nosed superhero isn't as funny as Walter or Achmed, but he's a lot more entertaining than Peanut. The director, Michael Shannon, isn't as good as \"Spark of Insanity's\" Manny Rodriguez. Shannon frames Jeff and his puppets pretty well, but his sense of comic timing needs fine-tuning. Fortunately, Jeff is funny enough to not let this ruin the jokes. If you thought \"Arguing with Myself\" was funny, don't miss this one!",
         "I am a big fan of guys like Ralphie May, Gabriel Iglesias, Larry the Cable Guy, Ron White, etc, but Jeff Dunham absolutely is the most talented standup comic out there. It's simply amazing how the guy manages to give inanimate objects such diverse and strong personalities. It almost feels like if you saw one of them thrown out beside the highway some where you would yell- \"Hey, there's Walter!\" or \"Oh my God, it's Achmed!\" The thing that separates Dunham from any other comic out there is because most standup comics each have unique routines, but they mostly rely on a single catchphrase- like Blue Collar's \"HERE'S YOUR SIGN!\" But Jeff Dunham each gives the puppets a unique personality, and each and every one of them are hilarious in their own way. He even sticks out among other ventriloquists, as well as other standup comics. I could say much, much more, but I will condense everything by saying simply Jeff Dunham is a genius!!!",
         "My Dad likes Jeff Dunham and for the life of my I still just can not figure out why. He is not funny at all and all of his jokes are so bad I just groan without even really wanting to. His ventriloquism work is really good and he does a great job not moving his lips et cetera when his puppets are talking but what I care about is if they are funny or if the puppets are interesting and I can't stand this guy or his puppets at all. Most of the puppets aren't just unfunny they are totally racist. He has a puppet of an Arabic guy's skeleton and all he talks about is how he's going to kill the audience. He's a skeleton because he has already blown himself up as a suicide bomber once. There's also a lazy Mexican character for a puppet. This guy is just awful. I hope my Dad gets over him soon haha."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": ["Levity Productions"],
      "summaries": ["Jeff Dunham and his socially reckless \"suitcase posse\" are back in this highly anticipated follow-up to Arguing with Myself, his breakthrough television special! What's next? An ALL NEW show that is Bigger... Better... and Funnier than ever! This time, Dunham welcomes two never-before-seen partners \"Achmed the Dead Terrorist,\" and \"Melvin the Superhero.\" Long-time favorites \"Peanut,\" \"Walter\" and Jose Jalapeno...On a STEEK! are back in an entirely original show for everyone!"],
      "budget": 0
   },
   "movielensId": 136459,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2007-09-17",
      "dvdReleaseDate": null,
      "directors": ["Michael Simon"],
      "runtime": 80,
      "movieId": 136459,
      "title": "Jeff Dunham: Spark of Insanity",
      "mpaa": "PG-13",
      "actors": [
         "Jeff Dunham",
         "Paige Dunham"
      ],
      "imdbMovieId": "1143143",
      "originalTitle": "Jeff Dunham: Spark of Insanity",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Combining his amazing talent and his unorthodox sense of humor, Jeff Dunham returns, yet again, with a hilarious stand-up comedy and ventriloquist performance. Starting off with the infamously known Walter, scrutinizing every bit of today's American society. Followed by two new characters, Achmed the Dead Terrorist, who continuously threatens the crowd with Silence and Death, and Melvin the Superhero.",
      "tmdbMovieId": 14540,
      "avgRating": 3.30508,
      "releaseYear": "2007",
      "numRatings": 59,
      "posterPath": "/l2IGY5LOVIXyfHpNnex714XP9Qq.jpg"
   }
}