{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "goofy",
            "id": 166475
         },
         {
            "name": "short",
            "id": 214549
         }
      ],
      "imdb_id": "tt0036933",
      "video": false,
      "title": "How to Play Football",
      "recommendations": [
         62599,
         66983,
         134360,
         155197,
         67694,
         156458,
         66986,
         180089,
         162965,
         161841,
         156468,
         162932,
         39093,
         66876,
         162584,
         162577,
         162792,
         67010,
         156454,
         184657
      ],
      "backdrop_path": "/iRtHZGELNr6UFue8VEopbxmnDBx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 10,
            "character": "Goofy (voice)",
            "gender": 2,
            "credit_id": "58701b96c3a368265f002d23",
            "name": "Pinto Colvig",
            "profile_path": "/iHUSTwJAlqn0OzZpjiZwrkRgzXq.jpg",
            "id": 5462,
            "order": 1
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56912284c3a3686b490026c8",
               "name": "Charles A. Nichols",
               "profile_path": "/mcUoZsjU5qvI1N7Y5Kw7UWwHN7y.jpg",
               "id": 106834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5691228e92514166ea000b38",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "569123259251414561002513",
               "name": "George Nicholas",
               "profile_path": "/u23TVERSI6EahYWqfKEy758ANX8.jpg",
               "id": 150755,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "5691232e9251414563002758",
               "name": "Marvin Woodward",
               "profile_path": "/1CD51Z6hmiWmRxbEdph1yLBK1C3.jpg",
               "id": 150758,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5691233b925141457000260d",
               "name": "Andy Engman",
               "profile_path": "/yVH8vywhdg8l4P8lOhH0WtxlFs3.jpg",
               "id": 148224,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "5691234ac3a3686b5b0026ca",
               "name": "Harry Reeves",
               "profile_path": "/oRwzhDwmk9rJxFCKEBzzoBZmWV7.jpg",
               "id": 68655,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "56912354925141456a0025fb",
               "name": "Rex Cox",
               "profile_path": null,
               "id": 148153,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "56912363c3a3686b440028ae",
               "name": "Oliver Wallace",
               "profile_path": "/6itGFNrQVHPRC3C0sOXVMevFqii.jpg",
               "id": 64868,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5691237dc3a3686b5b0026ce",
               "name": "Lenard Kester",
               "profile_path": null,
               "id": 1559959,
               "department": "Art",
               "job": "Background Designer"
            },
            {
               "gender": 0,
               "credit_id": "5691238992514166ea000b4f",
               "name": "Bruce Bushman",
               "profile_path": "/hOMFlYgT7Hr9AVnMlDQgP0sTdk.jpg",
               "id": 222244,
               "department": "Directing",
               "job": "Layout"
            }
         ]
      },
      "genres": [{
         "name": "Animation",
         "id": 16
      }],
      "popularity": 0.857534,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 66984,
      "vote_count": 8,
      "budget": 0,
      "overview": "It's Taxidermy Tech vs. Anthropology A&amp;M for this introduction to college football.",
      "similar": [
         21385,
         10340,
         10144,
         10193,
         10895,
         10527,
         9479,
         12230,
         812,
         10882,
         10530,
         10555,
         41513,
         37135,
         9016,
         10198,
         12092,
         3933,
         11886,
         14160
      ],
      "original_title": "How to Play Football",
      "runtime": 7,
      "poster_path": "/kWkOkoVTif8quUJezjd9GL3ej1r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1944-09-15",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Kinney"],
      "runtime": 7,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0036933/",
      "coverLink": null,
      "actors": ["Pinto Colvig"],
      "reviews": [
         "This short, nominated for an Oscar, is likely the best of the sports cartoons Disney did (most of them centered around the lithe, atheletic and graceful Goofy) and is a classic, although Tex Avery was there ahead of them, with Screwball Football in 1939. Tex more than holds his own, but How To Pay Football is hilarious and yet another in a long line of works with which Disney can be justifiably proud. This airs on the Ink and Paint Club periodically. Recommended.",
         "Here's another \"Goofy\" explanation of a sport: this time, college football. The beginning explains all the ingredients that go into the game, and that's pretty funny. Then the football starts, pitting Taxidermy U. vs. Anthropology A&M. The star is Taxidermy's \"Swivelhips Smith,\" who takes the opening kickoff and swivels his way 105 yards for a touchdown! This is really cornball material, but very funny in spots. For example of the corn, they explain \"the quarterback barks the signals\" and you hear a dark barking - that sort of thing. The funniest play of the game is a 100-yard fumble recovery and run. The rest is fairly routine sight gags. Very corny, very dated but definitely fun to watch.",
         "Not only that, one of the best sports cartoons and one of Goofy's best. Hockey Homicide is perhaps the very best of the Goofy sports cartoons, but How to Play Football is one of the finest examples also. The animation is colourful and fluid as one would anticipate, and the music when it's played is full of energy and makes the audience part of the exciting atmosphere that you get playing sports(or even performing in a concert for that matter). The story, which focuses on college football at its most dominant, is simple and always exciting. But the stars of How to Play Football, other than the deliciously sardonic narration and the gag that the crowd ignore the narration giving a sense that the rules aren't important to them, were Goofy and the gags. How to Play Football is full to the brim with gags(mostly sight gags), and all of them hilarious and on target. Goofy is seen in several personalities, as a wily coach, pampered star player, brutish lineman and silly kicker, all in the same character design, and I found it both interesting and amazing at the same time. All in all, if you love cartoons and sports you will find How to Play Football a treat(I'm not the biggest sports fan but find the How to sports cartoons brilliant on the whole). 10/10 Bethany Cox",
         "After your average Disney short - especially one from the 1940's that centers itself around a \"how-to\" demonstration of a specific sport - it almost feels as if you need a nap or a reassuring breather. The Disney shorts progress at a briskly-paced rate that almost defies all sense and time and even at their average length - a brief seven to eight minutes - they often race by at such an inconceivably quick rate that one needs to take a look at the time again. Jack Kinney's How to Play Football is no exception to the rules and the content and approach is the same as other \"how-to\" shorts from the global empire that included golf, baseball, and swimming. The film stars Goofy and gives us a simple yet kinetic look at the sport of football through the use of slapstick and anarchy, pitting together Taxidermy Tech against Anthropology A&M in a rousing and lawless game. The short features the trademark and expected traits of Disney's shorts, being very colorful and involving, but also, just plain entertaining and fun. Directed by: Jack Kinney.",
         "This Walt Disney Cartoon spoofs the many newsreels that people watched in Cinemas in the '20's, '30's and '40's. It explains to viewers how to play (American) Football, with hilarious results. Recommended Deeply.",
         "With having found Disney's Goofy short film How To Play Golf to be a sharp and witty short movie,I started to hope that Goofy would match his golfing skills when taking on a game of American football. The plot: Showing a football arena to be jammed packed with fans from above,the moves goes down to earth and heads to the pitch,where the players soon reveal that this game is going to be as far away from a \"friendly\" as you can get. View on the film: Taking over from original voice artist George Johnson,Pinto Colvig gives Goofy an electric spark,which perfectly matches the excellent frantic animation that touches down on the screen. Unlike the previous Goofy shorts,director Jack Kinney gives every single player in the opposing teams their own distinctive look,and rough-edge personality,which leads to this being a Goofy movie that defiantly hits the whole nine yards.",
         "From the 1940s even up to recent years, Disney Studios made a ton of the \"How To\" films starring Goofy. Most are pretty good (especially the last one, \"How to Hook Up Your Home Theater\"), though a few (such as the drivers ed ones) are a bit on the preachy and annoying side. \"How to Play Football\" is one of the better shorts of this series. Much of the reason it's so worth watching is its great sense of humor and crazy and over-the-top action. As usual, all the characters look just like Goofy and the football game ends up being completely ridiculous--and fun. Excellent animation and quality make this one well worth seeing--even 66 years later. Good entertainment for adults as well as children.",
         "A Walt Disney GOOFY Cartoon. Those two mighty bastions of collegiate sports, Taxidermy Tech. & Anthropology A. & M., show HOW TO PLAY FOOTBALL - very badly. A multitude of Goofys spoof many of the finer points of the game, while strangely never really showing what the sport is actually all about. Gridiron fans will probably enjoy the jokes more than the uninitiated. Walt Disney (1901-1966) was always intrigued by pictures & drawings. As a lad in Marceline, Missouri, he sketched farm animals on scraps of paper; later, as an ambulance driver in France during the First World War, he drew comic figures on the sides of his vehicle. Back in Kansas City, along with artist Ub Iwerks, Walt developed a primitive animation studio that provided animated commercials and tiny cartoons for the local movie theaters. Always the innovator, his ALICE IN CARTOONLAND series broke ground in placing a live figure in a cartoon universe. Business reversals sent Disney & Iwerks to Hollywood in 1923, where Walt's older brother Roy became his lifelong business manager & counselor. When a mildly successful series with Oswald The Lucky Rabbit was snatched away by the distributor, the character of Mickey Mouse sprung into Walt's imagination, ensuring Disney's immortality. The happy arrival of sound technology made Mickey's screen debut, STEAMBOAT WILLIE (1928), a tremendous audience success with its use of synchronized music. The SILLY SYMPHONIES soon appeared, and Walt's growing crew of marvelously talented animators were quickly conquering new territory with full color, illusions of depth and radical advancements in personality development, an arena in which Walt's genius was unbeatable. Mickey's feisty, naughty behavior had captured millions of fans, but he was soon to be joined by other animated companions: temperamental Donald Duck, intellectually-challenged Goofy and energetic Pluto. All this was in preparation for Walt's grandest dream - feature length animated films. Against a blizzard of doomsayers, Walt persevered and over the next decades delighted children of all ages with the adventures of Snow White, Pinocchio, Dumbo, Bambi & Peter Pan. Walt never forgot that his fortunes were all started by a mouse, or that childlike simplicity of message and lots of hard work always pay off.",
         "Goofy seems to have a lot of these stories where the plot in his cartoons are experimental. In this case, a narrator tells the story of the crazy strategies and play of a football game - with the competing teams composed of Goofy lookalikes. This cartoon is more like a sports game got crazy - not much plot in this one and Goofy hardly speaks, but there are some funny sequences like the oddball coach. It's not an awful cartoon, just a little mediocre. Grade C",
         "During the 1940's, most of the cartoons in the Goofy series demonstrated, satirically, how to play a sport. These are known as the How to cartoons. This genre was actually inspired by Tex Avery's spot gag cartoons he did at WB. They would feature a droll off-screen narrator explaining or demonstrating the nature of a scene, only for the opposite circumstance to occur. Tex's colleagues credit him for the creation of this device and were honored that they (the Schlesinger studio) influenced Disney's cartoons. The Avery cartoon Screwball Football (1939) seems to be a chief inspiration for this short. The premise, characters, and gags are strikingly similar (the quarterback \"barking\" his signals is used almost verbatim). The Marx Brothers film Horse Feathers (1932) was also a likely influence as it carries the same kind of sensibility. While Tex used literal and visual humor for shorts like this, Disney's shorts of this genre subtly satirized the many aspects of game play and related cultural elements. (compare this short with Tex's \"Batty Baseball\", which was released the same year). The original credits, which were discovered a few years ago, show that the main titles were displayed on the scoreboard (Goofy head shot and all). The shorts of this genre have aged well and sports fans will enjoy them.",
         "PERHAPS THIS ANIMATED short film (aka \"Cartoon\") owes so much of its widely acknowledged success with both the Public and the Critics due to the bridging of the gap between two seemingly different worlds. On the one hand you have College Football and on the other our friend GOOFY'S habit of fracturing anything and everything. (Spoofing, that is!) ALTHOUGH THIS CARTOON is old enough to be on both Social Security and Medicare by now, it is still fresh and relevant; proving that the Gridiron just hasn't really changed that much. Plastic shell helmets, face masks of varying elaborately intricacy and competing varieties have found their way into the various stadia, but no matter. Football is still football and so are its fans. SO WE FIND ourselves at the big game between arch rivals Taxidermy Tech and traditional foe, Anthropology A & M. Goofy is the star and possibly the whole team and cast; as every character is a variation of the formerly named \"Dippy Dog\". The roster of both varsity squads are populated with some very active Goofy clones. THE CARTOON EXPLORES each and every cliché that is peculiar to the sport, some even seeming to invent a few new ones. We go through the litany of: \"Barking Out the Signals\", \"Well Oiled Machine\", \"Throwing a Bullet\" and \"Swivel Hips\". All could have well proved to be tiresome and trite; but they are so well handled and woven into the breakneck speed action that they do serve their purposes so well. THE OTHER AMENITIES that are offered here are: the outstanding Technicolor photography, crisp & clear sound and a befittingly peppy and energetic score; with both the theme and the incidental music's type and tempo added so much to what is such a sight-gag oriented medium. THE FINE FIGHTSONG march that opens up all the festivities sounds as if it is an original; but is pleasing and complex enough to be that of some college or university. It was apparently a thought shared by the Disney staff as well; as the colorful tune was reprised for a second go round as the main theme for Disney's 1953 cartoon, FOOYTBALL NOW AND THEN."
      ],
      "genres": [
         "Animation",
         "Short",
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["It's Taxidermy Tech vs. Anthropology A&M for this introduction to college football (first piece of special equipment needed: a campus covered in ivy). Among the names borrowed for players: Clyde Geronimi, Don DaGradi, 'John Sibley', Claude Smith."],
      "budget": 0
   },
   "movielensId": 136453,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1944-09-15",
      "dvdReleaseDate": null,
      "directors": ["Charles A. Nichols"],
      "runtime": 7,
      "movieId": 136453,
      "title": "How to Play Football",
      "mpaa": "NR",
      "actors": ["Pinto Colvig"],
      "imdbMovieId": "0036933",
      "originalTitle": "How to Play Football",
      "genres": ["Animation"],
      "youtubeTrailerIds": [],
      "plotSummary": "It's Taxidermy Tech vs. Anthropology A&amp;M for this introduction to college football.",
      "tmdbMovieId": 66984,
      "avgRating": 3.1,
      "releaseYear": "1944",
      "numRatings": 5,
      "posterPath": "/kWkOkoVTif8quUJezjd9GL3ej1r.jpg"
   }
}