{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide attempt",
            "id": 1252
         },
         {
            "name": "death row",
            "id": 2501
         },
         {
            "name": "utah",
            "id": 5303
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "capital punishment",
            "id": 11523
         },
         {
            "name": "execution",
            "id": 13129
         }
      ],
      "imdb_id": "tt0083909",
      "video": false,
      "title": "The Executioner's Song",
      "recommendations": [
         30996,
         84116,
         25269,
         54109,
         41185,
         27201,
         30330,
         18420,
         240881,
         63590
      ],
      "backdrop_path": "/kJdxcOxCAAJc1IaiafoNPVPRNl0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gary Mark Gilmore",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c15",
               "name": "Tommy Lee Jones",
               "profile_path": "/gRXugLFvr1oHZ6alLUxmYDq8cgW.jpg",
               "id": 2176,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Brenda Nicol",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6c19",
               "name": "Christine Lahti",
               "profile_path": "/oi8w5nVX1yBiP02uR9qGzD41yxL.jpg",
               "id": 77133,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Nicole Baker",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6c1d",
               "name": "Rosanna Arquette",
               "profile_path": "/rQMQYQUF9QzD6oDfkP6tsjmyZhS.jpg",
               "id": 2165,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vern Damico",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6c21",
               "name": "Eli Wallach",
               "profile_path": "/nRoyZzUjzY7iGdnp2V2kOgrMMFi.jpg",
               "id": 3265,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Larry Samuels",
               "gender": 2,
               "credit_id": "54646c1dc3a36804ac0014f6",
               "name": "Steven Keats",
               "profile_path": "/ga9VT6E6PzsxLvU4oHFu3v1IiSB.jpg",
               "id": 76019,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Johnny Nicol",
               "gender": 0,
               "credit_id": "54646c2e0e0a26294200149e",
               "name": "Jordan Clarke",
               "profile_path": null,
               "id": 1217532,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Earl Dorius",
               "gender": 0,
               "credit_id": "54646c400e0a26293b001579",
               "name": "Richard Venture",
               "profile_path": "/7tBLMgqrvoT1yC4OFEzGH6gCMVT.jpg",
               "id": 88748,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "April Baker",
               "gender": 1,
               "credit_id": "54646c520e0a2629420014a3",
               "name": "Jenny Wright",
               "profile_path": "/scz1dQwtwyFDej8zCAbk6p5bqdp.jpg",
               "id": 64056,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47d49251416c750a6c27",
               "name": "Lawrence Schiller",
               "profile_path": null,
               "id": 84614,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54646c6b0e0a26294f001543",
               "name": "Norman Mailer",
               "profile_path": "/m35HzjfGleHYTRbVuAi8o4JSzEu.jpg",
               "id": 143280,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.642004,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 19373,
      "vote_count": 7,
      "budget": 0,
      "overview": "In this fact-based film, Gary Gilmore, an Indiana man who just finished serving a lengthy stay in prison, tries to start anew by moving to Utah. Before long, Gary begins an ill-advised romance with the troubled Nicole Baker, a teenage single mother. As their relationship quickly deteriorates, Gary goes on a murderous rampage, leaving two dead. During his trial, he demands capital punishment; a media circus ensues and outsiders look to profit from his story.",
      "similar": [
         984,
         15069,
         96,
         807,
         4771,
         75780,
         357096,
         445954,
         21484,
         9411,
         10651,
         11423,
         2749,
         18587,
         26390,
         37645,
         12150,
         1949,
         979,
         769
      ],
      "original_title": "The Executioner's Song",
      "runtime": 157,
      "poster_path": "/wqvu3Gkqr52altilnFFF6Occ4aX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Film Communications Inc.",
         "id": 19038,
         "origin_country": ""
      }],
      "release_date": "1982-09-10",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "The story of two people who fell in love.....and kept on falling.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lawrence Schiller"],
      "runtime": 135,
      "synopsis": null,
      "writers": [
         "Norman Mailer",
         "Norman Mailer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0083909/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMjE3MDgxMjcyM15BMl5BanBnXkFtZTcwMTAwNTMzMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Tommy Lee Jones",
         "Christine Lahti",
         "Rosanna Arquette"
      ],
      "reviews": [
         "I thought this was a very good dramatization of Mailer's huge book. Tommy Lee Jones does an excellent job of portraying psychopathic killer Gary Gilmore and Rosanna Arquette is terrific as his teenage girlfriend, Nicole. While it was a made for TV movie, some R-rated footage was added in when the movie had a European release. If you can get that version on tape, do so. Rosanna is dynamite in the more adult scenes. Christine Lahti (who later won a short-film Oscar as a filmmaker) and Eli Wallach provide solid support. Jones shows the same brooding intensity that years later translated into an Oscar for him in \"The Fugitive.\" Look for Ron Howard's father, Rance Howard, in a small part as the police detective who first interrogates Gilmore after his arrest. It says something about the culture when a loser like Gilmore can be transformed into a sort of folk legend which is what the book and movie ultimately do. He had an enormous impact in 1977 by demanding that Utah go forward with his execution, the first execution in the US since the 1960s and the first since 1972 when the Supreme Court ruled that all death sentences prior to that date were unconstitutional. After Gilmore faced the firing squad hundreds of executions have been carried out. I would wager though that most Americans couldn't name more than two or three of those who have been executed but they will remember the small-time loser Gary Gilmore.",
         "Larry Schiller, who is credited with directing this movie, comes off in Mailer's book as a no-nonsense, grasping, egomaniacal self promoter -- a Horace Babbitt for our times. So it comes as a big surprise to find that this movie is professionally done and even tasteful. Schiller was one of the first, well, journalists (I guess), on the scene and sewed up a lot of exclusive contracts with informants. He sold the rights to Mailer. As Schiller's character puts it in this movie, \"I'm all suited up and ready to play.\" And even in enterprises subsequent to Gilmore's story, Schiller is generally described as such a crumb that it's surprising to find this movie has no great directorial displays -- no razzle dazzle pyrotechnics, just clean, functional direction and editing. Of course, Mailer's book was too long to be condensed into even a miniseries in all its complexity, so certain incidents needed to be deleted or compressed. The snitch planted in Gary's cell, for instance. Or the fact that the murders were preceded not by one break up with Nicole Baker but two. Or the fact that there was no one \"going away party\" for Gary before his execution, but two, the first one having been premature (and anticlimactic). Mailer's book by the way is probably his last very good work, filled with a casual irony that is sometimes amusing. After the first killing, Gary takes the teen aged April to a motel room where, Mailer observes, a paper ribbon has been placed across the closed and antiseptic toilet to prove that nobody has lifted the toilet seat since the paper was placed there. There's no humor in the movie. It's a straightforward, plain-vanilla telling of Gilmore's brief period between his release from prison and his death by firing squad. Tommy Lee Jones is very good as Gary Gilmore. His energy is barely contained. He paces back and forth at moments of tension and gestures in unfamiliar, almost bizarre ways as he tries, for instance, to flag down cars on a highway. He twists his lines in equally idiosyncratic ways, the way Lee Marvin often did, so that one never knows exactly what's coming next. The only other performer of real importance is Rosanne Arquette as Gilmore's girl friend, Nicole. She looks -- ummm -- very nice. Her acting is okay as well, although she doesn't come across nearly as seedy as Jones does. She sounds as if she'd spent time in college, whereas Jones (who was in Harvard) sounds like he's spent half his life in prison. She is, however, so succulent that one hardly notices her performance. The movie has no superscore. The music is country and western, and unusually apt. It adds to the shabby atmosphere established. Nobody seems to be really having a good time. And I never suspected Salt Lake City had such a debauched underworld -- people guzzling beer as they drive, smoking, shacking up impulsively, strung out on dope and New Age insanity. Yet they are for the most part respectable and law abiding, even the tattooed bikers and other lowlifes that Gary cultivates as friends. There are only two murders and we don't see the victims' heads explode. In fact there is hardly any blood. (That's what I meant when I said the movie was relatively tasteful.) What motivated Gilmore? I mean, two senseless killings for a few dollars to pay off a pickup truck. Who knows? Not even Gilmore knows. Ditto for Nicole Baker. She and Gary agreed to commit joint suicide while he was in prison. The first attempt failed and they tried a second time. (One of the attempts is again omitted as anticlimactic, which is okay.) She smuggled the depressants into the prison by putting them in a balloon in her vagina. This may or may not sound realistic, but it is. I was surprised to find couples in the visiting room at California Men's Colony in San Luis Obispo engaged in almost everything short of what might be a definition of \"sexual relations\" broader than that of President Clinton. Neat. The inmates were doing a lot better than I had at their age. This is an above average miniseries, well worth watching. Not full of pungent insights into human nature or anything -- just a gripping story of a doomed and careless man. Get the unrated version.",
         "For a long \"television film,\" I thought this story moved along well, even with the main characters being so sleazy the story gets a little unappealing at times. Of course, when has Rosanna Arquette ever played anything else in her younger days? Also, when did she not show off her big breasts? However, I usually find her playing interesting characters and she looked young and pretty in this early career (for her) TV-movie. As for Tommy Lee Jones, who plays the main character \"Gary Gilmore,\" I've always found him interesting, too. In this, Jones plays the famous real-life killer while Arquette is \"Nicole Baker,\" his teenage girlfriend. Jones does a nice job showing how mentally messed up Gilmore was back then. I surprised at the language in here for a television movie, but then again, I saw the \"European version\" of this movie. The longer American version, I assume, cut out some that language and perhaps some of Arquette's \"skin.\" I rarely comment about anybody else's review but I recommend reading the comments by \"noelani\" here since this woman lived in Gilmore's backyard, so to speak, during this period and has some interesting things to say.",
         "In the summer of 1976, my husband was a 25 year old full-time student at Brigham Young University, and we were renting a tiny house in Orem, Utah. Orem was generally a quiet town, where one could lie in bed on a summer night, with windows wide open, and hear only the noise of a few crickets chirping and dogs barking, and the occasional buzz of a car driven by someone who was working a night shift. In the middle of the night of 19 July, I awoke to the sounds of sirens...lots of them. I knew there must have been some very significant event, for there to be multiple sirens blaring, and wondered if it might possibly have been a house fire. I didn't find out what those sirens we all about until two days later, when a neighbor commented that there had been another murder the night before. That was when I learned that the sirens I had heard were because of a murder at a gas station just a few blocks away. Soon after, the name of the victim became known. He was a 25 year old BYU student, who had actually served in the mission field with my husband, in Brazil. The young man also had a wife and a new baby, and had been working the night shift at the gas station to support his family, while attending college full-time. The victim of the second murder was another 25 year old BYU student, who was working nights to support a pregnant wife and baby, while attending the university. I will refrain from using the names of the two fine young men whose lives were ended in such a brutal and senseless manner, out of respect for the privacy of their families. But their names remain, in my mind, and I have often thought of them, over the years, and wondered how they were doing; the wives, now in their fifties, as I am, and also the children, now around 30 years old, who were deprived of their fathers by Gary Gilmore's senseless rampage. I will never forget the first images I ever saw of Gary Gilmore, taken when he was very first apprehended. He looked like a wild man, with an unkempt beard and long hair flying everywhere, with a crazed look in his eyes. Soon after, however, he took on a clean cut look, which certainly would have increased the general public's sympathy. That started America's interest in Gary Gilmore. In the weeks that followed, it seemed that many Americans couldn't get enough of the story of the ex-con and his little girlfriend, Nicole. The media turned it into a Romeo and Juliette story, about the young man from a tough background, down on his luck, and his beautiful young sweetheart. I'll never forget the time that television programming was interrupted for a special report, stating that Gilmore and Nichol had both been found unconscious, following a suicide attempt, with pictures of the two, side by side. It made me ill to see the way the story was romanticized, while two young widows grieved the loss of their husbands. When Gilmore was finally executed, I was relieved. There had been local talk of him possibly being released from prison on a technicality, if the sentence of execution was not carried out soon, and I was terrified that he might set out to murder another young BYU student. After the news from the execution finally died down, I did my best to avoid thinking of anything to do with Gary Gilmore. When I heard about the made-for-TV movie, The Executioner's Song, I was appalled that someone would give Gilmore MORE attention. It took me nearly 20 years to finally watch the film. I will say that Tommy Lee Jones and Rosanna Arquette were brilliant in their roles, and the supporting roles were also well portrayed. I think it did a fair job of presenting the story with a minimum of glorification of Gilmore, while calling attention to the victims of his crimes, at least to some extent. I only hope that Gilmore's victims' wives and children benefited from any money made from the film.",
         "This was the oldest movie so far that I have seen of Tommy Lee Jones and it surpassed all my expectations. Here I was thinking that he got better with age, but he really was that good all along! He plays this role exceptionally well and I have even more respect for him as an actor now. Rosanna Arquette was very good indeed. I always thought her to play in brainless Hollywood movies, but this film was a good decision on her part. This film is another example of an unempowered woman who is alone and desperate for any attention that she can get. Unluckily for Nicole(Rosanna) this attention comes in the form of Gary (Tommy Lee), who is a very disturbed young man who sees human life as something that can be discarded of easily and without any hesitation on his part. Be it for money, or simply because he felt like it, Gary kills people without blinking. At the end of the movie Gary changes somewhat and it is welcome in an absurd kind of way? He makes peace with his lot and with himself and only then you feel sorry for him. If you are a Tommy Lee fan like me, then you definitely have to see this one. Hasta luego",
         "There seems to be a little confusion regarding the various versions of The Executioner's Song. I read the book written by Norman Mailer in 1980 and looked forward to seeing the film. The original film version was a made for TV mini series which aired in 1982. That version was much longer and also had numerous period songs included. Those songs were listed in the credits at the end. The TV mini-series version did not contain any profanity or full nudity. Some scenes were darkened and some were eliminated while extra scenes with additional dialogue were included. The second version was aired on cable television. It was the same version that was released in Europe in 1985. It was also released on \"USA Home Video\" on VHS tape. That version was much shorter; however it contained profanity, more violence and several nude scenes of Rosanna Arquette and Tommy Lee Jones. Those scenes seemed a little bit dark however. Also, several period songs were removed from the film even though they are still listed in the credits. The newest version of the film which I watched on Net Flix recently is also referred to as \"The Director's Cut\". I own the original 1985 \"Big Box\" VHS tape of the European version and compared those two versions scene by scene. The newest version includes all of the profanity, violence and all of the nude scenes from the European version. The content is exactly the same. The main difference in the two versions is that the newer DVD is much brighter, has more clarity and the colors are superior by far. The nude scenes are not darkened at all. The sound is a bit louder on the old VHS version though. The period songs that were taken out of the film are no longer listed in the end credits with the exception of one Neil Young song only. Waylon Jennings is given credit for all of the original songs he wrote for the film. I do not own the original TV mini-series version from 1982 and have to rely upon my memory to compare it to the newer versions. With that said, I prefer the new high quality version to the older, longer made for TV mini-series and also to the inferior quality European VHS release. Basically what you get with the newest release is a much higher quality European version. Did I mention that a much younger Rosanna Arquette is nude in several scenes?",
         "you may also be interested in the Mikhal Gilmore biography about his brother, Gary, and how they grew up in Oregon, being brutally abused by their father. Apparently, Gary Gilmore spent more time in juvenile detention homes than could be counted, and these institutions promoted the violent and hostile behavior which came to be seen by Gilmore as normal, even acceptable. This film is primarily a documentary; look for Eli Wallach as Gilmore's Uncle Vern, trying to help his nephew function in the world. In Salt Lake City, Utah, where most of the film takes place, there is a cold unforgiving environment, similar to the environment Gilmore grew up in. As he grew up during the depression, options were scarce. Hostility, anger and frustration led to physical abuse, acting out, and eventually, murder. Rosanna Arquette is believable as the long-suffering girlfriend of Gilmore, who refuses to face reality. This is an excellent film, due for a remake; perhaps Mikhal Gilmore could translate his book version into film. In real life, Gilmore's mother was devastated and traumatized, living in a trailer, mourning the horrible life her son had endured, a child who had no options, who grew up as an armed robber, and who finally demanded the state of Utah execute him in Draconian fashion. 9/10.",
         "Norman Mailer's book about Gary Gilmore was compelling in the first half, but the second half was a limp, uphill struggle. There's no such problem in the TV adaptation, which is tighter and absorbing all the way through, with both Tommy Lee Jones and Rosanna Arquette giving two of the best performances of their careers... you now know why it's easy for us to forgive him for \"Batman Forever\" and her for \"Off The Wall\" (which she made the following year, and oh dear me that was BAD). This is available in both miniseries form and a shortened cable/theatrical version (to quote Buffy Summers, \"We're talking violence, strong language, adult themes...\"), but I actually prefer the TV version because while you get more nudity - female AND male - and more graphic scenes in the cable cut (not to mention lines like Rosanna's \"Yeah, you and seven other motherf***ers\"), it's at the expense of a little story coherence; you lose some seaminess in the miniseries version, but the tale is ultimately stronger, clearer and not so rushed. But either version is a must.",
         "\"The Executioner's Song\" from 1982 was a TV movie, and on Netflix, I believe they send out the director's cut. It has lots of Roseanna Arquette's breasts and other body parts. Based on the book by Norman Mailer (who also wrote the screenplay), this is the story of Gary Gilmore, who became famous by demanding that the state of Utah go ahead with his execution. It was the first execution in the US since the 1960s and the first since 1972 when the Supreme Court ruled that death sentences prior to that date were unconstitutional, which is why the Manson group was not executed. Gilmore, who requested to face a firing squad, became kind of a cause celebre. As a hero of some sort, I suppose he fits in well with today's idea of a celebrity. He was basically a loser who always chose the easy way out. When he was released on parole for robbery, he had the help and support of his cousin (Christine Lahti) and his uncle (Eli Wallach), but he was unable to hold down a job and became obsessed with a 19-year-old (Arquette) with two children. He then returned to the robbery business and for no good reason shot and killed two people after he robbed them. I believe this was a TV movie in two parts, so what I saw was shortened. As a result, to make way for Arquette's body, there was quite a bit cut, making it jerky. My main problem was getting any sympathy going for Gilmore or Arquette. Tommy Lee Jones did a terrific job, but even though Gary's family loved him and just hated the things he did, I as an audience member didn't share their feelings. As far as I'm concerned, he wanted to die because he didn't want to stay in prison. He robbed so he could pay for a truck and didn't have to work. Same old story - the easy way out. This story was described as \"tragic.\" The tragedy is that the Arquette character had two children. She was a whack job who tried to commit suicide so that she and Gary could continue their affair in heaven. It said at the end of the movie that she moved and started over. I hope for the sake of her kids that she made it. I have no doubt with her figure she met somebody. Let's hope it wasn't another loser.",
         "What makes a criminal? As Gary Gilmore Tommy Lee Jones captures the enigma and dilemma of what should be done when one crosses over the line and commits murder. Roseanne Arquette also plays the part well of a woman attracted to bad men. The book was too long, the movie just right.",
         "I managed to see this via Netflix streaming video. Gary Gilmore might have been just another petty criminal turned murderer, we hear about them, unfortunately, all the time. But his case was famous because it was the first execution after the death penalty had been reinstated in the USA in 1976. This movie is basically his true story. It is a bit long, at over 2 hours, and it slows down at times, but overall it is gripping viewing, and Tommy Lee Jones is just mesmerizing as Gary Gilmore. The story told here begins in 1976, during his last year of life, after he is once again paroled, this time to Provo, Utah where he had some relatives that would help him adjust and go straight. But Gilmore apparently was just one of those characters that had his own \"morality\", one where it only mattered what he wanted. If he wanted a case of beer, he just walked out of the store with it. He wanted a white truck that was more expensive than he could afford, and he needed a few hundred dollars in a couple of days. So robbery was the logical, to Gilmore, route. And killing the service station attendant, then the motel attendant, also seemed right to him. But he didn't get away with it. Christine Lahti is good as his cousin, Brenda Nicol, who cares for Gilmore but is frustrated that she cannot do anything to help him. Even better is Rosanna Arquette, 22 during filming, as the 19-yr-old divorcée with two small children, Nicole Baker. She fell for Gilmore, and he thought he had gone to heaven when they were in bed together, but his temper kept him from being able to relate to her except sporadically. He was mostly abusive. Eli Wallach is his Uncle Vern Damico with the shoe shop. This is a worthwhile movie, not only for the historical significance, but also for the performance of Tommy Lee Jones.",
         "I was in Utah when they filmed this movie. I remember seeing the flurry of video trucks situated around the filming sites. More than once I was accidentally captured in some of the scenes but, of course, they were cut from the final draft. I thought Tommy Lee Jones did an excellent job acting. It was really brilliant. In fact all the actors were great. I happen to know that neither of the widows got any money from the making of this movie. Norman Mailer's excuse: the movie did not make enough money at the box office here is North America or in Europe. nor on video sales. Maybe so. Mr. Mailer did not show that he was too concerned, though. I knew Ben Bushnell and especially his wife, Debbie. Before she met Ben, she use to send me Green pancakes on my LDS mission in Minnesota (personal joke). We were friends from the LDS Institute of Religion across from Pasadena City College for years. Ben was a 6'5\" gentle Ben. He was one of the \"good guys\" and showed great dedication to his God, family, and church. The funeral in South Pasadena was closed casket for a reason. Debbie didn't notice me at the funeral. She didn't notice anyone there. She was still in great shock. She didn't show any emotions until I approached her at the graveside services. She looked at me and then broke down sobbing. It was too much for me, also. Debbie is a courageous survivor and mother. Gary Gilmore was a low-life who did care who he killed & did not deserve recognition.",
         "A DVD that is represented as a director's cut should be exactly that. This DVD is not a director's cut. I remember watching this movie when it first aired on TV. There was one scene in particularly where despite the dim lighting, you could tell that Rosanna was partially nude. In this DVD, it is obvious that they have censored this scene by covering her up with dark blotches. It is the strangest sort of censoring that I've ever seen. They tried to make it look like she is wearing some sort of leotard, but it is obviously faked because it jumps around all over the place from one frame to the next, and anyone who saw this when it originally aired on TV will probably recall that Rosanna was not wearing any sort of leotard in this scene. I bought the \"Director's Cut\" because that was what I wanted. This amounts to false advertising. It is unethical, and it should not even be legal to do this. I hate when I buy a DVD and find this sort of thing. I encourage everyone to boycott this DVD.",
         "The Executioner's song is based on the Gary Gilmore case. Gary Gilmore murdered two innocent men in cold blood and when the courts found him guilty he was sentenced to death. When the chance of a appeal comes up giving Gilmore only 30 years. He decides to fight against it and accept his Execution in front of a Utah firing squad. Gilmore Wanted his freedom but if he could not have that then he wanted to die. Gary Gilmore was on 35 when he was paroled from prison after doing a 12 year sentence. By then Gilmore had spent more then half his life behind bars . When is released into his cousin Brenda's custody Gilmore finds Life on the outside to be different and difficult. Gilmore finds himself in a hurry . He wants money he wants love and he wants it NOW ! Gary only understands the way things work in prison. To him life on the outside is harder. When he meets Nicole a flighty blonde with kids and a woman who decides Gary is worth fighting for only then does his life start to turn around. But Gary has a issue of violence and of fear of losing the only sane thing in his life.When things don't start going right for them only then does Gary fall back on old habits and he adds a new weapon to his arsenal. Gary murders two men in cold blood after Nicole leaves him in terror fearing for her life. When Gary is arrested. He goes to court where he is found guilty .and sentenced to die the method is chosen by Gary and he chooses firing squad .When the lawyers file a appeal Gary becomes famous arguing that he wants to die. despite the people who argue that want him to live. Gary Gilmore finally gets his wish and pays for his crimes in Jan 1977 .by the Utah firing squad. Tommy Lee Jones always excellent in every role he takes Shines as Gary Gilmore. bring Gilmore's Jekyall and Hyde persona to life. Eli Wallach does a wonderful turn as Uncle Vern who at first wants to give Gary a chance then realizes Gary is nothing more then a rabid dog. Rosanna Arquette does such a god job here its hard to believe she was never a major star this movie shows her potential If you are a fan of the true crime genre . This one is a must watch classic and for very good reason. Its compelling and stays with you long after its over .",
         "I just watched this for the 1st time in 20 years, & there were 2 scenes missing that I've specifically remembered that entire time. The 1st is where Gary & his uncle Vern are arm wrestling & Vern places a toothpick holder under the side where Gary's hand will land. The 2nd is in prison, Gary shows Vern that he's preparing for death by hanging upside down & doing vertical sit-ups. I also seem to remember that when I saw this movie as a kid, it aired over 2 nights on TV, which means it was at least 3 hours long. Great movie, but I can't help but wonder what else I'm missing... Any leads on the full version would be greatly appreciated.",
         "I first saw The Executioner's Song on a premium cable channel sometime in the mid-80s, and I loved the story which is close to what I remembered from less than a decade earlier when news of Gary Gilmore's pending execution and his fight for his sentence to go through, and I watch this movie every time I have a chance. Also I love Tommy Lee Jones in ever role he has ever played, as he is an excellent actor. I have one peeve, however. The real Gary Gilmore (at least according to the photographs and the footage I ever saw of him), had medium brown hair and very bright blue eyes. I think that a different actor should have played him at least to be true to how he really looked like. I could think of actors, such as Robert Redford, Harrison Ford, Jeff or Beau Bridges or (right at the top of my head) could have been actors that could have done just as much of a superb job as Tommy Lee Jones did, as they also did have the brown hair and the blue eyes, while Tommy Lee Jones had dark hair and brown eyes. Other than that, the movie was great that I seldom miss a chance when it airs on TV.",
         "After reading neolani54 comments it brought back a flood of memories about the events of the movie. I had just returned from my mission and had just married and lived 3 blocks from the hotel where one of the murders took place. Like many others who were students in Provo, we all took part time jobs to support our new families. It was such a terrible thing to happen and could have been any one of us. The movie has always been one of my favorite Tommy Lee Jones movies. I also grew up near Willard, Utah where Melvin Dumar got famous from his experience with Howard Hughes. (another Tommy Lee Jones movie). I have never been an advocate of capital punishment mainly because I personally believe that spending the rest of your life in jail is much more punishment than moving on to the here-after. However, I remember the early morning hours when Gilmore was executed and how glad I was that he was taken from the face of the Earth. Such a heinous and senseless act on absolutely innocent and peace loving souls. I hate to give any recognition to Gilmore, but at least he saw what he had done and fought for the punishment that he knew he deserved. It was unthinkable that there were so many people who were fighting save his miserable life.",
         "Some great country music including: Talk Good Boogie; Get it On Again; So Good Woman; This Time; Defying Gravity (Executioner's Song); Are You Ready for the Country all performed by Waylon Jennings. Also, One Piece at a Time Johnny Cash There's a few more that I can't identify. Certainly a good film but made better by having a decent soundtrack If anyone has a more complete soundtrack listing please share it. The movie is out on DVD but there's also another cut that may have more soundtrack music.",
         "i have seen this movie and it is a must have for any movie collection i would love to be able to find it i don't think it has been released on DVD yet. please if anyone knows where i can get this movie please let me know if you catch it on TV you will enjoy it tommy lee jone is exciting and rosanna arquette the girl friend is a knockout if you know what i mean the story is based on a true story which makes it that much more appealing to see i really don't know what else to say but they say you have to fill out ten lines to submit a comment so please excuse my babbling on i am just trying to fill in the ten lines that they ask for so please be patient with me but please see the movie if you get the chance you won't regret it have a great day",
         "I am currently reading the \"true life\" novel on which this movie is based. The movie is a lot like the book - very simple and candid with scenes that are mostly devoid of narrative punctuation. The movie is based on a real life character called Gary Gilmore who decided to not defend himself in a murder trial. In fact, he asked for his own execution. Gilmore spent most of his life in jail and the film is mostly about how he tries to settle back into normal life in Utah when he is on parole. The film tells us a lot about the way of life within the predominantly Mormon community in Utah. The film is not as detailed as the book (which runs into more than a 1000 pages) and in fact leaves out a lot of good parts. The performances were satisfactory. Tommy Lee Jones was very good - he plays Gilmore like the sociopath that he was. Unfortunately the film has next to nothing about Gilmore's artistic inclinations - Gilmore was good at drawings and was well read. Rosanna Arquette plays the women half his age with whom he has an intense love affair (they even enter into a suicide pact when Gary is in jail). Eli Wallach and Christine Lahiti are very good as Gary's family. But none of the performances blew me away. There were a few scenes which jarred due to use of background music and did not fit in with the overall tone of the movie (like the scene where Gary has a fight with his cousin Brenda). I liked the country song played during the titles. There are many beautiful long shots of the Utah sunsets and used car lots. The final scenes where Gilmore is executed are quite frightening. (6/10)"
      ],
      "genres": [
         "Biography",
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Film Communications Inc."],
      "summaries": [
         "Based on the true story of murderer Gary Mark Gilmore, spanning the last nine months of his life (May 1976-January 1977) in which at age 35, after being released for serving a long prison term in Utah for armed robbery, the unstable Gilmore murdered two men in two seperate and senseless robberies in which after a brief public trial in October, he was sentenced to death by firing squad which drew a lot of media attention when Gilmore insisted that his execution be carried out and he became the first man to be executed in the USA since the government reinstated the death penalty in 1976.",
         "Mr. Gilmore was not sentenced to \"death by firing squad\". He was sentenced to death. He chose firing squad over lethal injection because of a misguided belief he held that he could, in some part, atone for the murders by spilling his own blood. Lethal injection would have precluded that from happening. I lived in Provo/Orem/SLC through the crimes, trial and execution, then actually wound up working as Tommy Lee Jones' stand-in and photo-double during the shoot.",
         "Gary Gilmore, an Indiana man who just finished serving a lengthy stay in prison, tries to start anew by moving to Utah. Before long, Gary begins an ill-advised romance with the troubled Nicole Baker, a teen aged single mother. As their relationship quickly deteriorates, Gary goes on a murderous rampage, leaving two dead. During his trial, he demands capital punishment; a media circus ensues and outsiders look to profit from his story.",
         "The story of Gary Gilmore, a convicted murderer who lobbied for his own execution."
      ],
      "budget": 0
   },
   "movielensId": 136419,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-09-10",
      "dvdReleaseDate": null,
      "directors": ["Lawrence Schiller"],
      "runtime": 157,
      "movieId": 136419,
      "title": "The Executioner's Song",
      "mpaa": "NR",
      "actors": [
         "Tommy Lee Jones",
         "Christine Lahti",
         "Rosanna Arquette",
         "Eli Wallach",
         "Steven Keats",
         "Jordan Clarke",
         "Richard Venture",
         "Jenny Wright"
      ],
      "imdbMovieId": "0083909",
      "originalTitle": "The Executioner's Song",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["a2-swVvfZyg"],
      "plotSummary": "In this fact-based film, Gary Gilmore, an Indiana man who just finished serving a lengthy stay in prison, tries to start anew by moving to Utah. Before long, Gary begins an ill-advised romance with the troubled Nicole Baker, a teenage single mother. As their relationship quickly deteriorates, Gary goes on a murderous rampage, leaving two dead. During his trial, he demands capital punishment; a media circus ensues and outsiders look to profit from his story.",
      "tmdbMovieId": 19373,
      "avgRating": 2.91667,
      "releaseYear": "1982",
      "numRatings": 6,
      "posterPath": "/wqvu3Gkqr52altilnFFF6Occ4aX.jpg"
   }
}