{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2387443",
      "video": false,
      "title": "Dinotasia",
      "recommendations": [221243],
      "backdrop_path": "/hDDk6B6MLymUVNB7iqzn81PkgrZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Narrator",
            "gender": 2,
            "credit_id": "52fe4a19c3a36847f81b9617",
            "name": "Werner Herzog",
            "profile_path": "/uzVcWEmasjz1Wl7w5mBF5vmmHlK.jpg",
            "id": 6818,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a19c3a36847f81b961d",
               "name": "David Krentz",
               "profile_path": null,
               "id": 1055222,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a426f730e0a2620e0052a5b",
               "name": "Erik Nelson",
               "profile_path": null,
               "id": 6824,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.37917,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 103194,
      "vote_count": 6,
      "budget": 0,
      "overview": "Computer-generated animation about the daily lives of dinosaurs, narrated by Werner Herzog.",
      "similar": [],
      "original_title": "Dinotasia",
      "runtime": 83,
      "poster_path": "/ySqhKJB08s3cTpFOjxluQtUKjVG.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "2012-05-04",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "David Krentz",
         "Erik Nelson"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "David Krentz",
         "Erik Nelson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2387443/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQyNTQ4MTU2N15BMl5BanBnXkFtZTgwMzI0NzA2MDE@._V1_UY268_CR1,0,182,268_AL_.jpg",
      "actors": [
         "Werner Herzog",
         "Lorànt Deutsch"
      ],
      "reviews": [
         "Dinotasia is not an educational documentary, it is purely a piece of entertainment. This becomes clear after only a few minutes into the production. If viewed expecting it to be informative and enlightening, you will be disappointed. But for entertainment purposes, as a dinosaur fan I found it very enjoyable. None of the creatures featured are identified by name, so some previous knowledge is expected -- this wasn't a big problem as I was able to identify all but one (and that was possible with a quick internet search). It is not a serious production. Many of the encounters between species were designed for comedy value, and in most respects, it was a success. While sometimes it may have erred toward humanizing some of the behaviours, they were still kept within acceptable estimates of how the species may have acted. Much of it is still suitably primal and bloody, however. Werner Herzog's accent is quite distracting but in some ways that adds to the entertainment value. It is quirky and offers a fresh approach to the narration of life in the Mesozoic. It's also kept to a minimum -- most of the production is narrative-free. Visually it is a little rough in places (especially the beginning) but on the whole, the animation is of decent quality. The pace is fast, if a little haphazard, throwing the viewer into the action rather than spending any time on palaeontological evidence. If you need facts and science, this is not for you. But if you're in the mood for a light-hearted perspective of how dinosaurs may have lived, this is highly entertaining. At least until the conclusion of the Cretaceous Period, for which I've still yet to see an upbeat depiction.",
         "They bill this movie as being based on the most up to date paleontology but it is sorely lacking in information. Just a bunch of contrived scenes with humanized and unidentified dinosaurs but those are lacking even for what they are. A show like Walking with Dinosaurs has the elements of accurate info with fun to watch cgi. Or if you like realistic dinosaurs and a made up story, watch Disney's Dinosaurs (2000). To be fair I only watched half of the movie because it was so awful. Save some time and skip this one. There are some good Dino documentaries out there like Dinosaur Planet, When Dinosaurs Roamed North America, Clash of the Dinosaurs, and of course all of the iterations of Walking with Dinosaurs.",
         "not sure why the overall rating is so low here. this is the best CGI Dino movie I've seen, and i've seen almost all of them. this one actually has a few comedic moments that made me LOL and even a Dino sex scene(PG rating). very little voice-over, the Dinos steal the show. i really think they captured what we assume to be the real life of these awesome creatures. i always wish they would still be around today...at least some of them. (is Jurassic park ever going to become a reality?) :) watched this on the streaming channel that begins with \"N\". grab some corn and watch it on a killer HD home theater setup ... you and/or your kids will have a blast.",
         "This is an awful film in light of what it claims to be: a documentary making use of the latest research. There is no narration to provide you any information, save for a few \"philosophical\" comments from Herzog. There is no discernible aim, narrative, or point to the film. It is extremely disingenuous and unprofessional to claim something is based on research and then not provide even the slightest information about what that research is. The viewer is shown a number of different types of dinosaurs, though we are never told their species. You can identify vaguely what family they belong to: sauropods, raptors, tyrannosaurs, etc. There is no real explanation of the temporal or geographical context. No information is provided about the dinosaurs or their behavior. This film is just pure fantasy with a nihilistic perspective showing dinosaurs slaughtering each other left and right to the point that one wonders how any species managed to survive for any period of time. Spoilers ahead... At one point two tyrannosaur type dinosaur parents look on their tiny, vulnerable babies fondly as they play. The babies then run off and get eaten without the parents even batting an eye until it is done. Animals that produce few offspring need to parent them more than animals that produce large numbers of offspring in order to ensure the survival of the species. The viewer watches as some species of pteranodon pushes its babies off a cliff to teach them to fly only to watch them be snatched up mid air by other pteranodons. Just ridiculous. At another point a sauropod eats hallucinogenic mushrooms. The viewer is treated to the animals perspective. Apparently dinosaur eyes perceived light and color in the exact same way as a human eye. Also interesting that 3 mushrooms have the same effect on an 80 ton sauropod as on a 130lbs human. Most of the dinosaurs are not well rendered either. The two-legged predators are mostly OK, but any of the four legged species look horrible. There locomotion is all wrong. This is just utter ridiculousness. I watched it thinking that it must be a joke. The only point I can discern is this: there are dinosaurs, they killed other dinosaurs or got killed until a meteor hit. I'm still not convinced this film isn't a joke of some sort. Is it? Did I miss something? If you want a well research documentary with lots of CGI dinosaurs, watch the excellent \"Walking with Dinosaurs\" done by the BBC.",
         "This is an odd little movie. Although the animation and layout of the film might make you think that this is going to be a straight-up documentary like the BBC's \"Walking With...\" series, \"Dinotasia\" is more like a series of vignettes surrounding the experiences of a few individual dinosaurs (a pterosaur learning to fly, a tyrannosaurus couple defending their territory, etc.). Although Werner Herzog is cast as the narrator, he barely speaks at all, though he usually introduces each vignette with a few short lines, but these are more related to the theme of the narrative rather than scientific facts. Although it comes off a bit cartoonish at times and might turn off people who came in expecting a true documentary, \"Dinotasia\" is quite an enjoyable viewing experience. At the very least, it's the world's first and only black comedy that can boast photo-realistic animated dinosaurs!",
         "In the style of Walking With Dinosaurs, et al, Dinotasia presents a credible CGI depicted speculation of how dinosaur habitation on earth might have played out. Having some experience in the subject, I delighted in the sound paleontology and the accurate prehistory depicted. Some license was taken to infuse a little anthropomorphic appeal into the tale and, consequently, it was like I had a front row seat on a beautifully animated diorama of the age. Starting from the late Permian, it spans the Triassic and Jurassic and on through the early & late Cretaceous periods. Vignettes though they were, I was transfixed by the mini-stories of various dinosaur characters, followed as they struggled to hunt, reproduce, adapt and survive. I found myself even cheering-on several protagonist Tyrannosaurus Rexes, heroes until the end of the late Cretaceous at 65 Ma. Was it entertainment? Sure. I always have liked Werner Herzog, who narrated the film, though sparsely. Most of it required no narrative but his thick German accent was not distracting to my accustomed ear when it emerged from the soundtrack music...which was terrific too. I recommend it wholeheartedly for pretty much any age group.",
         "This is the main problem I have with this movie: It is not what it says it is. This is not a documentary, this is an anthology film based on black comedy and taking place millions of years ago. To be honest with you,it is a good comedy, but I cannot appreciate it because of how far it is of what it pretends to be. Overall, it is a great time with a lot of fun moments. Yes, CGI is quite bad, but you get used to it pretty fast and the characters have much more development that in a lot of movies even though they cannot talk and the narration is almost nonexistent. Unfortunately, the movie, as a whole, is brought down by its lack of honesty with the audience."
      ],
      "genres": [
         "Documentary",
         "Animation"
      ],
      "productionCompanies": [],
      "summaries": [
         "One of our favourite natural history subjects, the good old dinosaur, gets a makeover and then some in this fantastically ambitious and groundbreaking documentary. Based on cutting-edge palaeontology and the latest fossil records, DINOTASIA presents a series of vignettes about dinosaurs - both familiar faces and some we have only found out about in the past ten years. The film uses CGI to bring the stories to life, but draws on animation's birth in silent film and early Disney to create proper, traditional visual storytelling. Werner Herzog narrates, reuniting with the team behind GRIZZLY MAN and CAVE OF FORGOTTEN DREAMS.",
         "A collection of vignettes presenting possible experiences in the lives of dinosaurs during various periods."
      ],
      "budget": 0
   },
   "movielensId": 136439,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "2012-05-04",
      "dvdReleaseDate": null,
      "directors": [
         "David Krentz",
         "Erik Nelson"
      ],
      "runtime": 83,
      "movieId": 136439,
      "title": "Dinotasia",
      "mpaa": null,
      "actors": ["Werner Herzog"],
      "imdbMovieId": "2387443",
      "originalTitle": "Dinotasia",
      "genres": [
         "Animation",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Computer-generated animation about the daily lives of dinosaurs, narrated by Werner Herzog.",
      "tmdbMovieId": 103194,
      "avgRating": 2.75,
      "releaseYear": "2012",
      "numRatings": 2,
      "posterPath": "/ySqhKJB08s3cTpFOjxluQtUKjVG.jpg"
   }
}