{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stand-up comedy",
            "id": 9716
         },
         {
            "name": "political humour",
            "id": 199622
         },
         {
            "name": "religious humour",
            "id": 199623
         }
      ],
      "imdb_id": "tt0473006",
      "video": false,
      "title": "Bill Maher: I'm Swiss",
      "recommendations": [
         17229,
         13591,
         13070,
         40150,
         21580,
         38665,
         21576,
         13587,
         13588,
         38922,
         78552,
         43700,
         29127,
         76177,
         87148,
         173056,
         32482,
         26797,
         33801,
         180935
      ],
      "backdrop_path": "/44B3or3YBEqqiNFsA1WiXhx6Afg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Bill Maher",
            "gender": 2,
            "credit_id": "52fe4420c3a368484e010ca3",
            "name": "Bill Maher",
            "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
            "id": 74086,
            "order": 0
         }],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4420c3a368484e010ca9",
               "name": "Michael Drumm",
               "profile_path": null,
               "id": 86298,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4420c3a368484e010caf",
               "name": "Bill Maher",
               "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
               "id": 74086,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.414557,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21578,
      "vote_count": 6,
      "budget": 0,
      "overview": "Political comedy about the Government (domestic and foreign policies), the president, the public's own ignorance and faults, and so forth. He also makes some hilarious detours in his own renditions of rap lyrics read out in proper, coherent (non-Ebonic) language. There are also some very poignant pieces on Bush, religion, drugs (notably marijuana), which then link to homeland security. Unlike a comedian like George Carlin who may go from topics in the 'big world' in his act to things in the 'little world' like spotting the random things in life, Maher is very much a comedian of the times, on the attack but clear about his political allegiances.",
      "similar": [
         35595,
         200133,
         34001,
         31788,
         34497,
         416477,
         34505,
         34512,
         812,
         703,
         16290,
         270946,
         49013,
         62206,
         13015,
         34163,
         23483,
         67308,
         51828,
         34509
      ],
      "original_title": "Bill Maher: I'm Swiss",
      "runtime": 99,
      "poster_path": "/p9odQbZ8eiIYU07qbFIjqwNOJCy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kid Love Productions",
            "id": 21200,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Music Link Productions",
            "id": 21201,
            "origin_country": ""
         }
      ],
      "release_date": "2005-07-30",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Drumm"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Bill Maher"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0473006/",
      "coverLink": null,
      "actors": ["Bill Maher"],
      "reviews": [
         "Unlike many people who try to joke about politics, Bill Maher has the distinction of being extremely funny. Even if you disagree with his opinions (as I do when he talks about religion--I happen to believe that religious not only is compatible with leftist thinking, but that the New Testament promotes it), he is very, very funny. Anyone who has seen POLITICALLY INCORRECT or his current show REAL TIME have repeatedly seen those who stand as far to the right as possible laughing their heads off as Maher makes one quip after another. There is no denying that he is a funny, funny man, and he is very funny in this comedy routine, a routine that originally appeared on HBO as a comedy special. Maher is also, unfortunately, one of the most astute political commentators in America. I say unfortunately because, as Jon Stewart has repeatedly pointed out, there is something extremely sad about two of the finest political analysts in America being comedians. In fact, the only two political columnists I consistently rate above Maher and Stewart for depth of insight are Paul Krugman and E. J. Dionne. Typically, Maher is perceived as being very far to the left, but that is actually somewhat a freak of the times. At many points in the history of the U.S. he would probably be perceived as being much further to the right. He is in many regards, as he often points out himself, a classic libertarian, though without the utopian mania about the blessings that a completely unfettered free market would generate. But he is in many regards pretty much a classic Jeffersonian. Jefferson famously wrote in his NOTES ON VIRGINIA: \"It does me no injury for my neighbor to say there are twenty gods or no god. In neither picks my pocket nor breaks my leg.\" In context Jefferson wrote trying to limit the extent of government in people's lives, but today we see a vast number of people who want to extend the intrusion of religion into government because they do feel that policy decisions with which they disagree do in fact do them harm. Gay marriage is the classic example of this. Maher finds this lamentable, and he articulates this over and over. Essentially, he is calling for the same kind of tolerance that Jefferson advocated so strongly. This is not an especially left wing position: Barry Goldwater disliked the rise of the Reaganites because he saw them as meddling too much in the moral lives of individuals. If intolerance of individual opinion is one of Maher's targets, another is stupidity. He is brilliant at identifying nonsense and characterizing it as such. He is also unswerving in calling a dime a dime. For instance, he points out the cowardly lack of courage shown by the media for referring to Strom Thurmond's fathering a child by a black servant in the 1925 Jim Crow South Carolina as \"having an affair,\" as if and 18-year-old black servant had any choice in the matter. Maher calls it what it almost certainly was: rape. But as he calls our attention to one political issue after another, Maher laces it with humor. So, in the end there are two very good reasons to see this, first to be entertained, and second to be informed. Either reason would be sufficient on its own, but together they make this a must-see.",
         "One of the things I like a lot on a stand-up comedy special is when the comedian has a kind of link or flow with the material. With \"I'm Swiss\" Bill Maher has a connecting thread- the Government, including domestic and foreign policies, the president, the public's own ignorance and faults, and so forth. He also makes some hilarious detours; one of the funniest things he's ever done, stand-up or otherwise, is in his own renditions of rap lyrics read out in proper, coherent (non ebonic) language. There are also some very poignant pieces on Bush, on religion, on drugs (notably marijana), which then links into homeland security. Unlike a comedian like George Carlin who may go from topics in the 'big world' in his act to things in the 'little world' like spotting the random things in life, Maher is very much a comedian of the times, on the attack but clear about his political allegiances. Even when some of the laughs aren't there (there's a few times) it's made up for in the lucid ideas and writing behind his performance. You may hear some things you've heard before on his 'Real Time' show, but if you don't watch the show though this will all be very new.",
         "Bill Maher: I'm Swiss is perhaps the funniest standup special Maher has ever given us. From his entrance, he comes out looking like a soul with a lot on his mind he can't wait to get out there, and once he hits his stride - roughly ten to fifteen minutes in - interrupting him or even pausing the DVD seems like a despicable act. For ninety-nine minutes, Maher goes off on zealous rants, such as 9/11, the Bush administration, gay marriage, the war on drugs, religion, and, one of the best subjects he has ever explored, food and why it is killing us. He talks about how the bloating, belching, and unsettled stomach many people face shouldn't be considered an act of nature but the body's cry for help from all the garbage, chemicals, high-fructose corn syrup, and aspartame we've been ingesting for so many years. Moreover, his commentary on religion and morals and values hits particular highs as he, again, brings up valid points all while making them hilarious and communicable to people of all political positions and classes, so long as they're willing to hear him out. The title of the special is derived from Maher's phrase which he uses to describe the Bush administration, saying he is like Switzerland in the face of chaos; he's Swiss. And in many ways, so am I. Starring: Bill Maher. Directed by: Michael Drumm.",
         "With the exception of the protester outside the venue, the crowd coming to see Bill Maher live in Portland seem keen and on his side \u0096 and indeed they are. This is a given but it does help someone like Bill Maher that his audience are already on his side because he doesn't need to worry about winning them over. Having said that, I have seen him lose his own audience sometime with how extreme he can be in his views \u0096 or rather, in my view, how divisive his opinions can be. I often find that he is the main problem with Real Time and also that, while criticising Republicans for sweeping generalisations and for refusing to find common ground with others, he is just as guilty of that as well. Now, in a political discussion show this limits his hosting but in his stand-ups it does at times cost him laughs and audience because he does appear to come out of nowhere \u0096 almost going from being coherent and intelligent to being the equivalent of the guy standing outside shouting at people. With I'm Swiss I am very pleased to report that, although his promise to be non-partisan is total BS, he does actually manage to deliver laughs based on reasoned opinion \u0096 maybe not opinion that every viewer will agree with but mostly it is opinion where you can see why he feels that way because he has explained it in a way that is also funny. Here and there he has subjects that I didn't think he did this on, but I recognise that this might also be because I don't agree with his opinions and approach to those subjects, rather than him being the problem \u0096 I recognise it as a possibility I mean, but not that it is a reality! Mostly though, I'm Swiss is a really enjoyable show that is intelligent but also funny. Of course it plays best to liberals and of course he goes off on one a couple of times and yes it has a terrible title but still, speaking as someone who thinks Real Time would be better if Maher wasn't who he was, I thought he was great here."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": [
         "Kid Love Productions",
         "Music Link Productions"
      ],
      "summaries": ["\"I don't hate America,\" comedian Bill Maher declares during I'm Swiss, recorded in March 2005 in Portland, OR. \"I love America. (But) I'm embarrassed.\" And there we have not only the source of the title (his discomfiture, he jokes, has led him to pretend he's from another country) but also the crux of Maher's overall presentation on this, his third DVD taken from a program that was first shown on HBO."],
      "budget": 0
   },
   "movielensId": 136433,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2005-07-30",
      "dvdReleaseDate": null,
      "directors": ["Michael Drumm"],
      "runtime": 99,
      "movieId": 136433,
      "title": "Bill Maher: I'm Swiss",
      "mpaa": "",
      "actors": ["Bill Maher"],
      "imdbMovieId": "0473006",
      "originalTitle": "Bill Maher: I'm Swiss",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Political comedy about the Government (domestic and foreign policies), the president, the public's own ignorance and faults, and so forth. He also makes some hilarious detours in his own renditions of rap lyrics read out in proper, coherent (non-Ebonic) language. There are also some very poignant pieces on Bush, religion, drugs (notably marijuana), which then link to homeland security. Unlike a comedian like George Carlin who may go from topics in the 'big world' in his act to things in the 'little world' like spotting the random things in life, Maher is very much a comedian of the times, on the attack but clear about his political allegiances.",
      "tmdbMovieId": 21578,
      "avgRating": 4.66667,
      "releaseYear": "2005",
      "numRatings": 3,
      "posterPath": "/p9odQbZ8eiIYU07qbFIjqwNOJCy.jpg"
   }
}