{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "ventriloquist",
            "id": 9704
         },
         {
            "name": "stand-up comedy",
            "id": 9716
         }
      ],
      "imdb_id": "tt1295909",
      "video": false,
      "title": "Jeff Dunham: Jeff Dunham's Very Special Christmas Special",
      "recommendations": [
         75190,
         14540,
         51592,
         14542,
         306626,
         31922,
         19626,
         51836,
         45840,
         209920,
         21585,
         14809,
         18996,
         50541,
         91322,
         13015,
         31847
      ],
      "backdrop_path": "/j94K33QuEsotxSa64VMbOeWK0XE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself / Walter / Achmed the Dead Terrorist / Bubba J / Peanut / José Jalapeño on a Stick",
               "gender": 2,
               "credit_id": "52fe45fe9251416c750696f5",
               "name": "Jeff Dunham",
               "profile_path": "/6eIcIJbFj0cpZ3eRZFHkzlOTuB9.jpg",
               "id": 76982,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Guitar Guy",
               "gender": 0,
               "credit_id": "52fe45fe9251416c750696f9",
               "name": "Brian Haner",
               "profile_path": null,
               "id": 76984,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe45fe9251416c750696ff",
            "name": "Michael Simon",
            "profile_path": "/dmY5RZIjbkleBLBgeE9Pr8DOBNj.jpg",
            "id": 77042,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.64959,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14541,
      "vote_count": 25,
      "budget": 0,
      "overview": "The multi-platinum selling comedian performs his first holiday-themed stand-up special with his friends.",
      "similar": [
         1581,
         10147,
         634,
         772,
         9714,
         416477,
         1585,
         9479,
         8871,
         10719,
         927,
         941,
         703,
         5236,
         460793,
         431530,
         296100,
         5255,
         51828,
         364
      ],
      "original_title": "Jeff Dunham: Jeff Dunham's Very Special Christmas Special",
      "runtime": 85,
      "poster_path": "/jLoNSvEoAtxSThlXrhEDxAf5s4c.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Levity Productions",
         "id": 2922,
         "origin_country": ""
      }],
      "release_date": "2008-11-16",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.jeffdunham.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Simon"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Jeff Dunham"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt1295909/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTg0MDMwMTM5OV5BMl5BanBnXkFtZTgwNDgyNDcwMzE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jeff Dunham",
         "Brian Haner"
      ],
      "reviews": [
         "I would have rated him higher but I can only relate to what I can hear. I bought his DVD hoping that closed caption was included as one of the features. I'm only sorry that I didn't enjoy it as much as I could have. I would be glad to collect his video's if closed caption was available. Maybe the next video will have what I need to start my collection. I was lucky enough to have caught part of his act on CMT channel this week-end. Enjoyed it thoroughly. Still laughing. The DVD I bought will be given to my son, he's also a Jeff Dunham fan. Just maybe this information will find its way to the Jeff Dunham producers and all the hearing impaired could start laughing again",
         "This stand-up comedy special made me realize something; I can probably become a rich, popular and famous comedian as well! Because if it's so easy to make an audience laugh with so little funny moments or good jokes, everybody can be a comedian I guess. Seems that Jeff Dunham is only known and popular thanks to his use of puppets. At first this was still being something really original and new but it is getting old already by now. Jeff Dunham still would had been OK with me if only he was able to write some more clever and funny material to go along with his gimmick. Really the problem with this show is that it's just shockingly not funny at all. None of the writing or any of the jokes are ever being clever ones. Every joke and reply is incredibly predictable and incredibly unfunny because of this. Seems to me that Dunham wrote this show on one rainy afternoon at the kitchen-table and just wrote down everything that first came up into his head and wrote it down, without trying to further expand on it or try to give some twists or in-depth jokes to any of his material. Still incredibly amazing to see how the crowd is still cracking up as if it's the funniest thing they had ever heard or seen in their lifetime. Where did they get this people from? This guy should had been booed of the stage the first moment he was telling a lame and predictable joke. Its their fault other people now can see this 85 minutes of 'comedy' torture on DVD or TV. But the audience are not the only persons manically laughing. Dunham himself also cracks up lots of times when he is either telling a story or doing a routine with one of his puppets. This however seemed forced and just not naturally to me and more was a trick to get the audience laughing as well. The guitar guy gets used in the same way. He laughs and looks surprised every time a puppet makes a remark or says something 'funny' or offensive, like he doesn't known the material and this is the first time he ever heard any of it. So perhaps it helps to see Jeff Dunham more as a ventriloquist than as a stand-up comedian. But sorry, he is not even very good at that. It's obvious and distracting how he is moving his mouth at times and his puppets are mostly being just like his material; stupid and predictable. Each one of his many puppets is basically being very stereotypical and therefor also very easy to write for. Walter is a grumpy old guy, so it doesn't matter what he says, as long as it's being something grumpy. It also doesn't matter much what Achmed says, as long as he says 'Silence, I kill you!' every now and then. Bubba J is a stupid Southerner, so he needs to say something NASCAR or beer related every now and then. José Jalapeño is your very stereotypical Mexican and Peanut is, well, being a peanut. Peanut is perhaps the most creative puppet Dunham created but I have no idea anymore what any of his material was ever about, since I had already lost complete interest in this once Peanut made his entrance. Some people even call Dunham racist because his puppets are being big stereotypes and often make racist remarks but I just call it lack of talent and creativity and the only offensive thing about it is that it's not being anything funny at all. A very special Christmas special indeed... 2/10 http://bobafett1138.blogspot.com/",
         "First off, we have the first 2 DVDs, and can watch either one and still laugh ourselves into tears. But this third one was a total disappointment. We got it from Netflix, so a lot of stuff was bleeped or cut out. The opening sequence in the sleigh was not funny at all, and actually kind of stupid. Then his opening monologue about his eldest daughter and her first visit to fill up a gas tank was not even close to being funny or even entertaining. It was like he was off, and he knew it. Then our first character comes out, Walter, and if I am not mistaken, not only was Jeff off, so was Walter. And at times Walter sounded more like Peanut (voice and all) than Walter. Achmed, well, when did Achmed turn into a wimp? Bubba I have never really liked that much, and none of the jokes worked at all, though his song was a little cute. Maybe because, like with the other characters, we all have heard them already. There were some laughs throughout, with the most at the end with Peanut, Guitar Guy, and Jeff trying to read Moore's XMAS classic. Peanut's interjections were funny, so I am glad I stayed for this. 85 minutes and maybe 8 total were funny and/or original. The extras, like the questions asked of Walter, were stale as well. Time for some new material, Jeff, and please give us back Walter. We all like him best when he's a total curmudgeon. But the worst of this is how offensive and racist most of the jokes were. When Achmed did the joke about how they blow up so young (or something like that) we were so offended we were ready to turn it off. And we're not even Muslim. Dunham managed to get in every stereotype and offended and insulted us all in the process. Was this show for members of the KKK?",
         "Jeff Dunham's strength is in his imagintive puppets, which convey subtle facial expressions that are indeed funny. He also has mastered the art of coordinating his voice with visual gestures and manic movements by his puppets. The content of his comedy, however, is offensive. He routinely laughs about disabilties such as scoliosis, polio, and diabetes. One of his characters, Jose Jalapeno, is sadly a hearkening back to the days when Mexicans were stereotyped and laughed at as a form of racism. He played before an audience in Milwaukeee that seemed to be low-grade, uneducated morons who seemed to lap up all of his \"jokes\". It must have been \"ugly\" night - tickets 1/2 price for the facially challenged... Jeff seems to be his own biggest fan, as he constantly cracks up at himself. He also has a puppet spontaneously tell him that he's cute - this guy seems more than just a little vain. The guy standing in the forefront holding a guitar which he doesn't play serves as a \"laugher\" - he cues the audience when to laugh. I wouldn't pay to see this guy, who seems to appeal to the less sophisticated among us. How does he sell out these playhouses? I wouldn't sit in the balcony to watch a ventriloquist act..."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": ["Levity Productions"],
      "summaries": ["The multi-platinum selling comedian performs his first holiday-themed stand-up special with his friends."],
      "budget": 0
   },
   "movielensId": 136517,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2008-11-16",
      "dvdReleaseDate": null,
      "directors": ["Michael Simon"],
      "runtime": 85,
      "movieId": 136517,
      "title": "Jeff Dunham: Jeff Dunham's Very Special Christmas Special",
      "mpaa": "PG-13",
      "actors": [
         "Jeff Dunham",
         "Brian Haner"
      ],
      "imdbMovieId": "1295909",
      "originalTitle": "Jeff Dunham: Jeff Dunham's Very Special Christmas Special",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "The multi-platinum selling comedian performs his first holiday-themed stand-up special with his friends.",
      "tmdbMovieId": 14541,
      "avgRating": 3,
      "releaseYear": "2008",
      "numRatings": 14,
      "posterPath": "/jLoNSvEoAtxSThlXrhEDxAf5s4c.jpg"
   }
}