{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0094813",
      "video": false,
      "title": "Bulletproof",
      "recommendations": [],
      "backdrop_path": "/4CSbjWohcI7pgSJyagYiMmyGRkw.jpg",
      "revenue": 807947,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frank 'Bulletproof' McBain",
               "gender": 2,
               "credit_id": "52fe49cc9251416c910b9123",
               "name": "Gary Busey",
               "profile_path": "/n66ycv61ZoqusHthcQde1g3JY6T.jpg",
               "id": 2048,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Capt. Devon Shepard",
               "gender": 1,
               "credit_id": "52fe49cc9251416c910b9127",
               "name": "Darlanne Fluegel",
               "profile_path": "/bhZdjbtZ71fsdYztrsq3KCC94F.jpg",
               "id": 4761,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Col. Kartiff",
               "gender": 2,
               "credit_id": "52fe49cc9251416c910b912b",
               "name": "Henry Silva",
               "profile_path": "/wSDmsMhQ95utBggMaHOCALMM9CC.jpg",
               "id": 14731,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Billy Dunbar",
               "gender": 2,
               "credit_id": "53d53eea0e0a26283e0044e8",
               "name": "Thalmus Rasulala",
               "profile_path": "/yPuxMbOo7mG22I8kdmLmht00KIq.jpg",
               "id": 86138,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Sgt. O'Rourke",
               "gender": 2,
               "credit_id": "53d53efb0e0a26283b0043bf",
               "name": "L.Q. Jones",
               "profile_path": "/jhPsFq7qYT2QKc4FO70fqxgfpXs.jpg",
               "id": 8262,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gen. Maximiliano Brogado",
               "gender": 0,
               "credit_id": "53d53f120e0a26284a004393",
               "name": "René Enríquez",
               "profile_path": null,
               "id": 1221500,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Colby",
               "gender": 2,
               "credit_id": "53d53f220e0a262847004349",
               "name": "Mills Watson",
               "profile_path": "/9NYb4JUcQ3sbOZUqE8f0niGYNlU.jpg",
               "id": 140345,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Agent Tarpley",
               "gender": 2,
               "credit_id": "53d53f320e0a26283b0043c3",
               "name": "James Andronica",
               "profile_path": null,
               "id": 121139,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Miles Blackburn",
               "gender": 2,
               "credit_id": "53d53f570e0a26283e0044f2",
               "name": "R.G. Armstrong",
               "profile_path": "/iyOD1sUIX4SAPbfF4C9C7cI3ayP.jpg",
               "id": 1107,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Russian Major",
               "gender": 2,
               "credit_id": "53d53f720e0a26283b0043c9",
               "name": "William Smith",
               "profile_path": "/rlO5RpMwYgyLmD9QsePedpsS8Dq.jpg",
               "id": 98102,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Gen. Gallo",
               "gender": 2,
               "credit_id": "53d53f800e0a26284d0041a4",
               "name": "Luke Askew",
               "profile_path": "/nlV0bfadoMjbz7vxmLl5zALc86H.jpg",
               "id": 8962,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Capt. Briggs",
               "gender": 2,
               "credit_id": "53d53f8d0e0a2628410043b9",
               "name": "Lincoln Kilpatrick",
               "profile_path": "/7gND70KieLAwBN3SVSjUOTXtklz.jpg",
               "id": 104907,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Tracy",
               "gender": 1,
               "credit_id": "53d53f9b0e0a262847004355",
               "name": "Lydie Denier",
               "profile_path": "/foY7t05T8ZtfHD1oQ9EbcdAbxrs.jpg",
               "id": 42137,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Sharkey",
               "gender": 2,
               "credit_id": "53d53fa90e0a26283800459e",
               "name": "Danny Trejo",
               "profile_path": "/7b8cDfrmeheQbgryfCm7MeJOxxM.jpg",
               "id": 11160,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49cc9251416c910b9131",
               "name": "Steve Carver",
               "profile_path": "/mQj6GGZ9s4IGh4qWUjCJBbFar1v.jpg",
               "id": 102627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "53d53fbe0e0a2628380045a3",
               "name": "T.L. Lankford",
               "profile_path": "/h0iZPpkRK9X92WF7NeQ6cDWM3km.jpg",
               "id": 97696,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "53d53fce0e0a26283b0043d9",
               "name": "B.J. Goldman",
               "profile_path": null,
               "id": 1346772,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "53d53fdc0e0a2628410043c3",
               "name": "Paul Hertzberg",
               "profile_path": null,
               "id": 42368,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "53d53fe80e0a26283b0043de",
               "name": "Thomas Chase",
               "profile_path": null,
               "id": 1087518,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "53d540000e0a2628380045ad",
               "name": "Steve Rucker",
               "profile_path": null,
               "id": 1087519,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "53d5400d0e0a2628380045b7",
               "name": "Francis Grumman",
               "profile_path": null,
               "id": 1122026,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "53d5401a0e0a2628380045bb",
               "name": "Jeff Freeman",
               "profile_path": null,
               "id": 11876,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "53d540260e0a26284400450e",
               "name": "Barbara Claman",
               "profile_path": null,
               "id": 959257,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53d540310e0a2628410043d7",
               "name": "Margaret McSharry",
               "profile_path": null,
               "id": 1346773,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "53d5403f0e0a26284d0041d4",
               "name": "Adrian Gorton",
               "profile_path": null,
               "id": 3719,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.799125,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 87533,
      "vote_count": 7,
      "budget": 5000000,
      "overview": "A group of dangerous terrorists succeeds to get hold of a tank of the army and all its crew.",
      "similar": [],
      "original_title": "Bulletproof",
      "runtime": 94,
      "poster_path": "/k9R4eKazL1zNgfHe2UGDD7BPast.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bulletproof Productions",
         "id": 28433,
         "origin_country": ""
      }],
      "release_date": "1988-04-20",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Improbable Odds. Unstoppable Force.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Steve Carver"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "T.L. Lankford",
         "Fred Olen Ray"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094813/",
      "coverLink": null,
      "actors": [
         "Gary Busey",
         "Darlanne Fluegel",
         "Henry Silva"
      ],
      "reviews": [
         "\"Improbable Odds. Unstoppable Force.\" I know it might seem hard to believe, but there once was a time when Gary Busey had a boyish charm and could have been an action star and wasn't known as a crazy guy and late-night comedian punchline. To witness this prime Busey, simply check out \"Bulletproof\" (not to be confused with the 1996 film where Adam Sandler shoots people). Busey plays Frank \"Bulletproof\" McBain, a rogue, but lovable cop on the edge. He's teamed up with the original Blacula himself, Thalmus Rasulala. One of McBain's talents is he is able to withstand being shot, and he saves all the bullets he's been shot with in a jar in his bathroom. Meanwhile, somewhere in Mexico, a terrorist network of \"Mexicans, Nicaraguans and A-rabs\" are all working in collusion to take over the world using a supertank called the NBT-90 Thunderblast. The evil Colonel Kartiff (Silva) and General Brogado (Rene Enriquez) are heading up the operation, so Special Ops Military Adviser Sgt. O'Rourke (Jones) and army officer Devon Shepard (Darlanne Fluegel) go south of the border to investigate. They, along with some of their army buddies and a group of priests and nuns are kidnapped and held hostage by the evildoers. Only one man can save his compatriots (and Devon, his long-lost love)...MCBAIN of course! And did we mention there are also evil Russians McBain has to stop? In the 80's, you couldn't be the hero in an action movie and not be wisecracking. Most of Busey's lines are snappy one-liners, such as \"what's this Tonka toy?\", \"I'm a one-man suicide squad!\", and he even pioneered his own insult - the immortal \"Butthorn\". He inexplicably says this word THREE times during the movie. I guess it didn't catch on. There are some sensitive flashbacks, and Devon even says to him \"you may be bulletproof but you're not love proof\". The movie on the whole is fun, upbeat and there is plenty of humor. Henry Silva plays an Islamic extremist, and the enemies are \"communist-inspired terrorists\". I guess it was pretty ahead of its time. Surely this was one of the only times Fred Olen Ray (who wrote the story) got a movie released by a major studio. What would the world be like today if all his movies were? A movie highlight is when Busey is tied to a big circular thing that looks like a huge cheese wheel. Watch out for this scene. So if you want to see a movie where Gary Busey is a lovable supercop and ladies man, and before he was crazy (well, really crazy) in a movie with plenty of heart, sax solos and blow-ups, and a mixed bag of world villains, this is the movie for you. For more insanity, please visit: comeuppancereviews.com",
         "Frank \"Bulletproof\" McBain, a \"one man suicide squad\", is needed by his country, an LA Cop reinstated into the military to take on a most dangerous mission..to recapture a commandeered supertank equipped with impressive armor and weaponry, not to mention rescue his former girlfriend, Captain Devon Shepard(Darlanne Fluegel, pretty awful, but also rather amusing in how she sneers and spits venom at arch-nemesis Silva). With Henry Silva and William Smith as two of many B-movie heavies Gary Busey will have to encounter if he is to succeed in his mission. This is the kind of action film I enjoy wholeheartedly. It has a ridiculous premise where one man, in this case the awesome, one and only, Gary Busey, is able to infiltrate enemy lines(in this movie, Mexico)and eventually get his hands on the Thunderblast(the boy in me grinned ear to ear when I first heard what they named the tank)which, sufficed to say, does some serious damage to the terrorists. I would love to know the body count for this movie, because McBain certainly leaves quite a many scumbag Commies dead before all is said and done. You also have a delightfully slimy René Enríquez as General Brogado, Silva's superior, and Juan Fernández as Pantaro, the executioner who relishes gunning down American soldiers, under the command of LQ Jones(as Sgt. O'Rourke), in cold blood. RG Armstrong even shows up as Miles Blackburn, the one responsible for forcing McBain back into action. If you are gonna start an action film, I prefer the way BULLETPROOF does, with Busey, and his poor partner(who just wants to call back up)halting a gun smuggling operation in progress with plenty of gunfire erupting, leading to an ice cream truck(used to carry the smuggled weapons!)tipping over and exploding. As you expect, done in flashback of course, Busey is haunted by a partner's accidental death, at the hand of Smith. Danny Trejo has a small part as one of the gun smugglers who attempts to stop Busey from arresting him, by firing a machine gun out the back of the ice cream truck at him while he was in hot pursuit. I'm a strong supporter in opening a loud, dumb action flick with a reckless cop(with a death wish, it seems)exchanging rounds of ammunition with criminals resulting in dead bodies and explosions. You get the hilarious, but so stupendously radical, scene where Busey is bound to a wheel which is sent turning down a hill thanks to a grenade triggered by Fluegel, saving him from being Juan Fernández's target practice. Or, the town showdown as Brogado's militia, with something like four tanks and an endless supply of Arabs, against the Thunderblast which decimates everything in sight. Silva and Fluegel have spirited spats with one another(you gotta love Silva who snarls as well as any hissable villain)with the Captain getting even with him towards the end(he rapes her, determined to prove his point that all women are to respect him). But, it's all about Busey..who gets to slide into the \"one man army\" role, and this fan, for one, had a grand old time seeing Gary at play. Busey sure seems to be having a ball as the hero, more often than not he's the one as a villain, not vice versa. Hilarious how the Thunderblast can withstand not only four tanks and constant missiles, but also a Russian helicopter(a Soviet Mi-24 as mentioned by Busey while the Thunderblast is under assault by the aircraft machine) as well..we sure made one hell of a really impressive machine, this supertank. The plot and characters are silly, so if one enters BULLETPROOF expecting anything other than goofy action fare with tons of violence, you best stay as far away from this flick as possible. An 80's action movie after my own heart, it defies logic almost at every turn..as these movies are supposed to do, when Silva and company have Busey right where they want him, instead of shooting him immediately, they postpone which leads to his inevitable freedom from their clutches.",
         "Lame brain story and messily energetic plotting, but \"Bulletproof\" is so much fun\u0085 absurdly so. Forget the nonsensical narrative; watch it for the mayhem, explosions, gunfire and Gary Busey going about his business while calling his enemies a \"butt-horn\". Yes that's right, \"Bird season's over butt-horn\"! Dynamic and noisy from the get-go and what a way to introduce Busey's unstoppably grizzled character Frank \"Bulleproof\" McBain. Watch him remove bullets from his wounds and then add them to a jar. Hey its no action masterpiece and it predictably recycles itself, but this crackling rough b-action joint delivers the over-the-top goods and director Steve Carver (who directed two great Chuck Norris' ventures; \"Eye for An Eye\" & \"Lone Wolf McQuade\") just knows how to capably package it all up. Tough exchanges, sharp, if pulpy dialogues, grungy setting with cheap looking props (the rolling wheel scene involving great dummy work was side-splitting, so was Silva's reaction to it) and a frenetic pace that never lets up. Even there's time out for some heartfelt flashbacks; Busy and a saxophone. Simply smooth in presenting a broken man. While the names and faces of familiarity do show up. How can you go wrong when you have Henry Silva, Juan Fernandez, William Smith and Rene Enriquez adding spice and maliciousness to their villainous roles. You got Cuban, Libyan and Russian terrorists all rolled into one. Talk about an aimless bunch though\u0085 I lost count how many times they had a chance to take out their man even with an onslaught of ammunition. Who to save the day; \"Bulletproof\" McBain with Busey's charisma on overload. His mission; make his way to an Mexican village near the Texan border to retrieve a stolen American top secret attack vehicle code named Thunderblast (truly a space-age looking piece of machinery), which is just as bulletproof as McBain. Silva cheerily hams it up, but it's Smith that packs the venom despite the short time he spends on screen. Typical textbook bad guys, doing the bad guy shtick. Also popping up is the beautifully impulsive Darlanne Fluegel whose character shares a past with \"Bulletproof\" McBain. L.Q Jones, R.G Armstrong, Luke Askew, Lincoln Kilpatrick and Mills Watson make up solid cast. In very small parts are genre favourites Danny Trejo and Cary -Hiroyuki Tagawa. Another interesting name to find itself attached to the credits; low-budget film-maker Fred Olen Ray put pen to paper to co-write the story. \"You might be bulletproof, but I'm just human\".",
         "Oh Lord, did I enjoy myself watching this film! Gary Busey plays a guy who apparently cannot be harmed by bullets, or by much of anything, although he's just some guy with no immortal powers. He falls off haylofts, gets chained to giant wheels and rolls down hills, runs a very comfy looking army tank, and plays the tenor saxophone. Too much goes on to list, but the world's greatest and most enigmatic insult, \"butt-horn\", is coined, making this easily the most important film of the century. I insist that you purchase it.",
         "This film quite literally has every single action movie cliche and all of them work to its advantage. Straight from Lethal Weapon Gary Busey wisecracks, shoots and chuckles through this film with such reckless abandonment it can't help but amuse and entertain. There are tanks, helicopters, machine gun battles, grenades and ice cream vans and if they aren't good enough reasons to watch this film then how about the best one...Danny Trejo. And if you don't know who Danny Trejo is then you probably won't like this film.",
         "Here's another 80's, one man army action film's, and this one's just as entertaining as the other's. It start's off like LETHAL WEAPON, with Busey and his by-the-book black partner on a steakout at a warehouse, and then turns into another RAMBO style film with Busey being assigned to save hostages from commie bad guys in Mexico. Of course, Henry Silva plays the villain, and does his usual good job at it, and there are many familiar faces in this movie and you'll have fun recognizing the actor's in this you have seen elsewhere. This is a pretty dumb movie, but it's also fun and enjoyable and I recommend it to fans of one man army action movies. 3/5",
         "Move over, Rambo, there's a new one-man-army in town... and he knows how to play the sax. That makes him a real deadly enemy! Gary Busey, one of my favorite B-squad actors, is Frank \"Bulletproof\" McBain, an ex-CIA agent who can't be harmed by bullets and likes to give his foes weird names like \"Butthorn\" (I guess that's a softer version of the word a##-hole!). He uses big guns, plays the saxaphone, and really whups the crap out of his enemies. Oh, and he gets the chicks, too. I know, this film sounds really derivative and ridiculous at first, but if you have the right patience, you could wind up enjoying this film. Busey is a great actor because he's the kind that can portray any character. For example, in \"Lethal Weapon\", he's a sleazy villain, and in \"Bulletproof\", he's an all-out, gung ho hero. His ability to play any man is what really impresses me the most. If you want to see Busey as a dirtbag or a psycho, watch \"Lethal Weapon\" or \"Under Siege\", or if you like to see him as a womanizing or wisecracking good guy, either \"Bulletproof\", or \"Point Break\" are your choices.",
         "There's uber cheesy 1980s action nonsense and then there's \"Bulletproof\". This thing is so utterly daft it may lead one to believe that the filmmakers had their tongues in their cheeks to some degree. It's cheerfully dumb fun that should have viewers busting a gut, or shaking their heads at the ridiculousness of it all. The good guy is a seemingly indestructible goof ball and the villains are all pure one dimensional scum - not that that's a bad thing. In movies like \"Bulletproof\", that's what you hope for. There's plenty of explosions and plenty of gunfire; this may be stupid, but it sure as hell ain't boring. A lively, hilarious Gary Busey is cop Frank \"Bulletproof\" McBain, so nicknamed because of the amount of bullets that his body has taken (39 and counting). He keeps these souvenirs in a mason jar in his bathroom. He's forcibly pressed back into service by the military after they've *deliberately* allowed a super duper tank of theirs to be snatched up by terrorists. McBain, almost a one man show, takes on all comers, including a Mexican creep named Brogado (Rene Enriquez of 'Hill Street Blues'), a Libyan goon named Kartiff (a priceless Henry Silva), and a Russian thug played by the eternally bad ass William Smith. Director Steve Carver (\"Big Bad Mama\", \"Lone Wolf McQuade\") was an old hand at action by this point, and he keeps this patently absurd story moving right along. The cast is full of familiar faces, so buffs can have a good time playing Spot the Character Actor; Thalmus Rasulala (\"Blacula\"), L.Q. Jones (\"The Wild Bunch\"), Mills Watson (\"Cujo\"), R.G. Armstrong (\"Race with the Devil\"), Luke Askew (\"Rolling Thunder\"), Lincoln Kilpatrick (\"The Omega Man\"), delectable Lydie Denier (\"Satan's Princess\"), Juan Fernandez (\"The Collector\"), Redmond Gleeson (\"Dreamscape\"), and the great Danny Trejo all turn up as well. Smith and Silva are delicious in their roles; one has to hand it to Silva for having his swarthy villain act down pat after so many years of practice. \"In my country, women have RESPECT!\" Lovely Darlanne Fluegel plays McBains' former flame, one of the Army personnel who've been captured along with the tank. One need never worry about having to tax their brains when it comes to entertainment such as \"Bulletproof\". It's an absolute hoot from beginning to end. Eight out of 10.",
         "I had such high hopes for this movie when I discovered it. Not only does it star my favorite actor of all time (Henry Silva), but it serves as the vehicle for Gary Busey's ill-fated and misguided debut as an action star! Unfortunately, I was pretty let down by the time the end credits rolled. The only redeeming aspect of this dated movie is the first half-hour, which is a pathetic attempt to mimic Lethal Weapon-styled buddy cop movies. Like many other action flicks starring big ego second-tier stars (Steven Seagal being our number one offender here), they really try to build up the main character as a devil-may-care indestructible ex-CIA supercop who all the bad guys know about. Notice during the ice cream truck chase when the villains have this exchange after they pound Busey's car with bullets: Villain 1: I think we blew him off! Villain 2: You don't blow up a dude like McBain! The story is pretty lame once it gets going. McBain is hired by the army to retrieve a tank named \"Thunderblast\" (!) that seems to be some armored afterbirth of the Reagan-era military buildup. Henry Silva's role is pretty wasted as a Libyan colonel who is working alongside the Commies. Aside from the hilariously bad first half hour and the introduction of the word \"butthorn\" into popular lexicon, Bulletproof is pretty much a waste of time.",
         "Guns blasting, buildings exploding, cars crashing, and that's just the first ten minutes. This action-packed film involving a rogue ex-CIA mercenary who can't seem to die no matter how many times he's shot (hence the title) is pretty decent. Tough and toothy Gary Busey, usually cast as a villain in these kinda flicks, has his usual crazy charm but is a bit more subdued: after all he's carrying the entire show. Which doesn't mean there isn't a lot of terrific supporting roles including William Smith, Luke Askew, Mills Watson, R.G. Armstrong, Henry Silva, Lincoln Kirkpatrick, Thalmus Rasulala, and several other \"forgotten\" character-actors. There's enough smaller action sequences to hold up the entire story: Busey has to free a group of \"kidnapped\" American military elites and return a high-tech \"supertank\" (a normal tank with a cheesy add-on pasted to the top) back to the States. But does America deserve this killing machine any more than the bad guys? This question is asked, of course, like in any film centering on the CIA... but without getting preachy.",
         "A huge army of foreign terrorists from the far east have invaded Mexico, with the help of a nuclear-powered tank nicknamed \"Thunderblast.\" Just who do we depend on to stop these communist killers from goose-stepping into our country? Gary Busey, of course!! The star of \"The Buddy Holly Story\" and \"Silver Bullet\" plays Frank McBain, a magnum-toting cop who was once an employee of the CIA who is recruited by his former superiors to stop the terrorists before they manage to use their tank against our defenses! This movie is a real hoot, because for one thing, it has no need for logic in the first place! This movie is probably supposed to be a spoof of the \"Rambo\" films or something, and it does a damn good job of it! Busey is cool in a maniacally goofy sort of way, taunting the bad guys with the odd name of \"butt-horn.\" Exactly, what is a butt",
         "Boy, one hardly knows where to start with this choice chunk of 80's action trash. For starters, we have the one and only Gary Busey in gloriously gonzo form as Frank \"Bulletproof\" McBain, a sardonic and seemingly indestructible L.A. cop and ex-CIA agent fond of using the word \"butt-horn\" who keeps every last bullet he's been shot with in a jar. Then there's veteran villain Henry Silva sliming it up with customary reptilian gusto as the ruthless Col. Kartiff. The lovely Darlanne Fluegel supplies plenty of spunk and sass as McBain's feisty former squeeze Capt. Devon Shepard. The ineptly staged action set pieces include a car chase involving an ice cream truck and a grenade being used in the single most ludicrous escape sequence in the annals of 80's schlock cinema. McBain hits one man in the groin with an ashtray. Naturally, we've got cheesy flashbacks and even cheesier one-liners (\"Bird season's over, butt-horn!\"). Lots of stuff gets blown up real good. The luscious Lydie Denier displays some delectable bare skin. The stellar cast of familiar faces rates as the yummy cherry on an already tasty craptastic cake: L.Q. Jones, R.G. Armstrong, Thalmus Rasulala, Mills Watson, Big Bill Smith (grumbling in Russian), Luke Askew, Rene Enriquez, Lincoln Kilpatrick, Juan Fernandez, and even Danny Trejo in a small role. A total tacky hoot.",
         "What an incomprehensible mess of a movie. Something about a cop who extracts bullets from himself after he gets shot and keeps them in a glass jar in his bathroom (and from the size of the jar he's been shot about fifty times by now) and a top secret tank guarded by five or six incompetent soldiers who for some reason drive it into Mexico. Whether they were sent there intentionally or just got really really lost is never made clear. And you'll never hear another screenplay feature the word \"butthorn\" either. Gary Busey tries out the Mel Gibson role from \"Lethal Weapon\" and while Busey is a serviceable actor the screenplay damns the whole movie to mediocrity. William Smith does another turn as a Russian soldier, the same character he played in \"Red Dawn\" a few years earlier. After playing biker heavies for most of the 70s it was sort of nice to see him expand his range playing Communist heavies. Sadly he'll probably always be remembered best as the guy who Clint Eastwood whupped in \"Every Which Way You Can.\"",
         "There is only one use for a film such as Bulletproof: it reminds you just how bad bad can be. We often see films which we describe as \"pretty awful\" or \"not much good\", but then you come across a film like this and you can see that although all those other films aren't \"good\" they are no way as stinkingly bad as Bulletproof. This was a birthday gift from someone who spent less than two seconds rummaging thru' the DVD bargain bin at our local superstore to fulfil an obligation (i.e. to give me a present). It could have been a serendipitous find but it wasn't: this is so utterly clichéd, so badly written, so poorly directed, so badly acted that I'm surprised everyone involved hasn't been arrested and sent down for 10 years. God, it's awful. I suspected as much from about 30 seconds in, but carried on because sometimes - sometimes - bad films are so bad they can be enjoyable. This isn't one of them. It is simply bad. I stopped watching after 45 minutes, and tomorrow I shall throw it in the bin.",
         "Its no surprise that Busey later developed a tumor in his sinus cavity, this film is also a poor decision, but one I enjoyed fully. The first 5 minutes is the most uninspiring 5 minutes in any film; boring, bad dialouge, and then, with a Spiderman stance, Busey yells the best-worst line in any film ever created...\"your worst nightmare butthorn!\" I coughed up some of my egg nog laughing so hard. That line resonates so well, it even tops Clooney's infamous \"hi Freeze, I'm Batman\" line. Other classic moments is Busey constantly getting upset for people reminding him that he got his ex-CIA partner killed...which he did by accidentally shooting him in the chest (all made possible by a super slow-motion flashback sequence that makes watching paint dry seem exciting). There's an ashtray to the nads, punches to the face, and a \"that wasn't my fault and you know it!\" Well, the footage shows him missing the bad guy and hitting his buddy, so... Other scream out-loud moments has to be his ex girl-friend dropping a grenade to the ground to enable his escape--a plan that defies all logic, physics, and absurdity. And lastly, when McBain jumps out of the Thunderblast during intense guerrilla warfare and starts to run and hurdles a small object, I almost wet myself. Some of Busey's best work by far, rent or buy it today \"butthorn!\" My vote is a perfect 10 (on the poo meter that is).",
         "This film may be full of plot holes, and it may be cheesy, but as an 80s action flick, it sure is entertaining. First, you have Gary Busey, fresh from his role as Joshua on Lethal Weapon. A one-man army (Can you say Rambo?), he manages to avoid the fire of numerous machine guns and win with his six shooter. He even faces a Russian General in one of those big bad helicopters that Rambo faced in Rambo II. Also featuring Henry Silva, a man I love to hate in a movie. But, the best of all, Danny Trejo. I would watch him paint a room. Too bad he doesn't last long. Also featured was Lydie Denier, winner of a \"Miss Legs International\" pageant, but we didn't get to see those legs in her bathtub scene. We had to settle for the top half of Lydie. But, not to worry, she shows them later. Bulletproof (Busey) heads to Mexico to rescue a prototype tank with the help of the last woman that wants to see him - Devon (Darlanne Fluegel). Of course, they make up. They whip the terrorists, the Mexicans, and the Russians. All in a day's work.",
         "Well, the one thing this movie got right was this: if you're going to have annoying characters, you should cast annoying actors. In fact, if casting annoying actors in the roles of annoying characters was a science, this film perfected it. Sure, it's happened in other films, but this one sets the standard to a record breaking low. Gary Busey as an action hero? Seriously? I don't think he'd even be believable as an extra walking down the street in the background. Yet they give him the lead role. And Henry Silva as the mean Colonel helps kicks it down another notch, putting the believability somewhere below a Sid and Marty Krofft \"made for TV\" variety show. Just watching 60 seconds of Busey trying to act is unbearable. Even worse, Busey trying to actually pull off the role as an indestructible action hero\u0085 that plays the saxophone? Then throw in Henry Silva? Were they trying to induce vomiting? As unbelievable as it is, the storyline is even worse than the acting and casting. It's as if somebody was rummaging through the dumpster behind the set of The Six Million Dollar Man and found a script that the producer rejected, wiped his butt with and threw in the trash.",
         "Take \"Rambo,\" mix in some \"Miami Vice,\" slice the budget about 80%, and you've got something that a few ten-year-old boys could come up with if they have a big enough backyard & too much access to \"Penthouse.\" Cop and ex-commando McBain (Busey, and with a name like McBain, you know he's as gritty as they come) is recruited to retrieve an American supertank that has been stolen & hidden in Mexico. Captured with the tank were hardbitten Sgt. Major O'Rourke (Jones) & McBain's former love Devon (Fluegel), the officer in command & now meat for the depraved terrorists/spies/drug peddlers, who have no sense of decency, blah, blah, blah. For an action movie with depraved sex, there's a dearth of action and not much sex. The running joke is that McBain gets shot all the time & survives, keeping the bullets as souvenirs. Apparently the writers didn't see \"The Magnificent Seven\" (\"The man for us is the one who GAVE him that face\"), nor thought to give McBain even a pretense of intelligence. Even for a budget actioner, the production values are poor, with distant shots during dialog and very little movement. The main prop, the tank, is silly enough for an Ed Wood production. Fluegel, who might have been a blonde Julia Roberts (she had a far bigger role in \"Crime Story\" than Julia!) has to go from simpering to frightened to butt-kicking & back again on an instant's notice. Jones, who's been in an amazing array of films, pretty much hits bottom right here. Both he & Busey were probably just out for some easy money & a couple of laughs. Look for talented, future character actor Danny Trejo (\"Heat,\" \"Once Upon a Time in Mexico\") in a stereotyped, menacing bit part. Much too dull even for a guilty pleasure, \"Bulletproof\" is still noisy enough to play when you leave your house but want people to think there's someone home.",
         "What happens when an army of wetbacks, towelheads, and Godless Eastern European commies gather their forces south of the border? Gary Busey kicks their butts, of course. Another laughable example of Reagan-era cultural fallout, Bulletproof wastes a decent supporting cast headed by L Q Jones and Thalmus Rasulala."
      ],
      "genres": ["Action"],
      "productionCompanies": [
         "Cinetel Films",
         "Bulletproof Productions"
      ],
      "summaries": [
         "A group of dangerous terrorists succeeds to get hold of a tank of the army and all its crew.",
         "Frank McBain is a big city cop with a habit of surviving getting shot in the line of duty over a dozen times. He earns the moniker \"Bulletproof\". When a super-secret ultra-comfortable prototype Tank is hijacked by Guerillas on the Mexican border, McBain is sent by the government to retrieve it. Not only does his girlfriend happen to be the commander in charge of the mission, but the terrorists turn out to be a multi-national invasion force with Mexicans, Nicaraguans, Cubans, Libyans, and Soviets all teamed up to destroy America with the help of their new tank."
      ],
      "budget": 5000000
   },
   "movielensId": 136558,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-04-20",
      "dvdReleaseDate": null,
      "directors": ["Steve Carver"],
      "runtime": 94,
      "movieId": 136558,
      "title": "Bulletproof",
      "mpaa": "R",
      "actors": [
         "Gary Busey",
         "Darlanne Fluegel",
         "Henry Silva",
         "Thalmus Rasulala",
         "L.Q. Jones",
         "René Enríquez",
         "Mills Watson",
         "James Andronica",
         "R.G. Armstrong",
         "William Smith",
         "Luke Askew",
         "Lincoln Kilpatrick",
         "Lydie Denier",
         "Danny Trejo"
      ],
      "imdbMovieId": "0094813",
      "originalTitle": "Bulletproof",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A group of dangerous terrorists succeeds to get hold of a tank of the army and all its crew.",
      "tmdbMovieId": 87533,
      "avgRating": 1.875,
      "releaseYear": "1988",
      "numRatings": 4,
      "posterPath": "/k9R4eKazL1zNgfHe2UGDD7BPast.jpg"
   }
}