{
   "tmdb": {
      "original_language": "pl",
      "keywords": [],
      "imdb_id": "tt0167464",
      "video": false,
      "title": "Tramway",
      "recommendations": [
         246971,
         49097,
         145337,
         146362,
         147018,
         145758,
         119024,
         118509,
         104294,
         120275,
         90909,
         144674,
         190081,
         174298,
         147419,
         49100,
         147493,
         147491,
         147553,
         94513
      ],
      "backdrop_path": "/iBQXsS1qVy6qqzFW2jPRfWIJ5mw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Girl",
               "gender": 0,
               "credit_id": "5662db529251412ad9003b9c",
               "name": "Maria Janiec",
               "profile_path": null,
               "id": 1545061,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Boy",
               "gender": 0,
               "credit_id": "5662db58c3a3682bd0003705",
               "name": "Jerzy Braszka",
               "profile_path": null,
               "id": 1138666,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a89d",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4786c3a36847f813a8a3",
               "name": "Krzysztof Kieślowski",
               "profile_path": "/aNvobc9gzJWIiHLNHx08tpmb5n1.jpg",
               "id": 1126,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5662db48c3a3682bef0040dd",
               "name": "Zdzislaw Kaczmarek",
               "profile_path": null,
               "id": 1487192,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.977966,
      "production_countries": [{
         "iso_3166_1": "PL",
         "name": "Poland"
      }],
      "id": 49112,
      "vote_count": 11,
      "budget": 0,
      "overview": "A boy shyly watches a girl on a tram. Only when he exits the tram, and its too late, does he realize that he must meet her.",
      "similar": [
         21385,
         155,
         568,
         19,
         49026,
         157336,
         597,
         363676,
         74643,
         37724,
         10527,
         140607,
         240832,
         52520,
         68726,
         158852,
         101299,
         91314,
         87421,
         75612
      ],
      "original_title": "Tramwaj",
      "runtime": 5,
      "poster_path": "/515JXqPw1RSBDlwsnUAf9ozTp1i.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Lodz Film School",
         "id": 69328,
         "origin_country": ""
      }],
      "release_date": "1966-01-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "Poland",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Krzysztof Kieslowski"],
      "runtime": 5,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0167464/",
      "coverLink": null,
      "actors": [
         "Maria Janiec",
         "Jerzy Braszka"
      ],
      "reviews": [
         "One of the first, if not the first, assignment in film school, is to make a silent film. Kieslowski has wisely limited his film to two characters and one location - a tram in the middle of the night- a boy- a girl- exchanged glances bespeaking of longings and loneliness and shyness. It is a clever and simple way of satisfying the assignment. The most interesting element is the way the boy chases the tram at the beginning, barely making it. The girl is on the tram suggesting the situation of the later masterpiece Blind Chance, except here, instead of the three alternative futures, each more bleak than the other, the young and still optimistic Kieslowski seems to give love and life a second chance to overcome fate or human weakness. The peculiar route of the tram at the end, looping back on itself, may be located at an end of the line turn around, but, being night, only the illumination from the tram can be seen as if playing a very strange game with the boy who takes up the chase after being given a second chance. It might be unfair, but it suggests, in a third hand, third eye kind of way, the overwhelmingly classic tram scene in Murnau's Sunrise",
         "Kieslowski, who would go on to become one of the most famous of all European directors, made this as a student film. The story is simple and is a variation on a theme which has been repeated many times before and since - boy meets girl, boy loses girl, boy tries to get girl back. Where it is notable is (characteristically of Kieslowski) its attention to detail and sense of place. As it is silent, it lacks Kieslowski's use of music to set mood, which can be seen in another, roughly contemporary, student short, \"The Face\". This short is available on the DVD of \"White\", and the two movies are interesting to contrast with each other. Both are concerned with romance, but in the short running time of \"The Tram\" Kieslowski could not, or would not, offer any neat answers . . . the final image is the young man running, chasing his love interest, leaving us unsure whether he has a chance of catching her, much less what might take place when he does. Both \"The Tram\" and \"White\", then, play on the fear of realizing your love for a partner just as that partner has left your life.",
         "One of Krzysztof Kieslowski's earliest experiments was this precious little film called \"The Tram\" which involves a shy boy (Jerzy Braszka) thinking he's in love with a pretty girl (Maria Janiec) while inside of a tram. The night wasn't promising while he was in this party but it seems now that this special girl is all charming and so into him, things might be different. No one else is standing on their way, they both enjoy the presence of each other but when the boy reaches his destiny...(sigh). I'll stop right here. Employing a silent film mode to its brief telling, Kieslowski gives us an amusing and nice story in five minutes, and almost like a preview of what he would do in future works, already showing his excellent filmmaking skills. I was reminded of \"Blind Chance\", a work of art he made in the 1980's about a man experience a series of \"what if's\" in his life with three long segments presenting this man's life and one decisive act (doing or not doing) that altered his life course. The inconclusive ending of \"The Tram\" is exactly that movie: Will he enter the tram and try to win the girl? Will he manage to go back? Will his expectations be fulfilled? That's art, right there. Not in the answer but in the haunting question that can be answered or not. Will you dare yourself to see what's coming next? In this movie case, don't stop and falter. Go along! Kieslowski's short is a great filmed piece, economical, brilliantly filmed and greatly acted by its two main stars, specially Braszka, the boy. A pleasant face but not the kind one would think as a ladies man who knows it all. To me he looked like a mix between Anthony Perkins and Sergey Bodrov Jr., cute but clumsy and with a bit of mysterious - perhaps that's the thing that one must reason why the girl wouldn't try anything with him. But the nice guy characteristic is present in him, evidenced in the hilarious sugar cube chewing sequence, you don't know if he needed to do that or it was his way to impress the girl. Above all, the main reason why this movie succeeds is because of a real fact, I definitely think, that a majority of people has gone through: seeing that special person that warms you heart, pleases your eyes and senses, to the point where you feel the need of trying something, a small talk, some flirting, the longest possible amount of contact. Due to obvious reasons, this \"conection\" nowadays most of the time can be viewed as stalking, obsession or territory to dangerous acts. Kieslowski's film is a register of a different time where innocence still reigns in the world. Once again, the magic of movies is transported to the screen, reflecting and echoing with grace in our lives. 9/10",
         "Every movie director starts somewhere, for Krzysztof Kieslowski, \"Tramway\", or \"The Tram\", was made as a film student in Lodz, Poland. It's the silent story of a flirtatious young man and a pretty girl, unknown to each other, and riding to each of their own destinations via a commuter train. Only five minutes long, it's neither great nor terrible, but a beginner's work that shows promise of what the director would achieve in his relatively short life. At first, the young boy (Jerzy Braszka) almost takes on the guise of a stalker as he eyes the pretty young woman (Maria Janiec) sitting nearby. Eventually she returns his gaze with a smile, but already near his stop, the boy gets off the train, thinks better of it, and tries to signal the girl inside. Failing to get her attention, and realizing his mistake in not approaching her, the young man takes after the tram in a chase on foot. The short ends with some ambiguity, which seems to be a hallmark of Kieslowski's future projects, thereby leaving the viewer to provide one's own interpretation as to the outcome of the boy's fixation.",
         "These are probably the two core points from the 1966 short film \"Tramwaj\" or \"Tramway\" written and directed by the late Polish filmmaker Krzysztof Kieslowski. This film is from very much the beginning of his career still, but even for a rookie work, I can see hardly anything appealing in here. The problem may be the direction this time as the script and acting is not bad per se. Once again, like other early works by Kieslowski, it feels a lot like a documentary to me. It only runs for 5 minutes and is in black-and-white and it is obvious Kieslowski was still finding his style and approach to film back then. By the way, this little movie has its 50th anniversary this year. But this should not be a reason to watch it and I cannot really see any other reasons either. Thumbs down."
      ],
      "genres": [
         "Short",
         "Drama"
      ],
      "productionCompanies": ["Lodz Film School"],
      "summaries": [
         "A silent film. On a winter night, a young man stands apart at a club while others dance. He leaves, running to catch a tram. He notices a young woman sitting by herself. They make eye contact. He watches her as she looks away. He busies himself and chews a sugar cube; she smiles, then closes her eyes. He wonders what to do. He reaches his stop. Has he missed a life-changing chance?",
         "A boy shyly watches a girl on a tram. Only when he exits the tram, and its too late, does he realize that he must meet her."
      ],
      "budget": 0
   },
   "movielensId": 136616,
   "movielens": {
      "languages": [""],
      "releaseDate": "1966-01-01",
      "dvdReleaseDate": null,
      "directors": ["Krzysztof Kieślowski"],
      "runtime": 5,
      "movieId": 136616,
      "title": "Tramway",
      "mpaa": null,
      "actors": [
         "Maria Janiec",
         "Jerzy Braszka"
      ],
      "imdbMovieId": "0167464",
      "originalTitle": "Tramwaj",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["hovMRWNSOCw"],
      "plotSummary": "A boy shyly watches a girl on a tram. Only when he exits the tram, and its too late, does he realize that he must meet her.",
      "tmdbMovieId": 49112,
      "avgRating": 3.33333,
      "releaseYear": "1966",
      "numRatings": 3,
      "posterPath": "/515JXqPw1RSBDlwsnUAf9ozTp1i.jpg"
   }
}