{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt2937254",
      "video": false,
      "title": "Balls Out",
      "recommendations": [
         32343,
         19604,
         61016,
         44181,
         55066,
         39163,
         338107,
         53335,
         45020,
         72231,
         15651,
         292834,
         18173,
         244801,
         56767,
         331780,
         15285,
         71945,
         19723,
         42217
      ],
      "backdrop_path": "/9X3j9awAcNykWnpU9hu4EweJLBE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Caleb",
               "gender": 2,
               "credit_id": "5345727d0e0a267bd1001d74",
               "name": "Jake Lacy",
               "profile_path": "/qU6n9EaesBGqhNLlj5BecUrb5LW.jpg",
               "id": 496470,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Meredith",
               "gender": 1,
               "credit_id": "534572850e0a267bc6001dd5",
               "name": "Nikki Reed",
               "profile_path": "/e0O5w9eajC4qWl2FYVL2XFaMrS2.jpg",
               "id": 59252,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Vicky",
               "gender": 1,
               "credit_id": "5345728e0e0a267bc6001dd7",
               "name": "Kate McKinnon",
               "profile_path": "/jzgiKHmkhxhvELnq9ccDkFc8Ynn.jpg",
               "id": 1240487,
               "order": 2
            },
            {
               "cast_id": 24,
               "character": "Dick",
               "gender": 2,
               "credit_id": "5675502ec3a368168000276c",
               "name": "Beck Bennett",
               "profile_path": "/oblaqelpyBvtB5GaSgQpDrfka9M.jpg",
               "id": 1180696,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Grant",
               "gender": 0,
               "credit_id": "534572a20e0a267bd7001e52",
               "name": "Nick Kocher",
               "profile_path": null,
               "id": 132311,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Chance",
               "gender": 2,
               "credit_id": "534572ad0e0a267bc6001dd9",
               "name": "Brian McElhaney",
               "profile_path": "/nkv0u13BeLNl3oaV3SPXMySNjOd.jpg",
               "id": 132310,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Vinnie",
               "gender": 2,
               "credit_id": "534572b80e0a267bd4001ee5",
               "name": "Gabriel Luna",
               "profile_path": "/gXCHO4NtCd7cnAiVXbz4drekgq5.jpg",
               "id": 111016,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "George",
               "gender": 2,
               "credit_id": "534572cd0e0a267bd1001d7b",
               "name": "Will Elliott",
               "profile_path": null,
               "id": 1049925,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Ace",
               "gender": 0,
               "credit_id": "534572d80e0a267bd4001eea",
               "name": "Kirk C. Johnson",
               "profile_path": "/i5dk3FqsGGUznsQGppuNwZ8pleD.jpg",
               "id": 1049928,
               "order": 8
            },
            {
               "cast_id": 9,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "534572e20e0a267bc6001ddd",
               "name": "Sam Eidson",
               "profile_path": "/kHVBJSQOzZ1KLDuRZWdLWzd8Wxz.jpg",
               "id": 1155590,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Rafa",
               "gender": 2,
               "credit_id": "54466b3ec3a3683e0500acab",
               "name": "Billy Blair",
               "profile_path": "/7DI7VBgFjRA0AnrV9jEFt3GfwgE.jpg",
               "id": 968889,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "534572f30e0a267bc3001dbc",
               "name": "Andrew Disney",
               "profile_path": null,
               "id": 1085513,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "534572fe0e0a267bd7001e57",
               "name": "Bradley Jackson",
               "profile_path": null,
               "id": 1205951,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "554221e39251413d6d00388f",
               "name": "Russell Wayne Groves",
               "profile_path": null,
               "id": 1049931,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55422201c3a36839d90018d3",
               "name": "Bradley Jackson",
               "profile_path": null,
               "id": 1205951,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55422232c3a3681da0003be8",
               "name": "Andrew Shinjang Lee",
               "profile_path": null,
               "id": 1461130,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55422247c3a3682a74003616",
               "name": "Red Sanders",
               "profile_path": null,
               "id": 1065122,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55422264c3a36839d90018e5",
               "name": "David James Ward",
               "profile_path": null,
               "id": 1358938,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "554222769251414aee003cf2",
               "name": "Nancy Nayor",
               "profile_path": "/43LHN7kjcpvsSBBoshm4C1GUouP.jpg",
               "id": 13585,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5542228a9251414aee003cf5",
               "name": "Lindsey Weissmueller",
               "profile_path": null,
               "id": 1190100,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "554222a2c3a3681da0003bfc",
               "name": "Alice Wood",
               "profile_path": null,
               "id": 1085522,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "554222bd9251414aee003cfc",
               "name": "Jeffrey Waldron",
               "profile_path": null,
               "id": 1085524,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "554222d7c3a3681d98003d0a",
               "name": "Kody Gibson",
               "profile_path": null,
               "id": 1461132,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55422331c3a36877ee0037a1",
               "name": "Brett Hamann",
               "profile_path": null,
               "id": 1386329,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 2.384096,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 263913,
      "vote_count": 19,
      "budget": 0,
      "overview": "With marriage, graduation, and the real world looming on the horizon, fifth year senior Caleb Fuller reassembles the ol' team of misfits for one last epic run in Intramural football.",
      "similar": [],
      "original_title": "Balls Out",
      "runtime": 100,
      "poster_path": "/2aOHMBYHvURCfQ0cnDNGW1ZYKUM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Red Productions",
            "id": 52394,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ralph Smyth Entertainment",
            "id": 52393,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Raindance Entertainment",
            "id": 23607,
            "origin_country": ""
         }
      ],
      "release_date": "2014-04-19",
      "vote_average": 4.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Andrew Disney"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Bradley Jackson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2937254/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BNTk5ODI5MzM0N15BMl5BanBnXkFtZTgwMjM5NzA3NTE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jake Lacy",
         "Nikki Reed",
         "Kate McKinnon"
      ],
      "reviews": [
         "I stuck with it the whole way and like many of the cast already from their other endeavors (primarily SNL). This one simply fails to evolve into anything more than a few chuckles and yuks here and there. The announcers added some good lines and the lead is likable. The pep/anti-pep talk was also a good joke. Technically speaking, the film is very good. It was shot well, editing and so forth are nicely executed. My summary is that it is too weak for a five, but I didn't hate it either. You most assuredly should not pay to see this movie. Free...okay, but at the end, I can only give it a 4 of 10.",
         "I first saw this movie rated here at a 7.7 and another rating site had 79%. The actors are C list and was probably shot in 2 days with a high school budget. I watched this movie for 30 minutes, which was 26 minutes too long. I was just waiting for it to be funny, interesting, or in any way entertaining. I'm not one of those raters who rate comedies against the likes of Shawshank Redemption. I even like stupid comedies if there is some effort put in or actual humor involved. It's kind of annoying that this movie ever showed up on my screen which led me to write this review. I will be shocked if the rating is above a 3 after a week. It was released yesterday straight to DVD for a reason. Don't waste your time and certainly don't waste your money!",
         "I have always been a big fan of sports comedy. This one is an instant classic. Kate McKinnon will be a 20-30 million dollar actress someday, she is absolutely amazing in this film. The other cast members are great also. Beck Bennett was made for the \"bad\" guy role and Jake Lacy pulls it all together with the nice guy just trying to get through life thing he has going on in this film. Plenty of laugh out loud humor. I watched this movie when it was called \"Intramural\" at Tribeca Film Festival and now I have seen it as the re-branded \"Balls Out\", it is the same film. Highly recommended. If you like movies like \"Dodge Ball\" then you will love \"Balls Out\". Thanks for making something different and fun!",
         "Ignore the title and poster art for Balls Out. It's not a National Lampoon presents type of \"movie\". Once you've decided not to judge a movie by it's poster, sit back and enjoy a surprisingly witty, slapstick, sports movie that has an unbelievable cast. Balls Out has several SNL cast members (Jay Pharoh, Beck Bennett,Kate McKinnon) and some Youtube/Comedy Troop stars that fill out the roles. The biggest names are Jake Lacy (Obvious Child) and Nikki Reed (Twilight series) who are the focal point of the movie. What makes Balls Out different is it's supporting cast. It's the kind of film where the supporting cast steals the show and you end up liking them a lot more than the aforementioned actors. Without a doubt, Beck Bennett is worth seeing this movie alone. He's like Stan Gable from Revenge of the Nerds turned up to 11. Kate McKinnon has very few scenes, but she steals every single one of them. In a few years, people will look back at this movie and wonder how in the hell they got all of these stars in one movie. There are some great scenes and hilarious moments that come from out of nowhere. The dick and fart jokes are few but they land; a refreshing style of comedy from an indie film. My only beef with \"Balls Out\" is Jake Lacy and Nikki Reed. They're pretty to look at and void of charisma. Jake may have played his role a little too straight in a movie of outrageous characters. Other than that, this movie is a MUST SEE. You can sound cool and say you this before \"fill in the blank actor/actress\" got super famous. Stop reading and watch it already!!!!!!",
         "Director Andrew Disney gained many fans back in 2011 with his comedic/mystery film Searching for Sonny. At this year's Tribeca Film Festival, the young director returned with the hilarious and original college film Intramural. Starring Jake Lacy, Nikki Reed, and a slew of current \"Saturday Night Live\" cast members that include Beck Bennett, Jay Pharoah, and Kate McKinnon, the independent film knows exactly what it is. There's no pretending to be anything more than an uproarious chuckle-fest at the movies. Intramural tells the story of Caleb (Lacy), a fifth year senior that gathers the courage to return to the intramural games at school following a tragic accident of one of his classmates. As probable marriage, graduate school, and life close in on him, comedic antics engulf the viewer in a non-stop riot. Written by Bradley Jackson, who's penned previous independent efforts like Lord Montagu, all the jokes utilized in film mostly land. Of the cast, Beck Bennett and Kate McKinnon steal the show in every scene, as they tend to do on \"Saturday Night Live.\" Bennett, playing one of the funniest and sociopathic villains in quite some time, is the best of the cast. His gifts and timing are spot on. The biggest chuckles of the film come from him. McKinnon fires on all cylinders, giving her all as she does every Saturday night. I was under her spell the whole time. Intramural is the best obscure sports film of its kind since Dodgeball: A True Underdog Story. Part \"Old School\" and part \"Happy Gilmore,\" the film takes you completely by surprise by how easy-going and enjoyable the entire film is. Though the film relies heavily on slapstick humor, which works in parts, I would have liked some more of the infectious and quotable dialogue that Jackson created. A scene that includes the line \"you got to sh*t on the ceiling\" will likely stay with me all year, and perhaps the rest of my life. It's great to see star Nikki Reed venturing out to new realms of her acting career. Once very promising in 2003′s Thirteen, Reed got hooked into the \"Twilight\" franchise before marrying (and now divorcing) \"American Idol\" alum Paul McDonald, the 25-year-old actress has a lot more to deliver the world of cinema. Star Jake Lacy helms the film à la Chris Evans in Not Another Teen Movie. An admiral effort but what's going on around him is much more interesting, and funny. I'm curious to see what the star can do in other vehicles in the future (he'll have a role in Todd Haynes' upcoming Carol). The other supporting players put some of their best comedic ticks to good use, particularly Nick Kocher, a promising up and comer who may become a household name in years time. The entire ensemble is a terrific treat that will go down as one of the strongest of independent cinema in 2014. Overall, Intramural is a successful hybrid of young adult comedy. A pure and modern example of slapstick comedy and where it can go, when placed in the right hands. Had me thinking fondly of last year's breakout comedy G.B.F. (currently on Netflix), another happy time at the Tribeca Film Festival.",
         "So this is how i watched the movie ,, first 30 minutes i started texting ,, second 30 minutes fast-forwarding and last 30 minutes i really can't remember .. The story is kinda lame ,, the jokes aren't funny and so motionless,, and the script is so loose, not that catchy and all over the place, so you can eat, do an errand come back and it'll be the same old story of the movie and you're not gonna be that lost :P I tried to find a scene where i can justify the Genre of the movie as a Comedy but i found none ,, well to be fair there was this scene when they started a fight in the Jail ,, honestly i weirdly laughed at that , and the commentators were also a bit funny and humorous ., but again the whole movie wasn't really what i expected it to be as a Saturday Night Live fan :\\ As for the cast; mostly they were the SNL cast and i truly like them and all ,, but Here it feels like they overdid the stupidity performance a notch so it appeared to be a Bluccchhh .. Overall,, i don't regret watching the movie , cuz i sorta wanted to see how the new SNL cast will do out of the SNL set and i did. but i shouldn't recommend it to anyone, unless you like the type of movies where you can pause it, go to sleep and then watch it the next day if you have time :\\",
         "Caleb played by Jake Lacy from the final season of The Office television series is a senior preparing to graduate from college. He is in his fifth year and has already been in college for too long. But he doesn't quite want to leave yet. He sees the \"concrete wall\" of commitment laid out in front of him and gets scared. He runs away from this iron cage of commitment and responsibility by forming an intramural football team as an escape. The group that he forms can best be summed up by the advice they give each other on how to get with freshman girls in college. You have to remember:, \"A little knock knock, welcome to class\u0085tap that ass\". The jokes throughout the movie are very intelligent and many are easily missed. But the movie is clearly geared towards men. There is one quip about Uday Hussein being a Quaker that was particularly heinous. During a team meeting a member of the team asks, \"What's more dangerous, a man with no fear or a man with nothing to lose?\". Caleb turns the question on its head with, \"What about a man who's not afraid of losing?\". \"Balls Out\" is the rare comedy that is both funny and self-aware. The film is chock full of hilarious moments like during another team meeting when the adopted mentor of the team teaches, \"There is a classic structure to all underdog sports movies. Rocky, Hosiers, Air Buds 1,2, 3 and 5\". One teammate interrupts, \"What about Air Bud 4?\". \"A dog playing baseball? Are you insane?\". Watch this movie if looking for a few laughs. It is sure to deliver. As the stoner commentator narrates at the end of the film, \"In my nine and a half years of college, I thought I'd seen it all. I witnessed a 2,000 cup game of beer pong that claimed the lives of seven bros. I've seen Frisbee so ultimate, it threatened the supremacy of God himself. I've even seen my colleague Dan here swallow two keys of pure Bolivian heroin to make good on a series of increasingly misguided cockfighting bets. But I never thought I'd witness such an amazing game of intramural football\".",
         "The theatrical poster for Balls Out (also known as Intramural and another film that can't maintain consistency of what it should be called on a variety of different film websites) reminds me of the DVD covers of a direct-to-DVD National Lampoon film or a throwaway sex comedy one can find by lazily searching Netflix's streaming selection. Its boisterous display of the backside of a cheerleader in uniform, complete with a football reading the film's title is perplexing because it seems that MGM and Orion Pictures is marketing a totally different film here. After seeing the festival circuit success of a film like They Came Together, a film that was hellbent on calling out the clichés of romantic comedies, did these two immensely successful studios really think a film about parodying sports clichés couldn't succeed? It's no real bother because the more under-the-radar Balls Out stays, the better. This is one of the many desperately unfunny comedies I've seen this year, almost down there with Joe Dirt 2: Beautiful Loser and Mortdecai in the way these films seem to cloyingly pine for laughs by throwing their main character into any circumstance so long as it's allegedly funny. Balls Out, a film centered around a gaggle of misfit football players in college whom reunite their ragtag, intramural football team years after an injured teammate caused them to disband, is a film that sets itself up to fail right from the get-go. It's a film that tries to emphasize the stupidity, incredulity, and sheer brainlessness of a plethora of underdog sports films, but instead of going a separate way and rising above the clichés, Balls Out finds it funny to simply play by them in a loud and obvious manner. By the end, I had one question for director Andrew Disney and writer Bradley Jackson - what did you accomplish with this particular film? You didn't prove yourself better than the sports films you were lampooning, you just dumbed your film down to their level by positioning this film as the answer to all the clichés and predictabilities of a genre. Where They Came Together had the chemistry of Paul Rudd and Amy Poehler at its core, constantly emphasizing their quick-witted nature and their plethora of zingers, Balls Out pathetically orchestrates one tired situation after another that involves the group of collegians yelling, screaming, and slamming one another to the ground in an entirely witless fashion. Laughing at the fact these imbeciles take intramural sports so seriously grows grating, especially when the memories of gym class from school-years gone past begin to surface, where all the torment and humiliation came into play. At its core, however, Balls Out is simply not funny. Like its characters, it tries so hard to make us laugh by persistently nudging us, the audience, positioning itself to be wiser and more humorous than the film it's parodying, when it finds a way to be much lower than those films simply because it fails at its ultimate goal of being a successful comedy. This is also the case of a film that maybe could've made a successful two to three minute skit on Saturday Night Live (apparently this film stars members of comedy groups like that, Derrick Comedy, BriTANicK, and Good Neighbor, although I presume a lot of their talent got lost in translation); it certainly makes a nearly insufferable one-hundred minutes. Starring: Jake Lacy, Beck Bennett, Jay Pharoah, Nikki Reed, and Kate McKinnon. Directed by: Andrew Disney.",
         "Small-town college student has to choose between ambition and passion. Iron rule of movie selection: always ignore the hot piece of ass on the cover. A few chuckles from this, but when I checked the time there were still 60 mins to go. Fcuk me. In one scene a guy in a wheelchair delivers a sarcastic slow hand-clap, but keeps interrupting himself to roll the wheelchair forward - funny idea, but zero reaction from me. Plenty of parody of feel-good sports movies, channelling The Mean Machine with a touch of Ben Stiller. Actors, direction, jokes, editing all good - enough for a laugh-a-minute, but for all that input it just doesn't click. How does a movie die on screen? I dunno - the mystery of comedy. I guess it comes down to the spirit of the thing, and the tongue-in-ass mockery of macho culture comes across as smug. There was a hint of the pointlessness of college education, but they didn't go for the political slant. Ignore the external reviews - this sadly is a fail.",
         "The film is a spoof of sports films. It centers on inter-mural flag football teams. It gives us the initial game and then goes to five years later as they get back the team. The main character is Caleb (Jake Lacy). he is engaged to a woman he doesn't love and then meets the love of his life, the twin sister of a despicable person on the other team. The film is filled with the inane and cliches and near the midpoint, the plot is explained on the board in generic sports film terms. The humor is basically low brow and crude, but not bottom feeders in this regard. There are no f-bombs, sex, or nudity...except for maybe a brief locker room backside scene. The sports slogans get mixed and confused as I question if \"Rocky III\" may have been better than \"Rocky.\" Kate McKinnon was classic as the cringe worthy rich fiancee.",
         "Caleb Fuller (Jake Lacy) quits Intramural football after his receiver friend gets paralyzed getting kicked in the balls. Four years later, Vicky Albrecht (Kate McKinnon) asks him to marry her publicly at her birthday party after 5 and a half months of dating. He accidentally says yes. He encounters former mate Vinnie and reunites the old team Panthers together again. His nemesis Dick leads the Titans. Caleb falls for Dick's sister Meredith Downs (Nikki Reed). Comedy is easy to rate and hard to explain. I can't be absolutely sure. This is not outrageous enough. I barely cared about any of the characters and laughed even less. Everybody is trying to shine in a wacky character playoff. None of them are funny or the least likable. Jake Lucy as the straight man is lackluster. This is a comedy troupe B-team trying out their material and it's getting crickets. Despite the female butt shoot on the cover, there isn't any nudity humor. There is nothing overtly awful but it's simply not good. I blame Kickstarter."
      ],
      "genres": [
         "Comedy",
         "Sport"
      ],
      "productionCompanies": [
         "Ralph Smyth Entertainment",
         "Raindance Entertainment",
         "Red Entertainment"
      ],
      "summaries": ["With marriage, graduation, and the real world looming on the horizon, fifth year senior Caleb Fuller reassembles the ol' team of misfits for one last epic run in Intramural football."],
      "budget": 0
   },
   "movielensId": 136650,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2014-04-19",
      "dvdReleaseDate": null,
      "directors": ["Andrew Disney"],
      "runtime": 100,
      "movieId": 136650,
      "title": "Balls Out",
      "mpaa": "",
      "actors": [
         "Jake Lacy",
         "Nikki Reed",
         "Kate McKinnon",
         "Beck Bennett",
         "Nick Kocher",
         "Brian McElhaney",
         "Gabriel Luna",
         "Will Elliott",
         "Kirk C. Johnson",
         "Sam Eidson",
         "Billy Blair"
      ],
      "imdbMovieId": "2937254",
      "originalTitle": "Balls Out",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "With marriage, graduation, and the real world looming on the horizon, fifth year senior Caleb Fuller reassembles the ol' team of misfits for one last epic run in Intramural football.",
      "tmdbMovieId": 263913,
      "avgRating": 1.8,
      "releaseYear": "2014",
      "numRatings": 5,
      "posterPath": "/2aOHMBYHvURCfQ0cnDNGW1ZYKUM.jpg"
   }
}