{
   "tmdb": {
      "original_language": "mr",
      "keywords": [],
      "imdb_id": "tt3446426",
      "video": false,
      "title": "Time Pass",
      "recommendations": [],
      "backdrop_path": "/uSub9AwyUMPP4GOS7Eh1oD0gs9V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Dagadu",
               "gender": 0,
               "credit_id": "54eecf0bc3a36869e50030fa",
               "name": "Prathamesh Parab",
               "profile_path": "/calzfLCAWdTyoRi7ac9cf9jM4T.jpg",
               "id": 1431937,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Prajakta",
               "gender": 0,
               "credit_id": "54eecf12925141796800588a",
               "name": "Ketaki Mategaonkar",
               "profile_path": null,
               "id": 1191768,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Madhav Lele (Prajakta's father)",
               "gender": 2,
               "credit_id": "54eecf04925141795f0059f4",
               "name": "Vaibhav Mangle",
               "profile_path": null,
               "id": 1278983,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Anuja Lele (Prajakta's mother)",
               "gender": 0,
               "credit_id": "54eecf3f9251417961005789",
               "name": "Meghana Erande",
               "profile_path": null,
               "id": 1431938,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Appa (Dagadu's father)",
               "gender": 0,
               "credit_id": "54eecfa7925141796800589d",
               "name": "Bhalchandra Kadam",
               "profile_path": null,
               "id": 1431941,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54eece4692514179710057e1",
               "name": "Ravi Jadhav",
               "profile_path": null,
               "id": 1111643,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54eece62c3a3686d5e0051de",
               "name": "Ravi Jadhav",
               "profile_path": null,
               "id": 1111643,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54eecf699251417968005893",
               "name": "Nikhil Sane",
               "profile_path": null,
               "id": 1431939,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54eecf7bc3a36869e500310c",
               "name": "Vasudeo Rane",
               "profile_path": null,
               "id": 1431940,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.075436,
      "production_countries": [{
         "iso_3166_1": "IN",
         "name": "India"
      }],
      "id": 249677,
      "vote_count": 1,
      "budget": 200,
      "overview": "When Cupid strikes the very first time it sees no class or caste barrier. And though the path to reunite with a loved one seems arduous and almost impossible, it's this love which makes a person do good things. Love doesn't remain a Time Pass anymore.",
      "similar": [],
      "original_title": "Time Pass",
      "runtime": 143,
      "poster_path": "/izSvqDBCFZh4aH6nwKhcCdufeBZ.jpg",
      "spoken_languages": [{
         "name": "",
         "iso_639_1": "mr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Zee Talkies",
         "id": 47335,
         "origin_country": ""
      }],
      "release_date": "2014-01-03",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": "INR ",
      "directors": ["Ravi Jadhav"],
      "runtime": 143,
      "synopsis": null,
      "writers": ["Ravi Jadhav"],
      "originalLanguage": "Marathi",
      "imdbLink": "http://www.imdb.com/title/tt3446426/",
      "coverLink": null,
      "actors": [
         "Prathamesh Parab",
         "Ketaki Mategaonkar",
         "Vaibhav Mangale"
      ],
      "reviews": [
         "Teenage love and its many-layered emotions range from purity in thought to a brevity that's endearing. While its depth never ceases to amaze you, its craziness warms your heart. And the love story of paper-boy Dagdu (Prathamesh Parab) and college-going Prajakta (Ketaki Mategaonkar) is one that's has all these emotions. As you watch the movie unfold, as cynical adults you read the impossible nature of it all right away. But when you see the innocence of young love unfold on screen in a fun manner (watch the library scene for this), director Ravi Jadhav forces the adults to do a rethink on love, even as he compels the young ones to see reason in love, but without being preachy at all! What begins as a Time Pass for these youngsters can actually prove to be transforming and life changing. After Balak Palak, M-town can now boast of another teen film that is making the right noises. While most of the dialogues are catchy and humorous, everyone in the cast from Dagdu's friends, to Prajakta's parents to the lead actors - all have put in perfect acts. Prathamesh is a natural and while the most part of the film sees him in a rowdy mode, watch him excel in the Hum garib hai toh jya hua... scene and the last scene where he gets emotional. Ketaki as the simple teen too has done well to show how she's affected by the pehla pyar. Vaibhav Mangle as her strict dad is also terrific. Urmila Kanetkar makes a brief but warm appearance. All in all, Time Pass is worth a watch and kudos to Ravi Jadhav for taking a risk with relatively less known and young stars as his leads. Hearing at the ceetees and laughter in the theatre, it sure looks like it has paid off big time!",
         "A sparkling jewel from the director of Natrang and Balak Palak , both of which are gems in their own right. Ketaki M and Prathamesh P , the lead couple couldn't have been sweeter and the supporting cast were awesome too. Ketaki has already proved her metal in the movies like Kaksparsh and Shaala. Prathemesh already wowed audiences with his role in Balak-Palak. They have been given much more to chew on in this movie. More acting , more expressions, and more emoting. And they do excel in all departments. Looks like some class actors in the making. A couple of nice songs too in the album, nice enough to hum along ...... All in all a sweet dish just perfectly right for the new year !!!! Go watch it for the innocence it portrays ....",
         "1st of all A Ravi Jadhav Film; Name is Enough. Natrang, B.P.(Baalak Paalak), Bal Gandharv and Now T.P. He knows what people want to see. Leading girl Ketaki Mategaonkar \"Shala\" fame and the leading boy Prathmesh Parab B.P. fame as a couple. Well making an film on teenage love story is not easy but Ravi Jadhav and Team handled well. A story which is so simple that a Boy started loving a Girl which is been called Marriage Material by his friends. Everyone in making a film has handled it very smoothly that u will never get bored in 2.22 Hr movie. Cast wise one and every single person did tremendous acting. I Gave it 9/10 just because a climax was repeated and as expected.",
         "'Come\u0085relive your adolescence' should have been the tagline of the film Time Pass (2014) (aka TP). After Jo Jeeta Wohi Sikandar (1992) and Jaane Tu Ya Jaane Na (2008), Time Pass makes you relive your magical and special first love and is dedicated to everyone who has fallen in love at least once. TP is a story of a mischievous poor boy Dagdu (Prathamesh Parab) and a middle-class girl Prajakta Lele (Ketki Mategaonkar). Dagdu is a school dropout, who eventually decides to deliver newspapers. One day he is insulted by one of the residents Madhav Lele (Vaibhav Mangle). Dagdu decides to teach him a lesson. He decides to hit on his daughter Prajakta and woo her with the support of his friends. Prajakta is the quintessential girl next door, bound by the rules set by her father. Dagdu initially thinks of this as a pastime, but eventually is infatuated to her. Prajakta on the other hand initially ignores Dagdu, but she is attracted to his simple nature. She seeks freedom, a break from her father's militarised home environment. She is more than happy just to be with Dagdu. His innocence and straightforwardness make her fall for him Slowly, Dagdu becomes Prajakta's (or Paraju as he calls her) best friend and soulmate. And he slowly captures her heart and mind. It feels funny when Prajakta confesses her love in the most poetic way and Dagdu is unable to comprehend whether it is acceptance or rejection. It is said that when you fall in love, you begin to mirror each other. This is evident when Prajakta also speaks broken Marathi like Dagdu and shocks her parents. While still trying to understand whether this is a pastime or love, Dagdu and Prajakta fall head over heels for each other. This is highlighted in a scene in a library, where Dagdu and Prajakta try to convey their feelings silently to each other by picking up the right book titles, thus delivering the best scene in the movie. They try to hide their relationship from her dreaded father, but the cat is eventually out of the bag. They are too young to realise that love is just not enough to live life. A poor class Dagdu can never match to the standards of Prajakta's family which are rich in culture and has a higher degree of education and sophistication. Spruha, Prajakta's music teacher, convinces Dagdu that education is the only bridge that will make him traverse that gap. Also, the relationship between Spruha and Vallabh, Prajakta's elder brother is strained due to their father. And that he would never approve of their love relationship. Set in Thane, western India in the mid-80's when cultural and class differences were most prominent, and love relationships were still a taboo, Time Pass is a story that is closer to your heart, especially if you have lived your childhood in Mumbai, Thane and surrounding areas. The film also pays tribute to the yesteryear Hindi cinema when Dagdu and his friends refer to Prajakta's father as 'Shakaal' (of Shaan (1980) fame). Vallabh also passes a comment to Dagdu 'Since Tarzan (aka Adventures of Tarzan,1985) has released, everybody has started to flock the gym.\" Although Dagdu could have convinced Prajakta to run away with him, the motherless child still has in values in place. This is evident when Dagdu rides a bicycle for three days continuously to save his father's auto rickshaw, which was their only source of income and pawned to pay for Dagdu's tuition classes. The scenes where the parents hit their daughter are a bit confronting (again a glimpse of mid-80s), and could have been avoided. The climax comes at a point, on Prajakta's birthday, where both families are made aware that their children are dating each other. Prajakta's family calls Dagdu to rebuke him. He leaves promising that he will get out of Prajakta's life once and for all. The film ends with Dagdu meeting Prajakta for one last time and promising her that will gain his status through the path of education. This sets the premise for another heart warming roller coaster ride of young and innocent emotions - the part 2!. Prathamesh and Ketki are the most appropriate for their roles in the film. Vaibhav Mangle as Prajakta's father is convincing and menacing but lovable. Bhalchandra Kadam as Dagdu's dad gives a very compelling performance. Music by Chinar-Mahesh is fresh, mushy and soft. You want to hear the songs again and again. Screenplay and direction by Ravi Jadhav are top class. He took the risk of working with less known actors like Prathamesh Parab and Ketki Mategaonkar but gained solid multi-fold returns, which goes to show again that content it always king and why you should believe in fresh blood. Based on Shaiju Mathew's coming-of-age novel Knocked Up, Time Pass breaks away from the convention of a happy ending - the reason it is now a candidate for remakes. It is optioned to for remake in Telugu. Many Marathi movies have been remakes of Hindi films. It is now time for Hindi film industry to pick up these gems.",
         "before see this movie i think that not good movie when i saw the full movie then it is become my favorite movie it is that movie which i have not forget it is best movie for true lover and for first lovers please see this movie guaranteed you like this best movie Excellent before see this movie i think that not good movie when i saw the full movie then it is become my favorite movie it is that movie which i have not forget it is best movie for true lover and for first lovers please see this movie guaranteed you like this best movie Excellent before see this movie i think that not good movie when i saw the full movie then it is become my favorite movie it is that movie which i have not forget it is best movie for true lover and for first lovers please see this movie guaranteed you like this best movie Excellent before see this movie i think that not good movie when i saw the full movie then it is become my favorite movie it is that movie which i have not forget it is best movie for true lover and for first lovers please see this movie guaranteed you like this best movie Excellent",
         "I am eagerly waiting for this movie in US. It is one of the best movie in Marathi movie of all the time. Request you all my friends to go and watch this movie in theater. And I hope I would get to see it in Denver too. All the best to all of the members who worked very sincerely and very hard for this movie. Frankly speaking I am very excited to see this movie shown up on IMDb. It feels very good to have this on your site. Congrtas. Regards"
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": ["Zee Talkies"],
      "summaries": ["A mischievous teen wants to teach a lesson to a man by making his daughter his girlfriend."],
      "budget": 20000000
   },
   "movielensId": 136884,
   "movielens": {
      "languages": [""],
      "releaseDate": "2014-01-03",
      "dvdReleaseDate": null,
      "directors": ["Ravi Jadhav"],
      "runtime": 143,
      "movieId": 136884,
      "title": "Time Pass",
      "mpaa": null,
      "actors": [
         "Prathamesh Parab",
         "Ketaki Mategaonkar",
         "Vaibhav Mangle",
         "Meghana Erande",
         "Bhalchandra Kadam"
      ],
      "imdbMovieId": "3446426",
      "originalTitle": "Time Pass",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "When Cupid strikes the very first time it sees no class or caste barrier. And though the path to reunite with a loved one seems arduous and almost impossible, it's this love which makes a person do good things. Love doesn't remain a Time Pass anymore.",
      "tmdbMovieId": 249677,
      "avgRating": 3.83333,
      "releaseYear": "2014",
      "numRatings": 3,
      "posterPath": "/izSvqDBCFZh4aH6nwKhcCdufeBZ.jpg"
   }
}