{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "vigilante",
            "id": 7002
         },
         {
            "name": "superhero",
            "id": 9715
         },
         {
            "name": "based on comic",
            "id": 9717
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "super power",
            "id": 33637
         },
         {
            "name": "dc extended universe",
            "id": 229266
         }
      ],
      "imdb_id": "tt2975590",
      "video": false,
      "title": "Batman v Superman: Dawn of Justice",
      "recommendations": [
         271110,
         246655,
         102899,
         99861,
         284052,
         297761,
         68735,
         188927,
         293660,
         100402,
         76338,
         127585,
         140607,
         278927,
         330459,
         166424,
         49521,
         308531,
         102382,
         98566
      ],
      "backdrop_path": "/vsjBeMPZtyB7yNsYY56XYxifaQZ.jpg",
      "revenue": 873260194,
      "reviews": [
         {
            "author": "Rahul Gupta",
            "id": "56f4f0bd9251417a440017bd",
            "content": "Awesome moview. Best Action sequence.\r\n\r\n**Slow in the first half**",
            "url": "https://www.themoviedb.org/review/56f4f0bd9251417a440017bd"
         },
         {
            "author": "Frank Ochieng",
            "id": "56f7944bc3a3686a5c005e1d",
            "content": "One would think that the ultimate showdown between two of the most iconic super-heroes would make for some downright compelling action-oriented exploits against a landscape of angst and destruction. Plus, it certainly did not hurt that exhilarating filmmaker Zack Snyder (‘300’) was at the helm in bringing together the colorfully and concocted confrontation between The Caped Crusader and The Man of Steel. Also, it should have been an effortless task to bring together **Batman v Superman: Dawn Of Justice** leading men Ben Affleck and Henry Cahill since they had prior experiences donning heroic attire as mighty super-heroes on call to save the day. So why then does Snyder’s big-budgeted connect-the-dots comic book caper feel so incoherently stiff and aimless?\r\n\r\nThe dour randomness of **Batman v Superman: Dawn Of Justice** is quite disappointing because this moping actioner wants to grab more than it can chew in its crowded mouth. Snyder and screenwriters David S. Goyer and Chris Terrio aspire to plug in such contemplative issues pertaining to moral ambivalence, political platitudes and religious themes but none of these factors energize or sustain this action-packed narrative that seems to slouch all at the expense of a sluggish approach to the mechanical hedonism that labors.\r\n\r\nThere is no doubt that **Dawn of Justice** has its share of visual opulence as this is obviously expected in an expansive superhero saga where the proven selling point are two mythical comic book titans spearheading the pumped-up proceedings. Again an overreaching script that plods along, a couple of super-powered sourpusses going the moody motions and the lack of carefree robust action undermine the potential explosiveness that **Dawn of Justice** could have capitalized on with dynamic aplomb.\r\n\r\nSure, there is a noted curiosity and interesting element about the topic of “heroism fatigue” and hidden demons that could have certainly contributed to the psychological strain for our Caped Courageous Ones. Still, **Dawn of Justice** never quite turns this premise into a sparkling case of burn-out conviction, Instead, knuckle-dragging duo of Bruce Wayne/Batman (Affleck) and Clark Kent/Superman (Cavell) make the common sleeping pill look like an excitable bag of M&M candy treats. Thankfully, another fan favorite superhero in the form of Wonder Woman (Gal Godot) is thrown into the mix to break up the monotony of the boorish Boys Club. Unfortunately, the appearance of the wily Wonder Woman during the tail end of the second half is too little and too late for her welcomed presence to rescue the film’s clunky pacing.\r\n\r\nGotham’s Bruce Wayne and Metropolis’s Clark Kent are experiencing setbacks that could be perceived as reaching the depressive crossroads. For starters, a maturing Wayne’s/Batman’s crime-fighting prospects have been tailing off drastically. As for Kent/Superman his existence at the Daily Planet newspaper seems mundane especially when his boss in editor Perry White (Laurence Fishburne) declares that the public has moved away from print given the major impact of social media and other online resources. So yes…Wayne and Kent are in a critical funk in their professional lives both in and out of their familiar costumes. However, can the slumping cities afford two down-and-out superheroes when one can probably carry the load in rough, unsure times?\r\n\r\nWhen the film establishes the dilemma that there can be only one muscle-bound ego to handle the affairs of the region’s unprotected this is where the **Batman v Superman** portion of **Dawn of Justice** looks as if the frenetic fantasy will percolate. Inexplicably, the hype involving the sparring twosome is put on hold as the exposition takes its tedious time building up the conflict to satisfy the clashing insecurities of the capable caped crime-stoppers. For those that witnessed Cavell’s mediocre **Man of Steel** a few years ago will probably understand the current bad blood that exists between the two super studs. Whatever the case both Batman and Superman have pegged each other as brawny bad news ambassadors…something that does not sit well with either struggling superhero as their revered reputations are on the line.\r\n\r\nNaturally, there are other outside forces to consider as the acrimonious overtones continue to flow between the brooding mega-powers. The famed instigator in Superman foe Lex Luthor (Jesse Eisenberg) is realized as the high-tech billionaire nuisance that has an underlying scheme to eradicate both bickering super powers once and for all but not before Luthor pronounces his take on philosophical tirades. In the meantime, Lois Lane (Amy Adams) is on board to profess her undying love and support for her desired dreamboat Superman. Luthor loathing Superman while Lane fantasizing about her strong flashy fly boy. In other words it is business as usual. While Superman is trying to figure out his place in the sun Snyder piles on the bothersome dreamy anxieties that plague the aging Wayne.\r\n\r\n**Batman v Superman: Dawn of Justice** is a jumbled mess. Snyder undertakes a convoluted production and tries to sell it as a sophisticated meeting of the misplaced minds between two embattled entities embroiled in uncertainty and super-sized cynicism. Still, Snyder’s vision is mishandled as he seems to have forgotten one crucial point–simply making an action movie that registers with genuine thrills. One cannot help but stumble upon the pretentiousness and piousness that ruins this boneless blockbuster. The film finally decides to stack on the combinations of boisterous match-ups involving everyone but the kitchen sink but all comes off as frivolously forced. Cavell was never really an enticing Superman ever since he donned the big “S” on his chest back in 2013’s** Man of Steel**. Affleck’s Batman is a little more palatable but the constant scowl (both on his face and on the mask) is too much to digest. One would not mind yelling at the screen for Affleck’s alter ego to lighten up a bit.\r\n\r\nThe supporting players are virtually wasted in this exhausting CGI popcorn pleaser. Eisenberg, normally a trustworthy performer with considerable scope, merely irritates as the punkish techno-magnate Luthor. The always radiant Adams is a wash as the gushing Lois Lane. Oscar-winner Jeremy Irons’s Alfred the butler won’t make anyone forget Micheal Caine’s take on Wayne’s trusty man servant anytime soon. Even the reliably adventurous Oscar-nominated actor Michael Shannon cannot exuberantly bring to life the menacing presence of Zod.\r\n\r\nHumorless and hackneyed, **Batman v Superman: Dawn of Justice** will probably satisfy indiscriminate devoted fans that will buy into the proposed heralded rivalry. As for others, they will wonder what lies ahead in terms of other League of Justice movies that hopefully can muster up more entertaining stimulation than this over-indulgent doomsday dud. Is anyone up for **Wonder Woman vs. Redwing** with an empowering feminine twist?\r\n\r\n**Batman v Superman: Dawn of Justice** (2016)\r\n\r\nWarner Bros. Pictures\r\n\r\n2 hrs. 30 mins.\r\n\r\nStarring: Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Laurence Fishburne, Jeremy Irons, Diane Lane, Gal Gadot, Holly Hunter, Michael Shannon, Ray Fisher\r\n\r\nDirected by: Zack Snyder\r\n\r\nMPAA Rating: PG-13\r\n\r\nGenre: Science Fiction/Fantasy/Action and Adventure/Superhero Saga\r\n\r\nCritic’s rating: ** stars (out of 4 stars)\r\n\r\n(c) Frank Ochieng",
            "url": "https://www.themoviedb.org/review/56f7944bc3a3686a5c005e1d"
         },
         {
            "author": "shekzilla",
            "id": "56f7d0b1c3a3686a6e006e46",
            "content": "A bit slow but overall good. There are many sub plots in the movie that could've been made into independent movies of their own.",
            "url": "https://www.themoviedb.org/review/56f7d0b1c3a3686a6e006e46"
         },
         {
            "author": "Reno",
            "id": "5787d205c3a368391d0014b7",
            "content": "> Know your enemy's weakness before challenging to a fight!\r\n\r\nIt is known that critics have no brain. It is the best Superman film as Henry Cavill in the red and blue suit. Yep, I know it is always DC versus Marvel, so it is then DC's reply to the 'Avengers'. I don't care their rivalries, as a film fanatic, I enjoy good films and I found it was so good. But I was a bit worried after the Superman was shown in a dark shade in the trailer, especially after Batwan was overly stylised by Nolan, I thought the black suit would take over. After watching the film I was relieved and happy that Batman was exposed.\r\n\r\nBatman fans might have been disappointed, but for the superhero and DC fans, this film is a great treat. You can't compare it with 'Avengers', it had its own style. It follows the 'Man of Steel' and directed by the same director. Excellent cast. I have never been the Ben Affleck hater, so I had no objection to his role in this. He did good along with Cavill and others. He would do better in his solo Batman films if Zack Snyder is retained to script and direct them.\r\n\r\nI'm not a comic book reader, so I did not know the story before the watch. I was surprised for the Wonder Woman's part in the film. The visuals were awesome, the story was unpredictable, well developed characters, cleverly composed scenes, wonderful stunt sequences and the film's overall tone was kind of dark and gloomy, a very satisfying superhero film. The content balance was perfect, but the characters did not do the same as we know Superman is a father of all superheroes.\r\n\r\nI already watched it twice and I can't wait for its sequel. Especially looking forward for Jesse Eisenberg, because he was kind of stayed low in this and I hope his character Lex becomes much stronger. It is a PG13, and there's nothing botherable stuffs in it for the underage audience, but I felt it is targeted for adults because of the matured flavour. Don't think about that I said, just watch it, it will definitely entertain you well if not blow you away. Surely recommended to all.\r\n\r\n8/10",
            "url": "https://www.themoviedb.org/review/5787d205c3a368391d0014b7"
         },
         {
            "author": "Austin Singleton",
            "id": "57acf1f9925141587700033c",
            "content": "I still have faith in the DCU but this movie had problems. Watch my full review here.\r\n\r\nhttp://www.hweird1reviews.com/allreviews/bvsreview",
            "url": "https://www.themoviedb.org/review/57acf1f9925141587700033c"
         },
         {
            "author": "Per Gunnar Jonsson",
            "id": "5a6353120e0a2619fe00e820",
            "content": "As I write this review I have just had a thoroughly disappointing movie experience and it so just happens that I have some strong feelings about the source material for this movie so be prepared for a bit of ranting and a few more “adult” words than usual.\r\n\r\nI have to say that I bought this movie only because I felt I wanted it in my collection just for it to be complete. I was really expecting to be, shall we say, not impressed. A movie about Batman and Superman, heroes that I grew up with, fighting is not my kind of movie.\r\n\r\nIn the end I realized that my expectations of crappines was not enough. I really disliked this movie. In short succession this movie turns several of my childhood heroes to bad guys and the greatest superman bad guy into a unstable hippie-like jerk that goes through the movie behaving like he is a drug addict. So basically this movie went drown the drains for me straight away and then I have not even gotten started about the plot. Actually I felt so annoyed over this crap that I actually spent time taking notes while I was watching.\r\n\r\nLet me see what I noted. Lex Luther is a fucking joke. Alfred, the same. Jimmy Olsen a fucking CIA agent? You got to be fucking kidding me! And not only does he screw Lois Lane but gets himself shot after a few seconds of screen time.\r\n\r\nSame stupid nonsense about XXX being too powerful, is a threat and needs to be government controlled that has been used in hundreds. if not thousands, of crappy low and high budget action movies. I hate that crap. It is stupid, stupid, stupid.\r\n\r\nWeird and totally uninteresting dream scenes, what the f... did the writer smoke? If they wanted to pad the movie it a) was a crappy way of doing it and b) why? With over three hours (Ultimate Edition) it is way to long for such a crappy movie anyway.\r\n\r\nOh, here is a (somewhat) positive note at least. It was indeed rather funny that they had chosen CNN to spew out the nonsense conspiracy theories about Superman being responsible for the bomb in the wheelchair. Fake news anyone?\r\n\r\nI had a little bit of enjoyment of the movie during the last part of the movie when it finally turned into a bit of action. Batman’s car and plane was cool. The action, once Batman getting knocked on his head enough to get to his senses again, was a nice chunk of CGI goodness. That I have to admit.\r\n\r\nOkay, after three, mostly painful, hours the movie finally comes to an end. And what an end. Meh!!! Not only was it a crappy ending but they managed to drag it out forever with excruciatingly boring scenes.\r\n\r\nI am sure a lot of the above can be said to be subjective. For instance my dislike of the way my childhood characters where treated. I am not a professional reviewer though so this is my personal take of the movie. If you don’t like it, fine with me and good for you but do not feel obliged to tell me about it.",
            "url": "https://www.themoviedb.org/review/5a6353120e0a2619fe00e820"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 18,
               "character": "Bruce Wayne / Batman",
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c65",
               "name": "Ben Affleck",
               "profile_path": "/lowyjtC3tZcNEGrxCGoEwjqgdvk.jpg",
               "id": 880,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Clark Kent / Superman",
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c55",
               "name": "Henry Cavill",
               "profile_path": "/hErUwonrQgY5Y7RfxOfv8Fq11MB.jpg",
               "id": 73968,
               "order": 1
            },
            {
               "cast_id": 19,
               "character": "Diana Prince / Wonder Woman",
               "gender": 1,
               "credit_id": "52fe4d5bc3a368484e1e4c69",
               "name": "Gal Gadot",
               "profile_path": "/yV2nljqQa3MjrrIK4AllDjmJIcs.jpg",
               "id": 90633,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Lois Lane",
               "gender": 1,
               "credit_id": "52fe4d5bc3a368484e1e4c59",
               "name": "Amy Adams",
               "profile_path": "/tk5eWJcOBr9uRefeUm9ntvehbLA.jpg",
               "id": 9273,
               "order": 3
            },
            {
               "cast_id": 22,
               "character": "Lex Luthor",
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c79",
               "name": "Jesse Eisenberg",
               "profile_path": "/c01G88eCpiLLmT4RIWGkr7nm31o.jpg",
               "id": 44735,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Martha Kent",
               "gender": 1,
               "credit_id": "52fe4d5bc3a368484e1e4c61",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Alfred Pennyworth",
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c7d",
               "name": "Jeremy Irons",
               "profile_path": "/9AWphjIgGX7JjTrwrx3tsTZlUgv.jpg",
               "id": 16940,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Perry White",
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c5d",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Senator Finch",
               "gender": 1,
               "credit_id": "533d9aeec3a36878ed0035ec",
               "name": "Holly Hunter",
               "profile_path": "/sfqLoSx2dmfQTafqbv8lNHnBeUW.jpg",
               "id": 18686,
               "order": 8
            },
            {
               "cast_id": 33,
               "character": "Wallace Keefe",
               "gender": 2,
               "credit_id": "53ac7a9a0e0a26598600036e",
               "name": "Scoot McNairy",
               "profile_path": "/8BScej2gtxRObcIyR46p2CAffRH.jpg",
               "id": 59233,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Anatoli Knyazev",
               "gender": 2,
               "credit_id": "533d9abdc3a36878e600358f",
               "name": "Callan Mulvey",
               "profile_path": "/htTfBckaMml134A9lFKs6uij3yv.jpg",
               "id": 208296,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Mercy Graves",
               "gender": 1,
               "credit_id": "533d9acec3a36878e6003591",
               "name": "Tao Okamoto",
               "profile_path": "/ahbByaizp6xLkakmTWebPC57v06.jpg",
               "id": 1156024,
               "order": 11
            },
            {
               "cast_id": 270,
               "character": "Jenet Klyburn",
               "gender": 1,
               "credit_id": "58cc0f95c3a368289901360f",
               "name": "Jena Malone",
               "profile_path": "/p4IvynJ0U69WqiaW8V2UydcNVw1.jpg",
               "id": 20089,
               "order": 12
            },
            {
               "cast_id": 61,
               "character": "Young Bruce Wayne",
               "gender": 2,
               "credit_id": "56f79273c3a3686a5e0065eb",
               "name": "Brandon Spink",
               "profile_path": "/jlqDdQxMVBnGE0TAaDOgGmx62Xz.jpg",
               "id": 1511243,
               "order": 13
            },
            {
               "cast_id": 54,
               "character": "Martha Wayne",
               "gender": 1,
               "credit_id": "56a329f5c3a368389b0021d7",
               "name": "Lauren Cohan",
               "profile_path": "/5W4AV3ZXn38NlEMqPy9QPjwRRz8.jpg",
               "id": 62220,
               "order": 14
            },
            {
               "cast_id": 76,
               "character": "Jack O'Dwyer",
               "gender": 2,
               "credit_id": "5762f5169251415b940000eb",
               "name": "Hugh Maguire",
               "profile_path": "/99cgDJk8mzU8GJWMfsfoSLUwDai.jpg",
               "id": 87447,
               "order": 15
            },
            {
               "cast_id": 60,
               "character": "Jimmy Olsen",
               "gender": 2,
               "credit_id": "56f791fd9251412cc0002d12",
               "name": "Michael Cassidy",
               "profile_path": "/60jcYl96Rdr2uEEnKWihKg93srY.jpg",
               "id": 56556,
               "order": 16
            },
            {
               "cast_id": 161,
               "character": "Wayne Industries Pilot",
               "gender": 2,
               "credit_id": "57fa30b2925141212b006e11",
               "name": "Alan D. Purwin",
               "profile_path": "/1jjtYngdcMlKJi0nnP3HuaVHiPR.jpg",
               "id": 1106260,
               "order": 17
            },
            {
               "cast_id": 77,
               "character": "Drone Pilot",
               "gender": 2,
               "credit_id": "5762f569c3a3684b630000e3",
               "name": "Dan Amboyer",
               "profile_path": "/jKp8aQyiaQ0OyAlZCERv5YC47pR.jpg",
               "id": 1190987,
               "order": 18
            },
            {
               "cast_id": 62,
               "character": "Jenny Jurwich",
               "gender": 0,
               "credit_id": "56f7934cc3a3686a670062e5",
               "name": "Rebecca Buller",
               "profile_path": "/2e4eLghYs2jXxnoy4gG0TOSsyVA.jpg",
               "id": 1272969,
               "order": 19
            },
            {
               "cast_id": 63,
               "character": "General Swanwick",
               "gender": 2,
               "credit_id": "56f7938792514120f8000015",
               "name": "Harry Lennix",
               "profile_path": "/uwpRytLjzz1IvjNanYNlplPVal9.jpg",
               "id": 9464,
               "order": 20
            },
            {
               "cast_id": 64,
               "character": "Major Carrie Farris",
               "gender": 0,
               "credit_id": "56f7939b92514120f800001a",
               "name": "Christina Wren",
               "profile_path": "/8nLwMjNuL9FU9lVGXZBBZpMWLGk.jpg",
               "id": 1272970,
               "order": 21
            },
            {
               "cast_id": 75,
               "character": "Carmen",
               "gender": 1,
               "credit_id": "573e5c7592514108d700058f",
               "name": "Jade Chynoweth",
               "profile_path": "/o0iD5vahbhFKOqqK78be5XtazZd.jpg",
               "id": 1622651,
               "order": 22
            },
            {
               "cast_id": 68,
               "character": "Glen Woodburn",
               "gender": 0,
               "credit_id": "56f7943592514120f8000036",
               "name": "Chad Krowchuk",
               "profile_path": "/kdo50TQZSPuNPO3ClYmyGdOKoIl.jpg",
               "id": 91403,
               "order": 23
            },
            {
               "cast_id": 56,
               "character": "Jonathan Kent",
               "gender": 2,
               "credit_id": "56f33c339251411a85000bd3",
               "name": "Kevin Costner",
               "profile_path": "/ePo87kGyyY8JZ3z7Zm7Z2GYdmJ8.jpg",
               "id": 1269,
               "order": 24
            },
            {
               "cast_id": 58,
               "character": "Barry Allen / The Flash",
               "gender": 2,
               "credit_id": "56f50fe6c3a368273e001d57",
               "name": "Ezra Miller",
               "profile_path": "/1tgihUq8F6zPHU9IYyRZ7vI6nme.jpg",
               "id": 132157,
               "order": 25
            },
            {
               "cast_id": 73,
               "character": "POTUS (voice)",
               "gender": 2,
               "credit_id": "56f794f692514120f8000056",
               "name": "Patrick Wilson",
               "profile_path": "/djhTpbOvrfdDsWZFFintj2Uv47a.jpg",
               "id": 17178,
               "order": 26
            },
            {
               "cast_id": 53,
               "character": "General Zod",
               "gender": 2,
               "credit_id": "5692a01fc3a3685c54000252",
               "name": "Michael Shannon",
               "profile_path": "/5yGCJ6znHM96zTfW2LNP6uPPDCZ.jpg",
               "id": 335,
               "order": 27
            },
            {
               "cast_id": 67,
               "character": "Charlie Rose",
               "gender": 2,
               "credit_id": "56f7941f9251412fdd001ddc",
               "name": "Charlie Rose",
               "profile_path": "/d1GqYzeF7PBwparbPZrbRhrKmBJ.jpg",
               "id": 70177,
               "order": 28
            },
            {
               "cast_id": 65,
               "character": "Vikram Gandhi",
               "gender": 2,
               "credit_id": "56f793e79251411a61003e24",
               "name": "Vikram Gandhi",
               "profile_path": "/bILyaeP6jwIlAzwULeK1ZZ8wLmA.jpg",
               "id": 1018992,
               "order": 29
            },
            {
               "cast_id": 66,
               "character": "Andrew Sullivan",
               "gender": 2,
               "credit_id": "56f79416c3a3686a5e00662c",
               "name": "Andrew Sullivan",
               "profile_path": "/t6cZ5LNY1IOVgpUAIIQc8iPosW4.jpg",
               "id": 1236584,
               "order": 30
            },
            {
               "cast_id": 69,
               "character": "Neil deGrasse Tyson",
               "gender": 2,
               "credit_id": "56f79445c3a3686a5c005e1b",
               "name": "Neil deGrasse Tyson",
               "profile_path": "/bpW8flOlQVWRdPyZmzVWkQUrsuU.jpg",
               "id": 550307,
               "order": 31
            },
            {
               "cast_id": 79,
               "character": "Jon Stewart",
               "gender": 2,
               "credit_id": "5762f63cc3a3684b87000104",
               "name": "Jon Stewart",
               "profile_path": "/88UHrwCXTPOrrsG2A33G4fMvN62.jpg",
               "id": 12219,
               "order": 32
            },
            {
               "cast_id": 70,
               "character": "Soledad O'Brien",
               "gender": 0,
               "credit_id": "56f7945ec3a3686a61005b16",
               "name": "Soledad O'Brien",
               "profile_path": "/jeNXwjEkIrBcFh2t3Pi1ntil6kU.jpg",
               "id": 1227867,
               "order": 33
            },
            {
               "cast_id": 215,
               "character": "Erika Erickson",
               "gender": 1,
               "credit_id": "58051dcac3a3681da6001394",
               "name": "Erika R. Erickson",
               "profile_path": "/5KSI2evAkj0Smt3FhMDrPFWDXxp.jpg",
               "id": 1696036,
               "order": 34
            },
            {
               "cast_id": 71,
               "character": "Dana Bash",
               "gender": 1,
               "credit_id": "56f7947592514120f8000047",
               "name": "Dana Bash",
               "profile_path": "/6ta36rUfN1sYGZF4Yy232WX8HZY.jpg",
               "id": 1596937,
               "order": 35
            },
            {
               "cast_id": 72,
               "character": "Nancy Grace",
               "gender": 1,
               "credit_id": "56f794b392514169e2003791",
               "name": "Nancy Grace",
               "profile_path": "/m0xUBxeRNk0J9A4QIQbpuSQWBJZ.jpg",
               "id": 1514160,
               "order": 36
            },
            {
               "cast_id": 59,
               "character": "Anderson Cooper",
               "gender": 0,
               "credit_id": "56f725109251412fdd0009c0",
               "name": "Anderson Cooper",
               "profile_path": "/iOjPVShHF4EQfYhC02FZQSLDsTa.jpg",
               "id": 1217309,
               "order": 37
            },
            {
               "cast_id": 216,
               "character": "Brooke Baldwin",
               "gender": 1,
               "credit_id": "58051f59c3a3681dbd001413",
               "name": "Brooke Baldwin",
               "profile_path": "/2WXurASF2rRVndR7FufevpFtea1.jpg",
               "id": 1696037,
               "order": 38
            },
            {
               "cast_id": 57,
               "character": "A.I. Kelor (voice)",
               "gender": 1,
               "credit_id": "56f33c499251415fc60001d8",
               "name": "Carla Gugino",
               "profile_path": "/xddYLCp8zWLgYcQRck7REEgCUWl.jpg",
               "id": 17832,
               "order": 39
            },
            {
               "cast_id": 32,
               "character": "Arthur Curry / Aquaman",
               "gender": 2,
               "credit_id": "539f1af4c3a368280b000344",
               "name": "Jason Momoa",
               "profile_path": "/tTONqzQuAnuMlfM5E0nU9RWukOE.jpg",
               "id": 117642,
               "order": 40
            },
            {
               "cast_id": 74,
               "character": "Silas Stone",
               "gender": 2,
               "credit_id": "56f7952dc3a3686a5c005e3c",
               "name": "Joe Morton",
               "profile_path": "/5adJxjbFX2GeuTTCNqc9dg4Twgx.jpg",
               "id": 3977,
               "order": 41
            },
            {
               "cast_id": 27,
               "character": "Victor Stone / Cyborg",
               "gender": 2,
               "credit_id": "535a8513c3a368308a00003b",
               "name": "Ray Fisher",
               "profile_path": "/130RBXNLxbp6DbzVFQT90RFLmxD.jpg",
               "id": 1313559,
               "order": 42
            },
            {
               "cast_id": 80,
               "character": "Pete Ross",
               "gender": 2,
               "credit_id": "5762f6fac3a3684b6f00011c",
               "name": "Joseph Cranford",
               "profile_path": "/w0hV56G5JbcLUFOMGxsP7ZaCdC2.jpg",
               "id": 1636956,
               "order": 43
            },
            {
               "cast_id": 81,
               "character": "Lana Lang",
               "gender": 0,
               "credit_id": "5762f70bc3a3684b60000148",
               "name": "Emily Peterson",
               "profile_path": "/SBYFYUHhhIXeiJDqMIHygFrLQE.jpg",
               "id": 1377087,
               "order": 44
            },
            {
               "cast_id": 49,
               "character": "Thomas Wayne (uncredited)",
               "gender": 2,
               "credit_id": "55c57fadc3a3682f21000cbe",
               "name": "Jeffrey Dean Morgan",
               "profile_path": "/6ors2HGy8UdXm8kBx6on0HwRHB5.jpg",
               "id": 47296,
               "order": 45
            },
            {
               "cast_id": 83,
               "character": "General Amajagh",
               "gender": 2,
               "credit_id": "57a182a1c3a3686877004d25",
               "name": "Sammi Rotibi",
               "profile_path": "/yjktr2trahEBQmuLsCRMzgoDFvh.jpg",
               "id": 19300,
               "order": 46
            },
            {
               "cast_id": 162,
               "character": "Metropolis Citizen",
               "gender": 1,
               "credit_id": "57fa33f2c3a3686ffa007dfa",
               "name": "Hanna Dworkin",
               "profile_path": "/wTiEeLiXc7eZsD9kFYHHhtj6N1A.jpg",
               "id": 1467216,
               "order": 47
            },
            {
               "cast_id": 163,
               "character": "Metropolis Citizen",
               "gender": 1,
               "credit_id": "57fa3753c3a3681b7f005be7",
               "name": "Tiffany L. Addison",
               "profile_path": "/bcclDxsIaFYCVETuOA5wt0eMJIp.jpg",
               "id": 1691930,
               "order": 48
            },
            {
               "cast_id": 164,
               "character": "Metropolis Citizen",
               "gender": 2,
               "credit_id": "57fa3896c3a3681b8f0061c3",
               "name": "Owais Ahmed",
               "profile_path": "/plINLumv9mIOW8ATg3FR2acVUqz.jpg",
               "id": 1471446,
               "order": 49
            },
            {
               "cast_id": 165,
               "character": "Metropolis Citizen",
               "gender": 2,
               "credit_id": "57fa390d9251411fb3006b9f",
               "name": "Anish Jethmalani",
               "profile_path": "/p0spvGPEKkR4IXeRU5l3pILyFWf.jpg",
               "id": 1691935,
               "order": 50
            },
            {
               "cast_id": 166,
               "character": "Metropolis Citizen",
               "gender": 1,
               "credit_id": "57fa39b79251411fd3006b7d",
               "name": "Tiffany Bedwell",
               "profile_path": "/rSW8rgdrZyg9r1zbb3ZI4skpEU6.jpg",
               "id": 1691940,
               "order": 51
            },
            {
               "cast_id": 167,
               "character": "Metropolis Citizen",
               "gender": 1,
               "credit_id": "57fa3ac29251412128006f64",
               "name": "Natalee Arteaga",
               "profile_path": "/gIOpEZ7Qn4jMrUYtx3zII6jgROo.jpg",
               "id": 1691945,
               "order": 52
            },
            {
               "cast_id": 168,
               "character": "Metropolis Citizen",
               "gender": 2,
               "credit_id": "57fa3acfc3a3686ffa00817a",
               "name": "Keith D. Gallagher",
               "profile_path": "/r80xcvY967IMl4U57pHnb7FJvgU.jpg",
               "id": 1691946,
               "order": 53
            },
            {
               "cast_id": 169,
               "character": "Metropolis Citizen",
               "gender": 2,
               "credit_id": "57fa440cc3a3686ffa008699",
               "name": "Jeff Dumas",
               "profile_path": "/pstLWDvW5gGxmNJiqbC0i5zqJFQ.jpg",
               "id": 1691967,
               "order": 54
            },
            {
               "cast_id": 170,
               "character": "Metropolis Citizen",
               "gender": 1,
               "credit_id": "57fa4693c3a3686fed007f7e",
               "name": "Miriam Lee",
               "profile_path": "/2BfbkUfOd7ic0ww8HbOhviL33kW.jpg",
               "id": 1682540,
               "order": 55
            },
            {
               "cast_id": 171,
               "character": "Metropolis Citizen",
               "gender": 1,
               "credit_id": "57fa470592514120c5006e77",
               "name": "Alicia Regan",
               "profile_path": "/nZ4GPkIBTHRobYk2ZHRdzSXGPO5.jpg",
               "id": 1691970,
               "order": 56
            },
            {
               "cast_id": 172,
               "character": "Teacher",
               "gender": 1,
               "credit_id": "57fa47e0c3a36818af006629",
               "name": "Stephanie Koenig",
               "profile_path": "/8NI5Xhgzxr4SSpN4frWDH2yMWod.jpg",
               "id": 1395056,
               "order": 57
            },
            {
               "cast_id": 173,
               "character": "Sage",
               "gender": 1,
               "credit_id": "57fa4802c3a36818af006638",
               "name": "Ripley Sobo",
               "profile_path": "/rfsiJC70Cz8eVd8UeiR2IBwq4S2.jpg",
               "id": 1648751,
               "order": 58
            },
            {
               "cast_id": 174,
               "character": "Island Scientist",
               "gender": 2,
               "credit_id": "57fa4a6bc3a3686fff008959",
               "name": "Richard Burden",
               "profile_path": "/hpQu9d0lxiw4ROB94n7TEvas2k5.jpg",
               "id": 1691971,
               "order": 59
            },
            {
               "cast_id": 175,
               "character": "General Security Chief",
               "gender": 2,
               "credit_id": "57fa50dd9251411fb300776b",
               "name": "Julius Tennon",
               "profile_path": "/8cxGMkAMhX9QpDjAFbaWoF3rJXi.jpg",
               "id": 156405,
               "order": 60
            },
            {
               "cast_id": 176,
               "character": "Kahina Ziri",
               "gender": 1,
               "credit_id": "57fa53b9c3a3686fff008eb7",
               "name": "Wunmi Mosaku",
               "profile_path": "/9X0GzCfkho7eslAjEdOVyTC88eV.jpg",
               "id": 134774,
               "order": 61
            },
            {
               "cast_id": 177,
               "character": "Senator Barrows",
               "gender": 2,
               "credit_id": "57fa56889251412128007d8f",
               "name": "Dennis North",
               "profile_path": "/yx7PpPNrigLtExqzV8lJu1CZqLA.jpg",
               "id": 1561391,
               "order": 62
            },
            {
               "cast_id": 178,
               "character": "Officer Mazzuccheli",
               "gender": 0,
               "credit_id": "57fa586a9251411fd3007af0",
               "name": "Kiff VandenHeuvel",
               "profile_path": "/o583jkgh7RbTFwaTUfR7jp8DVBa.jpg",
               "id": 1141368,
               "order": 63
            },
            {
               "cast_id": 179,
               "character": "Officer Rucka",
               "gender": 2,
               "credit_id": "57fa58a5c3a3686ffa00916e",
               "name": "Mason Heidger",
               "profile_path": "/vYhjzs7IZQvsr7C6m8UPFTADPw2.jpg",
               "id": 1561419,
               "order": 64
            },
            {
               "cast_id": 180,
               "character": "Hostage Girl",
               "gender": 1,
               "credit_id": "57fa5ac39251411fd3007c0e",
               "name": "Ahney Her",
               "profile_path": "/7M4ygS8JbfLBMbJet1j7PXtHfrZ.jpg",
               "id": 74312,
               "order": 65
            },
            {
               "cast_id": 181,
               "character": "Hostage Girl",
               "gender": 1,
               "credit_id": "57fa5d30925141212b0084bf",
               "name": "Kristine Cabanban",
               "profile_path": "/pfulz6fqJsI9ArPVv2LkpdJARUb.jpg",
               "id": 1691981,
               "order": 66
            },
            {
               "cast_id": 182,
               "character": "Cesar Santos",
               "gender": 2,
               "credit_id": "57fa5dd1c3a3681b8f007324",
               "name": "Sebastian Sozzi",
               "profile_path": "/1GmrndqoAqieJcASuKUuueY4MLJ.jpg",
               "id": 53066,
               "order": 67
            },
            {
               "cast_id": 183,
               "character": "Kent Shocknek",
               "gender": 2,
               "credit_id": "57fa5de992514120f9007e96",
               "name": "Kent Shocknek",
               "profile_path": "/zmX6fNZ7zH18FokBGv5r1sfPmGw.jpg",
               "id": 79086,
               "order": 68
            },
            {
               "cast_id": 184,
               "character": "Emmet Vale",
               "gender": 2,
               "credit_id": "57fa5e0192514120c5007969",
               "name": "Ralph Lister",
               "profile_path": "/iCSm0TEPcsBx0r118zVfaO8bphz.jpg",
               "id": 1494289,
               "order": 69
            },
            {
               "cast_id": 185,
               "character": "Metropolis Cop",
               "gender": 2,
               "credit_id": "57fa5f2bc3a3686fed008bb6",
               "name": "Sammy A. Publes",
               "profile_path": "/hh9m22jmDS9MOPZsQJpXwFdpH1A.jpg",
               "id": 1691982,
               "order": 70
            },
            {
               "cast_id": 186,
               "character": "Metropolis Cop",
               "gender": 2,
               "credit_id": "57fa6081c3a3681bff00741b",
               "name": "Jay R. Adams",
               "profile_path": "/bu9MLM8c5MYGJHhtdpIcpqmKdBG.jpg",
               "id": 1691983,
               "order": 71
            },
            {
               "cast_id": 187,
               "character": "Heroes Park Tourist",
               "gender": 2,
               "credit_id": "57fa63cbc3a3681b7f006ef0",
               "name": "David Midura",
               "profile_path": "/gx6bUXl90EnJTtZDA7keH0kL51H.jpg",
               "id": 1691986,
               "order": 72
            },
            {
               "cast_id": 188,
               "character": "Reporter at Monument",
               "gender": 2,
               "credit_id": "57fa64e292514120f90081e7",
               "name": "Jay Towers",
               "profile_path": "/nNLi0R06p2DW018uahisbOY5T4V.jpg",
               "id": 1691987,
               "order": 73
            },
            {
               "cast_id": 189,
               "character": "Air Force MP",
               "gender": 0,
               "credit_id": "57fa6b01925141016200942f",
               "name": "Michael Ellison",
               "profile_path": "/194R89TUr1M5WavBSTyyOXty5Kf.jpg",
               "id": 1395050,
               "order": 74
            },
            {
               "cast_id": 190,
               "character": "Underground Fight Patron",
               "gender": 2,
               "credit_id": "57fa6ca4c3a3686fff009c06",
               "name": "Kirill Ostapenko",
               "profile_path": "/vJkbUj3wdtVPp4MW2AS2lh3ZcY4.jpg",
               "id": 1692027,
               "order": 75
            },
            {
               "cast_id": 191,
               "character": "Beautiful Woman",
               "gender": 1,
               "credit_id": "57fa7179c3a3686fff009ea9",
               "name": "Rashontae Wawrzyniak",
               "profile_path": "/1JjguD0TeeFwC2HvKqmIy3WMkFH.jpg",
               "id": 1692036,
               "order": 76
            },
            {
               "cast_id": 192,
               "character": "Sports Announcer",
               "gender": 2,
               "credit_id": "57fa732cc3a3681b8f007d91",
               "name": "Tom Luginbill",
               "profile_path": "/9LlXzs4OXfZrhntl6eB3DmICDbr.jpg",
               "id": 1214961,
               "order": 77
            },
            {
               "cast_id": 193,
               "character": "Sports Announcer",
               "gender": 2,
               "credit_id": "57fa749cc3a3681b8f007e2d",
               "name": "Dave Pasch",
               "profile_path": "/cuPi1PQfrluWBn6MSI4zSFlOmJ6.jpg",
               "id": 1692048,
               "order": 78
            },
            {
               "cast_id": 194,
               "character": "Party Photographer",
               "gender": 2,
               "credit_id": "57fa7528c3a3686fff00a0df",
               "name": "Danny Mooney ",
               "profile_path": "/plaDLBSEwVyYYXCi8vuIsFLMfPH.jpg",
               "id": 146413,
               "order": 79
            },
            {
               "cast_id": 195,
               "character": "Party Doorman",
               "gender": 2,
               "credit_id": "57fa7541c3a3681b8f007e6d",
               "name": "Henry Frost III",
               "profile_path": "/rcQuFJ8ih0YUhVx40NXzCzI4wL0.jpg",
               "id": 1692050,
               "order": 80
            },
            {
               "cast_id": 196,
               "character": "LeBlanc",
               "gender": 1,
               "credit_id": "57fa755a92514120c50085df",
               "name": "Nicole Forester",
               "profile_path": "/xmzdRiCNXDFdBSkQesmyzYYFSBX.jpg",
               "id": 165293,
               "order": 81
            },
            {
               "cast_id": 197,
               "character": "Metropolis Governor",
               "gender": 1,
               "credit_id": "5804fddcc3a36868a7001204",
               "name": "Debbie Stabenow",
               "profile_path": "/s49taLyF5iAxmjFvMLekix4Du2q.jpg",
               "id": 1695971,
               "order": 82
            },
            {
               "cast_id": 198,
               "character": "Colorado Woman",
               "gender": 1,
               "credit_id": "5805063ac3a3681db30004d6",
               "name": "Milica Govich",
               "profile_path": "/pxFCvu5cAHjydbpCocUocyzrOVM.jpg",
               "id": 146412,
               "order": 83
            },
            {
               "cast_id": 199,
               "character": "Jail Guard",
               "gender": 2,
               "credit_id": "58050955c3a3681dba00070b",
               "name": "John Lepard",
               "profile_path": "/vHrUCLmnSbwppb3Kl59vMtDiyU6.jpg",
               "id": 1695987,
               "order": 84
            },
            {
               "cast_id": 200,
               "character": "Finch's Receptionist",
               "gender": 1,
               "credit_id": "58050a47c3a3681dba0007bf",
               "name": "Sandra Love Aldridge",
               "profile_path": "/zAWFRyGSqfueHTxVhV2dVUA7sfa.jpg",
               "id": 1695988,
               "order": 85
            },
            {
               "cast_id": 201,
               "character": "James Harmon - Museum Director",
               "gender": 2,
               "credit_id": "58050bc492514170a700094b",
               "name": "Graham W.J. Beal",
               "profile_path": "/beWTumBcTOoxejoauqhQnSGp3xz.jpg",
               "id": 1695990,
               "order": 86
            },
            {
               "cast_id": 202,
               "character": "Bunker Soldier",
               "gender": 2,
               "credit_id": "58050c8fc3a3681dac0008ad",
               "name": "Henri Franklin",
               "profile_path": "/hdfMbaDT0xkJGs0shRUl9Cj0qnL.jpg",
               "id": 1695991,
               "order": 87
            },
            {
               "cast_id": 203,
               "character": "Bunker Soldier",
               "gender": 2,
               "credit_id": "58050dfec3a3681dbd0009e6",
               "name": "Jonathan West",
               "profile_path": "/bfoDbhPyZAGazguX3CoeR5Qia96.jpg",
               "id": 1289444,
               "order": 88
            },
            {
               "cast_id": 204,
               "character": "US Park Officer",
               "gender": 2,
               "credit_id": "58050ee6c3a3681dac0009f5",
               "name": "T.J. Martinelli",
               "profile_path": "/uYhZApK1xmVCIiWyK27sNvTslEe.jpg",
               "id": 1695992,
               "order": 89
            },
            {
               "cast_id": 205,
               "character": "Wayne Accountant",
               "gender": 2,
               "credit_id": "5805103692514170a7000c11",
               "name": "Chris Newman",
               "profile_path": "/xL9bKBBGYkNnZY0U7sb0KQ614Pg.jpg",
               "id": 1561416,
               "order": 90
            },
            {
               "cast_id": 208,
               "character": "Diner Waitress",
               "gender": 1,
               "credit_id": "58051489c3a3681dbd000dc7",
               "name": "Lulu Dahl",
               "profile_path": "/4xCk3BiZ0rZbpyetvBNoCJ4b07S.jpg",
               "id": 1696013,
               "order": 91
            },
            {
               "cast_id": 206,
               "character": "DC Protestor",
               "gender": 2,
               "credit_id": "580512eac3a3681da6000d3c",
               "name": "Sam Logan Khaleghi",
               "profile_path": "/2dMRM8sDHpWMlSWBfCuGXFNZMIS.jpg",
               "id": 1201979,
               "order": 92
            },
            {
               "cast_id": 209,
               "character": "DC Protestor",
               "gender": 1,
               "credit_id": "5805171c92514170aa00107d",
               "name": "Anne Marie Damman",
               "profile_path": "/hVJiraCFBubF5VK2f4YPIu9UjFf.jpg",
               "id": 1696018,
               "order": 93
            },
            {
               "cast_id": 210,
               "character": "DC Protestor",
               "gender": 1,
               "credit_id": "5805172f92514170b7001010",
               "name": "Connie Craig",
               "profile_path": "/Mg00l1sSDLmELAf6goHRtG4Mg2.jpg",
               "id": 1452211,
               "order": 94
            },
            {
               "cast_id": 211,
               "character": "DC Protestor",
               "gender": 1,
               "credit_id": "580517e2c3a3681db60010a6",
               "name": "Henrietta Hermelin",
               "profile_path": "/xYz7k3RIMaHaNFsomyICc8mJ2HR.jpg",
               "id": 1696019,
               "order": 95
            },
            {
               "cast_id": 212,
               "character": "Senator Purrington",
               "gender": 2,
               "credit_id": "58051a4692514170b70011c7",
               "name": "Patrick Leahy",
               "profile_path": "/qEHnebEyr22RGiPyOETt3VxjKvl.jpg",
               "id": 853194,
               "order": 96
            },
            {
               "cast_id": 213,
               "character": "Convenience Store Robber",
               "gender": 2,
               "credit_id": "58051b3a92514170b4001156",
               "name": "Albert Valladares",
               "profile_path": "/uqCrw6Dx3ogXxcQUG0jedHeES6l.jpg",
               "id": 1334323,
               "order": 97
            },
            {
               "cast_id": 214,
               "character": "Helicopter Pilot",
               "gender": 2,
               "credit_id": "58051ca4c3a3681db60013bb",
               "name": "David Paris",
               "profile_path": "/a67IKNrw1Q1BHPixmGXVHS3yRYI.jpg",
               "id": 1685460,
               "order": 98
            },
            {
               "cast_id": 217,
               "character": "Flight Attendant",
               "gender": 1,
               "credit_id": "58051fc0c3a3681da600148f",
               "name": "Abigail Kuklis",
               "profile_path": "/pNVOM5SQsauAaYtu6XZUZAmzSpa.jpg",
               "id": 1696038,
               "order": 99
            },
            {
               "cast_id": 218,
               "character": "Chairman of Joint Chiefs",
               "gender": 0,
               "credit_id": "5805f5c59251415bbe004133",
               "name": "Greg Violand",
               "profile_path": "/lxWA2GXorXmy3JuOwmibZgYO8DN.jpg",
               "id": 1545503,
               "order": 100
            },
            {
               "cast_id": 219,
               "character": "Vice Chairman of Joint Chiefs",
               "gender": 2,
               "credit_id": "5805f5da9251415bec004209",
               "name": "Tiren Jhames",
               "profile_path": "/itRkEECByuUrHbYRz2GkDBwrkZ.jpg",
               "id": 1007391,
               "order": 101
            },
            {
               "cast_id": 220,
               "character": "Signals Officer - Air Force",
               "gender": 2,
               "credit_id": "5805f89cc3a3684cba003b04",
               "name": "Steve Jasgur",
               "profile_path": "/gcRoEIEOeMc4dXidJhrVItF1uUI.jpg",
               "id": 1505007,
               "order": 102
            },
            {
               "cast_id": 221,
               "character": "Silo Officer",
               "gender": 2,
               "credit_id": "5805f9239251415b9000472e",
               "name": "Jonathan Stanley",
               "profile_path": "/hklI00HMspm6NP0SaET0My8oW42.jpg",
               "id": 1696221,
               "order": 103
            },
            {
               "cast_id": 222,
               "character": "Silo Officer",
               "gender": 2,
               "credit_id": "5805fa289251415a7a0045e3",
               "name": "Jesse Nagy",
               "profile_path": "/rFR4OH8y4X0IHQpnsEKKBmG7E4o.jpg",
               "id": 1390506,
               "order": 104
            },
            {
               "cast_id": 223,
               "character": "Supermax Guard",
               "gender": 2,
               "credit_id": "5805fc42c3a3684ee5004b70",
               "name": "Duvale Murchison",
               "profile_path": "/cvlaUvAWMKK9zIlP54KY1GAx3jD.jpg",
               "id": 1696222,
               "order": 105
            },
            {
               "cast_id": 224,
               "character": "Prison Barber",
               "gender": 2,
               "credit_id": "5805fda8c3a3684ee5004cf1",
               "name": "Thomas J. Fentress",
               "profile_path": "/dy7G3EIY1SlorxjArFuxHEWqJtN.jpg",
               "id": 1696223,
               "order": 106
            },
            {
               "cast_id": 225,
               "character": "Father Leone",
               "gender": 0,
               "credit_id": "5805fe9f9251415bec004b25",
               "name": "Coburn Goss",
               "profile_path": "/tHkCjgM2wKZrxb1nJeqJREsS0Ui.jpg",
               "id": 1189226,
               "order": 107
            },
            {
               "cast_id": 226,
               "character": "Wagon Driver",
               "gender": 0,
               "credit_id": "5805febe92514170b700c0ec",
               "name": "Jeff Hanlin",
               "profile_path": "/mcu6kBpgbacnn7dBCFmJOkgYpHL.jpg",
               "id": 1696226,
               "order": 108
            },
            {
               "cast_id": 227,
               "character": "Creature Vocals (voice)",
               "gender": 2,
               "credit_id": "5806000fc3a3684cba00417a",
               "name": "Gary A. Hecker",
               "profile_path": "/qyBUauN3XIS2Mlus3OdGCmrUo0S.jpg",
               "id": 1077782,
               "order": 109
            },
            {
               "cast_id": 228,
               "character": "Kreatur (voice)",
               "gender": 2,
               "credit_id": "580600c5c3a3684d4e0047c2",
               "name": "Robin Atkin Downes",
               "profile_path": "/pCnIQMMgrFc4hBOE4LJDdebqRZ4.jpg",
               "id": 130081,
               "order": 110
            },
            {
               "cast_id": 229,
               "character": "Squatter Boy",
               "gender": 2,
               "credit_id": "58060193c3a3684f1a0049be",
               "name": "Issac Ryan Brown",
               "profile_path": "/uZf2tLucKpPzJxfMN0RfeVJ727s.jpg",
               "id": 1696230,
               "order": 111
            },
            {
               "cast_id": 230,
               "character": "CIA Supervisor",
               "gender": 2,
               "credit_id": "580601d49251415bbe004cc4",
               "name": "Barton Bund",
               "profile_path": "/mLmC1qyPzF5avFHI7lIoFQNdffy.jpg",
               "id": 1374130,
               "order": 112
            },
            {
               "cast_id": 231,
               "character": "Python Team Leader",
               "gender": 2,
               "credit_id": "580602c5c3a3684d4e004942",
               "name": "Bailey Chase",
               "profile_path": "/xgiQfaFA1oDumwXCEG2XQQ85iqt.jpg",
               "id": 104195,
               "order": 113
            },
            {
               "cast_id": 232,
               "character": "Gotham Desk Cop",
               "gender": 2,
               "credit_id": "5806049c9251415a8600523f",
               "name": "Patrick O'Connor Cronin",
               "profile_path": "/5oZWTKCRMLoD7HWkbXjQYwPMdDD.jpg",
               "id": 1696231,
               "order": 114
            },
            {
               "cast_id": 233,
               "character": "Gotham Desk Cop",
               "gender": 1,
               "credit_id": "580606e3c3a3684d4e004c05",
               "name": "Sonja Crosby",
               "profile_path": "/dWKWF7QiWX2iVr7w5b5ObZB0ihv.jpg",
               "id": 1000800,
               "order": 115
            },
            {
               "cast_id": 234,
               "character": "Inmate Thug",
               "gender": 2,
               "credit_id": "580608a5c3a3684cba004729",
               "name": "C.T. Fletcher",
               "profile_path": "/z1Uyzjx1I3MQUp5a1pINdlCE5Ej.jpg",
               "id": 1696234,
               "order": 116
            },
            {
               "cast_id": 239,
               "character": "Inmate Thug",
               "gender": 2,
               "credit_id": "58060bda9251415ab0005ad0",
               "name": "Ahman Green",
               "profile_path": "/7UsmQ7qapgZ4ZA4cJj9OKWrd3Ox.jpg",
               "id": 1696241,
               "order": 117
            },
            {
               "cast_id": 235,
               "character": "Nairomian Crying Woman",
               "gender": 0,
               "credit_id": "580609f99251415a5400578c",
               "name": "Diana Gaitirira",
               "profile_path": "/c26z0BS9oRtQqAq68I2d8nVc008.jpg",
               "id": 1548735,
               "order": 118
            },
            {
               "cast_id": 242,
               "character": "Nairomian Crying Woman",
               "gender": 1,
               "credit_id": "58060ec09251415ab0005d5f",
               "name": "Jalene Mack",
               "profile_path": "/1qael7Z0DN6TnVoXIpAv0OotvXp.jpg",
               "id": 1147413,
               "order": 119
            },
            {
               "cast_id": 236,
               "character": "Nairomian Crying Woman",
               "gender": 1,
               "credit_id": "58060a0c9251415a7a00531c",
               "name": "Esodie Geiger",
               "profile_path": "/zutiBEvWQBZSWuQforVUnSl85Ce.jpg",
               "id": 1424325,
               "order": 120
            },
            {
               "cast_id": 245,
               "character": "Nairomian Crying Woman",
               "gender": 1,
               "credit_id": "58061229c3a3684cba004d62",
               "name": "Nene Nwoko",
               "profile_path": "/3R2AaRx3S6rAk544n6yDUAE3XuB.jpg",
               "id": 1696264,
               "order": 121
            },
            {
               "cast_id": 240,
               "character": "Nairomian Driver",
               "gender": 2,
               "credit_id": "58060e28c3a3684f1a005296",
               "name": "Scott Edward Logan",
               "profile_path": "/1iObpDPZha6Vw5dAU7jpIWCMAYc.jpg",
               "id": 1696251,
               "order": 122
            },
            {
               "cast_id": 237,
               "character": "Gala Waiter",
               "gender": 2,
               "credit_id": "58060a2092514170b700c90f",
               "name": "Marcus Goddard",
               "profile_path": "/xkEG5muOp2HvlrwMEDCV5U81KuC.jpg",
               "id": 1696236,
               "order": 123
            },
            {
               "cast_id": 238,
               "character": "Adriana Santos",
               "gender": 1,
               "credit_id": "58060b2ac3a3684e06005947",
               "name": "Cruz Gonzalez-Cadel",
               "profile_path": "/7QUpROmT3G1kTvpG9roW5TVMPzg.jpg",
               "id": 1696238,
               "order": 124
            },
            {
               "cast_id": 243,
               "character": "Older Goat Herder",
               "gender": 1,
               "credit_id": "58060eedc3a3684ee5005a7e",
               "name": "Alma Martinez",
               "profile_path": "/q4fxft08z8DqMuOypE0w1te0VqR.jpg",
               "id": 162169,
               "order": 125
            },
            {
               "cast_id": 241,
               "character": "Older Goat Herder",
               "gender": 0,
               "credit_id": "58060e3fc3a3684cba004ae0",
               "name": "Sal Lopez",
               "profile_path": "/7OlDm4j7cD4waboUHyjYnGljokZ.jpg",
               "id": 8666,
               "order": 126
            },
            {
               "cast_id": 247,
               "character": "Young Goat Herder",
               "gender": 0,
               "credit_id": "58061399c3a3684e06005f7a",
               "name": "Marcel Shihadeh",
               "profile_path": "/35wDiCnmfsFPB3FKwVk98Uc0IWs.jpg",
               "id": 1696268,
               "order": 127
            },
            {
               "cast_id": 244,
               "character": "Rebel Translator",
               "gender": 2,
               "credit_id": "580612119251415ab0005fdf",
               "name": "Theo Bongani Ndyalvane",
               "profile_path": "/qHoI2JazZ8y2whOIKf18INSZawd.jpg",
               "id": 1696262,
               "order": 128
            },
            {
               "cast_id": 246,
               "character": "Squatter Mother",
               "gender": 1,
               "credit_id": "5806137fc3a3684d4e005455",
               "name": "Satori Shakoor",
               "profile_path": "/60QO2n0K4V67ZyvWP2KdWk8ZXH1.jpg",
               "id": 1393349,
               "order": 129
            },
            {
               "cast_id": 249,
               "character": "Truck (uncredited)",
               "gender": 2,
               "credit_id": "5863971e9251412b8a00a94b",
               "name": "Ele Bardha",
               "profile_path": "/AaLb7j05vcN86vbldQeBErNJFMb.jpg",
               "id": 76674,
               "order": 130
            },
            {
               "cast_id": 250,
               "character": "Wayne Financial Employee (uncredited)",
               "gender": 2,
               "credit_id": "58639739c3a36852c900a7bc",
               "name": "Inder Kumar",
               "profile_path": "/S9yTira2coxHR92LIEfX71t3s5.jpg",
               "id": 639817,
               "order": 131
            },
            {
               "cast_id": 268,
               "character": "Party Guest (uncredited)",
               "gender": 0,
               "credit_id": "586aa4b8925141213b0017ac",
               "name": "Brandon Bautista",
               "profile_path": "/sacq3IRKNJsiAZzhfLXNIILsz04.jpg",
               "id": 1561376,
               "order": 132
            },
            {
               "cast_id": 248,
               "character": "Daily Planet Reporter (uncredited)",
               "gender": 1,
               "credit_id": "580613cf9251415a54005edc",
               "name": "Laura Atwood",
               "profile_path": "/pHGQCMXTOxem8pR7Z8xoC6dMuXL.jpg",
               "id": 1188194,
               "order": 133
            },
            {
               "cast_id": 160,
               "character": "Wayne Enterprise Executive (uncredited)",
               "gender": 1,
               "credit_id": "57c9fa1792514156110014c2",
               "name": "Debbie Scaletta",
               "profile_path": "/tQKHaaZLK9z6wJ3L8eEEF3dnuGs.jpg",
               "id": 1636801,
               "order": 134
            },
            {
               "cast_id": 251,
               "character": "Football Player (uncredited)",
               "gender": 2,
               "credit_id": "586399889251413cd6006af4",
               "name": "David Leach",
               "profile_path": "/bI4ZlO9sb4gnRKgtO7d2PI9LoEd.jpg",
               "id": 1645569,
               "order": 135
            },
            {
               "cast_id": 252,
               "character": "Gotham Seaport Cop (uncredited)",
               "gender": 2,
               "credit_id": "58639ad2c3a36852c900aa10",
               "name": "Gordon Michaels",
               "profile_path": "/vwaSCFCIaZdtRh6TgVYSIGjAtia.jpg",
               "id": 74595,
               "order": 136
            },
            {
               "cast_id": 253,
               "character": "Wayne Security (uncredited)",
               "gender": 2,
               "credit_id": "58639aee9251412b8700ad38",
               "name": "Brian Boland",
               "profile_path": "/lZreGWhm68vzL6yCw5hz2WdlFCX.jpg",
               "id": 87220,
               "order": 137
            },
            {
               "cast_id": 254,
               "character": "Russian Foreign Minister (uncredited)",
               "gender": 0,
               "credit_id": "58639b0fc3a36852c900aa34",
               "name": "Taras Los",
               "profile_path": "/pHnqDObzaakpa6xKNELWJCrhSKB.jpg",
               "id": 204261,
               "order": 138
            },
            {
               "cast_id": 255,
               "character": "DC Paramedic (uncredited)",
               "gender": 0,
               "credit_id": "58639bb7c3a3680ab600686e",
               "name": "Jason Hughley",
               "profile_path": "/dTamCcVS6FFjAAFErjsAKv1HySr.jpg",
               "id": 1019098,
               "order": 139
            },
            {
               "cast_id": 256,
               "character": "Building Supervisor (uncredited)",
               "gender": 2,
               "credit_id": "58639be8c3a36852c000c222",
               "name": "Sidi Henderson",
               "profile_path": "/mi3dLHDy0MWhgo9MU9KfjnA7Fpm.jpg",
               "id": 1062375,
               "order": 140
            },
            {
               "cast_id": 257,
               "character": "Chilean President (uncredited)",
               "gender": 1,
               "credit_id": "58639cda9251412b8700ae9d",
               "name": "Meighan Gerachis",
               "profile_path": "/ucDR7J8dVQzDA1TIhNhU65obsHL.jpg",
               "id": 1031686,
               "order": 141
            },
            {
               "cast_id": 258,
               "character": "First Class Lady (uncredited)",
               "gender": 0,
               "credit_id": "58639d1e9251412b8a00ad7b",
               "name": "Nicole Santini",
               "profile_path": "/8NwEFl0kEbzweOaaEp5Z9pbqsdm.jpg",
               "id": 1574911,
               "order": 142
            },
            {
               "cast_id": 259,
               "character": "Basketball Player (uncredited)",
               "gender": 2,
               "credit_id": "58639d419251412b8d00b29c",
               "name": "Axel Harney",
               "profile_path": "/dNI4GzK8N9Aueo44g80ERc5xRMC.jpg",
               "id": 1597947,
               "order": 143
            },
            {
               "cast_id": 260,
               "character": "Funeral Attender (uncredited)",
               "gender": 2,
               "credit_id": "5863a8639251412b7d00b407",
               "name": "Wayne E. Brown",
               "profile_path": "/8FJExYnxPvjLim8cRCFmIZDvgNi.jpg",
               "id": 1675748,
               "order": 144
            },
            {
               "cast_id": 261,
               "character": "Police Officer (uncredited)",
               "gender": 2,
               "credit_id": "5863a8ffc3a36852d200aa3d",
               "name": "Dante Briggins",
               "profile_path": "/6Udt1CVnWNVRd4dCDQ9Id3J5Qwe.jpg",
               "id": 1729054,
               "order": 145
            },
            {
               "cast_id": 262,
               "character": "GCU Football Player (uncredited)",
               "gender": 2,
               "credit_id": "5863a98fc3a36852d200aa8c",
               "name": "Shannon Garnett",
               "profile_path": "/dzUvY1Zf1pgUvFXzkkNHzIe3zk2.jpg",
               "id": 1729055,
               "order": 146
            },
            {
               "cast_id": 263,
               "character": "Protester (uncredited)",
               "gender": 0,
               "credit_id": "5863aa659251413cd60077f5",
               "name": "Lynch R. Travis",
               "profile_path": "/zZ0miDXWICXQBl72MFByyq5n4cK.jpg",
               "id": 87443,
               "order": 147
            },
            {
               "cast_id": 264,
               "character": "EMT (uncredited)",
               "gender": 2,
               "credit_id": "5863ab3b9251412b7b00c0d1",
               "name": "Carmen Gangale",
               "profile_path": "/7H9Kva0G3s9DNiwa2FyFdQiglTr.jpg",
               "id": 1594986,
               "order": 148
            },
            {
               "cast_id": 265,
               "character": "Metropolis Survivor (uncredited)",
               "gender": 0,
               "credit_id": "5863ac0cc3a36852d200ac12",
               "name": "Joe Cipriano",
               "profile_path": "/jgQmSfmixulis8CO7nVuk7khZsg.jpg",
               "id": 1283943,
               "order": 149
            },
            {
               "cast_id": 266,
               "character": "Rusty - Metropolis Cop (uncredited)",
               "gender": 0,
               "credit_id": "5863ac3d9251412b8a00b8ad",
               "name": "Will Blagrove",
               "profile_path": "/c4nDACettO9udouFqad28aqpsuY.jpg",
               "id": 99166,
               "order": 150
            },
            {
               "cast_id": 273,
               "character": "Protester (uncredited)",
               "gender": 0,
               "credit_id": "59c41b2c9251415b6e01a39d",
               "name": "Marcelo Bem",
               "profile_path": "/reE2XsKJmZiEs7QlVFG7Yz5p0Bn.jpg",
               "id": 1892479,
               "order": 151
            },
            {
               "cast_id": 274,
               "character": "US Senator (uncredited)",
               "gender": 2,
               "credit_id": "5a0efcdbc3a36862860129af",
               "name": "Joe Fishel",
               "profile_path": "/tVDIXazCDwrCHpHiBAI0jHr9d7C.jpg",
               "id": 1543874,
               "order": 152
            },
            {
               "cast_id": 276,
               "character": "Wayne Industries Pilot",
               "gender": 0,
               "credit_id": "5a233c0892514103260c3355",
               "name": "Mark Edward Taylor",
               "profile_path": null,
               "id": 1933818,
               "order": 153
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "56a93fee925141547500058e",
               "name": "Jay Oliva",
               "profile_path": "/y7EbnuoKFMvU7uZ4aD50jThyNoF.jpg",
               "id": 105643,
               "department": "Writing",
               "job": "Storyboard"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c15",
               "name": "Zack Snyder",
               "profile_path": "/vdr0DlKJH4Ub7nWZtkanBH65bGH.jpg",
               "id": 15217,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c27",
               "name": "David S. Goyer",
               "profile_path": "/vh0ULL0N22JlVlQ5mXFmreA6Ubz.jpg",
               "id": 3893,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d5bc3a368484e1e4c2d",
               "name": "Charles Roven",
               "profile_path": "/4uJLoVstC1CBcArXFOe53N2fDr1.jpg",
               "id": 282,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4d5bc3a368484e1e4c33",
               "name": "Deborah Snyder",
               "profile_path": "/iu3gfcEqJY47Ab111XSoX1U18EW.jpg",
               "id": 79243,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c39",
               "name": "Bob Kane",
               "profile_path": "/vuXwrlqaUydA4t5SFVdQkK9KsZL.jpg",
               "id": 3794,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d5bc3a368484e1e4c3f",
               "name": "Jerry Siegel",
               "profile_path": "/tpkgpm3pHrkSNewoDasKz6Chpg4.jpg",
               "id": 20007,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d5bc3a368484e1e4c45",
               "name": "Joe Shuster",
               "profile_path": null,
               "id": 20008,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c4b",
               "name": "Michael Uslan",
               "profile_path": "/lJ8n7Z9JB0XH4dxdgI48HG9jX1o.jpg",
               "id": 10949,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4d5bc3a368484e1e4c51",
               "name": "Benjamin Melniker",
               "profile_path": null,
               "id": 10951,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4d5bc3a368484e1e4c6f",
               "name": "Chris Terrio",
               "profile_path": "/fALSMZJLffFzhD1WM6cowV2M6wt.jpg",
               "id": 131680,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "537d38f6c3a368059e000071",
               "name": "Bill Finger",
               "profile_path": "/8YNi67GimJjHTmXR3nUhkEJGV95.jpg",
               "id": 198034,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "537d391fc3a36805a400007a",
               "name": "Larry Fong",
               "profile_path": "/4rS2YTxhtVBvc3pSCbxk6b6wGI6.jpg",
               "id": 17284,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "553bf26f9251416874003ccb",
               "name": "Gregory Wilson",
               "profile_path": null,
               "id": 78135,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "553bf23692514135c8002886",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "553bf27a92514138a9006dc8",
               "name": "Curt Kanemoto",
               "profile_path": null,
               "id": 1459033,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "553bf28ec3a3683c480028c1",
               "name": "Wesley Coller",
               "profile_path": "/liHN0gb0T1jbya05NF0GllSzwYc.jpg",
               "id": 79242,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "553bf29bc3a36831dd00c6d4",
               "name": "David S. Goyer",
               "profile_path": "/vh0ULL0N22JlVlQ5mXFmreA6Ubz.jpg",
               "id": 3893,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "553bf2aa9251413f5a0063ed",
               "name": "Geoff Johns",
               "profile_path": "/xkaRZu1o1NILQ4PcRXqnjOrJ0Y0.jpg",
               "id": 211962,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "553bf2ba925141125600a15d",
               "name": "Christopher Nolan",
               "profile_path": "/7OGmfDF4VHLLgbjxuEwTj3ga0uQ.jpg",
               "id": 525,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "553bf2cac3a3685cf8005eba",
               "name": "Emma Thomas",
               "profile_path": "/f12TsNlAEomPdwxueS7ImMoJtsP.jpg",
               "id": 556,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "553bf2d9c3a3683e14003e13",
               "name": "Bruce Moriarty",
               "profile_path": null,
               "id": 13930,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "553bf2eac3a368746200061a",
               "name": "Junkie XL",
               "profile_path": "/A4ppyrEpx4t96BALthouYItfFEH.jpg",
               "id": 56827,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "553bf3329251412c27001847",
               "name": "David Brenner",
               "profile_path": null,
               "id": 6051,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "553bf5d792514138a9006e18",
               "name": "Patrick Tatopoulos",
               "profile_path": "/74JOnC7DLU4uDwNzQX80oLX5Giy.jpg",
               "id": 3964,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "553bf6a3925141125600a1ab",
               "name": "Jo Edna Boldin",
               "profile_path": null,
               "id": 60665,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "553bf6c89251412c27001884",
               "name": "Kristy Carlson",
               "profile_path": null,
               "id": 17610,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "553bf6d39251416874003d18",
               "name": "Lora Kennedy",
               "profile_path": "/iLrYUr57iX8LdHxnh3bflegzWuE.jpg",
               "id": 2953,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5612ab649251414ec60062b5",
               "name": "Frank Miller",
               "profile_path": "/ghKVHIRrtOq4Jkuasbe6ww7d359.jpg",
               "id": 2293,
               "department": "Crew",
               "job": "Graphic Novel Illustrator"
            },
            {
               "gender": 2,
               "credit_id": "5612ab6c92514170510000e7",
               "name": "Frank Miller",
               "profile_path": "/ghKVHIRrtOq4Jkuasbe6ww7d359.jpg",
               "id": 2293,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5692940092514142570000e2",
               "name": "Brian Avery",
               "profile_path": "/w1IlD3q192i2JmCW8TLNMP5nDB3.jpg",
               "id": 1552521,
               "department": "Crew",
               "job": "Stunts"
            },
            {
               "gender": 0,
               "credit_id": "579cfe2d925141063a000f06",
               "name": "Kevin Kaska",
               "profile_path": "/azlSu8Sz9QGeK3xgQS9p3ZvR9q9.jpg",
               "id": 68016,
               "department": "Sound",
               "job": "Orchestrator"
            },
            {
               "gender": 0,
               "credit_id": "57a31c869251410a5f001008",
               "name": "Patricio M. Farrell",
               "profile_path": null,
               "id": 1305602,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57a31c979251410d2c0010c2",
               "name": "Lorin Flemming",
               "profile_path": null,
               "id": 930189,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57a31ca79251410a5f001013",
               "name": "Beat Frutiger",
               "profile_path": null,
               "id": 7235,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57a31cbcc3a368295b0014f9",
               "name": "Gregory S. Hooper",
               "profile_path": null,
               "id": 1172441,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "57a31cd2c3a36832b8005389",
               "name": "Kevin Ishioka",
               "profile_path": null,
               "id": 6878,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57a31ce4c3a36832b800538d",
               "name": "Troy Sizemore",
               "profile_path": null,
               "id": 6923,
               "department": "Art",
               "job": "Supervising Art Director"
            },
            {
               "gender": 1,
               "credit_id": "57a31cf9c3a368295b00152c",
               "name": "Carolyn 'Cal' Loucks",
               "profile_path": "/iy7lqjMdb3Qn6W0lLo0b6kcWZLz.jpg",
               "id": 107420,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "57a31d0fc3a36832b80053a0",
               "name": "Michael Wilkinson",
               "profile_path": "/5363Z5CBR7PoVjyxxnVOuifKrM5.jpg",
               "id": 5392,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57a31d3c9251417c57001494",
               "name": "Deborah Jurvis",
               "profile_path": null,
               "id": 1484474,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "57a31f5dc3a3683f5700103c",
               "name": "Mike Piccirillo",
               "profile_path": null,
               "id": 484529,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "57a31f73c3a368295b00161e",
               "name": "Tom Castronovo",
               "profile_path": null,
               "id": 1661321,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "57a31f86c3a3683f97000f81",
               "name": "Justin N. Lang",
               "profile_path": null,
               "id": 1661322,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "57a31f9b9251410c7d001117",
               "name": "Shari Ratliff",
               "profile_path": null,
               "id": 1408294,
               "department": "Art",
               "job": "Assistant Art Director"
            },
            {
               "gender": 0,
               "credit_id": "57a321399251410cd200118a",
               "name": "Ricardo Silva",
               "profile_path": null,
               "id": 1661324,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a3214fc3a3686c4a004879",
               "name": "Richard Spriggs",
               "profile_path": null,
               "id": 1661325,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a3216c9251416b97004576",
               "name": "Marie A. Kohl",
               "profile_path": null,
               "id": 1532605,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "57a321819251410d2c001295",
               "name": "Caitlin Well",
               "profile_path": null,
               "id": 1661326,
               "department": "Production",
               "job": "Casting Associate"
            },
            {
               "gender": 0,
               "credit_id": "57a321c2c3a368295b0016ba",
               "name": "Gary Harper",
               "profile_path": null,
               "id": 1661327,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 0,
               "credit_id": "57a32298c3a36829a40019ad",
               "name": "Joel Thingvall",
               "profile_path": null,
               "id": 1342054,
               "department": "Production",
               "job": "Researcher"
            },
            {
               "gender": 0,
               "credit_id": "57a322aa9251410c7d0011e6",
               "name": "Victoria Wagner",
               "profile_path": null,
               "id": 1661331,
               "department": "Crew",
               "job": "Armorer"
            },
            {
               "gender": 1,
               "credit_id": "57a322c09251412769000aee",
               "name": "Kimi Webber",
               "profile_path": null,
               "id": 1394760,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 1,
               "credit_id": "57a322ed9251416b970045da",
               "name": "Amber Harley",
               "profile_path": null,
               "id": 1423005,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a323919251410c7d001226",
               "name": "Melissa Muik",
               "profile_path": null,
               "id": 1368884,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a323ff9251416b97004640",
               "name": "J.R. Hawbaker",
               "profile_path": null,
               "id": 1616392,
               "department": "Costume & Make-Up",
               "job": "Assistant Costume Designer"
            },
            {
               "gender": 0,
               "credit_id": "57a324a09251410cd2001288",
               "name": "Bob Morgan",
               "profile_path": null,
               "id": 1322016,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a324b7c3a3686c4a00498c",
               "name": "Jennifer Jobst",
               "profile_path": null,
               "id": 1428226,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a324db9251410cd2001295",
               "name": "Jessica R. Lawson",
               "profile_path": null,
               "id": 1594611,
               "department": "Costume & Make-Up",
               "job": "Seamstress"
            },
            {
               "gender": 0,
               "credit_id": "57a324f99251410ca80012ab",
               "name": "Aura Sperling Pierce",
               "profile_path": null,
               "id": 1402004,
               "department": "Costume & Make-Up",
               "job": "Seamstress"
            },
            {
               "gender": 0,
               "credit_id": "57a34da2c3a3683f57002036",
               "name": "Kate Abraham",
               "profile_path": null,
               "id": 1460748,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "57a34dbc9251410d2c00237f",
               "name": "May Azzow",
               "profile_path": null,
               "id": 1661395,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "57a34dd2c3a36832b8006609",
               "name": "Gina Nalli",
               "profile_path": null,
               "id": 1661396,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "57a34dee9251410d2c002398",
               "name": "Liz Pecos",
               "profile_path": null,
               "id": 1494535,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "57a34e06c3a36829a4002b12",
               "name": "John Voght",
               "profile_path": null,
               "id": 1463804,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 2,
               "credit_id": "57a34e2e9251410c7d00212e",
               "name": "Michael Welch",
               "profile_path": null,
               "id": 1661397,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "57a34f3ac3a3683f97001e69",
               "name": "Eric Petey",
               "profile_path": null,
               "id": 1577213,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a34f5c9251410a5f0022bd",
               "name": "Simeon Duncombe",
               "profile_path": null,
               "id": 1661400,
               "department": "Visual Effects",
               "job": "Animation Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a351519251417c57002713",
               "name": "Jade Mansueto",
               "profile_path": null,
               "id": 1457327,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 0,
               "credit_id": "57a35170c3a3683f57002174",
               "name": "Lidia Martinez Prado",
               "profile_path": null,
               "id": 1660720,
               "department": "Visual Effects",
               "job": "Animation Director"
            },
            {
               "gender": 0,
               "credit_id": "57a3525dc3a36829a4002cbf",
               "name": "Gabriel Vargas",
               "profile_path": null,
               "id": 1661402,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a3526d9251410cd2002298",
               "name": "Hannes Poser",
               "profile_path": null,
               "id": 1661403,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a352869251410cd20022a6",
               "name": "Daniel Macarin",
               "profile_path": null,
               "id": 1418382,
               "department": "Crew",
               "job": "CG Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a3545fc3a36829a4002dc8",
               "name": "Lei Zhang",
               "profile_path": null,
               "id": 1621454,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a3547f9251410a5f00247a",
               "name": "Michael Fournier",
               "profile_path": null,
               "id": 1637395,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a354969251412769001e5a",
               "name": "Martin November",
               "profile_path": null,
               "id": 1398958,
               "department": "Visual Effects",
               "job": "VFX Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a354af9251410d2c002610",
               "name": "Bryan Hirota",
               "profile_path": null,
               "id": 1413508,
               "department": "Visual Effects",
               "job": "VFX Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a35640c3a3683fa700283c",
               "name": "Joel Whist",
               "profile_path": null,
               "id": 1378701,
               "department": "Visual Effects",
               "job": "Special Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "57a35781c3a36829a4002f0b",
               "name": "John Clothier",
               "profile_path": null,
               "id": 1394974,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "57a35795c3a3683f570023b7",
               "name": "Kevin D. Hewitt",
               "profile_path": null,
               "id": 1399875,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "57a357a7c3a3683f9700218c",
               "name": "William R. Dalgleish",
               "profile_path": null,
               "id": 1661417,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "57a357d29251410ca800258d",
               "name": "Jim Grce",
               "profile_path": null,
               "id": 1661418,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "57a357f49251410cd20024b0",
               "name": "Roger Meilink",
               "profile_path": null,
               "id": 1428208,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "57a358079251416b9700589c",
               "name": "Bob Gomez",
               "profile_path": null,
               "id": 1661419,
               "department": "Lighting",
               "job": "Rigging Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "57a358989251417c570029ed",
               "name": "Brian Heller",
               "profile_path": null,
               "id": 1406780,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 2,
               "credit_id": "57a358c6c3a36829a4002f97",
               "name": "David B. Nowell",
               "profile_path": null,
               "id": 1403415,
               "department": "Camera",
               "job": "Helicopter Camera"
            },
            {
               "gender": 0,
               "credit_id": "57a358fa9251412769002030",
               "name": "Ian Seabrook",
               "profile_path": null,
               "id": 1399068,
               "department": "Camera",
               "job": "Underwater Camera"
            },
            {
               "gender": 0,
               "credit_id": "57a35912c3a3682fa70065aa",
               "name": "Clay Enos",
               "profile_path": null,
               "id": 1394767,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 0,
               "credit_id": "57a35a829251410cd2002587",
               "name": "Geoff George",
               "profile_path": null,
               "id": 1483635,
               "department": "Camera",
               "job": "Additional Camera"
            },
            {
               "gender": 0,
               "credit_id": "57a35a9fc3a3686c4a005dad",
               "name": "Andy Leo",
               "profile_path": null,
               "id": 1661421,
               "department": "Camera",
               "job": "Additional Camera"
            },
            {
               "gender": 0,
               "credit_id": "57a35b709251410d2c002899",
               "name": "Kristin Berge",
               "profile_path": null,
               "id": 1547221,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "57a35ba1c3a3683f970022dc",
               "name": "Jules Holdren",
               "profile_path": null,
               "id": 1403389,
               "department": "Costume & Make-Up",
               "job": "Key Hair Stylist"
            },
            {
               "gender": 1,
               "credit_id": "57a35bbdc3a3683f57002501",
               "name": "Victoria Down",
               "profile_path": null,
               "id": 112656,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 2,
               "credit_id": "57a35bd79251410c7d0025d2",
               "name": "Richard Redlefsen",
               "profile_path": null,
               "id": 66693,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "57a35c00c3a3682fa70066ae",
               "name": "Kate Biscoe",
               "profile_path": null,
               "id": 229801,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "57a35c67c3a3683f9700231b",
               "name": "Annie Johnson",
               "profile_path": null,
               "id": 1569322,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "57a35c84c3a3686c4a005e67",
               "name": "Stefan Sonnenfeld",
               "profile_path": null,
               "id": 62723,
               "department": "Editing",
               "job": "Digital Intermediate"
            },
            {
               "gender": 0,
               "credit_id": "57a35ce1c3a3683f97002346",
               "name": "Warren Paeff",
               "profile_path": null,
               "id": 1661423,
               "department": "Editing",
               "job": "First Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a35de49251410a5f002805",
               "name": "Thomas Whiting",
               "profile_path": null,
               "id": 1409270,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 0,
               "credit_id": "57a35df6c3a36832b8006c5d",
               "name": "Margit Pfeiffer",
               "profile_path": null,
               "id": 1352968,
               "department": "Sound",
               "job": "ADR & Dubbing"
            },
            {
               "gender": 2,
               "credit_id": "57a35e0ec3a3683f970023a4",
               "name": "Daniel Saxlid",
               "profile_path": null,
               "id": 1399862,
               "department": "Editing",
               "job": "Dialogue Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a35e5ec3a3683f57002634",
               "name": "Rick Owens",
               "profile_path": null,
               "id": 1367362,
               "department": "Sound",
               "job": "Foley"
            },
            {
               "gender": 2,
               "credit_id": "57a35e729251410ca80027e3",
               "name": "Chuck Michael",
               "profile_path": null,
               "id": 113075,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "57a35e859251416b97005ade",
               "name": "Jussi Tegelman",
               "profile_path": null,
               "id": 65937,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 2,
               "credit_id": "57a35ea7c3a3683fa7002bb4",
               "name": "David Grimaldi",
               "profile_path": null,
               "id": 113051,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 0,
               "credit_id": "57a35eda9251410c7d0026c9",
               "name": "Chris Jenkins",
               "profile_path": null,
               "id": 1368864,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "57a35ef49251410ca8002802",
               "name": "Michael Keller",
               "profile_path": null,
               "id": 158916,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 2,
               "credit_id": "57a35f0a9251416b97005af6",
               "name": "Scott Hecker",
               "profile_path": null,
               "id": 15226,
               "department": "Sound",
               "job": "Supervising Sound Editor"
            },
            {
               "gender": 2,
               "credit_id": "58a085b7c3a368030e007985",
               "name": "David Wallace Allen",
               "profile_path": null,
               "id": 1439088,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58d171a79251411ae800e098",
               "name": "Carlos Castillon",
               "profile_path": null,
               "id": 1781335,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 0,
               "credit_id": "58d171b69251411ae800e0a6",
               "name": "Jason Fields",
               "profile_path": null,
               "id": 1781336,
               "department": "Editing",
               "job": "Assistant Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a13dcedc3a3684f0e00258c",
               "name": "Wayne Dalglish",
               "profile_path": "/qPD5xOssHAEis6u7XgMj0X7pdOX.jpg",
               "id": 1226495,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 75.710253,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 209112,
      "vote_count": 9075,
      "budget": 250000000,
      "overview": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
      "similar": [
         272,
         1924,
         1452,
         364,
         155,
         8536,
         9531,
         40662,
         13640,
         414,
         49521,
         49026,
         281957,
         297762,
         141052,
         30061,
         382322,
         287947,
         251519,
         14011
      ],
      "original_title": "Batman v Superman: Dawn of Justice",
      "runtime": 151,
      "poster_path": "/cGOPbv9wA5gEejkUN892JrveARt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/wzKxIeQKlMP0y5CaAw25MD6EQmf.png",
            "name": "RatPac-Dune Entertainment",
            "id": 41624,
            "origin_country": "US"
         },
         {
            "logo_path": "/z7H707qUWigbjHnJDMfj6QITEpb.png",
            "name": "Atlas Entertainment",
            "id": 507,
            "origin_country": "US"
         },
         {
            "logo_path": "/52KPK803bVjzhQKTjvXXZOfUCpU.png",
            "name": "Cruel & Unusual Films",
            "id": 9995,
            "origin_country": "US"
         },
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Comics",
            "id": 429,
            "origin_country": "US"
         },
         {
            "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
            "name": "DC Entertainment",
            "id": 9993,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "2016-03-23",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/csERw2A3XIsGegkzil6UGpyhqfw.jpg",
         "name": "Man of Steel Collection",
         "id": 209131,
         "poster_path": "/rNnIW6xSPeTiIUtsfEhFeIRiJVv.jpg"
      },
      "tagline": "Justice or revenge",
      "adult": false,
      "homepage": "http://www.batmanvsupermandawnofjustice.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Zack Snyder"],
      "runtime": 151,
      "synopsis": "Eighteen months after the destructive battle in Metropolis (Man of Steel), Superman has become a controversial figure. Billionaire Bruce Wayne, who has covertly operated in Gotham City as vigilante Batman for nearly two decades, blames Superman for the mass casualties that resulted from his fight with General Zod. Superman, in his public identity as Daily Planet journalist Clark Kent, sees Batman as dangerous and seeks to expose him. LexCorp's mogul Lex Luthor also sees Superman as a threat and convinces Senator June Finch to help him recover kryptonite from Zod's failed terraforming attempt in the Indian Ocean. Finch later stonewalls Luthor's efforts to use Zod's DNA and the Kryptonian scout ship recovered from the battle to create a biological weapon. Wayne successfully infiltrates a fundraiser promoted by Luthor to retrieve data from LexCorp's mainframe, but his flash drive is stolen by mysterious antiques dealer Diana Prince, who learns that Luthor has files on several \"metahumans\"; beings with superhuman abilities; herself, as well as a man with superhuman speed (Flash), a cybernetic body (Cyborg), and a man that lives underwater (Aquaman). Wayne later receives the drive back from her after she copies it. While decrypting the drive, he has a vision of a dystopian future where, while armed with a pistol, he leads a force of rebels against Superman. Batman is captured and held prisoner by Superman's army. Superman approaches him, rips off his cowl and tells him he took everything from him. Superman then rips out Batman's heart. Wayne is snapped out of the vision by a mysterious time traveler, who warns him that Lois Lane has a crucial role to an impending threat, and that he must find the others. Before he vanishes, the time traveler yells that he's \"too soon\" with his message. He later learns not only of Luthor's experiments with kryptonite, but also his ongoing investigation about metahumans including Prince herself, who is an immortal warrior. Batman attempts to retrieve Luthor's kryptonite in the Batmobile, but is intercepted by Superman, who orders him to cease his activities. Later, Finch summons Superman to a Congressional hearing at the U.S. Capitol to debate the validity of his actions. Using a man who was paralyzed by Superman's battle with Zod in Metropolis, Luthor masterminds a bombing that kills dozens of people by hiding the bomb in the man's wheelchair. Everyone in the chamber is killed, including Finch. Despite being seen carrying the injured out of the blast-zone, the public blames the bombing on Superman, who goes into self-imposed exile. Batman retrieves the kryptonite and prepares to launch a strike against Superman; building a powerful exoskeleton and kryptonite-powered arsenal. With Batman now having the kryptonite, Luthor activates the Genesis Chamber aboard the scout ship and splices his own DNA and Zod's. Luthor endangers Lois to lure Superman to LexCorp Tower, where he reveals that he has been aware of Superman's secrets for some time. Luthor blackmails Superman into confronting Batman by holding his adoptive mother, Martha Kent, hostage at an undisclosed location, anticipating that Batman would kill Superman with his kryptonite. Superman tries to reason with Batman, revealing that he knows his secrets, but leads to a fight in which Batman nearly kills Superman with a spear he'd fashioned from the kryptonite. Superman pleads for Batman to \"save Martha\", which was also the latter's late mother's name, causing him to come to his senses and realize Superman is not a threat. Upon learning of Luthor's plan, Batman leaves to rescue Martha while Superman confronts Luthor, who unleashes a monstrous artificially bred creature (Doomsday) made with Kryptonian technology on the crashed ship. Superman and Batman join forces to fight him and are aided by an arriving Prince in her Amazonian attire, but are outmatched due to the creature's ability to absorb and redirect energy. Realizing that their shared Kryptonian DNA results in shared vulnerabilities, Superman retrieves the kryptonite spear and impales the creature with it, while the creature stabs Superman with his bone protrusions, seemingly killing him. Luthor is arrested after Lane exposes his numerous crimes; when he is visited by Batman in prison, he gloats that Superman's death has made the world vulnerable to powerful threats, of which he was taught about while manipulating the Kryptonian ship's technology. Batman threatens Luthor, and promises that he will always be watching him. A memorial is held for Superman in Metropolis, and as Clark is also declared dead. Wayne, Lane, Martha, and Prince attend a private funeral for Clark in Smallville. Martha passes an envelope to Lane, which contains an engagement ring from Clark. After the funeral, Wayne reveals to Prince that he plans to form a team (the Justice League) from Luthor's file subjects to protect the world in Superman's absence. Later, a faint heartbeat begins echoing from Clark's grave and the dirt around it begins to levitate",
      "writers": [
         "Chris Terrio",
         "David S. Goyer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt2975590/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYThjYzcyYzItNTVjNy00NDk0LTgwMWQtYjMwNmNlNWJhMzMyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Ben Affleck",
         "Henry Cavill",
         "Amy Adams"
      ],
      "reviews": [
         "This was a very frustrating movie. I had been looking forward to it, although was initially skeptical after hearing of Ben Affleck as Batman. Seeing the critics views at RottenTomatoes was very discouraging, but for some reason, IMDb showed favorable reviews by audiences. This gave me some hope. That hope was in vain. This movie was all over the place. I'm quite familiar with the DC Universe, having been an on/off comics collector since the 70's. Even so, I found myself unable to keep up with the visions, dream sequences, time-travel visits(?), and just overall plot convolutions in this movie. Some IMDb reviewers have already done an excellent job highlighting the film's foibles, and I doubt I could do better. However, I gotta say something. The casting of Jessie Eisenberg as Lex Luthor was horrible, to the extent that Affleck as Batman warmed my heart in comparison (and I didn't much care for that). Luthor as crazy, essentially a retread of what we've seen as Heath Ledger as Joker, would have alone ruined the movie if that were the only bad thing about it. LL is a brilliant, evil, power hungry genius, not... whatever he was supposed to be here. I cannot get into Batman's motivation. He's a ruthless violent vigilante who's above the law, and he despises Superman for being... above the law. I get the initial distrust thing, but I didn't buy into the whole picture of just wanting to be judge, jury, and executioner without even interacting with Supes first. Not cool, Bats. Lex lets himself into the Kryptonian vessel, with the shaved fingertips of Zod? Kryptonian tech has *terrible* security; maybe they should give Apple a call - no, wait; the FBI hacked that. And then the computer recognizes the carcass of Zod, and doesn't go, \"Hey, who are you? I thought *you* were Zod!\" - and then kill him. I know I was supposed to laugh or cheer when Batman tells Ma Kent, \"I'm a friend of your son's,\" but for me it was flat. 10 minutes ago, he wanted to kill him. On the way home, my wife and I were discussing the movie, with these observations and more. She asked me, \"Was there anything about the movie you liked?\" I thought real hard, and said, \"um... no. Sorry to have suggested it and make you watch it.\" And thus justifies my 1-Star review. I guess I kind of liked how Superman comported himself with dignity, and was reasonably well-acted by Cavill. But not enough to change my score. Hey, wasn't there also something about Wonder Woman in the movie? That quickly faded from memory.",
         "The clue was in the title all along and I just failed to see it. It's like the studio and creative minds behind this disaster were so stoked with the idea of having Superman and Batman fight each other, they couldn't have a coherent thought after to come up with any form of a story. So they let Zack Snyder make a movie to satisfy the 10 year old in him. Major spoilers ahead! I thought there were 3 very strong, compelling ideas from the trailers, but the movie failed to delivery on them 1. Batman's aggression towards Superman. 3/4th of this movie is dedicated to this. In fact Batman wants to KILL Superman. And finally, when the moment arrives, Batman stops because his mother's first name is the same as Superman's mother's. And so they become the best of friends. Just like that. 2. People of earth's distrust of Superman, due to the events from the first movie. This too runs through most of the movie, with Superman trying to earn some brownie points by saving a few people. The fact that there is a public hearing against him, indicates that people are not buying it. But in the end, after his supposed death, why does he a get a military/hero style funeral? Why is the country mourning? Did I miss something? Especially since there is confusion on what happened during the hearing. 3. The public hearing: This should have been a really powerful scene. If Superman were to concede, then he'd be answerable to the people and he would not get to be the hero we know he is. The same, if he did not concede. I was giddy with anticipation when this scene started and was immensely disappointed when the Senator starts mumbling. Zack Snyder took the path of least resistance. - - - - - I guess after the writer's gave up on the main ideas, they didn't care about smaller plot points Superman has no remorse for the destruction he caused in the first movie. In the big fight he smashes Batman through a building causing the building to collapse. Ditto for Doomsday, smashes him in to a power plant of some sort. He is not even thinking about anyone's safety. Just like in the first movie, there is an apocalypse level destruction. Superman himself contributes to some of it. Thousands are probably killed, but superman only saves Lois Lane Superman threatens Batman that he can easily kill Batman, twice. Sounds like a bully to me Batman STEALING from Lex Luthor so HE gets to exact revenge on Superman Batman uses guns, not to intimidate, but actually kill. He even dreams of gun battles. The govt. has Zod's body and the ship for 2 years. Luthor comes up with the idea that since the ship has a bio-metric security, he can use Zod's body to gain access. It did not cross anyone else's mind One alien craft/tech is lying in the Indian Ocean for 2 years. No nation/military has claimed it. Local fishermen are freely swimming to it and breaking away pieces The all powerful Kryptonian key has no security what so ever. Anyone can use it. Even Lex Luthor. It only unlocks EVERYTHING, why should it be secure? Kryptonians have banned the technology to create Doomsday. It's so dangerous, they decide not to remove it from the system but keep it, with so minimum security that it can be enabled with a simple voice command by a non-Kryptonian. There is no compelling reason behind Lex Luthor's hatred towards Superman. How does he stand to gain or lose? There is no villain, purpose, motive or problem to solve in the story. Doomsday appears so that Zack Snyder can once again have a city-leveling battle. Why is Doomsday angry with Superman? Since he is made from Zod & Luthor's genes, does anger/hatred towards someone pass through genes? When Batman steals the Kryptonite, it would have spoiled whatever Luthor had planned, but Luthor just eggs Superman to fight Batman like they were in cahoots. How does Luthor know what Batman has planned? How does he know about the battle royale. Has he read the comic? Why is Batman not suspicious of the other meta beings? Why does he think they are friendly and will help? And against what? Why does he think he will need their help? How come Luthor is in on this? Why does Luthor have well designed logos for each meta human? Why was wonder woman so concerned with being exposed? According to the photo, she had already revealed herself, in FULL COSTUME. So why the secrecy? And why come out of hiding when she sees lightening coming from the dome? She did not feel the need when world was practically getting destroyed in the first movie. Why does Luthor introduce Bruce Wayne and Clark Kent to each other? BW is a billionaire, but CK? Why would anyone care about him? Superman stops the car chase. Literally allowing the bad guys to escape. He may not like Batman's methods, but he couldn't figure out if Batman's giving a chase, he's after bad guys?! In the midst of deafening destruction Superman can hear Lois Lane. But his mother...his hearing, speed, x-ray vision...he doesn't even give it a shot. And of course Batman finds her in a jiffy because he is... ... the list goes on...but IMDb has a word limit... I can't believe such a high profile movie had no thought put behind it. Amateur hour. A total disservice to a 75 year legacy and to the fans. I hope the remaining DC movies are scrapped or they finally pulls their socks up.",
         "Well, the wait is finally over. Batman and Superman are in a big screen film together for the first time in history. The result? A sloppy attempt at setting up the DC Universe. Batman v Superman has its moments though with great performances from almost every one and action that could rival Man of Steel, but it was difficult to not walk out of this film and feel overwhelmingly disappointed. For a film that finished filming over a year ago, you would think Zack Snyder and Warner Bros would make all the effort in the world to edit in and out the stuff that's important and tighten the movie, but that isn't the case. It's directed by the aforementioned Snyder and stars almost the entire Man of Steel cast along with Ben Affleck and Jeremy Irons as Batman and Alfred respectively. The performances are mostly great all around, including Amy Adams, who unfortunately felt out of place for most of the film. I have no problem with Adams' portrayal or the character of Lois Lane being in the film, but she was misused and overused here. She and General Swanwick from the first film have several small scenes that are used for us to find out more about Lex Luthor. But the problem is, it's a good 15 minutes of the film that could have shaved down to 3 or 4 minutes worth of scenes. Speaking of Lex Luthor, the casting of Jesse Eisenberg caused a big stew of controversy when it was first announced, and I think it was warranted. I've seen the film twice now and had different opinions both times. The first time I was entertained by Lex but also confused as to why they went the route they did with the character. The second time, I was annoyed by the performance and the over the top portrayal of what should be a menacing villain. A few scenes here and there had those classic Luthor aspects that I've loved from the animated series and films, but the tone they went with for Eisenberg's performance just doesn't work. There's little humor in an incredibly dark film, and Lex seems like he's from a completely different film. The other big problem the film unfortunately has is its title and marketing. Most of the marketing material was well done and proposed \"the greatest gladiator match in the history of man\", but the reality is that it's merely 10 minutes of a 2 and a half hour film. The fight itself is phenomenal. It doesn't hold a candle to the fight in the comic book/film \"The Dark Knight Returns\", but it's probably the best part of Batman v Superman. The focus was all over the place though. Everything from the fight onto the ending is good cinema, but man does it take a long time to get there. I actually sat in the theater saying to myself \"I'm kind of bored right now\". How in the world does that happen in a superhero film, let alone a Batman film? There are still plenty of great aspects to this film, however. Diane Lane has a few heart-warming and gut-wrenching scenes. Laurence Fishburne provides some good comic relief as the head of the Daily Planet, Perry White. Jeremy Irons gives us our most involved and bada** Alfred to date. Even Gal Gadot, another questionable casting choice, showed acting chops that I didn't think she had here and got me excited for the Wonder Woman film next year. Which brings me to the weirdest part about my feelings about this film. As many problems as there are, it didn't get me any less enthused for the future of the DCEU. Some few surprises in the film, tease Justice League which was neat. And I'm incredibly stoked for Ben Affleck's solo Batman film. With that said, I don't think I can get that excited for Justice League if Snyder still directs. I have to believe many of the directing and editing mistakes came from him. But perhaps even Warner Bros themselves needs to take some of the fault for giving Snyder too much reign? Another positive though was Hans Zimmer's score, unsurprisingly. I loved the way him and Junkie XL managed to weave in Superman's theme with the new haunting Batman theme. Ben Affleck may very well be the definitive Batman. Everyone knew his Bruce Wayne would be great but his Batman does not disappoint. There are scenes which rival the action in the Arkham video games in terms of style, creativity, and fluidity. I couldn't be more excited for Affleck to write, direct, and star in the solo film whenever it may come out. I honestly can't believe I'm sitting here typing an average review for a film that's one of my most anticipated of all time, but I am. There are plenty moments of pure greatness here, but for every incredible scene, there's an unnecessary or strange scene out of place. Sure, I enjoyed the film more the second time I saw it, but I just can't believe how sloppy of a filmmaking job this was. A missed opportunity for Warner Bros for sure. +Affleck +Action +Last 40 minutes are awesome +Zimmer's score +Performances -Except for the tonally off performance by Eisenberg -Sloppy editing -Slow and almost boring first half 7.2/10",
         "Sadly, a step down from Man of Steel. First of all, I was a bit skeptical about this movie, and thought the runtime (about 2 and a half hours) was way too long (and I wasn't completely wrong though). The action scenes were better than what we saw in the trailer. Although the doomsday scenes had terrible CGI (you'll know it when you'll see it), but overall I was happy. The movie had a lot crazy-packed action (it was directed by Zack Snyder, what do ya expect?) but the plot didn't know where it was going. A lot of scenes were a treat for me to see and I got goosebumps watching them. There was more to Jesse Eisenberg than what I saw (and hated, like most people) in the trailer. I made a bet to my friend that he'll suck in the movie, guess I'll have to pay up. He really WAS good. But just like any other movie, it's not perfect and has flaws. You can see that Zack tried hard very hard to fit everything nicely into the movie, but over stuffing was bound to happen. Other than that, I think there are some fan-boys who'll be satisfied no matter how bad the movie is. Hope my review didn't give away any spoilers in any way whatsoever, and that you end up enjoying the movie as much as (or more than) I did.",
         "Just as with every previous film, Snyder's grandiose visuals supersede and essentially suffocate any opportunities for intriguing plot, character development, or anything beyond CGI extravagance. The film presented too much and not enough simultaneously. The visual effects, dream sequences, and other traditional tropes of an action drama stood in the way of getting to know or care much about what is going on in this \"universe.\" PROS - Ben Affleck was a decent Bruce Wayne / Batman. - Henry Cavill remains a solid choice for Superman. - Aqua Man was barely shown. - Diane Lane, Laurence Fishburn, and Jeremy Irons were all solid in their minor roles. - If you're into special effects, you'll probably enjoy the absurd amount showcased in this film. CONS - Jesse Eisenberg - Snyder apparently forgot that Batman does NOT kill people - The \"battle\" between Batman and Superman lasted approximately five minutes of the 151 minute run time. - Batman's origin story is repeated and used to accent a major point within the film. - Far too much focus on Lois Lane (three heroes and she still shows up and plays a role in nearly every major battle sequence) - Lack of story and character development - Various plot holes - Ad naseum... This is likely the last superhero film I will waste my time viewing, as the superhero \"team\" concept is already abysmal. Showcasing numerous heroes / super humans in one film takes away from the development, and therefore, the connection to the hero. \"Oh well\" says Hollywood; we're still making a killing!",
         "Let's be honest! We were all, even marvel fan boys, waiting for this movie. The two most well known superheroes fighting... what could go wrong!? A lot. The positives: 1. Batman & Alfred; Batfleck was amazing! Ben Affleck represented a batman that is damaged, changed his moral code(which if they play their cards right could be a center piece of solo batman films) and made him more bad-ass because of it. 2. The action: Amazing Action! It's thrilling, exciting and beautifully shot. That is what Zack does though and I expected nothing less. 3. Wonder woman: Supringsly well done. Her as Diana prince was maybe a bit stiff sometimes but she can make the character her own along the way. I trust her that much. Her as wonder woman was amazing!! I got chills when she joined the fight! 4. Cinematography is general. It is a beautiful film to look at. Nicely shot and as I said the action is amazing. The CGI in certain places are a bit \"meh\" and one shot did take me out of the movie, but that's it. Now the bad stuff why this movie went downhill: 1. the editing/pacing: Guys, this movie was a mess. The movie begins great with an introduction of batman and some stuff you saw in the trailer. Then we go to a scene... which tells us a story then it goes to another scene. You're invested in that particular and then it jump cuts to another scene. You are seeing 4 different story lines play out in 5 minute scenes after each other. As a general movie goer-ER you will lose track. As a DC-fan, as myself, I could understand everything but i needed to bring all my previous knowledge to actually understand. Really bad pacing 2. Superman: Not everyone will agree on this, but I think they handled superman horribly. He needs to be symbol of hope and yet he is never exactly that. There was certain montage, where it should shown that he was, but i never felt that he was. This representation was too dark. This was also more of a batman movie with superman playing a small part in that, yet batman's world is too dark for superman. If you want to combine their worlds, let Batman play a role in superman's world. 3. Lex Luther. I hated his representation of the power hungry and menacing villain. He played mark suckable and was a complete miscast. I don't care if he was the son of the \"real\" lex Luther. It didn't fit. 4. Doomsday: A complete waste of a great story arc. Why did they bring him in while there was so much going on.. 5. The justice league set up: It felt rushed. The way they shoehorned all the other characters in was lazy writing. 6. the whole motivation of superman fighting batman. batman's motivation was clear and great. Superman's was horrible. They were one conversation away from understanding each other, but they had to fight of course. 7. Many many plot holes, but i cant go into those because i don't wanna spoil the whole movie. verdict: If you love flashy action.. go watch it in Max. If you like great story.. wait till it releases on blue-ray. 6 out of 10 for a mediocre movie that should been an epic man. I was so disappointed. I see so many DC fans raging this movie was epic, but we're dealing with the phantom menace effect.",
         "This movie tries so hard... and falls flat on almost every level. It is further proof that DC may be a master of the animated movie and they may be brilliant in the way they approach many of the TV properties but when it comes to movies they still can't pull it together. This is a long movie that feels even longer. Ben Affleck does a GREAT job as Batman, that doesn't mean I LOVED this Batman (I did not) but he does a great job and any problems there are with the character fall on the writer, producers and director. The problem with this Batman is no that he is brutish and violent and angry.. it's that he's not smart. He's not strategic and intellectual , brilliant and a world class detective. He is consumed by anger, hatred, vengeance and brutality (and not in a good way). He is blind in his rage and directs it towards Superman. The ending, which should be amazing and outstanding fell flat in both viewings I went to. One a sneak peek and one to which I had purchased tickets on opening night and went to see with friends. The ending should be exciting and fun and amazing.. and it just... wasn't. It completely fails on every single level. You should leave the theater with your mouth wide open from awe unable to withstand the anticipation of the next chapter... most people who were leaving the theater were tired, worn down and felt like they had gone a few rounds with Superman. The movie is tedious and boring with characters that I just did not care about at all. Oh no Louis is in trouble... oh look Batman is Angry, oh look Superman is Angry, oh my Martha is Angry. The problem with a bunch of characters who are essentially the same in attitude is that you just don't care. The preview of the justice league, which people know is coming was forced as is but would have made a magnificent after credit sequence. It would have at least of given people something to talk about on the way out rather then just shaking their heads in disappointment or yawning. I liked Man of Steel, I didn't love it but I liked it. This was no where near as good. While I have been a long , long time DC fan and unlike many fan boys have little problem with taking some creative liberties with characters (there are things that work well in years of comics that don't translate on screen), there are things that should evolve but not completely change. Doomsday was sadly, a disaster. In the comic he is a Goliath , matching Superman's physical might and that's pretty much it. His punches are so powerful they shatter buildings (which Snyder seems to really, really, really like to do).. there was no need to alter him to the point they did. This movie would have been better served had Lex made a clone from Zod's body of Bizarro (makes more sense) and had it been only Batman and Superman, getting to know one another, learning about each other, discovering their differences and ultimately their similarities as they came together in the end to defeat a Superman level menace. After the credits , an email to Wonder Woman with Batman letting her know that he has discovered who she is. You could even have had wonder woman in it, she was a delightful character (in this film) and I enjoyed her scenes (she gets little screen time but I felt was one of the best characters). As it is it just falls flat. I enjoyed one of the sequences with who I believe was the Flash (doesn't say) but I do wish it was Grant (CW) as he is the true flash. This movies wrongs can still be righted in the next one and I will likely see it when it arrives but I am not looking forward to it and have no real anticipation of it's arrival. If I got word it was canceled I would shrug my shoulders and hope they got it right next time around.",
         "This movie is such a let down, I watched a hour of this horrific peace of writing and cannot believe that they made such a stupid movie. The scenes were jumping from junk to more junk that made no sense. I absolutely love batman and superman and this movie is just insanely off what it should of been like... Good actors playing super popular parts but no story line what so ever. I was super confused throughout this whole movie. How is lex luthor not bald, and why is he being played by this quarky guy who should be like the riddler or something. I feel like I waisted a hour of my time watching this garbage and I would never put this in my top batman movie ever. Batman with Michael Keaton still rains supreme !",
         "SPOILER ALERT !!! (Funny how there can still be such a thing when the movie is already spoiled to begin with) This movie was marketed to patrons of all ages but only appeals to ages 12 or younger. My top 8 reasons (in no discernible order) to avoid seeing this movie and save 2 1/2 hours of your life...Don't do it! 1. Amy Adams/ Lois Lane - Wow! what a terribly written part for this character...Clueless and painfully unaffected by everything going on around her... I speak for all true Superman fans when I say, Margot Kidder, eat your heart out baby! 2. The opening sequence - Bat boy Bruce Wayne sees his parents killed at gunpoint....AGAIN! Why must we always have to be spoon-fed the origin of this character in every damn movie. The psychotic flashbacks from his past will likely be thrown in later on in the movie and can allude to the dark knights brooding demeanor just fine, thank you. 3, Zack (rhymes with HACK!) Snyder/ The Director - The slow motion scenes used in this movie are such a desperate contrivance. His signature trademark only lends to extending the run time of the movie (ad-nauseum) and slows the pacing down (or lack thereof) to a complete stand still at times. There's slo mo used during the funeral scene...'NUFF SAID! 4. Confusion - Early scenes will attempt to confuse the viewer (successfully) in order to tie together several gaping plot holes (unsuccessfully). The problem here is you can see these outcomes coming a mile away. The viewer is left feeling patronized and a lack of a decent script becomes evident, as a result. 5. Jeremy Irons/ Alfred the butler - Holy cow man! This guy has been mailing it in for the better part of 2 decades (since Die Hard with a Vengeance). It seems the studio financiers felt the need to strengthen the budget here by slashing the Morgan Freeman and Michael Caine salaries allowing the 2 characters to morph into one, contemptible performance by a British actor with some real acting \"chops\" 6. Jesse Eisenberg/ Lex Luthor - Wins the award for all time best over-acting a comic book villain since Willem Dafoe played the Green Goblin. After this heinous acting performance by Eisenberg, I am beginning to think Heath Ledger raised the bar too high for this new generation of Hollywood soft, pretentious pretty boy actors. 7. THE MAIN PLOT OBLITERATED BY.... Their MOTHERS HAVE THE SAME FIRST NAME- 2 hours of very thin plot will be totally obliterated by Batman in a scene so horribly painful. The very premise from the start is Batman going after Superman. When the audience finally arrives at this crucial moment, The Batman is going to end The Superman and get what he so painfully wanted the whole time...AND what happens next? unfortunately it goes down like this, I kid you not! Superman says Martha!, his mothers name and Batman says WHAT! WHY did you say that name, Martha!, that's my moms name!, and then Superman says MARTHA! HEY! that's my moms name! and then they cry and hug each other and become best of friends the rest of the movie! 8. LAST BUT NOT LEAST - BEN AFFLECK/ BATMAN WOW WOW WOW ...Val Kilmer and George Clooney are breathing a collective sigh of relief after seeing this pile of steroid garbage take on the role of Batman. Yes after 2 long decades the monkey has been removed off of their backs...The worst possible Batman performance in history award can now be owned solely by Mr. Ben Affleck...Did anyone ever doubt him???",
         "(And yes, I've watched the extended edition in it's full 3 hour glory, the one that is supposed to fix things over from the theatrical cut). What a bloated, insipid, AAA bombast-fest of a movie. I get that we're trying to take liberties with these characters (now that they've already been done so many times, and quite recently too) and I get that we're trying to \"modernize\" the way we showcase them (being that they're well, children's stories). But most of the mistakes of this movie show that Snyder, Terrio and Goyer don't really understand these characters. Or basic narrative storytelling for that matter. Where to start? Characters are all underdeveloped and their arcs are non-existent. Plot is overly complex and convoluted, and while most of the points are skimmed over, barely addressed or explained in any way within the movie, what we do get are extended dream-like sequences that explore character motivations that don't make any sense in the first place, while succeeding in adding absolutely nothing to the story itself. The movie takes itself way too seriously and the dialogue in particular is pretentious and downright stupid at times - I actually made me go \"Wait, what?!\" at my screen for at least 5 times during the movie. There's barely any weight to the scenes, the way they flow and the narrative itself feels forced and artificial. Oh, and the plot. Batman goes on a dark path killing people and branding them with the fat bat logo for no reason. Superman spends the majority of the movie being mopey and depressed as a side effect to being invincible or something. The whole premise of the movie is just a big stupid misunderstanding between the titular emo characters to get them to bash each other's faces. It could have been easily resolved by having them actually talk to each other rather than wandering around having \"intense scenes\" all over the place for most of the duration of the movie. But don't worry, the one thing that will bring our two heroes together in the end is the fact that their moms share the same name. (What a stupid, stupid scene). Too much CGI, too much future movie setups, too many real-life media personality cameos (Jon Stewart and Nancy Grace, really?) and too many things going on that aren't really important, even for a 3 hour movie. The soundtrack (Hans Zimmer, mind you) and fight choreography is also surprisingly bad for this budget level. As far as the actors go, Jesse Eisenberg is believable as an obnoxious cartoon psychopath, but he's no Lex Luthor. (Terrible, terrible casting choice.) Ben Affleck makes a half-decent fat psycho Batman (he's not this movie's biggest problem, by far). Henry Cavill is capable of so much more but his character is never used in any meaningful way. Gal Gadot is predictably gorgeous as Wonder Woman but I don't really understand how she got the part through that thick Israeli accent. Or, was that a deliberate choice, as part of her character background? I'm sure we'll find out in the incoming stand alone movies, no doubt. Please stop handing over the next DC Universe projects to Zack Snyder. Jesus, studio executives really have no idea, do they? (Allegedly they gave this movie a standing ovation on a private screening before launch.) I thought Man of Steel was surprisingly decent for it's reputation, but this is just stupid.",
         "I am drawn back to when this movie was first announced and how I despised the notion of a Batman V Superman film a la Freddy vs Jason, Alien vs Predator and so on. It all seemed like a huge gimmick to me and I expected the worst for this movie. Fast forward a couple years, I am sitting down at a private screening, the lights go down and the movies opens up. The opening sequence was not what I expected but shows Snyder's visual creativity in a similar manner as he did with the opening sequence of Watchmen. We are hearkened to the Black Zero Event, only we see it from Bruce Wayne's perspective as shown in some of the trailers. I love that Snyder uses Bruce's as the eyes of the audience to get an outside perspective of the surrounding madness and destruction, and he does it very effectively. You are mad at these beings, you feel the terror, the confusion the anger for them bringing there war here, it plays out with spectacle and sadness. I had reported a rumor about Scoot Macnairy's characters months back and was called out by Ocelot and others several times on things I reported, well turns out it was true. Something tragic happens at the hearing and it is our insight of how cunning and vicious this Lex Luthor is. The overall story is well woven and much better than MOS, you can definitely breathe a sigh of relief in that Terrio does a great job of crafting this all together. The movie is a visual tour de force as we have come to expect with Snyder but let me just say that his directing has also improved. For those who moaned about the shaky cam and muted colors, they will be pleased. Performance wise. EVERYONE does an outstanding job, the standouts to me were Affleck, Eissenberg and Gadot. I was not on the Ben, Gal, Jesse hate wagon, though I found Eissenberg's casting questionable but I felt he had shown that he has some capable range of pulling it off. Affleck is Bruce Wayne, Affleck is Batman, talk about casting redemption. Similar to Reynolds, GL>Deadpool. Affleck should no longer be bogged with complaints about Daredevil. For those that hated on Gadot, suck it, she owns the role in every way possible, she really has stepped up her acting game as well. The woman has presence as Diana, grace and beauty and as Wonder Woman, she is truly a Goddess. People were moaning about Gail's size, forget that nonsense, she proves she does not need bulking muscles to be a warrior and her fight scenes are exceptional, makes Faora look like she was waltzing. Eissenberg, well well well. Let me first say I thought the best versions of Luthor were from the Lois and Clark and Smalville TV shows but Jesse brings something totally new to the game. Jesse plays his Luthor like a true devil. He is deceiving, manipulative, conniving, that line the Devil will do it, he is referring to himself to me. I could not help but see him like a Lucifer in his role and wondered if Jesse kind of based playing his character that way. Everyone else support wise was absolutely great. I do not want to write a long report of praises so let me see if I can cap off before getting on my flight. The fight set up was a little weak but boy the pay off was spectacular. Cavill I feel needs to step up a little more, granted he was wonderful but he was out shined. He needs to get beyond that distraught expression that he likes to use because he does it to death in this and I found that annoying. The other member intro's were great and will have you all pumped for the JLA, the Knightmare scene was horrific and impactful and made me smile like a little geek. The final fight was amazing. Never in a CBM have we seen anything like it, yes I said it NEVER and lastly, I will say the movie does end on a heart wrenching note but a wink in the end. I loved it gave it a 9 and looking forward to seeing it again next week. If you guys have any questions ask I am going to be on a plane for the next 6-7 hours so will try to respond. I may have exaggerated about it being 10X better than MOS but I will say 5X better.",
         "A Batman who behaves likes a hissy teenage girl taking the fight to Superman because there's 'a 1% chance he will destroy earth' when he was shown up to be of not much use when a nuclear warhead was fired or when Doomsday was totaling the city; a Batman who was all set to write his legacy by killing Superman (who doesn't know for a fact if Aquaman and the lot are friend or foe) only to become his friend just like that even saying cringe worthy lines like 'Martha will not die tonight' and the even worse 'I will not fail him in death'... A Superman who could hear Alfred talking to Bruce Wayne at the party from miles away but couldn't tell that a bomb was ticking away less than 5metres away; a Superman who overdoes the love sick puppy bit stopping just short of tears (to an aging Amy Adams gawd); a Superman who gives Batman a face to face warning because that always works with foes (perceived or not)... A movie that has borrowed from James Bond (from Bruce Wayne's aging brooding looks that were probably set for 'smouldering' to the red herring L'Americain-White Portugese to 'key' action sequence linking back to a location from the earlier movie - former MI6 Building v Man of Steel destruction site - to the Aston Martin etc) and Avengers (nuclear warhead, enhanced Iron Man suit, dream sequences - gawd how many were there!?!) with a Jim Carrey/Riddler-like Lex Luther but in an infinitely more annoying Jesse Eisenberg... Actually, 2 out of 10 may be too much for making us suffer two and half hours of a self-important drama but seeing how Warner Bros seems to have bought sooo many 10/10 reviews here, it's about right. Only Gal Gadot looked like she was having fun albeit her brief appearance and therefore, she should be declared the rightful winner of Batman v Superman.",
         "This film was a long drawn out tedious dismal bore. Period. If that wasn't bad enough, the beloved character of Superman is completely annihilated in a thoroughly insulting fashion. There are a lot of Zack Snyder fan boys worshiping this lackluster filmmaker of limited talent, and that's unfortunate. It's a monumental shame WB gave him the keys to any comic book hero film franchise at all, and I'm someone who actually thought \"Watchmen\" wasn't all that bad. People still love the characters of Batman, Superman, and Wonderwoman, but with that said, this is a movie that could have done close to Star Wars box office numbers. Instead, under the seriously flawed incompetent direction of a hack like Snyder, we got this mess. Even Michael Bay could have given the source material a desperately needed morsel of levity. All creative control should have been removed from Snyder, and this should have been a stand alone film under the direction of a much more talented and skilled filmmaker rebooting both Batman and Superman. That was yet another giant mistake by WB. This should never have been a followup to the much maligned and critically panned, \"Man of Steel\". In an effort to \"nolanize\" Superman, they allowed an inferior filmmaker compared to Christopher Nolan go completely off the rails with such a disconnected total misinterpretation of the Superman character to the extreme that it wasn't Superman. It would have made sense to have this be a followup if \"Man of Steel\" had been well-received like \"Batman Begins\". As the saying goes, fool me once WB shame on you. We were all fools to give them a second chance and pay money to see this poor excuse for what should have been an amazing film. The first two hours were a spectacular utter bore with subplots that were neither interesting enough to care about nor necessary. The character of Lex Luthor is an extremely intelligent criminal mastermind, not a socially awkward schizophrenic played by the miscast Jesse Eisenberg. The worst offense of this film is how Superman is killed off by an ill conceived CGI blob that was supposed to be Doomsday. Jimmy Olsen is shot and killed in the monotonous first half of the film in a scene that doesn't even identify who he is. He just appears out of nowhere. Holly Hunter's character is killed off. Laurence Fishburne's scenes could have been completely cut out. They added nothing to the story. If Snyder claims he actually does have reverence for these characters, I wouldn't want to see what he does with characters he doesn't. In fact, I don't want to see what he does with any other comic book character ever. Marvel will continue to dominate with their films over DC until massive changes are made. It's not rocket science. Like may other people who saw this film, I won't be paying to see \"Justice League\" as long as Hack Snyder and David Goyer have anything to do with it.",
         "I thought I had seen it all when it came to bad comic book movies - from the clumsiness of the Sam Raimi \"Spiderman\" films to the raging dumpster fire that is \"Batman & Robin\". Then I saw \"Batman v Superman: Dawn of Justice\" and got a rude awakening: I had no idea just how bad a movie in the caped avenger genre could be. I didn't know a movie of any kind could be this bad. Everything about \"Batman v. Superman\" is awful. The story is so busy and overstuffed with characters that, in the end, it's hard to remember what it's about. The fight scenes are bloody and loud without being exciting, mistaking violence and noise for thrills. Worst of all, it's no fun; there's not one single moment of excitement or adventure in two and a half very long hours. I walked out of the theater dazed and upset, as if I had just been mugged. This movie actually ruined my night. The plot is almost impossible to follow, let alone recap, but I'll try. Batman (Ben Affleck) and Superman (Henry Cavill) become enemies for reasons that are never clear. They reluctantly join forces after Lex Luthor (Jesse Eisenberg) unleashes a Kryptonite monster and threatens to kill Lois Lane (Amy Adams) if the two heroes don't fight each other, which will help him take over Gotham City... or something. And then Wonder Woman (Gal Gadot) shows up out of nowhere for a loud, bloody and utterly pointless climactic battle. Yes, this movie is confusing. Very confusing. But that's not even its biggest problem. The worst thing about this movie is that it's no fun at all. The pace is leaden, the \"realism\" is just boring - there's a scene with a Senate hearing on C-Span, for God's sake - and the characters look perfectly miserable to be there. Who could blame them? I have never seen comic book characters enjoy themselves less. Affleck and Cavill treat being a superhero as if it's a burden, not an adventure; they frown, grimace and speak with long, tortured pauses, as if they are playing the lead in a high school theater production of \"Hamlet\". Adams and Gadot aren't given a whole lot to do, but while they're doing it they manage to look as if they're waiting in line at the DMV. Even Eisenberg's giggly, hyperactive Lex Luthor smacks of desperation; he mugs for the camera like an ignored middle child acting out to get attention. A comic book movie without fun is the definition of failure. Comic books are not Greek tragedy. They are stories designed for children, and children at heart. It's in vogue these days to make \"dark and gritty\" superhero movies, and it can be done well, as in Christopher Nolan's \"Dark Knight\" trilogy. But those movies worked because they balanced darkness with excitement, grit with joy. They had the kind of magic that lets the 10-year-olds who live within even the most hardened adults out to play. There is no joy in \"Batman vs Superman\". It doesn't know what magic is. It's the only superhero movie I've ever seen that made me sad.",
         "Affleck as Bruce Wayne/Batman was pure awesome and dark. You can see he'straumatized by the events in the past, and he has some fantastic lines in general (Yes we see the whole parents thing again). Nobody should really be surprised that he was good withthe role considering he's a solid actor, but I thought he was great. Versus Bale? That's a interesting question, because Affleckdefinitely regards Batman as a permanent part of his persona, while in Nolan series he eventually doesn't want Batman. In combat he's pretty much everything everyone would hope for from a film with Batman. One comment on the latest BvS trailer said he fought like the Arkham video games from ascene they showed. That's a goodcomparison. He's incredible in fights. Also the way Snyder records him in action, you can actually see him fighting unlike the Nolan films, which I'd imagine would make many people happy. He alsogets a chance to use his detective skills, do not worry. Also his relationship with Irons, who plays Alfred,is just wonderful in general. Irons was exceptionalin the role(Its Jeremy Irons for Christ's sake, of course he nailed the role) gets some witty lines and also gets pretty emotional later on. He didn't get a lot of screen time, just enough to be effective. Always passing advice to Batman.",
         "This is, hands down, the worst piece of entertainment i have seen in my life! Forget about coherence, forget about story, forget about humor, you find non in this junkyard. Batman vs Superman is about two wannabe bodybuilders who try to build up a heated and involuntarily gay atmosphere in 2.5 hours only to fight for 4 min with CGI rubble flying around. It is Brokeback Mountain meets Crossfitt commercial. Poor Ben Afleck never looked dumber! I am trying hard to find anything positive with this movie but it is really really hard. download this masterpiece,see 5 min and turn it off. Go do something nice with your buck! P.s. Avengers was crappy in its own right but this one takes the word to a new height! P.P.s If your looking at the user review section to see a better feel for what people think of the movie, just beware of the fact that warner brothers hires people to make thousands of fake accounts to score this movie 10/10 to raise the overall score.",
         "Worst movie ever made, by far. There is nothing, or hardly anything that makes much of any sense, scenes follow each other without there being any way of linking them together and little to no consistency. Everything seems to be happening randomly and for no other reason than the directors whim. The movie starts with what seems to be an on-going invasion of earth and then the narrative just jumps ahead in time, leaving you with a couple big unanswered questions. After that comes the desert scene. Now, if you want to be somewhat discreet as to your intentions, you (or in this case, Lex) don't give your troops super-secret type ammo that will short list the possible suspects, especially when you're trying to frame someone else. They should have had normal commercial type bullets. This is beyond me, since the framing does apparently work without any forensic analysis of the 'massacre' which would have yielded different conclusions. Then, both cases against Batman and Superman are so incredibly weak, flimsy and of purely tabloid like nature it doesn't make sense that anyone would actually fall for them, that it would take them so little time to question both/all superheroes. The thing with Batman's branding leading to murder, either he doesn't care or he wants it to happen. Either way, the one given any proper reason to attack the other is Superman, due to his adoptive mother being held captive, yet its Batman that leads the attack, for which reason we do not know. Probably an ego thing. For some reason he's looked up his roots and found that his ancestors were hunters and pelt traders, so he feels he must hunt down Superman (and sell his cape?). It wouldn't make any sense for one vigilante to question another's \"legality\" and \"moral sense\". And how Batman goes from investigating Lex Luthor to then wanting to go after Superman is beyond comprehension since its clear by then that Lex is up to no good. Lex Luthor apparently knows what Wonderwoman looks like, yet she manages to appear at his Gala without alarming Lex whatsoever, alarms should have been going on. She benefits from some form of anonymity, somehow. The scene where the courthouse explodes is again complete drivel. Lex Luthor is the only one missing from the room, yet he's miles away when the bomb goes off. Maybe I'm just dumb but that seems like a dead giveaway, but its never brought up, despite the name tag on his chair which would normally have raised suspicions. Despite there being Superman and Batman, its still left to a reporter (L. Lane) to do all the investigative work and find out the truth, even though Clark is also a reporter and Batman basically a super detective with a bat complex. When Batman says \"Men are brave.\" going on his anti-god rant it doesn't make much sense for him to then be fighting in full armored suit when he's managed to make Superman vulnerable, so \"Men are brave, but guys in Batsuits are cowards\"? And then he makes him bleed, wow(!), so deep and profound, bat-boy makes god-boy bleed, it made me question the very meaning of symbolism (irony). And to see all the animosity on Batman's behalf just disappear into thin air at the mere mention of his mother's first name, which also happens to be Superman's adoptive mother's name, is beyond ridiculous. Finally, Lex Luthor uses the alien ship as some kind of magical easy-bake-oven and bakes his own little monster out of a dead body (Zod) and his blood. Again, the deep symbolism is just blinding. It doesn't seem problematic that he is able to so easily just somehow take over command of the sentient ship, in a no-effort, stupidly linear way, he basically just says \"Yes, I do\", and ta-da, magic, he is the new alien overlord. The creature that the ship creates just resembles Tim Roth's attempt at becoming Hulk (2008 movie), just of a more explosive nature. The time it takes them to realize the kryptonite 'spear' is the only way to defeat it is almost instant, without creating some form of suspense in between. The ease with which movies make use of some faceless alien monsters as antagonists is increasingly annoying. It means they don't have to do any research on the character, create a story or reason for existing. Its like when video-games make use of them to avoid any political risk by having someone from a specific background / nationality as 'bad guy'. And of course, Wonderwoman appears out of nowhere, just in time to make use of her lasso so Superman can 'take one for the team'. Why Superman flies into the monster with the spear instead of stopping half way and just hurling it at him at full speed so can he keep a distance, is devoid of any reason (except to orchestrate his demise). Again with the ground-breaking symbolism, its the seemingly invincible one that doesn't make it. How they show development in Batmans character by having him not bat-brand Lex is so unnecessary it makes one want to cry. The editing was just incredibly terrible in how they put it together. I'd give this movie negative points if I could. A complete waste of viewer's time and its sad to see so many people actually liked it. It only reinforces the trend of putting recognizable actors, adding visual-effects and little to no effort on the actual plot and story.",
         "I don't get the movie at all. There is no clear story line. The whole movie is just a collage of unconnected scenes and fighting scenes. This movie exist only to show batman, superman and wonder woman in the same movie. Scenes often get confusing, one moment you are in Africa, the next scene you were elsewhere for no apparent reason and has no connection what so ever with the previous scene. First of all, what exactly warranted batman to go against superman, the whole reasons like visions, dreams etc doesn't seem to justify batman to want to kill superman. The story line is too forceful without realistic reasons to back it up. Whats the meaning for lex luthor to have those researches about people with seemingly super power. Another thing, if the kryptonite supposed to be that important why the hell did batman just left it without a second thought and why did batman stop his intention and all of a sudden decided to help superman just because superman said the word \"martha\". In the final battle against the made up common enemy, how did lois lane knew that they needed to find the kryptonite that batman left and suddenly just sprang to find it. Why was lex luthor arrested in the end? Since the only people who knew about his intentions are batman and superman. How did the government decided to arrest him and on what grounds? In conclusion, this movie is a 2.5 hrs long pile of mess.",
         "I've never seen a Superman movie. I never saw Man of Steel, I never saw Superman Returns, I never saw The Quest for Peace (thankfully), but I know enough about Superman's backstory to get a feel for the character. I absolutely love Batman, I've seen all of the 80/90s film and I love them all, with one obvious exception. After seeing a pretty impressive trailer for the film, I decided to head up to the local cinema to see the latest work of DC Comics, I really wish I hadn't bothered. I don't understand who looked at this script and said, \"yeah, that's a good idea\". Batman vs Superman for me was 150 minutes of guessing the plot, cringing at the horrible CGI, shaking my head at the terrible dialogue and waiting impatiently for that beautiful moment where the list of names began scrolling up on the screen. So, the big spectacle we all wanted to see, the rivalry between Batman and Superman, is only there because the name of the film is Batman vs. Superman. I have no idea exactly why these guys have a disliking of each other, but at some point within the first 15 minutes of the film Superman effectively says \"I'm gonna fight Batman\", 80 minutes later they fight, that's it. As well as this we have a ridiculous amount of other sub-plots that aren't even remotely coherent, such as a character called Diana Prince who we never learn anything about until the final 40 minutes at which point she turns into a main character, doing some kind of spy work which we never really learn about, we're just meant to accept that she's a spy doing secret things that we're not meant to care about. We also have Lex Luther who is trying to get his hands on some Kryptonite so he can do... something. I'm actually not sure, I think it has something to do with his dislike of Superman, which I don't understand because we're never given any clear explanation as to why he hates him, and then he decides to send Superman to kill Batman, for some other reason we're never given an answer too. For most of the film, every character goes on about how Superman is a menace and should be tried for what he has done, and the first scene of this film shows him killing a terrorist threatening Lois Lane's life in Africa. I'm honestly sure not many people would care about this death, but they keep going on about other things he has supposedly done that are never shown or even explained in the film, so what exactly did he do to make the world hate him so much? This film is meant to be a launch-pad movie for a new series of super-hero movies, and yet nothing is ever expanded on. What does Lex Luther's company actually do? What exactly is Wayne Industries? What happened in the 18 months between this film and Man of Steel? No-one ever bothers to answer these simple questions that could've been cleared up in a single line, which is irritating because we're supposed to care about this world that will be the base of a new universe. Lex Luther kidnaps Superman's mother and uses her as a threat to force him to fight Batman, this is where we get the long awaited fight between Batman and Superman, and it's OK, but it's nothing spectacular. It goes on for a while until Superman reveals his mother's name is Martha, and as Batman's mother's name is Martha they decide to become friends, you know, after knocking the hell out of each other. Batman goes to save Superman's mother, and Superman goes to stop Lex Luther, this is where we get a pretty awesome fight scene. Batman's attack on Lex Luther's guards is really cool, it's an exciting a fast paced scene that provides one of the few thrills of the film. Meanwhile, Superman confronts Lex Luther who retaliates by unleashing a giant freaking monster, what the hell? This monster comes out of nowhere just to extend the movie out for another 30 minutes. The monster itself looks absolutely dreadful, a horrible looking CGI creation that rips the awesome from the film. During this fight scene, Wonder Woman shows up out of absolutely nowhere to join the fight. At this point, I had lost the will to live, I just wanted the film to end. The action scenes here were mindless and uninteresting, and I couldn't care less about what was going to happen. As for the acting, Ben Affleck is great a Batman and Henry Cavill is brilliant as Superman so no complaints there, Amy Adams makes the best of Lois Lane and Jesse Eisenberg is superbly crazy as Lex Luther, at least we have a good cast. I think I'll just sum up here. Batman vs. Superman is a mess, a mess on every creative level, which is a shame because trailers made this film look really good, I saw the first trailer for this film in the previews for 10 Cloverfield Lane, and it looked awesome, when I saw the film, I just didn't understand what the hell the aim of this film was. The plot was incoherent, it was far too long, there was never any consistency with the narrative, it just didn't work. Batman vs. Superman is one of DC Comics biggest failures, and a big misstep for the start of this new series. There's 150 Minutes of my life I'll never get back!",
         "I'm sick of reading apologetic reviews for this film of the \"If you can just get through the bad stuff, the rest of it is AMAZING\" ilk. We shouldn't have to endure dialogue this bad, acting this awful and plotting this lazy to get to the good stuff. Let's take a few examples: Cavill has zero chemistry with Adams. None. The scene where he leaps into the bath with her is so awkward it's embarrassing. And why is Amy Adams in the bath anyway? It's hardly a playful scene - she's talking about death and responsibility. I can only think it's played that way for \"Phwoar! Amy Adams in the bath!\" reasons. People in this film don't \"do\" motivation. Superman turns on Batman for being a vigilante above the law. Which he is too. The public turns on Superman because of crimes they KNOW were committed by other people. Lex turns on Superman because... well, I'm still not sure about that. Batman, the World's Greatest Detective - acts like an idiot for most of the film. Despite all evidence pointing at Lex, he allows himself to be manipulated into fighting Superman. Why didn't he use his detection skills on \"Who sent those notes?\" and \"Who blew up the Senator?\" and \"Hey, why does Lex want all that Kryptonite anyway?\" Batman is also kind of a sadist. No, I'm not complaining about the Bat-brand, I can live with that. But he takes his time toying with Superman. I'm not sure why. Again, motivation issues. I don't actually have a massive problem with Superman & Batman killing people. Although you have to admit, it makes you wonder how Lex & The Joker are still alive. But this movie doesn't care about plot holes. I believe there's actually a plot \"black hole\" at the centre of this film, sucking in all logic. Mmm! I'm not sure I can entirely blame - mmm! - Jesse Eisenberg for Lex. I mean how can you deliver lines as embarrassingly bad as these without sounding like a complete idiot? Yet no character in the film ever comments on the fact that he acts like the guy on the bus you see muttering to himself. It can't be his wealth. I know Lex is a billionaire, but then again so is Donald Drumpf and people call him crazy all the time. Plus \"crazy\" isn't the same as \"scary\". There's no menace, no sense of malevolent power in Lex. He's just an irritant. Someone to move the plot forward for no good reason other than to fulfil the promise in the title. Again, not Eisenberg's fault but why did they write him this way, instead of the power-obsessed, morally bankrupt businessman we've seen in Lex before? We didn't need Less-Interesting-Joker-Lex. The arrogance of the film reminds me a little of \"Prometheus\" - another film that attempted to address big issues, but had no idea what to do with them. There's no philosophy here, no intelligence - having characters rant and rave about gods and mortals doesn't give them a coherent philosophy or moral outlook. In \"The Dark Knight\" The Joker had an actual philosophy - a corrupted viewpoint that ran counter to Batman's. Here, I can't tell what anyone stands for. What does Lex even want? How much of this mess can be blamed on Snyder is debatable - I think the bulk of the blame should be placed on Goyer & Terrio who should never be allowed to write anything ever again, including greetings on birthday cards. However, I will say that if Snyder were a half- competent director surely he should have binned this script and brought in someone else. As for the film, I know it's made a lot of money which is actually a terrible shame. It means all of those responsible will feel it's acceptable to produce something this bad, so long as it has a big budget and impressive CGI (see also: Transformers). For me, it just isn't good enough, with this budget and these actors we deserved something better. With these iconic characters to finally show together on the big screen, we deserved something astonishing. The film-makers should be embarrassed.",
         "After reading all the negatives reviews, I still went to watch (in 3D!) this superhero battle thinking it may not be the critics' film but at least it would be some spectacular mess offering some guilty superhero fun. (Short answer: No. Not fun. Not even spectacular. Just long boring mess!) First things first! There is not much of a \"battle\" (physical or psychological) b/w Batman & Superman! They just fight once, and it goes exactly as anyone would have expected! Batman trying somethings - boom boom - which doesn't work and then hint: Kryptonite! It's not even like cinematography or awesome background music is taking the film forward (like say Zack Snyder's Sucker Punch) to keep you rooted! It just keeps on going taking. Taking itself seriously. And then keeps on going even longer! Essentially what happens is a guy does some hocus-pocus and creates a monster and these three super-things kill it. And just so that you know this is actually the whole movie for you. There's actually no role of wonder-woman in this film other than that shown in the trailers. Nothing! She shows up a few times and bam! directly at the final fight which was quite lethargically choreographed to say the least. Batman is loosely played by Ben Affleck wearing his famous scowl, but I wouldn't blame him as there is actually not much for him to do. Script has snatched away from everyone of any possibility of giving any good performances. Lois Lane is always the damsel in distress saved by Superman! Superman plays superman doing nothing at all. And there's much time given to their romance which nobody cares about. And if you have noticed even I have been writing this long about nothing but ranting my frustration because there's, as you guessed right, nothing concrete to criticize about in this two and a half hour long alarming amount of pretension on the name of a battle! And at last Superman is dead and all you are left thinking is \"I don't give a f*** about it!\"",
         "When I rate movies (and yes, this review contain spoilers) I usually have 4 main criteria. Entertainment, visuals, acting, and plot/story. Each with around 2,5p each equal 10p in total. The visuals/cinematic feel of the movie were good. Not great, but good, so I give that 1,3p. The acting was actually the only really good thing about this movie. Considering what they had to work with and how badly the movie is put together the acting is actually very good, so I give that 2p. The plot(s)/story of the movie however is so bad and so crappy I should actually put in a lot of swear words here. It's a 0. This is, by far, the big budget movie with the most plot holes I have ever seen. Every single scene has at least 1 plot hole. Jimmy Olsen CIA agent? Really? Lois Lane throwing that sphere in 8ft of water. Lex JR effortlessly gaining access to an alien spaceship which gladly tells him how to build a doomsday weapon? Deus ex Martha!?!? I could go on forever. 0!! Entertainment-wise I was bored most of the movie and with so many plot holes I could not enjoy it without going cinemasins \"ding\" in my head every 5sec. Sure a lot of good action sequences and if they hadn't ruined WW appearance through trailers that would have been epic, but in general not very entertaining. Drones and kids aged 11y and below might see more entertainment in this then I did, but I need to care more about the characters and since the movie in general was so bad, I could not enjoy what could have been great action and great scenes. I still give it 0.2p, mostly due to Batmans awesome saving-Martha-rampage and WW. So 3/10 is my score which actually feels too high... so I deleted 1p due to the bad management of and horrible writing for Superman. They missed the essence of Superman, in MofSteel also, but in this movie especially. My final score is a 2. Edit: I just saw the movie again, mostly for the laugh of it and I cannot believe how bad this movie is. This is so bad we need to invent new words for it. Horrible, terrible and lots, lots, lots and lots of profanity. I change my rating to a 1, this movie deserve nothing and should be banned forever. Brrr... and uha... so, so bad... I believe that cinematic education and film studios should show this movie to people in the industry on how to not script and not edit a movie, and the director of this movie should never be allowed near anything cultural ever again. Classic example of a messy film which, for the most part, make no sense. Worst movie of 2016 so far and watching this crap only pisses me off.",
         "I didn't see the film in the theaters and just bought the \"Extended Edition \" on Amazon. I never properly saw Man of Steel- i think I rented it and watched it when already exhausted and fell asleep. I saw the mediocre user reviews and horrible reviews from critics of this film. They really have it wrong. This is the very best either Batman or Superman. It has a different take, on things. Much darker then earlier films even darker then the Christopher Nolan Batman films. First of all Christopher Nolan is an Executive Producer. So how bad could it be? I loved Sucker Punch and Zack Snyder was involved with that. So how bad could this be? Hans Zimmer did the music, so how bad could it be? I remember watching the old Superman TV shows and reading the Superman and Batman comics as a little kid and loved them, but i wouldn't call myself a \"fan boy\" of comic universes, like so many younger people today. As an older adult I will admit my favorite TV show of all time was Buffy the Vampire Slayer, but watched it on DVD only after it had finished. I saw the second of the Dark Knight series in the theater, but the other two, I watched on DVD. They were great, but not my favorite films like so many people. i also loved the first couple Superman and Batman films in the older series. Regardless, i was not waiting with baited breath to see Man of Steel or this one. I'm more of a serious film fan, who can watch Stanley Kubrick films over and over and my favorite films in the last twenty years, are Eyes Wide Shut and Intersteller, both of which i've watched multiple times. So, with that said, take it from me, the critics have this film very wrong, just as critics hated 2001: A Space Odyssey when it first came out. This film will have lasting appreciation. Surprised how much I liked Ben Afleck's Batman. it was hard to get into Henry Cavil's scrawnier looking Superman, but it grew on me. Amy Adams was great as Lois Lane, The Gal Gadol Wonder Women was amazing. Lex Luther was terrific, like Nolan's Joker. Jeremy Irons was the best Alfred ever. Holly Hunter and Diane Lane was good too. The movie had bad reviews but made a billion dollars. Hopefully everyone buys the Ultimate Edition and it breaks sales records and the film is re-appreciated. I have no idea what scenes this Ultimate Edition added, but it is pretty perfect. Now I can't wait for Wonder Woman and the Justice League and as soon as I finish writing this am going to watch Man of Steal. I'm into it now! I can only surmise that the bad reviews stem from too much expectations of the rigid fan boy types and the radical changes in tone, we see in this film. Total masterpiece of cinema, but I have a few criticisms. There are a few hollow scenes of typical Idiot cops and authorities getting everything wrong in a clich type way and it has a few filler scenes of that type and a few moments here and there that felt rushed and cheesy. Maybe not everything restored into the Ultimate Edition should have been. I wish there had been more Kevin Costner scenes.",
         "Well, I think it's safe to say that this movie was somewhat of a disappointment especially for the comic-book fans. Not saying that it's garbage or anything but this film is basically the definition of mediocrity and the term: \"all flash but no substance\". Let me start up on the things that I liked about this movie: some scenes, especially the action scenes were actually pretty good and visually pleasant, the movie has a solid amount of grit as well, also Ben Affleck's Batman was kick-ass especially on the warehouse scene but sadly all the good stuff ends there, moving on... Now for the things I disliked and hated about this movie. For starters, the movie felt rushed and disjointed, it basically crammed multiple comic-book story arcs in one movie, the pacing was also pretty damn bad, going back and forth on scenes all of a sudden, not to mention the stupid amount of plot holes in this movie. I also hated how they handled most of the characters, especially the main villain Lex Luthor(Jr?) or should I say \"discount Heath Ledger Joker\", he was just an annoying character in this movie with no actual motive whatsoever and unlike the ACTUAL Lex in the comics who is manipulative, cunning and intimidating, he ended up as a weird, spastic, socially awkward twerp that isn't scary AT ALL. Then there's the cave troll looking Doomsday, just.... ugh, honestly speaking, he was basically shoehorned in the movie because of reasons unknown and the character was pretty much wasted in the end(great f*cking job Zack and co.). Lois Lane's character was pretty bland as well, she basically did nothing in the movie and her little adventure on finding where that bullet came from didn't help either and speaking of bland characters, Superman/Clark Kent was also quite shallow and like Batman, is brooding for most of the time ever since Man of Steel, even though his character is not intended that way(again, great job Hack), he wasn't even that much of a character in his own damn movie. I even have problems with Batman's character even though he was quite badass but where's that world's greatest detective I grew up with? he got outsmarted by a retarded version of Lex Luthor for Christ's sake, not to mention that this version of Batman has no willpower or essence of justice and won't hesitate killing those who he deems guilty, unless their mother is named Martha(don't get mad, I know the meaning of that scene but it's still stupidly executed). Maybe the only character I actually liked to the fullest was Alfred so kudos for Jeremy Irons delivering a solid performance on a not so solid movie, Gal Gadot was also decent as WW but in the end I didn't care for her that much, honestly, she felt kinda shoehorned as well but it was nowhere near as bad as Doomsfail though. The fight between Bats and Supes was also somewhat disappointing, yeah it has some awesome visuals and kick-ass cinematography on the beatdown but it felt REALLY short, it didn't even last 10 minutes yet they call the main title of this movie Batman VS Superman? should've called it BS instead and I'm not even gonna bother on that forced scene on how they made up since I already explained it. They even killed-off Superman already in this movie or did they? either way it was a bad move since they already murdered his character figuratively and literally, and even if he does come back which is highly likely as evident on that ending scene, it'll just end up cheap and remove most of the tension on the upcoming films with him since they already did the death of Superman storyline, so RIP. Overall, I think Batman V Superman: Dawn of Justice was a not so decent film, was it bad? maybe, was it garbage? maybe not but it is indeed a disappointment to most comic-book and non comic-book fans out there, unless you're a zealot fanboy or you just enjoy watching these kinds of movies then I have no quarrel with you but I for one did not like this film and demand better quality than just basic fan-service. I just hope DC tries better on their next installations on their cinematic universe because I'm not too fond on how they're handling their movies right now."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Atlas Entertainment",
         "Cruel & Unusual Films"
      ],
      "summaries": [
         "The general public is concerned over having Superman on their planet and letting the \"Dark Knight\" - Batman - pursue the streets of Gotham. While this is happening, a power-phobic Batman tries to attack Superman.,Meanwhile Superman tries to settle on a decision, and Lex Luthor, the criminal mastermind and millionaire, tries to use his own advantages to fight the \"Man of Steel\".",
         "Society believes there should be no Superman because of his alien-like powers. Batman agrees and proceeds to take Superman down. Conversely, Superman fears that Batman's actions are reckless and tries to stop him. Meanwhile Lex Luthor, owner of Lex Corp, is plotting something that will destroy mankind! Will one of the heroes fall or will Lex Luthor take over Metropolis?",
         "In the wake of the destruction of Metropolis, the people try to determine whether Superman should be praised as a hero or if he should turn himself over to the authorities. Batman on the other hand sees Superman as a danger to everyone and prepares to take on the Man of Steel himself. On a side note, Lex Luthor plots to destroy mankind while mysterious Diana Prince/Wonder Woman pursues her own plans. Will one triumph over the other? Or will the world face certain doom?",
         "The world changed when mankind, the citizens of Metropolis and billionaire Bruce Wayne were witness to the awesome power of the Superman. Now 2 years later, the love affair is seemingly ended when the Man of Steel becomes involved in the complexities of international politics with lives lost amidst terrorists/rebels. As journalist Lois Lane attempts to clear his name, Senate Hearings and the media compel Superman to work within the system, the Batman escalates his war on crime seeking a means to end the potential threat of Superman and Lex Luthor appears to be pulling strings behind the scenes.",
         "Fearing that the actions of Superman are left unchecked, Batman takes on the Man of Steel, while the world wrestles with what kind of a hero it really needs."
      ],
      "budget": 250000000
   },
   "movielensId": 136864,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2016-03-23",
      "dvdReleaseDate": null,
      "directors": ["Zack Snyder"],
      "runtime": 151,
      "movieId": 136864,
      "title": "Batman v Superman: Dawn of Justice",
      "mpaa": "PG-13",
      "actors": [
         "Ben Affleck",
         "Henry Cavill",
         "Gal Gadot",
         "Amy Adams",
         "Jesse Eisenberg",
         "Diane Lane",
         "Jeremy Irons",
         "Laurence Fishburne",
         "Holly Hunter",
         "Scoot McNairy",
         "Callan Mulvey",
         "Tao Okamoto",
         "Jena Malone",
         "Brandon Spink",
         "Lauren Cohan",
         "Hugh Maguire",
         "Michael Cassidy",
         "Alan D. Purwin",
         "Dan Amboyer",
         "Rebecca Buller",
         "Harry Lennix",
         "Christina Wren",
         "Jade Chynoweth",
         "Chad Krowchuk",
         "Kevin Costner",
         "Ezra Miller",
         "Patrick Wilson",
         "Michael Shannon",
         "Charlie Rose",
         "Vikram Gandhi",
         "Andrew Sullivan",
         "Neil deGrasse Tyson",
         "Jon Stewart",
         "Soledad O'Brien",
         "Erika R. Erickson",
         "Dana Bash",
         "Nancy Grace",
         "Anderson Cooper",
         "Brooke Baldwin",
         "Carla Gugino",
         "Jason Momoa",
         "Joe Morton",
         "Ray Fisher",
         "Joseph Cranford",
         "Emily Peterson",
         "Jeffrey Dean Morgan",
         "Sammi Rotibi",
         "Hanna Dworkin",
         "Tiffany L. Addison",
         "Owais Ahmed",
         "Anish Jethmalani",
         "Tiffany Bedwell",
         "Natalee Arteaga",
         "Keith D. Gallagher",
         "Jeff Dumas",
         "Miriam Lee",
         "Alicia Regan",
         "Stephanie Koenig",
         "Ripley Sobo",
         "Richard Burden",
         "Julius Tennon",
         "Wunmi Mosaku",
         "Dennis North",
         "Kiff VandenHeuvel",
         "Mason Heidger",
         "Ahney Her",
         "Kristine Cabanban",
         "Sebastian Sozzi",
         "Kent Shocknek",
         "Ralph Lister",
         "Sammy A. Publes",
         "Jay R. Adams",
         "David Midura",
         "Jay Towers",
         "Michael Ellison",
         "Kirill Ostapenko",
         "Rashontae Wawrzyniak",
         "Tom Luginbill",
         "Dave Pasch",
         "Danny Mooney ",
         "Henry Frost III",
         "Nicole Forester",
         "Debbie Stabenow",
         "Milica Govich",
         "John Lepard",
         "Sandra Love Aldridge",
         "Graham W.J. Beal",
         "Henri Franklin",
         "Jonathan West",
         "T.J. Martinelli",
         "Chris Newman",
         "Lulu Dahl",
         "Sam Logan Khaleghi",
         "Anne Marie Damman",
         "Connie Craig",
         "Henrietta Hermelin",
         "Patrick Leahy",
         "Albert Valladares",
         "David Paris",
         "Abigail Kuklis",
         "Greg Violand",
         "Tiren Jhames",
         "Steve Jasgur",
         "Jonathan Stanley",
         "Jesse Nagy",
         "Duvale Murchison",
         "Thomas J. Fentress",
         "Coburn Goss",
         "Jeff Hanlin",
         "Gary A. Hecker",
         "Robin Atkin Downes",
         "Issac Ryan Brown",
         "Barton Bund",
         "Bailey Chase",
         "Patrick O'Connor Cronin",
         "Sonja Crosby",
         "C.T. Fletcher",
         "Ahman Green",
         "Diana Gaitirira",
         "Jalene Mack",
         "Esodie Geiger",
         "Nene Nwoko",
         "Scott Edward Logan",
         "Marcus Goddard",
         "Cruz Gonzalez-Cadel",
         "Alma Martinez",
         "Sal Lopez",
         "Marcel Shihadeh",
         "Theo Bongani Ndyalvane",
         "Satori Shakoor",
         "Ele Bardha",
         "Inder Kumar",
         "Brandon Bautista",
         "Laura Atwood",
         "Debbie Scaletta",
         "David Leach",
         "Gordon Michaels",
         "Brian Boland",
         "Taras Los",
         "Jason Hughley",
         "Sidi Henderson",
         "Meighan Gerachis",
         "Nicole Santini",
         "Axel Harney",
         "Wayne E. Brown",
         "Dante Briggins",
         "Shannon Garnett",
         "Lynch R. Travis",
         "Carmen Gangale",
         "Joe Cipriano",
         "Will Blagrove",
         "Marcelo Bem",
         "Joe Fishel",
         "Mark Edward Taylor"
      ],
      "imdbMovieId": "2975590",
      "originalTitle": "Batman v Superman: Dawn of Justice",
      "genres": [
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "youtubeTrailerIds": [
         "fis-9Zqu2Ro",
         "NhWg7AQLI_8",
         "6as8ahAr1Uc",
         "0WWzgGyAH6Y"
      ],
      "plotSummary": "Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.",
      "tmdbMovieId": 209112,
      "avgRating": 2.83067,
      "releaseYear": "2016",
      "numRatings": 2445,
      "posterPath": "/cGOPbv9wA5gEejkUN892JrveARt.jpg"
   }
}