{
   "tmdb": {
      "original_language": "nl",
      "keywords": [
         {
            "name": "housewife",
            "id": 3451
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt2542368",
      "video": false,
      "title": "Soof",
      "recommendations": [
         251671,
         427095,
         32860,
         425186,
         20141,
         251619,
         111155,
         24199,
         29602,
         76784,
         33021,
         294098,
         85277,
         324572,
         87548,
         87035,
         293974,
         83278,
         144595,
         147513
      ],
      "backdrop_path": "/pFvvz4rSIERhkGr34PMSUOtXRyk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Soof",
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f8e1",
               "name": "Lies Visschedijk",
               "profile_path": "/s4pk72c5qbgBiIr9KxEcwnRNoc.jpg",
               "id": 225052,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kasper",
               "gender": 2,
               "credit_id": "52fe4dd2c3a36847f826f8e5",
               "name": "Fedja van Huêt",
               "profile_path": "/fTlflMjAfAtncVrkgZktwVtdDPv.jpg",
               "id": 45754,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jim (as Dan Karaty)",
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f8e9",
               "name": "Dan Karaty",
               "profile_path": null,
               "id": 1235128,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bob",
               "gender": 1,
               "credit_id": "52fe4dd2c3a36847f826f8ed",
               "name": "Chantal Janzen",
               "profile_path": "/sZrata3NAORpfcRU6E9K6gAAHGk.jpg",
               "id": 115690,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Hansje",
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f8f1",
               "name": "Anneke Blok",
               "profile_path": null,
               "id": 43716,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Harm Jan",
               "gender": 2,
               "credit_id": "52fe4dd2c3a36847f826f8f5",
               "name": "Alex Klaasen",
               "profile_path": "/gwkUwJoy6UueLBpclKyeuWLfqQH.jpg",
               "id": 934256,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jan Jaap",
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f8f9",
               "name": "George van Houts",
               "profile_path": null,
               "id": 1265166,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f8ff",
               "name": "Antoinette Beumer",
               "profile_path": "/oki5pgoJr9Eyi4UbR4og9ac1tdP.jpg",
               "id": 226608,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f905",
               "name": "Sylvia Witteman",
               "profile_path": null,
               "id": 1265167,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd2c3a36847f826f90b",
               "name": "Marjolein Beumer",
               "profile_path": null,
               "id": 211061,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.514809,
      "production_countries": [{
         "iso_3166_1": "NL",
         "name": "Netherlands"
      }],
      "id": 230217,
      "vote_count": 35,
      "budget": 0,
      "overview": "Soof is reaching 40 and has everything she ever wanted: three children, a small catering business, a sweet husband Kasper and a lovely home. Until she starts asking herself: 'is this all there is'?",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         10735,
         244772,
         858,
         112160,
         634,
         437557,
         10818,
         43923,
         250124,
         513,
         11634,
         141,
         376867,
         242224,
         297762,
         27586
      ],
      "original_title": "Soof",
      "runtime": 96,
      "poster_path": "/7YMLxfGeIklnsQqNS8PvcjvEJZ8.jpg",
      "spoken_languages": [
         {
            "name": "Nederlands",
            "iso_639_1": "nl"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [],
      "release_date": "2013-12-12",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Antoinette Beumer"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Marjolein Beumer",
         "Marjolein Beumer"
      ],
      "originalLanguage": "Dutch",
      "imdbLink": "http://www.imdb.com/title/tt2542368/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMzgzMzcyMTg3NF5BMl5BanBnXkFtZTgwMzQyNzA5NDE@._V1_UY268_CR2,0,182,268_AL_.jpg",
      "actors": [
         "Lies Visschedijk",
         "Fedja van Huêt",
         "Daniel Karaty"
      ],
      "reviews": [
         "In short: Not original, but great fun. For the biggest part. Good dialogs. Chemistry between actors Lies Visschedijk and Dan Karaty. Recognizable situations for everyone being part of modern day Dutch life. And a nice feel good ending. But it loses its pace and its wit towards the end. In Long: This movie is loosely based on the columns of Sylvia Witteman (in a Dutch Newspaper De Volkskrant). Her first writing was only culinary and later on more on her life as housewife and mother. She does this with great humor, making fun of herself as chaotic, plumb, neurotic, over-the-hill woman. This \"spirit\" is used as inspiration by Marjolein Beumer to write the scenario for the movie Soof (which short for Sophie). Her sister Antoinette Beumer (Loft, De Gelukkige Huisvrouw) directs this light hearted movie. In short the plot. Soof (Lies Visschedijk), a housewife, taking care of adolescent daughter and boy twins, next to running s small catering business. Her husband Kasper (Fedja van Huêt) has a very busy business life, from which he suddenly takes a sabbatical. This coincides with the fact that Soof's business takes off. This happens because a celebrity choreograph Jim (Dan Karaty) loves her food and makes sure she gets more jobs... And from there on you probably can guess what starts evolve. And sure it does. It does at a leisurely pace and with great dialogs and funny scenes. This keeps up till two-thirds of the movie and then it loses pace and humor. Until the last five minutes when the second plot twist turn the spirits up again. And of course, the now almost obligatory, dancing by cast and crew over the end-titles. If you are non-Dutch you probably will wonder what a lot characters are doing in the movie. Well basically nothing, but they are for the most part cameos and therewith sometimes cluttering the movie. Keep your critical eyes in your pocket and you enjoy it to fullest, because it is a fun movie. It does not pretend to be more than that and can be appreciated as such.",
         "Soof is a Dutch film that really hits close to home, as my life is pretty similar to the one you see in this film—at least in some ways. Soof is a Dutch caterer who suddenly becomes a super-star caterer—and goes from barely getting by in her business to hosting party after party for the rich and famous. And, much of the film is about the difficulties she and her husband have dealing with this as well as its impact on their long marriage. Well, in our 40s, my wife went from being an unknown small-time author to world-famous and suddenly I was in the same situation as the husband, Kas. I quit my job and was now the house wife\u0085I mean, house husband. However, fortunately, our story is a bit different. I am an excellent cook, we BOTH worked on remodeling our home and we have never been happier—though I could easily see how folks in a similar situation could react much like Soof and Kas! Big change like this is hard on a marriage—especially when you've gotten yourselves into a bit of a rut. So how will this pair get themselves out of this rut or will they? This is the reason to watch the film. Soof works very well because the script is does a great job of balancing humor, drama and human nature. The way that two middle-aged married people work through this hurdle is what makes me assume the screenwriter, Marjolein Beumer, also must have lived through this sort of upheaval—or at least she really did her homework because she got it right! As a result, folks in their middle years really will enjoy the film and should be able to relate to much of it—such as the routine nature of sex (I loved where she fell asleep during this—that was really funny), the difficulty balancing a career and family as well as temptation—and Soof and Kas both have quite a bit of all these to deal with in the movie. It is fortunate that in addition to the excellent writing that the actors in the film do a great job of bringing their characters to life. Some of it is due to the writing and some due to the director and some due to just really nice acting. This is a winning comedy with a very sharp edge. My only complaint, and it's a very minor one, is that they made both Kas and Soof (particularly Kas) a bit too clueless and their characters occasionally too broad. But, on the other hand, if both had their heads on perfectly straight, there really wouldn't have been any reason for the film in the first place! Folks successfully working through such big transitions in their lives would make for a very boring motion picture!! The ones that have to struggle to reinvent themselves—that makes for an interesting film. Well worth your time and a film that sure made me smile—especially with the ridiculous but fun finale.",
         "I really liked this movie. It's a dutch comedy. The story is simple, but I didn't mind. The acting is good enough to forget that. A lot of Dutch movies aren't very good, but this one really is. It's heartwarming. I laughed out loud a lot. Lies Visschedijk is very good as Soof. But I was curious to see Dan Karaty, who is a choreograph instead of an actor. He surprised me in a good way. He was actually very good. It's a nice movie and very recognizable. I really loved the last scene. The song is still in my head, but I don't know if that's a good thing or a bad thing.",
         "\"Soof\" (2013 release from the Netherlands; 96 min.) brings the story of Soof, a woman in her late 30s who is married with three kids and wondering whether this is all there is to it. As the movie opens, we see her making love to her husband Kasper, \"now 1455 times in this marriage\". Pretty soon we understand why she is having doubts: her catering business is not doing well, her three kids (a rebellious teenage daughter and a set of young twin boys) are more than a handful, and her marriage seems on cruise control, without much passion (not in the least because her husband is always away for work). Then one day she meets an American at a party she is catering, and he falls for Soof big time. Will Soof fall for his advances? Or will she work on improving her marriage? To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all works out. Couple of comments: this movie is a rom-com with a Dutch foodie twist. The script is loosely based on the columns of well-known foodie columnist Sylvia Witteman. As a result, the movie has a strong foodie undertone, reminding me of that recent Jon Favreau movie \"Chef\". The tone of the movie is quite light and a chuckle is never far away. Much of the movie's success must be attributed to the acting performance of Lies Visschedijk in the title role. She oozes charm from start to finish and you can't help but root for her to succeed both in her love life and in her catering business. This movie was a HUGE box office smash in the Netherlands and also did quite well in several other European markets, and a sequel has been mentioned. If that is true, sign me up! I saw this movie recently at the Silverspot Cinema in Naples, FL, where a bunch of movies from the recent Palm Beach International Film Festival were featured. As it happens, the screening of \"Soof\" was done without English subtitles, due to a mistake. It didn't bother me in the least (Dutch being my mother tongue), but incredibly, the others in the theater (who were not Dutch speakers) remained for the entire screening, even without the benefit of the subtitles! If you are in the mood for a light-hearted rom-com, albeit with a Dutch twist, you cannot go wrong with this. \"Soof\" is definitely worth checking out, if you get the chance.",
         "Soof is real Dutch entertainment.If you like to spend a night having Dutch actors show their comedian skills; you might as well consider Soof worth seeing.The plot is not dragging and the speed in which the story unfolds is OK.Locations on farmhouses and at parties are well directed.Soofs plot is simple ;as are most Dutch films fit for general audiences.No complications enjoying this ,somewhat dated comedy. Aditional fun is that it supplies an American dutch actor (Dan Karaty) a small bitt part ,which he survives as a romeo. Soof comes back to her family just in time not to disappoint her children ,instead of running away with her American lover.",
         "Dutch French German, what a load of crap people, the women are board with the white men, and the men are wimps..great dads, but surprise he fails at being everything a woman wants and demands on queue. That is the story, she treats her mate like a throw away man and then comes back and he just takes her back. I baked you X so forgive me??? Explain why he takes her back, hell explain why he kisses her. This is dated,plot: I got lost and now I am back Plot....so European woman have no character and men deserve to be treated badly....."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "KeyFilm",
         "Millstreet Films"
      ],
      "summaries": ["Soof is reaching 40 and has everything she ever wanted: three children, a small catering business, a sweet husband Kasper and a lovely home. Until she starts asking herself: 'is this all there is'?"],
      "budget": 0
   },
   "movielensId": 136948,
   "movielens": {
      "languages": [
         "Nederlands",
         "English"
      ],
      "releaseDate": "2013-12-12",
      "dvdReleaseDate": null,
      "directors": ["Antoinette Beumer"],
      "runtime": 96,
      "movieId": 136948,
      "title": "Soof",
      "mpaa": null,
      "actors": [
         "Lies Visschedijk",
         "Fedja van Huêt",
         "Dan Karaty",
         "Chantal Janzen",
         "Anneke Blok",
         "Alex Klaasen",
         "George van Houts"
      ],
      "imdbMovieId": "2542368",
      "originalTitle": "Soof",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["nD9-RU6plbU"],
      "plotSummary": "Soof is reaching 40 and has everything she ever wanted: three children, a small catering business, a sweet husband Kasper and a lovely home. Until she starts asking herself: 'is this all there is'?",
      "tmdbMovieId": 230217,
      "avgRating": 2.75,
      "releaseYear": "2013",
      "numRatings": 8,
      "posterPath": "/7YMLxfGeIklnsQqNS8PvcjvEJZ8.jpg"
   }
}