{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "injury",
            "id": 158591
         }
      ],
      "imdb_id": "tt0107606",
      "video": false,
      "title": "Mother's Boys",
      "recommendations": [
         83489,
         51321,
         18856,
         122843,
         31652,
         26626,
         84116,
         61418,
         157036,
         57950,
         73249,
         91217,
         38966,
         60631,
         32013,
         27743,
         52856,
         4292,
         84658,
         19373
      ],
      "backdrop_path": "/1Pml9aneYGI2qhsahRFpWaiCH33.jpg",
      "revenue": 874,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Judith 'Jude' Madigan",
               "gender": 1,
               "credit_id": "52fe45d4c3a36847f80dcc5f",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Robert Madigan",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcc63",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Colleen 'Callie' Harland",
               "gender": 1,
               "credit_id": "52fe45d4c3a36847f80dcc67",
               "name": "Joanne Whalley",
               "profile_path": "/fvufjTvUcY6ctqryO5sks0XDav2.jpg",
               "id": 12656,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "52fe45d4c3a36847f80dcc6b",
               "name": "Vanessa Redgrave",
               "profile_path": "/hGxsPCZkwa30UE0XQdGTB9yT0jz.jpg",
               "id": 13333,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Kes Madigan",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcc6f",
               "name": "Luke Edwards",
               "profile_path": "/fAutv48tad09s8DHgUzrYuAZ33m.jpg",
               "id": 33052,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lansing, Jude's Attorney",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcc73",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mr. Fogel, Teacher",
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcc77",
               "name": "John C. McGinley",
               "profile_path": "/6AJL0ylRtJ9vcR57yEenhWHXHFt.jpg",
               "id": 11885,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d4c3a36847f80dcc7d",
               "name": "Yves Simoneau",
               "profile_path": null,
               "id": 74566,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54d74fb39251415f9c005543",
               "name": "Barry Schneider",
               "profile_path": null,
               "id": 69891,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54d74fc3c3a3683b89005668",
               "name": "Richard Hawley",
               "profile_path": null,
               "id": 1233348,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54d74fd59251416ba80052da",
               "name": "Bernard Taylor",
               "profile_path": null,
               "id": 1327021,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5a869eb3c3a3682dbf03b88d",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.288388,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41587,
      "vote_count": 21,
      "budget": 8000000,
      "overview": "Sexy but unstable wife and mother Jude walked out on her family three years ago. Now, just as suddenly, she is back. But her husband, Robert, has fallen in love with Callie, an assistant principal at his sons' school. He asks Jude for a divorce. She responds by trying to turn her three boys against Callie, then by slashing herself and blaming her rival and finally by drawing her 12-year-old, Kes, into a murderous plot.",
      "similar": [
         948,
         274,
         1696,
         25155,
         1359,
         400,
         16764,
         123109,
         158011,
         11826,
         8090,
         9299,
         2832,
         4771,
         562,
         298312,
         281957,
         8810,
         949,
         769
      ],
      "original_title": "Mother's Boys",
      "runtime": 96,
      "poster_path": "/unyDWUI98A9Tde6wkIgDc7kMDSC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": "/kaHPCUD2nQ1DGWDAH3zbYVCkTae.png",
            "name": "CBS Productions",
            "id": 2161,
            "origin_country": ""
         }
      ],
      "release_date": "1994-03-17",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "She left them three years ago. Now she's coming back... Whether they like it or not.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Yves Simoneau"],
      "runtime": 96,
      "synopsis": "Jude Madigan (Curtis) suddenly leaves her husband, Robert (Gallagher) and three sons without any explanation. Three years later, when Robert finally files for divorce, Jude returns and tries to reclaim her former life. Robert refuses and insists on the divorce. Jude does not accept Robert's decision. She tries unsuccessfully to seduce him and harasses Robert's new girlfriend, Callie. Eventually, Jude manipulates and convinces her eldest son, Kes, that Callie is the only person standing in the way of their reunited family. Influenced by Jude, Kes details a plan to his two brothers to scare off Callis, convincing the younger boys that it is just a \"game\". As the boys debate the plan, Jude's mother, Lydia (Redgrave) overhears and confronts Kes and threatens to tell their father. Kes tries unsuccessfully to convince his grandmother that it was just a \"game\" and tries to stop her from calling his dad, a brief struggle ensues and Lydia accidentally falls down the stairs. While in the hospital, Lydia tells Jude she is not about to let her go through with her plans. In a fit of rage, Jude tries to murder her mother by asphyxiation but is interrupted by a nurse, Jude flees the hospital. Meanwhile, the boys, under the guise of playing the game, handcuffs Callie and puts her on \"trial\" for destroying their family. They tie her to a chair but when the youngest boy cuts himself on a broken glass, Callie convinces the middle child to free her before his brother dies. She runs with the boy in an attempt to find a hospital. The other boys get in Callie's car and chases them, but the brakes have been cut by Jude and they go over a cliff, leaving them perched precariously on a tree on the side of the cliff. Callie manages to rescue the middle son, but as she tries to rescue Kes, she slips and is left dangling from the car. Jude rushes to \"help\" by grabbing Callie's hand from Kes. Jude intentionally lets go of Callie's hand, who still manages to hang onto the car with her other hand. However, Jude loses her balance and falls to her death. The film ends with Robert's emotional embrace of Kes, who is very shaken after having a nightmare of Jude coming back from the dead. Callie is right by Robert's side, comforting them both.",
      "writers": [
         "Bernard Taylor",
         "Barry Schneider"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107606/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BYTYyYjc0YWUtZTc2Mi00MzRmLWE4MzItYzM3M2IyNWQzNzQ1XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Jamie Lee Curtis",
         "Peter Gallagher",
         "Joanne Whalley"
      ],
      "reviews": [
         "I quite agree with positive reviews. Apparently they were not among the majority. This appears to be a movie you either love or you hate. Jamie Lee Curtis turns in a fine performance, not over the top more than necessary, full of quiet menace that explodes with enough underneath to make her psychopathy believable. On the surface, she seems in the beginning a normal person. A tic here, a turn of the lip, a set of the eyes, betrays the sickness inside her. The rest of the cast is quite good, though Peter Gallagher is less than stellar, but basically competent. Joanne Whalley is quite believable as was Lynn Redgrave. The one big problem I have is that Luke Edwards as Kes is turned to Jamie's side too quickly. His role is key, but isn't sufficiently developed. It's sketched instead, which is too bad because, in a sense this is as much his movie as Jamie's. For once, perhaps, a film was under rather than over written. The movie deserved better than it got.",
         "This is one of the numerous \"\u0085..from Hell\" movies which came out in the late eighties and early nineties following the success of \"Fatal Attraction\" (one-night-stand-from-Hell). Others in the genre include \"Pacific Heights\" (tenant-from-Hell), \"The Hand that Rocks the Cradle\" (nanny-from-Hell) and \"Single White Female\" (flatmate-from-Hell). \"Mother's Boys\" controversially presents us with Jamie Lee Curtis as the mother-from-Hell. Robert Madigan is a single father with three young sons. The reason he is single is that three years ago his wife Judith (\"Jude\") left him without explanation and disappeared from his life and that of the boys. Robert now has a new girlfriend, Callie, whom he intends to marry as soon as his divorce from Jude can be finalised. Jude, however, has other ideas. She reappears in Robert's life as abruptly as she disappeared from it and wants to resume their life together. When Robert makes it quite clear that he wants nothing more to do with her, Jude reacts with fury, mostly directed against Callie. Although Callie did not come into Robert's life until after Jude had abandoned him, Jude irrationally blames her for breaking up her marriage and comes to see her as the only obstacle standing between herself and her husband. Jude tries hard to win back the affections of her sons as part of a scheme to get revenge on Callie, even posing naked in front of her eldest boy, eleven-year-old Kes. (This tasteless scene, with its implications of paedophile incest, has come in for much well-deserved criticism. I understand, however, that in Bernard Taylor's source novel the incest was more than just implied. It will not be anywhere near the top of my list of required holiday reading this year). The first part of the film is reasonably interesting, and could have been the basis of a much better film. The two female adversaries are well characterised. (Robert, the main male character, is little more than the prize the two women fight over). Callie, played by the kitten-faced Joanne Whalley-Kilmer, is the cute girl-next door type, far more motherly than the boys' biological mother. (She works as the assistant principal at their school). The home she and Robert intend to share when they are married (the film makes it clear they are not cohabiting before marriage) is a spacious, comfortable house in the country, made of solid wood and stone. Jude, by contrast, is played by Curtis as a seductress, all high heels, tight mini-skirts and bleached-blonde hair, glamorous but hard and brassy. By contrast to Callie and Robert's Country Living style, Jude is a metropolitan type, living in an expensively over-decorated city apartment in an Art Deco block. Her talent for alienating people is such that even her own mother takes Robert's side against her. Whalley-Kilmer was at one time tipped for Hollywood stardom, especially after her fine performance in \"Scandal\", but never quite seemed to make it. Appearing in too many films like this one was probably the main reason. Jamie Lee, however, quickly bounced back from this setback; her next film was the highly successful \"True Lies\", in which she once again got to show us just what a fine body she had for a woman in her mid thirties. Peter Gallagher, as Robert, makes a rather bland hero, and Vanessa Redgrave, as Jude's mother, looks as through she can't really understand why she signed on for this film in the first place. From about halfway, however, the film starts to deteriorate and declines into lurid melodrama. I won't set out all the plot turns, but can say that they become progressively nastier and more implausible. Anyone familiar with the moralistic vice-punished-and-virtue-rewarded conventions of this particular genre will be able to work out the broad outlines of the ending. If you want to know the full gory details you will have to watch the film itself, but I doubt if you will find them very edifying. Like several unsuccessful \"\u0085.from Hell\" movies (the more recent \"Swimfan\" is another example) \"Mother's Boys\" fails because it tries too hard to shock. 4/10",
         "\"Mother's Boys\" was released quietly in theatres in 1993 before heading to video hell, where it is largely forgtten. This is unfortunate because this movie is a fine, quiet thriller, evoking a sense of mystery and horror that few films achieve. The credit goes to the director, Yves Simoneau, who directs the film with a trance like grip that gives the movie a dream like effect. His use of colors, from warm, brown and red hues connected to the happy family, to the cold blue and grey that surrounds Curtis's bitter mother, are perectly used, as is the wonderful score by George S. Clinton. The acting is solid, with jamie Lee Curtis and Joanne Whalley Kilmer giving excellent performances as the mother who wants her family back and the girlfriend striving to piece her life together. Peter Gallager, Vanessa Redgrave and Like Edwards are also memorable as Curtis's abandonded family. \"Mother's Boys\" is a film the Brits used to make in the olden days, a tense, psychological thriller that offers no easy answers. There is no real villian or hero here and that's what makes this movie stand out. I may be reaching too far here but \"Mother's Boys\" is a movie Hitchcock would be proud of.",
         "What's this? Jamie Lee Curtis is the bad guy, not the victim? Yes, she really can act (not just scream). This movie can be summed up in one word: predictable. If you've ever seen Fatal Attraction, The Hand That Rocks the Cradle, or any other film of that ilk, then you've pretty much seen this one, too. Still, it's worth watching, if for no other reason than to see Jamie Lee in the role of the psychopathic killer.",
         "Jamie Lee Curtis established her career playing the victim of homicidal maniacs,now in \"Mother's Boys\"she gets a chance to play the killer She plays a mother who walked out on her husband and children and now wants them back.The problem is that her husband is petitioning for divorce and is having an affair with a local teacher,played by Joanne Whalley-Kilmer. She sets out to try to re-capture the affections of the kids,virtually flaunting herself at the elder child and seeking to poison their minds against Dad and his new paramour. The film is predictable and the performances curiously lacklustre,even from artists of some quality. Redgrave steals the movie as the kids Grandmother but even she seems on cruise control Nothing special and for Curtis completists only",
         "Jaime Lee Curtis is one of my favorite actresses, but this movie is truly terrible. I was all excited when I saw it was coming on cable, but I couldn't believe my eyes within only 20 minutes. In the movie, Curtis plays a woman who abandons her husband and children and comes back, hoping to be welcomed back into thier lives with open arms. But she soon discovers that her husband has moved on with a new woman and wants a divorce. Then the movie gets really stupid, with childish pranks, as when Curtis spray paints \"whore\" on the side of the other woman's car. She begins stalking the family and is even able to manipulate her oldest son into helping her. There is one awful scene where her son watches her walking around naked with \"lust\" in his eyes. The movie almost tries to imply incest between a woman in her late 30s and a child in his pre-teens. I won't spoil the ending for you, but it's so stupid that you'll wish I'd warned you first.",
         "Had never really heard of this film just watched it and I must say that \"Mother's Boys\" was an okay film of suspense and drama and blended with some hot sex appeal from veteran scream queen actress Jamie Lee Curtis. Anyway the story is compelling and interesting as Jamie Lee is Jude Madigan a woman who all of a sudden has left her family that includes her husband(Peter Gallagher)and boys, and in the meantime husband and sons have built a new life with a new female friend. Years later as Jude returns as a woman scorned hell have no fury like the wrath as a dangerous obsession to get back the former life has all in danger. As Jude is just to provocative, blunt, outspoken, and crazy for anyone's own good! This little thriller is seductive and filled with suspense drama from start to finish and it was nice to see Jamie Lee so sexy in a B type movie as she strut's her stuff so well!",
         "As some people view this movie as \"horriable\" because it doesn't compare to blockbusters such as Scream - which is excusable, seeing as to who is the sociopath here - let's view this on its own merits, and not compare it to the \"good\" movies which score a 7 out of 10 on IMDb anyway. The story is deliciously freaky. Jamie Lee Curtis as a sociopath mom who returns after three years, and tries to squirm her way into the life of what used to be her family. With plenty of Whiskey-Tango-Foxtrot moments, such as the forehead-scene and the bathtub scene, people who will look no deeper than the superficial outer layer will, as clearly demonstrated before, mistake this movie for a flick of the same level as Nemesis III. The trick to understanding what it is about, is paying good attention to the actors, which brings me to my next point. Acting is nice. Luke \"Kes\" Edwards, gives a great performance, writing whole books with his eyes. His behavior throughout the movie is excellent. The bath-scene shows how uncomfortable he is being lured in by his mother. Colin Ward and Joey Zimmerman are kids. They don't act as good as the teenagers/adults do, but hey, at least it's not Jake Lloyd, right? Jamie Lee Curtis. Let's set her apart. Let's not make remarks about \"how she was better in movie x\" or how bad blonde looks on her. Let's talk about how she performs in this movie specifically. To be short: her sociopath role bleeds out of her. She's doing just fine. In the beginning she's appearing a little odd at best, but as the movie progresses, she's just getting creepy, in a way you're looking for in this movie. Atmospheres are set fine by the lighting and camera-work. The \"creepy\" parts are set by dark blue lighting and closeups, so you can read the maniacal tension from the eyes. One scene where the boys are secretly conferring among each other, is put down quite nicely as well. On their height, and up close, as if the viewer is part of the select group. These little touches make it nice. The music doesn't have a lot other than scary music. What's there is good, but it's not much, and that's something one can certainly miss. In short, if you feel like being freaked out over someone's behavior, this is a nice movie to see. The ending consists of something unexpected in the plan of the bad girl, which gives it a nice twist, although the final part of the ending is a little anti-climactic. The final shot does it, though. It's those eyes again that will leave it up to your fantasy what will happen in a few years. Even though the story is well acted out, it is still kind of old, and you just know how it's going to end. Nevertheless a nice movie to rent if you coincidentally to bump into it.",
         "Just imaging \"Kramer vs. Kramer\" gone extreme and you've got \"Mother's Boys\". The movie uses exactly the same concept of \"Kramer vs. Kramer\", of a mother who abandoned her family for 3 years but has now returned to reclaim her kids from the father. It was someone was simply saying; Hey that \"Kramer vs. Kramer\" movie is a good one, lets turn it into a thriller! It's not like the concept of the movie is a terrible bad idea but however the execution of it is. The movie offers too little big surprises and the movie surely could had used some more tension and other thriller elements. The movie is filled with some missed opportunities, they could and should had made the mother character far more psychotic and evil. She basically now gets too little psychotic to do in this movie, which causes the tension and mystery of this movie not to work out. Surprising to see how big the cast of this movie is. It's perhaps also the only reason why this movie still remains a watchable one. The actors still make the movie interesting and worthwhile to watch. Although Jamie Lee Curtis and Peter Gallagher aren't even in the same league! Jamie Lee Curtis totally outclasses Peter Gallagher so much, that at almost becomes embarrassing to watch. Jamie Lee Curtis plays a great role and she handles it just right. Joanne Whalley also pulls off alright and there are some fine supporting actors such as Vanessa Redgrave, John C. McGinley, Joss Ackland and Paul Guilfoyle but their roles are unfortunately all way too small. It's not a terribly bad movie but it's also not really one that ever surprises or leaves a big impression on you. A real lackluster and filled with many missed opportunities and wasted potential. Therefor I also can't really recommend this movie to anyone. 5/10 http://bobafett1138.blogspot.com/",
         "Here's the situation: Your wife leaves you alone with three young boys, you move on with your life, you find a beautiful woman who takes care of those boys as if they are her own, your mother-in-law takes your side, but then the mother of your children returns wanting you and the kids back into her life. Jamie Lee Curtis plays the psycho mother who beguiles her eldest son into acting as a unwitting tool in getting her back into the family and getting rid of Dad's girlfriend. Curtis does a surprisingly good job at playing the whacked out psycho mother using her children as leverage to get the father back and reclaiming her position in the household. Curtis' character is a culmination of various real women that the screenwriter no doubt pulled from newspaper stories. Curtis' character will stop at nothing to achieve her goals including putting her children in harm's way. This was an excellent film and one that you don't see too often. Normally, we are shown the father as the one who plays the deranged character leaving the mother to have to defend her children. Of course, the truth is that wives/mothers demonstrate similar despicable traits and the fact that this is revealed in the film probably disturbs people in the way that feminist's were outraged by Glenn Close's character in \"Fatal Attraction\". All the actors played believable roles and the suspense was quite good and to the point. This is definitely a must see for any father/husband who has had to deal with a lying deceitful wife and a justice system that automatically sympathizes with the mother, short of her being a crack-addict. I would have liked to have seen the film expose this outrageous injustice that fathers face on a daily basis. Even so, if you liked \"Fatal Attraction\", this film is a must see.",
         "Yves Simoneau directs this thriller. MOTHER'S BOYS actually is better than I thought it would be, in spite of not being a fan of Jamie Lee Curtis. Curtis plays a very unstable wife and mother, Jude Madigan, who turned her back on her husband, Robert(Peter Gallagher), and their three sons. After three years absence, Jude suddenly appears and wants her family back. However, Robert has moved on and has fallen in love with Callie(Joanne Whalley), an assistant principal at the Madigan boy's school. A true psychopath, Jude, goes all out to bust up Robert's romance and even puts some unscrupulous moves on her oldest young son(Luke Edwards) to carry out violence targeting Callie. She wants her sons back and Robert may just be collateral. Have to admit that Curtis comes off sexy, jealous and crazy. Also in the cast: Vanessa Redgrave, Paul Guilfoyle, Joey Zimmerman, Colin Ward and Joss Ackland.",
         "Be warned if you're one of those people who looks at the cast credits of movies and says \" hmm some fairly well known names there I think I'll watch this \" then you don't know what you're letting yourself in for . On the surface the cast list is good with well known names like Jamie Lee Curtis , Joanne Whalley , Josh Ackland and Vanessa Redgrave along with a few familiar faces like John C McGinley and Peter Gallagher but it's vital to remember that good casts don't always make good films MOTHER'S BOYS does get off to a highly entertaining start . Notice I said highly entertaining start and not a good start . It's down to the incompetence of director Yves Simoneau where we see a biology class full of children being asked to dissect frogs , so one young lad decides to give Mr Frog a damn good stabbing which causes his class mates to run around screaming . Remember the bit in NAKED GUN where OJ Simpson gets shot then he starts crashing into things ? Well we see a similar situation here where children knock things like mice cages over which contributes to even more panic . I was expecting someone to bang into a cage housing giant dinosaurs thereby letting loose a brontosaruas but sadly this doesn't happen . It's still very amusing though . As the story continues we eventually find out ( After about 40 minutes which is never a good sign ) that the plot involves divorcée Robert Madigan being stalked by his ex-wife Jude . So it's basically one of those psycho thrillers from the mid 1990s that we've seen far too many times I should warn you though that my utter distaste for this movie isn't because it suffers from a worn out premise , I saw FEAR the previous week and enjoyed it immensely , no my problem with MOTHER'S BOYS is that it contains a scene where Jude walks around naked in front of her 12 year old son then asks him to bring the phone to her as she sits in the bath . Again I refer to the incompetence of director Yves Simoneau because this scene comes across as downright objectionable since it looks like Jude is trying to seduce her son and it's this one scene more than the clichéd hackneyed plot and poor storytelling that makes this a film to avoid",
         "The only reason I even gave this movie a chance was because Peter Gallagher is one of my favorite actors. After it ended, I just sat there shaking my head wondering why he and Jamie Lee Curtis agreed to do this movie. Not one I'd sit down to again. I guess if you have nothing better to do, you could watch this film, but if you can think of ANYTHING else, do that please! I assure you, it will be more entertaining.",
         "Imagine a drama about a woman who abandoned her husband and children. The husband rebuilds his life with a good new woman. Then, years later. the errant wife returns with no warning, expects life to continue as it had done before, and takes it extremely badly when the husband makes it clear that she has no place in his new life. Imagine this scenario presented on screen as a fine, gripping drama. And now forget it, because that that's not what you're getting here. No, what Mother's Boys gives us is the most lurid melodrama imaginable, topped off with a performance of hysterical malevolence from Jamie Lee Curtis. The whole thing is so overblown, particularly the climax (which can, with justification, be called something of a cliffhanger), that hindsight encourages one to view it as, perhaps, something of a comedy - whether deliberate or inadvertent is open to debate. Overall, it's rather fun. But it's not subtle.",
         "On paper, this might seem to be just another predictable, formula thriller - the \"mother from hell\", after the \"nanny from hell\" (\"The Hand That Rocks The Cradle\") and the \"temporary secretary from hell\" (\"The Temp\"). But the screenwriters have managed to set up some psychologically complex situations and interesting character conflicts, and the French director, Yves Simoneau, shows a distinctive flair in his camerawork that makes the familiar material look much better than it should. Unfortunately, there are a few too many contrivances near the end (\"freak accidents\", cars with no brakes, etc), but the three main stars are all very fine and keep us involved in the story. (**1/2)",
         "This hidden gem is a pretty scary and well filmed thriller. And that cast is amazing - all top notch. Jamie Lee Curtis is terrific as the unhinged family abandoning mother of three boys who returns after a 3 year absence and wants her place in her family back. Unfortunately for her, her husband played by the multi talented Peter Gallagher has moved on with a young assistant principal played by the very lovely Joanne Whalley Kilmer. The young children mainly the eldest ends up a pawn in the wack job mother's plans. Vanessa Redgrave plays grandmother. The movie is quite scary and unpredictable. Not dated even though it's from the early 90s. Watch it.",
         "Well acted (Jamie Lee Curtis does a great job) and with a plot (and jump scares) that will leave you grabbing your sit, this thriller may be a bit too much for some people, specially considering that incest and pedophilia are among its themes. A disturbed woman returns to her family after being gone without any explanation for 3 years. She now wants her husband back while using her oldest son (the only one she seems to connect with) to achieve her goals. Manipulative, violent and cold as ice Curtis plays that disturbing role of this mother who seems she couldn't care less about her kids, only wishing to get back into bed with her husband. Not wanting to reveal too much here, I'll just say that I didn't find the ending completely predictable (was expecting worse, from the direction the movie was going). All in all, this was a very tense and at the same time entertaining movie. I'd advise any thriller fan to give it a try, always keeping in mind that it was done in the 90's.",
         "After three years traveling, sexy psycho mom Jamie Lee Curtis (as Judith \"Jude\" Madigan) wants to move back in with handsome husband Peter Gallagher (as Robert Madigan) and their three cute young sons. But, Mr. Gallagher has proposed to new mate Joanne Whalley-Kilmer (as Colleen \"Callie\" Harland), an assistant principal at the kids' school, who is ready for bed. But, Ms. Curtis will not to go quietly into her marriage's final good night; she demands visiting rights to \"Mother's Boys\", and casts her wicked spell over the lads and their dad. Emotionally disturbed twelve-year-old Luke Edwards (as Kes) is old enough to remember his mother's mean streak; but, Curtis decides to seduce her son into helping mom get rid of Ms. Whalley-Kilmer (as in Val). Little brothers Colin Ward and Joey Zimmerman are manipulated into assistance. The distinguished Vanessa Redgrave, playing Curtis' mother, takes a tumble while trying to help stop her daughter's nasty plan. Mainly, the story revolves around Curtis and young Edwards. They do well with their roles, but story is lacking. A sequence wherein Curtis strips to show Edwards her Cesarean scar and joins her young son in bed, may be considered offensive; but, it certainly fits Curtis' character. The real problem with \"Mother's Boys\" is that many of the characters are made to do really dumb things in the most stupid ways. The story structure renders it most unconvincing. Still, the unintentional laughs, a few exciting scenes (directed by Yves Simoneau), and nice cinematography (by Elliot Davis) make the film more entertaining than not. But, be prepared to giggle. ****** Mother's Boys (3/18/94) Yves Simoneau ~ Jamie Lee Curtis, Luke Edwards, Peter Gallagher, Joanne Whalley",
         "This was an interesting movie. Jamie Lee Curtis plays an unbalanced mom, who after leaving her husband and three children, decides to come back to take on the \"mom\" role once again. This time she has a competitive force, her husbands new fiancé. There was many oddities to this movie such as, the bathtub scene where the 12 year old was a little squeamish toward his mom being in the tub yet had a curious look as his mother walks around naked. Another thing is Vanessa Redgrave played Jude's mom but had her husbands last name. It seemed that Jamie Lee Curtis' character and her son had a strange, a little to close, relationship throughout the movie.",
         "This movie is a great example of why a guy who's gone through a bitter divorce should not try to make a Fatal Attraction-style erotic thriller. I don't know if it was the writers, the director or some studio executive, but I know that somebody vital to this production was really ticked off at his ex-wife. It's the only possible explanation for this misfire. Robert (Peter Gallagher) is a successful architect with a girlfriend (Joanne Whalley-Kilmer) and three sons. He also has a wife who left him three years ago and is only now returning because Robert has finally started divorce proceedings. Why he waited three years to do that is a whole 'nother story that isn't even touched on in this film. Judith (Jaime Lee Curtis) is fairly intense and everyone, including her own mother (Vanessa Redgrave), acts like there's something wrong with her. However, for the first 45 minutes of Mother's Boys, Judith more or less behaves like a normal woman who made a terrible mistake and wants her family back. After that first 45 minutes, Judith goes from 0 to crazy in less than 45 seconds and the rest of the story is about how she tries to turn her favorite son Kess (Luke Edwards) against Robert and his new girlfriend as part of a Rube Goldberg-esque plan to kill the girlfriend. The problem is that after that first 45 minutes, the movie could have revealed that Robert was crazy, his girlfriend was crazy, his sons were crazy or Judith's mother was crazy and it would have made as much sense as what actually happened. Mother's Boys automatically assumes the audience is going to identify Judith as the bad guy and sympathize with Robert and his hot girlfriend, so it does nothing in its first 45 minutes to establish or validate that dynamic. Characters react negatively to Judith without any justification for those reactions presented to the viewer. And while she does go eventually crazy and retroactively prove those reactions accurate, it feels arbitrary and forced. Only if you're inherently biased against the mother in divorce proceedings will you connect with the outlook in this film. Now, there's a bunch of other garden variety dumb stuff here, like Robert letting Kess spend the weekend with Judith AFTER she fakes a violent attack on herself and blames Robert's girlfriend. Judith takes a broken piece of glass and cuts her own face, yet Robert has almost no hesitation in sending his son to be with such a psycho. And Robert's the one we're supposed to be rooting for? There's also the fact that both Robert and Judith apparently thought it was okay for their very young children to play around with real handcuffs. Who lets kids play with real handcuffs? Fundamentally, though, it's the prejudice against the wife/mother character than dominates this movie and warps it into something silly and superficial. This could have made a good story but only if it was told by somebody that wasn't already angry at his ex-wife. There is some female nudity here, but mostly from an obvious body double with only a nip slip from the sensual Jamie Lee Curtis. An oddly oblique incest reference also crops up. Mother's Boys might have some use as a Rorschach Test for women dating a recently divorced guy. If he thinks this is a great film, he's probably still got a lot of rage to work out. As general purpose entertainment, it's a failure.",
         "It seems the late 80s/early 90s really thrashed the 'attractive woman from hell' storyline to death, from Fatal Attraction, Poison Ivy, Misery, Single White Female, The Hand that Rocks the Cradle etc., MOTHER'S BOYS was chronologically one of the last in the cinematic phase and quite frankly shouldn't have been made in the first place. The whole story has been done to death, This time instead of a one night stand or a new roommate, it is the abandoning mother (Jamie Lee Curtis) who wants her family back and will stop at nothing to get her way, especially when her ex (Peter Gallagher) is dating the assistant principle (Joanne Whalley) of the school their sons are going to. So Curtis's character initially plays the wholesome, reformed mother who has learned from her mistakes and manages to gain time with her sons, managing to manipulate her eldest son against the new woman in their dad's life. Vanessa Redgrave rocks up in a few scenes as the grandmother, and she not only looks out of place but is just too good of an actress to be in such a crap film and part. Jamie Lee Curtis, looking amazing, is a great actress and really tries but fails as the script lacks any development for her character or any character to interest the audience. The film flopped big time at the box office when it was released and was soon welcomed to VHS/late night TV screenings where it belonged. Give it a miss.",
         "... Not only is it offensively bad; it's also mind-numbingly obvious and poorly-paced. In the traditional three-act structure; the movie's plot should work something like this: Mother re-enters lives; Mother goes mental; problem is in some way resolved. Here, there's no gradually escalating tension, it's quite obvious that Jude is already 'barking', from the very first shot in which we see her... ! Some scenes are so sickeningly contrived it's quite obvious they've only been inserted to advance what little plot there is... Why teach your son to drive, for example, unless he's going to be in mortal danger by another 40 minutes running time??! Oh, and responsible stepmothers ALWAYS willingly allow themselves to be manacled by their young charges, just to raise the dramatic stakes... ! Rarely have I seen writing in even the cheapest of productions be so simplistic and ludicrously unbelievable... \"Mother's Boys\" can best be characterised as a third rate knock-off of such pulp-genre reliables as \"The Hand that Rocks the Cradle\"... It's amazing to think that capable actresses like Curtis and Whalley were suckered into this derivative slop - and regrettably Peter Gallagher's abject performance tarnishes their reputations almost as much as it does his!",
         "What other explanation could there be for Jamie Lee Curtis agreeing to appear in this laughably horrible \"thriller?\" She plays a mentally disturbed ex-wife and mother who returns after many years to reclaim her family. Oops! Daddy has already found a new girlfriend. Oops again! The kids like the girlfriend! Of course, mayhem ensues, right up until the literal \"cliffhanger\" ending. The director either ran out of film, or decided he couldn't possibly wrap the story up neatly, because the big climatic scene suddenly simply ends without explanation or resolution. The best part of this film is watching Jamie Lee do her best impersonation of Sharon Stone in Basic Instinct. Even if you're able to rent this one at the local video store for under a buck, you're spending too much.",
         "I like the psycho-thriller sub-genre well enough; these were the wave of psychopath movies that came out in the wake of FATAL ATTRACTION, each offering a differently positioned character - nanny, secretary, lover, boss - who would inevitably turn out to be a raging maniac with homicidal intent. MOTHER'S BOYS offers us a mother from hell, with Jamie Lee Curtis cast against type as a real weirdo. The set up is decent enough: Joanne Whalley-Kilmer is a solid protagonist, easy to sympathise with. Curtis, too, acquits herself well as villain for the change, proving to be one of those love-to-hate characters. There's some interesting psychological set-up with the children involved in this mess, and some good scenes (like that involving the frog). Unfortunately, around the halfway point, things start to fall apart. There's way too much lurid melodrama instead of real meat to the storyline, and it all begins to fall apart with plenty of style attempting to mask real substance. The ending is the worst, contrived beyond belief, but the scenes preceding it are lacking, too. I wanted more incident, more motivation, but instead I got clichés and not a lot else besides. The psycho-thriller genre is an entertaining one, but unfortunately most of the films had the misfortune to be made during the 1990s, a decade which hasn't dated well for cinema. MOTHER'S BOYS is a good example of this."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Miramax",
         "CBS Productions"
      ],
      "summaries": ["Jude Madigan abandons her husband Robert and her three sons without any explanation. Three years later Jude inexplicably returns to reunite her family. However Robert and his new lover Callie see Jude for the true psychopath she is and try their best to protect their sons. Jude embarks on a non stop stalking and harassment campaign against the family, and even seduces her eldest son Kess into committing her acts of violence."],
      "budget": 8000000
   },
   "movielensId": 136962,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-03-17",
      "dvdReleaseDate": null,
      "directors": ["Yves Simoneau"],
      "runtime": 96,
      "movieId": 136962,
      "title": "Mother's Boys",
      "mpaa": "R",
      "actors": [
         "Jamie Lee Curtis",
         "Peter Gallagher",
         "Joanne Whalley",
         "Vanessa Redgrave",
         "Luke Edwards",
         "Joss Ackland",
         "John C. McGinley"
      ],
      "imdbMovieId": "0107606",
      "originalTitle": "Mother's Boys",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["dxfmEhoKUYE"],
      "plotSummary": "Sexy but unstable wife and mother Jude walked out on her family three years ago. Now, just as suddenly, she is back. But her husband, Robert, has fallen in love with Callie, an assistant principal at his sons' school. He asks Jude for a divorce. She responds by trying to turn her three boys against Callie, then by slashing herself and blaming her rival and finally by drawing her 12-year-old, Kes, into a murderous plot.",
      "tmdbMovieId": 41587,
      "avgRating": 2.8,
      "releaseYear": "1994",
      "numRatings": 5,
      "posterPath": "/unyDWUI98A9Tde6wkIgDc7kMDSC.jpg"
   }
}