{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "clone",
            "id": 402
         },
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "perfectionist",
            "id": 164657
         },
         {
            "name": "white woman",
            "id": 199656
         }
      ],
      "imdb_id": "tt0260320",
      "video": false,
      "title": "Repli-Kate",
      "recommendations": [
         24080,
         17728,
         267457,
         32150,
         10109,
         32229,
         37850,
         206,
         74718,
         32162,
         15022,
         34777,
         18654,
         76297,
         35851,
         31063,
         20066,
         23967,
         210966,
         257568
      ],
      "backdrop_path": "/ytEcdhOPT7oPdExxJh5Hf6LoLOE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kate / Repli-Kate",
               "gender": 1,
               "credit_id": "52fe46be9251416c7508209b",
               "name": "Ali Landry",
               "profile_path": "/vq2OcMgCM1ZXLnb3hsrkqrw292q.jpg",
               "id": 72984,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Max",
               "gender": 0,
               "credit_id": "52fe46be9251416c7508209f",
               "name": "James Roday",
               "profile_path": "/kj1on6NOnJtZj8eUB2WvcjvTOEr.jpg",
               "id": 80219,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820a3",
               "name": "Desmond Askew",
               "profile_path": "/duVUWh17XHY3HCVhAOkQSGBNb4R.jpg",
               "id": 59284,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jonas Fromer / Repli-Jonas",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820a7",
               "name": "Eugene Levy",
               "profile_path": "/69IBiDjU1gSqtrcGOA7PA7aEYsc.jpg",
               "id": 26510,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Felix",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820ab",
               "name": "Todd Robert Anderson",
               "profile_path": null,
               "id": 80220,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Derek Waters",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820af",
               "name": "Ryan Alosio",
               "profile_path": "/mbdB1HHO3O2Zz3XSPThkArvzDEB.jpg",
               "id": 39170,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "President Chumley",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820b3",
               "name": "Kurt Fuller",
               "profile_path": "/rZUUgDoYTfYwbh87V7E4VVWUPlh.jpg",
               "id": 29685,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Wendy",
               "gender": 0,
               "credit_id": "52fe46be9251416c750820b7",
               "name": "Aimee Allen",
               "profile_path": null,
               "id": 80221,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Lili",
               "gender": 0,
               "credit_id": "52fe46be9251416c750820bb",
               "name": "Amandah Reyne",
               "profile_path": null,
               "id": 80222,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Brandi",
               "gender": 1,
               "credit_id": "52fe46be9251416c750820bf",
               "name": "Melissa Greenspan",
               "profile_path": null,
               "id": 80223,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Freshman",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820c3",
               "name": "Justin Shilton",
               "profile_path": "/c4xVKtbbkgsFSTsaVROoOHwnhlL.jpg",
               "id": 17417,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Stoner",
               "gender": 0,
               "credit_id": "52fe46be9251416c750820c7",
               "name": "Ned Brower",
               "profile_path": "/gJASkbpnZZEPzbztyZQarP7bqi7.jpg",
               "id": 80224,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "E.R. Doctor",
               "gender": 2,
               "credit_id": "52fe46be9251416c750820cb",
               "name": "Kent Davis",
               "profile_path": null,
               "id": 80225,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46be9251416c750820d1",
               "name": "Frank Longo",
               "profile_path": null,
               "id": 80226,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46be9251416c750820d7",
               "name": "Russ Ryan",
               "profile_path": null,
               "id": 80229,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "52fe46be9251416c750820dd",
               "name": "Stuart Gibbs",
               "profile_path": null,
               "id": 122435,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46be9251416c750820e3",
               "name": "Stuart Gibbs",
               "profile_path": null,
               "id": 122435,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 1,
               "credit_id": "5781015c92514161ab000b1b",
               "name": "Nancy Young",
               "profile_path": "/45Ofa9fi7lCiYoe52SaC2mU6244.jpg",
               "id": 1332245,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 2.869004,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 16261,
      "vote_count": 40,
      "budget": 4000000,
      "overview": "A scientist and his sidekick accidentally clone a journalist and decide to turn the mistake into Repli-Kate, their idea of the perfect woman, who loves, beer, football, and frat parties.",
      "similar": [
         1694,
         3034,
         9738,
         9426,
         126889,
         336843,
         384521,
         9383,
         22825,
         399055,
         4961,
         18111,
         817,
         818,
         8078,
         17431,
         98566,
         83542,
         44833,
         119450
      ],
      "original_title": "Repli-Kate",
      "runtime": 96,
      "poster_path": "/Es8J1nh1G68us8unJ81d1EArGu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Silver Nitrate Pictures",
            "id": 3641,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Helkon Media",
            "id": 94854,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Zide-Perry Productions",
            "id": 3169,
            "origin_country": ""
         }
      ],
      "release_date": "2002-01-18",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Every guy on campus wants a copy of Kate.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Frank Longo"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Stuart Gibbs",
         "Stuart Gibbs"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0260320/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTI0OTY5NzcxN15BMl5BanBnXkFtZTYwNDYxNDk5._V1_UY268_CR16,0,182,268_AL_.jpg",
      "actors": [
         "Ali Landry",
         "James Roday",
         "Desmond Askew"
      ],
      "reviews": [
         "I watched this movie because I had seen the bar-room scene on YouTube. It was all about Ali Landry. Forget the science that supplies the basic premise for the film, it is all hokey (though the book Landry is reading when we first meet her is a currently important text), but if you go along with the impossible premise of the story, it raises some questions that my wife and I enjoyed talking about. I wondered if some of the guys in our society would understand that this film is about them, but they don't get it, just as Landry - thinking like a man - does not get it. The film is full of stereotypes, but they are all fairly enjoyable, and together they make something that is greater than the sum of the parts. But above all - it is Landry who shines as she plays two different roles to the hilt.",
         "In \"Repli-Kate\", a college microbiologist clones a beautiful woman, takes her home, and teaches her to be the stereotypical male's ideal: A woman who is a slob, chugs brewskis, burps, curses, gobbles pizza like a pig, wants sex all the time, etc. A surprisingly enjoyable but unsophisticated little comedy romp with babe-alicious Landry as both the clone and the clonee, \"Repli-Kate\" will likely appeal most to the college crowd. (C+)",
         "This is a really dumb movie. But it's also a really FUNNY movie. The science is questionable, the plot is predictable and the acting hardly the stuff of Oscars. But the movie is a HOOT. Funny funny funny, with pretty girls and bawdy humour.",
         "If you're the type of guy who watches \"The Man Show\" and professional wrestling on TV and reads magazines like \"FHM\" or \"Maxim\", then by this movie immediately. You'll love this film. This movie is sort of an updated version of \"Weird Science\" for the guys who were the right age to love that movie when it came out in the 80s. Just like \"Weird Science\", there's the nice guy and his somewhat funny and somewhat annoying friend. Instead of being kids in high school they now work in a lab at a University (I think they filmed it at UCLA), instead of parents they have a controlling boss, and instead of a mean older brother they have something far much worse. They don't create a woman from a Barbie doll this time, they clone a real woman. So, they have the original woman to deal with. The girl is updated too. The guy and his friend mold the clone into the ultimate man in a woman's body. She loves drinking beer and watching sports. The type of guys I mentioned at the beginning of this review would do anything to be dating a girl like this. However, for everyone else, the movie does have some nice moments. Some of the actors give funny performances including Desmon Askew and (the always great) Eugene Levy. Ali Landry does a very good job in both her roles (playing the real girl and the clone). Also, the special effects for the scenes where the real girl meets her clone are fairly well done. Like I said, this movie is made for a certain type of man, but there are a few things in it that would appeal to other types of people.",
         "Very sexy and very funny. Ali Landry is terrific. I never saw her before seeing this film. The supporting cast is great as well. I only wish I could find a girl like \"Repli-Kate\" in real life. What a blast life would be with her.",
         "And actually pretty funny. The science is silly, the acting questionable, the plot predictable. But I dare you not to laugh, often and out loud. Ali is drop-dead sexy. And you have to give her credit for pulling off the dual role as well as she does. Eugen Levy has some funny moments, though he is mostly wasted in this film. The male leads are nobody anybody knows, but they do okay and get the funniest lines. The conclusion is trite and rushed; you can almost pinpoint the exact moment the budget ran out on this one. The DVD has more features than you normally would expect from a straight to video release, including some pretty goofy outtakes. All in all, if you can pick it up at a discount (my copy was less than $6), Repli-Kate is worth the price of admission.",
         "Men always dream about a 'perfect' woman, a woman who likes football, drinking beer and sex. In this film, two scientists accidentally clone a beautiful reporter and program her to be the perfect woman. But the clone is more than they bargained for and soon they find out that having sex all day isn't all fun. Things complicate even more when the original woman turns up and the boys have to deal with both women. Repli-Kate is to some extend a pretty entertaining film. The script may be predictable and the acting an directing are a bit tame, but the film manages to sustain it's charm al through to the end and provides some big laughs. I recommend watching this film with a big audience, best of all on a filmfestival. I'm pretty sure it'll only be half as funny on TV. Check it out, if you like it silly and a bit sexy. 6.5/10",
         "This movie is great... funny and sexxy... enjoyed the sex scenes Highly recommend this one.... Great date movie... she will love it. If she does not enjoy this movie then you will not enjoy being with her/him... Don't know how we missed this one at the theater. Rent it today and laugh tonight... I know it is a brainless type of movie but that is what we want ... the ability to escape the pressures of the day and give your brain some time off. It will make you feel better about yourself... An enjoyable film with action and comedy and some parts will make to laugh until you are rolling in the floor. Not to mention the opportunity to enjoy Ali Landry as Beauty & Beast. At least a B+ not an animal house but very entertaining.",
         "I don't know why exactly, but I laughed my head off watching this. Not only that, I did the same thing the second time I watched it. If a movie can make you laugh almost just as hard the second time around, it's entertainment. Movies should be entertaining. Regardless of the quality of the script, acting, actors, or the size of the budget, if it entertains, it fits the definition and should be judged on that alone. For me, this movie was great, and I gave it a high rating. While artistically, this movie was not of the same quality of other movies in which I gave the same rating, I found it to be very entertaining, and could hardly stop watching it. I was dismayed when it was finally over. I'd recommend this movie to anyone who found \"Animal House\" funny.",
         "wow.this is one of the funniest movies i have ever seen.I don't think i have ever laughed more or harder.i mean this in a good way.finally,a comedy that is not just funny,but hysterical. without giving away too much,the plot is this.Max accidentally clones a women named Kate,and he and his buddy Henry decide to to teach the clone to behave like a guy,thinking she would be the perfect woman.disaster and hilarity ensue.the beautiful and very talented Ali Landry plays the dual role of Kate and the clone Repli-Kate.Ali does an astounding job as the woman who behaves more like a man than most men.this movie is brilliant.a warning though,this movie is definitely not for young kids,due to very crude language and sexual situations. 10* out of 10",
         "Yes, this comedy is as stupid as any American-Pie-Style movie. But the difference between `Repli-Kate' and others is humor, that became more lambent. This film doesn't try to sway you, `Repli-Kate' is just sexy and funny performance! But there's only one minus - soundtrack is really worthless. And Ali Landry was at least great! She managed to combine represent two completely different characters: feminine Kate-original and Kate-clone(I really enjoy her dialogues, 'cause of her vocabulary, that contains only phrases from the movies and TV shows). So I think that Ali Landry is very talented young star. She didn't damaged by silly teen comedies and I hope that her following movies would be more serious. So, 6+/10",
         "This is just a great (albeit silly) comedy and nothing more...I had never seen nor heard of Ali Landty before, but she is not only great looking but also very convincing in her role(s). The movie itself is fast paced and short enough to keep you from being bored, since obviously there isn't a great exciting plot to keep the viewer waiting for more. 6.5/10 Rent the DVD and watch it with Friends, beer and pizza!",
         "The Acting was weak, the science was completely nonsensical, but for some strange reason, I still enjoyed myself. It was fun, as long as you weren't looking for a reason to not like it. I mean there were plenty of weaknesses in the film, but I can't believe the makers didn't know that. It's all about just telling a simple fun story. Eugene Levy looks like he was having fun.",
         "Of course, a movie showing a gorgeous girl (I had never seen this Ali Landry before), who loves sex, football and beer, may seem very \"macho\". That's exactly the feeling I had on the first minutes; quickly, the roles are reversed : the girl (the Repli-Kate) is the one who doesnt want to be romantic, who only thinks about sex and the guy (Max) is the one who has headache and who \"wants to talk\" ... This is of course a huge \"cliché\" reversal, but it is nicely done, and will make everyone laugh anyway - man and women .. until everyone realizes that what men like in women are those things they (the men) are always complaining about ;) This comedy has a lot of \"Vaudeville\" situations, especially when it ends in Jonas's house with both Kate and several ex's & suitors. Although there are some sexual suggestions in the film, it is always politically correct, not with a strong language, and it can be seen by children - who won't understand everything of course. \"Ten minutes of silence!\" (those who have seen will see what I'm talking about !)",
         "I enjoyed this movie for what it was, a mindless comedy. It's all about watching every guys dream girl and how such a thing works in real life. Although the main characters clearly failed in their conditioning of their female clone to be the perfect woman, instead making her instead to be a woman who acts like a man. But the point is it made me laugh, and thats all I got it for.",
         "Yeah ! thats a great movie. At the beginning it not so interesting , but when Max has cloned a human beaning (Kate an student) started to be interesting. Why ? Because how Max and his friend Henry educated the Repli Kate as she were a man is like see football game, drink lots of beer and doesn't wash dishes. Max an Henry thinker that they have created a perfect women - she likes what they like. But in the mien time the real Kate have a serious crash on Max. Kate leaved her boyfriend who doesn't know about romance and biogenetic. Now Max have to womens who like him. Repli-Kate to explosive Pass some time Max and Henry decided that they were wrong to make Repli Kate kind a like man with no romance at all. The play is well written as it happens in real life and that makes me think that It's good to be.",
         "This movie rocks! I enjoyed every minute and those sick things in the movie just enhanced my feelings ;D WONDERFUL MOVIE! GOOD ACTORS AND GOOD PLOT. I HAVE RECOMMENDED THIS TO EVERYONE! Some womenbeaty included too but the main thing is that this makes LAUGH your lungs out ;D;D",
         "I really didn't expect much when I sat down to watch this. After all, what can you expect from a movie that has \"National Lampoon\" on the cover or Eugene Levy in the cast? And to a extent I got was I expected: a \"Weird Science\" for the 21st century with a silly script and lame actors who has a problem with timing their lines. The surprise was Kate herself or rather Repli-Kate, played by Ali Landry. I loved how she played the manly Repli-Kate, burping and guzzling beer, a big contrast with the sweet Kate the journalist. I wish the movie would have gone more into the aspect of male and female stereotypes to poke fun at them, unfortunately the producers preferred to have Eugene Levy running around shouting \"penis\" to everyone.",
         "I think it was excellent because when i saw it i couldn't stop lofting and lofting , it was really same to the American pie but shore it was better and how i wonder if that part of the cloning was true and that part of the ''penis penis penis penis'' and the other part of the ''oooh sex is much better than kissing'' and ''you know what is better in a blow job , ten minutes silence''i saw it two days ago and 5 seconds after it ends i already miss it and i wont to know how do i can by it because i can't find it in any store i had search and search and if you sell DVD's in this site i wont to know how do i get it and receive it in my home in Portugal",
         "Ok, it´s been done before (Weird Science, Multiplicity to name a couple), but the new twist is conditioning a girl to like the things guys like. And that´s funny! It´s a totally far out situation to see a girl act like a guy and that´s were 90% of the laughs fall. The rest fall in the usual Three´s Company mixups and is largely predictable. My main problem with the movie is Ali´s acting. In the beginning she really doesn´t seem comfortable acting her new role; she gets better at it though. Well worth watching! If for no other reason than to see how guys would cower if their girl acted like them.",
         "Is it possible to _not_ laugh of the movie? Great acting if i must say so.. Ali Landry playing as a sexy and natural woman, trying to find the right one and the right job inside genetics... Well, _most_ men's aint always looking for that type of girl, but those who do, got some brain.. :) No wonder why this movie was as cool as i thought it would be.. those who produced this movie also produced my all time favorite comics, American Pie 1 & 2! A top notch this one.. alltho you sure get abit confused in the end by all the clones and the chit chat, but still, a TOP NOTCH! :) Don't miss this one..!",
         "There are movies which go directly to video in the UK (and the US) without deserving such a fate. And then there are movies like \"Repli-Kate,\" which was apparently billed as coming from the producers of \"American Pie,\" but also comes from the writers and directors of movies no one's seen. Anyway, this so-called comedy has two university genetics assistants working on a cloning project under arrogant Eugene Levy; one of them, through circumstances I just can't be bothered to go over, gets a few drops of a \"Popular Science\" reporter's blood onto a glass slide and replicates said reporter. Does said reporter look like Vanessa Feltz? No, of course not; she looks like the Once and Forever Doritos Girl - no one would watch (or finance) this movie if she wasn't fanciable. As the reporter and her clone, Ali Landry isn't the worst person in the history of film to play twins; it has to be said, though, that her remarkable looks are among the movie's few real plusses among a whole ton of minuses, from its stereotyping of both men and women to some painfully crass humour (though not quite as much as there could have been) - even Eugene Levy can't get much laughs out of a script that includes such gems as a genetic research firm based in Rome called \"GenItalia,\" and excludes anything resembling sense. But what finally dooms \"Repli-Kate\" is its stunningly obvious \"lessons,\" i.e. Be Careful What You Wish For, You Might Get It; Men Changing Women Is Never A Good Idea; etc. Even the games it plays with stereotypes are fumbled because all the characters are stereotyped themselves - the movie tries to have it both ways and ends up pleasing nobody. But if your idea of fun is watching Ali Landry belching and wetting herself, knock yourself out... and I pity you. Of course, if your idea of fun is watching Ali Landry running around in lingerie, which she does on several occasions in this movie...",
         "My God. This is an awful film. How anyone thought this would be a success is beyond me. Landry looks like a fish out of water (a fish with a good body, I'll have you, but a fish nonetheless), and the direction and script are frankly laughable. A definate no-go for anyone who does not wish to undergo the same horrible experience as yours truly. 0/10",
         "First of all, this is a bad film. Its only redeeming quality is Eugene Levy. Other than Mr. Levy, this is a very bad copy of Weird Science. The guys in this film are the type of people I would like to see killed in the next university shooting. They are obnoxious, sexist and stupid. The dialog is painful. The cinematography is like an after school TV special as is the acting. Oh the acting! Check out Kate's entrance when she is first created! Embarrassing... possibly the most embarrassing performance by any amateur actress ever! It is also the reason we have never seen Ali Landry again in a major film. It is not the worst film ever made but it is bad. It is best viewed when drinking or sick so that the pain can be numbed a little. You have been warned. Oh, yes I forgot to mention the \"special effects\"... it looks like they couldn't afford a smoke machine so smoke is created by a guy with a cigar off-screen. Other special effects include \"sparks\" which look like they were made by a kid's birthday cake sparkler. Combine this bad film making with bad acting and you have something almost as bad as Tom Cats or Sin City.",
         "What a piece of trash. In summary, a scientist and his best friend accidentally clone a babe (Landry), so while waiting to figure out what they can do, she lives with them and learns life as a guy. Decent premise for a romantic comedy, right? Perhaps, but the film kept going on and on with the worst imaginable stereotypes to the point where it becomes unbearable. It beats the horse so goddamn bad, by the end of the movie it's decomposed! I can recall at least THREE near-identical scenes where the protagonist asks Replikate \"why don't we talk any more\", and she always replies something to the effect of \"who cares, let's f***\" or \"shut up, I'm trying to watch wrestling\". That's what the entire movie is about: using these ridiculous stereotype to show that guys are insensitive. The scientists keeps asking Kate (out of character, might I add) to cuddle, to talk, or to do various sentimental/romantic things that are generally attributed to girls, while she blows him off in favor of shallow things like farting and burping or any retarded cliches you can imagine. On top of the horrible script, the gags aren't even funny. This movie is clearly made to appeal to the idiot portion of the female demographic, the type that will laugh because they recognize the offensive stereotypes but aren't offended by it, instead they laugh at them simply because they're familiar elements."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Helkon Media",
         "Zide-Perry Productions",
         "Silver Nitrate Pictures"
      ],
      "summaries": [
         "A teenage scientist/lab technician named Max Fleming has just met the woman of his dreams -- beautiful, smart and sexy magazine reporter Kate Carson, who is trying to gain some scientific information from Max for an article she's working on about the lab where Max works. Unfortunately, a science geek like Max isn't Kate's type. One day, during an experiment, Max accidentally clones Kate. With the help of his buddy, Henry, Max takes advantage of the situation and transforms his Repli-Kate into a more mature and masculine-centered type of person -- a perfect mate. But when Max's maniacal boss, Dr. Jonas, has the real Kate return to finish her story on the genetic lab, Max is thrilled. Soon, Max realizes that the real Kate represents true perfection and love rather than the over-the-top Repli-Kate. Soon, the real Kate begins to fall for Max too, until she discovers Max's little secret.",
         "A scientist and his sidekick accidentally clone a journalist and decide to turn the mistake into Repli-Kate, their idea of the perfect woman, who loves, beer, football, and frat parties."
      ],
      "budget": 4000000
   },
   "movielensId": 136938,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "2002-01-18",
      "dvdReleaseDate": null,
      "directors": ["Frank Longo"],
      "runtime": 96,
      "movieId": 136938,
      "title": "Repli-Kate",
      "mpaa": "R",
      "actors": [
         "Ali Landry",
         "James Roday",
         "Desmond Askew",
         "Eugene Levy",
         "Todd Robert Anderson",
         "Ryan Alosio",
         "Kurt Fuller",
         "Aimee Allen",
         "Amandah Reyne",
         "Melissa Greenspan",
         "Justin Shilton",
         "Ned Brower",
         "Kent Davis"
      ],
      "imdbMovieId": "0260320",
      "originalTitle": "Repli-Kate",
      "genres": [
         "Science Fiction",
         "Comedy"
      ],
      "youtubeTrailerIds": ["0bqT1mAgXCE"],
      "plotSummary": "A scientist and his sidekick accidentally clone a journalist and decide to turn the mistake into Repli-Kate, their idea of the perfect woman, who loves, beer, football, and frat parties.",
      "tmdbMovieId": 16261,
      "avgRating": 2.53448,
      "releaseYear": "2002",
      "numRatings": 29,
      "posterPath": "/Es8J1nh1G68us8unJ81d1EArGu.jpg"
   }
}