{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "japan",
            "id": 233
         },
         {
            "name": "fantasy",
            "id": 2486
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "ninja",
            "id": 10278
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "naruto shippuuden",
            "id": 10724
         },
         {
            "name": "another dimension",
            "id": 12446
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "fighting",
            "id": 14955
         },
         {
            "name": "pervert",
            "id": 33656
         },
         {
            "name": "dead parents",
            "id": 168490
         },
         {
            "name": "anime",
            "id": 210024
         },
         {
            "name": "throwing star",
            "id": 214834
         },
         {
            "name": "naruto",
            "id": 215762
         },
         {
            "name": "onsen",
            "id": 224526
         }
      ],
      "imdb_id": "tt2290828",
      "video": false,
      "title": "Naruto Shippuden the Movie: Road to Ninja",
      "recommendations": [
         75624,
         17581,
         50723,
         36728,
         20982,
         16907,
         18861,
         16910,
         317442,
         347201,
         410685,
         44727,
         273653,
         44728,
         176983,
         114370,
         122401,
         44730,
         39145,
         135531
      ],
      "backdrop_path": "/pba0SuEN23ySHj2UoPb1ROL4ZBi.jpg",
      "revenue": 17322136,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Naruto",
               "gender": 1,
               "credit_id": "52fe4bd7c3a36847f8216135",
               "name": "Junko Takeuchi",
               "profile_path": "/uGoiIDVVOGx80nO3gx7rqnZm5RW.jpg",
               "id": 82055,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Sakura",
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f8216139",
               "name": "Chie Nakamura",
               "profile_path": "/c0kJUt268Q6U8KkTrOQl3pjhmdj.jpg",
               "id": 82057,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Minato",
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f821613d",
               "name": "Toshiyuki Morikawa",
               "profile_path": "/aAmwmPXJBnwTnvWVDx74OdNGo8q.jpg",
               "id": 9706,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Kushina",
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f8216141",
               "name": "Emi Shinohara",
               "profile_path": "/y0RXiPR3YF79Ea3kASYoujCFNQ2.jpg",
               "id": 81851,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Kakashi",
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f8216145",
               "name": "Kazuhiko Inoue",
               "profile_path": "/kjXAvvqaBI4rw8IKzz4fM9SGFSN.jpg",
               "id": 89968,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Masked Man",
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f8216149",
               "name": "Naoya Uchida",
               "profile_path": "/x0ZBsILN04uOAoMT8Q2eL11ukOV.jpg",
               "id": 224462,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Sasuke",
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f821614d",
               "name": "Noriaki Sugiyama",
               "profile_path": "/uUU18mgY2PbQ8OTksSwLoTX1SbM.jpg",
               "id": 82056,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hinata",
               "gender": 1,
               "credit_id": "52fe4bd7c3a36847f8216151",
               "name": "Nana Mizuki",
               "profile_path": "/fNJEGxVdku9J619GJNs6Qvel38z.jpg",
               "id": 24651,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f821611f",
               "name": "Hayato Date",
               "profile_path": "/7SQSXY0hbloZ9MUznMk1pBxQq1V.jpg",
               "id": 1067794,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bd7c3a36847f8216125",
               "name": "Yuka Miyata",
               "profile_path": null,
               "id": 1067802,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f821612b",
               "name": "Masashi Kishimoto",
               "profile_path": null,
               "id": 89963,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bd7c3a36847f8216131",
               "name": "Masashi Kishimoto",
               "profile_path": null,
               "id": 89963,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 4.90774,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 118406,
      "vote_count": 103,
      "budget": 0,
      "overview": "Sixteen years ago, a mysterious masked ninja unleashes a powerful creature known as the Nine-Tailed Demon Fox on the Hidden Leaf Village Konoha, killing many people. In response, the Fourth Hokage Minato Namikaze and his wife Kushina Uzumaki, the Demon Fox's living prison or Jinchūriki, manage to seal the creature inside their newborn son Naruto Uzumaki. With the Tailed Beast sealed, things continued as normal. However, in the present day, peace ended when a group of ninja called the Akatsuki attack Konoha under the guidance of Tobi, the mysterious masked man behind Fox's rampage years ago who intends on executing his plan to rule the world by shrouding it in illusions.",
      "similar": [
         8392,
         449176,
         51739,
         315635,
         812,
         85350,
         2108,
         8193,
         272693,
         8363,
         10229,
         320,
         346,
         3597,
         533,
         10625,
         9880,
         14282,
         10494,
         333667
      ],
      "original_title": "Road to Ninja: Naruto the Movie",
      "runtime": 109,
      "poster_path": "/yJv9pLKJ6QzxgKMjuPmLl4JhcHu.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dentsu Inc.",
            "id": 1778,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aniplex",
            "id": 2883,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shueisha",
            "id": 2918,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TV Tokyo",
            "id": 3034,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Toho",
            "id": 5897,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bandai",
            "id": 6451,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pierrot",
            "id": 3234,
            "origin_country": "JP"
         }
      ],
      "release_date": "2012-07-28",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": "/prLI2SNNkd9wcQkFh9iWXzQtR5D.jpg",
         "name": "Naruto Collection",
         "id": 23616,
         "poster_path": "/cmKBGxVSAykHsnCL27wX4PIjNZI.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": "http://www.naruto-movie.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hayato Date"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Masashi Kishimoto",
         "Masashi Kishimoto"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt2290828/",
      "coverLink": "https://ia.media-imdb.com/images/M/MV5BMTQ5MTcyNDYwMV5BMl5BanBnXkFtZTgwNzMzNzc0MjE@._V1_UX182_CR0,0,182,268_AL_.jpg",
      "actors": [
         "Junko Takeuchi",
         "Chie Nakamura",
         "Toshiyuki Morikawa"
      ],
      "reviews": [
         "Believe it or not, I have never seen anything Naruto until today. This name though, and the image of the young guy with three stripes on either side of his face, with the yellow spiky hairstyle, and wearing an orange jogging suit has long been familiar to me as a Japanese anime character. However, for some reason or another, I never got a chance nor the interest to see any TV episode nor movie from this franchise before, until my kids convinced me to bring them to watch this film this afternoon on opening day in a local mall. \"Road to Ninja\" tells a complicated story where Naruto and his friend Sakura are sent into a parallel mirror world by an evil wizard, where their deepest dreams come true. Sakura, who resents her parents meddling with her life, realizes that her parents have both died as heroes. Naruto who had lived his entire life as an orphan, now enjoys the loving presence of his parents, Minato and Kushima. Both Naruto and Sakura are still cognizant though that they are living in an illusion that needs to be broken. Powerful ninja battles ensue during the night of the red moon, the only night when the spell can be broken by a mysterious scroll, and Naruto had to invoke the Nine-Tailed Fox within him in an attempt to return their world back to how it used to be. Despite the fact that I did not even know a single fact about Naruto or his friends, I did not find it difficult to get into the groove of this story. I had to ask a question or two to my son beside me to set me straight on character relationships, but overall it was not too tough to get through. The story was told very well, without really requiring an in depth knowledge of the animated series. The flashbacks give us the necessary historical background in order to understand better the current situation the characters are in. The clarity of this story development is quite impressive considering this is already the ninth Naruto film! I can now see why this anime series had been so popular over the years. No wonder this particular installment had just become the highest-grossing Naruto film. I think I might just go watch the first film and really get acquainted with this popular series more.",
         "Road to Ninja: Naruto the Movie 6 is the sixth Part II/Shippūden film and ninth overall Naruto movie. It is also the first film with the story created by the original series creator, Masashi Kishimoto. Kishi has poured his profound ideals and morals into the Naruto series from Day 1 and Road to Ninja has pretty big ones. The movie has good action, comedy and drama and is interestingly and steadily paced. Ya know that classic plot thing where the character resents the way their life is, gets a taste of life when he gets what he wants and hates it, then things return to normal and he's grateful for what he has, RTN uses this but it goes much deeper. The film relates to the canon plot more than any other anime movie I've seen, except some DB movies. Fans of Naruto will get this, knowing how Naruto's parents died at his birth and the 9-tailed fox was sealed into him, causing him to be alone and the love he should have gotten replaced with hate and shunning. He has a sincerely happy attitude in the series, but it hits him hard in the movie which is plot-constructive. Sakura has parents but resents their annoying her all the time. Also in relation to the main plot, one of the series' main antagonist, Tobi, tests his Infinite Genjutsu on them with a prototype. The IG's goal is to make a fantasy world, making Naruto and Sakura perfect test subjects. The movie follows the jinchūriki and kunoichi learning what life would be like if they received what they wanted: Sakura's parents dead and Naruto's parents alive. The movie faces the two with the choice of running away in a dreamland or facing the harshness of life as it is and accepting reality. Naruto has what he's wanted and deserved for so long after enduring 26 or so years of hardship. That's also a main theme of the film and why it is called \"Road To Ninja\". One of the lines at the start of the movie is Naruto recalling what it means to be a Shinobi or Nnja, recalling his master saying, \"a ninja is one who endures\". It's Hilarious to see the main characters in these new personalities and dynamics and the action and emotion is top-notch as well and there's sufficient character-development. This is hands down one of the best Naruto films and like the series itself, any viewer can watch this and take something from it. Nice job Kishi. He shows that despite how we all love these characters, their Shinobi and ninjas are meant to endure, being why he puts them through this. Keep enduring guys! 10/10.",
         "This is one of the better Naruto movies. It is lacking on the action but has a solid story. I just wish the final confrontation was a little longer. It is still a Naruto movie, which means it is 100% filler but whatever, it is a fun watch just to see all your favorite characters acting differently. The p!ssed off version of Hanata is worth the price of admission. I should correct myself, Baruto is cannon. Naruto The Last Movie is filler. This film is filler but it is entertaining so whatever. I think the best thing about this film is seeing Naruto interact with his parents. Maybe that is by this film has such a cult following among Naruto fans. I haven't seen all of the Naruto films but I'm sure this is one of the best.",
         "Although I have watched this movie last year, I can't help share my thoughts on how awesome this movie is. This is by far the best among the Naruto movies. For fans of the series, like me, this is the ultimate treat. With great action sequences, plot, new takes on the characters, and some big emotional kick, this movie has it all. For the newcomers, it's just easy to catch up with the happenings. Or if you still couldn't catch up, just ask a friend who's a fan of the anime and he'll easily fill you in. I'm 18 now but I still can't stop myself from having teary eyes over this movie and that's the reason why I really loved Road to Ninja and the whole series itself.",
         "Best Naruto Movie ever. The others are OK, they're not great, but usually OK, but this one.... this is what I expected from the other movies also. The situation was very moving, how Naruto experiences how his life could've been different. I cried every time Naruto cried. It was beautiful. The plot is not very interesting, he has to fight another bad guy in that mirror world, but it had a few surprises (tha Akatsuki isn't evil, for example), but the connection between Minato, Kushina and Naruto.... the struggling hero, knowing how surreal the situation is, trying his best not get his hopes high, trying to push away his parents, and still, he can't do it... it is the saddest movie of all shippuuden movies, and it tells more about Naruto, than any other film. I'll watch it probably a hundred times more, and I will still cry.",
         "Before watching this film, i knew it would be amazingly successful and was. For the 1st 5 minutes i was caught up in the action, as the series does, every episode you watch. It is amazing how Masashi can come up with thousands of ideas, that work so well. One of the way he did so was how he changed Hinata's personality, to such a change, that you would want to avoid her, ha-ha!. Along with this the way he changed Kakashi and Gai's personality's were so funny, that i couldn't avoid laughing so loud, the neighbors wanted to find out what i was watching!The only thing i would have provided Masashi could have changed, would have been the way he showed off Shikamaru's personality. I would have expected him to create a more fluent , character, maybe he could have made Shikamaru extremely hyper, however in the film he fluked it, this being a major fluke. I believe that the next film shall be as successful as this one was.",
         "First off,this movie is incredible. From the fights,the occasional comedy to the overall story, it's a masterpiece. Considering it's from the creator of the entire series anything less is unaccepted. I'll try to omit spoilers in this summary. The movie is an original story from the world of Naruto,where Naruto and his friend Sakura are transported to an alternate reality by Madara Uchiha,where everyone they know's personality is reversed or changed. Now,Naruto and Sakura have to find a way to get out of this reality before they're stuck forever. The uniqueness of this movie to all the other Naruto movies is that for fans who've followed the series since it's conception,we get to see what Naruto truly desires which is his parents who died while trying to seal the nine tails demon that's inside him albeit to save the village in the process. We also see what it would've been like if Sakura had lost her parents instead of Naruto. All in all,if you've never seen this series and can't deal with having to see it from the beginning or wanna see why it's so popular,this is it.(though I do recommend you see it with someone who can sorta fill you in) Also for those who have been long time fans of the series,you owe it to yourself to watch it. The action scenes are great,the story feels like it could've been ripped straight from one of the comic's volumes and it's just the best Naruto movie ever.",
         "I managed to conclude Anime Month with one of the best films I've seen all month, none other than a \"Naruto\" movie. I feel bad for not watching the \"Naruto\" anime later, but I did manage to read the whole manga so I know everything that's going on. It was so great to see these classic characters in animated form again. As a huge Naruto fan, this was wonderful! Even the opening is very strong, showing us Naruto's origin! We don't see all of it, but later in the film we do get to see the whole thing. The plot's pretty simple, with Naruto and Sakura being trapped in another world by Tobi (whom everyone thought was Madara at this time). As the series went through so many changes, it was interesting to see when this took place. Apparently, it's when all the Akatsuki are dead except Tobi and Zetsu and before Kabuto resurrected them. You have to just laugh at seeing the alternate versions of all the characters, especially Hinata. My only complaint was that she only appears for a few scenes and she's my favorite character! It's still satisfying to see her threaten Sakura and even mock her for her small chest. Dang, why couldn't this movie have used her more? It's also really funny to see Tsunade and Shizune having switched cleavages! At first, Sakura is happy about this place and Naruto isn't, but their opinions are reversed when Naruto is happy to finally live some kind of life with his parents who died the day he was born. I love how everyone is aware of who Naruto's parents are in this movie. There's no reason to keep it a secret any longer. We get some great bonding with Naruto and Sakura. I had no idea that the character's name was pronounced \"Mada-ra\". I thought it was \"Ma-dare-a\". That's what I get for being an avid reader! This is the first time I saw Tobi in action in the anime. At first, I thought that the masked villain was going to turn out to be Iruka. As he was actually being unmasked, I thought it was Sasuke! I finally figured out it was an alternate version of Naruto. I did not see that twist coming at all and was glad to be surprised! Although this wasn't based on anything in the manga, it was awesome to see these characters come to life. Well, that does it for Anime Month. I saw so many wonderful films, but you'll have to wish me luck now. I'm now taking on all those awful video game movies! Pray for me! ****",
         "Road to Ninja is an excellent movie. The soundtracks in the movie are amazing and soothing. The movie focuses on a simple aspect that we humans generally want things that others have and we don't. The grass is always greener on the other side of the fence. The movie shows how sometimes we wish for some things and how once we get them we realize that it wasn't supposed to be this way. The movie makes you realize a simple truth that everything in this universe happens for a reason that you may or may not find out. But sometimes things are supposed to be the way they are because you may never know what part they play in something much greater. Frankly this movie is for those who are familiar with Naruto. Adding any spoilers for this movie's review would spoil the fun and so as a true Naruto fan I would request you to watch the movie because I am sure you will love it."
      ],
      "genres": [
         "Animation",
         "Action",
         "Adventure",
         "Fantasy"
      ],
      "productionCompanies": [
         "TV Tokyo",
         "Shueisha",
         "Pierrot"
      ],
      "summaries": ["Naruto and Sakura are captured in a parallel world by Madara, who's intentions are to steal the jinchuuriki from Naruto."],
      "budget": 0
   },
   "movielensId": 137062,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "2012-07-28",
      "dvdReleaseDate": null,
      "directors": ["Hayato Date"],
      "runtime": 109,
      "movieId": 137062,
      "title": "Naruto Shippuden the Movie: Road to Ninja",
      "mpaa": null,
      "actors": [
         "Junko Takeuchi",
         "Chie Nakamura",
         "Toshiyuki Morikawa",
         "Emi Shinohara",
         "Kazuhiko Inoue",
         "Naoya Uchida",
         "Noriaki Sugiyama",
         "Nana Mizuki"
      ],
      "imdbMovieId": "2290828",
      "originalTitle": "Road to Ninja: Naruto the Movie",
      "genres": [
         "Fantasy",
         "Animation",
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sixteen years ago, a mysterious masked ninja unleashes a powerful creature known as the Nine-Tailed Demon Fox on the Hidden Leaf Village Konoha, killing many people. In response, the Fourth Hokage Minato Namikaze and his wife Kushina Uzumaki, the Demon Fox's living prison or Jinchūriki, manage to seal the creature inside their newborn son Naruto Uzumaki. With the Tailed Beast sealed, things continued as normal. However, in the present day, peace ended when a group of ninja called the Akatsuki attack Konoha under the guidance of Tobi, the mysterious masked man behind Fox's rampage years ago who intends on executing his plan to rule the world by shrouding it in illusions.",
      "tmdbMovieId": 118406,
      "avgRating": 3.45122,
      "releaseYear": "2012",
      "numRatings": 41,
      "posterPath": "/yJv9pLKJ6QzxgKMjuPmLl4JhcHu.jpg"
   }
}